{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Pomegranate-Glazed Chicken With Tomato Salad", "description": "Of all the condiments in my overstuffed pantry, pomegranate molasses ranks among the most intense. A Middle Eastern staple, it is made from pomegranate juice simmered until nearly as thick and dark as espresso, but with even more punch. Both pickle-sour and syrupy sweet, it’s as pungent as chile paste but with the vivid bristle of tart red fruit instead of capsicum heat. In Middle Eastern cuisine, pomegranate molasses is usually tossed into salads, stirred into stews and sprinkled on vegetables and fish. In my kitchen, I especially adore it as a way to perk up mild meats like chicken. A small drizzle after you’re done grilling the meat can add just the right note of sweet-tart complexity to make everything shine.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/Grilled-Pomegranate-Glazed-Chicken/Grilled-Pomegranate-Glazed-Chicken--articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "cherry tomatoes, chicken thigh, pomegranate molasses, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 264}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 947, "unsaturatedFatContent": "47 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "71 grams", "fiberContent": "3 grams", "proteinContent": "58 grams", "saturatedFatContent": "17 grams", "sodiumContent": "1098 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 teaspoons ground cumin", "Kosher salt", "1 teaspoon sweet paprika", "1/2 teaspoon ground allspice", "Black pepper", "Large pinch cayenne", "3 pounds bone-in, skin-on chicken thighs (about 8)", "4 tablespoons extra virgin olive oil", "10 thyme branches", "7 large garlic cloves, finely chopped", "2 tablespoons, plus 2 teaspoons pomegranate molasses", "1 pint Sungold cherry tomatoes", "10 fresh basil leaves, torn into pieces if large"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine cumin, 1 1/2 teaspoons kosher salt, paprika, allspice, 1/2 teaspoon black pepper and cayenne. Place chicken in a large bowl and toss with spice mixture, 2 tablespoons extra virgin olive oil, thyme, and 6 of the chopped garlic cloves. Let rest for 30 minutes to an hour at room temperature or as long as overnight in the refrigerator. Bring to room temperature before grilling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the grill for indirect heat. For a gas grill, set one side to high. For a charcoal grill, mound coals on one side, leaving the other side empty. Brush off garlic and herbs and put chicken pieces on the unlighted or empty portion of the grill. Close cover and cook until chicken is cooked through, about 10 minutes a side. Transfer to a plate and brush generously with 2 tablespoons pomegranate molasses."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mash remaining garlic with a pinch of salt until it forms a paste. Toss the tomatoes with garlic paste, remaining 2 tablespoons extra virgin olive oil, 2 teaspoons pomegranate molasses and basil leaves. Season with additional salt, to taste. Serve alongside chicken."}], "link": "https://cooking.nytimes.com/recipes/1013738-grilled-pomegranate-glazed-chicken-with-tomato-salad"}