{"@context": "http://schema.org", "@type": "Recipe", "name": "Bruschetta With Swiss Chard and Smoked Trout", "description": "You can serve these bruschetta for lunch or dinner, or cut them into smaller pieces and serve them as appetizers. I use drained, canned smoked trout packed in oil (although it doesn’t have to be packed in oil). Don’t forget to squeeze on a little lemon juice when you serve these; it’s a perfect touch. The trout is an excellent source of omega-3 fats.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/03/29/business/30recipehealth/30recipehealth-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "Two servings", "recipeCuisine": "", "recipeCategory": "easy, quick, weekday", "keywords": "appetizer, side dish, healthy, smoked trout, swiss chard", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 365, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "4 grams", "proteinContent": "19 grams", "saturatedFatContent": "3 grams", "sodiumContent": "912 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound Swiss chard", "2 tablespoons extra virgin olive oil", "2 garlic cloves, 1 minced, 1 cut in half", "Salt", "freshly ground pepper", "2 thick slices whole-grain country bread (about 2 ounces each)", "4 ounces smoked trout", "Lemon wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stem the chard, and wash the leaves and stems in two rinses of water. Cut the stems in small dice. Blanch the chard leaves in salted boiling water (or steam them) for one to two minutes until tender. Transfer to a bowl of ice water, then drain and squeeze out excess water. Chop medium-fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a medium skillet. Add the chard stalks. Cook, stirring often, until tender, five to eight minutes. Stir in the minced garlic, and cook, stirring, just until fragrant, about 30 seconds. Add the chopped chard leaves, and toss together for about a minute. Remove from the heat. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly toast the bread, and rub with the cut garlic. Brush with the remaining olive oil. Top with the chard, and press down with the back of a spoon. Use a fork to flake the trout, and place on top. Squeeze on a few drops of lemon juice, and serve."}]}