{"@context": "http://schema.org", "@type": "Recipe", "name": "Coconut Kale", "description": "The kale in this recipe, adapted from Vij’s Restaurant, in Vancouver, British Columbia, is rich and fiery, sweet and salty all at once. Grilling softens the texture of the kale without entirely removing the mild bitterness of the leaves, while the marinade of coconut milk, cayenne, salt and lemon juice caramelizes in the heat to create a perfect balance of flavors. Made over a charcoal fire or even in a broiler or wickedly hot pan, it becomes a dish of uncommon flavor, the sort of thing you could eat on its own, with only a mound of basmati rice for contrast.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/29/dining/Grilled-Coconut-Kale/Grilled-Coconut-Kale-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "easy", "keywords": "coconut milk, kale, gluten-free, vegan, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 329}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 130, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "7 grams", "sodiumContent": "350 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["3 bunches kale", "3-13 1/2-ounce cans coconut milk", "1 tablespoon kosher salt", "1 teaspoon ground cayenne", "1 teaspoon mild paprika", "1/4 cup freshly squeezed lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the kale thoroughly and cut out the stalks. Cut the wide leaves into strips the width of the small leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot set over a low flame, heat the coconut milk until it is thoroughly mixed and just lukewarm. Transfer to a large, nonreactive bowl and add the remaining ingredients. Stir in the kale, cover with plastic wrap and refrigerate for at least 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a grill or a cast-iron grill pan over high heat. Remove the kale from the refrigerator and stir to make sure the leaves are well covered in marinade. Using metal tongs, place the kale on the grill in a single layer. Cook for 45 to 60 seconds, or until the leaves are sizzling, then turn over and grill the other side for another 45 to 60 seconds, or until the leaves have visibly softened. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1013331-coconut-kale"}