{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato Frittata With Fresh Marjoram or Thyme", "description": "One of my summer favorites, this frittata makes a perfect and substantial meal served cold or at room temperature.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/08/24/health/24recipehealth_600/24recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "Four to six servings", "recipeCuisine": "italian", "recipeCategory": "breakfast, brunch, dinner, lunch", "keywords": "appetizer, main course, eggs, tomato, gluten-free, healthy, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 134}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 138, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "1 gram", "proteinContent": "10 grams", "saturatedFatContent": "2 grams", "sodiumContent": "398 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 pounds ripe, locally grown tomatoes", "1 or 2 garlic cloves (to taste), minced or puréed", "Salt", "freshly ground pepper", "1 tablespoon fresh marjoram leaves or 2 teaspoons fresh thyme leaves", "8 large eggs", "2 tablespoons low-fat milk", "1 tablespoon extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the tomatoes into two batches. Slice one batch into rounds (about 1/3 inch thick), and seed and chop the other batch. Toss the chopped tomatoes in a bowl with the garlic and salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a bowl, and stir in salt and pepper to taste, milk and half the marjoram or thyme. Stir in the chopped tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium-high heat in a 10-inch heavy nonstick skillet. Hold your hand above it; it should feel hot. Drop a bit of egg into the pan; if it sizzles and cooks at once, the pan is ready. Pour in the egg mixture. Tilt the pan to distribute the eggs evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the frittata with a wooden or plastic spatula in your other hand, so as to let layers of eggs form during the first few minutes of cooking. Once a few layers of egg have cooked, arrange the tomato slices on top of the frittata, turn the heat down to low and cover the pan. (Use a pizza pan if you don’t have a lid that will fit your skillet.) Cook 10 minutes, shaking the pan gently every once in a while. From time to time, remove the lid and loosen the bottom of the frittata with the spatula, tilting the pan so that the bottom doesn’t burn. The eggs should be just about set; cook a few minutes longer if they’re not."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the broiler. Uncover the pan and place under the broiler, not too close to the heat, for one to three minutes, watching carefully to make sure the top doesn’t burn. (At most, it should brown very slightly and puff under the broiler.) Remove from the heat, shake the pan to make sure the frittata isn’t sticking, and allow it to cool for 5 to 15 minutes. Sprinkle on the remaining marjoram or thyme. Loosen the edges with the spatula. Carefully slide from the pan onto a large round platter. Cut into wedges. Serve hot, warm, at room temperature or cold."}], "link": "https://cooking.nytimes.com/recipes/1013229-tomato-frittata-with-fresh-marjoram-or-thyme"}