{"@context": "http://schema.org", "@type": "Recipe", "name": "Salsa Verde", "description": "Danny Mena, the Mexico City native who is a chef at Hecho en Dumbo, described a good salsa as being “poignant” with heat when he spoke with Julia Moskin in 2010. This recipe for his salsa verde employs a good number of chiles — anywhere between eight and 12 — alongside a couple of pounds of tangy tomatillos.  Ms. Moskin described it as “a rounded, tomatillo-based trickle of concentrated flavor with Serrano chiles.” This cooked sauce is ready quickly, and just as good as a table sauce as it is in a larger main, like chilaquiles.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/01/dining/salsa-verde/salsa-verde-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "About 2 cups", "recipeCuisine": "mexican", "recipeCategory": "easy, quick, condiments, dips and spreads", "keywords": "gluten-free, vegan, vegetarian, serrano pepper, tomatillo, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 61}, "recipeIngredient": ["3 tablespoons vegetable oil", "2 pounds tomatillos, papery husks removed, cut in half", "8 to 12 Serrano chilies (depending on heat tolerance)", "1/2 onion, peeled", "1 garlic clove", "6 whole sprigs cilantro, stems included", "Lime juice", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide skillet, heat oil until shimmering but not smoking. Add tomatillos, chilies, onion (cut side down) and garlic. Cook over medium-high heat, turning often, until vegetables are browned, turning to black, and seared on all sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cilantro and purée with blender until smooth and creamy, adding a little water if needed to loosen. Season to taste with salt and lime juice. The sauce should be tart and spicy but rounded in flavor."}], "link": "https://cooking.nytimes.com/recipes/1013084-salsa-verde"}