{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole-Wheat Crumpets With Mock Clotted Cream", "description": "I cheat a little with the crumpets, frying them up free-form without employing crumpet or English-muffin rings. They come out flat, like pancakes, with a deep yeasty flavor and crisp crust. Though if you like molds, try using cookie cutters: hearts, diamonds, clubs and spades give the party a very “Alice in Wonderland” feel.\n\nHot crumpets beg for clotted cream. Traditional recipes call for simmering cream for a couple of hours in a double boiler, then removing and chilling the cream, or clot, that forms on top. I did this once, and it was delicious, though not entirely worth it since you can buy clotted cream, or make a fake, mascarpone-based version that’s just as good.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/Whole-Wheat-Crumpets/Whole-Wheat-Crumpets-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "british", "recipeCategory": "breakfast", "keywords": "dessert, side dish, mascarpone, whole wheat flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 343, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "3 grams", "proteinContent": "9 grams", "saturatedFatContent": "9 grams", "sodiumContent": "385 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup warm milk", "1 envelope (2 1/4 teaspoons) yeast", "1 teaspoon honey", "1 1/2 cups warm water", "1 1/2 cups whole-wheat flour", "1 1/2 cups all-purpose flour", "1 1/2 teaspoons salt", "1 teaspoon baking powder", "1 cup mascarpone", "6 tablespoons heavy cream", "Vegetable oil for cooking"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together the milk, yeast and honey. Cover the bowl with plastic wrap and let stand in a warm place until the mixture becomes foamy, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in the warm water, both flours, salt and baking powder until smooth. Cover with plastic wrap and let stand in a warm place until doubled in size, about one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the mock clotted cream, in a medium bowl, whisk together the mascarpone and cream until thick and stiff. Chill until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the crumpets, set a griddle over medium-low heat and oil it. To make flat, pancakelike crumpets, spoon the batter onto the griddle and cook for about 3 to 4 minutes on one side and 1 to 2 minutes on the other. To make the crumpets using English-muffin rings or cookie cutters, oil them liberally and place on the skillet. Spoon in batter 1/4-inch high. Let the crumpets cook until dry around the edges and bubbles have formed over the surface, about 5 to 6 minutes. Remove the rings and wipe clean. Turn crumpets over and cook until lightly browned, another 2 to 3 minutes. Re-oil the griddle and each ring before making another batch."}]}