{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Frittata With Green Peppers and Yogurt", "description": "This is an Iranian-style omelet. Iranian cooks often add saffron and yogurt to their omelets, which they bake or make on top of the stove. The beautiful bright yellow frittata will puff in the oven and then settle as it cools.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/03/03/science/03recipehealth_600/03recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves six to eight", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, easy, weekday", "keywords": "eggs, green pepper, saffron, halal, healthy, kosher, low-sodium, low sugar, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 41}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 125, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "273 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "2 medium to large green bell peppers, seeded and diced", "2 garlic cloves, pureed in a mortar with a pinch of salt", "Salt to taste", "6 large or extra-large eggs", "1/4 teaspoon freshly ground pepper", "1/8 teaspoon powdered saffron, or a pinch of saffron threads dissolved or soaked in 1 tablespoon hot water", "1 teaspoon all-purpose flour", "3/4 cup drained yogurt", "1/2 cup chopped fresh chives or finely chopped scallion"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Heat 1 tablespoon of the olive oil in a large, heavy skillet and add the peppers. Cook, stirring often, until tender, about eight minutes. Add the garlic and salt to taste, and cook, stirring until the garlic is fragrant, 30 seconds to a minute. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the remaining tablespoon of oil in a 2-quart casserole or a 9-inch cast iron skillet, brush the sides of the pan with the oil and place it in the oven. Meanwhile, beat the eggs in a large bowl and season with salt. Add the pepper, saffron water, flour and yogurt, and whisk together. Stir in the cooked peppers and the chives or scallions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the hot baking dish from the oven, brush the sides with the hot oil and pour in the egg mixture, scraping every last bit into the pan with a spatula. Bake 30 to 35 minutes until puffed and lightly colored on the top. Remove from the heat, and allow to settle for 10 minutes before serving. Serve hot, warm or at room temperature."}]}