{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Peas, Prosciutto and Lettuce", "description": "Since I began eating more plants and less meat, I’ve experimented with using small amounts of meat in ways that exploit its flavor without making it central to the dish. In this recipe — pasta with spring vegetables — the meat is literally a garnish, but one with huge impact.\n\nThat meat is prosciutto, and it’s briefly cooked in a bit of oil, which accomplishes two things: It intensifies the ham’s salty, meaty flavor, and it makes the prosciutto crisp, turning it into a nice textural foil for the tender pasta, peas and lettuce.\n\nYou do need three pans to make this dish — a small skillet, a large skillet and a large pot for the pasta — but it’s so fast that a little extra cleanup seems worth the trouble.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/03/05/dining/peapasta-still/peapasta-still-mediumThreeByTwo440-v3.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, quick, weekday, pastas", "keywords": "appetizer, main course, pasta, peas, prosciutto, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 198}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 795, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "101 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "9 grams", "proteinContent": "36 grams", "saturatedFatContent": "11 grams", "sodiumContent": "925 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt", "3 tablespoons olive oil", "2 to 3 ounces thinly sliced prosciutto, cut crosswise into 1/2-inch-wide strips", "1 pound pasta", "2 tablespoons butter", "1 shallot, minced", "Black pepper to taste", "2 cups peas, fresh or frozen", "1 head Bibb or Boston lettuce (about 6 ounces), cored, leaves cut into 3/4-inch slices", "1/2 cup chicken or vegetable stock or dry white wine, more as needed", "1 cup finely grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to boil and salt it. Meanwhile, put one tablespoon oil in a small skillet over medium-high heat. When hot, add prosciutto and cook, turning occasionally, until crisp, about 4 to 5 minutes; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When water boils, add pasta and cook until just tender; drain pasta, reserving some cooking liquid. Meanwhile, melt butter with remaining 2 tablespoons oil in a large skillet over medium heat. Add shallot and sprinkle with salt and pepper; cook until shallot begins to soften, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add peas, lettuce and stock or wine to skillet and cook until peas turn bright green and lettuce is wilted, about 5 minutes. Add pasta to pan and continue cooking and stirring until everything is just heated through, adding extra stock or some reserved cooking liquid if needed to moisten. Toss with Parmesan cheese, garnish with prosciutto, adjust seasoning to taste and serve."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Pasta With Peas, Prosciutto and Lettuce", "description": "Mark Bittman cooks pasta topped with crisp prosciutto, peas and tender greens. ", "thumbnailUrl": "https://static01.nyt.com/images/2014/03/05/dining/peapasta-still/peapasta-still-mediumThreeByTwo440-v3.jpg", "uploadDate": "2010-06-11T22:35:28.000Z", "duration": "PT2M59S"}, "link": "https://cooking.nytimes.com/recipes/1013175-pasta-with-peas-prosciutto-and-lettuce"}