{"@context": "http://schema.org", "@type": "Recipe", "name": "Brown Bread With Buckwheat and Seaweed", "description": "When in Brittany, eat oysters as the Bretons do: with Muscadet, brown bread and salted butter. It’s a felicitous marriage of flavors that is impossible to shake, even after you leave Lorient or Concarneau. In the United States, you can improvise. Most restaurants serve only unsalted butter, so you have to do your own seasoning. Whole grain or brown bread often shows up in the basket.If you bake, you can make the bread yourself. Here is a brown bread at its most elemental, a yeast bread made with a thick batter that rises only once it is in a loaf pan and yields very nice, dense slices. I added slivers of kombu (kelp) for a briny touch and some buckwheat flour, typical of Brittany, to give the bread a nutty, slightly tart edge. It begs for butter. Salted. ", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/brown-bread-buckwheat-seaweed/brown-bread-buckwheat-seaweed-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "1 loaf", "recipeCuisine": "", "recipeCategory": "", "keywords": "buckwheat flour, slivered kombu, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 19}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 236, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "1 gram", "sodiumContent": "159 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup slivered kombu", "1/2 packet dry yeast", "1 tablespoon honey", "1 1/2 teaspoons sea salt", "1/2 cup buckwheat flour", "1 1/2 cups all-purpose flour", "2 cups whole-wheat flour, more if needed", "1 tablespoon unsalted butter", "1/2 teaspoon coarse sea salt", "Salted butter, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer kombu for 10 minutes in a small saucepan with enough water to cover. Meanwhile, in a large bowl, dissolve yeast, honey and sea salt in 2 cups warm water. Set aside 10 minutes. Drain kombu well and add to yeast mixture. Stir in buckwheat flour and all-purpose flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add whole-wheat flour, 1/2 cup at a time, beating a good minute or so after each addition to make a moist, thick, elastic, sticky dough that does not quite hold its shape, adding a little more flour if needed. Dough should be too soft to handle and cling to the sides of the bowl. Beat another 2 to 3 minutes. The consistency should be almost like that of mashed potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With unsalted butter, butter a 9-by-5-by-3-inch loaf pan. Transfer dough into pan, smooth the surface, sprinkle coarse salt on top, cover lightly with a piece of parchment or wax paper and let rise until dough reaches the top of the pan, about an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Bake dough 45 minutes, until browned, then transfer pan to a rack to cool for 15 to 20 minutes. Run a knife around the edges, turn bread out onto the rack and continue cooling to room temperature before slicing. Serve with salted butter."}]}