{"@context": "http://schema.org", "@type": "Recipe", "name": "Twice-Baked Sour Cherry Pie", "description": "Here is an intensely buttery, crispy-crust pie that exudes loads of syrupy cherry nectar when you plunge in the knife. In a quirk of pie-making tradition, open-faced pies, like custards, chocolate cream or pumpkin chiffon, get the best crust — pre-baked shells that are flaky, crisp and golden. But fruit pies, baked with raw dough that is often pale and soggy, get short shrift. For a fruit-pie crust that is crunchy and flaky, with a buttery texture that absorbs the fruit’s juices without turning to mush, the secret is pre-baking the bottom crust, then adding the fruit, covering it with raw dough and baking it again.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/06/17/dining/cherrypie-still/cherrypie-still-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, sour cherry, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 341}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 486, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "15 grams", "sodiumContent": "98 milligrams", "sugarContent": "35 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 3/4 cups plus 2 tablespoons all-purpose flour, more for rolling out dough", "3/8 teaspoon kosher salt", "15 tablespoons unsalted butter, chilled and cut into pieces", "1 cup sugar", "2 to 3 tablespoons instant tapioca", "1/4 teaspoon cinnamon", "2 pounds sour cherries (about 6 cups), rinsed and pitted", "1 tablespoon kirsch or brandy", "3 tablespoons heavy cream", "Demerara sugar, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make dough: in bowl of a food processor pulse together flour and salt just to combine. Add butter and pulse until chickpea-size pieces form. Add 3 to 6 tablespoons ice water, 1 tablespoon at a time, and pulse until mixture just comes together. Separate dough into 2 disks, one using 2/3 dough, the other using the remaining. Wrap disks in plastic and refrigerate at least 1 hour (and up to 3 days) before rolling out and baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Place larger dough disk on a lightly floured surface and roll into a 12-inch circle, about 3/8-inch thick. Transfer to a 9-inch pie plate. Line dough with foil and weigh it down with pie weights. Bake until crust is light golden brown, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pie crust is baking, prepare filling. In bowl of a food processor, combine sugar, tapioca and cinnamon (use more tapioca if you prefer a thicker, more solid filling, and less if you like a looser, juicier filling). Run the motor until tapioca is finely ground. Place cherries in a bowl and add sugar and tapioca mixture. Drizzle in kirsch or brandy and toss gently to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When pie crust is ready, transfer it to a wire rack to cool slightly and reduce heat to 375 degrees. Remove foil and weights. Scrape cherry filling into pie crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place smaller disk of dough on a lightly floured surface and roll it 3/8-inch thick. Use a round cookie cutter (or several round cookie cutters of different sizes) to cut out circles of dough. Arrange circles on top of cherry filling in a pattern of your choice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush top crust with cream and sprinkle generously with Demerara sugar. Bake until crust is dark golden brown and filling begins to bubble, 50 minutes to 1 hour. Transfer pie to a wire rack to cool for at least 2 hours, allowing filling to set before serving."}], "link": "https://cooking.nytimes.com/recipes/1013181-twice-baked-sour-cherry-pie"}