{"@context": "http://schema.org", "@type": "Recipe", "name": "Carrots and Lentils in Olive Oil", "description": "This is an adaptation of a Turkish recipe, a sweet and savory combination of lentils, onions and carrots that can be served hot or at room temperature, as a main dish or a side.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/03/08/science/08recipehealth/08recipehealth-articleLarge-v2.jpg", "totalTime": "PT50M", "recipeYield": "Serves four to six", "recipeCuisine": "turkish", "recipeCategory": "dinner, easy, weekday, one pot", "keywords": "carrot, lentils, fall, winter, healthy, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 214}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 255, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "8 grams", "proteinContent": "10 grams", "saturatedFatContent": "1 gram", "sodiumContent": "690 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["1 cup brown, green or black lentils, rinsed", "3 cups water", "1/4 cup extra virgin olive oil", "1 onion, halved lengthwise, then sliced thin across the grain", "1 teaspoon coriander seeds", "4 garlic cloves, minced", "1 1/2 pounds carrots, peeled and sliced thin (about 4 cups sliced)", "1 tablespoon tomato paste dissolved in 1 cup water", "1 teaspoon sugar", "Salt to taste", "1/2 cup chopped fresh mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the lentils with 3 cups water in a saucepan, and bring to a boil. Reduce the heat, cover and simmer for 15 minutes. Set a strainer over a bowl, and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a heavy casserole or skillet. Add the onion and coriander seeds. Cook, stirring, until the onion is tender, about five minutes. Add the garlic and carrots and salt to taste. Cook, stirring, for two to three minutes until the carrots begin to soften. Stir in the dissolved tomato paste, sugar and lentils. Add 1 to 1 1/2 cups of the cooking water from the lentils (enough to cover the lentils), salt to taste and half the mint. Bring to a simmer, and simmer uncovered for 15 to 20 minutes until the lentils are tender and much of the liquid has evaporated. Taste and adjust salt. Remove from the heat, sprinkle on the remaining mint and serve, or allow to cool and serve at room temperature with cooked whole grains, like bulgur or quinoa."}]}