{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek Stuffed Tomatoes", "description": "Stuffed tomatoes are ubiquitous in Greece. They’re filled with rice and herbs, usually mint and dill, with a little shredded zucchini mixed in with the rice. I’m giving you the choice of bulgur or rice. If you can’t tolerate gluten, use the rice; if you can and prefer a whole grain, use the bulgur.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/09/01/health/01recipehealth/01recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "Serves six", "recipeCuisine": "greek", "recipeCategory": "dinner, weekday", "keywords": "healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 48}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 130, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "389 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["6 large, firm tomatoes", "1 small zucchini, shredded", "Salt", "3 tablespoons olive oil", "1 to 2 garlic cloves to taste, minced", "1/4 cup finely chopped fresh mint", "2 tablespoons chopped fresh dill or parsley", "1/2 cup rice or coarse bulgur", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the tomatoes. With a sharp paring knife, cut out the tops of the tomatoes as you would a jack-o’-lantern, leaving them intact so that you can replace them when you bake the tomatoes. Cut away the woody core, and reserve the tops. Using a small spoon, preferably a grapefruit spoon, scoop out the insides of the tomatoes. Place a strainer over a bowl, and rub the seed pods against the strainer. Discard the seeds. Finely chop the pulp. Add to the bowl with the juice. Salt the tomato shells, place them upside down on a rack set on a baking sheet, and let drain while you prepare the remaining ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the shredded zucchini with a generous amount of salt, and let drain in a colander for 10 minutes. Take up handfuls of zucchini and squeeze out as much liquid as possible. Transfer to the bowl with the tomato pulp. Add the garlic, mint, parsley or dill, and rice or bulgur. Season generously with salt and pepper. Stir in 2 tablespoons of the olive oil and let sit for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil a baking dish large enough to accommodate all of the tomatoes. Fill the tomatoes almost to the top with the stuffing, and replace the caps. Place in the oiled baking dish. Drizzle on the remaining oil. Place in the oven, and bake 45 minutes to an hour until the tomatoes are almost collapsing. Remove from the heat, and allow to cool to room temperature or serve hot."}]}