{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Bowl With Spinach or Pea Tendrils", "description": "This easy skillet dish is all about sweet spring vegetables. It easiest to find spinach in the markets, but look too for big bunches of snow pea tips, also called pea tendrils or pea shoots, which have a wonderful, sweet flavor. If you do use pea tips, use the midsection, the part that will be most tender and flavorful &mdash; the ends with the curly tendrils are too tough, as are the thick stalks. Use tongs to toss all of the greens in the pan.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/05/10/science/12recipehealth/12recipehealth-articleLarge-v2.jpg", "totalTime": "PT4M", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday, one pot", "keywords": "brown rice, green garlic, spinach, gluten-free, healthy, vegan, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 179, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "10 grams", "proteinContent": "12 grams", "saturatedFatContent": "1 gram", "sodiumContent": "976 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 bulb green garlic, trimmed of stalk", "2 tablespoons extra virgin olive oil", "1/2 pound scallions, white and light green parts only, finely chopped", "Salt to taste", "3 pounds bunch spinach 1 1/2 pounds baby spinach, stemmed and washed; or 1 large bunch pea shoots about 1 pound, thick stalks and ends with tendrils cut away", "1 tablespoon chopped flat-leaf parsley", "1 tablespoon chopped fresh mint or tarragon", "Freshly ground black pepper", "Cooked brown rice or other grains of your choice for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If the garlic has formed cloves, separate them and remove the thick shells from the tender cloves. If it has not formed cloves, just remove the outside layers. Chop coarsely. You should have about 1/4 cup chopped green garlic. If using the pea shoots, sort through and discard any budding flowers or leaves and the thin ends with the tendrils. Wash thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, heavy lidded skillet, and add the olive oil. Add the scallions, green garlic and a generous pinch of salt. Cook, stirring, until tender, two to four minutes. Working in batches, add the spinach or pea shoots and salt to taste. Turn up the heat, and toss with tongs until the spinach or pea shoots wilt enough to allow room for another batch. If using pea shoots, cover and steam two to four minutes. Spinach does not require covering; just toss in the pan until it wilts and is tender and fragrant. Add the parsley and mint or tarragon, season to taste with salt and pepper, and serve with brown rice or other grains of your choice."}], "link": "https://cooking.nytimes.com/recipes/1013596-rice-bowl-with-spinach-or-pea-tendrils"}