{"@context": "http://schema.org", "@type": "Recipe", "name": "Halibut, Chard and Potato Casserole", "description": "This is based on a comforting Majorcan dish that is traditionally made with hake, a fish that isn’t as easy to find here as halibut or Arctic char, both of which I’ve used for the dish. Pacific halibut is the type that gets the Environmental Defense Fund’s highest rating. Make sure to cover this tightly so the fish doesn’t dry out. An hour seems like a long time to cook fish, but the fish is well insulated and won’t dry out.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/11/29/science/30recipehealth/30recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "spanish", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, healthy, high fiber, nut-free, fall, gold potatoes, halibut, swiss chard, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 92}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 468, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "5 grams", "proteinContent": "35 grams", "saturatedFatContent": "5 grams", "sodiumContent": "982 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 medium onion, chopped", "2 garlic cloves, minced", "1 14-ounce can chopped tomatoes, with juice", "Salt", "freshly ground pepper", "1 generous bunch Swiss chard 1 3/4 to 2 pounds, stemmed and washed", "1 pound Yukon gold potatoes or fingerlings, scrubbed and sliced", "1 cup flat-leaf parsley leaves, chopped 1/2 cup chopped", "2 pounds Pacific halibut or Arctic char fillets", "1/2 cup dry white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil a heavy lidded casserole or Dutch oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a medium skillet and add the onion. Cook, stirring often, until tender, about 5 minutes, and stir in the garlic. Cook, stirring, until fragrant, 30 seconds to a minute. Stir in the tomatoes and salt and pepper to taste. Bring to a simmer and cook, stirring often, for 10 to 15 minutes, until the tomatoes have cooked down slightly and smell fragrant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, steam the chard for 2 to 3 minutes, until just wilted. Rinse briefly with cold water, squeeze out excess water, and chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a spoonful of the tomato sauce in the bottom of the casserole. Season the potato slices with salt and pepper and arrange in a layer in the bottom of the casserole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl toss together the chard, salt and pepper, and parsley. Lay half of this mixture over the potatoes. Season the fish fillets with salt and pepper and lay on top of the chard. Pour half the tomato sauce over the fish. Top with the remaining chard mixture and pour on the remaining tomato sauce. Pour in the wine and drizzle on the remaining olive oil. Cover tightly and place in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 1 hour, until the potatoes are tender. Serve hot or warm."}], "link": "https://cooking.nytimes.com/recipes/1013952-halibut-chard-and-potato-casserole"}