{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Tomato Soup With Basil and Farro", "description": "You overbought fresh tomatoes at the farmers' market and now you're left with a pile of overly-soft, rapidly-ripening fruit. What to do? Make a hearty, vegetable-based soup with those mushy tomatoes puréed into satiny sweetness. To mimic the creaminess of many tomato soup recipes, I often blend softly stewed tomatoes with a grain, in this case, farro. It adds an earthy flavor, and body, to make a tomato soup with bona fide stick-to-your ribs inclinations.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2011/10/19/dining/19APPE1/19APPE1-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "6 small servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, fall, farro, leek, tomato, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 225}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 208, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "8 grams", "proteinContent": "9 grams", "saturatedFatContent": "0 grams", "sodiumContent": "725 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 tablespoons plus 1/2 teaspoon kosher salt, more as needed", "1 1/2 cups farro", "3 large sprigs basil, stems and leaves separated", "3 tablespoons extra virgin olive oil, more for drizzling", "4 garlic cloves, smashed and peeled", "1 large leek, white and light green parts only, halved lengthwise and thinly sliced", "3 1/4 pounds ripe tomatoes, cored and cut into wedges", "Black pepper, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 8 cups cold water and 1 1/2 tablespoons salt into a pot and bring to a boil over high heat. Lower heat to medium, add the farro and basil stems, and cook until grains are tender but still a little chewy, about 25 minutes. Drain, reserving the liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large pot over medium-high heat. Add the garlic and cook until fragrant and golden, about 2 minutes. Stir in the leek and a pinch of salt. Reduce the heat to medium and cook leeks until soft, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the tomatoes, 1/2 teaspoon salt and 1 cup reserved cooking liquid. Bring to a simmer. Cook until the tomatoes have completely fallen apart, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an immersion blender, blender or food processor, purée the tomato mixture until smooth (you may have to do this in batches). Add half the farro and pulse until the grains are broken down and the soup is a chunky purée. Stir in the remaining farro. If the soup seems thick, add more cooking liquid. Taste and add more salt if needed. Ladle the soup into serving bowls. Drizzle with oil; top generously with black pepper and torn basil leaves."}], "link": "https://cooking.nytimes.com/recipes/1013873-fresh-tomato-soup-with-basil-and-farro"}