{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomatillo Guacamole", "description": "This is a guacamole with a punch. The roasted tomatillos blended with hot chilies add acidity and spice to the creamy avocados. It has the luxuriousness of guacamole at just over half the calories.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/17/dining/tomatillo-still/tomatillo-still-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "1 1/2 cups, serving six", "recipeCuisine": "mexican", "recipeCategory": "easy, dips and spreads", "keywords": "appetizer, avocado, tomatillo, gluten-free, healthy, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 89}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 147, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "6 grams", "proteinContent": "2 grams", "saturatedFatContent": "2 grams", "sodiumContent": "291 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound fresh tomatillos, husked", "1 jalapeño or 2 to 3 serrano chilies, seeded if desired and roughly chopped", "10 cilantro sprigs, plus additional leaves for garnish", "Salt to taste", "2 small or 1 1/2 large ripe avocados", "1 tablespoon freshly squeezed lime juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler. Cover a baking sheet with foil and place the tomatillos on top, stem side down. Place under the broiler at the highest rack setting and broil two to five minutes, until charred on one side. Turn over and broil on the other side for two to five minutes, until charred on the other side. Remove from the heat and transfer to a blender, tipping in any juice that has accumulated on the baking sheet. Add the chilies, cilantro sprigs and salt to the blender and blend to a coarse purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the avocados in half and twist the two halves apart. Scoop out the flesh into a bowl or the bowl of a mortar and pestle. Mash with a fork or pestle. Do not use a food processor or a blender, as you want to retain some texture. Stir in the lime juice, the tomatillo mixture and salt to taste and combine well. Transfer to a bowl and serve with baked or microwaved tortilla chips or crudités, or use for tacos or avocado sandwiches."}]}