{"@context": "http://schema.org", "@type": "Recipe", "name": "Rich Chocolate Cookies", "description": "This recipe for the chocolate cookies was sent to The New York Times several years ago by Mari Pfeiffer, a reader in California; it’s from the cookbook “Great Cookies,” published in 2003 by the author and teacher Carole Walter. The cookies are imbued with deep flavor from the combination of cocoa powder, unsweetened chocolate and espresso powder. Decorate them with <a href=\"http://cooking.nytimes.com/recipes/1434-royal-icing\">royal icing</a>. “Other icings — buttercream, melted white or dark chocolate or ganache — would take away from the cookie’s simple yet amazing flavor,” said Ms. Pfeiffer, who often cuts the dough into letters to spell out seasonal messages.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2015/11/19/dining/19COOKING-CHOCCOOKIES2/19COOKING-CHOCCOOKIES2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "More than 2 dozen cookies", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "dessert, dutch-processed cocoa powder, unsweetened chocolate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 230}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 121, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "4 grams", "sodiumContent": "63 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups/180 grams all-purpose flour", "2 tablespoons/11 grams sifted Dutch-processed cocoa powder", "1/2 teaspoon/2 grams baking powder", "1/4 teaspoon/1.5 grams baking soda", "1/2 teaspoon/3 grams salt", "8 tablespoons/113 grams unsalted butter, slightly softened", "1 cup/200 grams superfine sugar", "1 large egg", "1 teaspoon vanilla extract", "1 teaspoon/2 grams instant espresso powder, dissolved in 1/2 teaspoon boiling water", "3 ounces/85 grams unsweetened chocolate, melted in a double boiler", "Royal icing, for decorating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together the flour, cocoa powder, baking powder, baking soda and salt. In the large bowl of a standing mixer, beat the butter on medium speed until creamy and light in color, about 3 minutes. Add the sugar in a steady stream, continuing to beat for 2 minutes. Add the egg, vanilla and espresso mixture. Continue beating, scraping down the sides of the bowl as needed, then mix in the melted chocolate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the speed to low. Add the dry ingredients in two batches, mixing just enough to combine after each addition. Divide the dough in two and form into two flattened disks. Wrap in plastic and refrigerate at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Line two cookie sheets with parchment paper or silicone mats. Roll out the chilled dough between 2 sheets of parchment or wax paper until it is 3/16-inch thick. Cut into shapes, using cookie cutters of different sizes to use as much dough as possible. (The dough will not be as good if it is rolled out a second time.) Transfer cookies to baking sheets, 1/2 inch apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 9 to 11 minutes, rotating the sheets once to ensure even baking, or until cookies look set on top and have a slight sheen. Remove from oven and wait 2 minutes before transferring the cookies to wire racks to cool. Frost with royal icing, if desired."}]}