{"@context": "http://schema.org", "@type": "Recipe", "name": "Langoustines With Oysters and Seaweed", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2011/11/06/magazine/06eat2/06eat2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 to 4 servings", "recipeCuisine": "scandinavian", "recipeCategory": "dinner, quick", "keywords": "appetizer, langoustines or jumbo shrimp, oyster, seaweed", "aggregateRating": null, "recipeIngredient": ["1 piece dried seaweed, like dulse or kombu", "1/4 pound shucked oysters, with their juice", "1/2 cup fresh parsley leaves and small stems, roughly chopped", "1/2 cup plus 2 tablespoons neutral oil (like grapeseed or corn)", "Lemon juice to taste", "Salt", "3 tablespoons butter", "1/2 cup coarse dark-rye-bread crumbs", "8 langoustines or large shrimp, shelled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulverize the seaweed in a coffee grinder and set aside. Strain the oysters, reserving their juice; check to make sure there are no bits of shell remaining."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the oysters and parsley in a blender or small food processor and purée, adding 1/2 cup of the oil in a slow, steady stream to form an emulsion. Strain if you like (it’s a nice refinement but not entirely necessary). Adjust the consistency as necessary with the oyster juice; it should be creamy, but a dollop should hold its shape. Season to taste with lemon juice and a little salt if necessary; keep cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 tablespoons of the butter in a large skillet over medium heat; when it melts, add the bread crumbs and toast, stirring frequently, until quite dark. Season with salt and drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a nonstick skillet over high heat until quite hot. Add the remaining 2 tablespoons oil and then the shellfish and a sprinkle of salt; cook undisturbed until lightly browned, about 2 minutes. Turn, add the remaining 1 tablespoon butter to the pan and cook for less than 10 seconds more; the shrimp will be crisp on one side and cool on the other. Remove from the pan and sprinkle with the pulverized seaweed and the bread crumbs and serve with the sauce."}]}