{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato and Onion Frittata", "description": "This dish is based on the classic omelet of Spain, tortilla espa&ntilde;ola. In the authentic dish, the potatoes are fried, and most recipes call for copious amounts of oil. In this version, I steam the potatoes to cut down on oil and use a waxier variety of potato with a lower glycemic index. Waxier potatoes also have a better texture when steamed instead of fried.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/12/14/science/17recipehealth/17recipehealth-articleLarge-v3.jpg", "totalTime": "PT8M", "recipeYield": "Serves 10 as a tapa", "recipeCuisine": "", "recipeCategory": "easy, lunch, weekday", "keywords": "appetizer, side dish, eggs, potato, gluten-free, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 204}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 107, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "211 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound boiling potatoes, peeled if desired and cut in small dice (1/2 to 3/4 inch)", "2 tablespoons extra virgin olive oil", "1 medium yellow or red onion, finely chopped", "Salt", "freshly ground pepper to taste (about 3/4 teaspoon)", "6 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the potatoes until tender, about eight minutes, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 1 tablespoon of the olive oil over medium heat in a heavy 10-inch nonstick skillet, and add the onions and a generous pinch of salt. Cook, stirring, until tender but not browned, about five minutes. Add the potatoes to the pan, and toss together gently so that the potatoes don&rsquo;t break apart. Season generously with salt and pepper. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a bowl, and add 1/2 teaspoon salt and a generous amount of freshly ground pepper. Stir in the potatoes and onions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pan to the stove, and heat the remaining olive oil over medium-high heat. Drizzle in a drop of egg; when it sizzles and cooks at once, scrape the eggs and vegetables back into the pan. Shake the pan gently while you lift the edges of the frittata, and tilt the pan to let egg run underneath and set. When the bottom of the frittata has set, turn the heat to low and cover the pan. Cook gently for 10 minutes. Meanwhile, heat the broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the pan, and slide under the broiler for a minute or two (watch closely) to set the top. Remove from the heat. Let the tortilla set in the pan for a few minutes, then slide out onto a serving plate. Allow to cool to room temperature, and cut into small diamonds to serve as hors d&rsquo;oeuvres."}]}