{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggs in Purgatory", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2014/05/20/dining/Eggs-in-Purgatory/Eggs-in-Purgatory-articleLarge.jpg", "totalTime": "PT5H15M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "italian", "recipeCategory": "dinner, project, sauces and gravies", "keywords": "boneless pork shoulder, eggs, polenta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 36}, "recipeIngredient": ["Chestnut Polenta With Ragù alla Napoletana", "Eggs", "Ricotta Salata", "Lardo", "1 pound boneless pork shoulder, cut into large chunks", "8 ounces pork belly, cut into large chunks", "Kosher salt", "1/2 cup extra-virgin olive oil", "1 red onion, peeled and halved", "2 28-ounce cans San Marzano", "whole peeled tomatoes and their juices", "8 ounces prosciutto, cut into large chunks (see notes)", "1 cup coarse-ground polenta", "Kosher salt", "1/4 cup chestnut flour (see notes)", "Freshly ground black pepper", "Handful of basil leaves", "4 to 6 eggs", "Extra-virgin olive oil", "Chunk of ricotta salata", "4 to 6 thin slices of lardo (optional) (see notes)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before, prepare the meats for the ragù: Sprinkle the pork shoulder and pork belly all over with salt and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the ragù: Place the olive oil in a large, heavy pot over medium-low heat. Add the onion halves, cut-side down, and brown gently for about 20 minutes, moving them occasionally. Remove the onions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tomatoes and their juices in a bowl, season with a few pinches of salt and squeeze into chunks. Add the tomatoes and meats (including prosciutto) to the pot and bring to a boil, stirring frequently. Reduce heat and cook at a very low simmer for 4 hours. Remove from heat and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the meats from the sauce and set aside for another use (added to leftover ragù, they’re great over pasta). Season ragù to taste with salt."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the ragù", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the polenta: In a medium pot, combine the polenta, 4 cups water and 1 teaspoon salt. Bring to a boil and whisk continuously until the mixture comes together. Lower heat to a simmer and stir often with a wooden spoon until tender, about 30 minutes. Stir in the chestnut flour and cook for 3 minutes. Season with salt and pepper. Remove from heat and cover."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large sauté pan, combine 3 cups of the ragù, the basil and 1/2 cup water. Bring to a gentle boil over medium heat. Crack the eggs and distribute them evenly on top of the ragù. Give the pan a shake to ensure that the eggs do not stick to the bottom, cover with a lid and cook until the eggs have set, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the polenta among warm bowls. Scoop up an egg with some ragù and place on the polenta. Drizzle the eggs with olive oil, grate ricotta salata over the top and garnish with a slice of lardo, if using. Serve immediately."}]}], "link": "https://cooking.nytimes.com/recipes/1013990-eggs-in-purgatory"}