{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach and Goat Cheese Quesadillas", "description": "Many types of greens would be delicious in these quesadillas. Spinach is the quickest to wilt and the easiest to find.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/03/15/science/18recipehealth/18recipehealth-articleLarge-v2.jpg", "totalTime": "PT10M", "recipeYield": "Two quesadillas", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, quick, weekday", "keywords": "baby spinach, goat cheese, gluten-free, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 133}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 263, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "5 grams", "sodiumContent": "397 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 6-ounce bag baby spinach or 1 bunch spinach, stemmed", "1 tablespoon extra virgin olive oil", "1 to 2 garlic cloves to taste, minced", "Salt", "freshly ground pepper", "4 corn tortillas", "2 ounces goat cheese, crumbled 1/2 cup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the spinach but do not dry. If using bunch spinach, chop coarsely. Heat the olive oil over medium heat in a large, heavy frying pan. Add the garlic. Cook until fragrant, about 30 seconds, then stir in the spinach. Raise the heat, and stir just until the spinach wilts. Remove from the heat. Press down on the spinach with the back of your spoon, and drain off any water in the pan. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a microwave: Place a corn tortilla on a plate. Top with half the spinach, and spread in an even layer. Sprinkle on half the cheese, and top with another tortilla. Press down gently, then microwave for 1 to 1 1/2 minutes, until the cheese has melted. Remove from the microwave, cut into quarters or sixths, and serve. Repeat with the remaining ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pan: Place a corn tortilla in the pan. Top with half the spinach, and spread in an even layer. Sprinkle on half the cheese. Turn the heat to medium-high, and heat until the cheese begins to melt. Place another tortilla on top of the cheese, and press down lightly. Flip the quesadilla over in the pan, and heat for about 30 seconds or until the cheese has melted. Flip back over, and remove to a plate. Cut into quarters or sixths, and serve. Repeat with the remaining ingredients."}], "link": "https://cooking.nytimes.com/recipes/1013513-spinach-and-goat-cheese-quesadillas"}