{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Adobo", "description": "It is the national dish of the Philippines, and the subject of intense and delicious debate across its 7,100 islands whether made with chicken, pork or fish. Whichever, the protein is braised in vinegar until pungent and rich, sweet and sour and salty at once, then sometimes crisped at the edges in high heat, and always served with the remaining sauce. Its excellence derives from the balance of its flavors, in the alchemy of the process. Cooking softens the acidity of the vinegar, which then combines with the flavor of the meat to enhance it. Whether consumed in Manila’s heat or on the edge of a New York winter, adobo holds the power to change moods and alter dining habits. It is a difficult dish to cook just once. The recipe that follows derives from one given to The Times in 2011 by Amy Besa, who runs, with her husband, Romy Dorotan, the excellent Purple Yam restaurant in Ditmas Park, Brooklyn.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/08/07/dining/chicken-adobo/chicken-adobo-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "4 servings", "recipeCuisine": "filipino", "recipeCategory": "dinner, easy, weekday", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 2438}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1036, "unsaturatedFatContent": "42 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "78 grams", "fiberContent": "1 gram", "proteinContent": "69 grams", "saturatedFatContent": "29 grams", "sodiumContent": "1209 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup coconut milk", "¼ cup soy sauce", "1½ cup rice vinegar", "12 garlic cloves, peeled", "3 whole bird’s-eye chilies or other fiery chili", "3 bay leaves", "1½ teaspoons freshly ground black pepper", "3 to 4 pounds chicken thighs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all of the marinade ingredients in a large, nonreactive bowl or resealable plastic freezer bag. Add the chicken and turn to coat. Refrigerate overnight or for at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken and marinade in a large lidded pot or Dutch oven over high heat and bring to a boil. Immediately reduce heat to a simmer and cook, stirring occasionally, until the chicken is cooked through and tender, around 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat broiler. Transfer chicken pieces to a large bowl, raise heat under the pot to medium-high, and reduce the sauce until it achieves almost the consistency of cream, about 10 minutes. Remove bay leaves and chilies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken pieces on a roasting pan and place under broiler for 5 to 7 minutes, until they begin to caramelize. Remove, turn chicken, baste with sauce and repeat, 3 to 5 minutes more. Return chicken to sauce and cook for a few minutes more, then place on a platter and drizzle heavily with sauce."}], "link": "https://cooking.nytimes.com/recipes/1013419-chicken-adobo"}