{"@context": "http://schema.org", "@type": "Recipe", "name": "Edamame Pâté", "description": "This is an adaptation of a dish that I created in my early vegetarian days, when we cooked a lot with soybeans — although nobody really liked them. It occurred to me one day to add Marmite or Savorex, yeast extracts with an intense, somewhat meaty taste, and to use other seasonings from traditional pâtés to achieve a liverlike flavor.  I recreated this pâté with fresh green soybeans, which takes all the hassle out of the original recipe. A quick word about the yeast extract, which many of you may object to because of the high glutamate content. If you use Vegemite, which is lower in glutamates than Marmite, one serving of this pâté (if serving eight) will contain 29 milligrams of free glutamates. To put that in perspective, one ounce of Parmesan cheese contains 300 milligrams of glutamates.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/06/29/science/01recipehealth/01recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Eight to 10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, edamame, milk, vegemite, healthy, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 104, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "159 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons extra virgin olive oil", "1/2 cup finely chopped onion", "1 12-ounce bag frozen edamame (or use 2 heaped cups unfrozen), simmered for five minutes in lightly salted water and drained", "2 eggs", "1/3 cup milk (1 percent or 2 percent)", "2 tablespoons brandy (optional; if not using, add 2 more tablespoons milk)", "2 teaspoons yeast extract, like Vegemite, Savorex or Marmite", "2 teaspoons tamari soy sauce", "2 garlic cloves", "1 teaspoon fresh thyme leaves, chopped, or 1/2 teaspoon dried thyme", "1/8 teaspoon ground allspice", "1/8 teaspoon ground ginger", "1/4 teaspoon salt (more to taste)", "1/4 teaspoon freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil a 5-cup pâté tureen, casserole or bread pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a small skillet. Add the onion. Cook, stirring often, until tender, about five minutes. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the edamame in a food processor fitted with the steel blade, and pulse several times. Add all of the remaining ingredients except the onion, and process until smooth. Stop the machine and scrape down the sides, then process again until completely smooth. (This is important.) Add the onion, and pulse a few times to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the mixture into the prepared baking dish, cover tightly, and bake 40 to 45 minutes until set. Remove from the heat, and allow to cool. Refrigerate overnight for the best flavor."}], "link": "https://cooking.nytimes.com/recipes/1013669-edamame-pate"}