{"@context": "http://schema.org", "@type": "Recipe", "name": "Purple Barley Risotto With Cauliflower", "description": "Purple prairie barley is an heirloom grain that originated in Tibet. High in protein, the grain has the chewy texture of regular barley but with a dark purple hue. If you can’t find purple barley, make this delicious risotto with the regular type, preferably whole hulled barley that has not been pearled. (Pearl barley cooks more quickly, but many of the nutrients are lost when it’s pearled.) Whichever you use, cook the barley ahead of time so that the dish doesn’t take too long to make. Purple prairie barley takes about one and a half hours to cook if unsoaked, about one hour if soaked. A cup yields just under 4 cups cooked barley.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/02/23/science/23recipehealth/23recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "Serves four to six", "recipeCuisine": "", "recipeCategory": "dinner, easy, weekday, one pot", "keywords": "barley, cauliflower, gluten-free, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 17}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 596, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "102 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "24 grams", "proteinContent": "23 grams", "saturatedFatContent": "3 grams", "sodiumContent": "748 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1/2 cup finely chopped onion", "2 garlic cloves, minced", "1 small head cauliflower, separated into small florets, then broken into smaller pieces or sliced 1/2 inch thick (about 4 heaped cups)", "1/2 cup fruity red wine, such as a Côtes du Rhone", "4 cups cooked purple prairie barley (1 cup uncooked) or hulled barley", "2 cups vegetable or chicken stock", "1 cup thawed frozen or fresh peas", "Salt", "freshly ground pepper", "1/4 cup chopped fresh parsley", "2 ounces Parmesan, grated (1/2 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, heavy nonstick skillet or saucepan, and add the onion. Cook, stirring, until tender, about five minutes. Add the garlic and cauliflower. Cook, stirring, for a minute until the garlic is fragrant. Stir in the barley and red wine. Cook, stirring, until the wine has evaporated, leaving the cauliflower tinted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 1/2 cups of the stock, and cook, stirring often, for 10 minutes. Add the peas, and continue to simmer until the cauliflower and peas are tender and most of the stock has evaporated, about 15 minutes. There should still be some creamy liquid surrounding the grains of barley. If the mixture dries out before the cauliflower is tender, or if the grains are not suspended in some liquid at the end of cooking, add some of the additional 1/2 cup of stock. Add pepper, and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the parsley and Parmesan, remove from the heat and serve."}]}