{"@context": "http://schema.org", "@type": "Recipe", "name": "Olive Oil Matzo", "description": "There is a wonderful Sardinian flatbread known as carta musica — sheet music, because it is nearly impossibly thin — that I never thought of making. Something about its ethereal nature made me assume that it would be too difficult. Turns out, making this bread is a snap, and the dough has such a high percentage of olive oil that rolling it super-thin is almost no work at all. The dough is a joy to work with. It’s almost impossible to tear and, with a minimum of additional flour, is stick-free. Baking takes a bit of practice because the oven must be heated to reach a very high temperature before the dough is inserted. The last few breads will bake a bit faster than the first few because the baking sheet will be hot.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/03/05/dining/matzo-still/matzo-still-mediumThreeByTwo440.jpg", "totalTime": "PT30M", "recipeYield": "12 servings", "recipeCuisine": "jewish", "recipeCategory": "easy, quick", "keywords": "appetizer, side dish, flour, olive oil, kosher, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 80}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 129, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "62 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2 cups flour", "1/2 teaspoon salt", "1/3 cup olive oil", "Sea salt, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 500 degrees. Put flour, salt and olive oil in a food processor. Once machine is on, add 1/2 cup water. Continue to run machine until dough forms a firm ball, rides around on blade and is not at all sticky. (If you prefer, whisk together the water and oil and add this to machine all at once.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut dough into 12 small balls — this is easiest if you cut the ball in half, then half again, then into thirds — and flatten each into a 3- to 4-inch patty. On a well-floured surface, use a rolling pin to roll each patty into a 6- to 8-inch circle. The shapes can be irregular, but dough should be so thin you can almost see through it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put dough on ungreased cookie sheets, sprinkle with sea salt if you like, and bake for about 2 to 3 minutes, keeping a very close eye on breads — they can burn very quickly. Once they begin to puff up and brown, flip and cook for another minute or so on second side. Repeat with all the dough and let cool completely."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Olive Oil Matzo", "description": "Mark Bittman makes a flavorful matzo-like bread that was inspired by a Sardinian flatbread. ", "thumbnailUrl": "https://static01.nyt.com/images/2014/03/05/dining/matzo-still/matzo-still-mediumThreeByTwo440.jpg", "uploadDate": "2010-03-19T22:34:41.000Z", "duration": "PT4M15S"}}