{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork-Fennel Burger", "description": "For this burger, you need fat. Pork shoulder is almost imperative for the correct balance of lean and fat. You need strong spices; as a starting point, you cannot beat fennel seeds and black pepper. And you need adequate salt, an essential in any good burger. Variations, of course, are not just possible but advisable. Chopped fresh fennel or chopped onion are spectacular additions. When it is cooked over high heat, whether on a grill or in a pan or broiler, until just done, the result is consistently juicy, super flavorful and sublimely tender. And it browns, developing a dark, crisp crust like no beef burger I’ve ever had.  ", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/03/05/dining/porkfennel-still/porkfennel-still-mediumThreeByTwo440.jpg", "totalTime": "PT30M", "recipeYield": "8 patties", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday, burgers", "keywords": "fennel, pork, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 109}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 279, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "1 gram", "proteinContent": "20 grams", "saturatedFatContent": "7 grams", "sodiumContent": "319 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 fennel bulb, trimmed and cut into large chunks", "3 to 4 garlic cloves", "2 1/2 pounds boneless pork shoulder, with some of the fat, cut into 1-inch cubes", "1 tablespoon fennel seeds", "1 teaspoon caraway seeds (optional)", "1 teaspoon salt", "1/2 teaspoon pepper, or more to taste", "Peeled orange slices to garnish (optional)", "chopped olives to garnish (optional)", "chopped parsley to garnish (optional)", "chopped roasted red pepper to garnish (optional)", "fennel slices, to garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If grilling or broiling, heat should be medium-high and rack about 4 inches from fire. Put fennel and garlic into a food processor and pulse until just chopped; remove to a large bowl. Put pork fat in processor and grind until just chopped; add to bowl. Working in batches, process meat with fennel seeds, caraway, if using and salt and pepper, until meat is just chopped (be careful not to over-process). Add to bowl and mix well. Shape mixture into 8 patties."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To broil or grill, cook about 5 minutes on each side, turning once after 4 or 5 minutes and again as necessary, 8 to 10 minutes total. For stovetop, heat a large skillet over medium heat for 2 or 3 minutes, then add patties; cook undisturbed for about 3 minutes, then rotate them so they brown evenly. When browned, turn. Total cooking time is about 10 minutes. (They can remain ever-so-slightly pink in the center.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish with peeled orange slices, chopped olives, chopped parsley, chopped roasted red pepper and fennel slices, to taste."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Pork-Fennel Burgers", "description": "Mark Bittman uses the food processor to make pork-fennel burgers, an alternative to the standard beef burger. ", "thumbnailUrl": "https://static01.nyt.com/images/2014/03/05/dining/porkfennel-still/porkfennel-still-mediumThreeByTwo440.jpg", "uploadDate": "2010-05-25T21:43:12.000Z", "duration": "PT4M59S"}}