{"@context": "http://schema.org", "@type": "Recipe", "name": "Rhubarb Upside-Down Cake", "description": "Take advantage of rhubarb season with this easy dessert. Baked and unmolded, this cake resembles a pale pink mosaic atop velvet-crumbed and vanilla-infused cake. The rhubarb, which you’ll add in raw, is tangy and tender, firm enough to give you something to chew over. It’s an easy half-hour of prep and another hour and change in the oven, ample time for a light supper, anticipation of dessert hanging in the spring air. ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/03/22/dining/mc-rhubarb-upside-down-cake/merlin_151791933_1d550b5a-03ec-4906-890b-9099363e1831-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "cake flour, rhubarb, dessert, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1554}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 636, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "79 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "20 grams", "sodiumContent": "253 milligrams", "sugarContent": "48 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 1/2 sticks unsalted butter, at room temperature, more to grease pans", "1 1/2 pounds rhubarb, rinsed and sliced into 1/2-inch cubes about 4 cups", "2 teaspoons cornstarch", "1 1/2 cups granulated sugar", "1/2 cup light brown sugar", "2 cups cake flour", "1 1/4 teaspoons baking powder", "1/2 teaspoon fine sea salt", "Zest of 1 lemon, grated", "1 teaspoon vanilla extract", "4 large eggs", "1/3 cup sour cream", "2 teaspoons lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Line the bottom of a 9-inch springform pan with parchment paper. Butter the paper and sides of the pan. Wrap two layers of foil under the pan, and place it on a buttered baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, mix rhubarb, cornstarch and 1/2 cup granulated sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the brown sugar and 1/2 stick butter in a pan over medium heat. Whisk until smooth and bubbling, about 2 minutes. Sift together the cake flour, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip 2 sticks butter in a mixer with a paddle attachment for 2 minutes. With your fingers, blend the remaining 1 cup sugar with lemon zest until the mixture is uniform in color. Cream together with the butter at medium-high speed until it is light and fluffy, about 4 minutes, stopping to scrape down the bowl halfway through. Add the vanilla and mix well. Add the eggs, one at a time, mixing well after each addition. Mix in the sour cream, then the lemon juice. (It’s O.K. if the mixture looks curdled.) With the mixer set to low speed, add the flour mixture, 1/4 cup at a time, until well combined. Scrape down the mixer bowl in between the additions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the brown-sugar mixture into the cake pan, then spoon in the rhubarb and its juices. Spoon in the batter so it covers all of the rhubarb. Smooth out the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 1 hour and 15 minutes, or until the top of the cake is firm to touch and a toothpick stuck in the middle comes out without any large, moist crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pan on a wire rack, and cool for 15 minutes. Run a knife around the cake, place a plate on top of the pan and turn it upside-down. Release the cake from the pan while still warm or else it will stick."}], "link": "https://cooking.nytimes.com/recipes/1013611-rhubarb-upside-down-cake"}