{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Cherry Soup", "description": "Many versions of cold cherry soup originated in Hungary and Poland, where cooks would use sour cherries and a lot of sugar. Traditional cherry soups also are made with sour cream and heavy cream, and sometimes they are thickened with flour. I like this lighter version, which is made with drained yogurt instead of cream.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/07/13/science/13recipehealth/13recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "Serves six to eight", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, dark cherries, drained yogurt, red wine, healthy, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 146, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "96 milligrams", "sugarContent": "25 grams", "transFatContent": null}, "recipeIngredient": ["5 cups water", "1/2 cup sugar", "1/2 cup red wine", "1/4 teaspoon salt", "Grated zest of 1/2 lemon", "1 1/2 pounds sweet, dark cherries", "1 cup drained yogurt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pit the cherries, and place the pitted cherries in a bowl and the pits in a large soup pot. Add the water to the pot, and bring to a boil. Reduce the heat and simmer five minutes. With a skimmer, remove the pits from the water. Add the sugar, red wine, salt and lemon zest, and bring back to a boil over medium-high heat. Boil five minutes, then add the cherries. Bring to a simmer, turn the heat to low, cover and simmer five minutes. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the yogurt in a large bowl and slowly whisk in a cup of the liquid from the soup once it is no longer simmering. Whisk until the mixture is smooth. Slowly add the rest of the soup, and whisk or stir until smooth. Allow to cool, stirring from time to time, then refrigerate until cold. Before serving, you will have to stir or whisk again, as the liquid and yogurt will separate. Still, the soup is easily homogenized."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve in bowls or in glass tumblers. If you wish, garnish with additional halved, pitted fresh cherries."}], "link": "https://cooking.nytimes.com/recipes/1013699-cold-cherry-soup"}