{"@context": "http://schema.org", "@type": "Recipe", "name": "Fazzoletti With Chunky Pesto", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/02/27/dining/recipes-pastahandkerchiefs/recipes-pastahandkerchiefs-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, project", "keywords": "appetizer, main course, basil, parmesan, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 591, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "2 grams", "proteinContent": "12 grams", "saturatedFatContent": "6 grams", "sodiumContent": "331 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups all-purpose flour, plus more as needed", "1 teaspoon salt, plus more as needed", "2 whole eggs", "3 egg yolks", "2 cups loosely packed basil leaves, rinsed and dried", "1/2 clove garlic, peeled, or more to taste", "1/2 cup extra virgin olive oil, or more as desired", "1/4 cup pine nuts", "1/2 cup grated Parmesan, plus more for garnish", "Pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulse flour and salt in a food processor once or twice. Add the eggs and yolks, and turn the machine on. Process just until a ball begins to form, about 30 seconds. Add a few drops of water if the dough is dry and grainy; add a tablespoon of flour if the dough sticks to the side of the bowl. Turn the dough out of the food processor, sprinkle it with a little flour, cover it with plastic or a cloth, and let it rest for about 30 minutes. (At this point, you may refrigerate the dough, wrapped in plastic, until you’re ready to roll it out, for up to 24 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a food processor or blender, combine the basil with a pinch of salt, the garlic and about half the oil. Process, stopping to scrape down the sides of the container if necessary, and adding the rest of the oil gradually. Add the nuts and cheese, and pulse a few times. The pesto should be well combined but still chunky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and salt it. Divide the dough in half. Turn one half of the dough onto a lightly floured surface and roll it into a large rectangle no thicker than 1/4 inch and ideally closer to 1/8 inch, adding additional flour sparingly as necessary. Repeat with the rest of the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut into squares no larger than 4 inches across. Drop the squares into the water and cook until tender, 2 to 3 minutes. Drain, reserving a little of the cooking water. Toss the handkerchiefs with the pesto, some salt and pepper, and a spoonful of cooking water, if necessary, to thin the pesto. Serve immediately, garnished with Parmesan."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Pasta Handkerchiefs With Chunky Pesto", "description": "Mark Bittman makes easy fazzoletti — rectangular pasta — that is as traditional as anything else, and as delicious. ", "thumbnailUrl": "https://static01.nyt.com/images/2014/02/27/dining/recipes-pastahandkerchiefs/recipes-pastahandkerchiefs-mediumThreeByTwo440.jpg", "uploadDate": "2011-02-23T00:46:10.000Z", "duration": "PT5M8S"}, "link": "https://cooking.nytimes.com/recipes/1013424-fazzoletti-with-chunky-pesto"}