{"@context": "http://schema.org", "@type": "Recipe", "name": "Farro and Vegetable Soup", "description": "This thick, hearty meal is inspired by a traditional Provençal harvest soup. Farro (spelt) and the softer emmer wheat are grains that were once peasant staples in the mountainous areas of Provence, though they are less common now. Traditionally, the grain is simmered with a mutton, prosciutto or ham bone. I use Parmesan rinds to enrich the flavor of this version.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/01/11/science/12recipehealth/12recipehealth-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "Serves six to eight", "recipeCuisine": "", "recipeCategory": "dinner, one pot, soups and stews", "keywords": "fall, farro, vegetables, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 74}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 202, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1005 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 cups farro (spelt), rinsed", "1 ounce (about 1 cup) dried porcini mushrooms", "1 tablespoon extra virgin olive oil", "1 onion, chopped", "1/2 pound carrots, chopped", "2 celery stalks with leaves, chopped", "1/2 pound cabbage, shredded or finely chopped", "2 to 4 large garlic cloves, to taste, minced", "A bouquet garni made with a bay leaf, a few sprigs of thyme and parsley, and a couple of Parmesan rinds, all tied in a cheesecloth", "2 tablespoons tomato paste", "2 1/2 quarts water, chicken stock or vegetable stock", "Salt", "freshly ground pepper", "1/4 cup chopped fresh parsley", "2 ounces Gruyère cheese, grated 1/2 cup Parmesan may be substituted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the farro just covered in water for one hour or longer. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the dried mushrooms in a bowl or Pyrex measuring cup, and pour on two cups boiling water. Let them sit for 15 to 30 minutes until softened. Place a strainer lined with cheesecloth or paper towels above a bowl, and drain the mushrooms. Squeeze over the strainer, then rinse in several changes of water to get rid of any sand. Chop coarsely and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, heavy soup pot or Dutch oven. Add the onion. Cook, stirring, for three to five minutes until it begins to soften. Add the chopped carrots, celery and cabbage, and cover. Turn the heat to medium-low, and cook, stirring often, for five to 10 minutes until the mixture is tender and fragrant. Add the garlic, and cook, stirring, for a minute until fragrant. Add the soaked mushrooms and their liquid, the farro, bouquet garni, tomato paste and the water or stock. Bring to a boil, add salt, reduce the heat, cover and simmer one hour until the farro is tender and the soup fragrant. If it seems too thick, thin out with more water or stock. Add pepper, and adjust salt. Remove the bouquet garni, and stir in the parsley. Serve, passing the cheese for sprinkling."}]}