{"@context": "http://schema.org", "@type": "Recipe", "name": "Grand Aioli", "description": "The grand aioli of Provence, a classic dish of simply poached seafood and vegetables, is as unassuming as some of the sauvignon blancs we tasted.But an assertive garlic sauce alongside it becomes a game changer. And when artfully arranged, the array of yellow, orange, green and black has uncommon eye appeal, letting it anchor a summer dinner with relatively little effort.Plan the preparation so you can serve everything just tepid. Everything, that is, except the wine, which must be well chilled and should be poured freely.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2011/07/20/dining/20PAIR_span/20PAIR_span-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "cod, mussels, vegetables, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 387, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "6 grams", "proteinContent": "39 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1233 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 large cloves garlic, peeled", "2 large eggs", "2 lemons, 1/2 of one juiced", "1 1/2 cups extra virgin olive oil, more for drizzling", "3 tablespoons minced fennel fronds", "Salt", "24 small fingerling potatoes", "24 baby carrots not the kind in bags, peeled", "1/2 pound haricots verts, trimmed", "1 fennel bulb, trimmed and quartered", "2 cups dry white wine", "3 dozen mussels, scrubbed", "2 1/2 pounds skinless cod or hake fillets", "Niçoise olives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on a food processor, drop garlic in through feed tube and process until minced. Add eggs, then quickly add lemon juice. Slowly drizzle in olive oil to make a loose mayonnaise. Turn off machine and fold in minced fennel fronds. Season with salt. Transfer this aioli to a serving dish, cover and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place potatoes in a saucepan big enough for all the vegetables; cover with water. Over high heat, bring to a boil, reduce heat and simmer 10 minutes. Add carrots and cook 3 minutes. Add haricots verts and cook 2 minutes more, then add the fennel bulb. Cook 5 minutes more. Drain. Arrange carrots and haricots verts on a large platter. Cut potatoes in half vertically and slice fennel. Place on platter, leaving room for seafood."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 1 cup wine to a simmer in a pan large enough to hold seafood in a single layer. Add mussels; cover and cook until they open. Scoop mussels from pan, leaving liquid. Add fish to pan, cutting it in pieces as needed to fit the pan. Add enough wine to cover fish, bring to a simmer, cover, cook 5 minutes. Set aside and let it cool in pan 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain fish, cut to serving size and arrange on platter. Add mussels, in their shells, to platter. Cut remaining lemons into wedges and add. Scatter olives about. Drizzle fish and potatoes with a little oil and season with salt. Scoop aioli into a bowl and serve alongside."}]}