{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Roasted Lobsters", "description": "You will need two heavy oven-safe skillets or sauté pans.", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": null, "totalTime": "PT45M", "recipeYield": "4 first-course servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, cognac, lobster, tarragon", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 829, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "51 grams", "fiberContent": "2 grams", "proteinContent": "58 grams", "saturatedFatContent": "24 grams", "sodiumContent": "1452 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 lobsters, about 1 1/2 pounds each", "4 tablespoons olive oil", "2 large shallots, chopped fine", "2/3 cup Cognac, at least VS", "6 tablespoons dry white wine", "4 tablespoons fresh tarragon leaves, finely chopped", "2 tablespoons snipped fresh chives", "12 tablespoons cold, unsalted butter, in small pieces", "Salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 500 degrees. Boil a small saucepan of water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the lobsters on a cutting board. Plunge a sharp, heavy-bladed knife into each lobster's head, just behind the eyes, and split the heads. The lobsters will be dead but may still move. Split each lobster in two lengthwise. Remove the black vein in the tail, the sandy sac in the head, the dark green egg sac and the liver from the chest cavity. Discard the eight small legs. Twist off the claws."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Poach the claws in the boiling water for 3 minutes. Rinse under cold water and set aside. When the claws are cool enough to handle, crack them open and remove the meat, in one piece if possible, and in large chunks from the knuckles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the skillets over medium-high heat and add 2 tablespoons oil to each. When the oil shimmers, add the lobsters shell side down. Move them around so the shell becomes red all over. After 3 minutes turn them over and sear the meat for another minute. Place pans in the oven for 3 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove the pans from the oven and place the lobster halves, shell side down, on a platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half the shallots to each pan and cook over medium-high heat for 1 minute. Working with one pan at a time, add half of the Cognac to each, and when the Cognac is warmed, carefully ignite it using a long match or a butane lighter. Have the lid ready to subdue the flames and avert your face while lighting the Cognac."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the flames are gone, stir to clean the pan of any lobster cooking bits. Pour the liquid from one pan into the other, and place the pan with the liquid over medium heat. Add white wine, the claw meat, the tarragon and chives. Boil to reduce liquid slightly. Add the butter pieces one at a time, and whisk until each is just melted before adding the next one. Keep the liquid just under boiling so the sauce doesn't separate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the sauce with salt and pepper. Add the claw meat to the chest cavities, and spoon the emulsion over the lobster. Serve immediately."}]}