{"@context": "http://schema.org", "@type": "Recipe", "name": "Shortbread Jammers", "description": "With a shortbread base, these pretty cookies are akin to a linzer but a whole lot easier to make-- people will think you've gone through a lot more fuss than you actually have.  Use a thick, quality jam or preserve but not jelly, which is too runny.  Rice flour in the dough helps keep the cookie very tender, but it's fine to use all-purpose flour in its place.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2015/12/19/dining/19COOKING_SHORTJAMMERS2/19COOKING_SHORTJAMMERS2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "16 squares", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "dessert, flour, fruit jam", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 370}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 210, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "7 grams", "sodiumContent": "101 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound unsalted butter, at room temperature", "3/4 cup granulated sugar", "1 teaspoon fine sea salt", "1 teaspoon vanilla extract", "2 cups all-purpose flour", "1/3 cup rice flour (all-purpose flour may be substituted)", "1 cup thick fruit jam, preserves or marmalade"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Lightly butter a 8-by-8-inch baking dish. In the bowl of a standing mixer (or in a large bowl if using a hand mixer), beat the butter and sugar at medium speed for about 3 minutes. Add the salt and vanilla and continue to beat until well combined. Add the flours and continue to beat until the dough comes together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press the dough evenly into the prepared pan, smoothing the surface. Prick it with a fork in about 20 places. Bake for 35 minutes, or until golden around the edges. Slide a dull knife along the edges. Cool for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully turn the slab of shortbread out onto a clean surface. With a knife, trim 1 inch from one of the sides. Crumble the trimmings into a bowl and cover with plastic wrap. Cut the rest of the shortbread into 16 squares and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread a thick layer of jam on each square, and then sprinkle with the crumbs. Layered between plastic wrap or wax paper in an airtight container, the cookies will keep for 3 to 4 days."}]}