{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach and Red Pepper Frittata", "description": "Spinach and red peppers bring vitamin A and vitamin C to this beautiful frittata. Spinach is also an excellent source of a long list of other nutrients, including vitamin K, manganese, folate and magnesium. And it’s packed with protective phytonutrients, including the newly discovered glycoglycerolipids, which some researchers believe may help protect the digestive tract from inflammation.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/03/24/science/25recipehealth/25recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, easy, weekday", "keywords": "baby spinach, red bell pepper, gluten-free, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 410}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 148, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "2 grams", "sodiumContent": "319 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 6-ounce bag baby spinach, or 1 bunch spinach, washed and stemmed", "2 tablespoons extra virgin olive oil", "2 red bell peppers, seeded and cut in small dice", "1 to 2 garlic cloves (to taste), minced", "10 fresh marjoram leaves, chopped", "Salt", "8 eggs", "Freshly ground pepper", "2 tablespoons low-fat milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the spinach above an inch boiling water until just wilted, about two minutes; or wilt in a large frying pan with the water left on the leaves after washing. Remove from the heat, rinse with cold water and squeeze out excess water. Chop fine, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a heavy 10-inch nonstick skillet. Add the bell peppers. Cook, stirring often, until tender, five to eight minutes. Add the garlic and salt to taste, stir for about half a minute, and stir in the chopped spinach and the marjoram. Stir together for a few seconds, then remove from the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl. Stir in the salt (about 1/2 teaspoon), pepper, milk, spinach and red peppers. Clean and dry the pan, and return to the burner, set on medium-high. Heat the remaining tablespoon of olive oil in the skillet. Drop a bit of egg into the pan; if it sizzles and cooks at once, the pan is ready. Pour in the egg mixture. Tilt the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the frittata with a spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to low, cover and cook 10 minutes, shaking the pan gently every once in a while. From time to time, remove the lid, tilt the pan, and loosen the bottom of the frittata with a wooden spatula so that it doesn’t burn. The bottom should turn a golden color. The eggs should be just about set; cook a few minutes longer if they’re not."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the broiler. Uncover the pan and place under the broiler, not too close to the heat, for one to three minutes, watching very carefully to make sure the top doesn’t burn (at most, it should brown very slightly and puff under the broiler). Remove from the heat, shake the pan to make sure the frittata isn’t sticking, and allow it to cool for at least five minutes and for as long as 15 minutes. Loosen the edges with a wooden or plastic spatula. Carefully slide from the pan onto a large round platter. Cut into wedges or into smaller bite-size diamonds. Serve hot, warm, at room temperature or cold."}], "link": "https://cooking.nytimes.com/recipes/1013526-spinach-and-red-pepper-frittata"}