{"@context": "http://schema.org", "@type": "Recipe", "name": "Crackery Potato Bugnes", "description": "", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Serves about 10 as a nibble with drinks", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, side dish, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 87, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "63 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["¾ cup all-purpose flour", "½ cup Hungry Jack potato flakes", "½ teaspoon baking powder", "1 tablespoon unsalted butter, softened", "½ teaspoon sea salt (or ¾ teaspoon fleur de sel)", "1 large egg, at room temperature", "Olive oil, for frying", "Fleur de sel or sea salt, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the flour, potato flakes and baking powder in a small bowl. In another bowl, whisk the butter and salt together until smooth. Add the egg and whisk until the egg is beaten. (The mixture will look curdled, almost like egg-drop soup, but that’s fine.) Add the dry ingredients and whisk to moisten as much of the mixture as you can. The dough will have lumps and clumps and a few flakes. Pour 3 tablespoons hot water over the dough and whisk (or mix with a rubber spatula) until the dough comes together. If it looks dry, add a little more water drop by drop (3 tablespoons is usually enough). You should have a soft, moist dough. Knead the dough a couple of times, divide it in half, pat it into a rectangular shape and wrap each half well. Chill the dough for at least 1 hour or for as long as overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with wax paper. Working with one piece of dough at a time, place it on a well-floured surface, flour the top of the dough and roll it out, turning it over so that you’re rolling on both sides, until you’ve got a rectangle that’s paper thin. Don’t worry about rolling the dough into a perfectly even shape; you just want it to be very thin. If you flour it well enough, it will be easy to get that thinness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a ruler and a pastry wheel (one with a zigzag edge is nice for this job) or pizza cutter, cut long strips 1 to 1½ inches wide, then cut the strips at 2-inch intervals. (Again, size isn’t really important and the shape is flexible — you can make long strips, triangles or squares.) Using the tip of a paring knife, cut a lengthwise slit about ¾ inch long in the center of each piece. Lift the pieces onto the baking sheet. When you’ve filled the sheet, just cover the dough with another piece of wax paper and keep going. Roll and cut the other half of the dough and place these pieces on the baking sheet as well, separating the layers with wax paper. You should have about 60 bugnes. Chill for at least 1 hour or for as long as overnight. (When the dough is firm, you can pack the pieces airtight and freeze them for up to 2 months; they can be cooked without defrosting.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to fry the bugnes, line a baking sheet with a double layer of paper towels. Pour 1 to 1½ inches of olive oil into a deep sauté pan or a Dutch oven set over medium-high heat. When the oil is hot — it should measure 300 degrees on a deep-fat-frying or candy thermometer — drop a few pieces of dough into the pot. Don’t crowd the pot; you want the oil to bubble around each piece of dough. Fry until the bugnes are lightly browned around the edges and golden in the center, about 2 minutes, then turn and brown the other side, about 1 minute more. Lift out of the oil with a slotted spoon, allowing the excess oil to drip back into the pot, and transfer them to the lined baking sheet. Pat off the excess oil, sprinkle with salt and continue frying the remaining pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the bugnes just warm or at room temperature, solo or with a little crème fraîche (or sour cream) and salmon roe or caviar."}], "link": "https://cooking.nytimes.com/recipes/1013278-crackery-potato-bugnes"}