{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkish Chicken and Okra Casserole", "description": "In Turkey, okra is often stewed with lamb or chicken. I liked this dish so much that I made it twice in one week, the second time for a big dinner party. It’s adapted from Ghillie Basan’s recipe in “Classic Turkish Cooking.”", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/09/14/science/14recipehealth/14recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "Serves six", "recipeCuisine": "turkish", "recipeCategory": "dinner", "keywords": "chicken, okra, tomato, healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 96}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 465, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "5 grams", "proteinContent": "34 grams", "saturatedFatContent": "8 grams", "sodiumContent": "889 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound okra", "Salt", "1/2 cup red wine vinegar or apple cider vinegar", "2 tablespoons extra virgin olive oil", "1 small chicken, cut up into 8 pieces, skinned if desired", "1 large or 2 smaller onions, cut in half lengthwise then thinly sliced across the grain", "2 teaspoons coriander seeds", "1 teaspoon Aleppo pepper, mild chili powder or smoked paprika", "4 garlic cloves, puréed with a pinch of salt", "1 pound tomatoes, seeded and grated; or peeled, seeded and chopped", "1/2 teaspoon sugar", "1 tablespoon tomato paste diluted in 2/3 cup water", "Juice of 1 lemon", "Freshly ground pepper", "1/4 cup chopped fresh parsley", "Plain thick yogurt for serving optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the stems from the okra, and place them in a large bowl. Salt generously, douse with the vinegar, and let sit for 30 minutes to an hour while you prepare the other ingredients and begin cooking the dish. Toss from time to time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat half the olive oil over medium-high heat in a large lidded skillet or casserole. Brown the chicken in batches. Set the chicken aside in a bowl. Drain off excess fat from the pot and discard. Turn the heat down to medium, and add the remaining olive oil and the onions. Cook, stirring, until they begin to soften, about three minutes. Add the coriander seeds and Aleppo pepper (or chili powder or paprika), and stir until the onions are tender, about two minutes. Add the garlic, and stir for about 30 seconds until fragrant. Add the tomatoes and sugar. Cook, stirring often, until the tomatoes have cooked down slightly, about 10 minutes. Stir in the dissolved tomato paste, and bring to a simmer. Add salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the chicken pieces to the pot, reduce the heat to low, cover and simmer for 25 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the okra, and rinse thoroughly. Add to the pot with the chicken, arranging the okra on top of the chicken pieces. Add the lemon juice, cover the pan and simmer for another 20 to 25 minutes. The chicken should be cooked through, and the okra should be just tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you wish, remove the chicken to a platter. Stir the okra into the sauce, and add the parsley. Add salt and pepper to taste, then spoon over the chicken and serve. Alternatively, stir everything together in the pot, season, and serve with rice or bulgur. Pass thick plain yogurt for topping."}], "link": "https://cooking.nytimes.com/recipes/1013840-turkish-chicken-and-okra-casserole"}