{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Negimaki", "description": "The simplest way to keep white-meat chicken moist and make it flavorful is to put fat and flavor inside — to stuff it. Here is a chicken-cutlet take on negimaki, the Japanese dish of thinly sliced beef rolled around scallions. You need only briefly cook the scallions in soy sauce and mirin before wrapping some pounded-out chicken cutlets around them. Then baste the chicken with more sauce while it’s cooking, either on the grill or in a broiler, so the salty-sweet glaze permeates the chicken from both inside and out. It takes a little time to pound and roll up chicken cutlets, but not nearly as much time as marinating, and the results are not only more functional but also far more interesting.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2019/07/14/dining/14help/chicken-negimaki-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "asian, japanese", "recipeCategory": "dinner, easy", "keywords": "chicken, soy sauce, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 480}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 395, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "1 gram", "proteinContent": "39 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1864 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup soy sauce", "1/2 cup mirin (or 1/4 cup honey mixed with 1/4 cup water)", "1 tablespoon minced garlic", "1 bunch scallions, trimmed but left whole", "1 1/2 pounds boneless, skinless white-meat chicken (breasts, cutlets or tenders), pounded to 1/8-inch thickness and blotted dry", "Salt", "freshly ground black pepper", "Sesame oil as needed", "Lemon or lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put soy sauce, mirin, garlic and scallions in a medium saucepan over medium-low heat. Cook until bubbling, 3 to 4 minutes. Turn off heat and let cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare charcoal or gas grill; heat should be medium and rack about 4 inches from fire. Sprinkle chicken with salt and pepper on both sides. Remove scallions from soy mixture with slotted spoon and divide evenly among chicken cutlets: Turn wide side of each cutlet to face you and put 2 or 3 scallions on edge closest to you, with some scallion sticking out of each end. Roll each cutlet up like a jelly roll and secure in two or three places with toothpicks or butcher’s twine. Brush chicken rolls with sesame oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill chicken, brushing occasionally with remaining soy mixture and turning each piece once or twice, until cooked through, 12 to 15 minutes. To check for doneness, cut into a piece with a thin-bladed knife; center should be white or slightly pink. Serve hot, warm or at room temperature with lemon or lime wedges."}], "link": "https://cooking.nytimes.com/recipes/1013203-chicken-negimaki"}