{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Cauliflower, Spicy Tomato Sauce and Capers", "description": "This dish is made with perciatelli, hollow long noodles that also go by the name bucatini. Their texture is robust, supporting a robust sauce like this one. Because the noodles are hollow, they cook much more quickly than spaghetti, so keep your eye on them so they don’t get too soft. If you can't find perciatelli, spaghetti makes a fine substitute.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/11/23/science/25recipehealth/25recipehealth-articleLarge-v2.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, pastas", "keywords": "bucatini, canned tomatoes, cauliflower, fall, healthy, high fiber, low cholesterol, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 310}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 477, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "72 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "6 grams", "proteinContent": "19 grams", "saturatedFatContent": "4 grams", "sodiumContent": "659 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 small cauliflower or 1/2 large cauliflower, broken into florets about 1 pound", "Salt to taste", "2 tablespoons extra virgin olive oil", "2 garlic cloves, minced", "1/4 teaspoon red chili flakes", "1 14-ounce can chopped tomatoes with juice, pulsed a few times in a food processor or mini processor", "Pinch of sugar", "2 tablespoons capers, rinsed and chopped", "3/4 pound perciatelli (bucatini)", "1/4 cup chopped fresh parsley", "2 ounces pecorino, grated (1/2 cup), or 1 ounce each pecorino and Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil while you core the cauliflower and break it into florets. Add a generous amount of salt to the water and blanch the cauliflower for 5 minutes, or until tender. Use a skimmer or strainer to scoop the cauliflower from the water and transfer to a bowl of cold water. Drain and chop the florets into small pieces. Keep the water at a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a wide, heavy skillet and add the garlic and chili flakes. Cook, stirring, until the garlic is fragrant, about 30 seconds, and stir in the puréed tomatoes, a pinch of sugar, and salt to taste. Add the capers and cauliflower and simmer 10 to 15 minutes, until the tomatoes have cooked down and smell fragrant. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water in the pot back to a boil and add the perciatelli. Cook al dente, usually about 7 or 8 minutes. Add about 1/2 cup of the pasta water to the pan with the cauliflower and stir. Drain the pasta and add to the pan, along with the parsley and the pecorino. Stir together and serve."}]}