{"@context": "http://schema.org", "@type": "Recipe", "name": "Golden Whole Wheat Bread", "description": "Whole grains tend to absorb more water and produce weaker gluten networks, and I found that kneading, as the recipe directs, gave a lighter, loftier loaf.", "author": {"@type": "Person", "name": "Harold Mcgee"}, "image": "https://static01.nyt.com/images/2014/04/23/dining/goldenwheatbread/goldenwheatbread-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Two 15-ounce round loaves", "recipeCuisine": "", "recipeCategory": "", "keywords": "side dish, whole wheat flour, yeast", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 69}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 991, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "200 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "24 grams", "proteinContent": "36 grams", "saturatedFatContent": "1 gram", "sodiumContent": "656 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 teaspoon active dry yeast", "11 ounces (about 2 1/2 cups) whole wheat flour", "7 3/4 ounce (about 1 1/2 cups) unbleached bread flour, more as needed", "3/4 ounce (about 1/2 cup) wheat bran", "1 tablespoon kosher salt", "Vegetable oil or cooking spray", "Cornmeal, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In small bowl combine yeast with 1/4 cup warm water (105 to 115 degrees) and stir to dissolve. In a medium bowl combine whole wheat flour, bread flour, bran and salt. Add yeast mixture and 2 cups cool water (75 to 78 degrees) to dry ingredients; mix by hand to make a granular mass. Knead about 2 minutes; dough should be very loose and sticky. If necessary add 1 to 2 tablespoons cool water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a large mixing bowl and a sheet of plastic wrap; set aside. Transfer dough to a very lightly floured work surface and knead until somewhat cohesive, 3 to 4 minutes, using as little flour as possible and using a scraper to lift and turn dough. Return dough to bowl and place oiled plastic wrap over surface. Allow to rest for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return dough to work surface and knead again 6 to 7 minutes; dough should be soft and loose. Return to oiled bowl and cover again with oiled plastic wrap. Allow to rise at room temperature for one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Knead dough while still in bowl, gently deflating it with your fingertips. Fold in thirds like a letter, then bring ends in and turn over so seam is underneath. Let rise again for one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat folding and turning process, and let rise again until doubled in volume, about 1 to 1 1/2 hours. When dough is fully risen, an indentation made by poking your finger deep into the dough will not spring back."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle a large baking peel generously with cornmeal, or line a sheet pan with parchment paper. Divide dough into two equal pieces, shaping each into a tight boule (slightly flattened ball). Place loaves on peel or pan, leaving about 4 inches between them to allow for rising. Cover with oiled plastic wrap and allow to rise again until nearly doubled in size, about 1 1/2 hours. If loaves begin to grow together, put in oven before they touch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thirty minutes before baking, heat oven to 450 degrees. Place small cast-iron skillet on floor of a gas oven or lowest rack of an electric oven. Place oven rack two rungs above pan. If using a baking stone, place it on the rack. Fill a plastic spray bottle with water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Score a tic-tac-toe pattern with a sharp knife or razor blade on top of each loaf. Slide loaves into oven. Mist loaves 6 to 8 times, pour 1 cup hot water into skillet and quickly close oven door. After 1 minute, mist with water again, and close oven door."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 15 minutes, then reduce oven temperature to 375 degrees. Continue to bake until loaves are golden brown and sound hollow when tapped on bottom, another 13 to 18 minutes. Place on a rack to cool."}], "link": "https://cooking.nytimes.com/recipes/1013059-golden-whole-wheat-bread"}