{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Chilaquiles With Chicken and Squash", "description": "Of all the dishes I make with tomatillos, this one counts as the greatest comfort food. You can toast the tortillas in a microwave: zap them for one minute at 100 percent power, and turn them over and zap them again. Repeat until they are crisp and brown, then break up into large pieces.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/09/14/health/14recipehealth/14recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "Serves four", "recipeCuisine": "mexican", "recipeCategory": "dinner, weekday, one pot", "keywords": "chicken, corn tortillas, gluten-free, healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 50}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 337, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "7 grams", "proteinContent": "24 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1201 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 medium boneless, skinless chicken breast (6 to 8 ounces), poached and shredded", "1 pound fresh tomatillos, husked and rinsed", "2 or 3 jalapeño or serrano chilies, stemmed, seeded for a milder salsa", "1/4 cup chopped white onion, soaked for five minutes in cold water, then drained and rinsed", "2 large garlic cloves, peeled", "Salt to taste", "12 cilantro sprigs, plus additional chopped cilantro for garnish", "1 tablespoon canola oil", "2 1/2 cups chicken or vegetable stock", "2 medium summer squash, diced (a mixture of green and yellow is pretty)", "8 corn tortillas, toasted in a microwave or in an oven and broken into small pieces", "1/2 cup low-fat Greek-style yogurt or crumbled queso fresco", "Sliced radishes for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Poach the chicken breast, shred or cut into small dice and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tomatillos in a saucepan, fill with water and bring to a simmer. Simmer 10 minutes, turning them over halfway through. Drain and place in a blender. Add the chilies, chopped onion, garlic, salt and cilantro sprigs. Blend until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, heavy saucepan or skillet over medium-high heat. Drizzle in a drop of oil to test the heat. If it sizzles and sputters immediately, the oil is hot enough. Add the tomatillo purée and stir constantly until it thickens and begins to stick to the pan, about five minutes. When you run your spoon down the middle of the pan it should leave a canal. Stir in the stock, bring to a simmer and simmer 10 minutes, stirring often. Add the summer squash and simmer, stirring often, until tender, about 10 minutes. The sauce should coat the front and back of your spoon. Stir in the chicken and heat through. Taste and adjust seasoning. Just before serving bring to a simmer and stir in the tortilla chips. Garnish with the yogurt or cheese, sliced radishes and chopped cilantro. Serve at once."}]}