{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek Baked Beans With Honey and Dill", "description": "These beans become creamy as they bake slowly in a sweet and sour broth flavored with honey and vinegar. You can make the dish with regular white beans, which will require soaking, or with large lima beans, which will not.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/02/24/science/26recipehealth_600a/26recipehealth_600a-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves six", "recipeCuisine": "greek", "recipeCategory": "one pot", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegetarian, lima beans, tomato, white beans, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 185}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 212, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "7 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "629 milligrams", "sugarContent": "14 grams", "transFatContent": null}, "recipeIngredient": ["1 pound dried large lima beans or white beans, soaked if necessary for six hours or overnight in 2 quarts of water and drained (limas require no soaking)", "1/4 cup extra virgin olive oil", "1 large onion, preferably a sweet red onion, finely chopped", "1 28-ounce can chopped tomatoes", "1 bay leaf", "3 tablespoons honey, such as clover or acacia", "2 tablespoons tomato paste", "1/4 cup red wine vinegar or sherry vinegar", "Salt", "freshly ground black pepper to taste", "1/2 cup, loosely packed, chopped fresh dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the drained beans and water to cover by 3 inches in a large, oven-proof casserole or Dutch oven, and bring to a boil. Reduce the heat, cover and simmer 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat the oven to 375 degrees. Heat 2 tablespoons of the olive oil in a medium size, heavy skillet over medium heat, and add the onion. Cook, stirring often, until tender and lightly caramelized, 10 to 15 minutes. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 30 minutes, drain the beans and return them to the pot. Add the remaining olive oil, the tomatoes and the liquid in the can, bay leaf, honey, and 2 cups water or enough to just cover the beans. Stir in the onion, and bring the mixture to a simmer. Cover and place in the oven. Bake one hour, stirring often and adding water if necessary. Add the tomato paste, vinegar, salt and pepper. Cover and simmer for 30 more minutes, until the beans are tender and the mixture is thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the dill, cover and let sit 15 minutes. Taste and adjust seasonings. Serve with thick slices of country bread."}], "link": "https://cooking.nytimes.com/recipes/1013049-greek-baked-beans-with-honey-and-dill"}