{"@context": "http://schema.org", "@type": "Recipe", "name": "Veal Chops Beau Séjour", "description": "Lotti Morris from Bennington, Vt., wrote: “I’m still using the original copy from the paper, now deep yellow with age, fragile, held together with Scotch tape. We were married 13 years when I first found it and tried it. It has been 50 years now, and this favorite dinner, I think, has contributed to the longevity of our marriage. It’s so easy, so quick. I couldn’t do without it.”", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Veal-Chops/Veal-Chops-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner, easy, weekday, one pot", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 146}, "recipeIngredient": ["6 veal chops, preferably cut from the rack, each 1½ inches thick and frenched (ask the butcher to do this)", "Flour", "¼ cup vegetable oil", "4 tablespoons unsalted butter", "6 cloves garlic (peeled, if you like)", "2 medium bay leaves", "½ teaspoon dried thyme", "Salt", "freshly ground black pepper", "2 tablespoons red wine vinegar", "½ cup chicken stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly dredge the chops on all sides in flour. In a lidded skillet large enough to hold all 6 chops, heat the oil and 3 tablespoons of the butter. Brown the chops on all sides, 8 to 10 minutes total."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the garlic cloves around the chops. Cut each bay leaf into 3 pieces. Place 1 piece on each chop. Add thyme, salt and pepper. Cook the chops, tightly covered, over moderate to low heat for about 20 minutes, or until they are cooked through and the natural sauce in the skillet is syrupy. Transfer the chops to a hot serving dish and keep warm. Leave the garlic and bay leaves in the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vinegar to the skillet and cook over medium-high heat, stirring, until it has evaporated. Add the stock and ¼ cup water and reduce to your liking. Check the seasoning. Turn off the heat and swirl in the remaining tablespoon of butter. Pour the sauce over the chops and garnish each chop with 1 clove of garlic and 1 piece of bay leaf. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1013292-veal-chops-beau-sejour"}