{"@context": "http://schema.org", "@type": "Recipe", "name": "Yogurt Soup With Spelt, Cucumbers and Watercress", "description": "Chilled soups are terrific in sweltering summer heat. This yogurt soup in particular has nice body and crunch, from the substantial whole grains (spelt, farro or wheat berries) and finely chopped cucumbers. The addition of watercress, diced tomatoes, herbs, garlic and lemon juice means that every spoonful ferries with it a mix of flavors and textures. Use good quality plain yogurt here (preferably whole-milk yogurt, though low-fat is fine), and you will be rewarded with an authentically tangy, creamy soup that manages to be filling and refreshing. \n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/07/20/science/22recipehealth/22recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "weekday, soups and stews", "keywords": "appetizer, healthy, vegetarian, summer, vegetables, wheat berries, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 163, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "848 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup spelt, farro or wheat berries, preferably soaked for an hour or more and drained (don’t worry if you haven’t done this, although they make take longer to cook)", "2 cups water", "Salt to taste", "1 quart plain low-fat or whole-milk yogurt (free of gums and stabilizers) or buttermilk, or a mixture of the two", "2 ripe but firm tomatoes, cut in small dice", "1 cup finely chopped seeded cucumber (no need to seed if using Persian or European cucumbers)", "1 small bunch watercress, thick stems discarded, coarsely chopped", "1 to 2 garlic cloves to taste, finely minced or puréed with a little salt in a mortar and pestle", "2 tablespoons freshly squeezed lemon juice", "3/4 cup cold water (more as desired)", "1/4 cup finely chopped dill, parsley, mint or cilantro", "2 tablespoons snipped chives", "Freshly ground pepper to taste", "3 or 4 radishes, thinly sliced, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the spelt, water and salt to taste, and bring to a boil. Reduce the heat, and simmer about 50 minutes to an hour until tender and some of the kernels have begun to splay. Remove from the heat, drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the spelt is cooking, place the cucumber in a bowl and sprinkle with salt. Toss and place in a strainer set over the bowl. Allow to drain for 30 minutes. Rinse well, and drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all the ingredients except the radishes. Season to taste with salt and pepper. Chill for two hours or longer. Serve, garnishing each bowl with the sliced radishes."}], "link": "https://cooking.nytimes.com/recipes/1013750-yogurt-soup-with-spelt-cucumbers-and-watercress"}