{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Cooked Summer Squash With Tomatoes and Basil", "description": "This Provençal summer dish is delightful as a starter or as a side dish with fish, chicken or cooked grains.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/08/19/health/19recipehealth/19recipehealth-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "weekday", "keywords": "basil, summer squash, tomato, healthy, vegan, vegetarian, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 214}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 75, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "455 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 1/2 pounds medium or small zucchini or other summer squash, thinly sliced or diced depending on what shape squash you use", "2 garlic cloves, minced", "1 pound ripe tomatoes, grated on the large holes of a box grater, or peeled, seeded and diced", "Salt", "freshly ground pepper", "1 to 2 tablespoons chopped or slivered fresh basil (to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium-high heat in a wide, heavy skillet. Add the zucchini. Cook, stirring or shaking the pan, until the zucchini is lightly seared and beginning to soften, three to five minutes. Remove from the pan, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining olive oil to the pan, then the garlic. Cook, stirring, just until fragrant -- less than 30 seconds. Stir in the tomatoes. Cook, stirring, until the tomatoes have begun to cook down, about five minutes. Return the zucchini to the pan, add salt and pepper to taste, and reduce the heat to medium. Cook, stirring often, until the zucchini is tender and translucent and the tomatoes have cooked down to a fragrant sauce. Stir in the basil, and taste and adjust seasonings. Remove from the heat and serve hot, or allow to cool and serve at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1013799-pan-cooked-summer-squash-with-tomatoes-and-basil"}