{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole-Wheat and Walnut Breadsticks", "description": "I used walnut oil instead of olive oil in these nutty breadsticks. Chop the walnuts finely so that they don’t tear the dough when you shape the breadsticks.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/06/08/science/10recipehealth/10recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H10M", "recipeYield": "Two dozen breadsticks", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, healthy, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 85, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "82 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2 teaspoons active dry yeast", "1 1/2 cup lukewarm water", "1 teaspoon honey, agave nectar, malt extract or rice syrup", "1/4 cup walnut oil", "2 cups whole-wheat flour", "About 1 1/3 cups unbleached all-purpose flour", "1/2 cup finely chopped walnuts", "1 1/2 teaspoons salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dissolve the yeast in the water in a large bowl or in the bowl of a stand mixer. Stir in the honey, agave nectar, malt extract or rice syrup. Let stand for five minutes. Stir in the walnut oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the whole-wheat flour, 1 cup of the unbleached all-purpose flour, the walnuts and the salt. Add to the liquid mixture. If kneading by hand, stir until you can turn the dough out onto a lightly floured surface; knead for 10 minutes, adding flour as necessary to keep the dough from sticking to your hands and worktop. If using an electric mixer, mix at medium speed for 8 to 10 minutes. Add flour as necessary so that the dough comes away from the sides of the bowl. The dough should be elastic and just slightly sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly flour your work surface or brush with walnut oil. Using your hands or a rolling pin, roll the dough into a 14-by-4-inch rectangle. Make sure there is enough flour or oil underneath the dough so that it doesn’t stick to the work surface. Brush the top with oil. Cover with plastic wrap, then with a damp kitchen towel. Allow to rise for 1 to 1 1/2 hours until nearly doubled. (If you need the workspace, lightly oil the underside of a sheet pan and place the dough on top.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees with the racks positioned in the middle and upper thirds of the interior space. Brush sheet pans with olive oil or walnut oil. Cut the dough crosswise into four equal pieces. Cut each piece crosswise into six equal pieces. Roll each between the board and your hands as if you were making a rope until it is as long as the baking sheet. For a tighter strip, twist the strands from one end to the other. Place 1 inch apart on the baking sheets until you’ve filled two baking sheets. Continue to shape the remaining breadsticks while the first batch is baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven, and bake 15 minutes. Switch the pans top to bottom and front to back, and bake another 10 minutes until the breadsticks are nicely browned. (They will be darker on the bottom; you can flip them over halfway through for more even baking.) Remove from the heat, and cool on a rack. Shape and bake any remaining dough as instructed."}], "link": "https://cooking.nytimes.com/recipes/1013635-whole-wheat-and-walnut-breadsticks"}