{"@context": "http://schema.org", "@type": "Recipe", "name": "Ricotta and Spinach Frittata With Mint", "description": "I have a lot of spinach in my garden right now, and what doesn’t wind up in salads is going into frittatas. This one is lightly speckled with steamed spinach and seasoned with fresh mint.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/03/23/health/23recipe/23recipe-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, easy, quick, weekday", "keywords": "eggs, spinach, gluten-free, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 164}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 182, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "1 gram", "proteinContent": "11 grams", "saturatedFatContent": "5 grams", "sodiumContent": "277 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 ounces fresh spinach, stemmed and washed, or 1/2 6-ounce bag baby spinach", "6 eggs", "Salt", "freshly ground pepper", "1 cup fresh ricotta", "1 tablespoon chopped fresh mint", "1 garlic clove, minced", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the spinach above 1 inch of boiling water just until it wilts, about two minutes. Rinse with cold water, squeeze out excess moisture and chop fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, beat together the eggs, salt, pepper, ricotta, garlic, spinach and mint."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium-high heat in a heavy 10-inch nonstick skillet. Drop a bit of egg into the pan; if it sizzles and cooks at once, the pan is ready. Pour in the egg mixture. Tilt the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the frittata with the spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat down to low, cover and cook 10 minutes, shaking the pan gently every once in a while. From time to time, remove the lid, tilt the pan and loosen the bottom of the frittata with a wooden spatula so that the bottom doesn’t burn. It should turn a golden color. The eggs should be just about set; cook a few minutes longer if they’re not."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the broiler. Uncover the pan and place under the broiler, not too close to the heat, for one to three minutes, watching very carefully to make sure the top doesn’t burn (at most, it should brown very slightly and puff under the broiler). Remove from the heat, shake the pan to make sure the frittata isn’t sticking, and allow it to cool for at least five minutes and for as long as 15 minutes. Loosen the edges with a wooden or plastic spatula. Carefully slide from the pan onto a large round platter. Cut into wedges or into smaller bite-size diamonds. Serve hot, warm, at room temperature or cold."}], "link": "https://cooking.nytimes.com/recipes/1013525-ricotta-and-spinach-frittata-with-mint"}