{"@context": "http://schema.org", "@type": "Recipe", "name": "Brussels Sprouts and Roasted Winter Squash Hash", "description": "To this colorful winter hash I’ve added cooked black rice, which contributes a chewy texture and an earthy flavor that plays well against the sweetness of the squash and the seared brussels sprouts.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/02/16/science/15recipehealth/15recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves four to six", "recipeCuisine": "", "recipeCategory": "brunch, dinner", "keywords": "brussels sprouts, winter squash, fall, winter, gluten-free, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 166}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 170, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "6 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "564 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds winter squash, like butternut, halved, seeds and membranes scraped away", "1 pound brussels sprouts, preferably small ones", "2 tablespoons extra virgin olive oil", "1 bunch scallions, sliced thin", "2 garlic cloves, minced", "Salt", "freshly ground pepper", "2 tablespoons tomato paste, dissolved in 1/4 cup water", "1 cup cooked black rice", "Poached eggs for serving optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Cover a baking sheet with foil, and lightly oil the foil. Brush the cut sides of the squash with olive oil, and set on the baking sheet with the cut sides down. Bake 30 to 40 minutes until easily pierced with a paring knife. Remove from the heat, allow to cool until it can be handled, and peel and dice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the squash is in the oven, trim away the bottoms of the brussels sprouts and cut into quarters."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium-high in a large, heavy skillet. Add the brussels sprouts. Cook, stirring often or tossing in the pan, until just tender and the edges are seared light brown, about five minutes. Add salt to taste, and stir in the scallions and garlic. Stir together for a few minutes until the scallions and garlic are fragrant. Stir in the squash. Cook, stirring often, until the squash has caramelized lightly, about 10 minutes. It’s fine if the squash falls apart in the pan. Season to taste with salt and pepper, and stir in the dissolved tomato paste. Continue to cook, stirring, until the tomato paste has caramelized, about five minutes. The tomato paste mixture will no longer be visible, but there should be rusty-colored traces on the bottom of your skillet. Stir in the black rice. Heat through, taste and adjust seasonings, and serve, topped with a poached egg if desired."}]}