{"@context": "http://schema.org", "@type": "Recipe", "name": "French Lentils with Chard", "description": "This hearty one-dish vegetarian meal is meant to appeal to families that include a mix of meat-eaters and vegetarians. A great pot of beans or lentils, even when you add to it a bunch of chard from the farmers’ market, costs no more than $4 to make, and it feeds four to six people. This combo of lentils and greens is inspired by a classic preparation for the tasty French Le Puy green lentils that traditionally includes salt pork and/or bacon and sausage. For this vegetarian version, I don’t insist on Le Puy lentils, although I highly recommend them. Meat eaters in the family might want to accompany this with sausage, cooked separately or with the lentils. I recommend topping the lentils with goat cheese or feta.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/10/11/science/10recipehealth/10recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H10M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "dinner, one pot", "keywords": "dairy-free, gluten-free, healthy, high fiber, kosher, low cholesterol, vegan, vegetarian, french green lentils, swiss chard, vegetables, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 173}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 323, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "10 grams", "proteinContent": "21 grams", "saturatedFatContent": "0 grams", "sodiumContent": "455 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 onion, chopped", "2 carrots, chopped", "1 celery stalk, chopped", "4 large garlic cloves, minced", "1 pound lentils, preferably imported green lentils, washed and picked over 2 1/4 cups", "A bouquet garni made with 2 bay leaves, a Parmesan rind and a sprig or two each of thyme and parsley", "Salt", "freshly ground pepper", "1 bunch Swiss chard (3/4 to 1 pound), stemmed, washed and coarsely chopped", "Freshly grated Parmesan, crumbled goat cheese or feta for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium-high heat in a heavy soup pot or Dutch oven. Add the onion and cook, stirring, until it begins to soften, about 3 to 5 minutes. Add the carrot and celery and cook, stirring, until all the vegetables are tender, about 5 minutes. Add the garlic and continue to cook, stirring, until fragrant, 30 seconds to a minute. Add the lentils, 2 quarts water and bouquet garni. Bring to a boil, reduce the heat, and simmer 40 minutes. Add salt and pepper to taste. Remove the bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the chard into the simmering lentils. Cook another 10 minutes or so, until the lentils and greens are tender. The chard should be tender but still bright. Taste, adjust seasonings and serve, passing the cheese at the table for sprinkling. Alternatively, transfer to an oiled baking dish, top with rounds of goat cheese, crumbled feta or grated Parmesan, and heat through in a medium oven."}], "link": "https://cooking.nytimes.com/recipes/1013867-french-lentils-with-chard"}