{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Lamb With Cumin, Scallions and Red Chiles", "description": "Dongbei cai is the food of  Northeast China. Weiliang Chen, the chef at Northeast Taste Chinese Food, the biggest of the Dongbei restaurants in Queens, makes an elegant, tender version of a popular Dongbei stir-fry of lamb with dried chilies, made fragrant and crunchy with cumin seeds — a legacy of the nomadic Mongols who long ruled Central Asia, carrying spices on horseback along with their arrows. Lamb is considered a Northern taste and excessively “strong” by many Chinese cooks; it is always cooked with powerful aromatics, like chili peppers and garlic, to subdue it.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/01/dining/lamb-cumin-scallions/lamb-cumin-scallions-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "asian, chinese", "recipeCategory": "dinner, easy, quick, weekday, one pot", "keywords": "dried red chile, lamb, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 449}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 379, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "1 gram", "proteinContent": "22 grams", "saturatedFatContent": "8 grams", "sodiumContent": "367 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon egg white", "1 tablespoon rice wine or dry sherry", "2 teaspoons cornstarch", "1 teaspoon salt, more to taste", "1/2 teaspoon black pepper", "1 pound boneless leg of lamb or lamb shoulder, cut into strips about 1/2 inch by 2 inches", "3 tablespoons vegetable oil", "2 tablespoons cumin seeds, lightly cracked in a mortar or grinder", "2 tablespoons whole dried red chile peppers, about 2 inches long", "4 scallions, white and green parts only, cut on diagonal into 1-inch lengths", "Sesame oil, for seasoning"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl combine egg white, wine, cornstarch, salt and pepper. Add lamb and set aside to marinate 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large wok or skillet over high heat until a drop of water sizzles on contact. Swirl half the oil into wok and carefully add lamb, spreading it in a single layer. Let sear a moment, then stir-fry briskly just until lamb is no longer pink. Transfer to a plate. (If your wok is not large enough to hold all the lamb, do this in 2 batches, using extra oil.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl remaining 1 1/2 tablespoons oil into empty wok, add cumin seeds and chiles and stir-fry a few seconds until cumin seeds start to pop. Press chiles against sides of wok to char their skins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add scallions and stir-fry 1 minute. Then return lamb to wok and stir-fry 1 to 2 minutes more until lamb is cooked through. Turn off heat, sprinkle with salt and drops of sesame oil, and serve immediately."}]}