{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato and Chard Stalk Gratin", "description": "If your Swiss chard has wide stems, keep them handy. You can use them in a number of dishes, including this rich gratin.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/02/02/science/04recipehealth/04recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "dinner, casseroles", "keywords": "healthy, vegetarian, main course, potato, swiss chard", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 267, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "3 grams", "sodiumContent": "857 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 pound small boiling potatoes, scrubbed", "Salt to taste", "1 pound wide Swiss chard stems from 1 large or 2 smaller bunches, trimmed and cut crosswise into 1/2 inch thick slices", "1 garlic clove, halved", "2 tablespoons extra virgin olive oil", "2 tablespoons finely chopped shallot or onion optional", "2 tablespoons all-purpose flour", "2 cups low-fat (1 percent or 2 percent) milk", "Freshly ground white or black pepper", "1 teaspoon thyme leaves", "1 ounce Gruyère, grated 1/4 cup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the potatoes in a saucepan, and cover with water. Add 1/2 teaspoon salt, and bring to a boil. Reduce the heat to medium, and boil gently until tender, 10 to 20 minutes, depending on the size of the potatoes. Add the chard stalks to the pot, and simmer for another five minutes until crisp-tender. Drain, and retain the cooking liquid if you prefer to use it instead of milk for the béchamel. Cut the potatoes into quarters or halves, depending on their size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Rub a 2-quart baking dish or gratin with the cut clove of garlic, and brush with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the béchamel. Heat the oil over medium heat in a heavy medium saucepan. Add the shallot or onion, and cook, stirring, until softened, about three minutes. Stir in the flour, and cook, stirring, for about three minutes until smooth and bubbling but not browned. It should have the texture of wet sand. Whisk in the milk all at once, and bring to a simmer, whisking all the while, until the mixture begins to thicken. Turn the heat to very low and simmer, stirring often with a whisk and scraping the bottom and edges of the pan with a rubber spatula, for 10 to 15 minutes until the sauce is thick and has lost its raw flour taste. Season with salt and pepper. Strain while hot into a heatproof bowl or a Pyrex measuring cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the potatoes into quarters or halves, depending on their size. Combine with the chard stalks and thyme in a large bowl, and season with salt and pepper. Add the béchamel, and stir until the vegetables are coated with sauce. Scrape into the gratin dish. Sprinkle the Gruyère on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 20 to 25 minutes until bubbling and beginning to brown on the top. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1013463-potato-and-chard-stalk-gratin"}