{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek Yellow Split Pea Purée", "description": "If you’ve ever been to Greece, you’re probably familiar with the delicious yellow split pea puree called fava. It’s served in tavernas all over the country and is standard fare on the Lenten table. It’s important to cook the split peas for a very long time, slowly, until they disintegrate into a purée. Greeks use much more olive oil than this recipe calls for, and they top their fava with chopped onion, sometimes caramelized and mixed with fresh herbs. I prefer a drizzle of olive oil. Yellow split peas are easy to find in Mediterranean and Indian markets, as well as many supermarkets.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/02/24/health/25recipehealth_600/25recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT2H45M", "recipeYield": "Serves six to eight", "recipeCuisine": "greek", "recipeCategory": "dips and spreads", "keywords": "appetizer, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, yellow split peas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 28}, "recipeIngredient": ["1/4 cup extra virgin olive oil", "1 medium red onion, chopped", "2 cups yellow split peas, washed and picked over", "Salt to taste", "1 to 2 tablespoons freshly squeezed lemon juice (optional)", "Pita bread, endive or small romaine lettuce leaves, or crudités for dipping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the olive oil over medium heat in a large, heavy saucepan, and add the onion. Cook, stirring, until tender, five to six minutes. Add the split peas and enough water to cover by an inch, and bring to a boil. Skim foam off the top, reduce the heat, cover and simmer one hour. Add salt to taste, and continue to simmer for 30 minutes to an hour until the beans fall apart and sink to the bottom of the pot. Stir often to prevent them from sticking. The water should cloud, and some of the split peas will be intact while others will disintegrate. Continue to simmer until they have mostly disintegrated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the beans have fallen apart and are soft and fragrant, remove the pot from the heat and cover with a clean kitchen towel. Replace the lid and let sit for 20 minutes. If the mixture looks more like a soup than a purée, with most of the liquid on the top, place a strainer over a bowl and pour the mixture into the strainer. Let sit for 10 minutes while the liquid runs through the strainer, then return the split peas to the pot. Taste and adjust salt. Moisten as desired with the broth. Add a generous amount of pepper, and whisk in the remaining olive oil and the lemon juice. Whisking helps break down the split peas and contributes to a smooth texture. Transfer to a bowl or plate, top with a drizzle of olive oil and serve."}], "link": "https://cooking.nytimes.com/recipes/1013050-greek-yellow-split-pea-puree"}