{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey and Rice Casserole With Yogurt Topping", "description": "This Middle Eastern dish may include fried stale pita bread doused with chicken or turkey stock in a casserole and topped with the other ingredients. In the days after Thanksgiving, I’m likely to have all of these ingredients on hand -- except for pita, so here I’ve made it without.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/11/30/science/30recipehealth/30recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H10M", "recipeYield": "Serves six", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fall, winter, gluten-free, healthy, main course, turkey, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 43}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 359, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "1 gram", "proteinContent": "22 grams", "saturatedFatContent": "5 grams", "sodiumContent": "708 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 teaspoon ground allspice", "3/4 teaspoon ground cinnamon", "1/4 teaspoon ground pepper", "1 medium onion, chopped", "2 tablespoons extra virgin olive oil", "1 cup basmati rice, rinsed in several changes of water", "2 1/2 cups chicken or turkey stock", "Salt to taste", "3 garlic cloves", "2 cups shredded turkey", "2 cups drained yogurt or thick Greek-style yogurt", "2 tablespoons fresh lemon juice", "1/4 cup crushed or finely chopped walnuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the allspice, cinnamon and pepper, and divide into two equal portions (1 teaspoon each).  Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a heavy 2- or 3-quart saucepan. Add the onion and a pinch of salt. Cook, stirring, until tender, about five minutes. Add the rice and 1 teaspoon of the spice mixture, and stir until the grains begin to crackle. Add 2 cups chicken stock and salt to taste (1/2 to 3/4 teaspoon). Bring to a boil, reduce the heat and simmer 15 minutes until the liquid has been absorbed by the rice. Remove the lid, place a kitchen towel over the pot and then return the lid. Allow to sit undisturbed for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Oil a 2-quart baking dish. Heat the remaining tablespoon of oil over medium heat in a large, heavy skillet. Add the garlic. In a few seconds, as soon as it begins to smell fragrant, add the remaining spices and the turkey. Stir together for about a minute until the turkey is coated with the mixture. Remove from the heat. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the rice in the casserole in an even layer. Top with the turkey. Douse with the remaining stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the garlic in a mortar and pestle with a pinch of salt, and puree. Stir into the yogurt, along with the lemon juice. Spread over the turkey in an even layer, making sure to completely cover the meat so that it doesn’t dry out in the oven. Sprinkle on the nuts. Place in the oven, and bake 15 to 20 minutes, just until warmed through. Do not allow the yogurt to bubble. Serve hot or warm."}]}