{"@context": "http://schema.org", "@type": "Recipe", "name": "Clam or Mussel Stew With Greens and Beans", "description": "This is a great winter seafood stew adapted from a much richer recipe by Mark Peel, executive chef of Campanile Restaurant in Los Angeles. It’s easy to make and easy to serve.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/03/10/science/10recipehealth_600a/10recipehealth_600a-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "Serves four to six", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "clams, greens, white beans, dairy-free, gluten-free, healthy, high fiber, low sugar, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 428, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "4 grams", "proteinContent": "51 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1883 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound kale, collards or other greens, stemmed and washed in two or three changes of water", "2 tablespoons extra virgin olive oil", "4 pounds medium-sized clams or mussels (or use a mixture of the two), purged", "1 large shallot, finely chopped", "3 large garlic cloves, sliced", "1/2 cup dry white wine", "A few sprigs each parsley and thyme", "Salt", "freshly ground pepper", "1 15-ounce can white beans, drained and rinsed", "1 cup chicken stock", "1 tablespoon chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Fill a bowl with ice water. When the water in the pot comes to a boil, salt generously and add the greens. Cook for one to three minutes (depending on the type of green) until just tender. Transfer to the ice water. Allow to cool for a few minutes, then drain, squeeze dry and chop. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the clams or mussels in batches. In a large, lidded pan over medium heat, combine 1 tablespoon of the shallots, one garlic clove, the wine, parsley and thyme sprigs and half the clams or mussels. Bring to a boil, cover and cook about four minutes until they just open. Remove from the pan using tongs, and place in a bowl. Repeat with the remaining clams or mussels. When the seafood is cool enough to handle, remove from the shells, holding the shells over the bowl to catch their juice. Rinse briefly in case there is any lingering sand. Cut the clams in half if they’re large. Strain the liquid in the pan through a cheesecloth-lined strainer into a small bowl, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pan to medium heat, and add 1 tablespoon of olive oil. Add the remaining shallots and garlic and salt to taste. Cook gently for three to four minutes until the shallots are tender. Add the remaining tablespoon of olive oil and the chopped blanched greens. Cook, stirring over medium heat, for five minutes. Slowly pour the strained seafood juice into the pan, then add the beans and chicken stock. Bring to a simmer. Simmer five to 10 minutes. The greens should be very tender. Stir in the seafood, add several twists of the pepper mill, taste and adjust salt. Heat through and serve."}], "link": "https://cooking.nytimes.com/recipes/1013077-clam-or-mussel-stew-with-greens-and-beans"}