{"@context": "http://schema.org", "@type": "Recipe", "name": "Plum and Fig Crumble With Quinoa-Oat Topping", "description": "At a farmers’ market, seek out sweet plums, ripe but firm, for this dazzling crumble. I also like a reddish, pink-fleshed hybrid called a plumcot, which is an apricot-plum hybrid. Plums are high in antioxidants called phenols, a very good source of vitamin C and, to a lesser extent, of vitamin A, riboflavin and potassium.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/10/05/science/06recipehealth600/06recipehealth600-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "Serves eight", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, healthy, summer", "aggregateRating": null, "recipeIngredient": ["2 pounds plums, preferably a red-fleshed variety like elephant hearts, or plumcots, pitted and cut into sixths", "6 fresh figs, stemmed and cut in half", "2 tablespoons sugar, preferably organic", "2 teaspoons rose water", "1/2 teaspoon cinnamon", "1 tablespoon plum brandy or red wine (optional)", "1 teaspoon arrowroot", "1 batch quinoa-oat crumble topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mix together the plums, figs, rose water, cinnamon and brandy or wine. Cover and let sit for one to two hours, in or out of the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Butter a two-quart baking dish. Whisk the arrowroot into the juice, and scrape the fruit and all of the juice into the baking dish. Set the baking dish on a baking sheet for easier handling, and place in the oven. Bake 20 to 25 minutes until the fruit is bubbling and the liquid syrupy. Remove from the oven, and allow to cool if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 30 minutes before serving, spread the crumble topping over the plum mixture in an even layer. Bake 20 minutes, or until the fruit is bubbling and the topping is nicely browned. Remove from the heat, and allow to cool for at least 10 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1013290-plum-and-fig-crumble-with-quinoa-oat-topping"}