{"@context": "http://schema.org", "@type": "Recipe", "name": "Carrot and Leek Frittata With Tarragon", "description": "Tarragon enhances the sweetness of the carrots and leeks in this bright frittata.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/03/24/science/24recipehealth/24recipehealth-articleLarge-v2.jpg", "totalTime": "PT50M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, easy, weekday", "keywords": "carrot, eggs, gluten-free, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 73}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 158, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "285 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 1/2 cups finely sliced or diced carrot", "1 1/2 cups finely sliced leeks", "Salt", "freshly ground pepper to taste", "2 garlic cloves, minced", "8 eggs", "2 tablespoons milk", "1/4 cup finely chopped tarragon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil over medium heat in a 10-inch heavy nonstick skillet. Add the carrots and leeks. Cook, stirring often, until tender, five to eight minutes. Stir in the garlic, season to taste with salt and pepper. Cook, stirring, for 30 seconds to one minute, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs and milk together in a large bowl. Stir in salt to taste (about 1/2 teaspoon), pepper, the cooked carrots and leeks, and the tarragon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and dry the pan, and return to the burner, set on medium-high. Heat the remaining tablespoon of olive oil in the skillet. Drop a bit of egg into the pan, and if it sizzles and cooks at once, the pan is ready. Pour in the egg mixture. Tilt the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the frittata with a spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to low, cover and cook 10 minutes, shaking the pan gently every once in a while. From time to time, remove the lid, tilt the pan and loosen the bottom of the frittata with a wooden spatula so that it doesn’t burn. The bottom should turn a golden color. The eggs should be just about set; cook a few minutes longer if they’re not."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the broiler. Uncover the pan and place under the broiler, not too close to the heat, for one to three minutes, watching very carefully to make sure the top doesn’t burn (at most, it should brown very slightly and puff under the broiler). Remove from the heat, shake the pan to make sure the frittata isn’t sticking, and allow it to cool for at least five minutes and for as long as 15 minutes. Loosen the edges with a wooden or plastic spatula. Carefully slide from the pan onto a large round platter. Cut into wedges or into smaller bite-size diamonds. Serve hot, warm, at room temperature or cold."}], "link": "https://cooking.nytimes.com/recipes/1013527-carrot-and-leek-frittata-with-tarragon"}