{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom Quesadillas", "description": "Mushrooms make a meaty quesadilla filling. If you cook them in advance and keep them in the refrigerator, you can slap these together in a pinch.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/03/15/science/17recipehealth/17recipehealth-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "Two quesadillas", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, quick, weekday", "keywords": "corn tortillas, mushroom, gluten-free, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 172}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 308, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "7 grams", "proteinContent": "11 grams", "saturatedFatContent": "7 grams", "sodiumContent": "408 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 shallot, minced optional", "6 ounces regular or wild mushrooms, trimmed and sliced about 1/4 inch thick", "1 to 2 garlic cloves, minced", "1 jalapeño or serrano chili, minced seeded for a milder flavor", "1 tablespoon chopped cilantro or epazote", "Salt", "freshly ground pepper", "4 corn tortillas", "2 ounces grated Monterey Jack, Cheddar, or mixed cheeses 1/2 cup", "Salsa for serving optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the mushroom filling. Heat the oil over medium heat in a large, heavy frying pan. Add the shallot. Cook, stirring, until tender, about three minutes. Stir in the mushrooms. Cook, stirring, until tender and juicy, about five minutes. Add the garlic, chili, and salt and pepper. Cook, stirring, for another minute. Stir in the cilantro or epazote, and remove from the heat. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a microwave: Place a corn tortilla on a plate. Top with half the mushrooms, and spread in an even layer. Sprinkle on half the cheese, and top with another tortilla. Press down gently, then microwave for 1 to 1 1/2 minutes, until the cheese has melted. Remove from the microwave, cut into quarters or sixths and serve. Repeat with the remaining ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pan: Place a corn tortilla in a pan. Top with half the mushrooms, and spread in an even layer. Sprinkle on half the cheese. Turn the heat to medium-high, and heat until the cheese begins to melt. Place another tortilla on top of the cheese, and press down lightly. Flip the quesadilla over in the pan, and heat for about 30 seconds or until the cheese has melted. Flip back over, and remove to a plate. Cut into quarters or sixths, and serve. Repeat with the remaining ingredients."}]}