{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Seared Mackerel With Sweet Peppers and Thyme", "description": "Mackerel escabèche is one of those dishes I have always preferred to admire from afar. It’s traditionally prepared by pickling the fillets in vinegar, but I’ve never quite cottoned to its biting flavor. To me, it overwhelms the delicacy of a good fresh piece of fish.\n\nAt home, I sprinkled the fish fillets with salt, pepper and some sweet paprika. Then I let them sit while I slowly stewed the leeks, carrots and peppers with some garlic and thyme.\n\nI seared the fish until lightly browned but still very moist inside. When people say they don’t like mackerel because it’s too strong and dry, it’s usually because the fish has been overcooked. But when cooked right, until just flaky in the center, the flesh is mild and almost buttery.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/mackerel-peppers-thyme/mackerel-peppers-thyme-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday, one pot", "keywords": "fish, mackerel, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 67}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 561, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "3 grams", "proteinContent": "28 grams", "saturatedFatContent": "7 grams", "sodiumContent": "397 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 1/4 pounds mackerel fillets", "1/2 teaspoon kosher salt, more for seasoning", "1/2 teaspoon black pepper, more for seasoning", "1/2 teaspoon sweet paprika", "6 tablespoons extra virgin olive oil, more as needed", "2 leeks, white and light green parts only, thinly sliced", "2 carrots, peeled and thinly sliced into rounds", "1 small red bell pepper, thinly sliced", "1 small orange or yellow bell pepper, thinly sliced", "5 large thyme sprigs", "3 garlic cloves, minced", "1/2 cup dry rosé or white wine", "1/2 teaspoon sherry vinegar, more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season mackerel with salt, black pepper and paprika. Let fillets rest at room temperature while preparing vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large skillet over medium heat and add 5 tablespoons oil. Then add leeks, carrots, bell peppers and thyme, cooking them until they soften, about 10 to 12 minutes. Add garlic, stirring gently, and cook for 2 minutes more. Add wine and cook until most of liquid has evaporated, about 7 minutes. Season to taste with more salt, pepper and sherry vinegar, then transfer to one side of a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe the skillet with a paper towel, add remaining oil, and set over high heat. When oil is hot, add mackerel in one layer, skin side down. Cook for 3 minutes, then flip and cook for 1 to 2 minutes longer, until fish is cooked through. Add fillets to platter and spoon vegetables on top of fish."}], "link": "https://cooking.nytimes.com/recipes/1013307-pan-seared-mackerel-with-sweet-peppers-and-thyme"}