{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Bourbon Bundt Cake", "description": "One of my favorite pie alternatives is bundt cake. A hearty spice-filled bundt cake made from grated apples and toasted nuts, then soaked in whiskey syrup, defies the cliché of Thanksgiving dessert, yet keeps well within its harvest-time paradigm. Plus, a bundt cake, which is really just like an oversize muffin baked in a fancy pan, is easy to whip up. The booze bath helps keep it fresh, meaning you can bake it ahead and eat the leftovers for days.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/09/18/dining/18APPLEBUNDT/18APPLEBUNDT-articleLarge-v3.jpg", "totalTime": "PT1H30M", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "apple, bourbon, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1295}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 565, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "13 grams", "sodiumContent": "379 milligrams", "sugarContent": "45 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 sticks unsalted butter 226 grams, at room temperature, plus more to grease pan", "2 1/2 cups all-purpose flour 315 grams, plus more to dust the pan", "3 tablespoons (30 grams) plus 1/2 cup (80 grams) bourbon or rye whiskey", "1/2 cup (90 grams) candied ginger, chopped", "1 3/4 cup (330 grams) light brown sugar", "4 large eggs, at room temperature", "2 teaspoons (8 grams) baking powder", "1 teaspoon (5 grams) baking soda", "1 1/2 teaspoons (3 grams) ground cinnamon", "1 teaspoon (5 grams) fine sea salt", "1/2 teaspoon grated nutmeg", "1 cup (227 grams) sour cream", "1 tablespoon (15 grams) vanilla extract", "1 1/2 teaspoon (5 grams) finely grated lemon zest", "2 medium Granny Smith apples about a pound, 454 grams, peeled, cored, and coarsely grated", "1 cup (120 grams) finely chopped, toasted pecans", "1/2 cup (100 grams) granulated sugar", "Juice of 1/2 lemon (20 grams)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees. Grease and flour a 12-cup bundt pan. In a small bowl, combine 3 tablespoons bourbon and the candied ginger. Let stand 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the paddle attachment, beat together the brown sugar and remaining butter on medium-high speed, until light and fluffy, about 5 minutes. Beat in the eggs, 1 at a time, until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, whisk together the remaining flour with the baking powder, baking soda, cinnamon, salt and nutmeg. In a separate bowl, whisk together the sour cream and vanilla. Pour in the bourbon from the ginger mixture (reserve ginger) and whisk until smooth. Stir in zest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer on medium speed, add the dry mixture and sour cream mixture to the wet mixture in three additions, alternating between the two. Fold in the ginger, apples and pecans. Scrape the batter into the prepared pan. Bake until the cake is golden brown and a skewer inserted into the cake comes out dry, about 1 hour 10 minutes. Cool in the pan 20 minutes, then run a paring knife around the sides of the pan to release the cake; cool, flat side down, on a wire rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake cools, combine the 1/2 cup granulated sugar and 1/2 cup whiskey in a small saucepan. Over low heat, gently stir until the sugar dissolves. Stir in the lemon juice and take off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake cools, make 10 slits on top with a paring knife and pour half the bourbon-sugar mixture on the still-warm cake. When the cake is fully cool, flip it and pour the rest of the glaze on the other side, then flip again to serve."}]}