{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Skin Tacos", "description": "Nate Gutierrez, the chef and owner of Nate’s Taco Truck and Nate’s Taco Truck Stop in Richmond, Va., could not stop snacking on the skin left over from his roast chickens. So, he decided to make chicken skin crisp on his flattop and offer it in a taco. The chicken-skin tacos sell out whenever they are on the menu. This recipe is adapted from his work:  chicken breasts are cooked, the skin crisped and the meat shredded, and the whole thing stuffed into a tortilla. Top at will.", "author": {"@type": "Person", "name": "Sarah Digregorio"}, "image": "https://static01.nyt.com/images/2014/03/21/dining/chickenskin/chickenskin-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 servings (2 to 4 tacos)", "recipeCuisine": "mexican", "recipeCategory": "lunch, weekday", "keywords": "chicken breast, spices, tortilla, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 39}, "recipeIngredient": ["1 pinch kosher salt", "1 pinch coarsely ground black pepper", "1 pinch ground cumin", "1 pinch granulated garlic", "1 pinch onion powder", "1 pinch dried oregano", "2 skin-on chicken breasts (these can either be bone-in or boned)", "Corn or flour tortillas", "Shredded Colby Jack cheese for serving", "salsa for serving", "sour creamfor serving", "shredded romaine for serving", "chopped cilantro for serving", "chopped white onion for serving", "lime wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. In a small bowl, combine the salt and spices. Rub the chicken breasts with the mixture. Roast until cooked through (160 degrees at the center) and the skin on the breast is crisp, about 30 minutes for boneless breasts, 45 minutes for bone-in. Remove from oven and cool. Pull browned skin from the chicken and cut into half-inch strips. Shred the meat, discarding any bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm a skillet, preferably cast iron, over medium-high heat. Crisp the skin in the pan, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill tortillas with shredded chicken. If desired, top the chicken with shredded Colby Jack cheese, salsa, sour cream, and shredded romaine or with chopped cilantro and chopped white onion. Garnish with chicken skins, and serve with lime wedges."}]}