{"@context": "http://schema.org", "@type": "Recipe", "name": "Brooklyn Bowl Fried Chicken", "description": "This fried chicken is a specialty of Eric and Bruce Bromberg’s SoHo restaurant Blue Ribbon and many of its offspring, including Brooklyn Bowl, the bowling alley in Williamsburg, Brooklyn. It is famous, and it is crunchy. And, as long as you are not afraid of having a three-inch-deep lake of hot oil in your kitchen, it is preposterously simple to make at home. No three-day buttermilk bath, or lard seasoned with bacon – just a quick crust of egg whites and matzo crumbs that the Bromberg brothers ought to patent. You sprinkle it with a sort-of-Cajun spice mix and send it to the table with pots of honey, if you are a restaurant, or, at home, with a bear-shaped squeeze bottle. The spice mix, all of which you will likely have in your pantry, comes together in two minutes.", "author": {"@type": "Person", "name": "Pete Wells"}, "image": "https://static01.nyt.com/images/2014/04/07/dining/chicken/chicken-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 74}, "recipeIngredient": ["Vegetable oil, for frying", "4 large egg whites", "1/2 cup matzo meal, or matzo crackers crushed with a rolling pin", "1/2 cup all-purpose flour", "1 medium chicken (about 3 pounds), cut into eight pieces (2 legs, 2 thighs, 4 breast pieces; save wings for stock)", "Fine sea salt", "freshly ground black and white pepper", "1 teaspoon Cajun seasoning (<a href=\"http://cooking.nytimes.com/recipes/1013439-cajun-seasoning\" target=\"_blank\">see recipe</a>)", "Honey, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot with oil to a depth of about 3 inches. Heat the oil over medium-high heat until a deep-fat thermometer reads 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, whisk the egg whites in a large, shallow bowl. In a separate shallow bowl, combine the matzo meal and flour. Keeping the dark meat and the white separate, dip each chicken piece in egg white and let excess drip back into the bowl. Then roll each chicken piece in the matzo mix, and tap off excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully lower the chicken thighs and drumsticks into the oil. After 3 minutes, carefully add the breast pieces. (Keep the oil at 375 by adjusting heat as necessary.) Fry until dark gold, about 10 minutes more. Transfer the fried chicken to a paper-towel-lined plate. Sprinkle immediately with salt and pepper, then coat the pieces with the Cajun seasoning. Serve the chicken with honey, for dipping."}], "link": "https://cooking.nytimes.com/recipes/1013438-brooklyn-bowl-fried-chicken"}