{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Bok Choy or Sturdy Greens", "description": "This recipe works equally well with bok choy or sturdy greens, both of which have tough ribs and leaves that have a cruciferous flavor. I steam them for a minute before stir-frying so the leaves won’t be too tough.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/09/21/science/23recipehealth/23recipehealth-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "3 to 4 servings as a side dish", "recipeCuisine": "asian", "recipeCategory": "weekday", "keywords": "fall, healthy, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 358}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 98, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "0 grams", "sodiumContent": "332 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["12 to 16 ounces bok choy or sturdy greens, like collards, or packaged Southern greens mix", "1/4 cup chicken broth, vegetable broth or water", "1 tablespoon Shao Hsing rice wine or dry sherry", "2 teaspoons soy sauce", "1/4 teaspoon cornstarch", "1 tablespoon peanut or canola oil", "3 garlic cloves, smashed with the flat side of a chef’s knife or minced", "1 slice ginger, smashed with the flat side of a chef’s knife or minced", "Salt to taste", "1/4 teaspoon sugar", "1 to 2 teaspoons sesame seeds, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using bok choy, trim off the bottoms and separate into stalks. Rinse if necessary and drain on paper towels. Cut crosswise into 2-inch pieces. If using collard greens, stem, discard stems and chop the leaves coarsely. Bring an inch of water to a boil in the bottom of a steamer, and place the bok choy or greens in the steamer basket. Steam 1 minute, remove from the heat and rinse with cold water. Squeeze out excess water and drain on a kitchen towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the broth or water, rice wine or sherry, soy sauce and cornstarch in a small bowl and place within arm’s reach of your pan. Have the remaining ingredients measured out and near the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or a 12-inch skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in the oil by adding it to the sides of the pan and swirling the pan, then add the garlic and ginger and stir-fry for 10 seconds, until fragrant. Add the bok choy or greens, sprinkle with salt and the sugar, and stir-fry for about 30 seconds. Stir the cornstarch mixture and swirl into the wok, then stir-fry 1 minute, or until the greens are just tender. Sprinkle on the sesame seeds. Remove from the heat and serve."}]}