{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Bean and Cheese Quesadillas", "description": "These quesadillas have little in common with fast-food varieties, which are made with flour tortillas and a lot more cheese. A Taco Bell cheese quesadilla has 480 calories and 1,000 milligrams of sodium; if you order cheese quesadillas at Baja Fresh, you’re asking for 1,200 calories and 2,140 milligrams of sodium. I make a meal out of quesadillas by including beans or vegetables with the cheese, and I use corn tortillas rather than flour. Another plus: Quesadillas make a great destination for leftovers. Beans in a thick sauce make a delicious and comforting quesadilla filling.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/03/15/science/14recipehealth/14recipehealth-articleLarge-v2.jpg", "totalTime": "PT5M", "recipeYield": "One serving", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, quick, weekday", "keywords": "baked beans, cheese, gluten-free, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 474}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 289, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "6 grams", "proteinContent": "14 grams", "saturatedFatContent": "6 grams", "sodiumContent": "482 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["2 corn tortillas", "1/3 cup cooked baked beans, homemade or canned, with sauce", "1 ounce grated Monterey Jack, Cheddar or mixed cheeses 1/4 cup", "Salsa for serving optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a microwave: Place a corn tortilla on a plate. Top with the beans. Lightly mash the beans with the back of a spoon. Sprinkle on the cheese, and top with the remaining tortilla. Press down gently, then microwave for 1 to 1 1/2 minutes until the cheese has melted. Remove from the microwave, cut into quarters or sixths and serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pan: Place a corn tortilla in a pan. Top with the beans. Lightly mash the beans with the back of a spoon. Sprinkle on the cheese. Turn the heat to medium-high, and heat until the cheese begins to melt. Place the remaining tortilla on top of the cheese, and press down lightly. Flip over the quesadilla in the pan, and heat for about 30 seconds or until the cheese has melted. Flip back over, and remove to a plate. Cut into quarters or sixths and serve."}], "link": "https://cooking.nytimes.com/recipes/1013515-baked-bean-and-cheese-quesadillas"}