{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Mussel Stew With Peas, Fennel and Lemon", "description": "This complexly flavored, multitextured, slightly sweet dish of mussels is an elegant meal that can easily be doubled for a dinner party.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2011/06/15/dining/15appe-span/15appe-span-articleLarge-v3.jpg", "totalTime": "PT40M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy", "keywords": "english peas, mussels, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 11}, "recipeIngredient": ["1 large fennel bulb", "2 tablespoons extra virgin olive oil, more for brushing", "1 large leek, white part only, cleaned and finely chopped", "4 garlic cloves, smashed and peeled", "Pinch red pepper flakes", "3/4 cup dry white wine", "3 tablespoons Pernod", "2 pounds fresh mussels, rinsed", "2/3 cup chicken or vegetable stock", "1/2 pound fresh English peas, shelled 1/2 cup", "2 tablespoons crème fraîche", "1/4 teaspoon finely grated lemon zest", "Fine sea salt", "2 slices country-style bread, 1/2-inch-thick"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop and reserve 1/4 cup fennel fronds. Peel and discard the outer layers from the bulb, then finely chop the bulb and coarsely chop the stems."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large pot over medium-high heat. Add the chopped fennel bulb, leek and garlic cloves. Cook until the fennel and leek are golden, 5 to 7 minutes. Add the pepper flakes and cook 30 seconds. Stir in the fennel stems, wine and Pernod. Cook, stirring to scrape up any browned bits from the bottom of the pan, 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the mussels to the pot. Cover tightly and cook until most of the mussels have opened, 5 to 7 minutes (discard any remaining closed mussels). Transfer to a large bowl and cover loosely with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler. Strain the liquid in the pot through a fine sieve into a small saucepan, pressing down on the solids with a spoon. Add the stock and bring to a simmer over medium heat. Stir in the peas and cook until just tender, 2 to 3 minutes. Whisk in the crème fraîche, lemon zest, salt and chopped fennel fronds. Cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle the bread with oil and place it under the broiler until just golden, about 1 minute. Place a slice of bread into each of two bowls. Mound the mussels on top of the bread, then ladle the broth over everything."}], "link": "https://cooking.nytimes.com/recipes/1013638-creamy-mussel-stew-with-peas-fennel-and-lemon"}