{"@context": "http://schema.org", "@type": "Recipe", "name": "Meyer Lemon Tart", "description": "The Meyer lemon has always been something of a California secret, and every year when its brief growing season begins there, eager cooks sigh with relief. The Meyer is not as assertive as the common supermarket varieties, but it offers so much more in nuanced flavor that it is unforgettable. And these days, the Meyer's secret is finally out. A Meyer lemon contains about four times the sugar of a regular lemon, but it can be used almost interchangeably with the traditional varieties, adding a rounder edge to both sweet and savory dishes. And you can use the whole thing – from pulp to peel. This gorgeous tart is the ideal way to showcase its seductive fragrance and flavor. (Regular lemons will work well in this recipe too, but you'll likely want to add a bit more sugar.)", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2016/04/18/dining/18COOKING-LEMONTART1/18COOKING-LEMONTART1-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "One 10-inch tart", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, meyer lemon", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 489}, "recipeIngredient": ["8 ounces (2 sticks) unsalted butter, softened, plus extra for greasing pan", "1/2 cup sugar", "1 egg yolk", "1/2 tablespoon milk", "12 ounces (about 2 1/3 cups) all-purpose flour", "1/4 teaspoon salt", "1 1/4 pound (5 or 6) Meyer lemons", "1 cup sugar", "5 1/2 ounces (1 stick plus 3 tablespoons) unsalted butter, softened, plus extra for greasing pan", "7 large egg yolks", "5 large eggs", "1/8 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: in the bowl of a mixer, cream together butter and sugar. Add egg yolk and the milk, and beat to combine. In a medium bowl, combine the flour with salt. Slowly add the flour to the butter mixture, stirring until completely blended. Gather dough into two balls. Freeze one for future use, chill the other for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heavily butter a 10-inch tart pan with a removable bottom. Press the dough into the pan and trim the edges. Prick the bottom with a fork, and place the shell in the freezer for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While shell is in freezer, prepare lemon curd. Grate zest of lemons. Squeeze lemons to extract 1 cup of juice. In a medium nonreactive saucepan, combine juice and zest. Add remaining sugar, butter and salt. Place over medium heat, stirring once or twice, until sugar is dissolved and the butter is melted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In bowl of a mixer, combine eggs and egg yolks until blended. Slowly add hot lemon mixture to eggs until blended. Return mixture to saucepan, and place over low heat. Whisk constantly until mixture thickens to a pudding-like consistency; do not allow it to boil. Remove from heat, and continue to stir to stop the cooking. Strain lemon curd into a bowl. Adjust sugar to taste; the curd should be tart, but may need additional sugar if the lemons were unripe. Cover with plastic wrap, pressing it right against the surface of the curd. Allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Remove tart shell from freezer, and bake until lightly golden, 20 to 25 minutes. Remove from heat and allow to cool slightly. Spoon lemon curd into tart shell, and smooth the top. Bake until filling has puffed around the edges, about 30 minutes. Cover edges with foil, if necessary, to prevent over-browning. Cool to room temperature before serving."}]}