{"@context": "http://schema.org", "@type": "Recipe", "name": "Winter Squash and Walnut Spread", "description": "This dish is inspired by the filling for the coiled Greek winter squash pie featured a few weeks ago. <br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/12/04/science/06recipehealth/06recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "2 cups", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, gluten-free, halal, healthy, kosher, low calorie, low cholesterol, low-fat, low-sodium, low sugar, vegetarian, mint, walnut, winter squash, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 180, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "423 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds pumpkin or winter squash, such as kabocha or butternut, seeds and membranes scraped away, cut into large pieces (if using butternut, cut in half crosswise, just above the bulbous bottom part, then cut these halves into lengthwise quarters and scr", "3 tablespoons extra virgin olive oil", "1/2 medium onion, finely chopped", "2 tablespoons finely chopped fresh mint", "1/8 teaspoon freshly grated nutmeg", "1/4 cup (1 1/4 ounces/35 g) lightly toasted walnuts, finely chopped", "1 ounce Parmesan, grated (about 1/3 cup)", "Salt and freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Line a baking sheet with foil and oil the foil. Place the squash on the baking sheet and rub or toss with 1 tablespoon of the olive oil. Place in the oven and bake until tender, 40 to 60 minutes depending on the type of squash and the size of the pieces. Every 15 minutes use tongs to turn the pieces over so different surfaces become browned on the foil. Remove from the oven and allow to cool, then peel and place in the bowl of a food processor fitted with the steel blade. Pulse several times, scrape down the sides of the bowl, then purée until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat another tablespoon of the olive oil over medium heat in a large, heavy skillet and add the onion. Add a generous pinch of salt, turn the heat to medium low and cook, stirring often, until very tender, sweet and lightly caramelized, about 20 minutes. Remove from the heat and add to the squash. Add the mint, nutmeg, walnuts, Parmesan, and 1 tablespoon olive oil and pulse together. Season to taste with salt and pepper. Serve on croutons."}], "link": "https://cooking.nytimes.com/recipes/1014387-winter-squash-and-walnut-spread"}