{"@context": "http://schema.org", "@type": "Recipe", "name": "Peppery Flank Steak Tagliata in the Oven", "description": "", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/03/13/dining/13KITCH1/13KITCH1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "flank steak, olive oil, rosemary, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 297}, "recipeIngredient": ["1 flank steak, about 2 pounds", "Salt", "Black peppercorns", "1 small bunch rosemary (a fistful of sprigs)", "6 garlic cloves, sliced", "Extra-virgin olive oil", "5 ounces arugula", "Pecorino pepato, Pecorino romano or Parmesan, for shaving", "1 lemon, cut in wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay flank steak on a baking sheet and season on both sides with salt. Put a handful of peppercorns on a cutting board and crush them by pressing firmly with the bottom of a sauce pan (or use a spice mill or mortar and pestle to obtain a very coarse grind). Measure 1 tablespoon of crushed pepper and sprinkle on both sides of steak. Strip leaves from rosemary. Sprinkle meat evenly on both sides with rosemary and garlic slices. Drizzle with 4 tablespoons olive oil, then massage with your hands to distribute, pressing pepper, rosemary and garlic into surface. Leave at room temperature for an hour (or refrigerate for several hours and bring to room temperature before proceeding)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat oven to 450 degrees. Place a cast iron skillet large enough to hold the steak (or a heavy roasting pan) on the upper rack. Let skillet heat for at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully put flank steak in pan and close oven door. After 5 minutes, flip the steak (it should be well browned on the bottom) and cook just until juices appear on surface of steak, 3 to 4 minutes more for medium-rare meat. (Alternatively, cook steak under broiler about 2 inches from heat.) Remove steak and let rest on a carving board for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut meat on a diagonal, against grain, into thin slices. Arrange sliced meat on a large platter and surround with arugula. With a vegetable peeler, shave about 2 ounces of cheese over arugula. Drizzle with a little olive oil and garnish with lemon wedges."}]}