{"@context": "http://schema.org", "@type": "Recipe", "name": "Focaccia With Tomato Sauce and Green Garlic", "description": "We call this “pizza focaccia” in our house, as it does resemble a thick-crusted pizza. Make it when you crave a tomato focaccia and fresh tomatoes aren’t in season. I like to use fire-roasted canned tomatoes for this, as they develop such a deep, double-roasted flavor when the sauce bakes on top of the bread.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/05/14/science/15recipehealth-1368478745964/15recipehealth-1368478745964-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "12 to 15 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "appetizer, canned tomatoes, focaccia dough, green garlic, dairy-free, halal, healthy, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 83, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "148 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 recipe Whole-Wheat Focaccia", "1 tablespoon extra virgin olive oil", "1 bulb green garlic, papery outer layers removed, thinly sliced, or 2 garlic cloves, minced", "1 14-ounce can diced tomatoes, preferably fire-roasted, with juice", "Salt to taste", "2 teaspoons fresh thyme leaves", "Freshly ground pepper", "2 ounces fresh mozzarella (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix up the focaccia dough as directed and set in a warm spot to rise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the tomato-garlic topping. Heat the olive oil over medium heat in a medium saucepan or skillet and add the garlic. Cook, stirring, until it begins to smell fragrant, 30 seconds to a minute, and add the tomatoes and salt to taste. Cook, stirring often, for about 10 minutes, until the tomatoes have cooked down slightly to a fragrant sauce. Stir in the thyme. Taste and adjust salt, and add pepper. Remove from the heat. For a smooth sauce, blend with an immersion blender or pulse in a food processor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the focaccia dough has risen, shape as directed into 1 large focaccia or 2 smaller focacce. Cover with a damp cloth and let rise in a warm spot for 30 minutes while you preheat the oven to 425 degrees, preferably with a baking stone in it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dimple the dough with your fingertips and spread the tomato sauce over the top in an even layer. Drizzle with olive oil. Bake, setting the pan on top of the baking stone (if using), for 25 minutes, until the bread is deep golden brown. If using the mozzarella, tear it into small shreds. Bake the focaccia for 15 minutes, pull it from the oven and quickly scatter the mozzarella over the focaccia, then return to the oven for 10 minutes. Let rest for at least 10 minutes before serving, or allow to cool completely."}]}