{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Dough for Fresh Egg Pasta", "description": "Fresh pasta isn’t something you can master in one go. There’s a learning curve. Only experience can teach you how the dough should feel and how thin to roll it. (Not that it needs to be rolled by hand with a rolling pin. A hand-crank pasta machine is a fine tool, perfect for a small batch.) But pasta making isn’t rocket science either. Most competent home cooks will succeed, even if they never match the prowess of mythic Italian nonnas. Fresh homemade egg pasta is definitely worth the effort, though, and it is always better than commercially produced versions.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/03/06/dining/06KITCH2/06KITCH2-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "pastas, project", "keywords": "eggs, flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 316}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 285, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "2 grams", "proteinContent": "11 grams", "saturatedFatContent": "2 grams", "sodiumContent": "185 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups all-purpose flour", "1/4 teaspoon salt", "2 large eggs plus 2 egg yolks, beaten", "Semolina or rice flour, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put flour and salt in a mixing bowl. Add eggs and yolks, and mix with hands or wooden spoon for a minute or so, until dough comes together. (Alternatively, use a stand mixer with a paddle attachment.) If dough seems dry or crumbly, add 1 or 2 tablespoons cold water, but only enough to keep the dough together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough out onto a board and knead to form a ball. Flatten dough ball to a 1-inch-thick disk, wrap in plastic, and let rest at room temperature for at least 1 hour (several hours is fine)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough into 4 pieces. Knead each piece until smooth. Roll with a rolling pin or pasta machine as thinly as possible (but not quite paper-thin). Cut each sheet in half, making 8 smaller sheets. Dust dough sheets lightly with semolina to keep them from sticking. Stack 2 or 3 sheets, roll loosely, then cut into 1/2-inch-wide noodles or other desired shape. Continue until all dough is used. Gently fluff noodles and spread on a semolina-dusted baking sheet. Refrigerate, uncovered, until ready to cook."}], "link": "https://cooking.nytimes.com/recipes/1014586-basic-dough-for-fresh-egg-pasta"}