{"@context": "http://schema.org", "@type": "Recipe", "name": "Black-Sugar-Glazed Medjool Dates With Pecorino and Walnuts", "description": "In 2010, I gave Stuart Brioza and Nicole Krasinski, a husband-and-wife team of San Francisco chefs, a 19th-century recipe for simple chocolate caramels made with molasses and vanilla and asked them to use it as inspiration for an entirely new dish.\n\nTwo days after sending them the candy recipe, I received one back for Black-Sugar-Glazed Medjool Dates With Pecorino and Walnuts, a remarkably good dish that can be served either as a tapa, a cheese course or a sweet-savory dessert.\n\n“We started thinking about molasses, because that was the strongest flavor in the caramel recipe,” Brioza explained. Anise and fennel flavors came to mind next, as did Scandinavian licorice: “You know, they’re molassesy and black, chewy and gummy,” he continued. “We thought of vinegar as a way to balance that out. We thought, well, dates could take on the texture we’re really looking for in that kind of candy. The pecorino came in to play a role because the dates were too sweet. And then the walnuts — kind of a no-brainer,” to balance the dish and give it texture.", "author": {"@type": "Person", "name": "Stuart Brioza And Nicole Krasinksi"}, "image": "https://static01.nyt.com/images/2014/04/29/dining/Medjool-Dates/Medjool-Dates-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "Makes 12 date halves", "recipeCuisine": "", "recipeCategory": "", "keywords": "medjool dates, pecorino, walnut, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 165, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "273 milligrams", "sugarContent": "20 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons black sugar (dark muscovado)", "1 teaspoon molasses", "1/4 teaspoon cocoa powder", "1 teaspoon fennel seed, toasted until fragrant and lightly crushed", "Freshly ground black pepper, to taste", "Pinch of sea salt", "1 tablespoon plus 1 teaspoon sherry vinegar", "6 medjool dates, cut lengthwise in half and pitted", "4 ounces aged pecorino, shaved with a vegetable peeler", "1/4 cup walnuts, toasted and roughly chopped", "Walnut oil, for sprinkling", "Lightly cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange an oven rack in the top third of the oven and preheat to 400 degrees. To prepare the glaze, combine 3 tablespoons water, the sugar, molasses, cocoa, fennel seed, two to three grinds of pepper and salt in a small, heavy-bottomed saucepan. Bring to a simmer over low heat, stirring occasionally. Add the vinegar and simmer until just thickened, about 5 minutes. Reserve until ready to use, or refrigerate for up to 2 days. Bring to room temperature before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the date halves, cut side up, on a small baking sheet or casserole dish. Lay 6 slices of pecorino on top of each. Sprinkle the walnuts, a few drops of walnut oil and a few cracks of pepper over each date. Bake until the cheese has just started to melt, 5 to 7 minutes. Remove from the oven and transfer the dates to a serving platter. Drizzle with the black-sugar glaze and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1014061-black-sugar-glazed-medjool-dates-with-pecorino-and-walnuts"}