{"@context": "http://schema.org", "@type": "Recipe", "name": "Crab Newburg à la Cross Creek", "description": "Crab Newburg was Marjorie Kinnan Rawlings’s most celebrated dish, the one on which the Florida author of \"The Yearling\" claimed laurels as a cook. It is a version of the famous 19th-century lobster recipe popularized at Delmonico’s in New York.\n\nMaking it is an easy business, as much an assemblage as a recipe. You heat crabmeat in an enormous amount of butter, thicken it slightly with flour, thicken it a great deal with cream and eggs and cut the fat (slightly) with spices and booze. The resulting pinkish stew ought to be served with toast points or in a puff-pastry shell, perhaps with rice and absolutely with a green salad with a tart, lemony vinaigrette. Rawlings admits that you might use less cream, or less butter or fewer eggs. “The brandy may be omitted,” she cautions, “but never the sherry.”\n\nYou’ll want to set everything up well before dinner so that you can work quickly and serve the dish directly from the pan.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2013/07/14/magazine/14eat2/14eat2-articleLarge-v2.jpg", "totalTime": "PT10M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, quick, dips and spreads", "keywords": "appetizer, brandy, crab meat, heavy cream, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 103}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 647, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "54 grams", "fiberContent": "1 gram", "proteinContent": "27 grams", "saturatedFatContent": "33 grams", "sodiumContent": "723 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["6 tablespoons unsalted butter", "1 pound crabmeat, approximately 2 cups", "2 tablespoons all-purpose flour or instant flour", "1 1/2 cups heavy cream", "2 tablespoons lemon juice (or juice of 1 lemon)", "Kosher salt and freshly ground black pepper to taste", "Pinch of ground cloves", "1/2 teaspoon sweet paprika, or to taste", "Pinch of cayenne pepper, or to taste", "1/2 cup dry sherry", "3 eggs", "1 tablespoon brandy", "1 tablespoon parsley, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, heavy skillet set over medium heat, melt the butter but do not allow it to brown. Add the crabmeat and stir gently. Cook for one minute, then sprinkle flour over the top and stir gently to incorporate. Cook for another minute or so, then add cream slowly, stirring gently, followed by lemon juice. When sauce is smooth and beginning to thicken, add salt, pepper, cloves, paprika and cayenne pepper and stir to combine. Add sherry and stir again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk the eggs until they are almost foaming, then add to the hot crab mixture and stir to combine. Add the brandy, garnish with parsley and rush to the table, serving with toast points."}], "link": "https://cooking.nytimes.com/recipes/1014872-crab-newburg-a-la-cross-creek"}