{"@context": "http://schema.org", "@type": "Recipe", "name": "Butter Pie", "description": "Here is a recipe that Julia Moskin brought to The Times in 2010, from Esa Yonn-Brown at the Butter Love Bakeshop in San Francisco, with a crust so lumpy with butter that it would never pass inspection in a professional kitchen. With its caramelized filling of butter and brown sugar, her butter pie belongs to the same gooey tradition as sugar pie, chess pie, shoofly pie and, in recent years, the Crack Pie served by Christina Tosi of the Momofuku restaurant empire.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Butter-Pie/Butter-Pie-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 167}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 328, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "0 grams", "proteinContent": "3 grams", "saturatedFatContent": "11 grams", "sodiumContent": "189 milligrams", "sugarContent": "29 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 cups all-purpose flour", "1/2 teaspoon kosher salt", "1 1/2 teaspoons sugar", "8 tablespoons (one stick) cold unsalted butter, cut into dice", "1/4 cup ice water", "Dried beans or rice, for baking", "6 tablespoons unsalted butter at room temperature", "2 cups light brown sugar", "1 teaspoon kosher salt", "1 teaspoon vanilla extract", "2 large eggs", "1/2 cup cranberries (optional)", "Whipped cream or vanilla ice cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: In a bowl, mix the flour, salt and sugar. Add butter and gently toss with the dry ingredients until evenly coated. Using fingertips and thumbs, press each cube of butter into a thin leaf, and continue tossing in flour. When all butter is coated, add ice water one tablespoon at a time. Continue tossing gently until mixture starts to look ragged and just holds together when squeezed. Wrap loosely in plastic, waxed paper or parchment. Press dough down firmly into a disk. Refrigerate at least 30 minutes, or up to one day, before rolling. (Dough will keep frozen for up to a month)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. On a lightly floured surface, roll chilled dough into a circle 12 inches in diameter and 1/4-inch thick. Transfer to a deep-dish 9-inch pie pan, lifting dough to let it settle into corners of pan; do not stretch it. Turn edges under to make a thick rim; flute the rim, pinching it into a zigzag pattern."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line crust with parchment or foil and cover bottom with pie weights, dried beans or raw rice. Bake in lower half of oven for 15 to 20 minutes, then remove weights and bake in upper half of oven 5 to 10 minutes, until just golden on edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the filling: In a mixer fitted with a paddle attachment, cream butter and brown sugar together at medium speed until sugar looks like wet sand. Add salt and vanilla extract. With mixer running, add eggs one at a time and beat until creamy and light, about a minute. Mix in cranberries, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape filling into parbaked crust. Place pie on a sheet pan and bake in center of oven for 25 to 35 minutes, until top looks dry and browned. The filling will form a skin and puff slightly, then deflate as it cools and sets. Let cool at least one hour, then wrap and refrigerate until serving, at least one hour or overnight. Serve cold with very lightly sweetened whipped cream or vanilla ice cream."}], "link": "https://cooking.nytimes.com/recipes/1014111-butter-pie"}