{"@context": "http://schema.org", "@type": "Recipe", "name": "Buckwheat Blini", "description": "Blini go well with savory toppings liked smoked fish, and of course with caviar. A simple, elegant accompaniment would be smoked salmon (about 1/2 pound for one batch of blini), drained yogurt or reduced-fat sour cream, and salmon roe. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/buckwheatbilini/buckwheatbilini-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 20 pancake-sized blini", "recipeCuisine": "russian", "recipeCategory": "", "keywords": "appetizer, healthy, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 68, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "90 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 teaspoon active dry yeast", "1/2 teaspoon sugar", "2 tablespoons lukewarm water", "1 cup plus 2 tablespoons lukewarm 1 percent or 2 percent milk", "1 cup buckwheat flour", "3/4 cup all-purpose flour", "3/4 teaspoon salt", "1/2 cup buttermilk or plain yogurt", "2 tablespoons canola oil or melted butter", "2 large eggs, separated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dissolve the yeast and sugar in the water in a large bowl. Stir in the lukewarm milk, and let stand for five minutes until creamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together the flours and salt into a medium bowl. Whisk into the yeast mixture. Whisk in the buttermilk or yogurt, the oil or melted butter, and the egg yolks. Cover the bowl tightly with plastic wrap, and set aside to rise in a warm spot for one hour or longer until bubbly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites to soft peaks. Fold them into the batter. Cover again, and allow to rise for another 30 minutes until bubbly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease a heavy nonstick or cast iron griddle, and heat over medium heat until hot. For bite-size blini that you can pass as hors d’oeuvres, ladle on 1 to 2 tablespoons of batter for each silver-dollar-size blini. For larger, pancake-sized blini, ladle on about 1/4 scant cup per blini. Cook until holes break through the upper side, about a minute. Turn and brown on the other side for about 30 seconds. Remove to a rack or a plate. If serving right away, wrap them in a towel or place them in a low oven to keep warm. If not serving right away, wrap them in foil and reheat them for about 20 minutes in a 325-degree oven. To freeze, stack them between pieces of parchment or wax paper, and wrap them airtight in plastic, then foil. To thaw, remove them from the plastic, rewrap them in foil, and place them in a 350-degree oven for 30 minutes. Alternately, remove the foil and thaw them in a microwave oven."}]}