{"@context": "http://schema.org", "@type": "Recipe", "name": "Winter Tomato Quiche", "description": "You can make a tomato quiche off-season using canned tomatoes for a rich tomato sauce that you blend with the custard filling. When tomatoes are in season I use the same filling but line the tart shell with sliced tomatoes.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/02/19/science/22recipehealth/22recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H40M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "canned tomatoes, cheese, eggs, gluten-free, halal, healthy, kosher, low sugar, nut-free, vegetarian, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 179}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 235, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "6 grams", "sodiumContent": "292 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 9- or 10-inch <a href=\"http://www.nytimes.com/recipes/1014551/whole-wheat-mediterranean-pie-crust.html\">whole wheat Mediterranean pie crust</a>, <a href=\"http://www.nytimes.com/recipes/1014552/Gluten-Free.html\">(or gluten-free version)</a>", "1 tablespoon extra virgin olive oil", "1/2 medium onion, finely chopped", "2 to 3 garlic cloves (to taste), minced", "1-14 1/2-ounce can chopped tomatoes in juice (no salt added), with juice", "1 tablespoon tomato paste", "Pinch of sugar", "Salt to taste", "1 sprig fresh basil or rosemary", "1 teaspoon fresh thyme leaves or 1/2 teaspoon dried thyme", "Freshly ground pepper", "2 eggs", "2 egg yolks", "3/4 cup low-fat (2 percent) milk", "2 ounces Gruyère cheese, grated (1/2 cup, tightly packed)", "1 ounce Parmesan cheese, grated (1/4 cup, tightly packed)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the crust and line a 9- or 10-inch tart pan. Refrigerate uncovered (place in freezer if using the yeasted crust) while you make the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy saucepan and add the onion. Cook, stirring, until it begins to soften, 2 to 3 minutes. Add a pinch of salt and continue to cook, stirring often, until tender, about 5 minutes. Meanwhile pulse the tomatoes in a food processor fitted with the steel blade or in a mini-processor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the garlic to the onions and cook, stirring, until fragrant, about 30 seconds. Add to the canned tomatoes and turn up the heat slightly. Add the tomato paste, sugar, salt, basil or rosemary spring and thyme and simmer briskly, stirring often, until the tomatoes have cooked down and smell fragrant, about 15 minutes. Taste and adjust salt, and add pepper. Remove from the heat. Remove the basil or rosemary sprig and, if you used rosemary, remove any rosemary needles that may have detached from the sprig. Allow to cool slightly. You should have about 1 cup of the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Beat the eggs and egg yolks in a large bowl. Brush the bottom of the crust with a small amount of the beaten egg and pre-bake for 10 minutes. Remove from the oven and allow to cool for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the milk into the eggs. Add 1/2 teaspoon salt, freshly ground pepper to taste and beat together. Stir in the cheeses and the tomato sauce and combine well. Scrape into the crust, using a rubber spatula to scrape out every last bit from the bowl. Place the tart on a sheet pan for easier handling and place in the oven. Bake for 30 to 35 minutes, until set. Remove from the heat and allow to sit for at least 15 minutes before cutting."}], "link": "https://cooking.nytimes.com/recipes/1014556-winter-tomato-quiche"}