{"@context": "http://schema.org", "@type": "Recipe", "name": "Easter Bread", "description": "", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/03/27/dining/27KITCH1_SPAN/27KITCH1_SPAN-articleLarge-v3.jpg", "totalTime": "PT3H30M", "recipeYield": "2 loaves", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, dried fruit, eggs, spices, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 99}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 313, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "6 grams", "sodiumContent": "147 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup milk, at room temperature", "1 package dry active yeast (2 1/4 teaspoons)", "1 cup all-purpose flour (125 grams)", "1/4 cup currants (30 grams)", "3/4 cup golden raisins (100 grams)", "1 cup dried cranberries or dried cherries (125 grams)", "1/4 cup diced dried apricots or dried mango (30 grams)", "1 tablespoon rum", "2 eggs plus 3 egg yolks", "12 tablespoons unsalted butter (1 1/2 sticks), melted, at room temperature", "1 teaspoon almond extract", "4 cups all-purpose flour (500 grams), plus extra for dusting", "1 teaspoon fine salt", "1/2 cup sugar (100 grams)", "2 teaspoons anise seeds", "1 teaspoon ground cardamom", "1 teaspoon grated orange zest", "1 teaspoon grated lemon zest", "3/4 cup slivered almonds (70 grams)", "1 tablespoon milk", "Sugar or pearl sugar for topping, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sponge: Put 1 cup milk in a medium bowl, add yeast and let dissolve. Whisk in 1 cup (125 grams) all-purpose flour. Cover bowl and leave in a warm place until doubled in size and very frothy, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put currants, raisins, cranberries and apricots in a small bowl and cover with hot water. Leave 10 minutes, then drain. Return to bowl and stir in rum."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat 2 eggs and 2 of the yolks. Add the beaten eggs, melted butter and almond extract to sponge and stir together. Stir in dried fruit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl mix together 4 cups (500 grams) all-purpose flour, salt, sugar, anise seeds, cardamom, orange zest, lemon zest and almonds. Pour sponge mixture over flour mixture and combine, stirring with a spoon or hands until it forms a shaggy, slightly sticky mass. Dust lightly with flour and turn dough out onto a clean work surface. Knead for a few minutes until smooth, dusting with a minimal amount of flour if necessary, to make a soft dough. (If desired, dough may be refrigerated overnight in a large zippered storage bag. Bring to room temperature and proceed with recipe.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put dough in a large bowl, cover with plastic wrap, and let rise in a warm place until doubled, about 45 minutes. Punch down dough and knead lightly. Divide dough in half with knife and form two loaves; they can be round, braided or free-form. Place side by side on a large parchment-lined baking sheet, leaving a 4-inch space between them (or use 2 smaller baking sheets). Cover lightly with plastic wrap or a damp tea towel and let rise until doubled, about 30 minutes. Meanwhile, place a rack in the middle of the oven, and heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the egg wash: with a fork, beat together the remaining egg yolk and the milk. Uncover loaves and brush generously with egg wash. Sprinkle each loaf with 2 tablespoons sugar (or 1 tablespoon pearl sugar), if desired. Bake on middle rack for 45 minutes or until loaves are a dark, glossy brown. Transfer to a cooling rack and let cool completely."}], "link": "https://cooking.nytimes.com/recipes/1014634-easter-bread"}