{"@context": "http://schema.org", "@type": "Recipe", "name": "Scotch Broth with Kale", "description": "Here is a fairly basic recipe for stew, a low-and-slow variety that calls for simmering lamb (though you could use beef) with barley and root vegetables, then adding some kale at the end so that it doesn’t entirely collapse. It’s a simple equation that takes in whatever ingredients you have on hand. Start with meat, sturdy root vegetables (potatoes, sweet potatoes, turnips, rutabaga, parsnip, carrots) and grains (barley, wheat berries, farro), add water and simmer away. Then add kale, cabbage, spinach or chard. Dinner! ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/03/12/dining/12kale/12kale-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "4 servings", "recipeCuisine": "british", "recipeCategory": "dinner, weekday, soups and stews", "keywords": "lamb, pearl barley, vegetables, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 44}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 32, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "41 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds bone-in lamb stew meat ", "2 teaspoons coarse kosher salt, more for seasoning", "1/2 teaspoon black pepper, more for seasoning", "1 medium potato, peeled and diced ", "2 large carrots, peeled and diced ", "2 medium turnips, peeled and diced ", "1 large leek, white and light green part only, cleaned and sliced", "1/3 cup pearl barley", "1 celery stalk, diced", "4 thyme branches, tied into a bouquet garni with kitchen twine", "1 bay leaf", "8 ounces kale, stems removed, leaves coarsely chopped (2 1/2 packed cups)", "Chopped parsley, for serving", "Cider or malt vinegar, or fresh lemon juice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season meat generously with salt and pepper and let rest for at least 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot, combine meat, 2 teaspoons salt, 1/2 teaspoon pepper, potato, carrots, turnips, leek, barley and celery. Drop in thyme and bay leaf. Add 2 1/2 quarts water and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat and simmer gently, turning lamb pieces occasionally and skimming any foam that rises to the surface, until meat is tender and beginning to fall apart, about 2 hours. (If the water level threatens to fall below the meat during simmering, partially cover the pot, or add a little more water.) Stir in kale and continue to cook for another 15 minutes, until lamb is truly spoon tender and kale is soft. Discard thyme bouquet and bay leaf. Taste and add more salt if needed. Ladle into bowls and sprinkle with parsley and a drizzle of vinegar or lemon juice."}]}