{"@context": "http://schema.org", "@type": "Recipe", "name": "Miso-Glazed Grilled Scallops", "description": "This simple and sophisticated treatment is perfect for grilled scallops, but also works well on chicken or pork. One note on preparation: Err on the side of undercooking. Take the scallops off the grill before they’re opaque all the way through. If you undercook a scallop, it will still be delicious, but if you overcook it, it will get rubbery.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/09/dining/Miso-Glaze/Miso-Glaze-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Varies", "recipeCuisine": "asian", "recipeCategory": "dinner, easy, quick, barbecues, finger foods, seafood", "keywords": "appetizer, main course, mirin, miso, scallion, scallops", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 154}, "recipeIngredient": ["Vegetable oil, for brushing", "2 tablespoons miso", "2 tablespoons mirin or sake", "Freshly ground pepper", "Large scallops", "Sesame seeds and sliced scallions, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a charcoal or gas grill until very hot. Brush the grill with a little oil and position the grill grate 3 to 4 inches from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the miso and mirin or sake; season to taste with pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thread the scallops through their equators onto metal or soaked wooden skewers and brush them all over with vegetable oil. Grill scallops until they’re browned and release easily from the grill, 2 to 3 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When they’re almost done, brush on both sides with the miso mixture, and continue to cook, turning once or twice, until the glaze caramelizes a bit and the scallops are done. Take the scallops off the grill before the interior becomes totally opaque."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with sesame seeds and scallions and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1014822-miso-glazed-grilled-scallops"}