{"@context": "http://schema.org", "@type": "Recipe", "name": "Scallops and Mango Skewers", "description": "Sweet and meaty, fresh scallops are the most user-friendly of mollusks and make for easy summer suppers. Skewer them with bell peppers, red onion and mango, and they can go from grill to table in about 15 minutes flat. The trick to grilling scallops is simple: Err on the side of undercooking since an undercooked scallop is far more enjoyable than an overcooked one. Take the scallops off the grill before they’re opaque all the way through.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/09/dining/Scallops-and-Mango-Skewers/Scallops-and-Mango-Skewers-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "", "recipeCuisine": "american", "recipeCategory": "dinner, easy, lunch, quick, seafood, vegetables", "keywords": "appetizer, main course, bell pepper, mango, scallops", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 64}, "recipeIngredient": ["Vegetable oil, for brushing", "Large scallops", "Fresh mango, cut into 1-inch pieces", "Red bell pepper, cut into bite-size pieces", "Red onion, cut into wedges", "Salt and pepper", "Chopped cilantro and lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a charcoal or gas grill until very hot. Brush the grill grate with a little oil and put it 3 or 4 inches from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thread the scallops through their equators onto metal or soaked wooden skewers, alternating them with mango, red bell pepper and onion. Brush with oil and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill skewers until browned and release easily from the grill, 2 to 3 minutes per side. Take the scallops off the grill before the interior becomes totally opaque."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with cilantro and serve with lime wedges."}], "link": "https://cooking.nytimes.com/recipes/1014823-scallops-and-mango-skewers"}