{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Little Layer Cake", "description": "This recipe came to The New York Times in 2009 from Martha Meadows of somewhere between Slocomb and Hartford, Ala., where the worth of a cook can be measured in cake layers. In this corner of the country, everyone knows whose cakes are tender and whose consistently reach 12 thin layers or more. Ms. Meadows learned to bake 15-layer cakes from her mother, who cooked each layer one at a time in a cast-iron hoe-cake pan. The cake is frosted with warm boiled chocolate icing. Here is our tribute to that.", "author": {"@type": "Person", "name": "Martha Meadows"}, "image": "https://static01.nyt.com/images/2014/04/10/dining/chocolatelayercake/chocolatelayercake-mediumThreeByTwo440.jpg", "totalTime": "PT2H30M", "recipeYield": "One 12-layer cake", "recipeCuisine": "southern", "recipeCategory": "", "keywords": "dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 243}, "recipeIngredient": ["2 sticks butter, more to grease pans", "2 1/2 cups sugar", "1/3 cup shortening", "5 eggs", "2 teaspoons vanilla", "5 cups cake flour", "1 teaspoon salt", "2 teaspoons baking soda", "5 teaspoons baking powder", "2 cups milk", "5 cups of sugar", "1/3 cup cocoa", "1 stick butter, cut into pieces", "1 15-ounce can evaporated milk", "1/2 cup whole milk", "2 teaspoons vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Grease three 9-inch cake pans and line with rounds of parchment or waxed paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixer, cream together butter, sugar and shortening until fluffy, about 3 minutes. Beat in eggs one at a time and continue to mix on medium until eggs are well incorporated. Stir in vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift flour, then add salt, baking soda and baking powder. Sift a second time. With mixer on low, alternately add flour mixture and milk in about 4 additions, then increase speed to medium. Beat until smooth, about 4 to 5 minutes, scraping down sides of bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread 3/4 cup batter in each pan. Bake 6 to 8 minutes, or until cake springs lightly when pressed with a finger. Flip cake out of pan onto paper towels or cake rack while still very warm. Repeat with second set of layers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When first layers go into oven, start to make icing. Put sugar and cocoa in a deep, heavy-bottomed saucepan and mix well. Turn heat to medium-high and add butter and milks, bringing to a boil. Boil for about 4 minutes, stirring continually, careful to watch that it does not boil over. Lower heat to simmer, add vanilla and stir occasionally for another 7 to 10 minutes. If using a candy thermometer, cook to the point just before soft ball stage or about 230 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin icing first layers, still warm, when second batch is in the oven. Flip layers over so that top side faces up. Use about 4 tablespoons of icing per layer. Icing will be thin but will firm up as it cools. Stack layers, then continue icing and stacking as layers are baked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all layers are iced and stacked, glaze top and sides of cake. Contours of layers will be visible through icing. If icing hardens too much while frosting cake, set back on low heat and stir until it is spreadable."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Southern Layer Cakes", "description": "Kim Severson of The Times travels to southeast Alabama to learn how to make a 15-layer chocolate cake. ", "thumbnailUrl": "https://static01.nyt.com/images/2014/04/10/dining/chocolatelayercake/chocolatelayercake-mediumThreeByTwo440.jpg", "uploadDate": "2009-12-15T22:36:19.000Z", "duration": "PT2M26S"}}