{"@context": "http://schema.org", "@type": "Recipe", "name": "Coconut Chicken Curry With Cashews", "description": "This Sri Lankan curry goes together fairly quickly despite the long list of ingredients. I used skinless, boneless thigh meat, because it always stays moist and can absorb a lot of flavor from a short marinade in ginger, garlic and spices. To intensify the taste, the cashews and coconut are used two ways. First, a handful of each is ground to a powder and added to the sauce. Then after simmering for 30 minutes or so, the curry is finished with a generous cup of thick coconut milk and garnished with toasted cashews.\n\nI also added, because I like it and thought it would harmonize nicely, a totally nontropical vegetable, parsnip — optional, but delicious.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/01/09/dining/09KITCH_SPAN/09KITCH_SPAN-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "indian", "recipeCategory": "dinner", "keywords": "chicken thigh, coconut, spices, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 969}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 637, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "3 grams", "proteinContent": "33 grams", "saturatedFatContent": "20 grams", "sodiumContent": "902 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds skinless boneless chicken thighs, cut in 3-inch chunks", "Salt and pepper", "1 tablespoon grated ginger", "2 teaspoons grated garlic", "1/4 teaspoon cloves", "1/4 teaspoon fennel seeds", "1/4 teaspoon cardamom seeds", "1/4 teaspoon allspice berries", "1/4 teaspoon cumin seeds", "1/4 teaspoon coriander seeds", "1/4 teaspoon turmeric", "1/4 teaspoon cayenne, or more to taste", "3 tablespoons lemon juice", "3/4 cup raw cashews", "1/4 cup shredded dried unsweetened coconut", "1 pound small parsnips, peeled and cut in 2-inch batons, optional", "2 tablespoons ghee, coconut oil or vegetable oil", "1 1/2 cups finely diced onion", "1 tablespoon tomato paste", "1 2-inch piece cinnamon stick", "3 cups chicken broth or water", "1 cup thick coconut milk", "A few sprigs mint and cilantro for garnish, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken generously with salt and pepper and put it in a mixing bowl. Add ginger and garlic and massage into meat. In a dry skillet over medium heat, toast cloves, fennel, cardamom, allspice, cumin and coriander until fragrant, about 2 minutes. Grind the toasted spices to a fine powder in an electric spice mill and add to chicken. Add turmeric, cayenne and lemon juice and mix well. Let marinate at room temperature for at least 15 minutes, or refrigerate up to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Put cashews on a baking sheet and roast until lightly browned, 8 to 10 minutes. Remove and set aside to cool. Spread the shredded coconut on  the baking sheet and toast until lightly browned, about 5 minutes, then let cool. Grind the coconut with 1/4 cup cashews in a spice mill or small food processor to make a rough powder. Reserve 1/2 cup roasted cashews for garnish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a small saucepan of lightly salted water to a simmer, then add parsnips and cook until tender, about 10 minutes. Drain and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide heavy-bottomed pot, heat ghee over medium-high heat. Add cooked parsnips, if using, and sauté until lightly browned. Remove and reserve. Add chicken pieces to the pot, stirring occasionally until lightly browned, about 5 minutes, then remove and set aside. Add onions and cook until softened, about 5 minutes more. Add tomato paste and let it sizzle with onions for a minute or two. Add broth and bring to a brisk simmer, stirring with a wooden spoon and scraping up any caramelized bits from the pot. Add cinnamon stick, chicken and the ground coconut and cashew mixture. Adjust heat to a gentle simmer, cover and cook for about 30 minutes, until chicken is tender. Taste the sauce and adjust seasoning if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish the dish, stir in coconut milk and add reserved parsnips. Cook for 3 to 4 minutes, until parsnips are heated through and the sauce has thickened slightly. Transfer to a serving bowl and sprinkle with reserved cashews. Garnish with mint and cilantro sprigs, if using."}], "link": "https://cooking.nytimes.com/recipes/1014468-coconut-chicken-curry-with-cashews"}