{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Red Beans with Chicken and Andouille Sausage", "description": "This recipe came to The Times in a 2012 article about cooking in a bean hole, a classic method of outdoor cooking popular in Maine. Here’s how it works: Dig a hole big enough for the pot you’re planning to cook in, then build a fire of hardwood logs in it. Drop a dozen or so rocks into the fire once it’s started. When the wood has burned down to embers, remove the rocks using barbecue gloves, put your pot of presoaked beans into the embers, drop the rocks around and on top of the pot, cover everything with dirt and walk away. Come back in about eight hours, and your beans should be ready. Not in the mood to dig a hole in your backyard? No worries. These spicy New Orleans-style red beans with chicken and andouille sausage can just as easily be made in your oven. The slightly sweet creaminess of the beans and the richness of the chicken temper the sharp heat of the andouille sausage and red pepper flakes. Serve over a pile of snowy white rice alongside an ice-cold beer.", "author": {"@type": "Person", "name": "John Willoughby"}, "image": "https://static01.nyt.com/images/2012/11/28/dining/28BEANS6/28BEANS6-articleLarge-v3.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, project", "keywords": "andouille sausage, chicken thigh, red beans, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 277}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 862, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "20 grams", "proteinContent": "52 grams", "saturatedFatContent": "15 grams", "sodiumContent": "840 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound red beans, soaked overnight or quick-soaked, then drained and rinsed", "1 tablespoon olive oil", "6 bone-in chicken thighs", "1 pound andouille sausage (or substitute linguiça), sliced ½ inch thick", "1 onion, sliced", "1/2 green bell pepper, seeded and roughly chopped", "2 stalks celery, roughly chopped", "2 tablespoons minced garlic", "2 tablespoons filé powder (optional)", "2 to 3 teaspoons red pepper flakes", "2 teaspoons kosher salt", "1 teaspoon black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain and rinse the soaked beans and heat the oven to 350."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a 6-quart Dutch oven or other large, heavy pot over medium-high until hot but not smoking. Add the chicken thighs and brown well, 4 to 6 minutes. Remove the thighs, add the sausage to pot and brown well, another 4 to 6 minutes. Remove the sausage. Add the onion, bell pepper and celery and sauté, stirring occasionally, until tender, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the garlic and sauté, stirring frequently, 1 minute. Add back the thighs and sausage along with the beans, filé powder if using, red pepper flakes, salt and pepper and enough water to cover. Stir well and bring the mixture to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and transfer the pot to the oven and bake until the beans are tender, 2 1/2 to 3 hours, checking every half-hour or so after the first hour and adding water as needed if all the liquid has been absorbed."}]}