{"@context": "http://schema.org", "@type": "Recipe", "name": "Cabbage, Carrot and Purple Kale Latkes", "description": "These latkes are nutrient-dense, packed with health promoting sulfur compounds as well as vitamins K, A, C, and manganese, tryptophan, calcium, copper, vitamin B6, iron, and potassium. In order for this mix to hold together it requires a little more egg and flour; I use a combination of cornmeal, all-purpose and buckwheat. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/12/12/science/13recipehealth/13recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "About 30 latkes, serving 6 ", "recipeCuisine": "jewish", "recipeCategory": "dinner", "keywords": "cabbage, carrot, purple kale, dairy-free, halal, healthy, kosher, low sugar, nut-free, vegetarian, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 192, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "332 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 cups finely shredded cabbage (about 1 1/4 pounds, or half of a small cabbage)", "2 cups finely chopped purple kale or curly kale", "7 to 8 ounces carrots, peeled and grated (about 1 1/2 cups)", "1/2 cup chopped cilantro", "1 serrano chili, seeded and minced", "1 teaspoon baking powder", "Salt to taste", "2 teaspoons cumin seeds, lightly toasted and coarsely ground or crushed", "3 tablespoons oat bran", "3 tablespoons all-purpose flour", "3 tablespoons cornmeal", "2 tablespoons buckwheat flour", "3 eggs, beaten", "About 1/4 cup canola, grape seed or rice bran oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 300 degrees. Line a sheet pan with parchment. Place a rack over another sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl mix together the cabbage, kale, cilantro, chili, baking powder, salt, cumin, oat bran, flour, cornmeal and buckwheat flour. Taste and adjust salt. Add the eggs and stir together. Let the mixture sit for 10 to 15 minutes, then stir again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large heavy skillet over medium heat. Take a 1/4 cup measuring cup and fill with 3 tablespoons of the mixture. Reverse onto the parchment-lined baking sheet. Repeat with the remaining latke mix. You should have enough to make about 20 latkes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the oil to the pan and when it is hot (hold your hand a few inches above – you should feel the heat), slide a spatula under one portion of the latke mixture and transfer it to the pan. Press down with the spatula to flatten. Repeat with more mounds. In my 10-inch pan I can cook four at a time without crowding; my 12-inch pan will accommodate four or five.  Cook on one side until golden brown, about three to four minutes. Slide the spatula underneath and flip the latkes over. Cook on the other side until golden brown, another three minutes. Transfer to the rack set over a baking sheet and place in the oven to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot topped with low-fat sour cream, Greek style yogurt or crème fraîche."}], "link": "https://cooking.nytimes.com/recipes/1014397-cabbage-carrot-and-purple-kale-latkes"}