{"@context": "http://schema.org", "@type": "Recipe", "name": "Simple Lamb Kebabs With Greek Flavors", "description": "In days gone by, Italian dressing might have been a go-to marinade for lamb. After you soak, say, some lamb skewers in this dressing for a while and then grill them, what you get is grilled lamb with a kind of vague mix of vinegar, oil and faded herb taste. Contrast this with grilling the lamb, then putting it in a bowl and adding an acidic flavor, like lemon juice or vinegar, the oil and whatever herbs you choose. You’ll get the smoothness of the oil, the sharp hit of the acid (in this case, lemon juice), the aroma of the herbs (in this case marjoram) and the sweet meatiness of the lamb, each distinct flavor complementing and reinforcing others.\n", "author": {"@type": "Person", "name": "John Willoughby And Chris Schlesinger"}, "image": "https://static01.nyt.com/images/2013/08/21/dining/21JPGRILLING3/21JPGRILLING3-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 entree servings", "recipeCuisine": "greek", "recipeCategory": "dinner, easy, quick", "keywords": "lamb, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 94}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 782, "unsaturatedFatContent": "43 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "65 grams", "fiberContent": "3 grams", "proteinContent": "43 grams", "saturatedFatContent": "18 grams", "sodiumContent": "691 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["2 pounds boneless leg of lamb", "1/4 cup plus 1/3 cup extra-virgin olive oil", "Salt and pepper to taste", "Juice of 2 lemons", "2 tablespoons minced garlic", "1/3 cup roughly chopped fresh marjoram"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Build a fire in your grill; when the coals are covered with gray ash and the temperature is medium high (you can hold your hand 5 inches above the coals for 3 to 4 seconds), you’re ready to cook. (For a gas grill, turn all burners to high, lower cover and heat for 15 minutes, then turn burners to medium high.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the fire is heating up, trim the lamb of all but a thin layer of fat and cut into 32 more-or-less-equal chunks. Combine in a bowl with the 1/4 cup of olive oil and the salt and pepper and toss well to coat, then thread them onto skewers, about 8 chunks per skewer; they should snuggle up to one another but not be tightly pressed.\n\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the skewers directly over the coals and cook, turning to expose all 4 sides to the direct heat of the coals, until done to your liking, 2 to 3 minutes a side (8 to 12 minutes total) for medium rare. To check for doneness, cut into one of the chunks and check to see if it is done to your liking — remove from the heat when it is just slightly less done than you want it to be when you eat it.\n\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the lamb is cooking, prepare the remaining ingredients but keep in separate containers. Slide the lamb chunks off the skewers into a large bowl, add the remaining oil, lemon juice, garlic and marjoram one after another, toss well to coat, season to taste if needed and serve."}]}