{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Mango Chutney With Chiles", "description": "Chutneys are often made with unripe or dried fruit; they always include vinegar, sugar and spices. This recipe, with ripe fruit, offers a two-toned flavor: sweet and tropical offset by sultry spices and the heat of chilies. It’s welcome in a grilled-cheese sandwich, stirred into mayonnaise or yogurt for a quick dip or spread, or alongside any curry or daal.\n\nThere are thousands of varieties of mangoes, but two are predominant. The Tommy Atkin is green, blushed with rose, and as large as a softball. The champagne mango, the size of a large peach, is pale gold, with a floral flavor. I prefer the champagne, which tends to be less fibrous and has an impossibly lovely scent, but any mango is a boon. The fruit is full of such promise.", "author": {"@type": "Person", "name": "Cathy Barrow"}, "image": "https://static01.nyt.com/images/2013/03/20/dining/20TROPICAL2/20TROPICAL2-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "5 half-pint jars (5 cups)", "recipeCuisine": "indian", "recipeCategory": "condiments", "keywords": "mango, onion, raisins, spring, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 58}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 441, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "30 milligrams", "sugarContent": "15 grams", "transFatContent": null}, "recipeIngredient": ["5 pounds mangoes, about 9 Champagne or 6 Tommy Atkins", "1 cup, or 7 ounces, golden raisins (or dried cranberries, cherries or apricots)", "1 cup apple cider vinegar", "1 cup, or 7 ounces, brown sugar", "1/2 cup finely minced onion", "1/4 cup peeled, finely minced fresh ginger", "1 teaspoon yellow mustard seed", "1 teaspoon coriander seed", "6 cardamom pods, seeds extracted", "6 Kaffir lime leaves", "1 4-inch Chinese long red hot chile, or to taste", "1 4-inch serrano chile, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and dice the mangoes to yield 5 cups, or 2 pounds 4 ounces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a rack or a folded kitchen towel in a large pot, fill with water and bring to a boil. Add 6 half-pint canning jars and boil for 10 minutes. Jars may be left in the warm water until ready to be filled. (Alternatively, sterilize jars by running them through a dishwasher cycle, leaving them inside until ready to fill.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place canning rings in a small saucepan, cover with water and bring to a boil. Turn off heat and add lids to soften rubber gaskets. Rings and lids may be left in water until jars are filled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, heavy, nonreactive pot, stir together mangoes, raisins, vinegar, brown sugar, onion and ginger together. Crush the mustard, coriander and cardamom seeds with the side of your knife or a rolling pin. Add to the pot and stir well. Add the lime leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wearing gloves, slice the chiles into rings. Remove seeds if you wish. Decide how much chile suits your taste. (If you are heat averse, start with half the recommended amount and taste. The chiles may be omitted altogether for a sweeter chutney.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring heat up to medium and stir occasionally as mixture comes to a boil. Bring to a good hard boil, stirring all the time. Cook for 25 minutes, being careful to avoid sticking and burning as the mixture thickens. Adjust heat as needed without losing the boil and continue to stir."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 25 minutes, the mixture should be thick, with the fruit suspended in the tangy syrup, and a spoon pulled along the bottom of the pot leaving a trail.  Turn off heat and discard the lime leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the hot chutney into warm jars, leaving 1/2-inch headspace. Run a plastic knife gently around inside of jar to remove any air bubbles. Recheck headspace. Wipe jar rims clean with a damp towel. Place lids on jars, screw on rings and lower jars back into pot of boiling water. Return to full boil and boil jars for 15 minutes. Transfer jars to a folded towel and let cool for 12 hours; you should hear them ping as they seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cool, test seals by removing rings and lifting jars by their flat lids. If the lid releases, the seal has not formed. Unsealed jars should be refrigerated and used within a month, or reprocessed. (Rings and jars may be reused, but a new flat lid must be used each time jars are processed.) To reprocess, reheat syrup to boiling then continue as before."}], "link": "https://cooking.nytimes.com/recipes/1014606-spiced-mango-chutney-with-chiles"}