{"@context": "http://schema.org", "@type": "Recipe", "name": "Banana-Infused Pumpkin Pie", "description": "I love taking decadent treats and turning them into healthy nutritional powerhouses that allow you to enjoy your dessert without the guilt. Here is my favorite dessert: pumpkin pie. Over the years, I have experimented with many different recipes, and this maple-sweetened, banana-infused version with a graham cracker coconut crust, which takes minutes to prepare, is always a crowd pleaser. <br/><br/>Simply place all the ingredients in a blender to purée, and pour the filling into the prepared pie crust. Since this recipe is full of foods like pumpkin, banana, eggs and cinnamon, you, or your guests, won’t feel guilty about having seconds. <br/><br/>", "author": {"@type": "Person", "name": "Dawn Lerman"}, "image": "https://static01.nyt.com/images/2012/11/20/science/wellveggiefatdad2/wellveggiefatdad2-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "banana, graham cracker crumbs, pumpkin purée, dairy-free, kosher, vegetarian, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 79}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 216, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "11 grams", "sodiumContent": "136 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup (90 grams) honey graham cracker crumbs, finely processed to a powder (from approximately 7 to 8, 2 1/2-x-4 7/8-inch, crackers)", "1/4 cup (15 grams) unsweetened coconut flakes", "3 tablespoons (38 grams) granulated sugar (can also use date, brown, coconut sugars)", "1/4 teaspoon fine sea salt, divided", "5 tablespoons extra virgin coconut oil or unsalted butter, melted", "3/4 cup plus 2 tablespoons almond, soy, rice or coconut milk", "3/4 cup (about 213 grams) pumpkin purée", "1 large ripe banana", "1/4 cup maple syrup", "1 large egg, room temperature", "1/2 teaspoon vanilla extract", "1/2 teaspoon ground cinnamon", "1/2 teaspoon flax seeds, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease a (9-inch) pie dish and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the graham cracker crust. In a small mixing bowl, mix the graham cracker crumbs, coconut flakes, sugar, and 1/8 teaspoon salt until combined. Add the coconut oil (or butter) and mix together until the crust begins to clump together and resembles a wet sand. Spread the crust out evenly in the pie dish and press it into the bottom and the sides. Bake the crust for 4 minutes or until slightly toasted. Transfer to a wire cooling rack while preparing the pumpkin filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position the baking rack in the middle and preheat the oven to 350 degrees. Combine the milk, pumpkin purée, bananas, maple syrup, eggs, vanilla extract, cinnamon, flax seeds, if using, and the remaining salt in a blender and mix on high speed until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the pie filling into the crust. Bake the pie for about 50 minutes to 1 hour, or until the pie looks soft but set, with a mostly firm center. Transfer the pie to a cooling rack and let cool for 2 hours. Serve immediately or refrigerate until needed. The pie filling will firm up as it cools."}], "link": "https://cooking.nytimes.com/recipes/1014338-banana-infused-pumpkin-pie"}