{"@context": "http://schema.org", "@type": "Recipe", "name": "Berber Skillet Bread", "description": "The Berbers use an unusual leavening method that gives a warm, earthy aroma to the loaves: a mix of semolina flour, water and garlic cloves that quickly ferments into a pungent starter. The recipe requires three kinds of flour and takes two days, but is richly rewarding in flavor.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/berberskilletbread/berberskilletbread-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 8-inch bread rounds", "recipeCuisine": "african", "recipeCategory": "project", "keywords": "appetizer, garlic, semolina flour, yeast, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 116}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 644, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "131 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "7 grams", "proteinContent": "22 grams", "saturatedFatContent": "0 grams", "sodiumContent": "418 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2/3 cup (104 grams) plus 1/2 cup (70 grams) regular semolina flour (pasta flour)", "3/4 cup (85 grams) all-purpose flour", "2 garlic cloves, peeled", "2 2/3 cups (400 grams) extra-fine semolina flour", "1/2 teaspoon (1 1/2 grams) dry yeast", "2 1/2 teaspoons (15 grams) fine salt", "1/3 cup (52 grams) regular semolina flour or all-purpose flour, for handling the dough", "Moroccan Almond-Argan Butter, for serving (<a href=\"http://cooking.nytimes.com/recipes/1013861-moroccan-almond-argan-butter\" target=\"_blank\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the garlic starter", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the starter: In a glass or ceramic bowl, combine 2/3 cup semolina flour with the all-purpose flour. Gradually stir in 3/4 cup water to make a wet dough. Mix in garlic, cover, wrap in a towel and leave in a warm place, like an unheated oven, for a day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the starter, add 1/4 cup water and the remaining 1/2 cup semolina flour, and mix. Cover, wrap in a towel, and leave for 12 to 24 hours. The starter will get a crusty top and blossom underneath. Scoop out 1/2 cup starter and discard the rest, including garlic cloves (otherwise, as it continues to ferment, the smell would drive you out of your home)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the bread: In a food processor fitted with the metal blade, combine extra-fine semolina flour, the 1/2 cup of starter, the yeast and salt. Pulse once or twice. Add 1 cup warm water and process for 15 to 20 seconds to knead. Let rest 10 minutes. Pulsing food processor, trickle in another 1/4 cup water. Sprinkle a work surface with flour and turn dough onto it. Cover with an upside-down bowl for 10 minutes. Cut 4 1-foot squares of waxed or parchment paper and sprinkle with flour. Divide dough in four and put each piece on a piece of a floured paper, turning to coat. Press each into an 8-inch circle. Cover with kitchen towels and let rise 1 hour."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the bread", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, gently flatten each disk, then prick the tops all over with a fork. Heat an 8- or 10-inch nonstick skillet or griddle (or two, if you have them) over medium-high heat. Sprinkle the pan’s surface with flour, then pick up a dough round and flip it into the pan, paper side up. Peel off the paper and adjust the heat so that the bread sizzles gently. When it is browned and blistered on the bottom, about 5 minutes, flip the bread out onto a plate, then slide it back into the pan to cook the other side. Cook about 2 minutes, shaking the skillet often to prevent sticking. When browned, firm and fragrant, slide onto a platter and serve immediately, or cover with a towel to keep warm while you cook the remaining breads. Serve with Moroccan almond-argan butter."}]}], "link": "https://cooking.nytimes.com/recipes/1014206-berber-skillet-bread"}