{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberries in a Mango Sea", "description": "A ripe mango gives a bit when pressed, and its fragrance should be heady and sweet. To dice a mango, cut down the broad side of the fruit, slightly off center, from the stem end to the tip end. The knife should slide down against the flat side of the pit. Repeat on the other side, cutting as close to the pit as possible. Cut the flesh from the sides of the pit, following the curve of the pit. Lay each half on your cutting surface and score with the tip of your knife in a crosshatch pattern, down to —  but not through — the skin. Lift the mango half, and press on the skin with your thumbs to turn it inside out. Little cubes will pop out on the other side, and you can easily cut them away from the skin. One summer I lived in Cuernavaca, Mexico, and I would gather mangoes from the ground in a park. If I had had a food processor or a blender, I would have made this every day.\n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/04/25/health/25recipehealth/25recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "Serves eight", "recipeCuisine": "", "recipeCategory": "easy, soups and stews", "keywords": "dessert, healthy, vegan, vegetarian, lime juice, mango, strawberry, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 23}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 93, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "3 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "2 milligrams", "sugarContent": "19 grams", "transFatContent": null}, "recipeIngredient": ["2 large or 4 smaller ripe mangoes", "3 tablespoons fresh lime juice", "2 tablespoons sugar", "2 pints ripe, sweet strawberries, hulled and quartered", "Fresh mint leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and pit the mangoes: cut down the broad side of the fruit from stem end to tip end, slightly off center, with the knife following the edge of the pit. Cut down the other side of the fruit in the same way. Cut the flesh from the sides of the pit, cutting as close to the pit as possible. Lay each half, skin side down, on your cutting surface and score with the tip of your knife in a crosshatch pattern, down to -- but not through -- the skin. Lift each mango half, and press on the skin with your thumbs to turn the half inside out. Slice the cubes away from the skin. Repeat with the other half. Cut the strips from the sides away from the skin. Discard the skins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the mango in a food processor fitted with the steel blade. Add half the lime juice and 2 teaspoons of the sugar. Purée until smooth. Scrape into a bowl, and set aside. You should have about 2 cups purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the strawberries with the remaining lime juice and sugar, and let sit for 15 to 30 minutes, in or out of the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon about 1/4 cup of mango purée onto each dessert plate or into wide dessert bowls. Place a spoonful of strawberries, with juice, in the middle. Garnish with mint and serve."}], "link": "https://cooking.nytimes.com/recipes/1014157-strawberries-in-a-mango-sea"}