{"@context": "http://schema.org", "@type": "Recipe", "name": "Spring Roll, Master Recipe", "description": "Spring rolls go far beyond those deep-fried versions served as an appetizer at nearly every Thai restaurant in this country. They’re found all across Asia, with wrappers, fillings and cooking techniques that differ from one country to the next. Fresh spring rolls, sometimes called summer rolls, are a staple in Vietnam. Most typically, they’re made of rice paper filled with rice vermicelli, cooked meat or shrimp, raw vegetables, basil, cilantro and mint.\n\nThis master recipe allows you to mix and match your wrappers and fillings. Some tips: Don’t overstuff. Rice paper is pliable, but it will tear if you stretch it too thin. And remember that before you even start to stuff, rice paper can be tricky. Soak a sheet of it briefly (10 seconds is about right) in a dish or skillet of hot water (110 degrees or so). Put it on a paper or dish towel so it doesn’t stick, then fill and roll as tightly as you can, folding in the sides like a burrito. If you’re using nori, spritz the sheets all over with a little water before you fill them; it will soften them up enough to roll without much hassle.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/08/dining/springrolls/springrolls-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 to 8 servings", "recipeCuisine": "asian", "recipeCategory": "quick", "keywords": "appetizer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 77, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "0 grams", "sodiumContent": "38 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 ounces rice vermicelli noodles", "1/4 cup mint leaves", "1/4 cup basil leaves (preferably Thai)", "1/4 cup cilantro leaves", "3/4 cup chopped, sliced, or shredded vegetables, greens, or fruit (like asparagus, beans sprouts, carrots, cucumbers, or kimchi)", "3/4 cup chopped or sliced protein (like raw salmon or tuna, tofu, or cooked meat or poultry)", "4 to 8 (8-inch) rice paper rounds, nori sheets, or large, pliable lettuce leaves (like red leaf, or Boston)", "1/2 cup dipping sauce of your choice (like ginger-scallion sauce, miso thinned with water, Sriracha mayonnaise, or plain soy sauce)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the rice noodles in boiling water until tender, 5 to 10 minutes. Rinse under cold water and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare all of your fillings and put them in bowls (or neat piles) so that they're all in place once you're ready to start rolling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the wrappers, and roll: \n\n    If you're using rice paper, soak a round in a dish or skillet of hot water until pliable, about 10 seconds. Put the round on a     paper or dish towel so it doesn't stick, then fill and roll as tightly as you can, folding in the sides like a burrito.\n \n    If you're using nori, spritz the sheets all over with a little water to soften them slightly. Spread the rice noodles all over the nori except for the far edge. Pile the fillings closest to you and roll, wetting the far edge with a little more water so you can seal the roll. Keep them as long rolls, or cut them into smaller pieces if you prefer.\n\n    If you're using lettuce, just spread the leaves out flat, the fill and roll as tightly as you can, folding in the sides like a burrito."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with the dipping sauce on the side."}], "link": "https://cooking.nytimes.com/recipes/1014727-spring-roll-master-recipe"}