{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled-Peach Sundaes With Salted Bourbon-Caramel Sauce", "description": "This recipe came to The Times from John Currence, the celebrated chef in Oxford, Miss. It is a meditation on the delights of summer: fresh, juicy peaches, cold buttermilk and whipped cream -- and grilling. The alcohol from the bourbon will burn off when you mix it into the caramel, so don’t worry about serving it to children. ", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": null, "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 14}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1130, "unsaturatedFatContent": "41 grams", "carbohydrateContent": "91 grams", "cholesterolContent": null, "fatContent": "83 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "37 grams", "sodiumContent": "997 milligrams", "sugarContent": "87 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 ripe peaches", "3 tablespoons peanut oil", "Sea salt", "1 cup whole pecan halves", "1 1/2 tablespoons melted butter", "3/4 teaspoon salt", "1/4 teaspoon cayenne", "1 1/2 tablespoons sugar", "1 cup sugar", "1/4 cup water", "2 tablespoons light corn syrup", "3/4 cup heavy cream", "4 tablespoons butter", "1 teaspoon sea salt", "1/4 cup bourbon", "1 cup best-quality heavy cream", "3 tablespoons powdered sugar", "1 teaspoon vanilla", "1/4 cup buttermilk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the peaches:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the peaches: Heat a charcoal grill while you bring a saucepan of water to simmer. Score the bottom of each peach with an X, then blanch for about 45 seconds, until skin near the X looks loose. Remove peaches with a slotted spoon and cool in a bowl of ice water. Peel the peaches. Then, with a paring knife, start at the stem of the peach and make a single cut around to the tip. Rotate hands in opposite directions, twist and free flesh from pit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the peach halves cut side up and brush lightly with peanut oil; sprinkle with salt. Place the peaches cut side down on grill (you can also use a stovetop grill pan set over medium heat) and cook until there are grill marks, about 2 minutes. Brush with oil and sprinkle with salt. Flip and grill the other side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pecans: Toss the first four ingredients in a bowl; spread on a nonstick cookie sheet and bake at 350 degrees for 12-15 minutes, or until nicely toasted. Remove and toss with the sugar."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the pecans:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the caramel: Combine the sugar, water and corn syrup in a saucepan and bring to a low boil. Gently swirl the mixture in a circular motion (do not stir) and allow it to boil down until it is a deepamber caramel, at least 10 minutes. Carefully whisk in the cream, protecting your hand from the steam. Immediately whisk in the butter and continue to stir over low heat until mixture is smooth. Stir in salt and bourbon and whisk again. Remove from heat and allow to cool before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the whipped cream: Whip the cream until soft peaks form. Stir in powdered sugar and vanilla and whip to stiff peaks. Drizzle in the buttermilk and whip until incorporated. Refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble: Place 2 peach halves in a bowl; scoop ice cream into each pit and add a dollop of whipped cream. Sprinkle with pecans and drizzle salted bourbon-caramel sauce over the whole shebang."}]}], "link": "https://cooking.nytimes.com/recipes/1014078-grilled-peach-sundaes-with-salted-bourbon-caramel-sauce"}