{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Beans With Mint, Peppers and Tomatoes", "description": "I’m becoming hooked on baked beans. The long, slow, gentle cooking called for in this recipe results in a thick, sweet sauce and very soft beans.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/03/08/science/07recipehealth/07recipehealth-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 52}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 395, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "15 grams", "proteinContent": "18 grams", "saturatedFatContent": "2 grams", "sodiumContent": "567 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["1 pound borlotti or pinto beans, rinsed, picked over and soaked, if desired, in 2 quarts water for six hours or overnight", "1 dried or fresh hot red chili pepper", "Salt", "2 medium onions, chopped", "1/4 cup extra virgin olive oil", "3 large garlic cloves, minced or pressed", "2 red bell peppers, chopped", "2 teaspoons paprika", "1 14-ounce can chopped tomatoes with juice", "2 tablespoons tomato paste", "Freshly ground pepper", "2 tablespoons chopped fresh mint, plus additional for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have soaked the beans, drain them over a bowl and use the soaking water for cooking. Combine with enough water to cover by two inches in a large, ovenproof casserole or Dutch oven. Add the dried chili, bring to a boil, reduce the heat and simmer 45 minutes to an hour until the beans are tender but intact. Stir in salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the beans are simmering, heat the oven to 300 degrees and prepare the remaining vegetables. Heat the oil over medium heat in a large, heavy frying pan. Add the onions. Stir together, cover and cook, stirring occasionally, for 15 minutes until lightly browned. Stir in the garlic, the red peppers and a pinch of salt, and cook, stirring, for five minutes until the peppers are just tender and the mixture is fragrant. Add the paprika, tomatoes and tomato paste, and cook, stirring often, until the tomatoes have cooked down a little, five to 10 minutes. Remove from the heat, and add this mixture to the beans. Add freshly ground pepper and the mint, and blend the mixture thoroughly. Taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the beans in the oven, and bake, covered, for 1 1/2 hours until very tender and the broth has reduced to a thick sauce. Stir and check from time to time to make sure the beans are covered with liquid. Add hot water if necessary. Garnish with additional mint and serve, or allow to cool and serve warm."}], "link": "https://cooking.nytimes.com/recipes/1014144-baked-beans-with-mint-peppers-and-tomatoes"}