{"@context": "http://schema.org", "@type": "Recipe", "name": "Nectarines and Berries in Wine Sauce", "description": "I have kept a box of white wine in my refrigerator and red in the pantry almost since these easily dispensed wines first became available. Need a half-cup, a cup or more for a recipe? It’s at hand, ready to go into the pot, and there’s also some always ready to go into the cook.About the only time I serve the wines is on an informal occasion, for example if someone wants a glass of white when everybody else is drinking red. The wines are also handy for a mixed wine drink like a kir, or even sangria.Their destiny, as the poaching liquid for summer nectarines, could not be more rewarding. The fruit is mixed with berries, and the wine, sweetened with sugar, is enriched with berry purée and reduced to a sauce. Whether to use white or red depends on the berries you select. Do not skimp on the chilling time; overnight would not be a mistake. It improves the dessert. ", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/04/04/dining/nectarines-berries-wine-sauce/nectarines-berries-wine-sauce-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings on its own, 6 to 8 with ice cream", "recipeCuisine": "", "recipeCategory": "", "keywords": "berries, nectarine, wine, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 300, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "8 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "6 milligrams", "sugarContent": "41 grams", "transFatContent": null}, "recipeIngredient": ["1 pint raspberries or blackberries, rinsed", "2 cups dry white or red wine", "1/2 cup sugar", "4 large firm but ripe nectarines, quartered, pits removed and reserved", "Juice of 1/2 lemon", "3 tablespoons framboise or blackberry brandy, optional", "Mint sprigs, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Purée half the raspberries or blackberries by forcing them through a sieve or potato ricer to eliminate seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the wine (with raspberries, use white; with blackberries, red) in a 3-quart saucepan. Stir in the sugar, bring to a slow simmer and add the nectarines and pits. Simmer until the fruit is just tender, about 3 minutes. Transfer the nectarines to a bowl with a slotted spoon, draining well. Discard the pits. Stir berry purée into the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring wine with berry purée to a boil and cook about 15 minutes, until reduced to about 3/4 cup. Remove from heat and stir in the lemon juice and framboise or brandy, if using. Allow to cool 30 minutes. Mix the remaining berries with the nectarines. Pour the sauce over the fruit and refrigerate several hours, or overnight. Serve on its own or over ice cream, garnished with mint."}], "link": "https://cooking.nytimes.com/recipes/1014190-nectarines-and-berries-in-wine-sauce"}