{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato and Apple Latkes With Ginger and Sweet Spices", "description": "I found that the best way to make these so they cook through without burning is to make small latkes, using about 2 tablespoons of the mixture for each one. You can also finish them in the oven. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/12/11/science/11recipehealth/11recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "About 40 small latkes, serving 6 to 8", "recipeCuisine": "jewish", "recipeCategory": "dinner", "keywords": "apple, ginger, sweet potato, dairy-free, halal, healthy, high fiber, kosher, nut-free, vegetarian, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 61}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 175, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "289 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pound red-fleshed sweet potatoes (yams), peeled and grated – about 5 cups grated", "1 cup grated apple, preferably a slightly tart variety such as Braeburn", "2 teaspoons fresh lime juice", "1 to 2 teaspoons grated fresh ginger (to taste)", "2 teaspoons ground cinnamon", "1/2 teaspoon freshly grated nutmeg", "1 teaspoon baking powder", "Salt to taste", "3 tablespoons oat bran", "3 tablespoon matzo meal or all-purpose flour", "2 eggs, beaten", "About 1/4 cup canola, grape seed or rice bran oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large heavy skillet over medium heat. Heat the oven to 350 degrees. Line a sheet pan with parchment and place a rack over another sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the grated sweet potatoes in a large bowl. Toss the grated apple with the lime juice and add to the sweet potatoes, along with the ginger, spices, baking powder, salt, oat bran and matzo meal or flour. Taste and adjust salt. Add the beaten eggs and stir together. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take a 1/4 cup measuring cup and fill with 2 tablespoons of the mixture. Reverse onto the parchment-lined baking sheet. Repeat with the remaining latke mix. You should have enough to make about 40 latkes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the oil to the pan and when it is hot (hold your hand a few inches above – you should feel the heat), slide a spatula under one portion of the latke mixture and press down with the spatula to flatten. Repeat with more mounds. In my 10-inch pan I can cook four at a time without crowding; my 12-inch pan will accommodate five or six.  Cook on one side until golden brown, about three minutes. Slide the spatula underneath and flip the latkes over. Cook on the other side until golden brown, another two to three minutes. Transfer to the rack set over a baking sheet. Try one latke and if it is still a bit chewy in the middle transfer them to the baking sheet and place in the oven for 10 minutes, until golden brown and soft in the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot topped with applesauce and low-fat sour cream, thick Greek yogurt or crème fraîche if desired."}]}