{"@context": "http://schema.org", "@type": "Recipe", "name": "Super Tomato Sandwiches", "description": "I never could resist a tomato sandwich. It is the combination of mayonnaise, tomatoes and bread that is so compelling. I call these MLTs: mayonnaise, lettuce and tomatoes. I make a spicy mayo with chipotle adobo (my son’s favorite), and an herbal mayo with tarragon (my favorite). Play around with aioli and other flavored mayonnaises. Use whole grain bread and toast it lightly so that it doesn’t get soggy. The tomatoes should overlap in a thick layer.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/07/22/science/sub22recipehealth/sub22recipehealth-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "1 sandwich", "recipeCuisine": "", "recipeCategory": "easy, lunch, quick", "keywords": "avocado, lettuce, tomato, dairy-free, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 42}, "recipeIngredient": ["1 tablespoon adobe or tarragon mayonnaise (see tip)", "2 slices whole wheat or mixed grains sandwich bread, lightly toasted", "1 large or 2 medium tomatoes, sliced", "Salt and pepper, if desired (don’t salt if you are not eating right away because the tomatoes will release too much juice)", "1/4 medium avocado, thinly sliced", "Lettuce, arugula or spring greens", "Fresh basil leaves, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread mayonnaise on both slices of the lightly toasted bread. Arrange tomato slices in a thick overlapping layer on top of the bottom slice. Sprinkle with salt, pepper  and basil if desired (do not salt if not eating right away)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a layer of thin avocado slices on top of the tomatoes and top with lettuce leaves and the top slice of bread. Press down firmly and cut the sandwich in half. You can wrap and transport the sandwich, as the toasted bread will resist becoming soggy for a few hours."}], "link": "https://cooking.nytimes.com/recipes/1014904-super-tomato-sandwiches"}