{"@context": "http://schema.org", "@type": "Recipe", "name": "Broiled Green Clams", "description": "Here you have clams done casino style, with bacon. They take a detour through the herb garden to dress themselves in green, as might befit something to serve with “green wine.” Lemon zest acknowledges the pervasive citrus notes in the wine. The recipe is a one-shot food processor job that’s easy enough to suggest doubling it, making enough of the bread crumb mixture to serve a bigger crowd with four dozen clams, or to freeze half for the next time you open some Vinho Verde or another aperitif wine.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2013/07/03/dining/03PAIR_SPAN/03PAIR_SPAN-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "bacon, clams, sourdough", "aggregateRating": null, "recipeIngredient": ["2 dozen littleneck clams on the half shell", "3 ounces bacon, about 6 strips", "1 1/2 cups stale crustless sourdough bread, diced", "1/4 cup chopped red onion", "1 medium-large jalapeño, seeded and chopped", "1/4 cup, packed, flat-leaf parsley", "Leaves from 4 branches fresh thyme", "1 lemon, zest grated, the rest in wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange clams on a foil-lined baking sheet with sides. Fry bacon until crisp. Drain and cut in pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place bread, onion, jalapeño, parsley, thyme, lemon zest and bacon in a food processor and let it rip for a good few minutes, scraping down sides once or twice, until everything is uniformly combined and bread crumbs are quite finely ground."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat broiler. Cover each clam with crumb mixture, patting it on top. Place clams under broiler, fairly close to the heat source, until browned on top, about 5 minutes. Serve with lemon wedges."}]}