{"@context": "http://schema.org", "@type": "Recipe", "name": "Tropical Pineapple Sauce", "description": "With a little knife work and a slow simmer, the pineapple sauce is ready in no time at all. While it shines in a banana split, turning a sundae from typical to tropical, you’ll find many other ways to use it: between the layers of a classic yellow cake, added to yogurt or cottage cheese, or combined with spicy mustard and chopped scallions for a sensational baked chicken.", "author": {"@type": "Person", "name": "Cathy Barrow"}, "image": "https://static01.nyt.com/images/2014/06/10/dining/pineapplesauce/pineapplesauce-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 cups, or 4 half-pint jars", "recipeCuisine": "", "recipeCategory": "condiments, project, sauces and gravies", "keywords": "mint, pineapple, rum, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 15}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 363, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "90 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "3 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "7 milligrams", "sugarContent": "84 grams", "transFatContent": null}, "recipeIngredient": ["8 cups finely diced, very ripe pineapple; about 2 pineapples", "2 cups white sugar", "1 cup brown sugar", "6 stalks fresh mint, rinsed and tied into a bundle", "Juice of one lemon", "1/4 cup dark rum"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dice pineapple into 1/2-inch pieces, removing any brown eyes. Combine fruit, sugars, mint and lemon juice. Cover and leave on the counter for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir pineapple mixture and discard the mint. Add mixture to a heavy nonreactive pan and simmer slowly, stirring regularly, for about an hour, until sauce is very thick and clear and has reached 220 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add rum. Stir until mixture is thick and clear again, about 5 minutes. Sauce will keep 3 months in the refrigerator or a year if processed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To process, put a rack in a large stockpot or line the pot with a folded kitchen towel, then fill the pot with water and bring to a boil. Add 4 half-pint canning jars and boil for 10 minutes. Jars may be left in the warm water in the pot until ready to be filled. Alternatively, sterilize the jars by running them through a dishwasher cycle, leaving them inside until ready to fill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place canning rings in a small saucepan, cover with water and bring to a boil. Turn off heat and add the lids to soften rubber gaskets. Rings and lids may be left in the water until jars are filled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the jars from the water bath and ladle hot sauce into warm jars, leaving 1/2-inch of headspace. Run a plastic knife gently around the inside of the jar to remove any air bubbles. Recheck the headspace."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe jar rims clean with a damp towel. Place the lids on the jars, screw on the rings and lower the jars back into the pot of boiling water. Return to a full boil and boil for 15 minutes. Transfer jars to a folded towel and let cool for 12 hours. You should hear them ping as they seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cool, test the seals by removing rings and lifting jars by the flat lids. If a lid releases, the seal has not formed. Unsealed jars should be refrigerated and used within 3 months, or reprocessed. Rings and jars may be reused, but a new flat lid must be used each time."}], "link": "https://cooking.nytimes.com/recipes/1014600-tropical-pineapple-sauce"}