{"@context": "http://schema.org", "@type": "Recipe", "name": "Vietnamese-Style Crispy Shrimp Cakes", "description": "These crispy shrimp cakes were inspired by chao tom, Vietnamese shrimp on sugar cane, a delectable appetizer you'll find at restaurants in which shrimp is whirled into a paste in the food processor, then patted on pieces of sugar cane and steamed before grilling or frying. This version leaves out the sugar cane, which can be hard for some home cooks to find, but keeps the essence of the dish: golden-edged, pan-fried cakes that are served with nuoc cham, a piquant sauce. Although traditional recipes keep the shrimp seasonings to a minimum, making up for it later with the sauce, this one spices up the paste, adding lemon grass to the shrimp along with green chiles and scallions. (If you don't often cook with lemon grass, <a href=\"http://www.nytimes.com/video/dining/100000002080051/dealing-with-lemongrass.html\">this video</a> will show you how to prepare it.) You can serve the cakes as an appetizer wrapped in lettuce leaves or herbs (large basil leaves are wonderful in summer). Or fry them up for dinner, heaping them on rice noodles and dousing it all with nuoc cham.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/05/17/dining/17COOKING-SHRIMPCAKES/17COOKING-SHRIMPCAKES-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "14 cakes", "recipeCuisine": "vietnamese", "recipeCategory": "", "keywords": "appetizer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 91}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 387, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "1 gram", "proteinContent": "17 grams", "saturatedFatContent": "5 grams", "sodiumContent": "2059 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound shelled large shrimp, coarsely chopped", "1/4 cup cornstarch, more for dusting", "2 tablespoons minced lemon grass (tender inner stalk only)", "2 garlic cloves, minced", "2 serrano or jalapeño chile peppers, seeded and minced", "4 scallions, thinly sliced, white and light green part separated from dark green tops", "1 tablespoon plus 2 teaspoons sugar", "1 teaspoon coarse kosher salt", "1/4 cup Asian fish sauce", "Finely grated zest of 1 lime", "1/4 cup fresh lime juice (from 2 to 3 limes)", "Peanut oil, for frying", "Cooked rice noodles, optional, for serving", "1/2 cup fresh cilantro leaves, optional, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor, combine shrimp, cornstarch, lemon grass, garlic, chiles, white and light green scallion bottoms, 2 teaspoons sugar and salt. Pulse until mixture forms a coarse paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together fish sauce, lime zest and juice, 1 tablespoon sugar and the dark green scallion tops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large skillet over medium-high heat. Wet hands to keep shrimp paste from sticking. Form 2 tablespoons of shrimp mixture into a 1/2-inch-thick patty. Dust patty with cornstarch. Repeat with remaining batter. Fry patties in batches until golden brown, 2 to 3 minutes per side. Serve over rice noodles, if desired, drizzled with fish sauce mixture and strewn with cilantro."}]}