{"@context": "http://schema.org", "@type": "Recipe", "name": "French 75", "description": "Most people think nothing of popping a bottle of Champagne on New Year’s Eve. Yet after that first celebratory glass, few consider taking an extra step and using the wine as the foundation for a cocktail or two.  \n\n“They’re bright and crisp and delicious,” said Meaghan Dorman, a bartender at Raines Law Room in the Flatiron District. And ideal for New Year’s Eve. “They are usually low in spirit, so if I’m out having a few drinks, I would have French 75s. It’s wine and spirit, so I’d feel I wasn’t overdoing it on superstrong spirit drinks.”\n\nShe and her fellow bartender Lauren Davis call this judicious drinking tactic the Champagne Maintain. “It’s our theory on lasting all night and still staying a lady,” Ms. Dorman said.", "author": {"@type": "Person", "name": "Robert Simonson"}, "image": "https://static01.nyt.com/images/2014/04/11/dining/French-75/French-75-articleLarge.jpg", "recipeYield": "1 drink", "recipeCuisine": "", "recipeCategory": "", "keywords": "champagne, cognac, lemon juice, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 95}, "recipeIngredient": ["1 cup sugar", "1 ounce gin or Cognac", "1/2 ounce fresh lemon juice", "2 ounces Champagne", "Lemon twist"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make simple syrup: In a saucepan over low heat, warm sugar in 1 cup water until dissolved. Cool to room temperature before using. (There will be extra syrup; refrigerate if not using immediately.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a cocktail shaker filled with ice, shake gin or Cognac, lemon juice and 1/2 ounce simple syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain into chilled flute or cocktail coupe. Top with Champagne. Garnish with lemon twist."}], "link": "https://cooking.nytimes.com/recipes/1014443-french-75"}