{"@context": "http://schema.org", "@type": "Recipe", "name": "Barbecued Beef Ribs", "description": "Just before being served, these ribs are grilled, imparting a crisp, charred crust and an inviting whiff of wood smoke.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2014/04/22/dining/Beef-Ribs/Beef-Ribs-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "beef short ribs, dark brown sugar, spices, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 119}, "recipeIngredient": ["Four 1-pound beef short ribs", "Sea salt", "2 tablespoons vegetable oil, plus more for grill grate", "1 medium onion, finely chopped", "2 carrots, finely chopped", "5 cloves garlic, peeled", "5 stalks lemon grass, trimmed and cut into 2-inch pieces", "1 two-inch piece ginger, cut into 1/4-inch slices", "1 cup soy sauce", "1/2 cup dark brown sugar", "1/4 cup rice vinegar", "3/4 cup ketchup", "1/2 cup dark brown sugar", "1/2 cup rice vinegar", "2 tablespoons mirin", "2 teaspoons soy sauce", "3 cloves garlic, peeled and lightly crushed with side of knife", "3 1/4-inch slices fresh ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the ribs: Heat the oven to 325 degrees. Season the ribs all over with salt. In a large Dutch oven or other heavy pot, heat 2 tablespoons oil over medium-high heat. Add the ribs and brown on all sides, turning with tongs, 5 minutes a side. Transfer to a platter and pour off all but 2 tablespoons fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion, carrots, garlic, lemon grass and ginger to the pot. Cook over high heat until lightly browned, 3 minutes. Stir in the soy sauce, brown sugar, rice vinegar and 3 cups water, and bring to a boil. Return the ribs to the pot, immersing them in the liquid. Tightly cover and bake, turning the ribs once or twice until very tender, about 3 1/2 hours. Let the ribs cool in the liquid, then drain well. (Ribs can be refrigerated for up to 24 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the glaze: In a heavy saucepan, combine all the glaze ingredients and simmer over medium heat until thick, about 10 minutes. Strain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a grill for direct grilling over high heat. Brush and oil the grate. Cook the ribs until dark brown all over, 3 to 5 minutes a side, basting with the glaze. Serve with the remaining glaze drizzled on top or passed separately in a bowl."}], "link": "https://cooking.nytimes.com/recipes/1014177-barbecued-beef-ribs"}