{"@context": "http://schema.org", "@type": "Recipe", "name": "Greens and Red Cabbage Gratin", "description": "Like blueberries, red cabbage contains anthocyanins, phytochemicals that some experts believe may have powerful antioxidant and anti-inflammatory properties. The nutritional attributes of red cabbage don’t just come from the anthocyanins. All vegetables in the cabbage family — the brassicas, also known as cruciferous vegetables — also are packed with sulfur compounds that may help protect the body. I thought this Provençal gratin served six, but it’s so good that recently four of us made a meal of it with no trouble. It’s a great vegetarian main dish. Serve a green salad on the side.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/02/01/health/01recipehealth_600/01recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves four to six", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 237, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "520 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound greens, such as chard, beet greens or kale, stemmed and cleaned in two changes of water", "1 pound red cabbage, finely chopped", "3 tablespoons olive oil", "1 medium onion, finely chopped", "2 large garlic cloves, minced or pressed", "Salt", "freshly ground pepper", "2 eggs", "1/4 cup chopped flat leaf parsley", "1/2 cup rice, preferably a short grain rice like arborio, cooked", "2 ounces Gruyère cheese, grated 1/2 cup", "2 tablespoons breadcrumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Fill a bowl with ice water. When the water comes to a boil, salt generously and add the greens. Blanch for about two minutes, until tender and bright green. Transfer to the ice water, then drain and squeeze out water. Chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Oil a 2-quart gratin. Heat 2 tablespoons of the olive oil in a large, heavy nonstick skillet over medium heat, and add the onion. Cook, stirring often, until tender and translucent, about five minutes. Stir in the garlic and cook for another minute, until fragrant. Stir in the cabbage and about 1/2 teaspoon salt. Cook, stirring, for 10 minutes, until the cabbage is tender and fragrant but still has some texture and color. Stir in the chopped blanched greens. Add salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a bowl, and stir in the cooked vegetables, parsley, rice and cheese. Stir together well and scrape into the baking dish. Sprinkle the breadcrumbs over the top, and drizzle on the remaining olive oil. Bake 30 to 40 minutes, until firm and browned on the top. Serve hot or warm."}], "link": "https://cooking.nytimes.com/recipes/1014055-greens-and-red-cabbage-gratin"}