{"@context": "http://schema.org", "@type": "Recipe", "name": "Korean Chilled Buckwheat Noodles With Chilled Broth and Kimchi", "description": "This recipe is inspired by the signature Korean summer noodle dish, naeng myung. The traditional dish is made with a strong beef broth. I’m using a vegetarian broth I make with dried mushrooms and kelp, adapted from a recipe in Deborah Madison’s “Vegetarian Cooking for Everybody.” You could also use chicken stock. The dish can include chicken or meat, or it can be vegetarian, as this version is, with tofu standing in for chicken. It can also be vegan if you omit the boiled eggs. Make the broth a day ahead so that it will be nice and cold.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/08/09/science/15recipehealthuse/15recipehealthuse-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "Serves 4", "recipeCuisine": "korean", "recipeCategory": "dinner, easy, lunch, soups and stews", "keywords": "cabbage kimchi, soba noodles, dairy-free, halal, healthy, high fiber, kosher, nut-free, vegetarian, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 18, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "93 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 dried shiitake mushrooms or a small handful of dried porcinis or other dried mushrooms", "1 bunch scallions, sliced, or 1/2 cup chopped chives", "1 4- to 6-inch stick of kombu", "1 medium carrot, sliced thin", "A handful of mushroom stems, or a couple of dried shiitakes", "5 cups water", "Soy sauce to taste", "Salt and sugar to taste", "9 ounces soba noodles (1 package imported)", "2 tablespoons dark sesame oil", "1 cup, tightly packed, cabbage kimchi, cut in thin strips (more to taste; we love it)", "6 ounces firm tofu, cut in small cubes", "1 bunch scallions, cut lengthwise into threads", "1/2 European cucumber (about 6 ounces), cut into fine 4-inch long julienne", "1/2 Asian pear or firm, ripe plum or pluot, peeled (pear only), seeded and cut into 2- or 3-inch long julienne", "2 hardboiled eggs, cut into quarters", "2 tablespoons seasoned rice vinegar", "Korean chili powder to taste (optional)", "Chopped cilantro or sprigs for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the broth. Combine all the ingredients for the broth except the salt and sugar in a saucepan and bring to a simmer. Cover and simmer 20 minutes. Strain. Season to taste with salt and sugar if desired. Place in the refrigerator until cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the soba noodles. Drain well and toss with 1 tablespoon of the sesame oil. Place in the refrigerator and chill while you prepare the other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the kimchi with the remaining sesame oil and refrigerate. Chill all of the other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the noodles among 4 wide bowls. Arrange the tofu, pear or plum and vegetables on top of and around the noodles and top with wedges of boiled egg. Stir the vinegar into the cold broth. Taste and adjust salt and sugar. Ladle into the bowls. Garnish with Korean chili powder and cilantro if desired, and serve. Guests should stir the mixture so that the kimchi flavors the broth and noodles."}]}