{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp and Grits With Roasted Tomato, Fennel and Sausage", "description": "", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/22/dining/Shrimp-and-Grits/Shrimp-and-Grits-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "southern", "recipeCategory": "dinner", "keywords": "grits, shrimp, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 123}, "recipeIngredient": ["8 plum tomatoes, halved lengthwise", "1 garlic clove, minced", "2 tablespoons olive oil", "Salt", "black pepper", "1 large fennel bulb, trimmed fronds reserved and cut into thin wedges", "2 to 3 cups vegetable or shrimp broth or water", "1 tablespoon butter", "Salt", "Ground white pepper", "1 cup coarse corn grits, soaked overnight if necessary see package instructions", "Salt", "1 fresh bay leaf", "1 1/2 tablespoons butter", "1 tablespoon cream cheese", "Ground white pepper", "1/2 teaspoon lemon juice, or to taste", "1/2 teaspoon hot sauce, or to taste", "1 tablespoon olive oil", "20 large shrimp, peeled and deveined", "1 cup cooked and crumbled Benton’s smoked sausage or other smoked breakfast sausage", "1 teaspoon lemon juice, or to taste", "Hot sauce", "Salt", "2 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the roasted tomato: heat oven to 450 degrees. Toss tomato halves in a bowl with garlic, olive oil, salt and pepper. Transfer, cut side up, to a baking sheet. Roast until collapsed and lightly browned, 25 to 30 minutes, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the fennel: In a small saucepan, combine the fennel, half of the reserved fronds, and just enough broth or water to cover. Add butter and season with salt and white pepper. Bring to a boil, reduce heat to very low, and simmer until tender when pierced by a fork, 8 to 10 minutes. Transfer fennel to a plate, discard cooked fronds and reserve cooking liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the grits: Follow package instructions for cooking the grits, seasoning with salt to taste, and adding the bay leaf halfway through cooking. At the end of cooking, mix grits with butter, cream cheese, white pepper, lemon juice and hot sauce. Adjust salt as needed. About 15 minutes before the grits are finished cooking, prepare the shrimp and assemble the dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For shrimp and assembly: Place a large sauté pan over medium heat, and add the oil. When the oil is shimmering, add the shrimp in a single layer. When they are seared on one side, about 1 minute, turn them to sear on the other side. Add fennel, sausage, roasted tomatoes and 1 1/2 cups of the reserved fennel cooking liquid. Bring to a simmer and season with lemon juice, hot sauce and salt. If the mixture seems dry, add more fennel cooking liquid as desired. Add chopped parsley, and toss to mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place equal portions of grits on four rimmed plates or shallow soup plates. Divide the shrimp stew among the plates, garnish with remaining fennel fronds and serve."}]}