{"@context": "http://schema.org", "@type": "Recipe", "name": "Family-Meal Fish Tacos", "description": "This is a fast, satisfying fish dinner with Cajun flavors. Chad Shaner cooked it for staff meals when he was a line cook at Union Square Cafe in Manhattan. It was, he said shyly when The Times talked to him in 2013, one of the restaurant staff's favorites. “Everyone loves taco day,” he said. The recipe is not particularly Mexican. Shaner hails from Smyrna, Del., and served in the Navy before he went to cooking school. He makes a forceful kind of American food that borrows its flavors from wherever they are strongest. His fish tacos, he said, are something he cooked up one night with his brother, Andy, a bartender. “We were looking for intense flavor,” he said of the Cajun-style rub they used on the fish.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2013/06/02/magazine/02eat1/mag-02Eat-t-000_CA1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, easy, lunch, quick", "keywords": "corn tortillas, fish, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 931}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 764, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "9 grams", "proteinContent": "38 grams", "saturatedFatContent": "22 grams", "sodiumContent": "1016 milligrams", "sugarContent": "6 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 tablespoons chile powder", "2 tablespoons garlic powder", "2 tablespoons paprika", "1 tablespoon ground cumin", "1 teaspoon red-pepper flakes, or to taste", "1 1/2 pounds firm white fish fillets, like cod or red snapper, skinless", "Kosher salt and freshly ground black pepper to taste", "1 1/2 cups sour cream", "2 chipotle chilies in adobo, finely chopped, or more to taste", "12 white corn tortillas", "3 tablespoons neutral oil, like grapeseed or canola", "6 scallions, trimmed and cut into 4-inch lengths", "5 radishes, trimmed and sliced thin", "8 ounces Cheddar cheese, grated", "2 limes, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350. Combine the chile powder, garlic powder, paprika, cumin\nand red-pepper flakes in a shallow dish. Season the fish fillets aggressively with salt and pepper, then press them into the spice mixture, turning to coat. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the sour cream and the chipotles in a small bowl, and stir to combine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the tortillas until they are toasted in a large skillet set over high heat, approximately 30 seconds or so per side, then stack them on a large sheet of\naluminum foil. Wrap the foil around the tortillas, and place the package into the oven to heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat under the pan down to medium-high, and add a tablespoon of the oil and then the scallions. Cook these, tossing occasionally, until they are about to char, then remove and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining oil to the pan and heat it until it begins to shimmer. Add the fish and cook until well browned and crisp, approximately 4 minutes per side. Remove from pan and slice into strips or simply break into pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the fish with warm tortillas, garnished with the scallions, radishes, cheese and chipotle sour cream, and lime wedges on the side."}]}