{"@context": "http://schema.org", "@type": "Recipe", "name": "Bulgarian Cucumber Soup With Walnuts", "description": "Walnuts are used in sweet and savory dishes throughout the Mediterranean. Along the Italian Riviera, a rich ricotta and walnut sauce traditionally is served with ravioli filled with greens. In Turkey, a thick, garlicky walnut sauce called tarator is served with cooked vegetables, much as aïoli is in the South of France. In France, walnuts are added to salads, breads and many desserts, and they are eaten fresh as well as dried — a great delicacy in the fall, just after the harvest. I’ve never encountered creamy, fresh walnuts in American farmers’ markets, but if you know a walnut farmer, perhaps you could request some the next time they’re harvested. Before the weather becomes too chilly for cold soups, try this one. Bulgaria once was well known for the number of centenarians in its population, which some scientists attributed to the daily consumption of Bulgarian yogurt. Now, both the yogurt and eating culture in this mountainous country have changed for the worse, and so have local lifespans. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/09/28/health/28recipehealth1.ready/28recipehealth1.ready-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves four", "recipeCuisine": "eastern european", "recipeCategory": "dinner, easy, quick", "keywords": "appetizer, healthy, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 83}, "recipeIngredient": ["2 to 4 garlic cloves to taste, peeled, green shoots removed", "Salt to taste", "2 cups thick plain yogurt (Greek style, or drained)", "2 tablespoons walnut or olive oil, or 1 tablespoon each", "2/3 cup (2 ounces) shelled walnuts, finely chopped", "1 European cucumber, about 10 inches long, or 3 Persian cucumbers, cut in very small dice", "1/2 cup ice-cold water, preferably spring water", "2 tablespoons lemon juice", "Freshly ground pepper", "Ice cubes (optional)", "Finely chopped walnuts", "Extra virgin olive oil", "Finely chopped fresh dill or mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the garlic in a mortar with 1/2 teaspoon salt, and mash to a paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the yogurt in a large bowl. Stir in the oil, garlic and walnuts. Whisk in the water and the lemon juice. Add salt and freshly ground pepper to taste. Chill for one hour or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, season the cucumbers lightly with salt, and allow to drain in a colander for 15 minutes. Add to the yogurt mixture and stir together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you wish, place an ice cube in each bowl, and ladle in the soup. Top with chopped walnuts, a drizzle of olive oil if desired, and a sprinkling of dill or mint."}], "link": "https://cooking.nytimes.com/recipes/1014021-bulgarian-cucumber-soup-with-walnuts"}