{"@context": "http://schema.org", "@type": "Recipe", "name": "Savory Cornbread Stuffing", "description": "I find most cornbread to be very sweet. This one is grainy and savory, and the stuffing I make with it is my favorite. This is easily doubled for a larger quantity of stuffing. Bake it in a 3-quart baking dish (it will take about 45 to 50 minutes) or in two 9-inch pans.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/11/17/health/17recipehealth_600/17recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "buttermilk, cornmeal, sage, fall, halal, healthy, kosher, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 631}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 266, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "6 grams", "sodiumContent": "332 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup yellow cornmeal, preferably organic stone ground", "1/2 cup all purpose flour or whole wheat flour", "3/4 teaspoon salt", "1 tablespoon baking powder", "1/2 teaspoon baking soda", "2 eggs", "1 cup plain low-fat yogurt or buttermilk", "1/2 cup milk", "1 tablespoon mild honey", "2 to 3 tablespoons unsalted butter (to taste)", "2 tablespoons extra virgin olive oil, or 1 tablespoon each olive oil and unsalted butter", "1 large onion, finely chopped", "Salt to taste", "4 stalks celery, cut in small dice", "4 garlic cloves, minced", "2 teaspoons rubbed sage, or 2 tablespoons chopped fresh sage", "1 tablespoon fresh thyme leaves or 1 1/2 teaspoons dried thyme", "1/2 cup finely chopped flat-leaf parsley", "Freshly ground pepper", "A double batch of cornbread (see above), crumbled you can do this in a food processor fitted with the steel blade", "1/2 cup milk, or as necessary, for moistening", "4 tablespoons unsalted butter if baking separately"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Place a 9-inch cast iron skillet, a heavy 2-quart baking dish or a heavy 9-inch square baking pan in the oven while you prepare the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cornmeal in a bowl, and sift in the flour, salt, baking powder and baking soda. Stir the mixture with a spoon or whisk to amalgamate. In a separate bowl, beat together the eggs, yogurt (or buttermilk), milk and honey. Whisk the cornmeal mixture into the liquid mixture. Do not overwork the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the oven, and add the butter to the pan. Swirl the pan so that the butter melts quickly before it gets too brown, then quickly whisk the butter into the batter. Brush the sides of the pan with any butter remaining in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Quickly scrape all of the batter into the hot pan, and place in the oven. Bake 35 to 40 minutes, until golden brown and a toothpick inserted in the center comes out clean. It will be quite brown on the edges. Allow the bread to cool in the pan, or serve warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil (or oil and butter) over medium heat in a large, heavy, nonstick skillet, and add the onion. Cook, stirring often, until it begins to soften, about three minutes, and add 1/2 teaspoon salt and the celery. Cook together for another few minutes, until the onion is tender. Add the garlic, and stir together for 30 seconds to a minute, until fragrant. Transfer to a large bowl, and add the remaining ingredients. Combine well. Taste and adjust salt. Moisten as desired with milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stuff the cavity of the turkey, or transfer to a buttered or oiled 2-quart baking dish. Dot with butter. Cover with aluminum foil, and heat through in a 325-degree oven for 30 minutes."}], "link": "https://cooking.nytimes.com/recipes/1014334-savory-cornbread-stuffing"}