{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach and Tofu Wontons in Broth", "description": "You can find wonton wrappers in most supermarkets. Sometimes they’re in the produce section in the cooler with the tofu. Use either round or square wrappers for these; make them ahead if it’s more convenient and freeze.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/06/04/science/07recipehealth/07recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "3 1/2 to 4 dozen wontons, enough for 6 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "dairy-free, halal, healthy, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian, main course, spinach, tofu, wonton wrappers", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 48}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 452, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "4 grams", "proteinContent": "23 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1238 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 large bunch spinach (1 to 1 1/4 pounds), stemmed and washed well in 2 changes of water, or 9 ounces baby spinach (1 1/2 6-ounce bags)\n", "6 ounces firm tofu, cut in 1/4-inch dice (about 1 cup diced tofu)\n", "1 to 2 tablespoons soy sauce (to taste)\n", "2 teaspoons dry sherry\n", "1/2 teaspoon sugar\n", "Salt to taste\n", "2 teaspoons sesame oil\n", "1 tablespoon grapeseed oil, canola oil or peanut oil\n", "2 teaspoons minced garlic (2 large cloves)\n", "2 teaspoons minced fresh ginger\n", "1/2 cup minced scallions (white and light green parts)\n", "1 tablespoon sesame seeds\n", "2 tablespoons minced cilantro\n", "1 package wonton wrappers (freeze what you don’t use)\n", "1 egg, beaten, or 2 tablespoons water mixed with 1 teaspoon cornstarch\n", "2 quarts chicken stock or vegetable stock\n", "Salt to taste\n", "Chopped cilantro and sprigs for garnish\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the spinach above 1 inch boiling water until it wilts, 1 to 2 minutes. Rinse with cold water and squeeze dry, taking up the spinach by the handful. Chop fine and set aside.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blot the tofu on paper towels. Combine the soy sauce, sherry, sugar and salt to taste in a small bowl and stir until the sugar and salt have dissolved, then stir in the sesame oil. Place on the stove near your wok or skillet. Place the garlic, ginger and scallions together in a container near your wok or skillet.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or a 12-inch steel skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in the grapeseed, canola or peanut oil by adding it to the sides of the pan and swirling the pan, then add the tofu and spread out in a single layer. Let it sear for 1 minute, then stir-fry for 1 to 2 minutes, until it begins to color. Add the garlic, ginger and scallions and stir-fry for 30 seconds. Add the spinach and sesame seeds and stir-fry for 30 seconds. Add the soy sauce mixture and stir-fry for another minute, breaking up the tofu a little bit more with your spatula, then stir in the cilantro and remove from the heat.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To fill the wontons, lay out about 6 wonton skins on your work surface and place a level teaspoon of the tofu/spinach mixture in the center of each one. Brush the perimeter of the wonton skin with a very small amount of beaten egg or with the cornstarch mixture. Fold the wonton in half if using round skins, or diagonally corner to corner if they are square, and pinch the edges together all the way around to seal. Now put a little dab of egg or cornstarch mixture on the two opposite corners of the triangle or the two ends of the half-circle, fold the package in and pinch the tips together. Place on a parchment-covered baking sheet. Continue filling the wrappers until all of the spinach and tofu mixture is used up. If not cooking right away place the baking sheet in the freezer.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a simmer in a soup pot or a wide saucepan. Season to taste with salt or soy sauce. Add 6 to 8 wontons per serving and simmer 5 to 7 minutes, flipping them over once to ensure even cooking. Spoon wontons into soup bowls, ladle in broth and garnish with cilantro. Serve hot.\n"}]}