{"@context": "http://schema.org", "@type": "Recipe", "name": "Herb Crepes With Goat Cheese Filling", "description": "Crepes make delicious, easy finger foods. Cut them in half, top with a filling, then fold them in half and again in half, so they’re like little coronets. These thin pancakes are easy to make in today’s heavy nonstick crepe pans. Give the batter plenty of time to rest so that the flour swells and softens; that will make the crepes delicate.  ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/12/14/science/14recipehealth/14recipehealth-articleLarge-v3.jpg", "totalTime": "PT15M", "recipeYield": "Serves 10 as an hors d’oeuvre.", "recipeCuisine": "french", "recipeCategory": "brunch", "keywords": "eggs, fresh herbs, goat cheese, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 75}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 175, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "224 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 large eggs", "3/4 cup milk", "1/2 cup water", "3 tablespoons canola oil", "1/2 teaspoon salt", "2 ounces whole-wheat flour (1/2 cup less 1 tablespoon)", "2 ounces all-purpose flour (scant 1/2 cup less 1 tablespoon)", "2 to 3 tablespoons finely chopped tarragon, parsley, chervil or chives (or a combination)", "Butter for the pan", "3/4 cup low-fat cottage cheese", "6 ounces goat cheese", "3 tablespoons plain low-fat yogurt", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the milk, water, eggs, canola oil and salt in a blender. Cover the blender, and turn on at low speed. Add the flours, and increase the speed to high. Blend for one minute. Transfer to a bowl, cover and refrigerate for one to two hours. When ready to cook, stir in the herbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a seasoned or nonstick 6- to 8-inch crepe pan over medium heat. Brush with butter or oil. When the pan is hot, and just before it begins to smoke, remove from the heat and ladle in three to four tablespoons of batter (depending on the size of your pan). Tilt or swirl the pan to distribute the batter evenly, and return to the heat. Cook for about one minute until you can easily loosen the edges with a spatula. Turn and cook on the other side for 30 seconds. Turn onto a plate. Continue until all of the batter is used up. You’ll get about 12 crepes with an 8-inch pan, 16 with a 6-inch pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the cottage cheese and goat cheese in a food processor fitted with the steel blade, and blend until smooth. Add the yogurt and pepper, and blend together. Transfer to a bowl. Cover and refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut each crepe in half. Spread a scant tablespoon of the herbed goat cheese on the less cooked side of each crepe. Fold in half, then in half again. Arrange on a platter. To serve warm, heat for 30 seconds in a microwave or for 10 minutes in a low oven."}]}