{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Bacon-and-Egg Pie", "description": "Bacon-and-egg pie is a rustic specialty from New Zealand, here zipped up with a mixture of sriracha and cream. Made from whole eggs that hard-cook under a pastry crust lid, with fat chunks of bacon, it is closer in feeling to steak-and-kidney pie, that sturdy pub staple, than to quiche. It is terrific picnic fare.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2012/12/21/dining/video-clarkeggpie/video-clarkeggpie-mediumThreeByTwo440-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "brunch", "keywords": "canadian bacon, eggs, heavy cream, new zealand, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 214}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 494, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "1 gram", "proteinContent": "16 grams", "saturatedFatContent": "19 grams", "sodiumContent": "387 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 1/2 cups all-purpose flour", "3/4 teaspoon coarse kosher salt", "2 sticks (8 ounces) unsalted butter, chilled and cubed", "6 ounces Canadian bacon, diced", "2 scallions, white and greens parts, thinly sliced", "9 large eggs", "Kosher salt, as needed", "Cracked black pepper, as needed", "6 tablespoons heavy cream", "1 1/2 tablespoons Sriracha or other hot sauce", "1 1/2 tablespoons ketchup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor fitted with the blade attachment, pulse together flour and salt until combined. Add butter and pulse until pieces are the size of lima beans. Add ice water, 1 tablespoon at a time, just until dough comes together (anywhere from 4 to 8 tablespoons). There should still be flecks of butter left in the dough. Shape dough into two evenly sized discs and wrap with plastic wrap. Refrigerate at least one hour before baking. (Dough can be made up to 1 week ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll out one disc to a 12-inch circle. (Leave the other disc in the fridge.) Transfer rolled dough to a 9-inch pie plate; trim and crimp edges. Chill for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Prick bottom of pie with a fork. Line with foil or parchment paper and fill with pie weights or dried beans. Bake for 20 minutes. Remove foil or paper and pie weights or beans. Bake until pale golden and dry to the touch, about 5 to 7 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase oven temperature to 400 degrees. Evenly scatter half of the bacon and half of the scallions on bottom of pie. Carefully crack 8 eggs over mixture, distributing them evenly around pie with their yolks intact.  Season eggs generously with salt and pepper. Whisk together 5 tablespoons heavy cream with Sriracha and ketchup. Use a teaspoon to dollop it on top of the eggs and then sprinkle with remaining bacon and scallion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly flour the counter. Roll out remaining disc of pie dough until 1/8-inch thick (it should be thinner than the previous dough round). Trim into 10-inch circle. Carefully place on top of the pie, pressing the edges into the side of the pie, if possible. There should be no overhang and the dough should fit almost perfectly. Use a fork to whisk together yolk from remaining egg and 1 tablespoon heavy cream. Brush top of pie with egg wash and cut 4 shallow slits in the middle of the top crust (don’t go deep, you don’t want to puncture the eggs). Bake for 25 to 30 minutes, or until pastry is golden brown. Let cool for at least 20 minutes for serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Bacon-and-Egg Pie", "description": "Bacon-and-egg pie is a little like a quiche except you leave the eggs whole instead of blending into a custard. Melissa Clark shows how.", "thumbnailUrl": "https://static01.nyt.com/images/2012/12/21/dining/video-clarkeggpie/video-clarkeggpie-mediumThreeByTwo440-v2.jpg", "uploadDate": "2012-12-21T22:23:26.000Z", "duration": "PT2M54S"}}