{"@context": "http://schema.org", "@type": "Recipe", "name": "Sicilian Cauliflower and Black Olive Gratin", "description": "The affinity that cauliflower has with black olives is seen throughout the Mediterranean, from Tunisia to Sicily to Apulia to Greece. This simple gratin from Sicily is traditionally made with green cauliflower, but the result is equally delicious and almost as pretty with the easier-to-obtain white variety.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/01/08/science/11recipehealth/11recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "Serves 6", "recipeCuisine": "italian", "recipeCategory": "weekday", "keywords": "black olives, cauliflower, pecorino, gluten-free, halal, healthy, kosher, low cholesterol, low sugar, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 498}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 163, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "491 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 generous head green or white cauliflower (2 to 2 1/2 pounds)", "Salt", "1 small onion, finely chopped", "3 tablespoons extra virgin olive oil", "2 garlic cloves, minced", "16 imported oil-cured black olives, pitted and cut in half", "2 tablespoons minced fresh parsley", "Freshly ground pepper", "1/2 cup freshly grated Pecorino or Parmesan, or a combination"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Break up the cauliflower into small florets while you bring a large pot of water to a boil. Salt the water generously and drop in the cauliflower. Boil 5 minutes while you fill a bowl with ice and water. Transfer the cauliflower to the ice water, let sit for a couple of minutes, then drain and place on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Oil a 2-quart baking dish or gratin dish. Heat 1 tablespoon of the olive oil over medium heat in a large, heavy skillet and add the onion. Cook, stirring, until tender, about 3 minutes, and add a pinch of salt and the garlic. Cook, stirring, for about 30 seconds, until fragrant and translucent. Remove from the heat and stir in the olives."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cauliflower in the baking dish and add the onion and olive mixture, the remaining olive oil, the parsley and half the cheese. Season to taste with salt and pepper and stir together well. Spread out in the dish and sprinkle the remaining cheese on top. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake in the preheated oven for 25 to 30 minutes, until the cheese is nicely browned. Serve hot or warm."}]}