{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato and Kale Salad With Roquefort", "description": "This is a great salad to make with leftover roasted sweet potatoes but you can also roast them just to make the salad. The trick to succeeding with crispy kale is to make sure it is completely dry before you put it in the oven. If you are using bunched kale I recommend that you stem and wash it, spin it twice in a salad spinner, then set the leaves  in single layers on a few layers of paper towels and roll them up. You can then refrigerate for up to a day or two. Once the salad is assembled, the portion of kale that  you toss with the sweet potatoes will soften, and the kale that surrounds the sweet potatoes will remain crispy.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/11/27/science/29recipehealth/29recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 4 as a main dish", "recipeCuisine": "", "recipeCategory": "lunch, salads and dressings", "keywords": "curly kale, roquefort cheese, sweet potato, fall, gluten-free, healthy, high fiber, kosher, low cholesterol, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 280, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "7 grams", "proteinContent": "11 grams", "saturatedFatContent": "4 grams", "sodiumContent": "561 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["2 large or 3 medium sweet potatoes", "1 generous bunch curly kale (about 1 pound), stemmed, leaves washed and dried thoroughly (see above)", "2 tablespoons extra virgin olive oil", "Salt to taste", "1/4 cup broken pecans, lightly toasted", "1 small garlic clove, pureed", "2 ounces Roquefort or blue cheese, crumbled", "1 teaspoon chopped fresh thyme leaves", "1/2 cup buttermilk", "1 tablespoon sherry vinegar", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To roast the sweet potatoes, heat the oven to 425 degrees. Rinse the sweet potatoes and pierce in several places with the tip of a paring knife. Line a sheet pan with foil and place the sweet potatoes on the foil. Bake 40 to minutes to an hour, depending on the size of the sweet potatoes. They are done when they are soft and beginning to ooze. Remove from heat and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile make the dressing (or you can make it a day ahead). In a mini-processor or in a mortar and pestle blend together the garlic, cheese, thyme, buttermilk, and vinegar. Season to taste with salt and pepper. For best results, leave it to sit for at least an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crispy kale, heat the oven to 300 degrees. Line two baking sheets with parchment. Make sure that your kale leaves are dry and tear them into medium-size pieces and toss with the olive oil. Gently knead the leaves between your thumbs and fingers to make sure they are coated with oil. Place in an even layer on the baking sheets. Do this in batches if necessary. Place in the oven and roast for 16 to 22 minutes, until the leaves are crisp but not browned. If some of the leaves crisp before others, remove them to a bowl or sheet pan and return the remaining kale to the oven. Watch closely as once the kale browns it will taste bitter. Season to taste with kosher salt or fine sea salt. Allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the sweet potatoes, quarter lengthwise and slice. Place in a salad bowl and add the pecans and half the crispy kale."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the edge of a platter with the remaining crispy kale. Toss the sweet potato mixture with the dressing, place in the middle of the platter and serve at once."}], "link": "https://cooking.nytimes.com/recipes/1014353-sweet-potato-and-kale-salad-with-roquefort"}