{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry Bean and Kale Soup", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "cherry tomatoes, cranberry beans, kale, main course, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 34}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 155, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "8 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "620 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound fresh shelled cranberry beans from about 1 1/2 pounds in the pod, or 1/2 pound dried cranberry beans soaked overnight in cold water and drained", "1 medium tomato", "1 small onion, cut into 8 pieces", "2 sprigs fresh thyme", "1 bay leaf", "1 sprig fresh rosemary", "1 small carrot, peeled and halved lengthwise", "4 whole garlic cloves, peeled", "Salt", "1 pound kale, center stems removed and discarded", "1 pound cherry tomatoes", "2 tablespoons extra virgin olive oil", "1 large onion, finely chopped", "6 garlic cloves, thinly sliced", "Freshly ground black pepper", "Extra virgin olive oil, for drizzling", "1 1/2 teaspoons minced marjoram leaves for garnish", "1 1/2 teaspoons minced parsley leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the beans: Rinse beans under cold water. Place in a stockpot and cover with 2 1/2 quarts cold water. On a large piece of cheesecloth, place the whole tomato, onion pieces, thyme, bay leaf, rosemary, carrot and garlic and tie together to loosely contain contents. Add to pot and press to submerge. Bring to a boil, then simmer until beans are tender, about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the soup: While beans cook, fill another large pot with 4 quarts water, add 1 tablespoon salt and bring to a boil. Set aside a bowl of ice water. Add kale leaves to boiling water, blanch for 5 minutes, then use tongs or a slotted spoon to transfer to ice water; reserve cooking water. When leaves are completely chilled, drain well, squeezing out excess water. Chop finely into slender strips and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return kale cooking water to a boil. Set aside a bowl of ice water. Prick each cherry tomato with a fork, blanch in boiling water for 5 seconds, then drain and place in ice water until chilled. Peel tomatoes and set aside. Reserve cooking liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over medium heat, combine olive oil, onion, garlic and a pinch of salt. Sauté until onions are tender, about 5 minutes. Add cherry tomatoes and sauté until tomatoes soften and begin to break up, about 5 minutes. Using a potato masher, gently crush tomatoes without destroying their shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain cooked beans, reserving cooking liquid. Discard cheesecloth and its contents. Return half the beans to pot, and mash with a potato masher until they are fairly smooth. Add remaining beans, contents of skillet, 1 quart cooking liquid from beans, and 1 quart cooking liquid from kale. Return to high heat to bring to a boil, then reduce heat and simmer for 10 minutes. Skim surface, discarding froth. Season to taste with salt and pepper, and add more cooking liquids, up to 1 quart, as desired; broth should remain thin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, add chopped kale and cook only until heated through, 30 to 60 seconds. Place in heated soup bowls, and garnish each bowl with a drizzle of olive oil and a sprinkling of marjoram and parsley."}]}