{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Cherry Borscht", "description": "Because this looks so much like a beet borscht, I decided to call it a cherry borscht. Cherries are a terrific source of two phytochemicals, quercetin and ellagic acid, that may have antioxidant as well as anti-inflammatory properties. The anthocyanins that give the fruit its red color are thought to have anti-inflammatory properties as well. It’s worth noting that the Environmental Working Group found a great number of pesticide residues on conventionally grown cherries, so seek out cherries that are grown locally by small farmers.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/08/17/health/17recipehealth_600/17recipehealth_600-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves six to eight", "recipeCuisine": "", "recipeCategory": "dinner, weekday, soups and stews", "keywords": "appetizer, dark cherries, lemon, yogurt, healthy, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 136, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "0 grams", "sodiumContent": "69 milligrams", "sugarContent": "26 grams", "transFatContent": null}, "recipeIngredient": ["2 1/2 pounds cherries, such as bing cherries, stemmed", "3 cups water", "1 rose geranium sprig (optional)", "3 tablespoons sugar", "2 tablespoons finely chopped lemon zest", "1/2 teaspoon almond extract", "Pinch of salt", "1/4 cup freshly squeezed lemon juice", "1 1/3 cups plain low-fat yogurt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside 18 cherries. Pit the remaining cherries, holding them over a bowl to catch the juices. Place the pitted cherries in the bowl with the juices, and place the pits in a small saucepan. Add 1 cup of the water, the rose geranium sprig, the sugar and the lemon zest. Bring to a boil, reduce the heat, cover and simmer 5 minutes. Strain the liquid in the saucepan into the bowl with the pitted cherries. Discard the pits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cherries and liquid to a large saucepan and bring to a simmer. Simmer uncovered for 5 minutes. Remove from the heat and allow to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches and covering the blender top with a kitchen towel to avoid hot splashes, puree the soup, about 1 1/2 cups at a time. Strain through a medium strainer into a bowl, pushing the soup through with the back of a ladle or with a rubber spatula. Stir in the almond extract, a pinch of salt and the lemon juice. Chill the soup by placing the bowl in a larger bowl of ice water, or refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the soup has chilled, whisk in the yogurt. Taste and add more lemon juice if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve garnished with the cherries you set aside."}], "link": "https://cooking.nytimes.com/recipes/1014010-cold-cherry-borscht"}