{"@context": "http://schema.org", "@type": "Recipe", "name": "Farro Niçoise", "description": "There is one mistake many of us make, cooking grain salads: we play down everything but the grains. A pile of cold brown rice with a few chopped vegetables and some soy sauce or a mound of wheat berries with vinaigrette is about as one-dimensional as it gets. This niçoise salad turns that problem on its head, with tuna used in a powerful vinaigrette tossed with farro. Farro is interesting because it’s relatively fast-cooking for a whole grain, but any hearty grain could take its place: one of the many “brown” rices, spelt, kamut, wheat. Whichever you use, the results are nutty and sublime.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2013/07/24/dining/24FLEX1/24JPFLEX1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, salads and dressings", "keywords": "farro, tuna, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 167}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 558, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "12 grams", "proteinContent": "29 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1019 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup farro ", "Salt", "1 pound green beans, trimmed", "3 anchovy fillets", "1/3 cup olive oil, plus more if needed", "Zest of 1 lemon ", "Juice of 2 lemons, plus more if needed", "1 teaspoon Dijon mustard", "1 shallot, peeled and roughly chopped", "1 tablespoon capers", "1 6-ounce can good tuna in olive oil", "1/2 cup parsley leaves", "Ground black pepper", "3 ripe tomatoes, cut into wedges", "4 hard-cooked eggs, halved", "1/2 cup niçoise or other black olives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the farro and a large pinch salt in a medium saucepan with water to cover by about an inch. Bring to a boil, then adjust the heat so the mixture bubbles gently. Cook, stirring occasionally, until the farro is tender but still has bite, 20 to 30 minutes. Add water if necessary to keep the grains covered; if any liquid remains by the time the farro is tender, strain it out. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring another medium pan of water to a boil and salt it. Add the green beans and cook until bright green and crisp-tender, 2 minutes or so, then plunge them into a bowl of ice water or run under cold water to cool them. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the anchovies, olive oil, lemon zest and juice, mustard, shallot and capers in a food processor and purée. Chop the tuna and parsley by hand and mix them in. (Alternatively, add the parsley to the food processor and pulse to chop, then add the tuna and pulse, once or twice, to blend. Don’t purée the tuna but chop it well.) The mixture should be pourable; if it isn’t, add lemon juice, olive oil or water to thin a bit. Add pepper, then taste and adjust the seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the farro, warm, with about half the dressing. Taste and adjust the seasoning, and pile it on a platter. Arrange the green beans, tomatoes, eggs and olives around the farro, as artfully as you like. Drizzle the remaining dressing over them and serve. "}], "link": "https://cooking.nytimes.com/recipes/1014918-farro-nicoise"}