{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon Tacos With Greens and Tomatillo Salsa", "description": "You can also use arctic char in this tangy, healthy filling for tacos, which tastes good hot or cold. The fish can be cooked up to three days ahead, if you'd like, and flake it. The spinach can also be steamed ahead of time and then kept in the refrigerator for up to three days. Then just toss everything together with the tomatillo salsa when you're ready to eat.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/07/30/science/01recipehealth/01recipehealth-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "8 to 10 tacos", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch", "keywords": "arctic char, salmon, salsa, dairy-free, gluten-free, halal, healthy, kosher, low sugar, nut-free, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 80}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 191, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "2 grams", "sodiumContent": "344 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 pound salmon or arctic char fillets", "Salt and freshly ground pepper", "1 bunch spinach or chard (about ¾ pound), stemmed and washed well in 2 changes of water", "1 tablespoon extra virgin olive oil", "1 to 2 garlic cloves (to taste), minced", "1 to 3 serrano or jalapeño chiles (to taste), minced", "1 cup cooked tomatillo salsa <a href=\"http://cooking.nytimes.com/recipes/1014927-cooked-tomatillo-salsa\">(see recipe)</a>", "2 to 3 ounces crumbled queso fresco or feta (optional)", "Shredded cabbage (optional)", "8 to 10 corn tortillas", "Chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Cover a baking sheet with foil and lightly oil the foil. Place the salmon or arctic char on top. Season with salt and gently rub the salt into the surface of the salmon. Add pepper to taste. Fill a roasting pan or cake pan halfway with boiling water and place it on the oven floor. Place the fish in the oven and bake 10 to 20 minutes (depending on the thickness), until white beads of protein appear on the surface and the fish can be pulled apart with a fork. Remove from the heat and allow to cool until you can handle it. If desired, scrape away the white protein beads, then flake the fish and place in a bowl. Discard the skin. Season the fish well with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the spinach or chard just until wilted, about 1 minute for spinach, 2 minutes for chard, or blanch in boiling salted water (20 seconds for spinach, about 1 minute for chard). Transfer to a bowl of cold water, then drain and, taking the greens up by the handful, squeeze out excess water. Chop medium-fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a heavy, medium size skillet and add the garlic and chile. Stir until fragrant, 30 seconds to a minute, and add the greens and salt and pepper to taste. Stir and toss in the pan for about a minute, until nicely infused with the oil, garlic and chile. Remove from the heat and add to the fish. Stir in 1/2 cup of the salsa. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the tortillas: wrap in a kitchen towel and place in a steamer basket over 1 inch of boiling water. Bring to a boil, cover the pot and steam 1 minute. Turn off the heat and allow to sit for 10 to 15 minutes without uncovering. Top the hot tortillas with the fish. Spoon on a little more salsa and if desired, garnish with crumbled cheese and shredded cabbage. Fold the tortillas over and serve."}], "link": "https://cooking.nytimes.com/recipes/1014930-salmon-tacos-with-greens-and-tomatillo-salsa"}