{"@context": "http://schema.org", "@type": "Recipe", "name": "Saffron Risotto With Spring Onion, Saffron and Green Garlic", "description": "This is inspired by — but much lighter than — risotto Milanese, the mother of all risottos. If you’ve never made a risotto, start with this utterly simple classic. Green garlic resembles spring onions or leeks. The young bulbs have not yet set cloves. The flavor isn’t at all sharp, but more like the flavor of leeks. Prepare as you would leeks.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/04/20/health/20recipehealth_600/20recipehealth_600-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves four to six", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "arborio rice, chicken stock, saffron, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 403, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "2 grams", "proteinContent": "15 grams", "saturatedFatContent": "3 grams", "sodiumContent": "906 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["About 7 cups chicken stock or vegetable stock", "2 tablespoons extra virgin olive oil", "1/2 cup finely chopped spring onion or leek", "2/3 cup finely chopped green garlic (about 2 bulbs)", "Salt, preferably kosher salt, to taste", "1 1/2 cups arborio or carnaroli rice", "Generous pinch of saffron threads", "1/2 cup dry white wine, such as pinot grigio or sauvignon blanc", "Freshly ground pepper", "1/2 cup freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the stock or broth into a saucepan, and bring it to a simmer over low heat with a ladle nearby. Make sure that the broth is well seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy nonstick skillet or saucepan. Add the spring onion, green garlic and 1/2 teaspoon salt, and cook gently until it is just tender, about three minutes. Do not brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice, and stir just until the grains separate and begin to crackle. Rub the saffron between your thumb and fingers, and stir into the rice. Add the wine, stirring until it has been absorbed. Begin adding the simmering stock, a couple of ladlefuls (about 1/2 cup) at a time. The stock should just cover the rice and should be bubbling, not too slowly nor too quickly. Cook, stirring often, until the stock is just about absorbed. Add another ladleful or two of the stock. Continue to cook in this fashion, adding more stock when the rice is almost dry and stirring. When the rice is just tender all the way through but still chewy, in 20 to 25 minutes, it is done. Taste, and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another ladleful of stock to the rice. Stir in the Parmesan, and remove from the heat. The mixture should be creamy. Serve right away in wide soup bowls or on plates, spreading the risotto in a thin layer rather than lumping into a mound."}]}