{"@context": "http://schema.org", "@type": "Recipe", "name": "Farfalle With Artichokes, Peas, Favas and Onions", "description": "The vegetable ragout that accompanies the farfalle here is inspired by a more labor-intensive, longer-cooking Sicilian spring stew called fritteda. The Sicilian version would also include fennel, and a lot more olive oil.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/04/24/science/24recipehealth/24recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas", "keywords": "artichoke, farfalle, peas, dairy-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 115}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 488, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "91 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "23 grams", "proteinContent": "26 grams", "saturatedFatContent": "1 gram", "sodiumContent": "954 milligrams", "sugarContent": "20 grams", "transFatContent": null}, "recipeIngredient": ["Juice of 1 lemon", "4 medium or 2 large artichokes, or 8 baby artichokes", "2 tablespoons extra virgin olive oil", "1/2 pound spring onions or scallions, white and light green parts only, finely chopped", "Salt and freshly ground black pepper to taste", "2 pounds fava beans, shelled and skinned", "2 cups shelled peas (about 2 1/2 pounds fresh peas in the pod)", "2 teaspoons chopped mint", "3/4 pound farfalle", "Freshly grated Parmesan or Pecorino (or a combination) for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a bowl with water and add the lemon juice. Cut away the stem and the top third of each artichoke, break off the leaves and trim them down to the bottoms, placing them in the water as you go along. Quarter them and slice large quarters about 1/4 inch thick. Save the leaves and steam them; serve them as a first course or a side dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the artichoke hearts and dry on a clean dish towel. Heat the oil over medium-high heat in a large, heavy lidded skillet or Dutch oven. Add the sliced artichoke hearts and cook, stirring, until lightly browned, about 5 minutes. Turn the heat down to medium, add the onions (or scallions) and cook, stirring, until the onions are tender, 3 to 5 minutes. Add the peas and favas, 2/3 cup water and salt to taste and bring to a boil. Reduce the heat to low, cover and simmer for 20 minutes, until all of the vegetables are tender. Taste, adjust salt and add pepper to taste. Stir in the mint and remove from the heat, but keep warm while you cook the pasta. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil, add salt to taste and the pasta. Cook al dente, usually 10 to 11 minutes for farfalle. Add a ladleful of the cooking water from the pasta to the vegetable mixture and drain the pasta. Toss with the vegetables and serve, with Parmesan or Pecorino, or both."}], "link": "https://cooking.nytimes.com/recipes/1014689-farfalle-with-artichokes-peas-favas-and-onions"}