{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Tofu With Red Chard", "description": "Most of the time that you devote to a stir-fry goes into chopping and measuring out ingredients. Sometimes the list looks long to me, and I fear the dish is going to take forever to make. But while I may spend 30 minutes prepping everything, I’ll spend only five minutes at the stove. For things to go well, it’s important that the mise en place be organized. If liquids are to be added to a dish at the same time, combine them in one bowl or measuring cup. If the garlic and ginger are to be added together, have them minced and combined in a small container. Clean your work area before you start cooking, and have everything close to the stove. Once you begin to stir-fry, you won’t be able to do anything except grab the next ingredient. Read the recipe carefully from beginning to end, have the table set, your rice or noodles cooked and plates ready. I love the pink color that tofu takes on when cooked with red chard. Beet greens would also do the trick. In this recipe, blanching the greens is part of the prep.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/09/14/health/14recipehealth_600/14recipehealth_600-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick", "keywords": "firm tofu, red chard, healthy, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 62}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 233, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "4 grams", "proteinContent": "17 grams", "saturatedFatContent": "2 grams", "sodiumContent": "754 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons soy sauce", "1 teaspoon sugar", "1 tablespoon plus 1 teaspoon chopped or grated fresh ginger", "3/4 pound firm tofu, sliced 1/2 inch thick, into 1- by 2-inch dominoes", "1 large bunch or 2 smaller bunches red chard about 1 1/2 pounds, stemmed and thoroughly cleaned retain the stems", "Salt to taste", "1 teaspoon dark sesame oil", "2 tablespoons canola or peanut oil", "2 large garlic cloves, minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the soy sauce, 1 teaspoon of the ginger and the sugar. Toss with the tofu in a bowl, and set aside. Marinate for 15 minutes or longer. Refrigerate if not using right away. Meanwhile, fill a large pot with water and bring to a boil. Fill a bowl with ice water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water comes to a boil, salt generously and add the red chard leaves. Cook the chard 1 to 2 minutes, until just tender, and transfer with a slotted spoon or deep-fry skimmer to the ice water. Drain and squeeze out the water (you don’t have to squeeze it completely dry). Chop coarsely and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the ends of the chard stalks, clean them well and slice crosswise, about 1/4 inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy nonstick skillet or wok over high heat until hot enough to evaporate a drop of water on contact. Add 1 tablespoon of the oil, swirl to coat the pan and reduce the heat to medium-high. Lift the tofu from the marinade, and add to the pan. Stir-fry for two to three minutes, until lightly colored. Add the chard stalks, and stir-fry for 1 minute. Add the remaining tablespoon of oil and the garlic and remaining ginger, and stir together for about 30 seconds until fragrant. Stir in the blanched red chard, and stir-fry with the tofu for one minute. Add the tofu marinade and cook, stirring, for another minute or two, until heated through and fragrant. Remove from the heat and serve, with rice or noodles."}], "link": "https://cooking.nytimes.com/recipes/1014015-stir-fried-tofu-with-red-chard"}