{"@context": "http://schema.org", "@type": "Recipe", "name": "Lentil, Celery and Tomato Minestrone", "description": "Minestrone might be a familiar soup, but here it takes on a new flavor: celery. The celery, which may be lingering in the fridge having played a minor part in another recipe, adds a dimension of flavor to the mix that ordinary minestrone just doesn’t have. Celery has long been used in Chinese medicine to help control high blood pressure. It is also an excellent source of Vitamins K and C, and a very good source of potassium, folate, dietary fiber, molybdenum, manganese, and Vitamin B6.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/01/22/science/21recipehealth/21recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, soups and stews", "keywords": "gluten-free, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 90}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 176, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "7 grams", "proteinContent": "10 grams", "saturatedFatContent": "0 grams", "sodiumContent": "1077 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 cup lentils, rinsed", "1 onion, halved", "A bouquet garni made with 2 sprigs each thyme and parsley, a bay leaf, and a Parmesan rind", "1 1/2 quarts water", "1 tablespoon extra virgin olive oil", "1 medium carrot, diced", "3 celery stalks, diced", "2 garlic cloves, minced", "Salt, preferably kosher salt, to taste", "1 28-ounce can chopped tomatoes, with liquid", "Pinch of sugar", "2 tablespoons tomato paste", "1/4 cup chopped fresh parsley", "Very thinly sliced celery, from the inner heart, for garnish", "Freshly grated Parmesan cheese for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the lentils, 1/2 onion and the bouquet garni with 1 quart water in a saucepan and bring to a boil. Reduce the heat, add salt to taste, cover and simmer 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the remaining onion. Heat the olive oil in a large, heavy soup pot or Dutch oven over medium heat and add the onion, carrot, and celery. Cook, stirring often, until the onion is tender, about 5 minutes, and add the garlic and a pinch of salt. Stir together until fragrant, about 1 minute, and add the canned tomatoes with their liquid and the sugar. Bring to a simmer and cook, stirring often, for about 10 minutes, until the tomatoes have cooked down somewhat and smell fragrant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the lentils with their broth, the tomato paste, salt to taste, an additional 2 cups water, and bring to a boil. Reduce the heat, cover, and simmer 30 minutes. Taste and adjust seasonings. Season to taste with freshly ground pepper, stir in the parsley and serve, garnishing each bowl with thinly sliced celery heart if you want some crunch, and passing the Parmesan at the table."}], "link": "https://cooking.nytimes.com/recipes/1014497-lentil-celery-and-tomato-minestrone"}