{"@context": "http://schema.org", "@type": "Recipe", "name": "Provençal Tomato and Basil Soup", "description": "I learned to make this soup years ago when I lived in France. If there are no fresh tomatoes at hand, use canned. The soup is delicious and silky if you thicken it with tapioca.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/10/13/science/15recipehealth/15recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves four", "recipeCuisine": "french", "recipeCategory": "weekday", "keywords": "appetizer, basil, onion, tomato, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 465}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 small onion, chopped", "4 to 6 garlic cloves (to taste), minced", "Salt to taste", "2 pounds tomatoes, cored and diced, or 1 28-ounce can chopped tomatoes with juice", "Pinch of sugar", "2 large sprigs basil, or about 16 leaves, plus 2 tablespoons slivered basil for garnish", "1 quart water", "1 Parmesan rind (optional)", "Freshly ground pepper to taste", "1/4 cup rice or tapioca", "Garlic croutons (thin slices of baguette, lightly toasted and rubbed with a cut garlic clove)", "Grated or shaved Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, heavy soup pot or Dutch oven. Add the onion. Cook, stirring often, until tender, about five minutes. Stir in half the garlic and a generous pinch of salt. Cook, stirring, until fragrant, about 30 seconds to a minute. Add the tomatoes, sugar, basil sprigs or leaves and remaining garlic. Cook, stirring often, until the tomatoes have cooked down and smell fragrant, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the water, Parmesan rind and salt to taste. Bring to a simmer, cover and reduce the heat to low. Simmer 15 minutes. Add the tapioca or rice, and simmer for another 15 minutes until the tapioca is tender and the soup fragrant. Remove the basil sprigs and Parmesan rind. Puree in a blender in small batches, taking care to place a towel over the top of the blender and hold it down tightly. If you used fresh unpeeled tomatoes and want a silkier soup, put through a strainer, using a spatula or the back of a ladle to push the soup through. Return to the pot, add pepper to taste and adjust salt. Serve garnished with garlic croutons and/or Parmesan, if desired, and slivered basil leaves. If serving cold, refrigerate until chilled."}]}