{"@context": "http://schema.org", "@type": "Recipe", "name": "Almond Grape Gazpacho", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 to 6 servings (about 6 cups)", "recipeCuisine": "spanish", "recipeCategory": "dinner, quick, weekday, soups and stews", "keywords": "almonds, garlic, grape, appetizer, summer, vegan, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 915, "unsaturatedFatContent": "73 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "86 grams", "fiberContent": "7 grams", "proteinContent": "14 grams", "saturatedFatContent": "10 grams", "sodiumContent": "465 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 large garlic cloves", "2 cups diced stale bread, crusts removed", "2 cups peeled, fried and salted Marcona almonds, or whole blanched almonds", "1 cup white seedless grapes, halved", "1 cup red seedless grapes, halved", "Salt", "1 1/2 cups extra virgin olive oil", "1 1/2 to 2 tablespoons sherry vinegar", "Extra virgin olive oil, as needed", "1/4 cup diced bread", "Salt", "1/2 cup mixed red and white seedless grapes, cut into small dice", "1/4 cup peeled, fried and salted Marcona almonds, or whole blanched almonds", "1 scallion, thinly sliced diagonally", "Almond oil or extra virgin olive oil, for drizzling", "Sherry vinegar, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the gazpacho: Place garlic cloves in a small pan of cold water over high heat. When water comes to a boil, strain garlic and chill until needed. Cover stale bread cubes with water and allow to sit until soft, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze all the water from bread and put into a blender with almonds, grapes and garlic cloves. Season with a bit of salt and purée until mixture is very smooth, almost like mashed potatoes; if necessary drizzle in a bit of water to help mixture to purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1 cup ice-cold water in a measuring cup. Place olive oil in another cup. With blender running, slowly drizzle in both liquids, simultaneously, through opening of blender. Gazpacho will turn very smooth and silky. Add 1 1/2 tablespoons vinegar or more, if desired. Adjust salt to taste. To thin soup, if desired, add 1 to 3 tablespoons cold water, one tablespoon at a time. Transfer to a covered container and refrigerate until very cold, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For garnish and serving: Preheat oven to 400 degrees. Drizzle oil over diced bread and sprinkle with salt. Spread on a baking sheet and bake until browned, 5 to 8 minutes. Transfer to a small bowl, and add grapes, almonds and scallion. Add a drizzle of oil and a small sprinkling of vinegar and salt. To serve, ladle gazpacho into four chilled soup plates. Add garnish, and drizzle with more oil."}], "link": "https://cooking.nytimes.com/recipes/1014012-almond-grape-gazpacho"}