{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole-Grain Pasta With Mushrooms, Asparagus and Favas", "description": "Pasta companies have made great strides when it comes to whole-grain pasta. On the small scale, Community Grains in Northern California is producing some excellent pasta with its amazing whole-wheat flour, and on the larger commercial scale, companies like Barilla are selling better and better products. I used Barilla penne for this springtime mix.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/04/24/science/26recipehealth/26recipehealth-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "asparagus, fava beans, wild mushrooms, dairy-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 54}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 438, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "80 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "17 grams", "proteinContent": "23 grams", "saturatedFatContent": "1 gram", "sodiumContent": "811 milligrams", "sugarContent": "18 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds fava beans, shelled", "1 pound asparagus", "2 tablespoons extra virgin olive oil", "1 shallot, minced", "1/2 pound wild mushrooms, quartered or sliced, or creminis, quartered if small, sliced if large", "2 garlic cloves or 1 small bulb green garlic, minced", "Salt to taste", "4 large basil leaves, torn into small pieces or cut in slivers", "3/4 pound whole-wheat pasta, such as penne or fusilli", "Freshly grated Parmesan for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large pot of water while you shell the favas. Fill a bowl with cold water. When the water comes to a boil, salt generously and add the asparagus. Blanch thin stalks for 3 minutes, thicker ones for 4 to 5. Transfer to the cold water, drain and cut into 1-inch pieces. Set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water back to a boil and add the favas. Boil 3 to 5 minutes, depending on the size of the beans. Drain and transfer immediately to the cold water. Allow the beans to cool for several minutes, then slip off their skins by pinching off the eye of the skin and squeezing gently. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a large, heavy skillet and add the shallot. Cook, stirring, until translucent, 2 to 3 minutes, and add the mushrooms. Cook, stirring often, until the mushrooms have begun to soften and sweat, about 3 minutes, and add the garlic. Cook, stirring, until fragrant, 30 seconds to a minute, and add salt and pepper to taste. Continue to cook, stirring, until the mushrooms are tender, fragrant and juicy, another 2 to 3 minutes. Stir in the asparagus and favas and remove from the heat but keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water in the pot back to a boil and add the pasta. Cook al dente, using the timing instructions on the package as a guide but checking the pasta a minute before the time indicated is up. When the pasta is ready, use a ladle to transfer 1/2 cup of the pasta cooking water to the pan with the vegetables and another 1/2 cup to a bowl, in case you want more to moisten the mixture. Drain the pasta and toss at once with the vegetables and basil. Add more of the cooking water if desired. Serve hot, passing the Parmesan at the table."}], "link": "https://cooking.nytimes.com/recipes/1014691-whole-grain-pasta-with-mushrooms-asparagus-and-favas"}