{"@context": "http://schema.org", "@type": "Recipe", "name": "Paella of the Land", "description": "This recipe, which was adapted from one Valerie Gurdal cooked in the 2013 running of the Westport Paella Contest in Westport, Massachusetts, and brought to The Times by John Willoughby, is classical in its use of rabbit, chorizo, Spanish ham and Calasparra rice. But its depths of flavors are increased exponentially by grilling the meats before adding them to the paella pan. Cooked over an open fire, the dish may be scary to contemplate, but it is not at all difficult to pull off.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2013/07/17/dining/17GRILLING_SPAN/17GRILLING-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "about 12 servings", "recipeCuisine": "spanish", "recipeCategory": "dinner", "keywords": "chicken, chorizo, rabbit, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 160}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1004, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "78 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "1 gram", "proteinContent": "65 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1496 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 bone-in, skin-on chicken thighs", "1 medium-size rabbit, quartered", "Salt and pepper to taste", "4 links fresh chorizo or good-quality dried chorizo, like Palacios", "8 cups chicken broth", "3/4 bottle (about 2 3/4 cups) dry white wine", "2 teaspoons saffron threads, preferably Iranian", "1/4 cup olive oil", "1 medium onion, chopped", "4 cloves garlic, chopped", "1/4 pound jamón serrano, roughly chopped", "1 1-kilogram bag short-grained Spanish rice, preferably bomba or Calasparra", "4 medium-size ripe tomatoes, grated, skin discarded", "1 cup green peas (optional)", "Piquillo pimento, sliced into strips for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Build a medium-hot fire in your grill (when ready, you can hold your hand about 6 inches above the grill for only 2 or 3 seconds)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the chicken thighs and rabbit liberally with salt and pepper. Put the thighs, then the rabbit, then the chorizo (if using fresh) on the grill and sear well without cooking through, about 3 to 4 minutes per side for each. (If using dried chorizo, simply slice into chunks and add in step 5.) As each is seared, remove from the grill and set aside. As soon as the chorizo is cool enough, slice it diagonally into bite-size chunks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine the chicken broth, wine and saffron in a medium saucepan, bring just to a simmer, then set on the side of the grill to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large paella pan on the grill, add the olive oil and heat until hot but not smoking. Add the onion and cook, stirring frequently, until translucent, about 3 minutes, adjusting the pan on the heat as needed to prevent burning. Add the garlic and cook, stirring, for 1 minute, then add the jamón and cook, stirring, until it is just heated through, about 3 or 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice and stir until well coated, then add the tomatoes and smooth out the rice to an even thickness. Slowly and without stirring, add enough of the broth mixture to leave just a thin layer of broth above the rice, then tuck the chicken, rabbit and chorizo pieces into the rice. Simmer slowly, moving the pan around on the fire as needed to keep the simmer going; avoid boiling. Gently add small amounts of liquid as needed so it’s not totally dry. When the rice is creamy and just al dente and the chicken, rabbit and chorizo are cooked through (should take 20 to 35 minutes), remove pan from heat and stir in the peas, if using. If using pimento strips, place on top."}]}