{"@context": "http://schema.org", "@type": "Recipe", "name": "Large White Bean, Tuna and Spinach Salad", "description": "You could use canned cannellini beans for this, but I love the size and texture of large white limas. I don’t soak limas because the skins tend to detach and the beans fall apart when you cook them. You want them intact for this, but you also need to make sure to cook them all the way through.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/03/19/science/22recipehealth/22recipehealth-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, salads and dressings", "keywords": "canned tuna, lima beans, spinach, dairy-free, gluten-free, healthy, high fiber, kosher, low cholesterol, low sugar, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 127}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 204, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "2 grams", "sodiumContent": "734 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup large white lima beans", "1 quart water", "1 onion, cut in half", "2 garlic cloves, crushed, plus 1 small garlic clove, minced or puréed", "1 bay leaf", "2 fresh sage leaves", "Salt to taste", "1 5-ounce can water-packed light tuna, drained", "1 bunch spinach, stemmed, leaves washed and dried, or 1 6-ounce bag baby spinach", "1 tablespoon sherry vinegar", "1 tablespoon fresh lemon juice", "1/2 teaspoon Dijon mustard", "6 tablespoons extra virgin olive oil", "2 tablespoons finely chopped flat-leaf parsley and mint", "1 tablespoon chopped chives", "Sliced red onion and black olives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the beans and combine with the water in a soup pot. Add the halved onion, the crushed garlic cloves, the bay leaf and the sage leaves. Bring to a gentle boil, add salt to taste, cover and boil very gently for 1 to 1 1/2 hours, or until the beans are tender (sometimes they take longer, about 2 hours; it depends in part on the age of the beans). Remove from the heat. Set a colander over a bowl and drain the beans. Discard the bay leaf, onion, garlic cloves and sage. Some of the beans will have slipped out of their skins and fallen apart, but most should be intact. The broth can be used for a soup or pasta sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the spinach and the dressing. Whisk together the vinegar, lemon juice, minced or puréed garlic, mustard, salt to taste and the olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, gently toss together the beans and the tuna. Don’t worry if some of the lima beans fall apart. Add the mint, half the chives and half the dressing and toss again. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the spinach with the remaining dressing. Line a platter or wide bowl with the spinach, top with the tuna, and sprinkle the remaining chives over the top. Garnish with red onions and black olives if desired, and serve."}]}