{"@context": "http://schema.org", "@type": "Recipe", "name": "Raisin Rye Bread", "description": "", "author": {"@type": "Person", "name": "Jill Santopietro"}, "image": null, "totalTime": "PT15H", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "project", "keywords": "appetizer, fennel seeds, raisins, whole wheat flour, vegan, vegetarian", "aggregateRating": null, "recipeIngredient": ["Zest and juice of 1 orange", "1 3/4 cups raisins", "2 teaspoons fennel seed", "8 ounces ripe mother starter (recipe above)", "3 1/2 cups warm water (95 degrees)", "All of the soaker (recipe above)", "1 3/4 pounds (28 ounces, about 5 cups) whole-wheat bread flour", "8 ounces (about 2 cups) whole rye flour", "1 tablespoon plus 2 1/4 teaspoons unrefined sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the soaker", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Several hours or the day before baking the bread, prepare the soaker and dough. For the soaker, combine the orange zest and juice, raisins, fennel seeds and 1/4 cup of water in a bowl. Cover and let sit for at least 1 hour before making the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To mix the dough by hand, break up the starter in the warm water, then stir in the raisin soaker. (For a moister loaf, you can add 1/2 to 3/4 cup more water, but note that this makes for an incredibly sticky dough, best handled by those using a mixer or who are used to working with dough.) Add the flours and mix just until all the flour has been incorporated. Let the dough rest for 20 minutes, then, on a lightly floured surface, knead in the salt for 2 minutes. Let rest again for 10 minutes, then knead for 2 minutes more. This process may be repeated several times. Longer mixing will give a more uniform crumb structure; less mixing a more irregular crumb with larger holes. The dough will be sticky and rough at this point, but will smooth out as it rests. If the dough is too wet, use a dough scraper to help knead it, or simply knead it in the bowl. (If using a mixer, the dough may be mixed on low speed and allowed to rest for the same amount of time as above until it can be stretched out into a fine sheet.) After kneading, let the dough rest at room temperature for approximately 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Give the dough a quick fold, cover and place in a refrigerator or cool pantry for several hours, or overnight."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the bread", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, set the dough out at room temperature, give it another fold, and allow it to warm up for about 2 hours. This schedule may be adjusted to meet your needs. A long, cool fermentation will lead to more complex flavors, moister bread and longer shelf life, but the dough may be simply left out at room temperature for 4 to 5 hours and then shaped. Divide dough into 3 equal pieces, and shape into rounds or batards. Place in baskets or pans and let rise at room temperature for 1 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a baking stone, about 45 minute before baking, preheat the oven to 500 degrees. Otherwise, set the oven to 500 degrees about 20 minutes before baking and preheat a baking sheet covered with parchment paper. Place a small sheet pan or lasagna pan under the stone or oven rack to act as a steam pan. Spraying water into the oven for steam is not recommended, as it can cause exposed light bulbs to explode."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before baking, score the dough by using a blade or sharp knife to cut ½-inch deep lines into it. (A pound sign or cross are two suggested scoring patterns.) Transfer the dough to either the warmed baking sheet or stone in the oven. Pour 1 cup of hot water into the steam pan. Bake for 10 minutes, opening the door briefly to release steam. Rotate the bread and continue baking for 15 to 20 minutes, or longer, depending on the size of the loaf. When fully baked, the loaf should sound hollow when thumped on the bottom, and the exposed raisins will begin to caramelize. Cool on a wire rack for at least 1 hour before slicing or serving."}]}]}