{"@context": "http://schema.org", "@type": "Recipe", "name": "Cacio e Pepe with Peas and Favas", "description": "Peeling fava beans is a fiddly task that includes removing the beans from their pods, blanching them and then peeling off the skins. But for a light dish of pasta, peas, cracked black pepper and cheese, it’s well worth the effort. Favas can be found in farmers markets in the spring and summer. This dish is one of their highest uses.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/07/03/dining/cacio-still/cacio-still-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "2 to 4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, lunch, pastas", "keywords": "fava beans, peas, spaghetti, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 180}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 493, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "70 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "13 grams", "proteinContent": "28 grams", "saturatedFatContent": "8 grams", "sodiumContent": "576 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound English pea pods, shucked (about 2/3 cup peas)", "1 1/4 pounds fava bean pods, shucked (about 1/2 cup peeled favas)", "1/2 pound spaghetti", "2 tablespoons unsalted butter", "1/2 tablespoon very coarsely ground black pepper", "1/3 cup shredded pecorino Romano, more for serving", "1/2 cup grated Parmesan", "Coarse kosher sea salt, to taste", "Extra virgin olive oil, for serving", "Freshly snipped chives, preferably with blossoms, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium saucepot of salted water to a boil. Fill a medium bowl with water and ice and set a fine mesh strainer in the bowl. (Be sure to keep ice out of strainer.) Blanch peas for 30 seconds and use a slotted spoon to transfer peas to strainer in ice bath. Let sit for 5 minutes and pull up strainer to drain peas. Repeat process with fava beans, cooking for 1 minute. (You can use same pot of boiling water that you used for peas.) When fava beans have been blanched and cooled, slip off peels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of heavily salted water to a boil. Add pasta and cook until 1 minute shy of al dente. Drain, reserving 1/2 cup cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, melt 1 tablespoon butter. Add pepper and sauté for 1 minute, or until fragrant. Add 1/4 cup of the cooking water and the remaining butter to pan. Stir until butter is melted and sauce begins to thicken, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cooked pasta, pecorino and Parmesan and toss until cheese melts, about 30 seconds. Add peas and fava beans. Toss very well to coat, adding more pasta water if pan seems dry. Season with salt to taste. To serve, sprinkle each portion with more pecorino and drizzle with olive oil. Garnish with chives."}], "link": "https://cooking.nytimes.com/recipes/1014828-cacio-e-pepe-with-peas-and-favas"}