{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange Sorbet With Blood Orange Salad", "description": "This refreshing dessert - the only one this week that doesn’t involve cooking fruit -- is like a pick-me-up after a rich dinner. Oranges are not only a great source of vitamin C; they’re packed with other phytochemicals called limonoids that are being studied for their anti-inflammatory, immune-boosting and cholesterol-lowering properties. If you can find blood oranges, you’ll get the added benefits of the anthocyanins in the red pigment.  ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/11/25/health/27recipehealth_600/27recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "Serves six", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "dessert, fall, grand marnier, lemon, orange, healthy, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 188, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "3 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "3 milligrams", "sugarContent": "39 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup sugar", "1/2 cup water", "2 tablespoons freshly squeezed lemon juice", "3 cups strained fresh squeezed orange juice", "1 teaspoon Cointreau or Grand Marnier (optional)", "6 blood oranges, if available, or substitute tangerines or navel oranges", "1 tablespoon Grand Marnier (more to taste)", "1 tablespoon slivered fresh mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the sugar and water in a saucepan, and bring to a boil. Boil until the sugar melts, and remove from the heat. Allow to cool while you squeeze the oranges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a 1-quart container in the freezer. Combine the strained orange juice, the syrup, lemon juice and Cointreau or Grand Marnier in a bowl. Transfer to an ice cream maker, and freeze according to the manufacturer’s instructions. Once the sorbet reaches the desired consistency, transfer to the chilled container and freeze for at least two hours. Allow to soften for 15 minutes in the refrigerator before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a small paring knife, peel away the skin and white pith from the blood oranges or navels (break tangerines into sections). Cut the sections away from the membranes, holding the oranges above a bowl so that you catch all of the juice, then squeeze the shell of membranes above the bowl to catch any remaining juice. Toss with the Grand Marnier and mint. Place one or two scoops of the sorbet in serving bowls, garnish with the blood oranges and their juice, and serve."}], "link": "https://cooking.nytimes.com/recipes/1014038-orange-sorbet-with-blood-orange-salad"}