{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Duck with Sugar Snaps", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2013/04/10/dining/10PAIR/10PAIR-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "duck, ginger, sugar snap peas, main course, spring", "aggregateRating": null, "recipeIngredient": ["1 1/2 inch piece fresh ginger, peeled and chopped", "4 cloves garlic", "1 large jalapeño, seeded and chopped", "2 tablespoons cilantro leaves", "1 medium-large onion, chopped", "1 duck cut into 10 pieces, backbone and excess fat removed", "Salt and ground black pepper", "1 teaspoon ground cumin", "1 cup duck or chicken stock", "Juice of 1/2 lime", "8 ounces sugar snap peas", "1 cup jasmine rice, simmered, covered, in 13/4 cups water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on food processor and drop in ginger, garlic, jalape&ntilde;o and cilantro. When minced, add onion and pulse until finely chopped. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Pat duck pieces dry and season with salt and pepper. Brown duck in batches,  skin side down first. Pour off and reserve all but a thin film of fat. Add onion mixture and saut&eacute; on low until soft. Stir in cumin. Add stock and deglaze pan. Return duck to pan, baste, bring to a simmer, cover and place in oven 11/2 hours, until duck is very tender. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove casserole from oven and transfer duck to a platter, draining well. Use a large spoon to skim off as much fat as possible from pan juices, probably close to one cup. Reserve fat for other cooking. Add lime juice and season pan juices to taste. Return duck to casserole, baste and heat gently. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon reserved duck fat in a skillet, add sugar snaps and stir-fry a couple of minutes, until they turn bright green. Transfer duck to a rimmed serving dish. Add sugar snaps to casserole, heat briefly and spoon with sauce over duck. Serve with rice. "}]}