{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Ziti or Penne Rigate With Cauliflower", "description": "You can add vegetables to just about any baked macaroni dish. Cauliflower works very well in this one, inspired by another Sicilian cauliflower dish in Clifford A. Wright’s “Cucinia Paradiso.”", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/01/08/science/08recipehealth/08recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "canned tomatoes, cauliflower, ziti, halal, healthy, kosher, low cholesterol, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 356}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 326, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "5 grams", "proteinContent": "13 grams", "saturatedFatContent": "3 grams", "sodiumContent": "685 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 medium cauliflower, about 2 pounds, leaves and stem trimmed", "Salt to taste", "Pinch of saffron threads", "2 tablespoons extra virgin olive oil", "2 garlic cloves, minced", "3 anchovy fillets, rinsed and chopped", "1 14-ounce can chopped tomatoes, with juice", "Freshly ground pepper", "2 tablespoons chopped flat leaf parsley", "3/4 pound ziti or penne rigata", "2 ounces pecorino or Parmesan, grated (1/2 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and salt generously. Add the cauliflower and boil gently until the florets are tender but the middle resists when poked with a skewer or knife, about 10 minutes. Using slotted spoons or tongs (or a pasta insert) remove the cauliflower from the water, transfer to a bowl of cold water and drain. Cover the pot and turn off the heat. You will cook the pasta in the cauliflower water. Cut the florets from the core of the cauliflower and cut them into small florets or crumble coarsely using a fork or your hands."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the saffron in a small bowl and add 3 tablespoons warm water. Let steep for 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a large, heavy skillet and add the garlic. Cook, stirring, until it smells fragrant, about 30 seconds to a minute, and add the anchovies and tomatoes. Season to taste with salt (remembering that the anchovies will contribute a lot of salt) and freshly ground pepper. Turn the heat down to medium-low and cook, stirring often, until the tomatoes have cooked down and smell fragrant, about 10 minutes. Stir in the cauliflower, saffron with its soaking water, and parsley, cover and simmer for another 5 minutes. Remove from the heat. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the cauliflower water to a boil and add the pasta. Cook until just al dente, a few minutes less than you would cook it to serve. It will soften further when it bakes. Drain and transfer to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Oil a 3-quart baking dish. Toss the pasta with half the cauliflower mixture and half the cheese and spoon into the baking dish. Combine the remaining cauliflower mixture and remaining cheese and spoon over the pasta. Drizzle on the remaining tablespoon of oil. Place in the oven and bake for 20 to 25 minutes, until bubbling. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1014470-baked-ziti-or-penne-rigate-with-cauliflower"}