{"@context": "http://schema.org", "@type": "Recipe", "name": "Taking Stock After Thanksgiving", "description": "After Thanksgiving, I use the turkey carcass to make a rich-tasting stock that I can pull out of the freezer in the months ahead to use in risottos, soups and stews. The stock is easy to make but requires a long simmer, six hours if possible. So during the long weekend following Thanksgiving, I try to set aside an afternoon at home to simmer a pot of turkey stock on the stove.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": null, "totalTime": "PT7H45M", "recipeYield": "Makes about 5 quarts", "recipeCuisine": "", "recipeCategory": "project", "keywords": "dairy-free, halal, healthy, kosher, low cholesterol, low-fat, low-sodium, low sugar, nut-free, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 47}, "recipeIngredient": ["1 turkey carcass, plus the neck if you kept it", "6 quarts water (more if needed)", "3 or 4 carrots, peeled and sliced", "3 or 4 stalks celery, sliced", "2 leeks, trimmed, cleaned, and sliced optional", "1/2 head garlic, cut in half across the middle", "2 bay leaves", "6 sprigs parsley", "4 sprigs thyme", "12 peppercorns", "1 teaspoon salt", "2 quarts turkey stock", "Salt", "freshly ground pepper to taste", "2 carrots, diced", "2 stalks celery, diced", "Leftover vegetables from dinner", "Leftover turkey from dinner, diced", "1/2 cup soup pasta, such as shells or macaroni", "Chopped fresh parsley or cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the turkey, making sure to wash away any stuffing that may be sticking to the walls of the cavity. Break apart if necessary, so the wing bones and thigh bones are detached. Place in a large stockpot, and add the water. It should cover the carcass."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place over medium heat, and bring to a simmer. The bubbles should just break gently on the surface. Skim off any foam that rises to the surface. Cover partially, turn the heat to very low and simmer two hours, skimming as necessary. Add the remaining ingredients, and simmer for another four hours, partially covered. Keep your eye on the pot, and skim as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before draining such a big pot of stock, I find it easiest to remove the carcass and bones using tongs. Gently strain the soup through a strainer, colander or conical chinois into a very large bowl. Line a strainer with cheesecloth, and strain once again. Place in the refrigerator, uncovered, and chill. Lift off any fat that has congealed on the top, and discard. Keep in the refrigerator, or freeze in small containers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the stock, salt, pepper, carrots and celery, and bring to a simmer. Cover and simmer over low heat for 30 minutes. Add the leftover vegetables and turkey, and simmer for another 10 to 15 minutes. Add the soup pasta, and simmer until tender, five to 10 minutes. Taste, adjust seasonings and stir in the parsley or cilantro. Serve."}]}