{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Pepper and Tomato Sauce", "description": "Pasta is a perfect vehicle for showing off late summer vegetables. Pasta dishes also are great way to get more vegetables, as they’re often concentrated in the accompanying sauces and toppings. Between the peppers and the tomatoes, this dish is packed with lycopene, as well as vitamins C, A, B6 and K. If you use a food processor to puree the sauce, be sure to strain it afterward for a smooth, elegant texture.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/10/12/health/12recipehealth_600/12recipehealth_600-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "fall, healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 55}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 386, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "70 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "7 grams", "proteinContent": "12 grams", "saturatedFatContent": "1 gram", "sodiumContent": "741 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 medium onion, chopped", "2 large garlic cloves, green shoots removed, minced", "1 1/2 pounds red peppers, cut in large dice", "1 1/4 to 1 1/2 pounds tomatoes, cut in wedges", "1 sprig fresh basil", "Salt", "freshly ground pepper to taste", "1 pound spaghetti", "Freshly grated Parmesan or ricotta salata for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large nonstick skillet or heavy casserole over medium heat. Add the onion. Cook, stirring, until tender, about five minutes, and add the garlic and peppers. Add a generous pinch of salt, and cook, stirring often, until the peppers have softened, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes, basil sprig, salt and pepper, and bring to a simmer. Simmer, stirring from time to time, until the tomatoes have cooked down somewhat, about 10 minutes. Cover, reduce the heat and simmer another 15 to 20 minutes (or longer), stirring occasionally until the mixture is thick and fragrant. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the basil sprig, and put the peppers and tomatoes through the fine blade of a food mill, or puree in a food processor and press through a strainer. Return to the pan, and keep the sauce warm while you cook the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Salt generously, and add the pasta. Cook al dente, following the timing instructions on the package but checking a minute before the indicated cooking time. Stir 1/4 to 1/2 cup of the pasta cooking water into the sauce, then drain the pasta and toss with the sauce. Serve with Parmesan or grated ricotta salata."}], "link": "https://cooking.nytimes.com/recipes/1014028-pasta-with-pepper-and-tomato-sauce"}