{"@context": "http://schema.org", "@type": "Recipe", "name": "Apricot and Saffron Gratin", "description": "", "author": {"@type": "Person", "name": "Anthony Tassinello"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "Serves 8", "recipeCuisine": "", "recipeCategory": "project", "keywords": "apricot, cake flour, saffron, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 535, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "75 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "9 grams", "sodiumContent": "155 milligrams", "sugarContent": "53 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Butter", "5 large eggs, separated", "½ cup cold water", "½ teaspoon vanilla extract", "¼ teaspoon almond extract", "1½ cups sugar", "1½ cups cake flour", "½ teaspoon baking powder", "¼ teaspoon salt", "¾ teaspoon cream of tartar", "2 teaspoons saffron threads", "¼ cup plus 2 tablespoons granulated sugar", "1/3 cup sparkling wine or prosecco", "4 large egg yolks", "¾ cup whipping cream", "Unsalted butter", "½ cup apricot brandy", "1 pound ripe apricots, such as Blenheims or Castlebright, washed, cut into thirds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the feather sponge cake", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the cake, grease a 12-by-18-inch half-sheet pan with melted butter. Line with a sheet of parchment paper and set aside. Preheat the oven to 350 degrees. In a standing mixer using the whisk attachment, beat the yolks on high speed until pale and light, about 2 minutes. Reduce speed to medium and beat in the water and extracts. Gradually add the sugar, increase the speed of the mixer to medium-high, and beat for 5 minutes, until thick and ribbon-like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, sift together the flour, baking powder and salt. In another medium bowl, whisk the egg whites until foamy. Add the cream of tartar and continue to beat until soft peaks are achieved. Gently fold the dry ingredients into the whipped egg-yolk mixture in two or three additions, making sure no dry pockets remain. Don't overwork the batter. When the dry ingredients are sufficiently incorporated, gently fold the egg whites into the mixture in two additions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan and spread evenly. Bake on the center rack of the oven for about 30 minutes, turning the pan halfway through baking to ensure even cooking. The cake will puff slightly and turn a pale blond and become springy to the touch. Cool on a rack. This cake freezes well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sabayon, in a small sauté pan set over low heat, toast the saffron threads until aromatic and slightly dry. Take care not to burn them. Set aside. In a small saucepan, dissolve 2 tablespoons sugar and the saffron in the wine over medium-low heat. Whisk occasionally to thoroughly dissolve and bloom the saffron."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a stainless-steel bowl over an ice bath. In a standing mixer, beat the egg yolks with 2 tablespoons sugar until pale and ribboned, about 5 minutes. Temper the egg-yolk mixture with a couple of teaspoons of the hot alcohol and continue to beat for 1 minute longer. Using a rubber spatula, scrape the egg-yolk mixture into the hot alcohol and return to very low heat. Stir constantly and scrape the bottom and sides of the pan to prevent scrambling the eggs. After about 3 minutes it will have thickened significantly. Pour the mixture into the bowl set in the ice bath. Do not scrape any cooked egg into the bowl. Whisk by hand until the sabayon is cool to the touch and a slight ribbon forms when tested."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the cream to stiff peaks, then gently fold into the sabayon using a rubber spatula. Cover and refrigerate until ready to assemble gratin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To build the gratin, heat the broiler in your oven or ready your wood-burning oven. Butter a 10- to 15-inch baking dish (or 8 individual ramekins) and trim the feather sponge to fit snuggly in the bottom. Brush the cake with the apricot brandy. Evenly arrange the apricot segments over the cake, letting some points stick up and others lay flat. Spoon the sabayon over the fruit, letting part of the cake and fruit poke through. This will provide a nice contrast of toasty cake and brûléed apricots. Sprinkle the top of the gratin with the remaining 2 tablespoons sugar and place under the broiler. Watch closely as the gratin browns and becomes bubbly and heated through. Serve immediately."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the saffron sabayon", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the cream to stiff peaks, then gently fold into the sabayon using a rubber spatula. Cover and refrigerate until ready to assemble gratin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To build the gratin, heat the broiler in your oven or ready your wood-burning oven. Butter a 10- to 15-inch baking dish (or 8 individual ramekins) and trim the feather sponge to fit snuggly in the bottom. Brush the cake with the apricot brandy. Evenly arrange the apricot segments over the cake, letting some points stick up and others lay flat. Spoon the sabayon over the fruit, letting part of the cake and fruit poke through. This will provide a nice contrast of toasty cake and brûléed apricots. Sprinkle the top of the gratin with the remaining 2 tablespoons sugar and place under the broiler. Watch closely as the gratin browns and becomes bubbly and heated through. Serve immediately."}]}]}