{"@context": "http://schema.org", "@type": "Recipe", "name": "Ad-Lib Turkey Cassoulet", "description": "", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/02/27/dining/27KITCH2/27KITCH2-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "dinner, project", "keywords": "cannellini beans, sausage, turkey drumsticks, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 785, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "12 grams", "proteinContent": "53 grams", "saturatedFatContent": "12 grams", "sodiumContent": "1391 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound flageolets or cannellini beans", "1 small onion, halved, peeled and stuck with 2 cloves", "1 bay leaf", "Salt ", "2 turkey legs (drumstick and thigh), about 1 1/2 pounds each", "Salt and pepper", "About 8 cups hot chicken, turkey or bean broth", "2 tablespoons butter, plus 2 tablespoons melted", "1 large onion, diced", "Pinch cayenne", "2 tablespoons chopped thyme", "6 garlic cloves, minced", "1 bunch small carrots, peeled, cut into 2-inch chunks", "1/2 pound slab bacon, cut into 1/4-inch lardons, simmered for 2 minutes in water and drained", "1/2 pound smoked garlic sausage, cut into 1/2-inch slices", "2 cups coarse dry bread crumbs", "2 tablespoons olive oil", "2 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before assembling the cassoulet, season turkey legs generously with salt and pepper, then wrap and refrigerate overnight. Pick over beans and give them a rinse. Soak beans in a large bowl of cold water overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, drain beans and put them in a large pot. Pour in fresh water to cover beans by 3 inches. Add small onion stuck with cloves and bay leaf. Bring to a boil over high heat, then lower to a simmer. Cook gently for 60 to 90 minutes, until tender. Add 2 teaspoons salt and stir with a wooden spoon to distribute. Let beans cool in the cooking liquid. (Beans may be cooked up to 2 days ahead and kept refrigerated in their liquid.) Drain beans in a colander set over a bowl. Reserve and use bean broth if you wish. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring turkey legs to room temperature and heat oven to 400 degrees. Put legs in a roasting pan and cook, uncovered, until nicely browned, about 30 minutes. Reduce heat to 375. Add 3 cups hot broth to pan, then cover tightly and bake for 1 hour, or until meat is very tender. Remove legs from pan and let cool, reserving pan juices. Take off skin and gristle and remove bones (save these for stock), then tear or cut turkey meat into rough wide strips. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 2 tablespoons butter in a wide, heavy soup pot over medium-high heat. Add diced onion and season generously with salt and pepper. Let onions soften and color a bit, stirring, then add cayenne, 1 tablespoon thyme and 3 cloves minced garlic. Add carrots and stir to coat. Add reserved pan juices plus 2 cups hot broth, turn down heat, and simmer until carrots are cooked but still firm, about 10 minutes. Add beans and gently mix with onion and carrot. Add turkey and bacon. Let simmer for 10 minutes more, adding broth as needed to keep beans a bit soupy, but not drowning. Taste broth and beans and adjust seasoning. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer bean mixture to a low, wide 3-quart baking dish. Arrange garlic sausage evenly over surface, then push down to bury each slice. Put bread crumbs in a small bowl and add olive oil and the 2 tablespoons melted butter. Add remaining thyme and garlic, and the parsley. Season with salt and pepper, and mix well with hands. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle crumb mixture over beans in an even layer. Push down on crumbs so they absorb some of the liquid. Carefully add more broth around edges of pan to make sure beans are well moistened. Cover tightly with foil and bake for 1 hour at 350 degrees. Remove foil and bake uncovered until bread crumbs are crisped and brown, about 30 minutes. Let dish rest for 15 minutes, then serve, making sure everyone gets some crust. (May be prepared 1 or 2 days ahead and refrigerated. To reheat, bring to room temperature, moisten with hot broth and bake as directed above.)"}], "link": "https://cooking.nytimes.com/recipes/1014570-ad-lib-turkey-cassoulet"}