{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Soba Noodles With Long Beans, Eggs and Cherry Tomatoes", "description": "Tomatoes and noodles Asian style; the cherry tomatoes are cooked just to the point at which their skins split, allowing the fruit inside to soften just a little bit and sweeten a lot. <br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/07/16/science/19recipehealth/19recipehealth-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 4", "recipeCuisine": "asian", "recipeCategory": "dinner, easy, quick", "keywords": "dairy-free, halal, healthy, high fiber, kosher, vegetarian, eggs, long beans, soba noodles, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 33}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 381, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "4 grams", "proteinContent": "16 grams", "saturatedFatContent": "3 grams", "sodiumContent": "981 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces soba noodles", "Salt to taste", "2 teaspoons sesame oil", "1/2 cup chicken or vegetable stock", "2 tablespoons soy sauce", "2 teaspoons rice vinegar", "1/2 teaspoon sugar", "2 tablespoons peanut oil, grapeseed oil, rice bran oil or canola oil", "2 large eggs, beaten", "1 to 2 green chiles, such as jalapeño or serrano, minced", "2 large garlic cloves, minced", "1 tablespoon minced ginger", "3/4 pound purple or green long beans, ends trimmed, cut into 1-inch pieces (about 3 cups)", "1 pound cherry tomatoes (about 3 cups)", "1/4 teaspoon ground black pepper", "1 cup chopped cilantro leaves and stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "First cook the soba noodles. Bring 3 or 4 quarts of water to a boil in a large pot. Add salt to taste. Add the noodles gradually, so that the water remains at a boil, and stir once with a long-handled spoon or pasta fork so that they don’t stick together. Wait for the water to come back up to a rolling boil — it will bubble up, so don’t fill the pot all the way — and add 1 cup of cold water. Allow the water to come back to a rolling boil, and add another cup of cold water. Allow the water to come to a boil one more time, and add a third cup of water. When the water comes to a boil again, the noodles should be cooked through. Drain and toss with the sesame oil in a bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the stock, soy sauce, rice vinegar, and sugar in a small bowl. Mix the minced chiles, garlic and ginger in another bowl. Place all of the ingredients within reach of your wok."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok over high heat until a drop of water evaporates within a second or two when added to the pan. Meanwhile beat 1 of the eggs in a bowl and add salt to taste. Swirl 1 teaspoon of the oil into the wok and add the egg, using a rubber spatula to scrape out every last bit. Tilt the wok to spread the egg into a pancake and cook until set, 30 seconds to a minute. Using a metal spatula, flip over and cook for about 5 seconds, then transfer to a cutting board. Cut into 2-inch long by 1/4-inch wide slices. Repeat with the other egg. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining oil to the wok, swirl the pan, then add the garlic, ginger and chile and stir-fry for no more than 10 seconds. Add the long beans and stir-fry for 1 minute. Add the tomatoes and stir-fry for 2 minutes, or until they collapse a little in the wok. Add the noodles, the stock mixture, and salt to taste, turn the heat down to medium and stir-fry for about a minute, until the liquid has evaporated. Sprinkle with pepper, add the eggs and cilantro, stir-fry to heat through, and serve."}], "link": "https://cooking.nytimes.com/recipes/1014883-stir-fried-soba-noodles-with-long-beans-eggs-and-cherry-tomatoes"}