{"@context": "http://schema.org", "@type": "Recipe", "name": "Southern Living's Best Fried Chicken", "description": "Many modern cooks have never learned to fry. We are convinced that fried food is unhealthy, unpopular and messy. But Norman King, a lifelong Southerner, a registered dietitian and a food editor at Southern Living magazine set out to change that. In &ldquo;The Way to Fry,” he offers both a guide to proper deep-frying technique, and a terrific recipe for crunchy, juicy fried chicken. While at first glance the recipe may resemble every other fried chicken you&rsquo;ve ever seen, the differences lie in the precise instructions, ensuring chicken that&rsquo;s cooked through, golden and crisp. A little bacon fat is an option for flavor. ", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/05/11/dining/fried-chicken-still/fried-chicken-still-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "southern", "recipeCategory": "dinner", "keywords": "all-purpose flour, chicken, vegetable oil, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 219}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1151, "unsaturatedFatContent": "58 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "85 grams", "fiberContent": "7 grams", "proteinContent": "65 grams", "saturatedFatContent": "19 grams", "sodiumContent": "812 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon plus 1 teaspoon salt", "1 chicken with skin, about 2 1/2 pounds, cut up into 8 pieces (see note)", "1 teaspoon black pepper", "1 cup all-purpose flour", "2 cups vegetable oil, like grapeseed, peanut or canola (do not use olive oil)", "1/4 cup bacon drippings (or use more oil)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 1 tablespoon salt with 3 quarts water in a large bowl or container. Add chicken, cover and refrigerate 8 hours or overnight. Drain, rinse with cold water and pat dry. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir together remaining 1 teaspoon salt and the black pepper. Sprinkle half the mixture evenly over chicken. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large sealable plastic bag, combine remaining pepper mixture and flour. Add 2 pieces chicken to bag and shake well to coat. Remove chicken pieces, shaking off extra flour, and set aside. Repeat with remaining chicken. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take a large (10- or 12-inch) cast-iron skillet or chicken fryer, for which you have a lid, and fit with a candy or deep-frying thermometer. Add oil and bacon drippings and heat to 360 degrees over medium heat; the oil will ripple and possibly give off a few wisps of smoke. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, immediately add chicken pieces, skin side down (work in batches if necessary to avoid crowding pan). The oil will drop to about 325 degrees, where it should stay; adjust heat so that oil is bubbling gently around the pieces. Cover and cook 6 minutes; uncover and cook 9 minutes. Turn chicken pieces; cover and cook 6 minutes. Uncover and cook another 5 to 9 minutes, depending on size of pieces. If necessary for even browning, turn pieces over a few times toward the end. \n\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain on paper towels or paper bags. Let cool at least 20 minutes before serving. "}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Cooking Fried Chicken", "description": "Julia Moskin makes a fried chicken recipe from Norman King’s new cookbook, “The Way to Fry.”", "thumbnailUrl": "https://static01.nyt.com/images/2016/05/11/dining/fried-chicken-still/fried-chicken-still-mediumThreeByTwo440.jpg", "uploadDate": "2013-05-07T19:16:42.000Z", "duration": "PT1M16S"}, "link": "https://cooking.nytimes.com/recipes/1014738-southern-livings-best-fried-chicken"}