{"@context": "http://schema.org", "@type": "Recipe", "name": "Butterscotch-Glazed Cinnamon Rolls", "description": "Cinnamon rolls get the grown-up treatment here, with muscular brown sugar used in place of white, and a splash of bourbon in the glaze for bite. The flavor is heavenly, the smell ambrosial &mdash; and the recipe is large enough that, if you're not feeding a crowd, you can freeze a few for later in the week.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/12/23/dining/recipes-butterscotchcinnamonrolls/recipes-butterscotchcinnamonrolls-mediumThreeByTwo440.jpg", "totalTime": "PT1H30M", "recipeYield": "18 rolls ", "recipeCuisine": "", "recipeCategory": "breakfast, project, sauces and gravies", "keywords": "all-purpose flour, cinnamon, dark brown sugar, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 324}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 241, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "4 grams", "sodiumContent": "145 milligrams", "sugarContent": "23 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 tablespoons unsalted butter", "1 cup milk", "400 grams all-purpose flour, more as needed (about 3 1/2 cups)\n", "400 grams dark brown sugar (about 2 cups)", "7 grams active dry yeast (about 2 1/4 teaspoons; 1 envelope)\n", "4 grams plus a pinch fine sea salt (about 1 teaspoon)", "7 grams ground cardamom (about 3/4 teaspoon)", "1 large egg", "14 grams ground cinnamon (about 1 1/2 tablespoons)", "2 grams freshly grated nutmeg (about 1/2 teaspoon)", "1 tablespoon bourbon or apple cider", "1 teaspoon vanilla extract", "115 grams confectioners’ sugar (about 1 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, melt 4 tablespoons butter. Add milk and heat until just warm to the touch (120 to 130 degrees). Pour into a large mixing bowl. In a separate bowl, whisk together flour, 100 grams or 1/2 cup brown sugar, yeast, 4 grams or 1 teaspoon salt and cardamom. Slowly beat flour mixture into butter mixture using an electric mixer set with the paddle attachment. Beat in egg, then beat until dough comes together in a ball, about 3 minutes; it should be slightly tacky but not sticky. If it feels very sticky, beat in more flour, 1 tablespoon at a time. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough out onto lightly floured work surface. Knead until smooth and elastic, about 2 minutes. Form into ball. Transfer to a large, lightly oiled bowl. Cover with plastic wrap and a dish towel. Let rise in a warm place until doubled in volume, about 2 to 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small saucepan over medium-low heat, melt 4 tablespoons butter. Cook until the foam subsides and the butter turns a deep nut brown; cool to room temperature. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together 150 grams or 3/4 cup brown sugar, cinnamon, nutmeg and a pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch down dough and roll into a rectangle about 15 inches long and 11 or 12 inches wide. Using a pastry brush, coat dough with butter, leaving a 1/2-inch border all around. Sprinkle sugar mixture evenly over butter. Starting at a long end, tightly roll up dough over filling. Arrange seam side down. Cut the dough crosswise into 18 slices (about 1/2-inch thick). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease two 9-inch square baking pans. Transfer rolls to pan, cut side up; they will fit snugly. Cover with plastic wrap and a dish towel. Let rise in a warm place until doubled in volume, about 45 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees; bake rolls until golden brown, about 20 minutes. Remove from oven and cool 10 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While rolls bake, place remaining 150 grams or 3/4 cup brown sugar in a small saucepan. Sprinkle with bourbon and 1/4 cup water. Bring to a simmer, stirring occasionally, and cook until sugar dissolves, about 3 minutes. Whisk in remaining 2 tablespoons butter until melted, whisk in vanilla, then turn off the heat and whisk in the confectioners&rsquo; sugar. Pour warm glaze evenly over the tops of the warm rolls. Let rest for at least 20 minutes before serving to allow glaze to set."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Cinnamon Rolls", "description": "Who doesn’t like cinnamon rolls? Melissa Clark shows how to make them.", "thumbnailUrl": "https://static01.nyt.com/images/2013/12/23/dining/recipes-butterscotchcinnamonrolls/recipes-butterscotchcinnamonrolls-mediumThreeByTwo440.jpg", "uploadDate": "2013-01-04T18:06:40.000Z", "duration": "PT3M28S"}, "link": "https://cooking.nytimes.com/recipes/1014467-butterscotch-glazed-cinnamon-rolls"}