{"@context": "http://schema.org", "@type": "Recipe", "name": "Bulgur and Kale Casserole", "description": "This comforting kale and bulgur casserole is modeled on the casserole I made a few weeks ago for Recipes for Health, with eggplant and bulgur.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/10/11/science/11recipehealth/11recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H40M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "dinner, one pot", "keywords": "coarse bulgur, kale, tomato, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 69}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 253, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "9 grams", "proteinContent": "15 grams", "saturatedFatContent": "3 grams", "sodiumContent": "745 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 small or 1/2 medium onion, chopped", "2 to 4 garlic cloves (to taste)", "2 pounds fresh tomatoes, quartered if you have a food mill, peeled, seeded and chopped if you don’t, or  1 28-ounce can chopped tomatoes, with juice, or crushed tomatoes in purée", "Salt", "freshly ground pepper", "1/2 teaspoon sugar", "1/4 teaspoon ground cinnamon", "1/2 teaspoon sweet paprika", "1/4 teaspoon ground allspice", "1 pound kale, stemmed and washed, or a 10-ounce bag of stemmed, washed kale", "1 tablespoon extra virgin olive oil", "1 garlic clove, minced", "Salt", "freshly ground pepper", "1 cup coarse bulgur No. 3, cooked", "1/4 cup finely chopped fresh dill", "2 ounces approximately 1/2 cup freshly grated Parmesan", "3 eggs", "1 cup thick plain low-fat yogurt", "Salt to taste", "pepper to taste", "paprika to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tomato sauce. Heat the olive oil in a large, heavy skillet over medium heat and add the onion. Cook, stirring, until tender, about 5 minutes, and add the garlic. Cook, stirring, until fragrant, about a minute, and add the tomatoes, salt to taste, pepper, sugar, cinnamon, paprika and allspice. Turn the heat up to medium-high and cook until the tomatoes are bubbling. Stir together, turn the heat back to medium-low, partly cover and cook, stirring often, until the tomatoes have cooked down and the sauce is thick and fragrant, 25 to 30  minutes. Taste and adjust seasoning. Remove from the heat. If your sauce is chunky, put through a food mill or pulse in a food processor fitted with the steel blade. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, blanch the kale in salted boiling water for 4 minutes or steam for 5 to 8 minutes, until tender. Rinse with cold water and squeeze dry. Chop fine (you can do this by pulsing in a food processor fitted with the steel blade.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy skillet and add the garlic. When it begins to smell fragrant, in about 30 seconds, stir in the chopped kale. Toss together and season to taste with salt and freshly ground pepper. Stir in the bulgur and dill, combine well and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees Fahrenheit. Oil a 3-quart baking or gratin dish. Spoon a small amount of tomato sauce on the bottom of the dish, and spoon in the bulgur and kale. Spread in an even layer. Sprinkle 2 tablespoons of the Parmesan on top and cover with the remaining tomato sauce, spread in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat together the eggs, yogurt and 2 tablespoons of the remaining Parmesan. Season with salt, pepper and paprika. Spoon over the tomato sauce and spread in an even layer. Sprinkle the remaining Parmesan on top. Place in the oven and bake 30 to 35 minutes, until golden. Remove from the heat and let sit for 10 minutes or longer before serving."}], "link": "https://cooking.nytimes.com/recipes/1014290-bulgur-and-kale-casserole"}