{"@context": "http://schema.org", "@type": "Recipe", "name": "Royal Cake Bisteeya", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "", "recipeCuisine": "scandinavian", "recipeCategory": "dinner, project", "keywords": "main course", "aggregateRating": null, "recipeIngredient": ["4 cups unsalted chicken stock", "2 tablespoons sugar", "1 teaspoon ground black (or green) cardamom", "½ teaspoon ground cinnamon", "¼ teaspoon salt", "4 sheets phyllo, halved lengthwise", "About 2 tablespoons melted, clarified butter", "¼ cup plus 2 tablespoons powdered sugar", "¼ teaspoon plus 1/8 teaspoon ground cardamom", "¼ teaspoon cinnamon", "½ ounce egg white", "3½ ounces whole almonds, finely ground", "2 chicken breasts, on the bone", "Salt", "2 tablespoons ras el hanout (one that emphasizes cardamom, if possible)", "2 tablespoons grapeseed oil", "2 tablespoons olive oil", "2 shallots, minced", "4 cloves garlic, minced", "2 small bunches kale (like red Russian), ribs removed and torn into pieces", "Salt to taste", "1 preserved lemon rind, minced", "½ teaspoon maras pepper (optional; see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the sauce", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the stock into a small saucepan and reduce over medium heat until it reaches a saucelike consistency. Season to taste. Keep warm."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the phyllo", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 325 degrees; line a baking sheet with Silpat or parchment paper. Combine the sugar, cardamom, cinnamon and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush one of the half sheets of phyllo with the butter. Sprinkle liberally with the sugar mixture. Repeat this process with the remaining phyllo. On the last piece of phyllo, spread only with butter. Cover the phyllo with a piece of parchment paper and gently roll with a rolling pin to press out any air bubbles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the phyllo into rectangles measuring 2 inches by 3½ inches. Cover rectangles with another Silpat mat or piece of parchment paper. Top with another baking sheet. Bake the rectangles for 12 minutes. Rotate the pan 180 degrees and bake another 10 minutes, or until golden. Remove from the oven and cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees; line a baking sheet with parchment paper and butter the top. Sift the powdered sugar, cardamom and cinnamon into a medium mixing bowl. Add 1 tablespoon water and mix well. Add 2 more tablespoons water and the egg white and whisk to combine well. Fold in the ground almonds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread in a rectangle, 8 inches by 3½ inches, on the parchment paper. Bake for 15 minutes, turning the pan halfway through. Let cool before removing from the pan. Cut into 4 rectangles measuring 2 inches by 3½ inches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "A day in advance, season the chicken breasts with salt and dust with the ras el hanout. Place on a baking rack set over a sheet pan and refrigerate overnight."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the royal cake", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Heat the oil in a sauté pan over medium-high heat. Add the chicken, skin side down. Sear until golden and flip. Transfer to the oven and roast until the breasts are cooked through, about 20 minutes. Let rest 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carve the breasts off the bone and season the inside of the carved side. Thinly slice the breasts crosswise so that the pieces can fit neatly on the almond cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large sauté pan over medium heat. Add the shallots and sauté for about 2 minutes. Add the garlic and cook for another minute. Add the kale and season with salt. Cook until tender, about 10 minutes. When done, transfer to a bowl and let drain. Adjust the seasoning and add the lemon and maras pepper."}]}]}