{"@context": "http://schema.org", "@type": "Recipe", "name": "Mocha Chocolate Chip Cake", "description": "Alice’s Tea Cup, which is owned by the sisters Haley Fox and Lauren Fox, is known for its scones, but the chainlet of teahouses in New York also makes pastries, cakes and other treats. This recipe is an adaptation of a chocolate chip cake with mocha frosting that originated with the Fox sisters’ mother. The cake has a tender crumb, and the frosting is silky and rich.", "author": {"@type": "Person", "name": "Alex Witchel"}, "image": "https://static01.nyt.com/images/2016/06/27/dining/27COOKING-MOCHA-CHOC-CHIP-CAKE/27COOKING-MOCHA_CHOC-CHIP-CAKE-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "One 2-layer 8-inch cake", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "all-purpose flour, instant espresso, semisweet chocolate, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 582}, "recipeIngredient": ["113 grams (1/2 cup or 1 stick) salted butter, softened, more for pans", "250 grams (2 1/4 cups) sifted unbleached all-purpose flour, more for pans", "300 grams (1 1/3 cups) turbinado sugar", "2 large eggs", "1 1/2 teaspoons vanilla extract", "2 1/2 teaspoons baking powder", "1 teaspoon kosher salt", "1 cup milk (2 percent or whole)", "3/4 cup to 1 cup semisweet or bittersweet chocolate chips, roughly chopped; or mini chocolate chips", "360 grams (3 cups) confectioners’ sugar", "226 grams (1 cup) salted butter, softened", "1/8 teaspoon kosher salt", "1/2 teaspoon vanilla extract", "2 tablespoons plus 1 teaspoon instant espresso", "2 tablespoons boiling water", "3/4 cup to 1 cup semisweet or bittersweet chocolate chips, for decorating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Heat oven to 350 degrees. Butter and flour two 8-inch cake pans, and line the bottoms with rounds of parchment paper cut to fit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer or by hand, in a bowl, mix the butter and turbinado sugar until evenly blended. Add eggs and vanilla, and mix again until smooth. In a separate bowl, whisk or sift the flour, baking powder and salt together. Add half the dry ingredients to the egg mixture, mix well, then add half the milk and mix again. Repeat with remaining dry ingredients and milk. Add the chocolate chips and mix well. The batter may look curdled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the pans and bake until a tester inserted into the center comes out clean, 30 to 35 minutes. Let cool for 15 minutes before removing cakes from pans to a rack to cool completely. If the cakes are domed, use a long, serrated knife to level the tops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the frosting: Using an electric mixer or by hand, mix the confectioners’ sugar with the butter, salt and vanilla, until well blended. In a small bowl, mix the espresso powder with the boiling water to dissolve; add it to the frosting, blending well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one cake layer on a serving platter and spread about one-third of the frosting over the top in an even layer. Top with the second cake layer and use an offset spatula or butter knife to spread frosting over top and, optionally, sides of the cake. Decorate with the chocolate chips."}], "link": "https://cooking.nytimes.com/recipes/1014217-mocha-chocolate-chip-cake"}