{"@context": "http://schema.org", "@type": "Recipe", "name": "Herb-and-Olive Frittata", "description": "In this recipe, herbs are the focus, but to use herbs on a grand scale, it helps to know which ones work in that role and which ones don’t. Parsley, obviously, works in abundance: it’s clean-tasting, pleasantly grassy and almost never overwhelming. You can add literally a bunch (bunches!) of it to salad, soup, eggs, pasta, grains or beans. The same is largely true of basil, and you can use other mild herbs — chervil, chives, cilantro, dill, shiso — by at least the handful. (Mint is also useful but will easily take over a dish if you add too much of it.) I put most other herbs — epazote, lavender, marjoram and oregano, rosemary, sage, tarragon and thyme — in the category of strong herbs, which must be used more sparingly than mild herbs. You usually don’t want to use more than a tablespoon or so of strong herbs in a dish. This frittata uses generous amounts of both parsley and basil and lesser amounts of dill, mint, rosemary or thyme.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/22/dining/Herb-and-Olive-Frittata/Herb-and-Olive-Frittata-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 to 6 servings", "recipeCuisine": "spanish", "recipeCategory": "breakfast, easy, quick", "keywords": "black olives, eggs, fresh herbs, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 57}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 212, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "4 grams", "sodiumContent": "343 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons olive oil", "1 large onion, chopped", "1 tablespoon minced garlic", "1/2 cup chopped black olives, preferably oil-cured", "1 cup chopped fresh parsley", "1 cup chopped fresh basil", "1/2 cup chopped fresh dill", "1/2 cup chopped fresh mint", "1 tablespoon chopped fresh rosemary or thyme", "8 eggs, lightly beaten", "1/2 cup milk", "1 tablespoon all-purpose flour", "Salt", "black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the oil in a large skillet over medium heat. Add the onion and garlic and cook, stirring occasionally, until softened, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the olives and herbs and cook, stirring occasionally, until they soften and become dry, 2 to 3 minutes. Meanwhile, beat together the eggs, milk, flour and some salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat to low and pour the egg mixture into the skillet, using a spoon if necessary to evenly distribute the herbs and olives. Cook, undisturbed, until the eggs are just set, 5 to 10 minutes. (You can set the top further by putting the pan in an oven at 350 for a few minutes or by running it under the broiler for a minute or two.) Serve hot, warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1014273-herb-and-olive-frittata"}