{"@context": "http://schema.org", "@type": "Recipe", "name": "Arugula Pesto", "description": "To most people, pesto means one thing: pesto Genovese, the famous and fabulous basil paste from the Italian Riviera.  But there are sauces made with copious amounts of other herbs or greens not destined for pasta. They aren’t called pestos, yet that’s what they are — all made by grinding herbs and other ingredients to a paste, then thinning out and enriching with oil. This dish is inspired by one found in southern Italy. This sauce, like other forms of pesto, is all pungent with garlic. In addition to serving this vibrant pesto with pasta, it can be used with grains — risottos made with rice, barley, or wheat — and as a topping for tomatoes. It’s great on its own, spooned onto a thick slice of country bread. Don’t use a sharp olive oil with this, or it will overwhelm the arugula.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/08/31/health/31recipehealth_600/31recipehealth_600-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "Makes about 2/3 cup", "recipeCuisine": "", "recipeCategory": "easy, quick, condiments", "keywords": "healthy, raw, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 237}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 851, "unsaturatedFatContent": "67 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "86 grams", "fiberContent": "2 grams", "proteinContent": "17 grams", "saturatedFatContent": "16 grams", "sodiumContent": "511 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["2 garlic cloves, cut in half, green shoots removed", "2 heaped tablespoons shelled walnuts", "4 ounces arugula, stemmed, washed and dried 2 cups leaves, tightly packed", "1/2 teaspoon salt", "1/3 to 1/2 cup extra virgin olive oil, as needed", "1/3 to 1/2 cup freshly grated Parmesan, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on a food processor fitted with the steel blade, and drop in the garlic cloves. When they are chopped and adhering to the sides, stop the machine, scrape down the sides of the bowl and add the walnuts. Turn on the machine, and process until they are finely ground. Scrape down the bowl again, and add the arugula and the salt. Pulse until the arugula is finely chopped, then turn on the machine and run while you slowly drizzle in the olive oil. When the mixture is smooth, stop the machine, scrape down the sides and process for another 30 seconds or so. Scrape out into the bowl of a mortar and pestle. Grind the mixture with the pestle for a smoother texture. Work in the cheese and combine well."}], "link": "https://cooking.nytimes.com/recipes/1014013-arugula-pesto"}