{"@context": "http://schema.org", "@type": "Recipe", "name": "Raspberry Crumble", "description": "I made this crumble because I had some less-than-delicious raspberries on hand — when you bake them in a crumble, the flavors deepen. Most of the sweetness is in the topping; the filling is somewhat tart. The newest of the grainy crumble toppings that I keep on hand in the freezer, this one has a particularly nutty flavor because of its toasted flaxseeds. Use certified gluten-free oats if you like.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/06/03/health/03recipehealth/03recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H45M", "recipeYield": "Serves eight", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "dessert, flaxseed, raspberries, rolled oats, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 305, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "13 grams", "proteinContent": "5 grams", "saturatedFatContent": "6 grams", "sodiumContent": "41 milligrams", "sugarContent": "20 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 quarts raspberries (you may use frozen)", "3 tablespoons sugar, preferably raw organic sugar", "2 teaspoons rose water", "2 teaspoons cornstarch (if using frozen berries, increase to 1 tablespoon)", "1 3/4 cups (7 ounces) crumble topping (recipe below)", "1 1/4 cups rolled oats", "1/4 cup rice flour", "1/4 cup regular or preferably toasted flaxseeds, coarsely ground", "1/3 cup unrefined turbinado sugar", "1/2 teaspoon freshly grated nutmeg", "1/8 teaspoon salt", "3 ounces (6 tablespoons) cold unsalted butter, cut into 1/2-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss the raspberries with the sugar, rose water and cornstarch. Cover and let stand for 15 to 30 minutes. Meanwhile, preheat the oven to 350 degrees, and butter a 2-quart baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the fruit to the baking dish, making sure to scrape in all of the liquid from the bowl. Place in the oven for 15 minutes. Remove from the oven, and spread the crumble topping over the fruit in an even layer. Return to the oven for 15 to 20 minutes until the crumble is bubbling and nicely browned. Allow to stand for at least 15 minutes before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Cover a baking sheet with parchment. Place the oats, rice flour, ground flaxseeds, sugar, salt and nutmeg in a food processor fitted with the steel blade. Pulse several times to combine. Add the butter, and pulse until it is evenly distributed throughout the grain mix. The mixture should have a crumbly consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the topping over the parchment-covered baking sheet in an even layer. Place in the oven, and bake 10 minutes. Rotate the pan, stir the mixture and bake another five to 10 minutes until nicely browned. Remove from the heat, and allow to cool. You can keep this in an airtight container or freezer bag in the freezer for several weeks."}], "link": "https://cooking.nytimes.com/recipes/1014314-raspberry-crumble"}