{"@context": "http://schema.org", "@type": "Recipe", "name": "Quinoa-Oat Crumble Topping", "description": "Lately I’ve been thinking about desserts and all the after-dinner delights that my gluten-intolerant friends are missing. Pies, for instance: I have yet to come up with a gluten-free pie crust that I like. But crumbles can make a fine alternative, because the topping requires none of the flour that gluten-intolerant diners can’t stomach. Crumbles are easy to throw together and are a perfect destination for seasonal fruit. In this recipe, I use flour made from quinoa — easy to do in a spice grinder — and gluten-free oats, which I ordered from Bob’s Red Mill. Crumbles require little added sugar. So that I can make crumbles on a whim, I make the topping in advance and keep it in the freezer. Bake the crumble halfway through without the topping, then sprinkle it on and finish baking close to serving time. The topping never gets soggy waiting for the fruit underneath to cook. I like to stir leftovers into my yogurt for breakfast. This topping can be used to make any number of delicious, gluten-free crumbles.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/10/05/science/04recipehealth600/04recipehealth600-articleLarge-v3.jpg", "totalTime": "PT30M", "recipeYield": "About 2 cups", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "dessert, fall, gluten-free rolled oats, quinoa, turbinado sugar, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 50}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 245, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "8 grams", "sodiumContent": "78 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 cups gluten-free rolled oats", "1/2 cup quinoa flour (grind quinoa in a spice mill to make the flour)", "1/3 cup unrefined turbinado sugar", "1/2 teaspoon freshly grated nutmeg", "1/8 to 1/4 teaspoon salt (to taste)", "3 ounces (6 tablespoons) cold unsalted butter, cut into 1/2-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Cover a baking sheet with parchment. Place the oats, quinoa flour, sugar, salt and nutmeg in a food processor fitted with the steel blade, and pulse several times to combine. Add the butter, and pulse until the butter is evenly distributed throughout the grain mix. The mixture should have a crumbly consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the topping over the parchment-covered baking sheet in an even layer. Place in the oven, and bake 10 minutes. Rotate the pan front to back, stir the mixture and bake another 5 to 10 minutes until nicely browned. Remove from the heat, and allow to cool. You can keep this in the freezer for several weeks in an airtight container or freezer bag."}], "link": "https://cooking.nytimes.com/recipes/1014093-quinoa-oat-crumble-topping"}