{"@context": "http://schema.org", "@type": "Recipe", "name": "Lazy Sonker", "description": "It’s not a pie, nor is it really a cobbler (though, to some, they are one and the same). As Kim Severson reported in 2013, when she traveled to Mount Airy, N.C., to try the regional dish: “Most people seem to agree that the essential characteristics of sonkers are these: They are juicier than cobblers. They are deeper than cobblers. They used to be made in what Southern country cooks called bread pans.” This recipe, adapted from Wilma Fleming of Barney's Cafe, draws its flavor from strawberries, or pitted cherries, and is capped with a simple crust of milk, sugar, flour and salt, whisked to the consistency of pancake batter. It’s a perfect dessert for spring or summer gatherings, and best served while it’s still warm.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2013/06/28/dining/video-sonker-pie-carolina/video-sonker-pie-carolina-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "southern", "recipeCategory": "", "keywords": "cherries, strawberry, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 43}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 336, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "8 grams", "sodiumContent": "370 milligrams", "sugarContent": "39 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 tablespoons (1 stick) butter", "4 heaping cups (about 1 1/2 pounds) hulled strawberries (halved if large) or pitted cherries", "1/2 teaspoon vanilla extract", "1 cup plus 2 tablespoons sugar", "1 cup plus 2 tablespoons self-rising flour", "1 cup milk", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Put 5 tablespoons butter in a 9-by-12-inch baking pan, and place in oven; remove when melted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan, combine fruit, vanilla, 1/4 cup sugar, 1 tablespoon butter and 1 cup water. Place over low heat and simmer until fruit is slightly tender, about 5 minutes. Remove from heat. Drain fruit, reserving liquid and fruit separately; there should be about 1 cup liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine remaining 2 tablespoons butter, 2 tablespoons of the sugar and 2 tablespoons of the flour. Place over medium heat and stir until butter melts and mixture is well blended and thickened, about 2 minutes. Add 1/2 cup of the liquid from the fruit, and whisk until smooth. Add another 1/2 cup liquid and whisk again. Add mixture to fruit, combining well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine milk, remaining 1 cup flour, the salt and remaining 3/4 cup sugar. Whisk to consistency of pancake batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour fruit mixture into the pan with the melted butter. Carefully pour batter over fruit, taking care to spread it so it touches the edge of the pan. There will be some bare spots. Bake until crust is golden, about 35 minutes."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Forget Pie or Cobbler: Call It a Sonker", "description": "The Times’s Kim Severson visits Mount Airy, N.C., to learn more about the sonker, a soupy baked fruit dessert native to Surry County.", "thumbnailUrl": "https://static01.nyt.com/images/2013/06/28/dining/video-sonker-pie-carolina/video-sonker-pie-carolina-mediumThreeByTwo440.jpg", "uploadDate": "2013-07-01T18:23:18.000Z", "duration": "PT2M58S"}, "link": "https://cooking.nytimes.com/recipes/1014847-lazy-sonker"}