{"@context": "http://schema.org", "@type": "Recipe", "name": "Socca (Farinata)", "description": "This is essentially a large chickpea pancake from Provence (and neighboring Liguria, where it’s called farinata). It’s traditionally cooked in wood ovens on copper disks, roughly cut and served hot or warm. (In the main market in Nice, it’s baked a few hundred yards away and delivered by bicycle, to be wrapped in paper and eaten on the street.) If you have no wood or copper, that’s no problem. They’re nearly as great in a skillet or in a pizza pan in your oven, and totally foolproof.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/03/21/dining/21COOKING_SOCCAFARINATA2/21COOKING_SOCCAFARINATA2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 appetizer servings", "recipeCuisine": "provencal", "recipeCategory": "easy", "keywords": "appetizer, chickpea flour, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 375}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 165, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "92 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 cup chickpea flour", "1 teaspoon salt", "1 teaspoon freshly ground black pepper", "4 to 6 tablespoons olive oil", "1/2 large onion, thinly sliced", "2 teaspoons chopped fresh rosemary"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450. Put a well-seasoned or nonstick 12-inch pizza pan or cast-iron skillet in oven. (If you have a socca pan, obviously that will work well also.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the chickpea flour in a bowl; add the salt and pepper. Slowly add 1 cup lukewarm water, whisking to eliminate lumps. Stir in 2 tablespoons olive oil. Cover and let sit while the oven heats, or for as long as 12 hours. The batter should be about the consistency of heavy cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan, pour 2 tablespoons of the oil into it and swirl. Add the onions return the pan to the oven and cook, stirring once or twice, until they’re well browned, 6 to 8 minutes. Stir in the rosemary. Stir the onions and rosemary into the batter, then immediately pour the batter into the pan. Bake for 10 to 15 minutes, or until the pancake is firm and the edges set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler and brush the top of the pancake with 1 or 2 tablespoons of oil if it looks dry. Set the pancake a few inches away from the broiler, and cook just long enough to brown it in spots. Cut it into wedges, and serve hot or warm."}]}