{"@context": "http://schema.org", "@type": "Recipe", "name": "Focaccia With Tomatoes and Rosemary", "description": "This beautiful bread is a great way to use summer tomatoes, but the heat from the oven will draw rich, deep flavor from the less flavorful ones found in winter as well.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/05/14/science/14recipehealth/14recipehealth-articleLarge.jpg", "totalTime": "PT2H45M", "recipeYield": "12 to 15 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "appetizer, dairy-free, halal, healthy, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian, roma tomato, rosemary, whole wheat flour, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 102}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 124, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "0 grams", "sodiumContent": "195 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["2 teaspoons (8 grams) active dry yeast", "1 teaspoon (5 grams) sugar", "1 1/2 cups lukewarm water", "2 tablespoons (25 grams) olive oil, plus an additional 2 tablespoons (25 grams) for drizzling", "250 grams (approximately 2 cups) whole-wheat flour", "200 to 220 grams (approximately 1 2/3 to 1 3/4 cups) unbleached all-purpose flour or bread flour, plus additional as needed for kneading", "1 3/4 teaspoons (13 grams) salt", "3/4 pound Roma tomatoes", "Coarse salt and freshly ground pepper to taste", "1 to 2 tablespoons chopped fresh rosemary (to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a standing mixer, or in a large bowl, dissolve the yeast and sugar in the water. Add the olive oil, whole-wheat flour, 200 grams of the all-purpose flour and salt and mix together briefly using the paddle attachment. Change to the dough hook and beat for 8 to 10 minutes at medium speed, adding flour as necessary. The dough should eventually form a ball around the dough hook and slap against the sides of the bowl as the mixer turns; it will be sticky. Remove from the bowl, flour your hands and knead for a minute on a lightly floured surface, and shape into a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If kneading the dough by hand, dissolve the yeast in the water with the sugar as directed. Stir in the olive oil, whole-wheat flour, salt and all-purpose flour by the half-cup, until the dough can be scraped out onto a floured work surface. Knead, adding flour as necessary, for 10 minutes, until the dough is elastic and smooth. Shape into a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and dry your bowl and oil lightly with olive oil. Place the dough in it, rounded side down first, then rounded side up. Cover tightly with plastic and let rise in a warm spot for 1 1/2 to 2 hours, or in the refrigerator for 4 to 8 hours, until doubled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch down the dough. Cover with lightly oiled plastic and let the dough rest for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees, preferably with a baking stone in it. Line a sheet pan with parchment and oil generously. Roll or press out the dough into a rectangle the size of the sheet pan or just slightly smaller. To do this efficiently, roll or press out the dough, stop and wait 5 minutes for the gluten to relax, then roll or press out again, and repeat until the dough reaches the right size. Cover with a damp towel and let rest for 30 minutes. Just before baking, use your fingertips to dimple the dough all over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tomatoes into rounds and place on top of the focaccia. Sprinkle with coarse salt and the rosemary. Drizzle a tablespoon or two of olive oil over all."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, setting the pan on top of the baking stone (if using), for 20 to 25 minutes, until the bread is deep golden brown. Let rest for at least 10 minutes before serving, or allow to cool completely."}]}