{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach Soup With Coriander, Cinnamon and Allspice", "description": "This soup was inspired by a Syrian recipe, a spice-laced pan-cooked spinach that is served with yogurt and walnuts on top. This recipe uses the same spices in a puréed spinach soup. It works beautifully. Half of the yogurt is stirred into the soup, contributing a tart flavor that’s a great finishing dimension to the soup. The rest is drizzled onto each serving.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/06/03/health/03recipehealth/03recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings.", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "gluten-free, halal, healthy, high fiber, kosher, low cholesterol, vegetarian, main course, spinach, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 137}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 291, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "18 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1152 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 medium onion, chopped", "1/3 cup finely diced celery", "Salt to taste", "2 garlic cloves, minced", "1/2 cup medium-grain rice", "6 cups chicken stock or vegetable stock", "A bouquet garni made with a bay leaf and a couple of sprigs each thyme and parsley", "1 1/2 pounds fresh spinach, stemmed and washed thoroughly in 2 changes of water", "1/4 teaspoon ground allspice", "1/8 teaspoon ground clove", "1/8 teaspoon freshly grated nutmeg", "1/4 teaspoon ground cinnamon", "1 scant teaspoon coriander seeds, lightly toasted and ground", "Salt and freshly ground pepper", "1 teaspoon cornstarch", "2 cups drained yogurt or Greek-style yogurt", "1 small garlic clove (optional)", "1/4 to 1/3 cup chopped walnuts for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy soup pot or Dutch oven, and add the onion and celery. Cook, stirring, until tender, about 5 minutes. Add a generous pinch of salt and the garlic and cook, stirring, until the garlic smells fragrant, 30 seconds to 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the stock, rice, bouquet garni, and salt to taste, and bring to a boil. Reduce the heat, cover and simmer 30 minutes. Remove the bouquet garni. Stir in the spinach and spices, cover and simmer 5 minutes, stirring once or twice. The spinach should wilt but should maintain its bright color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a hand blender that has a powerful motor, or in batches in a regular blender, purée the soup. If using a regular blender, fill only halfway and cover the top with a towel pulled down tight, rather than the lid, because hot soup will push the top off if the blender is closed airtight. Return to the pot and heat through, stirring. Whisk 1 teaspoon cornstarch into 1 cup of the yogurt, and whisk into the soup. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you want a pungent, garlicky yogurt garnish, mash the remaining garlic to a paste with a pinch of salt in a mortar and pestle. Stir into the remaining yogurt. Serve the soup, garnishing each bowl with a swirl of the yogurt and a sprinkling of chopped walnuts."}], "link": "https://cooking.nytimes.com/recipes/1014776-spinach-soup-with-coriander-cinnamon-and-allspice"}