{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick Roasted Tomatillo Salsa", "description": "This is a classic Mexican blender tomatillo salsa. Once the tomatillos are roasted there is no cooking involved. Serve this tangy, medium-hot salsa with roasted or microwaved tortilla chips, or use it for quick tacos or as an easy condiment for grilled fish or chicken.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/09/13/health/13recipehealth/13recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "2 cups, serving six to eight", "recipeCuisine": "mexican", "recipeCategory": "easy, condiments", "keywords": "healthy, vegan, vegetarian, jalapeño, onion, tomatillo", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 93}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 21, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "186 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 pound tomatillos, husked and rinsed", "2 to 4 jalapeño or serrano chilies, roasted if desired (see below), seeded for a milder salsa, coarsely chopped", "1/4 cup chopped onion, soaked for five minutes in cold water, drained and rinsed", "1/2 cup coarsely chopped cilantro", "Salt to taste", "About 1/2 cup water, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler. Cover a baking sheet with foil and place the tomatillos on top, stem side down. If you wish to roast the chilies, place them on the baking sheet as well. Place under the broiler at the highest rack setting and broil two to five minutes, until charred on one side (the chilies will be charred after a minute or two). Turn over and broil on the other side for two to five minutes, until charred on the other side. Remove from the heat. If you have roasted the chilies, peel and stem them, and coarsely chop."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the tomatillos and chilies to a blender, tipping in any juice that may have accumulated on the foil. Add the onion, cilantro and 1/4 cup water to the blender and blend to a coarse purée. Transfer to a bowl and thin out as desired with water. Taste and adjust salt. Set aside for at least 30 minutes before serving to allow the flavors to develop."}]}