{"@context": "http://schema.org", "@type": "Recipe", "name": "Warm Millet, Carrot and Kale Salad With Curry-Scented Dressing", "description": "I love millet but it is tricky to cook; it can easily turn to mush. I have found that cooking more than 2/3 cup at a time can be problematic because the millet at the bottom of the pot becomes gummy by the time all of the millet is cooked. But the tiny, nutritious seeds of grain expand so much during cooking that you don’t need more than 2/3 of a cup for this recipe, and if you toast the seeds in a little oil first and take care not to stir the millet once you’ve added the water you will get a fluffy result. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/01/15/science/16recipehealth/16recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "Serves 4 to 5", "recipeCuisine": "", "recipeCategory": "weekday, salads and dressings", "keywords": "black kale, carrot, millet, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 287, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "6 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "572 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 bunch of black kale (cavolo nero), 10 to 12 ounces, stemmed and washed thoroughly", "Salt to taste", "2 teaspoons canola oil, rice bran oil or extra virgin olive oil", "2/3 cup millet", "2 cups water or blanching water from the kale", "2 teaspoons extra virgin olive oil", "1/2 pound carrots, peeled and thinly sliced on the diagonal", "1/2 cup chopped cilantro", "1 tablespoon nigella seeds", "2 tablespoons fresh lemon juice", "2 teaspoons seasoned rice vinegar", "1 teaspoon sweet curry powder", "Salt and freshly ground pepper", "4 tablespoons grape seed oil, rice bran oil, canola oil or extra virgin olive oil", "1/4 cup buttermilk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Separate the kale into two unequal bunches, with about two thirds in one bunch. Wash and dry the smaller bunch, roll the leaves in paper towels and set aside. Blanch the rest in a pot of boiling salted water for 1 to 2 minutes. Remove from the pot with a slotted spoon or skimmer, transfer to a bowl of cold water, drain and squeeze out excess water. Cut the squeezed bunch of kale crosswise into thin slices and set aside. Measure out 2 cups of the blanching water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 teaspoons of oil over medium-high heat in a heavy 2- or 3-quart saucepan. Add the millet and toast, stirring, until it begins to smell fragrant and toasty, 3 to 5 minutes. Add the 2 cups of kale water. If not using the kale water add 2 cups water and salt to taste, and bring back to a boil. Reduce the heat to low, cover and simmer 25 to 30 minutes, until the liquid in the saucepan has evaporated and the grains are fluffy. Turn off the heat, place a clean dish towel over the pot and return the lid. Let sit for 10 to 15 minutes, then transfer the cooked millet to a baking sheet or a shallow pan and spread out in an even layer to cool. This helps prevent clumping."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make crispy kale with the remaining kale. Heat the oven to 300 degrees. Line 2 baking sheets with parchment. Make sure that your kale leaves are dry. Tear them into medium-size pieces and toss with the olive oil. Gently knead the leaves between your thumbs and fingers to make sure they are coated with oil. Place in an even layer on the baking sheets. Do this in batches if necessary. Place in the oven and roast for 22 to 25 minutes, until the leaves are crisp but not browned. If some of the leaves crisp before others, remove them to a bowl or sheet pan and return the remaining kale to the oven. Watch closely as once the kale browns it will taste bitter. Once the kale is crisp, season to taste with salt. Allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the dressing ingredients together in a small bowl or measuring cup, then transfer to a wide skillet. Add the millet, blanched kale, carrots, and nigella seeds and heat everything together over medium heat, stirring to combine well, until sizzling. Stir in the cilantro just before serving. Serve with the crispy kale crumbled over the top."}]}