{"@context": "http://schema.org", "@type": "Recipe", "name": "Tofu Mushroom \"Quiche\"", "description": "This is a vegan quiche filled with a savory mix of blended tofu and mushrooms. It has a deep, rich umami flavor. No eggs are necessary to bind it; the tofu stiffens up when it bakes. You can use the crust of your choice. The yeasted crust is not vegan, as it contains an egg.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/02/19/science/21recipehealth/21recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H45M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, healthy, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian, main course, mushroom, thyme, tofu, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 90}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 137, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "278 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 9- or 10-inch 1 <a href=\"http://cooking.nytimes.com/recipes/1016715-whole-wheat-yeasted-olive-oil-pastry\">yeasted whole wheat olive oil pastry</a> or gluten-free whole-grain Mediterranean pie crust", "1/2 ounce (about 1/2 cup) dried mushrooms (preferably porcinis)", "1 tablespoon plus 2 teaspoons extra virgin olive oil", "1/2 medium or 1 small onion, finely chopped", "Salt to taste", "2 to 3 garlic cloves (to taste), minced", "3/4 pound mushrooms, trimmed and diced", "1 teaspoon fresh thyme leaves, coarsely chopped, or 1/2 teaspoon dried thyme", "Freshly ground pepper to taste", "2 tablespoons dry white wine or rosé", "14 ounces firm or silken tofu", "1 tablespoon low-sodium soy sauce", "1 tablespoon miso paste", "1 teaspoon yeast extract, such as Marmite", "1 1/2 tablespoons tahini", "1/8 teaspoon cayenne"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix up the pie dough and when ready roll or press out to line a 9- or 10-inch tart pan. Set in the refrigerator to rest. Meanwhile place the dried mushrooms in a pyrex measuring cup and pour in 1 cup boiling water. Let sit for 20 minutes or longer. Set a strainer over a bowl, line it with cheesecloth or paper towels, and drain the mushrooms. Squeeze over the strainer to extract as much flavorful liquid as possible, rinse away any lingering sand, and chop medium-fine. Set aside. Measure out 1/3 cup of the mushroom broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat one tablespoon of the olive oil over medium heat in a large, heavy skillet and add the onion. Cook, stirring often, until the onion begins to soften, and add a generous pinch of salt. Continue to cook, stirring often, until the onions are tender and lightly colored, about 8 minutes. Add the garlic and cook, stirring, until it begins to smell fragrant, 30 seconds to a minute. Stir in the fresh and dried mushrooms and turn the heat up to medium-high. Cook, stirring or shaking the pan, until the mushrooms have begun to sweat and soften, about 5 minutes. Add the thyme and season to taste with salt and pepper. Continue to cook, stirring often, until the mushrooms are tender. If desired add the wine and stir to deglaze the pan. When the liquid has evaporated remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Place the tofu, soy sauce, miso, yeast extract, tahini and cayenne in a food processor fitted with the steel blade and blend the ingredients until smooth. Stop the machine and scrape down the sides of the bowl, then process again. With the machine running add 1/3 cup of the mushroom broth and process until smooth. Scrape into a large bowl, add the cooked mushrooms and onions, and stir together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the crust with the remaining olive oil and place in the oven for 10 minutes. Remove from the oven and fill with the tofu mixture. Bake 35 to 40 minutes, until the top is a rich golden brown and the filling has set. Remove from the heat and allow to sit for at least 10 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1014555-tofu-mushroom-quiche"}