{"@context": "http://schema.org", "@type": "Recipe", "name": "Bulgur With Swiss Chard, Chickpeas and Feta", "description": "Bulgur comes in one of four grades: fine (bags are often labeled #1), medium (#2), coarse (#3) and very coarse (#4). The different grinds are used for specific types of dishes. Pilafs are made with medium, coarse or very coarse bulgur. Tabbouleh and kibbe are made with fine bulgur.This is a convenient grain to keep on hand in the pantry. It’s easy to find in whole foods stores and in Middle Eastern markets. Don’t confuse it with cracked wheat, which is another product made from raw wheat berries. Because bulgur is made from precooked wheat berries, it takes only about 20 minutes to reconstitute by soaking or by simmering. It has a wonderful nutty flavor and a light texture. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/02/08/science/08recipehealth_600/08recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT1H20M", "recipeYield": "Serves four to six", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 79}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 334, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "10 grams", "proteinContent": "13 grams", "saturatedFatContent": "4 grams", "sodiumContent": "468 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 cup bulgur (medium or coarse grade)", "Salt to taste", "1/4 cup extra virgin olive oil", "1 pound Swiss chard, heavy stems removed, washed well", "4 large garlic cloves, finely chopped", "One 15-ounce can chickpeas, drained and rinsed or 1 1/2 cups cooked chickpeas", "1/4 cup chopped fresh dill or parsley", "Freshly ground black pepper to taste", "3 ounces feta cheese, crumbed or cut in small squares"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 2 cups water to a boil in a medium saucepan. Add the bulgur and salt to taste, reduce the heat, cover and simmer 20 minutes or until the water is absorbed. Remove from the heat and uncover. Place a clean dish towel over the pan, then replace the lid. Allow to sit undisturbed for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil a 2-quart baking dish. Toss the cooked bulgur with 1 tablespoon of olive oil and spread in the baking dish in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add water to a steamer pot, and bring to a boil. Place the Swiss chard in the steamer (you can use a pasta pot with an insert for this), and steam until it wilts, about four to five minutes. Drain, rinse with cold water and squeeze out the excess water with your hands. Chop coarsely and transfer to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat another tablespoon of the olive oil in a small frying pan. Add the garlic. Cook, stirring, just until fragrant and translucent, 30 seconds to a minute, and scrape into the bowl with the chard. Add the remaining 2 tablespoons of olive oil, the chickpeas and dill. Season with salt and pepper, and toss together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the chard mixture over the bulgur. Top with the feta, and gently push the feta cheese down into this mixture. Bake 30 minutes or until sizzling. Serve hot."}]}