{"@context": "http://schema.org", "@type": "Recipe", "name": "Bulgur Salad With Greens, Barberries and Yogurt", "description": "I bought some dried barberries at my Iranian market not too long ago and have been adding them to frittatas and salads. They’re tart dried fruits, about the size of currants. You can substitute dried cranberries or dried cherries for them.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/08/23/science/30recipehealth/30recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "barberries, bulgur, swiss chard, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 22}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 259, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "589 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["2 cups water", "Salt to taste", "1 cup medium bulgur", "1 generous bunch Swiss chard, about 1 pound", "1/3 cup extra virgin olive oil", "1 garlic clove, minced", "Freshly ground pepper", "2 tablespoons chopped fresh tarragon", "1 to 2 tablespoons (to taste) chopped fresh mint", "1 teaspoon za’atar", "1/2 teaspoon ground allspice", "2 to 3 tablespoons barberries or chopped dried cranberries or cherries (to taste)", "3 tablespoons fresh lemon juice", "1 cup drained yogurt or thick Greek style yogurt", "1-2 additional garlic cloves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 2 cups water to a boil in a medium saucepan. Add the bulgur and salt to taste, reduce the heat, cover and simmer 20 minutes, or until the water is absorbed. Remove from the heat, uncover and place a clean dishtowel over the pan, then replace the lid. Allow to sit undisturbed for 10 minutes. Uncover and place on a baking sheet or in a wide bowl to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, strip the chard leaves from the stems (retain the stems if they’re wide and meaty) and wash well in 2 changes of water. Steam above 1 inch of boiling water for about 2 minutes, until wilted; alternatively, blanch for about 1 minute in salted boiling water. Transfer to a bowl of cold water, then drain and squeeze out excess water, taking the chard up by the handful. Chop fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dice the chard stems. Measure out 1 cup. Heat 1 tablespoon of the olive oil over medium heat in a medium skillet and add the chard stems. Cook, stirring, for about 3 minutes, just until crisp-tender. Add 1 minced garlic clove, stir for about 30 seconds, until fragrant, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the bulgur, chopped chard, chard stems, chopped tarragon and mint, za’atar, allspice and barberries in a large bowl. Whisk together the lemon juice, salt and pepper to taste, and olive oil. Toss with the bulgur mixture. Transfer to a platter or a wide salad bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pound the remaining garlic to a paste with a pinch of salt in a mortar and pestle. Stir into the yogurt. Spoon on top of the salad and serve."}]}