{"@context": "http://schema.org", "@type": "Recipe", "name": "Oeufs A La Neige (Snow Eggs)", "description": "To prepare this specialty, you make a sweetened milk bath on which you cook oval-shaped meringues that, in theory, resemble eggs. After the so-called eggs are cooked, you combine what is left of the milk with egg yolks and prepare an English custard, or what the French choose to call a sauce anglaise. This is chilled and the eggs are floated on top. The snow-white eggs are served with a vanilla-flavored custard.", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT30M", "recipeYield": "Ten or more servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, eggs, heavy cream, sugar, gluten-free", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 262, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": null, "proteinContent": "6 grams", "saturatedFatContent": "8 grams", "sodiumContent": "136 milligrams", "sugarContent": "29 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cups milk", "1 cup heavy cream", "1 1/4 cups sugar", "1 teaspoon pure vanilla extract", "6 eggs, separated", "1/4 teaspoon salt, if desired", "1/4 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the milk and cream in a skillet and add six tablespoons of the sugar. Bring to the simmer, stirring, and let simmer until the sugar is dissolved. Add the vanilla and blend."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites until they are almost stiff. Sprinkle with six more tablespoons of sugar and the salt and continue beating until the mixture is quite stiff."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using two large spoons, mold the meringue into oval shapes and spoon the ovals on top of the simmering milk. Make a few at a time for a total of 10 or more. Cook about 30 to 40 seconds on one side and carefully turn to cook on the second side. Cook 30 to 40 seconds on the second side and remove the ovals. Drain on absorbent paper towels. Continue until all the meringue has been shaped into ovals and cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the egg yolks in a saucepan. Beat the egg yolks until they are light and lemon- colored and pour in the strained milk. Put the saucepan on the heat and simmer, stirring constantly with a wooden spoon, until the custard coats the spoon. When the spoon is coated, remove the custard immediately from the heat and strain it into a wide serving dish large enough to hold the meringue ovals in one layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine the remaining sugar with the water in a heavy saucepan. Cook until the sugar becomes caramel-colored and then dark amber in color. Take care not to burn it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before the caramel sets, pour it in a thin thread on top of the oval meringues. Serve the meringues in round-bottom dessert dishes with the custard on the bottom of each."}], "link": "https://cooking.nytimes.com/recipes/10149-oeufs-a-la-neige-snow-eggs"}