{"@context": "http://schema.org", "@type": "Recipe", "name": "Sicilian Pasta With Cauliflower", "description": "A favorite island vegetable combines with raisins and saffron to introduce a sweet element to a savory, salty mix. Cauliflower is a favorite vegetable in Sicily, though the variety used most often is the light green cauliflower that we can find in some farmers’ markets in the United States. I found the recipe upon which this is based in Clifford A. Wright’s first cookbook, “Cucina Paradiso: The Heavenly Food of Sicily.” And it is heavenly. The raisins or currants and saffron introduce a sweet element into the savory and salty mix.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/01/08/science/07recipehealth/07recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "bucatini, canned tomatoes, cauliflower, halal, healthy, high fiber, kosher, low cholesterol, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 161}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 511, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "81 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "7 grams", "proteinContent": "17 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1034 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup golden raisins or currants", "Pinch of saffron threads", "1 medium cauliflower, about 2 pounds, leaves removed and bottom trimmed", "Salt to taste", "2 tablespoons extra virgin olive oil", "2 garlic cloves, minced", "3 anchovy fillets, rinsed and chopped", "1 14-ounce can chopped tomatoes, with juice", "3 tablespoons pine nuts or chopped blanched almonds", "Freshly ground pepper to taste", "3/4 pound perciatelli (also sold as bucatini) or spaghetti", "2 tablespoons grated pecorino", "2 tablespoons slivered basil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the raisins or currants in a small bowl and cover with warm water. In another bowl combine the saffron with 3 tablespoons warm water. Let both sit for 20 minutes while you prepare the other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and salt generously. Add the cauliflower and boil gently until the florets are tender but the middle resists when poked with a skewer or knife, about 10 minutes. Using slotted spoons or tongs (or a pasta insert) remove the cauliflower from the water, transfer to a bowl of cold water and drain. Cover the pot and turn off the heat. You will cook the pasta in the cauliflower water. Cut the florets from the core of the cauliflower and cut them into small florets or crumble coarsely using a fork or your hands."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy skillet and add the garlic. Cook, stirring, until it smells fragrant, about 30 seconds to a minute, and add the anchovies and tomatoes. Turn the heat down to medium-low and cook, stirring often, until the tomatoes have cooked down and smell fragrant, about 10 minutes. Drain the raisins or currants and add, along with the saffron and its soaking liquid, cauliflower, pine nuts or almonds, and about 1/4 cup of the cooking water from the cauliflower. Season to taste with salt and pepper. Cover, turn the heat to low and simmer 10 minutes, stirring occasionally. Keep warm while you cook the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the cauliflower water back to a boil and cook the pasta al dente, following the timing instructions on the package. Check the sauce and if it seems dry add another 1/4 to 1/2 cup of the pasta cooking water. Drain the pasta and transfer to the pan with the sauce. Toss together and serve, sprinkled with pecorino and chopped basil leaves. If desired, drizzle a little olive oil over each serving."}]}