{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramel Cake", "description": "", "author": {"@type": "Person", "name": "Kim Severson"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "One layer cake", "recipeCuisine": "southern", "recipeCategory": "", "keywords": "cake flour, heavy cream, sugar, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 69}, "recipeIngredient": ["1 cup softened butter, plus more to grease pans", "3 cups cake flour", "1 teaspoon baking powder", "1/2 teaspoon salt", "2 cups sugar", "4 eggs, well beaten", "1 teaspoon vanilla", "1 cup milk", "2 1/2 cups sugar", "8 tablespoons butter", "1/2 cup heavy cream", "1/4 teaspoon kosher salt", "2 teaspoons vanilla", "1 teaspoon baking soda"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Grease three 9-inch cake pans and line with rounds of parchment or waxed paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift flour, then sift again with baking powder and salt. In a mixer, cream together butter and sugar until fluffy, about three minutes. Beat in eggs one at a time and continue to mix on medium until eggs are well incorporated. Stir in vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer on low, alternately add flour and milk, then increase speed to medium. Beat until smooth, about four or five minutes, scraping down sides of bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill each pan about three-quarters full with batter. Bake 20 to 25 minutes or until cake springs lightly when pressed with a finger. Flip cake out of pan onto paper towels or cake rack while still very warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When layers go into oven, start to make icing. Put a half-cup sugar in a large cast-iron pan and set over medium-high heat, stirring until sugar melts and begins to turn dark brown. Be careful not to let it burn. Remove pan from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter, cream, remaining sugar and salt. Over medium-high heat, bring to a boil and cook for three minutes, stirring, until it reaches about 240 degrees on a candy thermometer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and add vanilla and baking soda. Using an electric hand mixer, beat until the icing is spreadable and fluffy. Frost tops of each layer immediately, stack and then frost sides of cake."}], "link": "https://cooking.nytimes.com/recipes/1014043-caramel-cake"}