{"@context": "http://schema.org", "@type": "Recipe", "name": "Berry-Rose Crumble", "description": "If you’re wondering how to incorporate more antioxidant-rich foods into your diet, look no further. The perfume of rose water, which you can find in Middle Eastern markets, is irresistible here. Served with yogurt, this is one of my favorite breakfasts. The berries are quite juicy. If you want a thicker syrup, use corn starch or arrowroot.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/10/05/science/05recipehealth600/05recipehealth600-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves eight generously", "recipeCuisine": "", "recipeCategory": "", "keywords": "berries, oats, quinoa, dessert, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "recipeIngredient": ["2 quarts mixed strawberries, blackberries and blueberries (about 2 pounds fruit)", "2 tablespoons sugar, preferably organic", "1 tablespoon rose water", "2 teaspoons cornstarch or arrowroot (optional)", "1 batch <a href=\"http://www.nytimes.com/2010/10/04/health/nutrition/04recipehealth.html\">quinoa-oat crumble topping</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Hull the strawberries. If they’re large, cut them in half. In a large bowl, toss the fruit with the sugar, rose water and (optional) cornstarch or arrowroot. Cover and let stand for 15 to 30 minutes. Meanwhile, preheat the oven to 350 degrees, and butter a two-quart baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the fruit to the baking dish, making sure to scrape all of the liquid into the bowl. Set the baking dish on a baking sheet for easier handling, and place in the oven for 15 minutes. Remove from the oven, and spread the crumble topping over the fruit in an even layer. Return to the oven for 15 to 20 minutes until the crumble is bubbling and nicely browned. Allow to stand for at least 15 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1014092-berry-rose-crumble"}