{"@context": "http://schema.org", "@type": "Recipe", "name": "Lard and Cracklings", "description": "", "author": {"@type": "Person", "name": "Pete Wells"}, "image": null, "totalTime": "PT3H", "recipeYield": "Makes about 1½ cups lard and 1 cup cracklings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "appetizer, fall, pork fat, spices", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 112, "unsaturatedFatContent": "4 grams", "carbohydrateContent": null, "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": null, "proteinContent": "11 grams", "saturatedFatContent": "2 grams", "sodiumContent": "28 milligrams", "sugarContent": null, "transFatContent": null}, "recipeIngredient": ["1 pound pork fat, chilled leaf lard or fat back, preferably from humanely raised pork", "Salt, cayenne, paprika, black pepper, five-spice powder or other spice mix for seasoning, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the fat into ¾-inch cubes and place in a small covered saucepan set over low heat. Add ½ cup water and bring to a simmer. Stir after 30 minutes. Continue to cook, letting it bubble, and stir from time to time. When the water boils off, render for about 2 hours. The lard will clarify, and the cracklings will shrivel and shrink. As it cooks, watch and listen: turn down the heat or take the pan off the heat if it smokes or if the lard starts to brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cracklings are lightly golden and have almost stopped bubbling, remove them and drain on paper towels or a brown paper bag. Strain the lard through a cheesecloth into a jar or bowl, where it will keep, covered, in the refrigerator for several weeks. Try a crackling. If it is not crunchy and appetizing, crisp the rest on a baking sheet in a 375-degree oven for 15-20 minutes. Season if you’d like, then cool on paper towels. Cracklings, well drained and lightly covered, will keep at room temperature for at least a week."}]}