{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato-Fennel Soup With Brie Toasts", "description": "The childhood pleasure of tomato soup with a side of grilled cheese had been enshrined in my mind since I’d last had it, decades ago. A tart, bright tomato soup and a crispy sandwich with an oozing interior: no wonder they are an iconic match. This recipe, spiked with fennel and Pernod, is livelier and more sophisticated than your usual tomato soup. It has a more complex flavor, too, with the fennel bulb adding a pronounced sweetness, along with a very gentle licorice flavor brought out by the Pernod. Serve with slim croutons seasoned with fennel seeds and topped with Brie. (Here's a helpful tutorial on <a href=\"https://www.nytimes.com/video/dining/100000002141214/cutting-up-fennel.html\">how to cut up fennel</a>.)", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/03/03/dining/03TOMATOSOUP/03TOMATOSOUP-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "brie, canned tomatoes, fennel, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 134}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 309, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "7 grams", "proteinContent": "9 grams", "saturatedFatContent": "11 grams", "sodiumContent": "898 milligrams", "sugarContent": "12 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["7 tablespoons unsalted butter", "2 medium fennel bulbs, cleaned and thinly sliced, fronds chopped and reserved", "1 large onion, halved, peeled and thinly sliced", "2 teaspoons coarse kosher salt", "4 garlic cloves, finely chopped", "1/2 teaspoon chile powder", "3 tablespoons Pernod", "2 28-ounce packages or cans chopped tomatoes packed in purée (such as Pomì)", "1 cup chicken stock", "1 teaspoon black pepper", "6 baguette slices", "1 teaspoon fennel seeds", "3 ounces Brie, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 6 tablespoons butter in a large pot over medium heat. Add fennel, onion and 1/2 teaspoon salt. Toss to combine. Reduce heat to medium-low. Partly cover and cook, stirring occasionally, until vegetables are very tender, about 20 minutes. Stir in garlic and chile powder; cook 1 minute. Stir in Pernod and cook until almost completely evaporated, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in tomatoes, 1 1/2 cups water and the stock. Bring to a simmer and cook gently, uncovered, for 30 minutes. Season with 1 1/2 teaspoons salt and the black pepper. Purée soup in batches using a blender or immersion blender until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer soup back to pot over medium heat; simmer until slightly thickened, 5 to 10 minutes more. Scrape down sides and bottom of pot occasionally. Remove from heat and cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Spread bread slices on a large baking sheet. Bake until light golden, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast fennel seeds in a small skillet over medium heat until fragrant and lightly colored, 2 to 3 minutes. Melt in remaining 1 tablespoon butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven temperature to broil and position rack 6 inches from heat. Brush toasts with fennel-seed butter and top with Brie. Return to oven and broil until bubbly and golden, 1 to 3 minutes (check every minute or so to see that they are not burning). Ladle soup into bowls and top with a cheese crouton. Garnish with fennel fronds."}], "link": "https://cooking.nytimes.com/recipes/1014646-tomato-fennel-soup-with-brie-toasts"}