{"@context": "http://schema.org", "@type": "Recipe", "name": "Wheat Berries With Spinach and Spring Onion", "description": "You can use any of the ancient wheat varieties here – spelt, kamut or farro. You could also substitute other greens, like chard or beet greens, for the spinach.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/05/29/science/30recipehealth/30recipehealth-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course, spinach, spring onions, wheat berries", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 253, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "9 grams", "proteinContent": "11 grams", "saturatedFatContent": "1 gram", "sodiumContent": "941 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 cup spelt, farro or kamut", "3 cups water", "Salt to taste", "2 bunches spinach, stemmed and washed well in 2 changes of water", "2 tablespoons extra virgin olive oil", "1 medium or large spring onion or 1 bunch smaller spring onions", "2 garlic cloves, minced", "1 teaspoon each fresh thyme leaves and chopped fresh rosemary", "Salt and freshly ground pepper to taste", "1/4 cup chopped walnuts (optional)", "2 ounces crumbled feta for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the kamut, farro or spelt and cover with boiling water. Soak for 1 hour and drain (alternatively, soak overnight in water from the tap). Combine with 1 quart water in a saucepan. Bring to a boil, add salt to taste (I use about 3/4 teaspoon), reduce the heat, cover and simmer 50 minutes, or until the grains are tender and just beginning to splay at one end. Drain off excess water (use for stocks if desired) and return the grains to the pot. Cover until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wilt the spinach: Blanch for 20 seconds in salted boiling water, steam for 1 to 2 minutes, or wilt in a dry frying pan in the liquid remaining on the leaves after washing. Transfer to a bowl of cold water, drain and squeeze out excess water, taking the spinach up by the handful. Chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a medium-size skillet and add the onion. Cook, stirring often, until onion is tender and aromatic, 5 to 6 minutes, and add a generous pinch of salt and the garlic. Cook, stirring, until fragrant, about 30 seconds to a minute, and add the spinach, thyme and rosemary. Stir together for a minute, just until the spinach is coated with oil and infused with the garlic and herbs. Season to taste with salt and pepper and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon about 1/2 cup of kamut or spelt into bowls or onto plates. Top with the spinach and onion. Drizzle on a little olive oil, top with walnuts and crumbled feta, and serve."}], "link": "https://cooking.nytimes.com/recipes/1014765-wheat-berries-with-spinach-and-spring-onion"}