{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Gnocchi, Four Ways", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2013/02/24/magazine/24eat2_tomatosauce/24eat2_tomatosauce-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "flour, potato, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 162}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 203, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "0 grams", "sodiumContent": "442 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds starchy potatoes", "Salt and pepper", "1/2 to 3/4 cup all-purpose flour, plus more as needed."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Bake potatoes until tender, about an hour. Immediately split them open to let the steam escape. When you can handle the potatoes, scoop out their flesh."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and salt it. Pass potato flesh through a ricer or food mill, and season to taste. Sprinkle 1/4 cup flour on a clean counter or cutting board, and knead the potatoes with it, sprinkling in the remaining 1/4 cup flour, until the dough just comes together. Pinch off a piece of the dough, and boil it to make sure it will hold its shape. If it does not, knead in a bit more flour (no more than necessary), and try again; the gnocchi will float to the top and look a little raggedy when ready."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll a piece of the dough into a rope about 1/2-inch thick, then cut the rope into 1/2-inch lengths. Score each piece by rolling it along the tines of a fork; as each piece is ready, put it on a baking sheet lined with parchment or wax paper; do not allow the gnocchi to touch one another."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the gnocchi to the boiling water a few at a time, and gently stir; adjust the heat so the mixture doesn’t boil too vigorously. A few seconds after they rise to the surface, the gnocchi are done; remove them with a slotted spoon or mesh strainer, and finish with any of the following sauces:<br/><br/>\n\n<strong>Tomato Sauce</strong>: Cook a small chopped onion in olive oil until soft. Add minced garlic, 3 to 4 cups of chopped tomatoes, canned or fresh, and salt and pepper. Cook at a steady bubble until ‘‘saucy.’’ If the sauce becomes too thick, add a splash of the gnocchi cooking water before serving. Garnish with torn basil and/or grated Parmesan.<br/><br/>\n\n<strong>Brown Butter, Sage, and Parmesan</strong>: Put 4 tablespoons butter and a handful of fresh sage leaves (40 wouldn’t be too many) in a skillet over medium heat. Cook until the butter is light brown and the sage is sizzling, about 3 minutes. Toss with the gnocchi, some of their cooking water and loads of grated Parmesan.<br/><br/>\n\n<strong>Olive Oil and Garlic</strong>: Put at least a tablespoon of minced garlic in a puddle of olive oil, along with (optional) red-pepper flakes and/or chopped anchovies. Cook until the garlic just turns golden (but no more than that). Toss with the gnocchi, some of their cooking water and plenty of chopped parsley.<br/><br/>\n\n<strong>Bacon and Cream</strong>: Cook some chopped bacon, prosciutto or pancetta in a bit of olive oil over medium-low heat until nearly crisp. Stir in 1/2 cup heavy cream and a lot of pepper. Let the cream thicken slightly before adding the gnocchi."}], "link": "https://cooking.nytimes.com/recipes/1014559-potato-gnocchi-four-ways"}