{"@context": "http://schema.org", "@type": "Recipe", "name": "Pulled Pork Sandwiches", "description": "This recipe takes a good deal of time, but it yields a lot of sandwiches, more than enough for a sloppy, spicy dinner party feast. You’ll roast a dry-rubbed pork shoulder in the oven until it’s pull-apart tender, 3 or 4 hours that you can spend doing other things while your kitchen fills with the aroma of the cooking meat. Then you’ll assemble a quick slaw and simmer a tangy barbecue sauce for about 10 minutes before putting it all out on the table with soft rolls. Serve the combination warm, at any time of the year, for a weekend project well worth an afternoon’s work.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/04/03/dining/03COOKING-PULLEDPORKSANDWICH/03COOKING-PULLEDPORKSANDWICH-mediumThreeByTwo440.jpg", "totalTime": "PT6H", "recipeYield": "8 to 10 servings", "recipeCuisine": "southern", "recipeCategory": "lunch, project, sauces and gravies", "keywords": "boneless pork shoulder, cabbage, spices, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 953}, "recipeIngredient": ["1 1/2 teaspoons whole coriander seed", "1 1/2 teaspoons whole cumin seed", "1 1/2 teaspoons black peppercorns", "2 1/4 teaspoons coarse kosher salt", "1 1/2 teaspoons dry mustard powder", "1 1/2 teaspoons chile powder", "3 tablespoons dark brown sugar", "3 1/2 pounds boneless pork shoulder", "Hamburger or brioche buns, for serving", "1 1/2 cups ketchup", "1/4 cup packed dark brown sugar", "2 tablespoons molasses", "2 garlic cloves, minced or grated", "1/4 cup cider vinegar", "2 tablespoons Worcestershire sauce", "2 teaspoons sweet or hot paprika", "1 teaspoon black pepper", "1 teaspoon dry mustard powder", "Pinch of cayenne", "Dash of hot sauce, more to taste", "1 small head green cabbage, outer leaves removed, shredded (about 1 1/2 pounds)", "1/2 small red onion, thinly sliced", "1 large jalapeño, seeded if desired, thinly sliced", "3/4 cup mayonnaise", "2 tablespoons cider vinegar", "2 tablespoons extra-virgin olive oil", "1 teaspoon coarse kosher salt", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the spice rub for the pork: In a dry, small skillet over medium-low heat, toast coriander, cumin and peppercorns until fragrant, 1 to 2 minutes. Using a spice grinder or mortar and pestle, grind toasted spices into a fine powder. Transfer to a bowl and mix with salt, mustard powder, chile powder and sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If your roast is tied up, untie it. Massage meat generously with spice rub. If you have time, let meat rest for an hour or two at room temperature, or refrigerate for several hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Place pork in a baking pan and roast for 3 to 4 hours or until meat is pull-apart tender and internal temperature reads 200 degrees on a meat thermometer. Let meat cool for at least 30 minutes before pulling it apart and shredding with your hands or two forks. (This works best when the meat is warm but not hot.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the barbecue sauce: Combine ingredients in a medium pot. Simmer over medium-low heat for 15 to 20 minutes, stirring occasionally, until sauce has deepened in color. Season with more hot sauce if you like. Add two-thirds of the sauce to meat and toss to coat, adding more sauce as needed. (Any leftover sauce will keep for at least 2 weeks in the refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the slaw: Combine cabbage, onion and jalapeño in a large bowl. In a small bowl, whisk together mayonnaise, vinegar, olive oil, salt and pepper. Add dressing to cabbage and toss well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve pulled pork with slaw, buns and hot sauce on the side, letting people assemble their own sandwiches."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Small-Batch Pulled Pork", "description": "Melissa Clark demonstrates a way to make tender pulled pork slathered in a tangy barbecue sauce for a smaller crowd.", "thumbnailUrl": "https://static01.nyt.com/images/2017/04/03/dining/03COOKING-PULLEDPORKSANDWICH/03COOKING-PULLEDPORKSANDWICH-mediumThreeByTwo440.jpg", "uploadDate": "2013-05-10T18:06:03.000Z", "duration": "PT2M40S"}}