{"@context": "http://schema.org", "@type": "Recipe", "name": "Crème Fraîche Cheesecake With Sour Cherries", "description": "This light cheesecake bridges the gap between those who love their cheesecakes tall and dense, straight out of Lindy’s, and others who prefer a daintier cake, made airy with farmer’s cheese or ricotta. Here, you’ll use cream cheese, goat cheese and crème fraîche to concoct a light, fluffy cheesecake that isn’t too sweet, making it the perfect platform to show off a bunch of summer cherries, simmered in sugar. Or you could skip the cherries and eat it plain, or drizzle over some honey and toasted nuts. ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/04/dining/creme-fraiche-cheesecake-cherries/creme-fraiche-cheesecake-cherries-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "One 9-inch cheesecake", "recipeCuisine": "", "recipeCategory": "", "keywords": "cream cheese, crème fraîche, goat cheese, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 110}, "recipeIngredient": ["1 1/2 cups cream cheese", "1/2 cup fresh goat cheese", "1/2 cup sugar", "1 1/2 cups crème fraîche", "1 teaspoon vanilla extract", "1/4 teaspoon black pepper", "4 large eggs", "2/3 cup sugar", "2 pints sour cherries, pitted", "2 teaspoons balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cheesecake, heat the oven to 325 degrees. Wrap the bottom of a 9-inch springform pan with foil and place on a baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer, beat the cream cheese and goat cheese until very smooth. Add the sugar and continue beating until no lumps remain. Beat in the crème fraîche, vanilla and pepper. Beat in the eggs one at a time, scraping down the sides of the bowl between additions, and beat until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the mixture into the pan and bake for 10 minutes, then reduce the temperature to 250 degrees and bake until the cake is just set (it will still wobble a little in the middle), 45 to 60 minutes. Transfer the pan to a wire rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cheesecake is cooling, make the cherry topping. Pour the sugar and 2/3 cup water in a heavy-bottomed saucepan over medium heat. Cook until the sugar has dissolved and the syrup has thickened, 5 to 8 minutes. Add the cherries and balsamic vinegar and cook, stirring occasionally, until the cherries soften and release their juices, 2 to 3 minutes. Use a slotted spoon to transfer the cherries to a bowl. Continue cooking the liquid in the pan until the sauce reduces by half, about 10 minutes. Take the pan off the heat and stir the cherries and any juice from the bowl back in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a knife around the edge of the pan to loosen the cake from the pan before unmolding and serving with the cherry topping."}]}