{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Cabbage, Tofu and Red Pepper", "description": "Start cooking the rice or quinoa that you will serve this with, prep your vegetables and make the stir-fry. The prep is the most time-consuming but there aren’t too many ingredients. You can be sitting down about 35 minutes after you begin. <br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/02/05/science/08recipehealth/08recipehealth-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick", "keywords": "cabbage, firm tofu, red pepper, dairy-free, gluten-free, healthy, kosher, low cholesterol, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 604}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 251, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "3 grams", "proteinContent": "16 grams", "saturatedFatContent": "3 grams", "sodiumContent": "497 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["12 ounces firm tofu", "1/2 cup chicken stock or vegetable stock", "2 tablespoons soy sauce", "1/2 teaspoon sugar", "1 tablespoon rice wine vinegar or dry sherry", "2 teaspoons sesame oil", "1 teaspoon cornstarch", "2 tablespoons peanut oil, rice bran oil or grape seed oil", "1 tablespoon minced ginger", "2 large garlic cloves, minced", "1/2 medium cabbage, chopped (about 1/2 pound, 5 cups chopped)", "1 red pepper, cut in 2-inch long julienne", "Salt and freshly ground pepper to taste", "1/4 cup broken walnuts", "Cooked rice or quinoa for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tofu into dominoes and drain between paper towels. In a small bowl or measuring cup combine the stock, 1 tablespoon of the soy sauce, the sugar, rice wine or sherry, and the sesame oil. Remove 1 tablespoon to a small bowl and stir in the cornstarch. Stir until it has dissolved. Have all the ingredients within arm’s length of your pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or 12-inch steel skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in 1 tablespoon of the oil by adding it to the sides of the pan and swirling the pan, then add the  tofu and stir-fry until golden, about 3 minutes. Add 1 tablespoon soy sauce (or to taste), toss together for a few seconds, and transfer to a plate. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl in the remaining oil, add the garlic and ginger to the wok and stir-fry for no more than 10 seconds. Add the red pepper and stir-fry for 1 minute, or until it begins to soften, and add the cabbage and walnuts. Stir-fry for 1 minute, add salt and pepper to taste, and stir-fry for another 1 to 2 minutes, until crisp-tender. Return the tofu to the wok, stir in the  walnuts and the stock/soy sauce mixture and stir-fry for another minute, until it has just about evaporated. Stir in the cornstarch mixture and stir-fry until the ingredients are lightly glazed. Remove from the heat and serve with quinoa or rice."}]}