{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole-Wheat Focaccia", "description": "Focaccia is a flatbread, not unlike a very thick-crusted pizza. It’s an easy dough to put together. It’s a great vehicle for all kinds of vegetables, just as pizza is. Three variations on the flour mix follow the recipe; you can use more whole-wheat flour or less than is called for in this recipe, which uses half whole-wheat and half all-purpose. When I use Community Grains whole-wheat flour, a California flour made from ancient strains of wheat that is milled in such a way that it is very fine but retains all of its nutrients, I can get away with using a lot. Coarser whole-wheat flours are best used in combination with all-purpose.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/05/14/science/13recipehealth2/13recipehealth2-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "1 large focaccia or 2 smaller focacce, 12 to 15 pieces", "recipeCuisine": "", "recipeCategory": "project", "keywords": "appetizer, dairy-free, halal, healthy, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 55}, "recipeIngredient": ["2 teaspoons (8 grams) active dry yeast", "1 teaspoon (5 grams) sugar", "1 1/2 cups (340 grams) lukewarm water", "2 tablespoons (25 grams) olive oil, plus 1 to 2 tablespoons (25 grams) for drizzling", "250 grams (approximately 2 cups) whole-wheat flour", "200 to 220 grams (approximately 1 2/3 to 1 3/4 cups) unbleached all-purpose flour or bread flour, plus additional as needed for kneading", "1 3/4 teaspoons (13 grams) salt", "Coarse sea salt", "2 to 4 tablespoons chopped fresh rosemary, thyme or sage", "Pitted black olives", "Roasted red peppers, diced or sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a standing mixer, or in a large bowl, dissolve the yeast and sugar in the water. Add 2 tablespoons (25 grams) olive oil, the whole-wheat flour, 200 grams of the all-purpose flour and salt and mix together briefly using the paddle attachment. Change to the dough hook and beat for 8 to 10 minutes at medium speed, adding flour as necessary. The dough should eventually form a ball around the dough hook and slap against the sides of the bowl as the mixer turns; it will be sticky. Remove from the bowl, flour your hands and knead the dough for a minute on a lightly floured surface, and shape it into a ball. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If kneading the dough by hand, dissolve the yeast in the water with the sugar as directed. Stir in the olive oil, whole-wheat flour, salt and all-purpose flour by the half-cup, until the dough can be scraped out onto a floured work surface. Knead, adding flour as necessary, for 10 minutes, until the dough is elastic and smooth. Shape into a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and dry your bowl and oil lightly with olive oil. Place the dough in it, rounded side down first, then rounded side up. Cover tightly with plastic and let rise in a warm spot for 1 1/2 to 2 hours, or in the refrigerator for 4 to 8 hours, until doubled. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch down the dough. Cover with lightly oiled plastic and let the dough rest for 15 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees, preferably with a baking stone in it. Line a sheet pan with parchment and oil generously. Roll or press out the dough into a rectangle the size of the sheet pan. To do this efficiently, roll or press out the dough, stop and wait 5 minutes for the gluten to relax, then roll or press out again, and repeat until the dough reaches the right size. Cover with a damp towel and let rest for 30 minutes. Just before baking, use your fingertips to dimple the dough all over, and drizzle on a tablespoon or two of olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, setting the pan on top of the baking stone (if using), for 20 to 25 minutes, until deep golden brown. Let rest for at least 10 minutes before serving, or allow to cool completely."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Simple Toppings", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": " Sprinkle the top, once you’ve dimpled it, with your choice of: \nCoarse sea salt; 2 to 4 tablespoons chopped fresh rosemary, thyme or sage; Pitted black olives; Roasted red peppers, diced or sliced"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Filled Focaccia", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "When the bread is done and has cooled, cut in half laterally (or cut individual squares laterally). Fill with any of the toppings listed this week. Or try this: blanched fresh spinach, squeezed dry, chopped, seasoned with garlic and olive oil and mixed with softened goat cheese. Warm in a medium oven or lightly toast in a toaster oven before serving."}]}]}