{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Fried Baby Artichokes With Gremolata", "description": "Here is an appetizer course to beat the band. Baby artichokes dipped in seasoned flour, fried and served with a gremolata of parsley, garlic, lemon zest, orange zest and capers. Snap off a few of the tough, dark exterior leaves of the little artichokes until the pale green centers are visible. Then cut a half-inch or so off the tops of each artichoke and trim the stem end with a paring knife. Cut them lengthwise into halves or quarters and put them in a bowl of water with a good squeeze of lemon juice to prevent them from turning brown. This can be done an hour or two before cooking. Use olive oil to fry them if you’re feeling extravagant, or a frugal combination of olive and vegetable oils.   ", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/03/11/dining/11friedartichoke/11friedartichoke-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "quick", "keywords": "all-purpose flour, baby artichokes, buttermilk, appetizer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 29}, "recipeIngredient": ["12 baby artichokes (about 11/2 pounds)", "2 cups buttermilk", "1 cup all-purpose flour ", "Pinch cayenne", "Salt and pepper", "Olive oil or vegetable oil, for frying", "1/2 cup chopped parsley", "1 small garlic clove, finely chopped", "1 teaspoon finely chopped or grated lemon zest", "1 teaspoon finely chopped or grated orange zest", "1 tablespoon roughly chopped capers", "Lemon wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove dark tough exterior leaves from artichokes. Trim stem end and cut off top of each artichoke, then cut in half lengthwise. Put artichoke halves in a bowl and cover with buttermilk. Leave to soak for 5 to 10 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together flour, cayenne, 1 teaspoon salt and 1/2 teaspoon pepper. Drain artichokes, dip in seasoned flour to coat and put on a plate in one layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 1/2 inch oil in a wide skillet and place over medium-high heat. When oil is wavy, carefully slip in artichokes one at a time, taking care not to crowd the pan. (Fry in batches if necessary.) Let fry gently until one side is well browned, about 2 minutes, then turn over and brown other side. Drain on paper towels. Sprinkle with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the gremolata: Combine parsley, garlic, lemon zest, orange zest and capers. Put fried artichokes on a platter and sprinkle generously with the mixture. Serve immediately, with lemon wedges."}]}