{"@context": "http://schema.org", "@type": "Recipe", "name": "Barley and Herb-Stuffed Vegetables", "description": "This dish is based on a Turkish stuffing for vegetables, a delicate sweet-savory rice mixture seasoned with allspice, cinnamon, parsley, and dill or mint. I decided to use barley instead of rice for a heartier dish. Once stuffed, the vegetables are gently cooked in a mixture of water and oil. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/09/02/health/02recipehealth/02recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves six", "recipeCuisine": "turkish", "recipeCategory": "weekday", "keywords": "appetizer, healthy, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 14}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 239, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "5 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "741 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["6 medium red or yellow bell peppers, or 2 to 2 1/2 pounds summer squash large ones are best; alternately, use a mixture", "1 onion, finely chopped", "2 to 4 garlic cloves to taste, finely chopped", "1 tablespoon extra virgin olive oil", "2 tablespoons pine nuts", "2 tablespoons currants or golden raisins, soaked for 5 minutes in hot water", "1 teaspoon ground cinnamon", "1 teaspoon ground allspice", "1 teaspoon sugar", "2 1/2 cups cooked barley (1 cup uncooked)", "Salt", "freshly ground pepper", "1/2 cup finely chopped flat-leaf parsley", "1/4 cup finely chopped dill or mint", "1/2 cup water", "2 tablespoons olive oil", "2 tablespoons fresh lemon juice", "Lemon wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away the tops of the peppers, then gently remove the seeds and membranes. If using squash, cut into 2-inch lengths. With a grapefruit spoon, scoop out the middle to within about 1/2 inch of the edges, leaving about 1/2 inch on the bottom."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, wide saucepan or lidded skillet. Add the onion and pine nuts. Cook, stirring, until the onion is tender and beginning to color, about eight minutes. Add the garlic. Cook, stirring, until fragrant, 30 seconds to a minute. Stir in the currants or yellow raisins, cinnamon, allspice and sugar. Stir together, then add 1/2 cup water. Cook, stirring, until most of the liquid has evaporated, about five minutes. Add the barley, salt to taste and some pepper. Remove from the heat, and stir in the herbs. Taste and adjust salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stuff the peppers and/or squash with the barley mixture. Stand the vegetables in a wide, lidded pan. Mix together the water, olive oil and lemon juice, and pour over and around the vegetables. Bring to a simmer, and cover the pan. Simmer for 40 to 50 minutes until the vegetables are very tender and there is just a small amount of liquid and oil in the pan. Remove the lid, and allow to cool in the pan. Arrange on a platter, drizzle any liquid from the pan over the filling, garnish with lemon wedges and serve."}]}