{"@context": "http://schema.org", "@type": "Recipe", "name": "Gazpacho sans Bread", "description": "The base for this gazpacho is almost classic. It differs from traditional Andalusian gazpacho only in that it contains no bread, which is what gives the authentic dish its unique texture. But the flavor is the same – ripe tomato blended with vinegar, onion, garlic, and olive oil. Keep it in a pitcher in the refrigerator and enjoy a few days of soup.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/08/03/health/05recipehealth/05recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 55}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 123, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "821 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["2 slices red or white onion ", "2 pounds ripe tomatoes", "2 to 3 garlic cloves, to taste, halved, green germ removed ", "2 tablespoons olive oil", "1 to 2 tablespoons sherry vinegar or wine vinegar (to taste)", "1/2 to 1 teaspoon sweet paprika (to taste)", "1/2 to 1 cup ice water, depending on how thick you want your soup to be", "Salt and freshly ground pepper", "1/2 cup finely chopped cucumber (more to taste)", "1/2 cup finely chopped tomato (more to taste)", "1/2 cup finely chopped green or yellow pepper", "1/2 cup finely chopped celery", "Slivered fresh basil or chopped fresh parsley for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the onion slices in a bowl, cover with cold water and add a few drops of vinegar. Let sit for 5 minutes while you prepare the remaining ingredients. Drain and rinse with cold water. Cut in half or into smaller pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the tomatoes, garlic, onion, olive oil, vinegar, paprika, and salt in a blender and blend until smooth. Taste and adjust seasonings. Pour into a bowl or pitcher, thin out as desired with water, cover and chill for several hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the remaining ingredients and toss together in a large bowl. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the chopped vegetables into soup bowls and pour or ladle in the gazpacho. Garnish with basil chiffonade or chopped fresh parsley, and serve."}], "link": "https://cooking.nytimes.com/recipes/1014948-gazpacho-sans-bread"}