{"@context": "http://schema.org", "@type": "Recipe", "name": "Sprouted Brown Rice Bowl With Carrot and Hijiki", "description": "Sprouting any grain increases its nutritional value by making its nutrients more bio-available, among them calcium. But it’s the flavor and texture of this new sprout that have gotten me hooked. If you’ve been hard pressed to get your family to embrace brown rice, this may be the way to go. Julienne carrots with hijiki seaweed is a traditional Japanese combination. Here I’ve added some tofu to bulk up the protein. Hijiki is an excellent source of iodine, vitamin K, folate and magnesium; the seaweed is soaked and simmered before cooking with the carrot and aromatics.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/04/12/science/11recipehealth/11recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "Serves three to four", "recipeCuisine": "asian", "recipeCategory": "dinner, weekday", "keywords": "carrot, firm tofu, sprouted brown rice, healthy, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 358, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "6 grams", "proteinContent": "14 grams", "saturatedFatContent": "2 grams", "sodiumContent": "331 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1/2 ounce (about 1/2 cup) dried hijiki", "1 tablespoon soy sauce, preferably tamari more to taste", "2 teaspoons mirin", "1 tablespoon peanut oil or canola oil", "1/2 pound firm tofu, cut in 1/2-by-1-inch dominoes", "1 tablespoon plus 1 teaspoon shredded or minced ginger", "1/2 pound (2 large) carrots, cut in 2- or 3-inch long julienne", "Salt to taste optional", "1 1/2 tablespoons toasted sesame seeds", "3 cups cooked sprouted brown rice", "1 tablespoon dark sesame oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the hijiki in a medium bowl, and cover with water. Soak 15 minutes, and drain. Place in a medium saucepan, and add just enough water to cover, along with 2 teaspoons of the soy sauce. Bring to a boil, reduce the heat and simmer 15 minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the remaining soy sauce and mirin in a small bowl, and place within reach of your wok or pan. Heat a 14-inch flat-bottomed wok or 12-inch steel skillet over high heat until a drop of water quickly evaporates from the pan. Swirl in the peanut or canola oil by adding it to the sides of the pan and then tilting the pan side to side. Add the tofu and stir-fry until lightly colored, one to two minutes. Add the ginger, and stir-fry for no more than 10 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the carrots, and stir-fry for one minute until they begin to soften. Add the hijiki, soy sauce and mirin. Continue to stir-fry for another two to three minutes until the carrots are crisp-tender. Stir in the sesame oil and rice, and toss together for a minute or two, pressing the rice into the sides of the wok before scooping and stirring. Transfer to a platter, sprinkle with sesame seeds and serve."}]}