{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach Gnocchi", "description": "Gnocchi are Italian dumplings. Classic gnocchi are made with potatoes and flour, but there are variations, like these considerably lighter Florentine gnocchi made with spinach and ricotta. I serve them with a simple marinara sauce. They are also good simply tossed with a little butter or olive oil and sage.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/12/24/health/27recipehealth-pic/27recipehealth-pic-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "60 1-inch gnocchi, serving 6", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "all-purpose flour, ricotta, spinach, halal, healthy, kosher, low sugar, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "recipeIngredient": ["1 1/2 pounds bunch spinach, stemmed and thoroughly cleaned, or 3/4 pound baby spinach", "Salt and freshly ground pepper to taste", "2 tablespoons unsalted butter or extra virgin olive oil", "8 ounces ricotta (1 cup)", "1/3 cup all-purpose flour (about 45 grams)", "2 eggs, beaten", "Freshly grated nutmeg", "2 ounces Parmesan, grated (1/2 cup)", "Marinara sauce for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch the spinach for no more than 20 seconds in salted boiling water. Transfer to a bowl of cold water, drain and squeeze out excess water. Chop fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the butter or olive oil over medium heat in a heavy saucepan and add the spinach, salt (remembering that you will be adding Parmesan, which is salty), pepper, ricotta and flour. Stir together and let the mixture sizzle while you stir constantly for 5 minutes. Remove from the heat and beat in the eggs, nutmeg and Parmesan. The mixture should be stiff. Transfer to a bowl, cover well and refrigerate for 2 hours or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a sheet pan with parchment and dust generously with flour. Remove the gnocchi mixture from the refrigerator. There are a few ways to form the gnocchi. You can scoop out small balls by the rounded teaspoon and place on the parchment (they will be sticky so use another spoon to scrape them out of the measuring spoon), or you can divide the dough into 4 pieces and on a floured surface, with lightly floured hands, gently roll each piece into a coil about 3/4 inch wide.  Cut into 1-inch pieces and place on parchment-lined baking sheet. Alternatively, place the mixture in a pastry bag fitted with a 5/8 inch round tip and pipe 1-inch blobs onto the parchment. Don’t worry if the dough is sticky. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and salt generously. Meanwhile heat the tomato sauce in a saucepan. Adjust the heat under the water so that it is boiling gently and drop in the gnocchi, about 10 at a time. If they stick to the parchment or your hands lightly flour your fingers and sprinkle a little flour over the gnocchi. Once they float to the top simmer for 4 minutes, then move them to the pan of sauce with a slotted spoon. Serve with the sauce and additional Parmesan to taste. "}], "link": "https://cooking.nytimes.com/recipes/1014434-spinach-gnocchi"}