{"@context": "http://schema.org", "@type": "Recipe", "name": "Mark Bittman's Pasta With Clams", "description": "Here is a simple, elegant take on pasta with clam sauce that serves as a beautiful, light dinner with salad, perfect in advance of a movie night or reading session on the couch with family or friends. The key to its success is using less pasta that you generally might, which helps place the focus of the dish squarely on the meaty clams.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2013/04/24/dining/24FLEX1/24FLEX1-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, quick, pastas", "keywords": "garlic, littleneck clam, pasta, low-sodium, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 334}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 551, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "69 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "3 grams", "proteinContent": "30 grams", "saturatedFatContent": "2 grams", "sodiumContent": "790 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["24 to 48 littleneck clams (the amount depends on size and your budget, or luck; in any case, more is better), scrubbed", "Salt (probably not much) and pepper to taste", "12 ounces long pasta, like spaghetti or linguine", "1/4 cup olive oil, or more", "1/4 teaspoon red pepper flakes, or to taste", "2 cloves sliced garlic, or to taste", "Chopped fresh parsley for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the clams in a covered pot (a glass top is very nice, voyeuristically speaking). You don’t need any liquid other than what the clams will release. Meanwhile, bring a large pot of water to a boil and salt it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the clams open — it could take as little as 10 minutes — uncover and cool. Take the meat out and strain and reserve the liquid; make sure to leave any sand behind. Chop the clams if they’re big."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the pasta in the boiling salted water. Put 1/4 cup olive oil in a deep skillet over medium heat. When the oil is warm, add the red pepper flakes and garlic and cook for about 30 seconds. Add the clams and continue to cook, stirring, for about a minute. Add about 1/2 cup of the reserved clam liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the pasta when it’s nearly done and stir it into the clams. Cook, stirring, until the pasta is tender and the mixture is saucy. Add more clam-cooking liquid (or hot water or white wine), if necessary. Taste and adjust seasoning, adding a little more oil if you like. Garnish, and serve."}], "link": "https://cooking.nytimes.com/recipes/1014678-mark-bittmans-pasta-with-clams"}