{"@context": "http://schema.org", "@type": "Recipe", "name": "Tunisian Style Baked Cauliflower Frittata", "description": "In the authentic version of this frittata there is a lot more olive oil, as well as chopped hard-boiled eggs. This one is lighter and simpler. It is great for lunch or dinner and keeps well in the refrigerator.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/01/08/science/10recipehealth/10recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 6", "recipeCuisine": "african", "recipeCategory": "easy, lunch", "keywords": "cauliflower, eggs, onion, gluten-free, halal, healthy, kosher, low-sodium, low sugar, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 108}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 177, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "11 grams", "saturatedFatContent": "3 grams", "sodiumContent": "421 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 medium head cauliflower (about 1 1/4 pounds), trimmed of leaves, bottom of the stem trimmed away", "2 tablespoons extra virgin olive oil", "1 small onion, finely chopped", "2 garlic cloves, minced", "8 eggs", "Salt and freshly ground pepper to taste", "1/2 cup finely chopped parsley", "2 teaspoons ground caraway seeds", "2 tablespoons freshly grated Parmesan", "1/2 teaspoon harissa dissolved in 1 teaspoon water, or 1/4 teaspoon cayenne", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Place 1 tablespoon of the olive oil in a 2-quart casserole, preferably earthenware or in a 9-inch cast iron skillet, and brush the bottom and sides of the dish with the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and salt generously. Add the cauliflower and boil gently until very tender, about 15 minutes. If you prefer, you can cut up the cauliflower and steam it for 15 minutes. Using slotted spoons or tongs remove the cauliflower from the water (or from the steamer), transfer to a bowl of cold water and drain. Cut the florets from the stem and mash into little pieces with a fork. You should have about 3 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil over medium heat in a large, heavy skillet and add the onion. Cook, stirring, until the onion softens, about 5 minutes. Stir in the garlic, stir together for about 30 seconds and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the eggs in a large bowl. Season with salt and freshly ground pepper to taste. Stir in the cauliflower, onion and garlic, parsley, ground caraway and Parmesan. Make sure the harissa is dissolved in the water if using, and stir in; otherwise stir in the cayenne. Scrape into the casserole dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven and bake 40 minutes, or until set. Allow to cool for at least 10 minutes before serving. In Tunisia these frittatas are served at room temperature, but you can also serve it hot."}], "link": "https://cooking.nytimes.com/recipes/1014472-tunisian-style-baked-cauliflower-frittata"}