{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin Seed Dukkah", "description": "Because I associate pumpkin seeds with Mexican food, I decided to add some mild chili powder to this mix. You can substitute Aleppo pepper if you want to keep with the Mediterranean theme. I love this mildly spicy, nutty dukkah with everything, including on its own.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/04/30/science/01recipehealth/01recipehealth-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "1 cup", "recipeCuisine": "african", "recipeCategory": "easy, quick, condiments", "keywords": "appetizer, dairy-free, gluten-free, halal, healthy, kosher, low calorie, low-carb, low cholesterol, low-fat, low-sodium, low sugar, nut-free, vegan, vegetarian, pumpkin seeds, seeds", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 139, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "62 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup hulled pumpkin seeds", "2 tablespoons lightly toasted sesame seeds", "2 tablespoons coriander seeds", "1 tablespoon cumin seeds", "2 teaspoons nigella seeds", "1 teaspoon mild chili powder or Aleppo pepper", "1/2 teaspoon kosher salt or coarse sea salt (or to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a medium skillet over medium-high heat and add the pumpkin seeds. Toast, shaking the pan or stirring the seeds, until they pop. Remove from the skillet and allow to cool completely in a bowl. Turn the heat to medium and toast the sesame seeds, then the coriander seeds, then the cumin seeds, toasting just until fragrant and removing as soon as they are toasted. Allow all of the seeds to cool completely. Grind half the pumpkin seeds and all of the sesame seeds briefly in a spice mill and add to the bowl with the remaining pumpkin seeds. When the coriander and cumin have cooled, grind to a powder and add to the pumpkin seeds and sesame seeds. Add the nigella seeds, chili powder and salt and mix together. Transfer to a jar and keep for up to a month in the freezer."}], "link": "https://cooking.nytimes.com/recipes/1014700-pumpkin-seed-dukkah"}