{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork and Portobello Burgers", "description": "This is a new-age version of a veggie burger (as in half and half, not a burger made from vegetables and grain), which you might also think of as a stuffed mushroom. It’s terrific, hearty, unusual and really cool: a portobello filled with sausage meat and grilled. In this instance, a broiler will work, as will a skillet.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2013/05/29/dining/20130529-FLEX-slide-L71T/20130529-FLEX-slide-L71T-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, quick, burgers", "keywords": "ground pork, portobello, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 81}, "recipeIngredient": ["1 pound ground pork", "1 tablespoon minced garlic", "1 teaspoon minced fresh rosemary, fennel seed or parsley", "Salt and ground black pepper", "4 large portobello mushroom caps, stems removed", "Olive oil", "4 burger buns", "Any burger fixings you like"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a grill; the heat should be medium-high and the rack about 4 inches from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the ground pork, garlic, rosemary and a sprinkle of salt and pepper. Use a spoon to lightly scrape away the gills of the mushrooms and hollow them slightly. Drizzle the mushrooms (inside and out) with olive oil and sprinkle with salt and pepper. Press 1/4 of the mixture into each of the hollow sides of the mushrooms; you want the meat to spread all the way across the width of the mushrooms. They should look like burgers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the burgers, meat side down, until the pork is well browned, 4 to 6 minutes. Flip and cook until the top side of the mushrooms are browned and the mushrooms are tender, another 6 to 8 minutes. If you like, use an instant-read thermometer to check the interior temperature of the pork, which should be a minimum of 145 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the burgers on buns (toasted, if you like) with any fixings you like."}], "link": "https://cooking.nytimes.com/recipes/1014769-pork-and-portobello-burgers"}