{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Yellow Lentils with Quinoa", "description": "This lentil dish is inspired by Mark Bittman’s revelatory article and dal recipes that ran in The New York Times Magazine on Dec. 2, 2012. I didn’t have a fresh green chile in the fridge so I used a little cayenne instead to spice it up. I wanted to introduce some color so I added half of a red bell pepper that was in my refrigerator to the mix. I am making the cilantro optional because I didn’t have any even though normally I would have used it; the dish was fine without it.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/01/01/science/31recipehealth/31recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegan, vegetarian, main course, quinoa, spices, yellow lentils, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 266}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 270, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "6 grams", "proteinContent": "12 grams", "saturatedFatContent": "1 gram", "sodiumContent": "324 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup regular blond quinoa", "1/4 cup red quinoa", "1 1/4 cups water", "1/2 to 3/4 teaspoon salt, to taste", "1 cup brown or split yellow lentils (toor dal), rinsed", "1 teaspoon minced fresh ginger", "1 1/2 teaspoons turmeric", "1/2 medium onion (intact), peeled", "Salt to taste", "1 1/2 tablespoons fresh lime juice or 1/4 cup tamarind water (made from soaking 1 tablespoon tamarind paste in warm water for 10 minutes; optional)", "2 tablespoons grape seed oil, canola oil, safflower oil or sunflower oil", "1/2 cup finely minced red bell pepper", "1 plump garlic clove, minced", "1 teaspoon cumin seeds", "Cayenne pepper to taste", "3 tablespoons chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the quinoa thoroughly and combine with the water and salt in a large saucepan. Bring to a boil, cover and reduce the heat to low. Simmer 15 to 20 minutes, until the white quinoa displays a little white spiral. Turn off the heat, remove the lid and place a dish towel over the top of the pot. Return the lid and let sit for 15 minutes. The quinoa will now be fluffy. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine the lentils, ginger, turmeric and onion half (don’t chop it) with 1 quart water and salt to taste (about 1 to 1 1/2 teaspoons) and bring to a gentle boil. Stir only once to make sure there are no lentils sticking to the bottom of the pot. Reduce the heat to medium – the lentils should simmer briskly – and cook uncovered until the lentils are tender, 30 to 40 minutes. Stir in the lime juice or tamarind concentrate and add another 1/2 cup water. Stir together and simmer for another minute. Turn off the heat and using an immersion blender, an Indian mathani (a wooden tool used for mashing dal) or a wooden Mexican hot chocolate mixer, partially pureé the dal. It should be thick but not like a pureed soup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium-high heat in a small saucepan or small frying pan (such as an 8-inch omelet pan). Add the cumin seeds and allow to sizzle, stirring, for 10 seconds. Add the garlic and cook until lightly colored, about 15 seconds. Add the red pepper and cook until slightly softened, about 1 minute. Remove from the heat and pour over the lentils. Add the cayenne pepper and 1 tablespoon of the cilantro and stir gently. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the quinoa with the dal spooned on top. Garnish with chopped fresh cilantro."}]}