{"@context": "http://schema.org", "@type": "Recipe", "name": "Ukrainian Mushroom and Onion Dumplings", "description": "Vushka are plump mushroom-and onion-filled dumplings resembling tortellini. “Vushka” means little ears in Ukrainian, and with their curvy whorls, that’s just what they look like, especially when they turn bright red in a bowl of <a href=\"http://cooking.nytimes.com/recipes/1012983-winter-borscht\" target=\"_blank\">borscht</a> served for Sviata Vecheria, the traditional 12-dish Ukrainian dinner that is meatless and dairy-free. The East Village restaurant Veselka serves the dinner from Dec. 24 to Jan. 6.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Ukrainian-Mushroom-and-Onion-Dumplings/Ukrainian-Mushroom-and-Onion-Dumplings-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "About 60 dumplings", "recipeCuisine": "eastern european", "recipeCategory": "dinner", "keywords": "dried porcini mushrooms, onion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 37, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "34 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup dried porcini mushrooms", "3 tablespoons vegetable oil", "1 small onion, minced", "4 cups chopped button mushrooms", "Salt", "ground black pepper", "1 large egg yolk", "1 tablespoon vegetable oil", "3 1/4 cups all-purpose flour, more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make filling: place dried mushrooms in a small bowl and add 1/4 cup boiling water. Let soften, about 10 minutes. Strain, reserving liquid and mushrooms separately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat oil over medium heat. Add onion and cook, stirring often, until golden but not brown, about 5 minutes. Add button mushrooms and cook, stirring, until mushrooms have released their liquid, about 10 minutes. Sprinkle with salt and pepper and drain liquor. In a food processor, combine both kinds of mushrooms. Spoon in porcini liquid, leaving behind any silt in bottom of bowl. Pulse together until finely ground but not pasty: about 3 or 4 pulses. Add salt and pepper to taste and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make dough: In a small bowl, combine egg yolk, oil and 1 1/2 cups lukewarm water and whisk 1 minute. Place flour in a large bowl and make a well in center. Add a third of the egg mixture and lightly mix in with fingers or a fork. Repeat 2 more times. Using hands, fold dough together until soft: if crumbly, gently work in more water; if sticky, add flour. Transfer to a lightly floured board and knead 3 minutes. Form into a ball, transfer to a bowl and refrigerate 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly flour a work surface and a pan or board for the finished dumplings. Divide dough into 3 sections. Using a well-floured rolling pin, roll each section out until very thin and in a rough rectangle. Use tip of a sharp knife to cut dough into 1 1/2-inch squares."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain any excess liquid from filling. Place 1/2 teaspoon filling in center of each square. Fold squares in half to form triangles, sealing filling inside. (If dough is becoming dry, lightly moisten fingertips to seal.) Pinch the 2 opposing corners together to seal tightly. Place on floured surface: do not stack. Repeat with remaining dough and filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot of salted boiling water, cook dumplings until they float, 2 to 4 minutes. Drain and serve in hot borscht, or just with sour cream."}], "link": "https://cooking.nytimes.com/recipes/1014050-ukrainian-mushroom-and-onion-dumplings"}