{"@context": "http://schema.org", "@type": "Recipe", "name": "Wine and Herb Jelly", "description": "", "author": {"@type": "Person", "name": "Cathy Barrow"}, "image": "https://static01.nyt.com/images/2013/04/24/dining/24JELLY1_SPAN/24JELLY1-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "1 1/4 cups, or 5 quarter-pint jars", "recipeCuisine": "", "recipeCategory": "condiments, project", "keywords": "gelatin, sage, white wine, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "recipeIngredient": ["1 3/4 cups gewürztraminer or other full-bodied wine", "8 stalks fresh thyme or other strongly flavored herb or spice", "1 tablespoon fresh lemon juice", "2 tablespoons traditional powdered pectin (Certo, Ball or Sure-Jell are widely available)", "2 1/2 cups sugar", "1/2 teaspoon butter "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat wine and thyme until simmering. Turn off heat, cover and steep for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a rack or a folded kitchen towel in a large pot, fill with water and bring to a boil. Add 5 quarter-pint canning jars and boil for 10 minutes. Jars may be left in the warm water until ready to be filled. (Alternatively, sterilize jars by running them through a dishwasher, leaving them inside until ready to fill.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place canning rings in a small saucepan, cover with water and bring to a boil. Turn off heat and add lids to soften rubber gaskets. Rings and lids may be left in water until jars are filled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove thyme from wine. It will smell spicy and herbal. In a large heavy, nonreactive pot, stir together wine, lemon juice and pectin. Bring heat to medium high and stir often as mixture comes to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the mixture reaches a boil that cannot be stirred down, add sugar while stirring constantly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat jelly again to strong, hard boil to reduce the foam. Boil hard for exactly one minute to set the pectin. Turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter and stir well to continue reducing the foam. Remove any remaining foam with a clean spoon. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle hot jelly into warm jars, leaving 1/2-inch headspace. Wipe jar rims clean with a damp towel. Place lids on jars, screw on rings and lower jars back into pot of boiling water. Return to full boil and boil jars for 5 minutes. Transfer jars to a folded towel and cool for 12 hours; you should hear them ping as they seal. Sealed jars are shelf stable for one year."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cool, test seals by removing rings and lifting jars by their flat lids. If the lid releases, the seal has not formed. Unsealed jars should be refrigerated and used within a month, or reprocessed. (Rings and jars may be reused, but a new flat lid must be used each time jars are processed.) To reprocess, reheat to boiling then continue as before."}], "link": "https://cooking.nytimes.com/recipes/1014686-wine-and-herb-jelly"}