{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef With Farro, Egg, Kimchi Purée and Broccoli", "description": "", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/22/dining/Beef-With-Farro/Beef-With-Farro-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "4 main course servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "broccoli, farro, new york strip steak, main course", "aggregateRating": null, "recipeIngredient": ["1 cup kimchi", "2 tablespoons brown sugar", "2 tablespoons Korean gochujang red pepper paste (See note.)", "2 tablespoons yuzu juice, or lime juice (See note.)", "2 tablespoons butter", "1 small onion, finely diced", "2 garlic cloves, minced", "2 cups farro", "4 cups chicken stock", "1 head broccoli", "1 1/2 cups vegetable stock", "1 tablespoon butter", "1 1/2 teaspoons white miso paste", "Salt", "Ground white pepper", "4 8-ounce center-cut beef strip loin steaks", "2 tablespoons rendered beef fat or butter", "Salt", "freshly ground black pepper", "3 tablespoons soy sauce", "1 tablespoon canola oil", "1 large egg", "1 tablespoon soy sauce", "Finely grated zest of 1 kaffir lime or other lime", "1/4 cup chopped cilantro leaves, for garnish", "Fresh shiso leaves, optional, for garnish. (See note.)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the kimchi purÉe", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the kimchi purée: In a food processor or blender, combine the kimchi, brown sugar, red pepper paste and yuzu juice. Process to a smooth paste and transfer to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the farro: In a large sauté pan over medium heat, melt the butter. Add the onion and sauté until translucent and beginning to brown, about 5 minutes. Add garlic and sauté for 2 minutes. Add farro and cook for 2 minutes, stirring constantly. Add 1 cup chicken stock and simmer, stirring constantly, until the farro has absorbed the liquid, about 5 minutes. Repeat, adding 1 cup of stock at a time, until the farro is tender but slightly chewy (all the stock may not be needed). Remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the broccoli: Remove the florets from the broccoli and set aside. Peel the stem and use a vegetable peeler or sharp knife to shave it lengthwise into thin strips; set aside. In a small saucepan, combine the florets, vegetable stock and butter. Place over medium heat and simmer until tender, about 5 minutes. Using a slotted spoon, transfer to a bowl and set aside. Add stem shavings to the liquid and return to medium heat. Blanch until barely tender, about 30 seconds. Remove stem shavings and set aside, reserving the liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1 cup of the florets into a food processor. Add miso and 2 tablespoons of the broccoli cooking liquid. Process, adding more broccoli liquid as needed, to make a smooth purée. Season to taste with salt and white pepper. Transfer to a bowl and keep warm."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the farro", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the beef: Heat a cast-iron grill pan or heavy sauté pan over high heat, and allow to sit for several minutes until very hot. Coat the steaks in beef fat or butter, and season to taste with salt and pepper. Place steaks on the hot pan and allow to cook without turning for about 4 minutes; the underside will blacken. Turn and allow to cook for 3 to 4 minutes more. Transfer to a warm platter and coat both sides of each steak in soy sauce; set aside to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish: Place a large sauté pan over high heat and add 1 tablespoon canola oil. When the oil is smoking hot, add the farro in an even layer. Do not stir, allowing the farro to become crispy. Crack an egg into the pan and reduce heat to medium-low. Add soy sauce and lime zest, and slowly stir until the egg slightly scrambles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On each of four serving plates, arrange one dollop of broccoli purée and one dollop of kimchi purée. Add a serving of farro, a steak and a portion of broccoli florets and broccoli stems. Garnish with cilantro and, if using, shiso leaves."}]}], "link": "https://cooking.nytimes.com/recipes/1014135-beef-with-farro-egg-kimchi-puree-and-broccoli"}