{"@context": "http://schema.org", "@type": "Recipe", "name": "Chickpea Batter-Fried Vegetables", "description": "I learned this wonderful chickpea batter for fried vegetables from the cookbook author and teacher John Ash, who demonstrated his version of it recently at the 2010 World of Healthy Flavors conference at the Culinary Institute of America in California’s Napa Valley. It is based on a popular Indian snack called pakora. I much prefer the nutty, crisp chickpea flour coating to other flour-based batters, and those who cannot tolerate wheat will be very happy with it. You can find chickpea flour in Mediterranean markets and Indian markets.  ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/02/16/health/16recipehealth_600/16recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT50M", "recipeYield": "Serves six", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "appetizer, healthy", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 389, "unsaturatedFatContent": "27 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "6 grams", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "352 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup chickpea flour", "3 tablespoons cornstarch", "1 1/2 teaspoons baking powder", "1/2 teaspoon salt", "Pinch of cayenne (optional)", "1 cup warm water", "1 bunch or part of 1 bunch broccoli, tops broken into florets, stems peeled, quartered lengthwise and cut into 3-inch sticks cut into eights if very thick", "3 carrots, peeled and cut in 3-inch long carrot sticks", "1 sweet red pepper, seeded and cut in rings or strips", "1 medium onion, cut in rings", "Canola oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together the chickpea flour, cornstarch, baking powder, salt and cayenne. Whisk in the water. If the batter is stiff, add more water. Allow the batter to rest for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the broccoli florets and stems for four minutes until just tender. Refresh with cold water, and pat dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 or 4 inches of canola oil in a wok, frying pan or deep fryer to between 360 degrees and 375 degrees. It’s important that the oil be hot enough that the vegetables will cook quickly without absorbing much oil. Use a deep-fry thermometer, and make sure to bring the oil back up to temperature between batches. Whisk the batter, which will have separated. Working in batches so that you don’t crowd the pan, dip the vegetables in the batter to coat thoroughly, and carefully place in the hot oil. It should take less than two minutes to achieve a golden brown crust. Carefully remove from the oil using a deep-fry skimmer, tongs or a spider, and drain on paper towels, then transfer to a baking sheet. Keep warm in a 200-degree oven while you continue to cook the remaining vegetables. Serve once all the vegetables have been cooked."}], "link": "https://cooking.nytimes.com/recipes/1014062-chickpea-batter-fried-vegetables"}