{"@context": "http://schema.org", "@type": "Recipe", "name": "Sorghum Bowl With Black Beans, Amaranth and Avocado", "description": "Sorghum reminds me of Israeli couscous, spherical and about the same size. Like Israeli couscous, it’s good with brothy stews. I love the way the firm, round grains stand up against the soft, brothy beans in this bean and amaranth stew. You can find amaranth at many farmers’ markets and Asian markets. The beautiful purple and green leaves are high in anthocyanins, known for their antioxidant properties, as are black beans. Substitute baby spinach if you can’t find it.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/05/29/science/28recipehealth/28recipehealth-articleLarge.jpg", "totalTime": "PT7H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "amaranth greens, black beans, sorghum, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, low sugar, nut-free, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1163, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "201 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "29 grams", "proteinContent": "47 grams", "saturatedFatContent": "4 grams", "sodiumContent": "830 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound (2 1/8 cups) black beans", "1 tablespoons grapeseed or canola oil", "1 medium onion, chopped", "2 to 4 garlic cloves, to taste, minced", "2 or 3 epazote sprigs, if available", "1/4 cup chopped cilantro, plus sprigs for garnish", "Salt to taste", "1 cup sorghum", "1 generous bunch amaranth, stemmed and coarsely chopped (an 8-ounce bunch, 6 cups chopped)", "1 large ripe Hass avocado, sliced or diced", "Crumbled queso blanco or feta for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the black beans, pick them over for stones, and place them in a bowl. Cover with 2 quarts water and soak for 4 hours or longer. Do not drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, heavy soup pot or Dutch oven and add the onion. Cook, stirring, until it is tender, about 5 minutes, and add half the garlic. Cook, stirring, until fragrant, about 1 minute, and add the beans and soaking water. They should be covered by at least an inch of water, preferably 2 inches. Add more water as necessary, and bring to a boil. Reduce the heat to low, and skim off any foam that rises. Add the epazote and/or half the cilantro. Cover and simmer 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add salt to taste (2 to 3 teaspoons), the remaining garlic and remaining cilantro. Continue to simmer another hour, until the beans are quite soft and the broth is thick and fragrant. Taste and adjust salt. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the beans are simmering, cook the sorghum. Rinse and combine with 3 cups water in a saucepan. Add salt to taste (I use 1/2 to 3/4 teaspoon) and bring to a boil. Reduce the heat, cover and simmer 50 minutes, until the grains are tender. Pour off any liquid remaining in the pot (save for stocks if desired) and return the grains to the pot. Cover until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the beans are ready, stir in the amaranth leaves and simmer for 10 minutes, until the leaves are tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the sorghum among 6 wide or deep bowls. Top with black beans and amaranth. Garnish with sliced or diced avocado and chopped cilantro. If you want some spice, add a little salsa or minced green chili. Sprinkle feta or queso blanco over the top and serve."}], "link": "https://cooking.nytimes.com/recipes/1014762-sorghum-bowl-with-black-beans-amaranth-and-avocado"}