{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Albacore With Yogurt-Dill Sauce on a Bed of Arugula", "description": "This is based on a recipe for red mullet from “Classic Turkish Cooking” by Ghillie Basan. Red mullet isn’t so easy to come by in the United States, and albacore works well here. In the authentic Turkish dish, the red mullet is marinated in a mixture of onion juice and lemon juice with bay leaf. This step is optional; it tenderizes the fish and adds terrific flavor, but grilled albacore is nice enough on its own. Dill is the traditional herb for this recipe, but mint is very nice as well.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/09/27/science/26recipehealth/26recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H15M", "recipeYield": "Serves 4", "recipeCuisine": "turkish", "recipeCategory": "dinner", "keywords": "albacore tuna, arugula, greek style yogurt, healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 401, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "4 grams", "proteinContent": "48 grams", "saturatedFatContent": "4 grams", "sodiumContent": "931 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 large onions", "Salt to taste", "2 tablespoons fresh lemon juice", "2 tablespoons extra virgin olive oil", "4 bay leaves, broken up", "4 albacore steaks, about 6 ounces each", "Salt", "freshly ground pepper", "2 tablespoons extra virgin olive oil (omit if the fish has been marinated)", "2 garlic cloves, halved, green shoots removed", "Generous pinch of salt", "1/2 cup thick Greek-style or drained yogurt", "2 tablespoons fresh lemon juice", "2 to 4 tablespoons finely chopped dill or mint", "Salt", "freshly ground pepper", "1 bag baby arugula, preferably the wild variety"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If marinating the fish: Quarter the onions and place in a food processor fitted with the steel blade. Add a generous pinch of salt and pulse the onions until puréed and watery. Line a strainer with a double thickness of cheesecloth and dump in the puréed onions. Take up the edges of the cheesecloth and squeeze out the onion juice (you can also use a cloth kitchen towel for this). Discard the pulp. Add to the onion juice the lemon juice, olive oil and bay leaves. Place the fish steaks in the marinade, turn over a few times, cover the bowl and refrigerate for 1 to 2 hours, basting or turning the fish from time to time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a hot charcoal or gas grill, or a grill pan or cast-iron skillet over medium-high heat. If you have not marinated the fish, simply salt and pepper and brush with olive oil. Combine the yogurt, garlic and lemon juice in a bowl. Season to taste with salt and pepper and stir in the dill or mint. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the arugula on a large serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the fish on each side for 2 to 4 minutes, depending on how rare you like it. Brush the unturned side with marinade (or just olive oil) before turning it over. Transfer the fish to the platter, placing the steaks on top of the arugula. Spoon the yogurt sauce over the fish and arugula, and serve."}], "link": "https://cooking.nytimes.com/recipes/1014285-grilled-albacore-with-yogurt-dill-sauce-on-a-bed-of-arugula"}