{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Brown Rice With Kale or Frizzy Mustard Greens and Tofu", "description": "I used a beautiful green I’d never seen before called frizzy mustard greens for this quick and easy stir-fry. They look like a cross between frisée and curly kale and have a sharp, mustardy kick. Curly kale makes a fine substitute. Also, you can substitute white rice for the brown.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/04/16/science/18recipehealth/18recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "brown rice, mustard greens, tofu, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low sugar, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 341, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "7 grams", "proteinContent": "17 grams", "saturatedFatContent": "2 grams", "sodiumContent": "930 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 ounces curly kale or frizzy mustard greens, or a mix ", "2 eggs, beaten", "Salt to taste", "12 ounces tofu, cut in dominoes and dried on paper towels", "2 tablespoons minced ginger", "1 tablespoon minced garlic", "Grapeseed, peanut or canola oil", "4 cups cooked brown rice (2 cups uncooked)", "1 to 2 tablespoons soy sauce (to taste)", "1/2 cup chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using kale, stem, wash and coarsely chop. If using frizzy mustard greens, cut away about 1 inch of the stem ends, wash and coarsely chop. Set aside near your wok."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a bowl and season to taste with salt. Heat a 14-inch flat-bottomed wok over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in 2 teaspoons of the oil by adding it to the sides of the pan and swirling the pan, then, making sure that the bottom of the wok is covered with oil, carefully pour in the eggs. Cook 30 seconds to a minute, tilting the pan so that the eggs spread out into a thin pancake. Once the pancake is set and beginning to color, flip it over with a metal spatula and allow to cook for 5 seconds. Remove to a cutting board and roll up the pancake. Cut into thin strips and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl in 1 tablespoon of the oil and add the tofu. Let sit in the pan for about 30 seconds, until it begins to sear, then stir-fry for about 2 minutes, until it is lightly colored. Push to the sides of the wok and add the remaining oil and the ginger and garlic. Stir-fry for no more than 10 seconds and add the greens and salt to taste. Turn the heat to high and stir-fry for 1 minute, until the greens have wilted. Stir the tofu down from the sides of the wok and add the soy sauce. Stir-fry for a couple of seconds and add the rice. Stir-fry for 1 to 2 minutes, scooping up and breaking up the rice, then pressing it into the pan and scooping it up again. Add the egg strips, cilantro and more soy sauce if desired, and stir-fry another 30 seconds to combine. Remove from the heat and serve."}]}