{"@context": "http://schema.org", "@type": "Recipe", "name": "Oven-Steamed Arctic Char With Piperade", "description": "Arctic char, a cold-water pink-fleshed fish, is farmed in a more sustainable way than salmon and has the same good Omega-3s. Simply steamed in a low oven, it is complemented here with a sweet and savory pepper sauce. The sauce is great with just about any fish. Try it with a whole grilled striped bass (another one of  Seafood Watch’s Best Choices).<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/04/03/health/03recipehealth/03recipehealth-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "arctic char, bell pepper, tomato, dairy-free, gluten-free, halal, healthy, kosher, low-sodium, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 19}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 396, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "3 grams", "proteinContent": "32 grams", "saturatedFatContent": "5 grams", "sodiumContent": "707 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 medium onion, finely chopped", "2 large green bell peppers or thin-skinned sweet peppers from the farmers’ market", "1 large red bell pepper or thin-skinned red pepper from the farmer’s market", "1 serrano or jalapeño pepper, seeded and minced", "2 large garlic cloves, minced", "Salt", "1 pound tomatoes, peeled, seeded, and chopped, or 1 (14-ounce) can, drained", "Pinch of sugar", "1 teaspoon fresh thyme leaves, or 1/2 teaspoon dried thyme", "2 pounds arctic char"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, nonstick skillet and add the onion. Cook, stirring, until tender, about 5 minutes, and add the peppers, chile, and garlic. Stir together until the garlic begins to smell fragrant, about 1 minute, and add salt to taste. Continue to cook, stirring often, for about 10 minutes, until the peppers are quite soft. Add the tomatoes, sugar, and thyme, bring to a simmer, turn the heat to low and cook uncovered for 20 to 30 minutes, stirring often. The mixture should be thick and sweet. Remove from the heat and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Cover a baking sheet with foil and lightly oil the foil. Place the fish on top. Season with salt and gently rub the salt into the surface of the fish. Add pepper to taste. Fill a roasting pan with boiling water and place it on the oven floor. Place in the oven and bake until the fish flakes and white bubbles of protein appear on the surface, 10 to 20 minutes, depending on the size of the fillets (you can scrape them away if you don’t like the look of them). Remove from the heat and serve topped with the piperade."}], "link": "https://cooking.nytimes.com/recipes/1014642-oven-steamed-arctic-char-with-piperade"}