{"@context": "http://schema.org", "@type": "Recipe", "name": "Millet and Greens Gratin", "description": "Millet can be dry, but here there’s lots of custard to moisten it, and it works really nicely to hold this gratin together. I used 1 1/4 cups cooked millet that I’d frozen a while back. Look for beets with lush greens at your farmers’ market. There’s a lot of variation from one bunch to the next; I judge the beets I buy as much by their greens as by the bulbs.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/06/11/science/12recipehealth/12recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H10M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "casseroles", "keywords": "beet greens, millet, gluten-free, halal, healthy, high fiber, kosher, low sugar, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 194, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "1 gram", "proteinContent": "10 grams", "saturatedFatContent": "5 grams", "sodiumContent": "280 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 generous bunch beet greens", "Salt to taste", "2 tablespoons extra virgin olive oil", "1/2 medium onion, finely chopped", "2 large garlic cloves, minced", "1 teaspoon chopped fresh thyme", "1 teaspoon chopped fresh rosemary", "2 eggs plus 1 egg yolk", "1/2 cup low-fat milk", "1 to 1 1/4 cups cooked millet", "3 ounces Gruyère cheese, grated (3/4 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stem the greens and wash the leaves in 2 changes of water. To blanch the greens, bring a large pot of water to a rolling boil, salt generously and add the greens. Blanch for 1 minute or until tender. Alternatively, steam the greens over 1 inch of boiling water for about 2 minutes, until tender. Transfer to a bowl of cold water and drain. Taking the greens up by the handful, squeeze hard to expel excess water. Chop medium-fine. You should have about 11/4 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Oil a 2-quart gratin or baking dish. Heat 1 tablespoon of the oil in a heavy skillet over medium heat and add the onion. Cook, stirring often, until tender, about 5 minutes. Add a generous pinch of salt and the garlic and cook, stirring, until the garlic is fragrant, 30 seconds to a minute. Add the herbs, beet greens, and salt and pepper to taste, and stir and toss in the pan for about a minute, until the mixture is nicely infused with the oil, garlic and herbs. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat together the eggs, egg yolk and milk. Add salt to taste (about 1/2 teaspoon), pepper, the millet, the greens and the cheese and stir together until the mixture is well blended. Scrape into the oiled baking dish. Drizzle the remaining tablespoon of olive oil on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake in the preheated oven for 35 minutes, or until it is sizzling and set, and the top is just beginning to color. Remove from the oven and allow to sit for 10 minutes or longer before serving."}], "link": "https://cooking.nytimes.com/recipes/1014793-millet-and-greens-gratin"}