{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Roasted Cherry Tomatoes With Basil Oil", "description": "When you roast cherry tomatoes, they caramelize and become even sweeter. This dish was inspired by a huge pile of roasted red and yellow cherry tomatoes that a friend served at a dinner party recently; they were drizzled with diluted pesto and placed alongside a luxurious mound of burrata. You can serve these as an appetizer (have napkins close by) or side dish, or tossed with pasta. You can easily multiply this recipe, but you won’t have to use much more olive oil to coat the tomatoes. This gorgeous emerald-colored oil is a condiment that you can keep in your refrigerator for up to a week. Keep it in a squeeze bottle, and drizzle it over tomatoes, fish, chicken or other vegetables. It looks beautiful on a white plate, and a little goes a long way.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/07/27/science/26recipehealth/26recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H10M", "recipeYield": "Serves 8 to 10 as an hors d’oeuvre", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "appetizer, healthy, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 163}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 145, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "0 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "0 grams", "proteinContent": "0 grams", "saturatedFatContent": "2 grams", "sodiumContent": "56 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2 baskets sweet cherry tomatoes (can use a mixture of colors)", "Salt to taste", "A couple of pinches of sugar", "3 tablespoons extra virgin olive oil", "About 1 tablespoon basil olive oil (see below)", "Salt to taste", "2 cups basil", "1/2 cup extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Place the tomatoes in a baking dish large enough to fit them in a single layer. Add the salt and sugar, and toss together. Add the regular olive oil, and toss again. Place in the oven for 45 minutes until the skins have shriveled and just split; the tomatoes should still be still intact. Remove from the heat, and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of water to a boil, and salt generously. Fill a medium bowl with ice water. Place the basil in the boiling water, and blanch for 15 seconds. Remove with a skimmer, and transfer to the ice water. Drain and squeeze out excess water, then place on a clean dish towel and again squeeze out as much water as you can. Place in a blender with the olive oil. Blend one to two minutes until the olive oil is green and tinged with flecks of basil. Transfer to a squeeze bottle, and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the tomatoes on a platter. Drizzle the bright green basil oil decoratively around and over them, and pour on any juices from the pan. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1014280-slow-roasted-cherry-tomatoes-with-basil-oil"}