{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Jam With Kiwi", "description": "Strawberry turns out to be one of the more difficult jams to make. It’s often runny. But if you just add a kiwi, packed with natural pectin, it will make any jam gel. Kiwi’s flavor is subtle, slightly tart and not at all intrusive. I add mint to the mix to bump up the candy-sweet flavor of the berries. Your jam will hold together beautifully, tasting of strawberries and sunshine and nothing more.", "author": {"@type": "Person", "name": "Cathy Barrow"}, "image": "https://static01.nyt.com/images/2013/06/05/dining/05STRAWBERRY_SPAN/05STRAWBERRY-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "5 half-pint (8-ounce) jars", "recipeCuisine": "", "recipeCategory": "dips and spreads, project", "keywords": "kiwi, strawberry", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 568, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "144 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "6 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "5 milligrams", "sugarContent": "135 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pounds ripe fresh strawberries", "1 kiwi", "3 cups sugar", "Juice of one lemon", "4 sprigs of mint, preferably peppermint", "1 vanilla bean, optional", "1/2 teaspoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash, dry, hull and stem berries, then dice into 1/2-inch pieces, about 8 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and dice the kiwi into 1/2-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir together the berries, kiwi, sugar and lemon juice in a large bowl. Add the mint, and split and add the vanilla bean, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and leave out to macerate for 2 hours, or refrigerate up to 1 day, until ready to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To process the jam for longer shelf life, begin by sterilizing the jars. (If you want to skip canning, the jam keeps in the refrigerator for up to a month; jump to Step 7.) Place a round rack or a folded kitchen towel in a large pot, fill with water and bring to a boil. Add 5 half-pint canning jars and boil for 10 minutes. Jars may be left in the warm water until ready to be filled. (Alternatively, sterilize jars by running them through a dishwasher cycle.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place canning rings in a small saucepan, cover with water and bring to a boil. Turn off heat and add lids to soften gaskets. Rings and lids may be left in water until jars are filled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, heavy, nonreactive pot, add the berry mixture. Clip on a candy thermometer. Bring to medium-high, stir often as mixture comes to a boil. When it reaches a hard boil, stir relentlessly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook on medium-high heat, being careful to keep stirring to avoid sticking and burning as the mixture thickens. Adjust heat as needed if the jam begins to spit, without losing the boil. Continue to stir. The mixture will be very foamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 30 to 40 minutes, the jam will reach 210 degrees; the jam will be thick and the foam on the surface will begin to dissipate, showing clear preserves below. Add the butter and stir well; most of the foam will break up. Scoop off any remaining foam with a clean spoon. Turn off heat and discard the mint. The vanilla bean may be reused. If you’re making refrigerator jam, the preserves are ready and can be stored in a jar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you are processing the jam in sealed jars to keep up to a year in the pantry, carefully ladle the hot preserves into warm jars, leaving 1/2-inch head space. Run a plastic knife gently around inside of jar to remove any air bubbles. Recheck head space. Wipe jar rims clean with a damp towel. Place lids on jars, screw on rings and lower jars back into pot of boiling water. Return to full boil and boil jars for 10 minutes. Transfer jars to a folded towel and let cool for 12 hours; you should hear them ping as they seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cool, test seals by removing rings and lifting jars by their flat lids. If the lid releases, the seal has not formed. Unsealed jars should be refrigerated and used within a month, or reprocessed. (Rings and jars may be reused, but a new flat lid must be used each time jars are processed.) To reprocess, reheat syrup to boiling then continue as before."}]}