{"@context": "http://schema.org", "@type": "Recipe", "name": "Couscous With Tomatoes, Kale and Chickpeas", "description": "The topping for this couscous isn’t too much more complicated than making a tomato sauce with blanched kale and chickpeas added. Reconstitute the couscous, then start the topping. By the time the topping is done the couscous will be ready to steam in the microwave.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/02/05/science/05recipehealth/05recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "Serves 4", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, easy", "keywords": "canned tomatoes, couscous, kale, dairy-free, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 136}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 454, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "80 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "21 grams", "proteinContent": "19 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1052 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["1 1/3 cups couscous, preferably whole wheat", "1 to 2 tablespoons extra virgin olive oil", "2 garlic cloves, minced ", "Pinch of red pepper flakes", "1 can (28-ounce) tomatoes, with juice, pulsed a few times in a food processor or mini processor", "Pinch of sugar", "Salt to taste", "1 can chickpeas, drained and rinsed", "1 bunch (about 3/4 pound) black kale, stemmed and washed thoroughly", "1/4 to 1/2 cup chopped cilantro (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a saucepan full of water for the kale. Put the couscous in a bowl, add salt to taste, and if desired, 1 tablespoon of the olive oil. Stir or rub between your fingers to distribute the oil (with the oil the couscous is a little fluffier, but you can omit this step). Cover with ½ inch of warm water or stock, if you have some. Let sit while you prepare the tomato sauce. Stir every once in a while to fluff."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining tablespoon of oil over medium heat in a wide skillet or saucepan and add the garlic and red pepper flakes. As soon as the garlic begins to smell fragrant (30 seconds to 1 minute), add the tomatoes, sugar, and salt and bring to a simmer. Cook, stirring often, until thick and fragrant, about 15 minutes. Remove from the heat, taste and adjust seasoning. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "By now the water in the pot will be boiling. Add salt to taste and the kale. Blanch for 3 to 4 minutes, until tender but still bright. Using a skimmer, transfer to a bowl of cold water. Drain and squeeze out excess water. Chop medium-fine and stir into the tomato sauce, along with the chickpeas and cilantro. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the couscous bowl with plastic wrap, pierce in a few places and microwave for 2 minutes at full power. Remove from the microwave carefully, as the bowl will be hot. Carefully remove the plastic and fluff. Cover again and return to the microwave for 1 minute. Serve the couscous topped with the tomato and kale sauce."}], "link": "https://cooking.nytimes.com/recipes/1014522-couscous-with-tomatoes-kale-and-chickpeas"}