{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato and Basil Risotto", "description": "This is a luxurious summer risotto, with tomatoes both cooked along with the rice and added uncooked to the finished risotto.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/07/22/science/22recipehealth/22recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 525}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 391, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "14 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1098 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["7 cups well seasoned vegetable stock, garlic stock (<a href=\"http://cooking.nytimes.com/recipes/1016506-garlic-broth\">see recipe</a>) or chicken stock", "2 tablespoons extra virgin olive oil", "1/2 cup minced onion", "Salt to taste", "2 garlic cloves, minced", "1 pound tomatoes, grated", "Pinch of sugar", "1 teaspoon fresh thyme leaves", "1 1/2 cups Arborio rice", "Salt and freshly ground pepper to taste", "1/2 cup dry white or rosé wine, such as Pinot Grigio or Sauvignon Blanc", "1/2 pound additional sweet ripe tomatoes, finely diced (about ¾ cup)", "1/4 cup slivered fresh basil", "1/4 to 1/2 cup freshly grated Parmesan cheese (1 to 2 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put your stock or broth into a saucepan and bring it to a simmer over low heat, with a ladle nearby or in the pot. Make sure that it is well seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy skillet or a wide, heavy saucepan. Add the onion and a generous pinch of salt, and cook gently until tender, about 5 minutes. Add the rice and garlic and cook, stirring, until the grains of rice are separate and beginning to crackle. Stir in the grated tomatoes, sugar, thyme, and salt to taste and cook, stirring often, until the tomatoes have cooked down slightly and coat the rice, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wine and stir until it has evaporated and been absorbed by the rice. Begin adding the simmering stock, a couple of ladlefuls (about 1/2 cup) at a time. The stock should just cover the rice, and should be bubbling, not too slowly but not too quickly. Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock and continue to cook in this fashion, adding more stock and stirring when the rice is almost dry. You do not have to stir constantly, but stir often and when you do, stir vigorously. When the rice is just tender all the way through but still chewy (al dente), in 20 to 25 minutes, it is done. Taste now and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another ladleful of stock to the rice. Stir in the additional finely diced tomatoes, basil and Parmesan and remove from the heat. The mixture should be creamy (add more stock if it isn’t). Serve right away in wide soup bowls or on plates, spreading the risotto in a thin layer rather than a mound."}]}