{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice With Rabbit", "description": "Memorable dishes sometimes come out of nowhere. One recent evening in Tarragona, just south of Barcelona, I wandered past a number of cafes and tapas bars. Txantxangorri, a Basque place serving rice dishes — not paellas — was the only one that had seats. The rice with rabbit, served in a terra cotta casserole, was simple, satisfying and, unlike the Michelin-starred dishes I had elsewhere in Spain, something I could try at home. With reds from Roussillon, a region that is practically in Catalonia anyway, I had my chance.If you do not have an earthenware casserole, you can make the whole thing, from stovetop to oven, in enameled cast iron. ", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/04/04/dining/rice-with-rabbit/rice-with-rabbit-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "spanish", "recipeCategory": "dinner", "keywords": "chicken stock, rabbit, short grain rice, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 12}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 560, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "1 gram", "proteinContent": "57 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1127 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 rabbit, cut into 8 pieces", "Salt", "pepper", "1 teaspoon ground Espelette pepper or hot Spanish paprika", "1 cup white wine", "5 tablespoons extra virgin olive oil", "1 large onion, chopped", "3 garlic cloves, slivered", "1 1/2 cups Spanish short grain rice (calasparra or bomba)", "1 tablespoon tomato paste", "3 1/2 cups chicken stock", "1 tablespoon minced flat-leaf parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a cleaver to cut the rabbit into about 24 small chunks, cutting through bones as needed. Place in a bowl, massage with salt, pepper and half the Espelette or paprika. Pour in half the wine and 2 tablespoons oil. Mix well, cover loosely, and marinate 6 hours, refrigerated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Dry the rabbit pieces, reserving marinade. In a large skillet heat 2 tablespoons oil to medium-high and sauté the rabbit until lightly browned but not cooked through. Remove the rabbit to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower heat to medium and add the remaining oil to the skillet. Sauté the onion and garlic until just starting to color. Add the rice and stir. Add the reserved marinade, tomato paste, the remaining Espelette or paprika, the remaining wine, and the stock. Bring to a simmer. Taste and add salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a 4-quart casserole, preferably earthenware. Tuck in the rabbit pieces and bake, uncovered, until the rice has absorbed the liquid and is tender, about 40 minutes. Scatter parsley on top and serve."}], "link": "https://cooking.nytimes.com/recipes/1014165-rice-with-rabbit"}