{"@context": "http://schema.org", "@type": "Recipe", "name": "Penne With Peas, Pea Greens and Parmesan", "description": "Many farmers who sell peas also sell the shoots and tendrils that grow with them. They’re sweet, light and nourishing, especially when you serve them along with peas. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2019/03/22/pageoneplus/22recipehealth/25recipehealth-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas", "keywords": "halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegetarian, main course, pea shoots, peas, penne", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 97}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 426, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "6 grams", "proteinContent": "18 grams", "saturatedFatContent": "3 grams", "sodiumContent": "426 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 pound fresh peas, shelled (about 3/4 cup)", "6 ounces pea shoots (tendrils, shoots, leaves) (1/2 big bunch), curly tendrils removed and discarded", "1 tablespoon extra virgin olive oil", "1 bunch young spring onions or scallions, cleaned and finely chopped (about 1/2 cup)", "Salt and freshly ground pepper", "1 tablespoon chopped fresh tarragon", "1 tablespoon chopped fresh parsley", "3/4 pound penne", "1 to 2 ounces Parmesan, grated (1/4 to 1/2 cup, to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large pot of water for the pasta. Meanwhile, steam the peas over an inch of boiling water for 4 minutes, until just tender. Transfer to a bowl. Add the pea shoots to the steamer and steam 2 minutes, until just wilted. Remove from the heat and allow to cool until you can handle them. Do not discard the steaming water; pour it into a measuring cup. Squeeze out excess water from the pea greens and chop medium-fine. You should have about 1 cup chopped leaves and tender stems."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large skillet and add the chopped spring onion or scallions. Cook, stirring, until wilted, about 3 minutes. Add the pea shoots and stir together for about a minute. Season to taste with salt and pepper. Add the peas, tarragon and parsley and about 1/4 cup of the steaming water and heat through. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water in the pot comes to a boil, salt generously and add the pasta. Cook al dente, using the timing instructions on the package as a guide but checking the pasta a minute before the time indicated is up. When the pasta is ready, using a ladle transfer 1/2 cup of the pasta cooking water to the pan with the peas and pea shoots. Drain the pasta and toss at once with the vegetables and Parmesan. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1014690-penne-with-peas-pea-greens-and-parmesan"}