{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek Chicken and Tomato Salad", "description": "A small amount of seared and roasted chicken breast transforms this tomato-centric Greek salad into something substantial enough to eat as a main dish for lunch or a light supper.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/07/24/science/25recipehealth/25recipehealth-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "Serves 4", "recipeCuisine": "greek", "recipeCategory": "easy, salads and dressings", "keywords": "chicken breast, tomato, gluten-free, halal, healthy, kosher, nut-free, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 53}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 280, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "4 grams", "proteinContent": "17 grams", "saturatedFatContent": "5 grams", "sodiumContent": "699 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound boneless, skinless chicken breast", "Salt and freshly ground pepper to taste", "1/4 cup extra virgin olive oil", "1 small red onion, halved and sliced across the grain", "1 pound fresh, sweet ripe but firm tomatoes, cut in wedges", "12 kalamata olives, pitted and halved", "1 tablespoon fresh lemon juice", "1 tablespoon red wine vinegar or sherry vinegar (more to taste)", "2 ounces feta cheese, crumbled", "3 to 4 tablespoons chopped or torn fresh mint leaves (to taste)", "1 heart of romaine lettuce, washed, dried and torn or cut in 1-inch pieces, or 1 bag arugula or spring mix, washed and spun dry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Season the chicken breasts well with salt and pepper. Toss them in a bowl with 2 tablespoons of the olive oil. Heat a grill pan or a cast iron pan over high heat. Sear the chicken breasts for about 2 minutes on each side, until grill marks appear if using a grill pan, or until nicely browned if using a regular pan. Transfer to a baking sheet and place in the oven. Roast for 10 to 15 minutes, or until a meat thermometer reads 165 degrees when inserted in the thickest part. Remove from the heat and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile place the sliced onion in a bowl and cover with water. Soak for 5 minutes, drain and rinse well. Drain on paper towels. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the chicken is cool enough to handle tear it into bite-size pieces or a little bigger than bite-size and place in bowl. Add the onion, tomatoes and olives. Season with salt and pepper and toss with the lemon juice, vinegar and remaining olive oil. Add the mint and feta and toss again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a platter or wide salad bowl with the lettuce. Top with the chicken and tomato salad, and serve."}], "link": "https://cooking.nytimes.com/recipes/1014907-greek-chicken-and-tomato-salad"}