{"@context": "http://schema.org", "@type": "Recipe", "name": "Huevos Rancheros", "description": "Fried eggs on warm corn tortillas, topped with cooked tomato salsa — it’s a classic dish, though I probably make it a little differently than they do at your neighborhood Tex-Mex restaurant. This recipe makes for an easy supper or a great Mexican breakfast.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/07/24/health/24recipehealth_600/24recipehealth_600-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves four", "recipeCuisine": "mexican", "recipeCategory": "breakfast, easy, quick", "keywords": "corn tortillas, eggs, tomato, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 59}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 308, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "6 grams", "proteinContent": "13 grams", "saturatedFatContent": "3 grams", "sodiumContent": "849 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 corn tortillas", "2 pounds fresh ripe tomatoes, peeled and coarsely chopped", "2 to 3 serrano or jalapeño chiles, seeded for a milder sauce, and chopped", "2 garlic cloves, peeled, halved, green shoots removed", "1/2 small onion, chopped", "2 tablespoons canola oil", "Salt to taste", "4 to 8 eggs (to taste)", "Chopped cilantro for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap the tortillas in aluminum foil, and heat in a 350-degree oven while you prepare the salsa and fry the eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tomatoes, chiles, garlic and onion in a blender and puree, retaining a bit of texture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the canola oil over high heat in a large, heavy nonstick skillet, until a drop of puree will sizzle when it hits the pan. Add the puree and cook, stirring, for four to ten minutes, until the sauce thickens, darkens and leaves a trough when you run a spoon down the middle of the pan. It should just begin to stick to the pan. Season to taste with salt, and remove from the heat. Keep warm while you heat the tortillas and fry the eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm four plates. Fry the eggs in a heavy skillet over medium-high heat. You won’t need much oil if you have another nonstick skillet. Use the remaining tablespoon of oil if necessary. Cook them sunny side up, until the whites are solid but the yolks still runny. Season with salt and pepper, and turn off the heat. Place two warm tortillas on each plate, overlapping if you are only serving one egg. Top with one or two fried eggs. Spoon the hot salsa over the whites of the eggs and the tortillas, leaving the yolks exposed if possible. Sprinkle with cilantro and serve."}], "link": "https://cooking.nytimes.com/recipes/1014000-huevos-rancheros"}