{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Sticky Rice", "description": "Also known as “sweet rice” or glutinous rice (though it’s gluten free), sticky rice is a large white grain that becomes translucent, shiny and extremely sticky when steamed. Sticky rice is a staple in Laos, where it is especially beloved, but it has ardent fans throughout Asia. Traditionally, it’s cooked over steam in a conical woven basket. If you don’t have such a steamer, you can use a standard stacking steamer, a colander lined with muslin or cheesecloth, or a fine mesh strainer that fits over a saucepan. For the best texture, cooking sticky rice over hot steam is ideal, but it is possible to pull it off in an electric rice cooker, using less water than usual, or in a pot on the stove. What follows are the basic instructions for success.\n", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/03/17/dining/stickyrice/stickyrice-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "", "keywords": "side dish, sweet rice, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 77}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 176, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": null, "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "0 milligrams", "sugarContent": null, "transFatContent": null}, "recipeIngredient": ["1 cup glutinous (sweet) rice, preferably long-grain"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put rice in a bowl and rinse several times in cold water until water is clear, not milky, then drain. Cover rice with cold water and let soak for at least 2 hours or up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain rice using a fine-meshed sieve or colander (line with cheesecloth if colander holes are too large). Place rice over a pot of rapidly simmering water (don’t allow water to touch sieve) and steam, covered, for 15 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove lid and flip rice over. Continue steaming, covered, for 10 minutes, until rice is translucent and glossy. Taste to make sure rice is completely cooked; it may take up to 10 minutes more. Turn off heat. Fluff rice with a wooden spoon, then cover and let rest for 5 minutes."}], "link": "https://cooking.nytimes.com/recipes/1014805-basic-sticky-rice"}