{"@context": "http://schema.org", "@type": "Recipe", "name": "Buckwheat and Amaranth Muffins", "description": "The muffins available in most coffee shops and cafes are like oversize, unfrosted cupcakes: too sweet and too big. But muffins don’t have to be cloying — a bit of natural sweetener is all that’s required to make them taste like a treat. And they don’t have to be calorie-laden confections. This week, you’ll find it’s possible to make muffins with a number of nutritious ingredients, particularly whole grains. Muffins made with buckwheat or cornmeal offer great taste and nourishment — without the feeling that you’re chewing on rocks. Even if you don’t think of yourself as a baker, take a stab at this week’s recipes. They’re easy and come together quickly. Of all the muffins I make, these have the most distinctive flavor.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/03/02/science/28recipehealth/28recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "12 muffins", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "appetizer, healthy", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 68}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 224, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "236 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup whole-wheat flour", "3/4 cup buckwheat flour", "2 teaspoons baking powder", "1 teaspoon baking soda", "1/2 teaspoon salt", "1/2 cup amaranth flour (you can make this by blending the amaranth in a spice mill; it does not have to be finely ground)", "2 eggs", "1/3 cup honey", "1 1/2 cups buttermilk", "1/3 cup canola oil", "1 teaspoon vanilla extract", "1 cup blackberries tossed with 1 teaspoon all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees with the rack moved to the upper third of the oven. Oil or butter muffin tins. Sift together the whole-wheat and buckwheat flours, baking powder, baking soda and salt. Stir in the amaranth flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, beat together the eggs, honey, buttermilk, canola oil and vanilla extract. Using a whisk or a spatula, stir in the dry ingredients. Mix until well combined, but do not beat -- a few lumps are fine, but make sure there is no flour at the bottom of the bowl. Fold in the blackberries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon into muffin cups, filling them to just below the top (about 4/5 full). Place in the oven, and bake 25 minutes until lightly browned and well risen."}], "link": "https://cooking.nytimes.com/recipes/1014143-buckwheat-and-amaranth-muffins"}