{"@context": "http://schema.org", "@type": "Recipe", "name": "Warm Cabbage and Green Beans", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": "https://static01.nyt.com/images/2014/04/04/dining/warm-cabbage-green-beans/warm-cabbage-green-beans-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "african", "recipeCategory": "dinner", "keywords": "ghee, green beans, napa cabbage, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "recipeIngredient": ["8 ounces clarified butter or ghee", "1/2 cup coarsely chopped red onion", "1 garlic clove, minced", "1 2-inch piece ginger, peeled and finely chopped", "1/2 teaspoon fenugreek seeds", "1/2 teaspoon ground cumin", "1/2 teaspoon cardamom seeds", "1/2 teaspoon dried oregano", "1/4 teaspoon ground turmeric", "4 basil leaves", "1 pound cabbage or Napa cabbage, thinly sliced or shredded", "1 medium red onion, thinly sliced", "3 cups cherry tomatoes, or 5 large tomatoes", "7 ounces chopped canned tomatoes", "3 garlic cloves, minced", "1 tablespoon mustard seeds", "1 tablespoon nigella sativa seeds (available in specialty stores)", "1 teaspoon ground turmeric", "1 teaspoon berbere (available in specialty stores) or chili powder", "1/2 teaspoon ground cardamom, preferably freshly ground", "1 3-inch piece ginger, peeled and grated", "3 cups green beans, trimmed and cut in half", "1/2 teaspoon salt", "Injera (available at Ethiopian or Eritrean restaurants) or rice, for serving, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the spiced butter: Melt butter in a medium saucepan over low heat, and add onion, garlic, ginger, fenugreek, cumin, cardamom, oregano, turmeric and basil. Cook for 15 minutes, stirring occasionally. Remove from heat and let stand until spices settle, about 10 minutes, then strain through a fine-mesh sieve into a heat-proof bowl. It may be stored in a tightly covered container for up to 3 weeks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cabbage and green beans: Melt 1/2 cup spiced butter in a 12-to-14-inch sauté pan over medium heat. Add cabbage and sliced onion, and sauté until the cabbage is wilted, about 5 minutes. Add fresh tomatoes, canned tomatoes, garlic, mustard seeds, nigella seeds, turmeric, berbere, cardamom and ginger. Cook over low heat, stirring occasionally, until soft and fragrant, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, pour 6 cups water into a medium saucepan and bring to a boil over high heat. Set aside a bowl of ice water. Add green beans to boiling water, reduce heat to low and simmer until tender, 3 to 5 minutes. Drain, plunge beans into ice water until chilled, then drain again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold green beans into tomatoes and cabbage. Simmer until the beans take on flavors of the spiced sauce, about 10 minutes. Adjust salt to taste. If desired, serve with injera or rice."}], "link": "https://cooking.nytimes.com/recipes/1014126-warm-cabbage-and-green-beans"}