{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom Spring Rolls in Lettuce Cups", "description": "At Spice Market, Jean-Georges Vongerichten fills spring rolls with oyster mushrooms and shiitakes, and spices them with ginger, lemon zest, garlic and green chilies. They recall a trip he took to Singapore years ago.", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": "https://static01.nyt.com/images/2014/04/04/dining/mushroom-spring-rolls/mushroom-spring-rolls-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 appetizer servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, oyster mushroom, shiitake, spring roll wrappers, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 12}, "recipeIngredient": ["1/2 cup sambal oelek chili sauce (sold at Asian groceries)", "1/2 cup honey", "1/3 cup fresh lemon juice", "1/4 cup rice wine vinegar", "2 teaspoons salt", "8 tablespoons butter, cut into 1-inch cubes", "1/2 tablespoon minced garlic", "1 pound oyster or other mushrooms, stemmed, sliced 1/2-inch thick", "3/4 pound shiitake mushrooms, stemmed, sliced 1/2-inch thick", "1/4 teaspoon minced green Thai chili", "Salt", "1 1/2 tablespoons finely grated lemon zest (preferably use a Microplane)", "1 tablespoon finely grated peeled ginger (preferably use a Microplane)", "1 tablespoon chopped fresh chervil, or 1 teaspoon chopped fresh tarragon", "1 large egg yolk, beaten", "8 spring roll wrappers", "3 cups vegetable oil, or as needed", "Ground white pepper, optional", "8 leaves Boston lettuce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dipping sauce: In a small bowl, combine sambal oelek, honey, lemon juice, rice wine vinegar and salt. Mix well. Cover and refrigerate up to a week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the spring rolls: Combine butter and garlic in a sauté pan over medium high heat, and stir until butter is foamy and garlic is fragrant but not browned. Add oyster mushrooms, shiitake mushrooms, chili and salt to taste. Cover and cook over medium heat until mushrooms have released their juices and are soft and glazed, about 6 minutes. Add lemon zest, ginger and chervil or tarragon, and sauté 1 minute. Remove from heat and spread across a small plate. Place in the freezer, uncovered, mixing occasionally until very cold, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a spring roll wrapper in front of you, like a diamond, so a point faces you. Lightly brush the four corners of the wrapper with beaten egg yolk. Place 2 tablespoons of the mushroom mixture into the bottom quarter of the wrapper. Starting from the bottom corner, roll the wrapper, folding in the side corners so they get wrapped up, and keep rolling until closed. Repeat to make 8 rolls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a deep fryer, wok or skillet, heat oil to 350 degrees. Add spring rolls, working in batches if necessary, and fry until golden brown, about 5 minutes. Remove with slotted spoon. Drain on paper towels. If desired, season lightly with salt and white pepper. Divide dipping sauce among 4 very small bowls, and place a bowl on each of 4 plates. Place 2 lettuce leaves on each plate, place a spring roll on each leaf. Wrap spring rolls in the lettuce and dip."}], "link": "https://cooking.nytimes.com/recipes/1014130-mushroom-spring-rolls-in-lettuce-cups"}