{"@context": "http://schema.org", "@type": "Recipe", "name": "Thai Combination Fried Rice", "description": "This dish is loosely based on Thailand’s ubiquitous fried rice dish, kao pad. Usually some kind of animal protein accompanies the rice — squid, crabmeat, ham, chicken, whatever the cook has on hand. My version relies instead on tofu and vegetables; the most important ingredients are the rice itself, the garlic and the fish sauce. Have all of your ingredients prepared and close to the stove. Cooking goes very quickly. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2016/05/23/dining/thai-combination-fried-rice/thai-combination-fried-rice-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "Serves four to six", "recipeCuisine": "thai", "recipeCategory": "dinner, weekday", "keywords": "fish sauce, garlic, jasmine rice, healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 464}, "recipeIngredient": ["4 tablespoons canola or vegetable oil", "8 garlic cloves, minced or pressed", "1 large carrot, peeled and diced small or cut in julienne", "4 ounces tofu, patted dry and cut in 1/2-inch dice", "4 eggs, beaten and seasoned with salt and pepper", "5 cups cooked rice, preferably Thai jasmine rice available in markets that sell Asian foods", "2 to 3 tablespoons Thai or Vietnamese fish sauce (to taste)", "2 to 3 teaspoons Thai or Indonesian chile sauce (to taste)", "1 tomato, chopped", "1 bunch scallions, both white and green parts, chopped", "1/2 cup chopped cilantro", "Thinly sliced cucumber", "Lime wedges", "Scallions", "Fish sauce with hot chiles nam pla prik or half the amount of soy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large wok or large, heavy nonstick skillet over medium-high heat until a drop of water evaporates upon contact. Add the oil and swirl, then add the carrot and tofu. Stir-fry until lightly colored, about two minutes. Add the garlic and stir-fry until golden, about 30 seconds. Pour in the beaten egg. Stir-fry until scrambled, then add the rice. Cook the rice — scooping it up and pressing it into the pan, then scooping it up again — for about two minutes. Add the fish, chile sauces, tomato and chopped scallions, then stir together for about a half-minute. Serve, garnishing each plate with the cilantro and cucumbers and passing lime wedges, scallions and fish sauce with chiles. Diners should squeeze lime juice onto their rice as they eat."}], "link": "https://cooking.nytimes.com/recipes/1014004-thai-combination-fried-rice"}