{"@context": "http://schema.org", "@type": "Recipe", "name": "Sticky Rice With Mango", "description": "Also known as “sweet rice” or glutinous rice (despite being gluten free), sticky rice is a large white grain that, when steamed, becomes translucent, shiny and, well, sticky. In French, it’s called riz gluant or gluey, not much more attractive. There should be a better word for it, because it really is undoubtedly one of the best things to eat under the sun.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/06/19/dining/19KITCH1/19KITCH1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "", "keywords": "dessert, mango, sweet rice", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 152}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 586, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "87 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "23 grams", "sodiumContent": "303 milligrams", "sugarContent": "42 grams", "transFatContent": null}, "recipeIngredient": ["1 cup glutinous (sweet) rice, preferably long-grain", "1 1/4 cup coconut milk, fresh or canned (see note)", "1/2 cup granulated cane sugar, raw sugar or light brown sugar", "1/2 teaspoon fine sea salt", "1/2 cup coconut cream, fresh or canned (see note)", "1 or 2 ripe mangoes, peeled and cut in 1/2-inch slices"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put rice in a bowl and rinse several times in cold water until water is clear, not milky, then drain. Cover rice with cold water and let soak for at least 2 hours or up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain rice using a fine-meshed sieve or colander (line with cheesecloth if colander holes are too large). Place rice over a pot of rapidly simmering water (don’t allow water to touch sieve) and steam, covered, for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove lid and flip rice over. Continue steaming, covered, for 10 minutes, until rice is translucent and glossy. Taste to make sure rice is completely cooked; it may take up to 10 minutes more. Turn off heat. Fluff rice with a wooden spoon, then cover and let rest for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While rice cooks, put coconut milk, sugar and salt in a small saucepan over low heat. Cook, stirring, just until sugar is dissolved. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put warm rice in a serving bowl. Pour coconut milk mixture over rice and stir well. Leave for 10 minutes to let absorb, then stir in coconut cream. Serve warm or at room temperature with mango slices."}]}