{"@context": "http://schema.org", "@type": "Recipe", "name": "Tartine's Pizza or Pita Dough", "description": "", "author": {"@type": "Person", "name": "Chad Robertson"}, "image": null, "totalTime": "PT18M", "recipeYield": "Makes 8 8-inch pizzas", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "all-purpose flour, whole wheat flour, yeast, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 93}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 543, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "114 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "5 grams", "proteinContent": "16 grams", "saturatedFatContent": "0 grams", "sodiumContent": "613 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["¾ cup white all-purpose flour", "¾ cup whole-wheat flour", "7 ounces water (70 degrees)", "¼ teaspoons active dry yeast", "3 cups water (70 degrees)", "7 cups white all-purpose flour", "1 cup plus 2 tablespoons whole wheat all-purpose flour", "1 tablespoon plus 1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the starter", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the starter, mix the ingredients in a medium bowl. Cover with plastic wrap. Let stand at cool room temperature overnight (10 to 12 hours). If you are not ready to mix your dough after 12 hours at room temperature, put the starter in the refrigerator for up to 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To mix the dough, add the water to a large bowl. Add the starter and stir to disperse. Add 7 cups of white flour and 1 cup plus 2 tablespoons whole-wheat flour. With a rubber spatula, mix thoroughly until no pockets of flour remain. Cover with plastic wrap. Let the dough rest for 20 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the rest, add the salt and mix to incorporate into the dough. You can add a spritz of water to help dissolve the salt. Re-cover and let the dough rise 2 to 2 1/2 hours at moderately warm room temperature (75 degrees), giving it a dozen turns in the bowl every half hour to continue to develop."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After this initial (bulk) rise, you are ready to portion your dough into individual pieces for pizza and, if you like, retard the rising for another day in the fridge to develop more flavor. Portion the dough into 8 pieces and place each into small, olive-oil-brushed containers. Cover with plastic wrap. If you’d like to use the dough on the same day, let it rise at the same moderate warm room temperature for another 2 to 4 hours, then use to make pizza. If retarding the rising, cover and place in the fridge for up to 16 hours."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the dough", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to make pizza, preheat oven and pizza stone, if using, to 475 degrees. Remove dough from the oiled cups and place on a floured work surface, preferably the peel you will use to slide the pizza into the oven. Stretch the dough over your hands to your preferred thickness. Top as you like and peel into the hot oven to bake, about 18 minutes."}]}], "link": "https://cooking.nytimes.com/recipes/1014272-tartines-pizza-or-pita-dough"}