{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Meatballs and Herb Sauce", "description": "Before you use herbs as a main ingredient — it helps to know which ones work on a grand scale. Parsley, obviously, works in abundance: it’s clean-tasting, pleasantly grassy and almost never overwhelming. You can add literally a bunch (bunches!) of it to salad, soup, eggs, pasta, grains or beans. The same is largely true of basil, and you can use other mild herbs — chervil, chives, cilantro, dill, shiso — by at least the handful. (Mint is also useful but will easily take over a dish if you add too much of it. But all of these are great for making herb pastes, or pestos, alone or in combination. Use the same technique you use for basil pesto.)", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/07/dining/pastameatballs/pastameatballs-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, pastas", "keywords": "fresh herbs, ground sirloin, pasta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 166}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 750, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "89 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "5 grams", "proteinContent": "28 grams", "saturatedFatContent": "7 grams", "sodiumContent": "549 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups finely chopped fresh basil", "1/2 cup finely chopped fresh parsley", "1/2 cup finely chopped fresh chives", "1 thin slice white bread", "1/4 cup milk", "1/2 pound ground sirloin, pork or lamb or a mixture", "Salt", "black pepper", "6 tablespoons olive oil", "1 pound pasta", "1 garlic clove", "Freshly grated Parmesan cheese for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the basil, parsley and chives. Soak the bread in the milk for 5 minutes, then gently squeeze any excess milk from the bread; discard the milk. Combine the bread with the meat, 1 cup of the herbs and some salt and pepper; shape the mixture into 1-inch meatballs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and salt it. Put 2 tablespoons of the oil in a large skillet over medium heat. When the oil is hot, add the meatballs in a single layer (work in batches if necessary). Cook, turning occasionally, until brown on all sides, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the pasta in the boiling water until tender but not mushy. While the pasta is cooking, purée 11/2 cups of the herbs with 4 tablespoons oil, the garlic and some salt and pepper in a mini food processor or blender; leave the sauce rough or add a little water if you want it smoother. Drain the pasta, reserving about a cup of its cooking liquid. Toss the pasta with the herb sauce and most of the remaining herbs, adding the reserved liquid if the mixture seems dry. Top with the meatballs, garnish with Parmesan and the last of the herbs and serve."}], "link": "https://cooking.nytimes.com/recipes/1014276-pasta-with-meatballs-and-herb-sauce"}