{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Curry With Sweet Potatoes and Coconut Milk", "description": "I used to think the only reason to buy a whole chicken was to actually cook it whole. Why buy one for a recipe calling for parts when the supermarket will cut up the bird for you?\n\nThen one day my mother set me straight.  It’s one thing to buy a package of thighs or drumsticks when you need a specific part, but you might as well cut up your own bird if you need a variety.\n\nYou can use your cut-up chicken to make this ginger-and-lime-scented curry with coconut milk, sweet potatoes and chiles. Or substitute your favorite part, be it wings or legs or bone-in breasts. The bright, spicy and gently sweet flavors work well with any pieces of fowl in the pot.\n\nWhen the chicken in this recipe is nearly done braising, you can fry up the liver, then coat it in some of the luscious sauce. If your mother is anything like mine, she’d be proud.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/04/10/dining/10APPE_SPAN/10APPE-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, coconut milk, sweet potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 522}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1067, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "83 grams", "fiberContent": "7 grams", "proteinContent": "56 grams", "saturatedFatContent": "42 grams", "sodiumContent": "1476 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 (3 1/2 pound) whole chicken, cut into 8 pieces", "2 1/2 teaspoons kosher salt, more as needed", "Black pepper, as needed", "2 tablespoons peanut, safflower or vegetable oil", "1/4 cup finely chopped scallion", "1 1/2 inches fresh ginger, peeled and grated (1 1/2 tablespoons)", "3 garlic cloves, finely chopped", "1 to 2 jalapeno or Serrano chiles, to taste, seeded and finely chopped", "2 tablespoons red curry paste", "1 (15 1/2-ounce) can coconut milk", "2 medium sweet potatoes (1 pound), peeled and cut into 1 1/2-inch chunks", "3/4 cup coconut flakes", "1 tablespoon black or brown mustard seeds", "Fresh cilantro leaves", "Lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Pat chicken dry with paper towels and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large Dutch oven over medium-high heat. Add oil. Brown chicken pieces, in batches if necessary, until golden all over, 6 to 8 minutes per batch. Transfer chicken to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir scallion, ginger, garlic and chiles into pot and reduce heat to medium. Cook, stirring, until soft, 1 to 2 minutes. Stir in curry paste and cook 1 minute. Stir in coconut milk and sweet potatoes. Arrange chicken pieces on top of potatoes, placing breast meat on top. Pour in enough water to come halfway up the sides of chicken. Bring to a boil. Cover pot and transfer to oven. Bake until chicken is cooked through, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large dry skillet over medium heat, toast coconut flakes until golden, 2 to 3 minutes. Add mustard seeds and toast until they begin to pop, 1 minute more. Transfer to a bowl and season with a pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer chicken and sweet potatoes to a platter. Return Dutch oven to the stove and simmer over medium-high heat until cooking liquid has thickened to a saucelike consistency, 5 to 10 minutes. Pour over chicken and potatoes. Sprinkle with the coconut and mustard seed mixture and cilantro. Serve with lime wedges for squeezing."}], "link": "https://cooking.nytimes.com/recipes/1014785-chicken-curry-with-sweet-potatoes-and-coconut-milk"}