{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Scaloppine With Lemon", "description": "In order to make this chicken scaloppine, you'll first make a paillard, which just means you'll flatten the thighs by pounding them with a meat pounder, a wine bottle or the bottom of a heavy skillet. That broadens the surface area of the meat, which in turn browns and becomes crisp during cooking. It's delightful with this simple and bright lemon and white wine sauce.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/04/dining/Chicken-Scaloppine-al-Limone/Chicken-Scaloppine-al-Limone-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "12 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, quick, weekday", "keywords": "bread crumbs, chicken thigh, lemon juice, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 424}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 287, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "1 gram", "proteinContent": "14 grams", "saturatedFatContent": "5 grams", "sodiumContent": "273 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["About 1 1/2 pounds boneless chicken thighs", "Salt", "Black pepper", "1 cup all-purpose flour, or more as needed", "1 1/2 cups fresh bread crumbs, or more as needed", "3 eggs", "2 tablespoons extra virgin olive oil, plus more as needed", "3 tablespoons butter, plus more as needed", "1/4 cup dry white wine", "1/2 cup chicken or vegetable stock", "1/4 cup freshly squeezed lemon juice", "1/4 cup chopped fresh parsley, plus more for garnish", "Lemon wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 200 degrees. Slice each chicken thigh open like a book and lay it flat between two sheets of plastic wrap. Using a meat pounder, a wine bottle or the bottom of a heavy skillet, pound each piece of chicken to 1/4-inch thickness. Put two large skillets over medium-high heat for a minute or 2. Meanwhile, sprinkle the chicken with salt and pepper and put the flour and bread crumbs on two plates or in two shallow bowls. Beat the eggs in another shallow bowl. Sprinkle all with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 tablespoon each oil and butter to each skillet and swirl it around. When it is hot — a pinch of flour will sizzle — dredge a piece of the chicken in the flour, then dip it in the eggs and finally dredge it in the bread crumbs. Add the chicken piece to one of the pans, then repeat with another piece in the second pan. (You may be able to fit more than one paillard in each pan at a time.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the chicken, rotating occasionally and regulating the heat if necessary so it sizzles constantly but doesn’t burn. When the pieces are brown, after about 2 minutes, turn them over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook on the second side until the chicken is firm to the touch, 1 to 2 minutes. (Cut into one with a thin-bladed knife; the center should be white or slightly pink.) Transfer the chicken to a platter and put it in the oven. Wipe out the pan with a paper towel and repeat with the remaining chicken, adding more oil and butter to each skillet as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the chicken is cooked, turn off the heat under one of the skillets. Add a tablespoon or 2 more oil or butter to the other pan if it looks dry and sprinkle the fat with 2 teaspoons of the remaining flour. Cook over medium-high heat, stirring, for 3 to 4 minutes. Add the wine and stir and scrape the pan until the wine has reduced by about half, about 1 minute. Add the stock and lemon juice and cook, stirring, until the mixture is slightly thickened and a bit syrupy, another 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 tablespoon butter and swirl the pan around until it melts. Add any juices that have accumulated around the cooked chicken, along with the 1/4 cup parsley. Stir, taste and adjust the seasoning. Spoon the sauce over the chicken, garnish with parsley and serve with lemon wedges."}]}