{"@context": "http://schema.org", "@type": "Recipe", "name": "Family Pizza", "description": "“The Batali Brothers Cookbook,” published in 2013, includes recipes from Benno and Leo Batali, whose father, Mario, also contributed to the book, editing some of his classic dishes into simpler, weeknight-dinner versions. The Batali family pizza recipe is highly practical: small rounds cooked on a stove, no pizza oven or grill required. Yes, there are a number of steps to making the dough, but the plain parbaked crusts last for days, and need only be topped and broiled when it’s time to eat.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2013/06/18/dining/video-recipelab-pizza-batali/video-recipelab-pizza-batali-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "8 small or medium pizzas", "recipeCuisine": "italian", "recipeCategory": "dinner, pizza and calzones", "keywords": "basil pesto, italian bread flour, mozzarella, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 45}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 332, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "10 grams", "saturatedFatContent": "3 grams", "sodiumContent": "197 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 1/4 ounce package active dry yeast", "1 1/2 teaspoons sugar", "3 1/2 cups (15 ounces) “00” fine Italian bread flour or all-purpose flour, plus extra for dusting", "Scant 2 tablespoons coarse or kosher salt", "1/4 cup extra-virgin olive oil", "Semolina flour, for dusting", "6 tablespoons basil pesto", "1/2 cup grated fresh mozzarella"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Whisk 1 1/4 cups warm water (95 degrees), yeast and sugar together in a bowl. Let stand in a warm place for 10 minutes, or until yeast is foamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together bread flour and salt. Make a well in the center and add yeast mixture and oil. Using a wooden spoon, stir wet ingredients into dry ingredients until mixture is too stiff to stir, then mix with your hands until dough comes together and pulls away from sides of bowl. Turn dough out onto a lightly floured work surface and knead, adding only as much flour as necessary to prevent sticking, until smooth, elastic and only slightly sticky. Transfer dough to a large oiled bowl, turning to coat. Cover with a kitchen towel or plastic wrap, and let rise in a warm place for 1 to 1 1/2 hours or overnight, until doubled in size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch down dough and turn it out onto a well-floured work surface. Divide into 8 pieces (about 4 ounces each) and shape each one into a ball. Cover with a tea towel and let stand for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat griddle pan over medium heat until very hot, about 5 minutes. Dust a large work surface with a mixture of flour and semolina. Pick up one of the dough balls and begin to pull and stretch dough into a circle, then lay on work surface and press into a thin round (about 8 inches), adding only enough flour and semolina to keep dough from sticking. Using one hand as a guide, slope a slightly thicker rim all around dough circle. Work quickly, and be careful not to overwork dough; if it resists or shrinks back, let it rest briefly before proceeding. (If you prefer, you can roll out dough with a rolling pin; lightly flour work surface and pin.) For larger pizzas, use 2 dough balls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully place dough round on griddle pan and cook until barely tan on first side and browned in a few spots, 2 to 3 minutes. Flip crust over and cook until second side is completely dry, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer crust to a wire rack or a baking sheet, brushing off any excess flour, and allow to cool. Repeat with remaining dough. (Parbaked crusts can be refrigerated overnight or frozen, well wrapped, for up to 2 weeks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top and broil each pizza: Heat broiler and place a pizza stone or baking sheet inside to heat. Spread a very light coating of pesto evenly on crust, leaving a 1/2-inch border. Scatter mozzarella over pesto. (Don’t put toppings on crust until ready to broil, to avoid sogginess.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pizzas on hot stone or pan; slide under broiler, about 4 inches from heat source; and broil for 7 or 8 minutes (or as long as needed), until toppings are heated or cooked through, or both, and crust is charred and blistered in spots. Watch closely so that ingredients don’t burn, and move pizza around or lower broiler rack if necessary. (Depending on topping, bottom of crust may start to become soggy; you can slip pizza back onto griddle momentarily to recrisp.) Cut into slices and serve hot."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Recipe Lab: Making Pesto Pizza With Kids", "description": "Julia Moskin cooks simple pesto pizza from “The Batali Brothers Cookbook” with her children.", "thumbnailUrl": "https://static01.nyt.com/images/2013/06/18/dining/video-recipelab-pizza-batali/video-recipelab-pizza-batali-mediumThreeByTwo440.jpg", "uploadDate": "2013-06-18T19:22:41.000Z", "duration": "PT1M52S"}, "link": "https://cooking.nytimes.com/recipes/1014997-family-pizza"}