{"@context": "http://schema.org", "@type": "Recipe", "name": "Crespéu", "description": "Crespéu is a traditional Provençal dish consisting of several frittatas layered one on top of the other. On my summer trips to Provence over the last few years I’ve noticed that the dish has become popular in charcuteries, baked in breadpan-shaped terrines and sold by the slice. These usually consist of three or four different types of frittata and they are different from the stack of thin frittatas that I learned to make years ago. Traditionally you would make these simply by making the frittatas, leaving them a little runny on the top and stacking them, then finishing the stack in the oven or just weighting it with a plate and chilling. But it’s easier and faster (though still quite time consuming) if you’re making the crespéu in a breadpan or tureen to cook the eggs and filling like runny scrambled eggs and layer each batch in a breadpan, then bake in a water bath. You can use 3 eggs in each batch instead of 4, but the layers will be thinner.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/08/17/science/23recipehealth/23recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 8 to 10", "recipeCuisine": "provencal", "recipeCategory": "breakfast", "keywords": "eggs, gluten-free, halal, healthy, kosher, low sugar, nut-free, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "recipeIngredient": ["Ingredients for <a href=\"http://www.nytimes.com/recipes/1014982/Onion-and-Zucchini-Frittata-to-Go.html\">Onion and Zucchini Frittata to Go,</a> using 3 eggs instead of 4 if desired", "Ingredients for <a href=\"http://www.nytimes.com/recipes/1014980/Tomato-Frittata-to-Go.html\">Tomato Frittata to Go,</a> using 3 eggs instead of 4 if desired", "Ingredients for <a href=\"http://www.nytimes.com/recipes/1014983/Greens-and-Garlic-Frittata-to-Go.html\">Greens and Garlic Frittata to Go,</a> using 3 eggs instead of 4 if desired", "Ingredients for <a href=\"http://www.nytimes.com/recipes/1014981/Frittata-With-Peas-Herbs-and-Feta-or-Parmesan.html\">Frittata to Go with Peas, Herbs and Feta or Parmesan,</a> using 3 eggs instead of 4 if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Method 1: Crespéu Terrine", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Line a breadpan (I use a small one, 8 1/2x 4 1/2 inch) with foil and oil the foil with olive oil. Make sure that the foil is tight against the breadpan. Place the breadpan in a larger baking pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling for the onion and zucchini frittata. Beat 3 or 4 eggs in a bowl, season with salt and pepper, beat in the milk and stir in the onion and zucchini mixture. Heat the olive oil in a heavy 8-inch pan over medium heat and add the frittata mixture. Stir the mixture in the pan until it has the consistency of runny scrambled eggs, then scrape into the breadpan and spread in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Next mix together the ingredients for the tomato frittata, using 3 eggs instead of 4 if desired, and proceed as above, transferring the mixture to the breadpan when it has reached the consistency of runny scrambled eggs and spreading in an even layer on top of the onion and zucchini layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat with the greens and garlic frittata, and finally with the peas and herb frittata (you can change the order of layers if you wish). Smooth the top layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the pan that the breadpan is sitting in halfway with hot water and place in the oven. Bake 25 to 30 minutes, until the eggs are set. Remove from the oven and remove the breadpan from the water bath and allow to cool completely. Reverse onto a sheet of plastic wrap and carefully remove the foil. Wrap tightly and refrigerate for at least 2 hours and preferably overnight. Slice and serve cold."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Method 2: Crespéu “Cake”", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil a 7- or 8-inch spring-form pan or cake pan with 3-inch high sides; line with foil if desired and oil the foil. You can also use a 7-inch flexipan (my first choice) for this, in which case no oil is required. Place the pan in a larger baking pan. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using 3 eggs instead of 4 if desired for each frittata, make the frittatas as directed in the recipes but cook on one side only, leaving the top layer runny. Transfer each one to the cake pan, stacking them one on top of the other. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all of the frittatas have been made and stacked, fill the baking pan halfway with hot water and place in the oven. Bake 20 to 25 minutes, until set. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven, remove the cake pan from the water bath and allow to cool completely. Unmold onto a sheet of plastic wrap, wrap tightly and refrigerate for at last 2 hours and preferably overnight. Cut in wedges to serve."}]}], "link": "https://cooking.nytimes.com/recipes/1014984-crespeu"}