{"@context": "http://schema.org", "@type": "Recipe", "name": "Beer-Can Chicken", "description": "The moist environment created by smoke-roasting a chicken vertically, atop a half-full can of beer, turns out to be a nearly fail-safe way to achieve barbecue perfection. A smoky-sweet dry rub adds complexity. The dish can also be made in an oven, in a roasting pan. (You can even buy stainless-steel vertical roasting stands for this very purpose.) What follows is a recipe for a traditional, spice-rubbed version of the dish. But once you have dialed in your technique, feel free to experiment. Coating the chicken with a paste of miso, mirin and soy, then replacing the beer in the can with sake, is one way to start.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/05/15/dining/15COOKING-BEERCAN-CHICKEN3/15COOKING-BEERCAN-CHICKEN3-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "beer, chicken, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 529}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 403, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "3 grams", "proteinContent": "30 grams", "saturatedFatContent": "7 grams", "sodiumContent": "530 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 whole chicken, approximately 4 to 5 pounds", "4 tablespoons sweet paprika, or mild smoked paprika", "2 tablespoons chili powder", "2 tablespoons ground cumin", "1 tablespoon ground coriander", "1 tablespoon brown sugar", "1 tablespoon granulated white sugar", "1 tablespoon freshly ground black pepper", "1 tablespoon kosher salt", "1 tablespoon chile de arbol or red-pepper flakes, or to taste", "1 can beer, ideally yellow in hue, with the top half consumed or poured off", "Barbecue sauce (<a href=\"http://www.nytimes.com/recipes/1014854/White-Barbecue-Sauce.html\">see recipe</a>, or use whichever recipe you like), for basting chicken and for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Build a fire in your grill, leaving approximately half the grilling area free\nof coals. If using a gas grill, turn\nburners to high and then, when ready to cook, turn off the burner on the side where you will place the chicken. If using an oven, heat to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove neck and giblets from chicken. Rinse the chicken in cold water. Pat dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all the spices in a large\nbowl, then apply the dry rub to the chicken, inside and out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the beer can on a solid surface. Pick up the chicken and, taking a leg in each hand, put the cavity over the can and slide the bird down onto it. Carefully transfer the bird and the can to the cool side of your grill, its back to the fire, balancing the chicken upright and using the legs to support it in this position. If using an oven, place the chicken upright in a roasting pan using the same method and place carefully into the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the grill and cook for approximately 1 1/4 hours, basting with barbecue sauce twice during the final half-hour if you'd like, until the breast meat registers 165 degrees on an instant-read thermometer or until the legs are loose in their sockets. (If you’re using an oven, you can tent the bird with foil after 45 minutes to keep the skin from getting too dark.) De-can and carve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with <a href=\"http://www.nytimes.com/recipes/1014854/White-Barbecue-Sauce.html\">white barbecue sauce</a> and corn bread."}], "link": "https://cooking.nytimes.com/recipes/1014853-beer-can-chicken"}