{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Red Thai Jasmine Rice With Shrimp", "description": "Thai-style fried rice is an addiction in our household. If you cannot find Alter Eco’s ruby red jasmine, you can make this dish with red Bhutanese rice or with regular jasmine rice. This may seem like a lot of fried rice, but believe me, you’ll finish it in one sitting. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/02/23/science/24recipehealth/24recipehealth-articleLarge-v2.jpg", "totalTime": "PT10M", "recipeYield": "Serves four generously as a one-dish meal", "recipeCuisine": "thai", "recipeCategory": "dinner, weekday", "keywords": "healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 74}, "recipeIngredient": ["2 tablespoons canola or peanut oil", "8 garlic cloves, minced", "1 large carrot, peeled and cut in 1-inch long julienne", "8 medium or large shrimp about 6 ounces, peeled, deveined and chopped", "6 cups cooked ruby red jasmine rice, red Bhutanese or regular jasmine rice (2 cups uncooked)", "1 bunch scallions, trimmed, cut in half lengthwise and then into 1-inch lengths", "2 tablespoons Thai or Vietnamese fish sauce (omit if sodium is an issue; the high sodium content in this recipe comes from the fish sauce)", "2 to 4 tablespoons chopped cilantro", "Chopped cilantro", "Thinly sliced cucumber", "Lime wedges", "Scallions", "Fish sauce with hot chilies (nam pla prik)", "Chopped roasted peanuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large wok or large, heavy nonstick skillet over medium-high heat until a drop of water evaporates upon contact. Add the oil, tilt to spread across the pan, and add the carrot and shrimp. Stir-fry until the shrimp is pink and opaque, about two minutes. Add the garlic, and stir-fry just until golden, 15 to 30 seconds. Add the rice. Stir-fry for about two minutes by scooping the rice up, then pressing it into the pan and scooping it up again. The rice should have a seared taste. Add the scallions and fish sauce, stir together for a half-minute to a minute and transfer to a platter. Sprinkle the cilantro over the top, and serve, passing the garnishes of your choice. Diners should squeeze lime juice onto their rice as they eat."}], "link": "https://cooking.nytimes.com/recipes/1014141-fried-red-thai-jasmine-rice-with-shrimp"}