{"@context": "http://schema.org", "@type": "Recipe", "name": "Hummus from ‘Jerusalem’", "description": "There’s a lot of unattended prep time in this recipe from Yotam Ottolenghi for hummus, which was featured in The Times in 2013. The unusual yet helpful addition of baking soda speeds the process. Cooking the chickpeas with baking soda softens them, allowing for less time on the stove as well as a smoother, creamier finished product. (If you find that your hummus is too stiff, loosen it with a little water.) A plate of this hummus served with fresh pita, chopped olives and pine nuts makes for a perfect lunch.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2013/07/31/dining/31JERUSALEM3/31JPJERUSALEM3-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 2 cups", "recipeCuisine": "middle eastern", "recipeCategory": "dips and spreads", "keywords": "vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1029}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 645, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "14 grams", "proteinContent": "25 grams", "saturatedFatContent": "5 grams", "sodiumContent": "409 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 1/4 cups dried chickpeas (250 grams)", "1 teaspoon baking soda", "1 cup plus 2 tablespoons light tahini paste (270 grams)", "4 tablespoons freshly squeezed lemon juice", "4 cloves garlic, crushed", "Salt", "6 1/2 tablespoons ice-cold water (100 milliliters)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put chickpeas in a large bowl and cover with cold water at least twice their volume. Leave to soak overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, drain chickpeas. In a medium saucepan, combine drained chickpeas and baking soda over high heat. Cook for about 3 minutes, stirring constantly. Add 6 1/2 cups water and bring to a boil. Cook at a simmer, skimming off any foam and any skins that float to the surface, from 20 and 40 minutes, depending on the type and freshness. Once done, they should be very tender, breaking easily when pressed between your thumb and finger, almost but not quite mushy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain chickpeas. You should have roughly 3 cups (600 grams) now. Place chickpeas in a food processor and process until you get a stiff paste. Then, with the machine still running, add tahini paste, lemon juice, garlic and 1 1/2 teaspoons salt. Slowly drizzle in ice water and allow it to mix for about 5 minutes, until you get a very smooth and creamy paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer hummus to a bowl, cover surface with plastic wrap, and let it rest for at least 30 minutes. If not using immediately, refrigerate until needed, up to two days. Remove from fridge at least 30 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1014943-hummus-from-jerusalem"}