{"@context": "http://schema.org", "@type": "Recipe", "name": "Granola", "description": "This somewhat clumpy granola isn’t too sweet, so you can feel a little virtuous when you snack on it. It is best to eat it soon after baking, while the clumps still hold; they will eventually fall apart once you put the granola in a jar, but there are enough right after you bake it to qualify it as snacking food in addition to breakfast. Don’t stir it when you bake it and when it is done let it cool completely on the baking sheet; that is the trick to clumping. The technique of leaving a “donut hole” in the middle when you spread the granola on the baking sheet comes from www.brighteyedbaker.com. It helps the granola bake evenly. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/12/17/health/19recipehealth/19recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Makes about 8 cups", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "appetizer, dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-sodium, vegan, vegetarian, dried fruit, nuts, oats, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 223}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 273, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "4 grams", "sodiumContent": "4 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 cups flaked or rolled oats", "1 cup oat bran", "1 cup coconut chips", "1 cup chopped or slivered nuts (almonds, pecans, cashews)", "1/2 to 1 teaspoon freshly grated nutmeg (to taste)", "1 to 2 cups raisins or other chopped dried fruit (optional)", "1 tablespoon ground cinnamon", "1/2 teaspoon salt (optional)", "6 tablespoons canola oil, grape seed oil or rice bran oil", "6 tablespoons mild honey, such as clover (add a tablespoon or 2 more if you want it sweeter)", "1 tablespoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 300 degrees. Line two baking sheets with parchment. Toss together all of the dry ingredients in a very large bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the oil, honey, and vanilla in a saucepan and warm over low heat, stirring, just until the mixture is fluid. Do not let it come to a simmer. Remove from the heat and stir into the dry ingredients. Mix until evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the granola mixture on the sheet pans in an even layer, leaving a donut hole in the center (for even baking) and bake on the middle and lower racks, without stirring, for 30 to 40 minutes or until golden, rotating the baking pans front to back and top to bottom halfway through. Remove from the heat and allow to cool before breaking up into clumps. Store in well sealed jars, bags or containers."}]}