{"@context": "http://schema.org", "@type": "Recipe", "name": "Puréed Broccoli and Celery Soup", "description": "Celery adds a new dimension to the flavor of this soup and harmonizes with the broccoli. When you cook broccoli for more than 8 to 10 minutes the color fades, so I add a little spinach at the end of cooking to brighten up the color.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/01/22/science/25recipehealth/25recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "broccoli, celery, potato, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-fat, low-sodium, nut-free, vegetarian, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 248}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 158, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1355 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 medium onion, chopped", "4 stalks celery, diced", "2 to 4 garlic cloves, to taste, minced", "2 pounds broccoli, mostly crowns, chopped; stems, if using, peeled and diced", "6 ounces potatoes, peeled and diced, or 1/2 cup medium grain rice", "2 quarts water or vegetable stock ", "A bouquet garni made with a bay leaf, a Parmesan rind, and a couple of sprigs each thyme and parsley ", "Salt and freshly ground pepper to taste", "1 1/2 ounces spinach leaves or baby spinach (1 cup, tightly packed)", "2 tablespoons chopped fresh herbs, such as parsley, tarragon, chives, for garnish", "A drizzle of olive oil", "a swirl of crème fraiche or plain yogurt", "a sprinkle of freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy soup pot or Dutch oven and add the onion and celery. Cook, stirring, until tender, about 5 to 8 minutes. Do not allow these ingredients to brown. Add a generous pinch of salt to prevent this from happening (the salt draws out liquid from the vegetables). Add the garlic and cook, stirring, until the garlic smells fragrant, 30 seconds to 1 minute. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the broccoli, potatoes or rice, water or stock, bouquet garni, and salt, and bring to a boil. Reduce the heat, cover and simmer 30 minutes. Remove the bouquet garni. Stir in the spinach and let sit for a minute off the heat. Add freshly ground pepper, taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a hand blender, or in batches in a regular blender, purée the soup. If using a regular blender fill only half way and cover the top with a towel pulled down tight, rather than airtight with the lid, because hot soup will jump and push the top off if the blender is closed airtight. Return to the pot and heat through, stirring. Adjust seasoning to taste with salt and pepper. Serve, topping each bowl with a sprinkle of chopped herbs and with other garnishes of your choice."}]}