{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken, Chermoula and Vegetable Sandwich", "description": "A delicious sandwich featuring grated carrots, arugula and roasted red pepper.<br/><br/>Chermoula, the spicy Tunisian pesto-like sauce made with copious amounts of cilantro, parsley, garlic, olive oil and spices is a great sandwich condiment. I paired it with pan-cooked chicken breast and built up a delicious sandwich with grated carrots, arugula, and roasted red pepper.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/03/26/science/29recipehealth/29recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "1 sandwich", "recipeCuisine": "", "recipeCategory": "easy, lunch, quick, sandwiches", "keywords": "chicken breast, focaccia, vegetables, dairy-free, halal, healthy, high fiber, kosher, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "recipeIngredient": ["Roasted pepper ", "1 tablespoon chermoula ", "1 5-inch square focaccia (preferably whole wheat), split in half, or 2 slices whole wheat country bread", "2 1/2 ounces sliced cooked chicken breast ", "1 heaped tablespoon grated carrots ", "A handful of arugula or spinach (1/2 ounce) tossed with a little lemon juice", "1/3 of a roasted red pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook the chicken breast, heat a heavy skillet over high heat. Season a boneless, skinless chicken breast with salt and pepper. Add about 2 teaspoons canola oil to the pan and carefully place the chicken breast in the pan, rounded side down. Turn the heat to medium. Cook 4 to 5 minutes per side (depending on the thickness; there should be no hint of pink) and remove from the heat. Allow to cool for at least 5 minutes. Slice across the grain about 1/4 to 1/3 inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread chermoula on the top and bottom slices of bread or focaccia. Top with a layer of chicken slices. Top the chicken slices with grated carrot, then arugula or spinach, and finally the roasted pepper. Cover with the top slice of bread and press down. Cut in half and wrap or serve."}], "link": "https://cooking.nytimes.com/recipes/1014633-chicken-chermoula-and-vegetable-sandwich"}