{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom and Spinach Frittata", "description": "Use bagged, presliced mushrooms and baby spinach for this and it will come together very quickly. The frittata is great for dinner, breakfast, brunch or lunch.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/02/05/science/06recipehealth/06recipehealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 6", "recipeCuisine": "spanish", "recipeCategory": "dinner, easy", "keywords": "eggs, mushroom, spinach, gluten-free, halal, healthy, kosher, low-carb, low-sodium, low sugar, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 646}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 143, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "10 grams", "saturatedFatContent": "2 grams", "sodiumContent": "334 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 10 ounce bag presliced mushrooms", "Salt and freshly ground pepper", "1 to 2 garlic cloves (to taste), minced", "1 6-ounce bag baby spinach, rinsed", "8 eggs", "1/4 cup grated Parmesan (optional)", "2 tablespoons low-fat milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium-high heat in a heavy 10 or 12-inch nonstick skillet and add the mushrooms. Cook, stirring or tossing often, until they begin to sweat and soften, 3 to 5 minutes. Add salt, pepper and the garlic, and stir together until the garlic is fragrant, 30 seconds to a minute. Add the spinach, a handful at a time and stir until wilted. Turn up the heat and let any excess liquid evaporate from the pan, then remove from the heat. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl (you can do this while the mushrooms are cooking). Stir in salt and pepper to taste, the milk, and the mushroom and spinach mixture. Add the Parmesan if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining olive oil over medium-high heat in the skillet until it feels hot when you hold your hand about 1 inch above it. Drop a bit of egg into the pan and if it sizzles and cooks at once, the pan is ready. Pour in the egg mixture, scraping all of it in with a rubber spatula. Swirl the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the frittata with the spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking. Once a few layers of egg have cooked turn the heat down to low, cover (use a pizza pan if you don’t have a lid that will fit your skillet), and cook 10 minutes, shaking the pan gently every once in a while. From time to time remove the lid and loosen the bottom of the omelet with a spatula, tilting the pan, so that the bottom doesn’t burn. It will however turn golden. The eggs should be just about set though there will be a layer on the top that is not. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the broiler. Uncover the pan and place under the broiler, not too close to the heat, for 1 to 2 minutes, until the top sets, watching very carefully to make sure the top doesn’t burn (at most, it should brown very slightly and puff under the broiler). Remove from the heat, shake the pan to make sure the frittata isn’t sticking and allow it to cool for at least 5 minutes and for up to 15. It can be a little runny in the middle if you like it that way. Loosen the edges with a spatula. Carefully slide from the pan onto a large round platter. Cut into wedges. Serve hot, warm, room temperature, or cold."}], "link": "https://cooking.nytimes.com/recipes/1014523-mushroom-and-spinach-frittata"}