{"@context": "http://schema.org", "@type": "Recipe", "name": "Penne With Brussels Sprouts, Chile and Pancetta", "description": "Pasta and sliced brussels sprouts make a good pair, the softened green shreds commingling with the chewy noodles in the sauce. Here that sauce is a simple one with big flavors: pancetta, rosemary, garlic and chile. The raw brussels are then added to the pan. A splash of lemon juice at the end is a bright touch. Within 30 minutes, dinner is ready. Vary this recipe at will — use regular bacon instead of pancetta, or skip the meat altogether and use extra cheese to make a satisfying vegetarian main course. Use a knife or a food processor (fitted with the slicing blade) to cut the brussels. A mandoline works too but isn’t necessary, because the brussels don’t need to be paper thin, or uniform in size. These are unfussy slices you can do by hand.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2012/11/28/dining/28APPETITE_SPAN/28APPETITE_SPAN-articleLarge-v3.jpg", "totalTime": "PT20M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, pastas", "keywords": "brussels sprouts, pancetta, penne, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 676}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 701, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "100 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "9 grams", "proteinContent": "25 grams", "saturatedFatContent": "9 grams", "sodiumContent": "668 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Sea salt", "8 ounces penne", "2 tablespoons extra virgin olive oil, more for drizzling", "3 ounces pancetta, diced", "1 large rosemary sprig", "6 garlic cloves, smashed and peeled", "1 jalapeño or Serrano chile, thinly sliced (or substitute 1 large pinch crushed red pepper flakes)", "Freshly ground black pepper", "8 ounces brussels sprouts, thinly sliced", "2 teaspoons butter", "Fresh lemon juice, for serving", "Freshly grated pecorino cheese (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring large pot heavily salted water to a boil. Add the penne and cook until pasta is just al dente (do not overcook)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat large sauté pan over high heat and add the olive oil. When oil is hot, add the pancetta and rosemary, and sauté until the fat on the pancetta starts to turn translucent and very lightly brown, about 1 minute. Add the garlic, chile and freshly ground black pepper to taste, and sauté until garlic and pancetta turn richly brown, about 3 minutes. Add the brussels sprouts, a large pinch of salt and a splash of water to pan, and sauté until sprouts just start to soften, about 2 minutes. Spread sprouts mixture in pan and press down to flatten. Let it sear for a minute, then stir it up and repeat. This helps brown the sprouts. Add the butter, and sauté for another minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain penne and add it to pan with brussels sprouts mixture. Cook, tossing, until everything is well mixed. Spoon into pasta bowls and top with a drizzle of oil and lemon juice, and a little cheese if you like."}], "link": "https://cooking.nytimes.com/recipes/1014359-penne-with-brussels-sprouts-chile-and-pancetta"}