{"@context": "http://schema.org", "@type": "Recipe", "name": "Pain au Levain", "description": "", "author": {"@type": "Person", "name": "Jill Santopietro"}, "image": null, "totalTime": "PT20H30M", "recipeYield": "", "recipeCuisine": "french", "recipeCategory": "project", "keywords": "appetizer, bread flour, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 28}, "recipeIngredient": ["1/3 cup (2 1/2 ounces) mother starter recipe here, cold or at room temperature", "1 cup plus 2 tablespoons (5 ounces) unbleached bread flour", "2/3 cup (3 ounces) whole-wheat flour", "2/3 cup (5 4/10 ounces) water, at room temperature", "All of the sourdough starter (16 ounces)", "1 cup plus 6 tablespoons 11 ounces lukewarm water (about 95 degrees)", "2 1/4 teaspoons (7 grams) instant yeast (optional)", "3 1/2 cups (16 ounces) unbleached bread flour", "2 3/8 teaspoons (17 grams) salt, or 3 1/2 teaspoons coarse kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the sourdough starter", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sourdough starter. Combine all of the ingredients in a mixing bowl. If using a mixer, mix on the lowest speed using the paddle attachment for 1 minute, then increase to medium speed for about 30 seconds. If mixing by hand, use a large spoon and stir for about 2 minutes, until well blended. The starter should feel dough-like and tacky or slightly sticky; if not, stir in additional flour (if too sticky) or water (if dry) as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the starter to a lightly floured work surface and knead for about 30 seconds. Place it in a clean, lightly oiled bowl, cover the bowl loosely, and leave at room temperature for 6 to 8 hours, until the starter increases to about 1 1/2 times its original size. If you plan to use the starter the same day, allow 1 more hour of fermentation so that it nearly doubles in size. Otherwise, put the starter in the refrigerator for up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: cut the starter into 10 to 12 pieces and put them in a mixing bowl. Pour in the water, then add the yeast (if using) and mix with the paddle attachment on the lowest speed or by hand with a large spoon for about 1 minute to soften the starter. Add the flour and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Switch to the dough hook and mix on the lowest speed, or continue mixing by hand, for 3 minutes, to form a coarse ball of dough that's very tacky and slightly warm. Let the dough rest for 5 minutes. Resume mixing on medium-low speed for 3 minutes more or knead by hand for 3 minutes, adding more flour or water as needed to make a soft, supple and tacky by not sticky ball of dough."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the dough", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Knead the dough by hand for a few seconds, then form it into a ball. Let the dough sit uncovered for 10 minutes, then do a stretch and fold, either on the work surface or in the bowl. To do this, reach under the front end of the dough, stretching it toward you, then fold it back onto the top of the dough. Do this from the back end and then from each side, then flip the dough over and tuck it into a ball. Cover the dough and let it rest for 10 minutes. Repeat this entire process two more times, completing all repetitions within 30 minutes. Immediately form the dough into a ball, place it in a clean, lightly oiled bowl large enough to contain the dough when it doubles in size, and cover the bowl tightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using instant yeast, refrigerate the dough immediately. If not using the yeast, let the dough sit at room temperature for 2 hours before refrigerating; it won't rise very much, but it should show signs of growth and continue to rise in the refrigerator. With or without the instant yeast, both will be ready to use the next day and for up to 4 days. (If you plan to bake the dough in batches over different days, you can portion the dough and place it into two or more oiled bowls at this stage.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To bake the no-yeast version, remove the dough from the refrigerator about 4 hours before you plan to bake it; after 2 hours, shape it, then let it proof (i.e., rest covered with a cotton or linen dishtowel) for 2 hours before baking. For the yeast version, remove the dough from the refrigerator 2 hours prior to baking and shape it right away. Remove only the portion you wish to bake: 19 ounces for a 1-pound loaf; 28 ounces for a 1 1/2-pound loaf, and so on. You can also bake the entire amount of dough as a large, 3-pound miche (round country loaf) or as a large torpedo loaf. Gently transfer it from the bowl to a lightly floured work surface, being careful to degas it as little as possible. The shaped dough won't increase in size very much, but it will begin to swell and grow. If it grows to 1 1/2 times its original size in less than 2 hours, move on to scoring and baking it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a baking stone, about 45 minutes before baking, preheat the oven to 500 degrees. Otherwise, set the oven to 500 degrees about 20 minutes before baking and preheat a baking sheet covered with parchment paper. Place a small sheet pan or lasagna pan under the stone or oven rack to act as a steam pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before baking, score the dough by using a blade or sharp knife to cut ½-inch deep lines into it. (A pound sign or cross are two suggested scoring patterns.) Transfer the dough to either the warmed baking sheet or stone. Pour 1 cup of hot water into the steam pan (a watering can or tall plastic pitcher is best for this), then lower the oven temperature to 450 degrees or to 425 if baking a large miche. (Note: If your oven has a glass window, cover it with a towel when adding the water to prevent cracking, then remove after a few minutes.)"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 12 minutes, then rotate the pan and continue baking for 15 to 25 minutes, or longer, depending on the size of the loaf; a large miche could take up to 75 minutes to bake. When fully baked, the crust should have a rich, caramelized color; the loaf should sound hollow when thumped on the bottom; and the internal temperature should be about 200 degrees in the center. Cool on a wire rack for at least 1 hour before slicing or serving."}]}]}