{"@context": "http://schema.org", "@type": "Recipe", "name": "Blueberry Yogurt Parfait", "description": "The beneficial phytonutrients in blueberries are anthocyanins, a type found in other fruits and vegetables with red, blue and purple pigments. Scientists use a test called the O.R.A.C. (short for oxygen radical absorbance capacity) to rate the antioxidant capacity in foods, and by this measure blueberries always come out on top. So if red wine is off limits and beets just aren’t your thing, try adding a half cup of blueberries to your cereal or yogurt in the morning, throw a half cup of frozen blueberries into your smoothie — or try any of this week’s recipes. This beautiful parfait tastes so much richer than it is. You can serve it for breakfast or for dessert. Look for organic yogurt that has no thickeners or gums added to it.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/01/25/health/25recipehealth_600/25recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT1H20M", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "easy, sauces and gravies", "keywords": "dessert, healthy", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 39}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 220, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "2 grams", "proteinContent": "16 grams", "saturatedFatContent": "2 grams", "sodiumContent": "48 milligrams", "sugarContent": "26 grams", "transFatContent": null}, "recipeIngredient": ["2 cups blueberries", "1/4 cup sugar", "1 tablespoon freshly squeezed lime juice", "1/2 teaspoon balsamic vinegar", "2 cups drained low-fat yogurt or low-fat Greek style yogurt", "1 tablespoon shelled pistachios, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the blueberries, sugar, lime juice and balsamic vinegar in a medium saucepan, and bring to a boil over medium heat. Cook for five to 10 minutes, until the liquid is reduced and the blueberries have cooked down to a jam-like consistency. Allow to cool. You should have about 1 cup of thick, jammy sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon 1/4 cup thick yogurt into the bottom of each of 4 tumblers or parfait glasses. Top with 2 tablespoons of the blueberry sauce. Make another 1/4 cup layer of yogurt on top of the blueberry sauce, and finish with another 2 tablespoon-layer of blueberry sauce. Cover tightly and chill for at least 1 hour. Just before serving, sprinkle finely chopped pistachios over the top."}], "link": "https://cooking.nytimes.com/recipes/1014054-blueberry-yogurt-parfait"}