{"@context": "http://schema.org", "@type": "Recipe", "name": "Seasoned Blanched Kale", "description": "Stem the kale and wash the leaves in 2 changes of water (not necessary if using bagged, cleaned and stemmed kale). Bring a large pot of water to a rolling boil, add salt to taste and the kale. Blanch for 3 minutes, then transfer to a bowl of cold water to stop the cooking, and drain. Take the blanched kale up by the handful and squeeze hard to expel excess water, then chop fine.<br/><br/>For seasoned kale, heat 1 tablespoon extra virgin olive oil over medium heat in a heavy, medium size skillet and add 1 to 2 minced garlic cloves. Cook until the garlic begins to sizzle and smell fragrant, 30 seconds to a minute. Add the kale and salt and pepper to taste, and stir and toss in the pan for about a minute, until nicely infused with the oil and garlic. If desired, add 1 teaspoon each chopped fresh thyme and chopped fresh rosemary (for a 12-ounce bunch of kale) along with the garlic.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/03/23/science/25recipehealth/25recipehealth-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "About 1/2 cup / 5 ounces/ 150 g", "recipeCuisine": "", "recipeCategory": "easy, lunch, quick", "keywords": "healthy, kale, pesto", "aggregateRating": null, "recipeIngredient": ["Parsley Pesto", "2 garlic cloves, halved, green shoot removed, roughly chopped", "Salt to taste", "2 cups, tightly packed, flat-leaf parsley leaves, coarsely chopped", "1 tablespoon, tightly packed, mint leaves, coarsely chopped", "1/3 cup extra virgin olive oil, as needed", "6 tablespoons freshly grated Parmesan", "Freshly ground pepper (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on a food processor fitted with the steel blade and drop in the garlic. When it is chopped and adhering to the sides of the bowl stop the machine and scrape down the bowl. Alternatively, mash with a generous pinch of salt in a mortar and pestle. Add the parsley and mint to the food processor (or to the mortar and pestle) and process until finely chopped or grind to a paste. With the machine running slowly add the olive oil and process until the mixture is smooth (or slowly work into the mixture using a mortar and pestle). Stop the machine, scrape down the sides of the bowl and add the cheese. Pulse to combine."}]}