{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Lamb Shoulder With Spring Vegetables", "description": "Here is a simple and gorgeous main dish that both celebrates spring and tastes like it. The perfect meal for a long, lazy afternoon or a Sunday evening. Boneless shoulder of lamb is ideal because you can smear the interior with garlic and mint. Favas, peas, asparagus and artichokes sparkle alongside.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/04/03/dining/03KITCH4/03KITCH4-articleLarge-v4.jpg", "totalTime": "PT2H20M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "lamb shoulder, vegetables, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 85}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 194, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "502 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["1 boneless lamb shoulder roast, trimmed of most exterior fat", "Salt and pepper", "2 or 3 garlic cloves, smashed to a paste", "4 tablespoons roughly chopped mint", "3 tablespoons fruity extra-virgin olive oil", "1 bunch young carrots, preferably heirloom, about 1/2 pound, peeled and halved lengthwise", "1 large onion, diced", "6 baby artichokes, trimmed and halved, optional", "2 garlic cloves, minced", "1 1/2 cups fava beans (from 3 pound pods), blanched and peeled", "3/4 pound medium asparagus, cut in 1-inch lengths", "1/4 pound snow peas or 1 cup English peas", "2 tablespoons roughly chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season lamb inside and out with salt and pepper. Smear interior with garlic paste and 3 tablespoons chopped mint. Press meat together in a long oval shape, then tie securely with butcher’s twine. Drizzle with 1 tablespoon olive oil and massage evenly over roast. Leave at room temperature for 1 hour, or refrigerate for up to several hours, even overnight. (If refrigerating, bring to room temperature before proceeding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. An hour or so before you plan to eat, put lamb on a rack in a roasting pan and cook for about 40 minutes, until an instant-read thermometer registers 125 degrees for medium rare. Let meat rest for at least 20 minutes (up to 45 minutes is fine) before slicing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook carrots in simmering salted water until just done, 5 to 7 minutes. Rinse in cold water to cool, then drain and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide, deep skillet with a lid, heat 2 tablespoons olive oil over medium-high. Add onion and artichoke, if using, and season with salt and pepper. Let sizzle and color a bit, then reduce heat and cook for about 10 minutes, until onion and artichoke are softened. Stir in garlic. (You may prepare onions and artichoke up to this point in advance.) Turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 5 minutes before serving, set heat under skillet to medium-high. Add fava beans, asparagus, carrots and snow peas. Season well with salt and stir gently to mix, then add 1/2 cup water and put on lid. Let cook for about 4 minutes more, until vegetables are done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice lamb and arrange on a large platter. Spoon vegetables around meat, sprinkle with parsley and remaining tablespoon of chopped mint."}], "link": "https://cooking.nytimes.com/recipes/1014651-roast-lamb-shoulder-with-spring-vegetables"}