{"@context": "http://schema.org", "@type": "Recipe", "name": "Chard Leaves Stuffed With Rice and Herbs", "description": "Large chard leaves make beautiful rolls. I dice the meaty stems and cook them with onion and garlic, then combine them with medium-grain rice and lots of fresh herbs. The stems add great texture to the filling.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/04/16/science/16recipehealth/16recipehealth-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "8 rolls, serving 4 as a side dish or appetizer", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "appetizer, brown rice, chard, fresh herbs, dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "recipeIngredient": ["8 large chard leaves", "2 tablespoons extra virgin olive oil", "1 large onion, finely chopped", "Stems from the chard leaves", "2 large garlic cloves, minced", "1 cup, tightly packed, cooked medium-grain white or brown rice, such as Calrose", "1/4 cup finely chopped fresh parsley", "2 tablespoons finely chopped fresh mint", "1/2 teaspoon Aleppo pepper (more to taste)", "1/4 cup currants (optional)", "Greek yogurt seasoned with garlic, lemon and sumac for serving", "Optional: crumbled feta for the filling or for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and blanch the chard leaves and stems for 20 to 30 seconds. Transfer to a bowl of cold water, then drain and cut away the stems at the base. Next cut out the wide part of the stem remaining inside the leaf, cutting a V at the base where it connects with the leaf. Set aside the leaves and cut the stems into small dice (about 1/4 inch). Set aside 1/2 cup of the blanching water for the baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil in a large, heavy skillet over medium-low heat and add the onion. Cook, stirring until very soft, about 8 minutes. Add the diced chard stems and a generous pinch of salt and continue to cook until the stems are tender, about 5 minutes. Stir in the garlic and cook, stirring, until fragrant, 30 seconds to a minute. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Oil a baking dish that can accommodate all of the chard rolls. In a large bowl mix together the rice, onion mixture, herbs, Aleppo pepper and currants if using. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 2 tablespoons of the filling on each chard leaf. Tuck the sides over the filling and roll up the leaves. Place in the baking dish. Drizzle the remaining olive oil over the top and place 1/2 cup water in the baking dish. Cover with foil and bake 20 minutes, until the chard rolls are hot and the leaves tender. They should retain their bright green color."}]}