{"@context": "http://schema.org", "@type": "Recipe", "name": "Banana Muesli Smoothie", "description": "Years ago, before the term “super foods” was a part of our lexicon, I would always add a handful of chia seeds to my whole-grain bread dough. I knew the seeds were high in protein (chia, like quinoa, has all of the essential amino acids), and in those days vegetarians were obsessed with proving that we could get enough protein from plant sources. I didn’t use chia seeds in other recipes, and eventually I forgot about them. But chia seeds have made a comeback. They are not only high in protein, but higher in omega-3 fatty acids than flaxseeds.  They’re a great source of fiber, phytochemicals, phosphorus and manganese, and they also contain calcium. If you want a delicious smoothie that will see you through a morning workout, this is it. Soak the muesli in water or milk the night before.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/05/21/science/20recipehealth/20recipehealth-articleLarge.jpg", "recipeYield": "1 serving", "recipeCuisine": "", "recipeCategory": "breakfast, easy, shakes and smoothies", "keywords": "banana, chia seeds, muesli, halal, healthy, high fiber, kosher, low cholesterol, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 338, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "11 grams", "proteinContent": "10 grams", "saturatedFatContent": "2 grams", "sodiumContent": "325 milligrams", "sugarContent": "34 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup muesli", "3 tablespoons low-fat milk or water", "1 tablespoon soaked chia seeds (1 teaspoon dry unsoaked)", "1 small banana (4 ounces without the skin)", "1 heaped teaspoon almond butter (I prefer toasted unsalted)", "1 teaspoon honey", "1 cup yogurt, milk, almond or rice beverage, coconut water or soy milk", "1 or 2 ice cubes (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The night before, place the muesli in a small bowl or ramekin and cover with 3 tablespoons milk or water. Refrigerate overnight. To soak the chia seeds, place in a jar or bowl and add 4 tablespoons water for every tablespoon of chia seeds. Place in the refrigerator for several hours or overnight. The seeds and water will be become gelatinous. The measure of 1 tablespoon includes the seeds and the gelatinous liquid that enrobes them after soaking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop up a tablespoon of seeds with the gooey liquid and place in a blender (don’t worry, your smoothie won’t have this consistency). AddPlace the soaked muesli along with any liquid remaining in the bowl in a blender. Add the remaining ingredients and blend until smooth."}], "link": "https://cooking.nytimes.com/recipes/1014741-banana-muesli-smoothie"}