{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry, Raspberry, Pecan Conserve", "description": "", "author": {"@type": "Person", "name": "Cathy Barrow"}, "image": "https://static01.nyt.com/images/2012/12/19/dining/19CRANBERRIES_SPAN/19CRANBERRIES_SPAN-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "4 half pints or 2 pints", "recipeCuisine": "", "recipeCategory": "", "keywords": "cranberry, pecan, raspberries, side dish, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 23}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1078, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "191 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "30 grams", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "7 milligrams", "sugarContent": "153 grams", "transFatContent": null}, "recipeIngredient": ["8 ounces pecans ", "1 pound (16 ounces) fresh cranberries", "4 half-pints raspberries", "3 cups sugar", "Juice of one lemon", "1 Tablespoon orange zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet, toast pecans over medium heat, shaking pan to avoid burning. In about 8 minutes, nuts will become fragrant and smell toasty; remove from heat and chop."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy pot, bring cranberries, raspberries, sugar, lemon juice and zest to a boil. Remove from heat, pour into a ceramic or glass bowl, then cover and refrigerate overnight. If not canning, add pecans and serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If canning, put a rack in a large stockpot or line the pot with a folded kitchen towel. Fill with water and bring to a boil. Add 4 half-pint canning jars or two pint-size canning jars and boil for 10 minutes. Jars may be left in the warm water in the pot until ready to be filled. Alternatively, sterilize the jars by running them through a dishwasher cycle, leaving them there until ready to fill. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place canning rings in a small saucepan, cover with water and bring to a boil. Turn off the heat and add the lids to soften their rubber gaskets. Rings and lids may be left in the water until jars are filled. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the cranberry raspberry mixture through a sieve over a heavy pot, then place the strainer in a bowl to catch any additional syrup. Reserve the fruit solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring liquid to a boil. When syrup reaches 220 degrees, or an active boil that cannot be stirred down, add back the fruit and any juices that have accumulated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the mixture back to a hard boil, stirring constantly. Add the pecans, and then cook until the conserve is at a boil that cannot be stirred down and has thickened to a jammy consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the jars from the pot. Ladle hot conserve into the hot jars, leaving 1/2-inch head space. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe jar rims with a damp towel. Place lids on jars, screw on rings and lower jars back into the pot of boiling water. Return to a full boil and boil the jars for 15 minutes for half pints, 20 minutes for pints. Transfer jars to a folded towel and allow to cool for 12 hours; you should hear jars ping as they seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cool, test seals by removing rings and lifting jars by the flat lid. If the lid releases, the seal has not formed. Unsealed jars should be refrigerated and used within a month, or reprocessed. Rings and jars may be reused, but a new flat lid must be used each time jars are processed. To reprocess, reheat conserve to boiling, then continue as before."}], "link": "https://cooking.nytimes.com/recipes/1014422-cranberry-raspberry-pecan-conserve"}