{"@context": "http://schema.org", "@type": "Recipe", "name": "Oven-Baked Millet", "description": "Deborah Madison, in her wonderful new cookbook, “Vegetable Literacy,” put a new spin on millet that may have changed my millet-cooking life forever. She suggests cooking the grain as you would a polenta, which it kind of resembles when it’s cooked, with most of the grains breaking down to a mush while others remain crunchy. I’d always been a bit flummoxed by this uneven cooking and the texture of the broken-down millet (it’s a bit chalky). But serving it like a polenta makes perfect sense. You can serve it soft, right after it’s cooked, or let it set up and then slice it and crisp the slices or use them in gratins, as I do with cornmeal polenta. I was so taken with this idea that I decided to cook the millet in the oven, the way I do for my easy cornmeal polenta, after first toasting it in the pan. It worked beautifully.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/06/11/science/14recipehealth/14recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H10M", "recipeYield": "4 to 6 servings.", "recipeCuisine": "", "recipeCategory": "", "keywords": "gluten-free, halal, healthy, kosher, low cholesterol, low-fat, low sugar, nut-free, vegetarian, millet, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 169, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "466 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 cups water (or stock)", "1 cup millet", "1 teaspoon salt", "1 tablespoon butter (more to taste)", "1/3 cup freshly grated Parmesan", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Heat a 10-inch cast-iron skillet over medium-high heat and add the millet. Toast, stirring or shaking the pan, until the grains begin to pop and smell toasty, sort of like popcorn. Add the water or stock and the salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pan to the preheated oven. Set the timer for 25 minutes and give the millet a stir. Bake for another 25 minutes. There should still be some liquid in the pan. Stir in the butter and bake for another 5 to 10 minutes, until the millet is thick and no more water or stock is visible in the pan. Remove from the oven; if desired, stir in the Parmesan. Serve right away, topped with tomato sauce or a stew. Alternatively, allow to cool, either in the pan or spread in a small sheet pan, baking dish or cake pan; when it is solid, cut into squares, slices or rounds, which you can grill, fry or layer in a gratin."}], "link": "https://cooking.nytimes.com/recipes/1014795-oven-baked-millet"}