{"@context": "http://schema.org", "@type": "Recipe", "name": "Small Apricot Galettes", "description": "I use my yeasted dessert galette pastry for these individual free-form tarts. The tarts are simple and rustic, meant to show off apricots in season. For the pastry: The easiest way to work with this pastry dough is to freeze the thin disks right after rolling out. They’ll thaw in no time. You need only half of the dough for the individual galettes, unless you want to double the filling quantities and make 16. They freeze well.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/07/06/science/12recipehealth/12recipehealth-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 individual galettes", "recipeCuisine": "", "recipeCategory": "", "keywords": "apricot, dessert, halal, healthy, high fiber, kosher, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 14}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 305, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "159 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 grams (1 1/2 teaspoons) active dry yeast", "115 grams (1/2 cup) lukewarm water", "2 tablespoons plus 1/4 teaspoon sugar", "1 large egg, at room temperature, beaten", "135 grams (1 cup) whole-wheat flour", "155 grams (1 1/4 cups) unbleached flour", "25 grams (1/4 cup) almond powder (also known as almond flour; optional; substitute whole-wheat flour if not using)", "1/2 teaspoon salt", "60 grams (4 tablespoons) unsalted butter at room temperature", "1 1/2 pounds apricots, pitted and halved or quartered, depending on the size", "3 tablespoons lightly toasted slivered almonds", "1 teaspoon vanilla extract", "1/4 teaspoon freshly grated nutmeg", "1 teaspoon cinnamon", "3 tablespoons turbinado or brown sugar", "25 grams (1/4 cup) almond powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dissolve the yeast in the water, add 1/4 teaspoon of the sugar, and allow to sit until the mixture is creamy, about 5 minutes. Beat in the egg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together the flours, 2 tablespoons sugar, and salt into the bowl of a standing mixer fitted with the paddle; you can also use a large bowl. Add the butter and beat at low speed or work with your fingers until the mixture is crumbly. Add the yeast mixture and beat on low speed or stir until the ingredients come together. Turn out onto a lightly floured surface and knead gently just until the dough is smooth, about a minute. Shape into a ball. Place in a lightly buttered bowl, cover the bowl with plastic wrap, and allow the dough to rise in a draft-free spot until doubled in size, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out onto a lightly floured surface and weigh. Divide into 2 equal pieces. Wrap one piece and refrigerate. Divide the other half into 8 equal pieces and gently shape each piece into a ball without kneading. Cover loosely with plastic wrap and let rest for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll each piece out into a very thin round, about 5 1/2 to 6 inches in diameter. If you have a Silpat, roll the dough out on the mat; otherwise use a lightly floured surface and dust regularly to prevent the dough from sticking. Stack each piece between sheets of plastic wrap, then wrap the stack in plastic and place in the freezer while you prepare the fruit. Roll out the other half of the dough for use in a single galette; wrap it in plastic and freeze."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the galettes", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Line 2 baking sheets with parchment. Remove the pastry from the freezer and allow to thaw. Place four rounds on each baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the apricots, slivered almonds, vanilla extract, nutmeg, cinnamon and 2 tablespoons of the sugar in a large bowl and gently toss together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle almond powder over each pastry, leaving a 3/4-inch border all around. Place the fruit on top, about 1 1/2 apricots (2 if they’re small) per tart. Fold the edges of the dough in over the fruit, pleating the edges as you work your way around the fruit to form a free-form tart that is roughly 4 inches in diameter. Sprinkle the remaining sugar over the fruit and the crust. Place in the oven and bake 30 to 35 minutes, until the crust is nicely browned and the fruit is bubbly, the juice running out and caramelizing on the parchment. Remove from the oven and allow to cool for at least 15 minutes. Serve hot, warm or at room temperature."}]}]}