{"@context": "http://schema.org", "@type": "Recipe", "name": "Bacon-Cheddar Quiche", "description": "This mashup of Julia Child recipes, combining elements of her quiche Lorraine and quiche au fromage, then pouring them into a lard-and-butter based pie crust, results in a serious breakfast feast. You could make the whole thing the night before serving it, and consume it at room temperature in the morning. But just making the dough for the crust in advance will save loads of time -- and the pleasure of the bubbling hot dish on a breakfast table is impossible to deny.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/12/23/dining/recipes-baconcheddarquiche/recipes-baconcheddarquiche-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "dinner, weekday", "keywords": "bacon, eggs, sharp cheddar cheese, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 284}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 679, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "60 grams", "fiberContent": "1 gram", "proteinContent": "13 grams", "saturatedFatContent": "31 grams", "sodiumContent": "407 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 cups all-purpose flour", "1/4 teaspoon salt", "5 tablespoons unsalted butter, chilled, cut into 1/2-inch pieces", "5 tablespoons lard, chilled, cut into 1/2-inch pieces", "1 large egg white, lightly beaten", "1/4 cup grated extra-sharp Cheddar", "6 strips bacon, cut into 1/2-inch pieces", "3 large eggs", "1 1/2 cups heavy cream", "3/4 teaspoon chopped sage", "1/4 teaspoon pepper", "1/4 teaspoon grated nutmeg", "1/8 teaspoon kosher salt", "1 tablespoon unsalted butter, cubed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crust, briefly pulse together the flour and salt in a food processor. Add butter and lard and pulse until mixture forms pieces the size of lima beans, about 3 to 5 one-second pulses. Adding 2 to 5 tablespoons of ice water, 1 tablespoon at a time, pulse mixture until it is just moist enough to hold together. Shape into a ball, cover with plastic wrap and flatten into a disk. Refrigerate at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. On a lightly floured surface, roll out the dough to 3/8-inch thick and press it into a 9-inch quiche or pie pan. Line with foil and fill with pie weights, rice or dried beans. Bake for 20 minutes, then remove the weights and foil and bake for 5 to 7 minutes more, until lightly golden."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the crust with egg white, then sprinkle the cheese evenly over the bottom of the pie crust. Bake for another 10 minutes, until the cheese is just melted. Remove from the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large pan over medium heat, cook the bacon for 7 to 10 minutes, or until lightly browned but not yet crisp. Drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the eggs, cream, sage, pepper, nutmeg and salt. Sprinkle the bacon over the quiche crust, then carefully pour in the egg mixture. Dot with the butter pieces and return to the oven. Bake for 25 to 35 minutes, until the top is puffed and golden and the middle is almost set. Let it cool for 15 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1014121-bacon-cheddar-quiche"}