{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Stir-Fried Eggplant, Tofu and Water Spinach (Ong Choy)", "description": "I had never cooked ong choy, also known as water spinach, until experimenting with this stir-fry. The hollow stems require a little more time to cook than the leaves so they are added first to the wok. I found that the leaves can be a bit stringy, but chopping them resolves that issue.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/07/16/science/16recipehealth/16recipehealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 4", "recipeCuisine": "asian", "recipeCategory": "dinner, easy", "keywords": "dairy-free, healthy, high fiber, kosher, low cholesterol, vegan, vegetarian, eggplant, tofu, water spinach, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 252, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "10 grams", "proteinContent": "22 grams", "saturatedFatContent": "2 grams", "sodiumContent": "675 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 long Asian eggplant, about 3/4 pound", "1 12-ounce bunch water spinach (ong choy) (substitute regular spinach if water spinach is unavailable; stem and wash leaves, and chop coarsely)", "1 14-ounce box firm tofu, drained and cut in 3/4 inch x 2-inch dominoes", "2 tablespoons soy sauce (more if desired)", "1 tablespoon Shao Hsing rice wine or dry sherry", "1/4 cup vegetable stock or water", "1/4 teaspoon salt (or to taste)", "1/4 teaspoon sugar ", "2 tablespoons peanut, canola, rice bran or grape seed oil", "1 tablespoon minced garlic", "1 tablespoon minced ginger", "2 jalapeño or serrano peppers, minced", "1 sweet red onion, sliced", "2 to 4 tablespoons chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Cut the eggplant in half lengthwise and score down to but not through the skin. Line a baking sheet with parchment or foil, lightly oil the foil and place the eggplant on it cut side down. Roast for 15 minutes, until the skin begins to shrivel. Remove from the oven, transfer to a colander and let the eggplant drain, cut-side down, while you prepare the other ingredients.  Then cut the eggplant in half down the middle and into 3/4–inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, drain and dry the tofu slices on paper towels and prepare the water spinach. Cut or break away the bottom 2 inches of the stalks. Break off the thicker, bottom part of the stems and wash thoroughly in 2 changes of water. Cut into 2-inch pieces. Spin in a salad spinner, then place on several thicknesses of paper towels to dry. Wash the leafy top part of the greens in 2 changes of water, spin dry twice, and chop coarsely. Place separately on paper towels to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or measuring cup combine the soy sauce, rice wine or sherry, and stock or water. Add the salt and sugar and stir until dissolved. Combine the garlic, ginger and chiles in another bowl. Have all the ingredients within arm’s length of your pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or 12-inch steel skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Add 1 tablespoon of the oil by pouring it down the sides of the pan and swirling the pan, then add the tofu and stir-fry until lightly colored, 1 to 2 minutes. Remove to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl in the remaining oil, add the garlic, ginger and chiles and stir-fry for no more than 10 seconds. Add the red onion and stir-fry for 1 minute. Add the eggplant and stir-fry for 1 to 2 minutes, until all of it is tender. Add the water spinach stems and stir-fry for 1 minute. Add the spinach leaves, stir-fry for about 30 seconds and add the soy sauce mixture.  Stir-fry for 1 minute, until the spinach has wilted, return the tofu to the wok along with cilantro. Stir together for a few seconds to amalgamate and remove from the heat. Serve with rice or noodles."}], "link": "https://cooking.nytimes.com/recipes/1014880-spicy-stir-fried-eggplant-tofu-and-water-spinach-ong-choy"}