{"@context": "http://schema.org", "@type": "Recipe", "name": "Edna Lewis’s Peach Cobbler", "description": "This delicious cobbler, which was featured in a Times article about fruit desserts, is designed to let the incandescent flavor of summer peaches shine, and it’s best made when they are in season. Edna Lewis, the careful cook from Virginia whose books are considered definitive in the Southern culinary canon, often suggested a lattice top for it, with bits of raw dough tucked into the filling before baking. Serve the result warm with ice cream or whipped cream, or all by itself.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2015/05/20/dining/20HIT_PEACHCOBBLER/20HIT_PEACHCOBBLER-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "southern", "recipeCategory": "editors' pick", "keywords": "dessert, peach", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 295}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 582, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "19 grams", "sodiumContent": "431 milligrams", "sugarContent": "32 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["3 cups sifted all-purpose flour (345 grams)", "1 1/2 teaspoons kosher salt", "1 teaspoon granulated sugar", "1 cup (2 sticks) unsalted butter, cut into 1/2-inch pieces and frozen for 10 minutes", "2 tablespoons lard or vegetable shortening, frozen for 10 minutes and cut into small pieces", "1 to 2 teaspoons granulated sugar, for sprinkling on top crust, optional", "8 cups firm but ripe peeled, sliced peaches", "3/4 cup granulated sugar", "2 tablespoons all-purpose flour", "1/4 teaspoon salt", "1/2 teaspoon freshly grated nutmeg", "4 tablespoons (1/2 stick) butter, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pastry: Set aside a small bowl of ice water. On a work surface, mound flour, salt and sugar, and mix to blend. Top with frozen butter and lard or shortening, and use a pastry cutter or your fingers to mix until it resembles coarse meal; some large pieces of the fats should still be visible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Quickly form a mound and, with your finger, draw a trench down the center. Sprinkle trench with 1 tablespoon ice water and fluff flour so it absorbs the water. Repeat three times, drawing trenches and sprinkling each with 1 tablespoon ice water, so 4 tablespoons of water have been incorporated. The dough should be starting to clump in large pieces. If necessary, add water by droplets until dough begins to form a mass."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gather dough with a pastry scraper. Working quickly, use the heel of your hand to smear an egg-size piece of dough by pushing it away from you. Continue with remaining dough (about 6 smears total), then gather dough again and repeat the process. Shape into 2 flat disks, and cover each in a double-thickness of plastic wrap, pressing wrapped disks to further shape and bind them. Refrigerate for at least 2 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out one chilled disk to 1/8-inch thickness, large enough to line and slightly overhang an 8-inch-square 2-inch-deep baking dish, or other shallow 2-quart pan. Trim to leave 1/2 inch of pastry above rim, refrigerating both pan and trimmings. Roll out remaining dough to about 1/8-inch thickness, to cover top of cobbler, again trimming and refrigerating excess dough. Slide top crust onto a plate, and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Heat oven to 425 degrees. In a mixing bowl, toss together peaches, sugar, flour, salt and nutmeg. Place mixture in the crust-lined baking dish, and tuck chilled trimmings into the center and sides of the filling, scattering them throughout. Top with butter slices. Moisten rim of dough with water and slide flat pastry crust on top. Press edges of dough to seal, and cut a few 1-inch slits in top crust. If desired, sprinkle with sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 15 minutes. Reduce heat to 375 degrees, and continue to bake until crust is deep golden brown and filling begins to bubble through slits, 30 to 40 more minutes. Cool cobbler on a rack until warm. If desired, serve with lightly sweetened whipped cream or ice cream."}], "link": "https://cooking.nytimes.com/recipes/1014848-edna-lewiss-peach-cobbler"}