{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Carrots and Scallions With Thyme and Hazelnuts", "description": "I bought incredibly sweet, baby red onions – they look like thick red scallions -- and multicolored bunches of carrots from a farmer at my market and roasted them with fresh thyme. Then I sprinkled on some crushed toasted hazelnuts, which contributed a nice crunchy texture and nutty finish to the dish. If you have a bottle of hazelnut oil or walnut oil on hand, a small drizzle just before serving is a welcome touch.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/02/27/science/26recipehealth/26recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "carrot, hazelnut, spring onions, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, vegan, vegetarian, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 119}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 170, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "367 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 ounce hazelnuts (about 1/4 cup)", "1 pound carrots, preferably young small carrots, any color (but a mix is nice)", "1 bunch white or purple spring onions or scallions", "Salt and freshly ground pepper", "2 teaspoons fresh thyme leaves", "2 tablespoons extra virgin olive oil", "Optional: a drizzle of hazelnut oil or walnut oil for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 325 degrees. Place the hazelnuts on a baking sheet and roast for 8 to 10 minutes, until they smell toasty and they a’re golden all the way through (cut one in half to check). Remove from the oven and turn up the heat to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately wrap the hazelnuts in a clean, dry dish towel. Rub them in the towel to remove the skins. Then place the skinned hazelnuts in a plastic bag or, if you have one, a disposable pastry bag and set on your work table in one layer. Use a rolling pin to crush the nuts by rolling over them with the pin. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a sheet pan with parchment or oil a baking dish large enough to fit all of the vegetables in a single layer. If the carrots are small, just peel and trim the tops and bottoms. If they are medium- sized, peel, cut in half and cut into 4-inch lengths. Quarter large carrots and cut into 4-inch lengths. Trim the root ends and greens from the spring onions or scallions. If they are bulbous, cut them in half. Season with salt and pepper, add the thyme and olive oil and toss well, either directly on the pan or in the dish or in a bowl. Spread in an even layer in the baking dish or on the baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast in the oven for 20 to 30 minutes, stirring every 10 minutes. The onions may be done after 10 minutes – they should be soft and lightly browned. Remove them from the pan if they are and hold on a plate. When the carrots and onions are tender and browned in places, remove from the oven. Add the onions back into the mix if you ’ve removed them and toss together. Sprinkle on the toasted ground hazelnuts, and drizzle on the optional nut oil, and serve."}], "link": "https://cooking.nytimes.com/recipes/1014564-roasted-carrots-and-scallions-with-thyme-and-hazelnuts"}