{"@context": "http://schema.org", "@type": "Recipe", "name": "Onion and Zucchini Frittata to Go", "description": "One of my favorite Provençal omelets is a sweet onion omelet, whose name in Provençal means “harvester’s omelet.” Workers would carry these types of omelets to the fields and eat them as a midmorning meal. I think they’re suitable for just about any meal.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/08/17/science/21recipehealth/21recipehealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 2", "recipeCuisine": "provencal", "recipeCategory": "breakfast, easy, quick", "keywords": "eggs, onion, zucchini, gluten-free, halal, healthy, kosher, nut-free, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 54}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 262, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "2 grams", "proteinContent": "12 grams", "saturatedFatContent": "4 grams", "sodiumContent": "496 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon plus 2 teaspoons extra virgin olive oil", "3/4 cup finely chopped onion\n", "Salt to taste\n", "1 garlic clove, minced\n", "1 small zucchini, grated (about 1 cup)\n", "4 eggs\n", "1 tablespoon milk\n", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a heavy 8-inch nonstick omelet pan and add the onion and a generous pinch of salt. Cook, stirring often, until the onion is very soft and sweet, about 10 minutes. Add the garlic and the zucchini, and cook, stirring often, until the zucchini has wilted, about 3 more minutes. Remove from the heat.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a medium bowl and add the milk and salt and pepper to taste. Stir in the onion and zucchini mixture and mix well. Clean and dry the pan.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining olive oil over medium-high heat in the omelet pan. Drop a bit of egg into the pan and if it sizzles and cooks at once, the pan is ready. Pour in the egg mixture, scraping in every last bit with a heat-proof rubber spatula. Swirl the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the frittata with the spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking. Once a few layers of egg have cooked during the first couple of minutes of cooking, turn the heat down to low, cover and cook 7 to 10 minutes, until the frittata is puffed and just about set. From time to time remove the lid and loosen the bottom of the omelet with a wooden or heat-proof rubber spatula, tilting the pan, so that the bottom doesn’t burn. It will however turn golden. \n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the frittata is still runny on the top, wearing oven mitts, slide the frittata out onto a plate or even better, a saucepan lid that has a handle, reverse the pan over the plate or lid, and holding the two together, flip the plate or lid so that the frittata goes back into the pan on its not-quite-cooked side. Finish for no longer than a minute, then reverse onto a platter. Allow to cool to room temperature, and serve, or chill. Cut into 4 wedges to serve. The wedges pack well and are very portable.\n"}]}