{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken-Thigh Kebabs With Turmeric, Chile and Saffron", "description": "This recipe comes from Edward Khechemyan, the chef of Adana in Los Angeles. The food is not easily categorized. He learned to cook from his father, but given that that man was from Iran, that his upbringing was Armenian-American and that the Russian influence was strong everywhere, the menu is a hodgepodge in the best sense of the word, boasting of innumerable kebabs and more than a few intriguing salads and dishes of beans, and of rice and other grains.\n\nIn his kitchen, Khechemyan moves quickly, and within 30 minutes, we had done four kebabs. The marinades are simple (he uses a lot of mild dried red chili powder, the kind you can most easily buy in Korean markets), and the grilling technique is not difficult. But it’s unusual: he grills slowly (over briquettes fired with gas, by the way), not too close to the fire, he insists, until gorgeously browned. The fire is not superhot, but it’s even — gas is good for that — and he keeps the grill grate a good six inches above the fire", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/07/19/dining/19COOKING-CHICK-THIGH-KEBABS1/19COOKING-CHICK-THIGH-KEBABS1-articleLarge.jpg", "totalTime": "PT3H20M", "recipeYield": "4 servings.", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "chicken thigh, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 298}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 416, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "1 gram", "proteinContent": "45 grams", "saturatedFatContent": "4 grams", "sodiumContent": "672 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds boneless, skinless chicken thighs, cut into 1 1/2-inch chunks", "1 white onion, sliced", "1/2 teaspoon crushed red chile powder", "1/2 teaspoon turmeric", "1 teaspoon garlic powder", "1 tablespoon salt", "1 teaspoon black pepper", "Pinch saffron", "1/4 cup lemon juice", "1/4 cup olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all the ingredients in a nonreactive dish (or a resealable plastic\nbag), and marinate in the refrigerator between 3 hours and overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the chicken has marinated, discard the onions (or grill them on the\nside in a grill basket, or sauté on the stovetop, if you like), and thread the chicken onto skewers. Heat a charcoal or gas grill; the flame should be fairly low and the rack about 6 inches from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the chicken slowly, turning as necessary and basting with any leftover marinade, until it’s browned all over, 15 to 20 minutes."}], "link": "https://cooking.nytimes.com/recipes/1014920-chicken-thigh-kebabs-with-turmeric-chile-and-saffron"}