{"@context": "http://schema.org", "@type": "Recipe", "name": "Granny’s Tomato Tart", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H", "recipeYield": "Two 9-inch tarts or one 10-by-16-inch tart", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "all-purpose flour, gruyère, tomato, main course, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 16}, "recipeIngredient": ["2 1/2 cups unbleached all-purpose flour", "3 tablespoons semolina flour", "1 teaspoon salt", "12 tablespoons (1 1/2 sticks) cold unsalted butter, cut into 1/4-inch pieces", "3 tablespoons chilled solid vegetable shortening", "2 tablespoons Dijon mustard", "8 ounces Gruyère cheese, coarsely grated", "12 to 14 ripe plum tomatoes, ends trimmed, very thinly sliced into rounds", "1 teaspoon herbes de Provence", "Freshly ground black pepper", "1/2 teaspoon salt, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For tart crust: In a food processor, combine flours and salt. Pulse to combine. Add butter and shortening and pulse until mixture resembles moist crumbs; do not overwork dough. Transfer to a bowl and sprinkle with 4 tablespoons ice water. Shape into a ball, adding ice water 1 tablespoon at a time (as many as 6 more may be needed) until dough is just past crumbly and holds together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For two tarts, divide dough in half and wrap each in plastic wrap, and press each with palm of your hand into disks. For one tart, wrap in plastic and shape into one large disk. Refrigerate at least 30 minutes before rolling out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Roll out dough into two 9-inch disks or one 10-by-16-inch rectangle 1/8-inch thick. Transfer to a baking sheet and crimp edges 1/2-inch high. Refrigerate for 30 minutes. Prick all over with fork. Place parchment paper or foil on top and weigh down with pie weights or dried beans. Bake until lightly browned, 10 to 15 minutes. Remove paper or foil and weights from dough, and continue to bake until golden brown, about 15 minutes. Remove from oven and set aside to cool; do not turn off oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For topping: Spread mustard thinly over bottom of cooled shell. Scatter evenly with cheese. Arrange tomatoes in even, slightly overlapping rows. Sprinkle with herbes de Provence, and season to taste with pepper. Bake until tomatoes begin to shrivel and cheese melts, 10 to 12 minutes. Sprinkle with salt, and serve hot or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1014009-grannys-tomato-tart"}