{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Steamed Long-Grain Rice", "description": "Rice can be cooked many ways, but here’s the technique that I find to be most reliable. Combine the rice with water, bring to a boil, reduce the heat, cover tightly and simmer over very low heat for 15 minutes. Once the water has evaporated from the pot, place a towel between the lid of the pot and the rice, and let it sit for ten minutes to absorb more moisture and steam. The amount of liquid you choose to use will affect the texture of your rice. A 2-to-1 ratio, liquid to rice, produces soft, tender rice. Chewier rice will result from using a 1-to-1 ratio, or from adding a bit more water. I usually go with a 2-to-1 ratio for cooking a long-grain rice like basmati. Traditionally, basmati rice first is soaked for 30 minutes to as long as two hours. The grains are brittle, but if they absorb a little water they are less likely to break while cooking. Still, I have to admit that there are many times that I don’t soak my basmati rice — and I can’t really tell the difference.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/07/27/health/27recipehealth_600/27recipehealth_600-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "basmati rice, salt, healthy, vegan, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 46}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 338, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "74 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "0 grams", "sodiumContent": "594 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 cup basmati or long-grain rice", "1 1/2 to 2 cups water", "1/2 teaspoon salt (or to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rice in a bowl in the sink, and rinse and drain several times with water, until the water runs clear. If using basmati rice, soak for 30 minutes. Drain over a bowl, and measure out 1 1/2 to 2 cups water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the water, rice and salt in a heavy 2- or 3-quart saucepan with a tight-fitting lid. Bring to a boil, reduce the heat to low and cover. Simmer 12 to 15 minutes, until all of the liquid has been absorbed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the rice, and place a clean kitchen towel over the top of the pan (it should not be touching the rice). Replace the lid, and allow to sit for ten minutes undisturbed. Serve."}], "link": "https://cooking.nytimes.com/recipes/1014002-basic-steamed-long-grain-rice"}