{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Rice Noodles With Grilled Chicken and Peanut Sauce", "description": "Maybe cold pasta makes you think of some mediocre quasi-Italian grab-and-go deli choice in a plastic clamshell.\n\nTo me, it conjures up images of delicious Southeast Asian street food and warm ocean breezes. There, cool rice noodles are topped with crisp vegetables, sweet herbs, pungent sauces and usually a little savory element, like sizzled fragrant beef or nuggets of fried spring rolls. A bowl of these saladlike noodles is always appealing, and they’re excellent for hot weather wherever you may find yourself, even if you don’t happen to be on a tropical holiday.\n\nFor a dish that’s not especially labor intensive, it ranks high on the flavor scale and tastes fresh, clean and bright: the kind of home-cooked fast food we can all appreciate.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2012/06/13/dining/13KITCH1_SPAN/13KITCH1_SPAN-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "chicken thigh, peanut butter, rice noodles, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 916}, "recipeIngredient": ["3 tablespoons Asian fish sauce", "3 tablespoons brown sugar", "6 tablespoons lime juice", "1 garlic clove, finely grated", "6 to 8 small Thai chiles, thinly sliced, or 1 or 2 serrano chiles", "2 tablespoons Asian fish sauce", "2 tablespoons rice vinegar", "6 tablespoons lime juice", "2 tablespoons soy sauce", "1 1-inch chunk ginger, peeled and sliced", "4 tablespoons natural unsalted peanut butter", "2 teaspoons sesame oil", "Pinch cayenne", "6 boneless skinless chicken thighs, about 1 1/4 pounds", "4 large garlic cloves, halved", "1 1-inch chunk ginger, peeled and sliced", "1 4-inch length lemon grass, tender center only, thinly sliced", "2 tablespoons Asian fish sauce", "1 tablespoon soy sauce", "1 teaspoon sesame oil", "3 tablespoons brown sugar", "1/8 teaspoon cayenne", "8 ounces dried rice vermicelli or other rice noodles", "2 small cucumbers, cut in 1/4-inch half moons", "1 medium carrot, cut in thin julienne", "3/4 cup fresh mung bean sprouts or other sprouts", "Small handful basil sprigs", "Small handful mint sprigs", "Small handful cilantro sprigs", "4 tablespoons slivered scallions", "1/4 cup crushed or chopped roasted peanuts", "Lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dipping sauce: Combine ingredients in a small serving bowl, making sure to dissolve the sugar. Leave to ripen for 15 minutes. Refrigerate any extra and use within a few days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the peanut dressing: In a blender or small food processor, puree all ingredients to a smooth sauce, about the thickness of heavy cream. Pour into a serving bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the chicken thighs in a low-sided bowl. To make the marinade, puree the garlic, ginger, lemon grass, fish sauce, soy sauce, sesame oil, brown sugar and cayenne in a blender or small food processor. Pour the marinade over the chicken and toss to coat. Let marinate at least 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to the boil, then turn off the heat. Add the rice vermicelli and soak for 7 to 8 minutes. (Package directions may vary; check for doneness by tasting). Drain when noodles are al dente, and cool under running water. Fluff and leave in strainer to drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the chicken over coals on a stove-top grill pan, or under the broiler until nicely browned, about 3 to 4 minutes a side. Let cool slightly, then chop roughly into 3/4-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, dress the cucumbers, carrots and mung bean sprouts with 1 tablespoon dipping sauce. Divide the cooked noodles among 4 bowls. Top each bowl equally with the cucumber mixture and chopped chicken. Spoon 2 teaspoons dipping sauce and 2 tablespoons peanut dressing over each portion. Add the basil, mint and cilantro sprigs, torn or roughly chopped (leave whole if leaves are small). Sprinkle with the scallions and crushed peanuts. Serve with lime wedges, and pass small bowls of the two sauces."}], "link": "https://cooking.nytimes.com/recipes/1014784-cold-rice-noodles-with-grilled-chicken-and-peanut-sauce"}