{"@context": "http://schema.org", "@type": "Recipe", "name": "Seaweed Salad With Scallops", "description": "Sweet and briny scallops need little more than a splash of oil and a pinch of seasoning to be delicious. Because they’re often enjoyed raw, it’s important to purchase fresh, high-quality bivalves. Many store-bought scallops are soaked in a phosphate solution that plumps them up with water (therefore bumping up the price), so it’s important to look for scallops that are labeled “dry” or “dry-packed.” A waterlogged scallop doesn’t sear well, and a phosphate-marinated scallop may taste like soap, especially when consumed raw as they are here. In this 10-minute recipe, the scallop takes center-stage while seaweed and cucumber provide texture, and soy sauce and sesame oil add depth.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/09/dining/Seaweed-Salad-With-Scallops/Seaweed-Salad-With-Scallops-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "2 to 4 appetizer servings", "recipeCuisine": "asian", "recipeCategory": "easy, quick, salads and dressings, seafood, vegetables", "keywords": "appetizer, cucumber, scallops, seaweed, sesame oil, fall, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "recipeIngredient": ["1 ounce dried seaweed (a mixture is best)", "8 large scallops", "1/2 cup chopped cucumber", "2 tablespoons soy sauce", "2 teaspoons dark sesame oil", "Salt and pepper", "Sliced scallions and sesame seeds, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the seaweed then soak it in a large pot of water until tender, about 5 minutes. Drain and gently squeeze to remove excess water. Transfer to a medium bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Quarter the scallops and transfer to the bowl. Add the cucumber, soy sauce and sesame oil and gently toss to coat. Season to taste with salt and pepper, if needed. Divide among plates or shallow bowls and garnish with scallions and sesame seeds. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1014816-seaweed-salad-with-scallops"}