{"@context": "http://schema.org", "@type": "Recipe", "name": "Blood Orange Compote", "description": "I came across the idea of making a caramel citrus syrup in Deborah Madison’s “Seasonal Fruit Desserts.” I suggest serving this with biscotti so you can dip the biscotti into the syrup. I like this as a dessert, but it is also great at breakfast  (in which case you might want to leave out the Cointreau or Triple Sec). <br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/02/12/science/11recipehealth/11recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "blood orange, sugar, vanilla, dairy-free, gluten-free, healthy, kosher, low cholesterol, low-fat, low-sodium, nut-free, vegan, vegetarian, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 142, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "4 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "0 milligrams", "sugarContent": "31 grams", "transFatContent": null}, "recipeIngredient": ["8 blood oranges", "6 tablespoons sugar, preferably organic", "2 tablespoons water", "1 tablespoon agave nectar", "2 teaspoons Cointreau or Triple Sec (optional)", "1/2 teaspoon vanilla", "1/2 teaspoon ground cinnamon (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze the juice from two oranges, strain and set aside. Remove the peel and pith from the remaining oranges. The easiest way to do this is to cut away both ends of the fruit so that it sits flat on your work surface, then using a chef’s knife, utility knife or a paring knife, cut the skin and pith completely away from the fruit, following the natural curve of the fruit from top to bottom. Once peeled, remove the sections from between the membranes, holding the fruit over a bowl to catch the juice and slicing next to the connective membranes on one side of each citrus segment.  Set the sections aside while you make the blood orange caramel syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the sugar in a medium saucepan and carefully add the water and agave nectar. With a wet pastry brush, brush down the sides of the pan. Look closely and make sure there are no stray sugar granules adhering to the pan. Brush any that you detect down into the wet sugar using the pastry brush. Turn the heat on medium and bring to a boil, watching again to make sure there are no loose sugar crystals on the sides of the pan and brushing down if necessary. Cook until the caramel is golden to amber. Swirl the pan if necessary, but do not stir, to distribute the syrup, which may be hotter and darker in one area than in another. There should be many bubbles breaking on the surface. As soon as the caramel reaches a golden color (about 325 degrees), remove from the heat. Wait until the bubbles subside, then carefully add the orange juice, being very careful to stand back, as it will bubble up. Stir the mixture with a whisk. The caramel will probably seize on the whisk (it helps to heat the whisk in hot water first). Don’t worry about that, just stir and return to the heat. The caramel is very hot so resist the temptation to taste it. Heat through, whisking, until all of the seized caramel has melted. Remove from the heat and stir in the Cointreau or Triple Sec (or other orange liqueur), vanilla, and cinnamon. Allow to cool, then pour over the oranges. Serve at room temperature or chilled."}], "link": "https://cooking.nytimes.com/recipes/1014535-blood-orange-compote"}