{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear and Sour Cherry Brown Betty With Brandy Hard Sauce", "description": "Most brown betties are made with sweetened apple slices. To mix things up a bit, I made mine with pears, and threw in some brandy-soaked dried cherries to accentuate the brandy I’d used to season the hard sauce. As soon as the pear betty emerges from the oven, spooned out a portion and cover it with lumps of hard sauce. The sauce melts on contact, dripping goodness into the fruit and soaking into the crevices of the toasted bread topping. ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/01/22/dining/recipes-sourcherrypearbrownbetty/recipes-sourcherrypearbrownbetty-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "sauces and gravies", "keywords": "cognac, dried cherries, pear, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 14}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 552, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "69 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "18 grams", "sodiumContent": "97 milligrams", "sugarContent": "52 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["12 tablespoons unsalted butter, softened", "1 1/4 cups confectioners’ sugar", "1/4 cup Cognac or brandy", "Pinch of grated nutmeg", "3 tablespoons Cognac or brandy", "2/3 cup dried cherries", "1/2 cup sugar", "1 teaspoon grated nutmeg", "1/2 teaspoon ground cinnamon", "3 1/2 cups white bread or challah, cut into 1/2-inch cubes", "7 tablespoons unsalted butter, melted", "Grated zest of 1 lemon", "2 pounds ripe pears about 5 pears, peeled, cored and thinly sliced", "3 tablespoons hard cider or apple cider"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the hard sauce, in a medium bowl set an electric mixer on high and beat the butter until fluffy. Reduce speed to low and add confectioners’ sugar. When the sugar is incorporated, set the speed back to high. Add the brandy 1 tablespoon at a time and beat until combined. Beat in the nutmeg. Transfer the sauce to a ramekin or bowl, cover and refrigerate. Hard sauce can be made at least a week ahead, but allow it to come to room temperature before serving (about 20 minutes)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the brown betty, heat the Cognac or brandy in a small saucepan over medium heat. When the liquid has come to a simmer, turn off the heat and add the cherries. Allow them to absorb most of the liquid, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While cherries are standing, heat oven to 375 degrees. In a large bowl, whisk together the sugar, nutmeg and cinnamon. Set aside 2 tablespoons of the sugar mixture for sprinkling. Add bread, butter and lemon zest. Toss until sugar has dissolved and bread is completely coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a shallow 1 1/2-quart gratin dish (or a 9-by-9-inch pan), scatter a little under half the bread cubes. Layer half the pear slices and half the cherries (along with any liquid) on top. Cover with a cup of bread crumbs and sprinkle with 1 1/2 tablespoons cider. Layer remaining pears, cherries and bread. Sprinkle top with remaining cider and reserved sugar-and-spice mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover dish with aluminum foil and bake for 40 minutes. Take off foil and continue baking, until crumbs are golden brown and pears are very soft, about 15 minutes more. Serve warm with dollops of hard sauce."}], "link": "https://cooking.nytimes.com/recipes/1014117-pear-and-sour-cherry-brown-betty-with-brandy-hard-sauce"}