{"@context": "http://schema.org", "@type": "Recipe", "name": "Mixed Greens Galette With Onions and Chickpeas", "description": "A tasty way to use bagged greens in a dish with Middle Eastern overtones. <br/><br/>I use bagged Southern greens mix for this, a robust mix of collards, kale, turnip greens and spinach, all washed, chopped and ready to go. The filling has Middle Eastern overtones, with lots of well-cooked onion and the Middle Eastern blend of thyme, sesame and ground sumac called za’atar. You can make za’atar yourself or buy it from Middle Eastern markets or Penzey’s Spices.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/02/19/science/19recipehealtharticle/19recipehealtharticle-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "Serves 8 to 10", "recipeCuisine": "middle eastern", "recipeCategory": "dinner", "keywords": "chickpea, greens, onion, halal, healthy, high fiber, kosher, nut-free, vegetarian, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 231, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "4 grams", "sodiumContent": "340 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 <a href=\"http://cooking.nytimes.com/recipes/1016715-whole-wheat-yeasted-olive-oil-pastry?action=click&module=Global+Search+Recipe+Card&pgType=search&rank=1\">whole wheat Mediterranean pie crust</a>", "1 large onion", "1 1-pound bag washed, stemmed greens, such as a Southern greens mix (kale, collards, turnip greens and spinach)", "Salt to taste", "1 tablespoon extra virgin olive oil", "2 plump garlic cloves, minced", "Freshly ground pepper", "1 1/2 teaspoons za’atar (see below)", "1 can chickpeas, drained and rinsed", "2 eggs", "3 ounces feta", "1 tablespoon egg wash (1 egg beaten with 1 teaspoon milk) for brushing the crust"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the dough for the crust and set it in a warm spot to rise. Meanwhile prepare the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Fill a bowl with cold water. Cut the onion into quarters, cutting from root to stem end, then cut thin slices across the grain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water in the pot reaches a boil, salt generously and add the greens. Boil for about 3 minutes, until tender. Use a skimmer to transfer the greens to the bowl of cold water, then drain. Take the greens up by the handful and squeeze out excess water. You can squeeze out the water most effectively if you take up small handfuls. Then coarsely chop (they are already chopped but the stems can be big). Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide saucepan or a large skillet and add the onions. Cook, stirring often, until soft and golden, about 10 minutes. After the first couple of minutes of cooking add a generous pinch of salt so they don’t brown too quickly or stick to the pan. When the onions are nicely colored and soft add the garlic and continue to cook for another 30 seconds to a minute, until fragrant. Stir in the greens and combine well with the onions. Add the za’atar and season to taste with salt and pepper. Stir in the chickpeas, taste and adjust seasonings, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl. Crumble in the feta and stir in the greens mixture. Stir well to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust a large work surface with flour and turn out the dough. Shape into a ball and let rest for 5 minutes. Then roll out into a thin round, 16 to 18 inches in diameter. Line a sheet pan with parchment and place the round in the middle, with the edges overlapping the pan (this will eliminate the need to lift the galette once it is filled). Place the filling in the middle of the rolled out pastry and spread it to a circle, leaving a 3 or 4-inch margin all the way around the pastry. Fold the edges in over the filling, pleating them to cover the filling and drawing them up to the middle of the galette, so that the filling is enclosed. The finished galette should be about 10 to 11 inches in diameter. There can be a small circle of exposed filling in the middle but it shouldn’t be more than an inch in diameter. Cover with plastic wrap and place in the freezer for 45 minutes to an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the oven to 375 degrees. Remove the galette from the freezer, brush with egg wash, and place in the oven. Bake 50 minutes, or until golden brown. Remove from the oven and let sit for at least 15 minutes before serving."}]}