{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato Crostata With Honey-Thyme Glaze", "description": "", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/08/07/dining/07APPE_SPAN/07APPE-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "honey, thyme, tomato, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 226}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 373, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "14 grams", "sodiumContent": "390 milligrams", "sugarContent": "5 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["125 grams all-purpose flour (about 1 cup), more for rolling out dough", "75 grams fine cornmeal (about 1/2 cup)\n\n", "1/4 teaspoon fine sea salt", "10 tablespoons cold unsalted butter (1 stick plus 2 tablespoons), cut into small cubes\n\n", "35 grams grated extra-sharp Cheddar  (about 1/2 cup)\n\n\n", "1 1/2 pounds different-colored tomatoes, sliced 1/4-inch thick (or halved if cherry or grape tomatoes)\n\n", "1 teaspoon kosher sea salt, plus a pinch\n\n", "2 tablespoons cider vinegar\n\n", "1 tablespoon honey\n\n", "1/2 bunch fresh thyme sprigs, plus 2 tablespoons chopped fresh thyme leaves\n\n", "2 tablespoons olive oil\n\n", "3 garlic cloves, smashed and peeled\n", "65 grams extra-sharp Cheddar, grated (about 1 cup)\n\n", "Black pepper, to taste\n\n", "1 large egg", "Flaky sea salt, like Maldon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: In a food processor, briefly pulse together flour, cornmeal and salt. Add butter and cheese and pulse until mixture forms chickpea-size pieces (3 to 5 one-second pulses). Add ice water 1 tablespoon at a time, up to 6 tablespoons, pulsing occasionally until mixture is just moist enough to hold together. Form dough into a ball, wrap with plastic and flatten into a disk. Refrigerate at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, line a rimmed baking sheet with a double layer of paper towels. Spread out tomato slices in a single layer. Sprinkle with 1 teaspoon salt and let sit for at least 1 hour and up to 3 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet over medium heat, combine vinegar, honey and thyme sprigs and bring to a simmer; let simmer 2 minutes, then transfer to a bowl. Wipe out skillet, then add olive oil and garlic. Cook garlic for 2 to 3 minutes, or until garlic is golden and caramelized. Remove garlic and finely chop. Reserve garlic oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a rimmed baking sheet with parchment paper. Lightly flour a work surface and rolling pin. Gently roll out dough to a 1/4-inch thickness, dusting with flour if dough is sticking. Transfer dough to baking sheet and return to fridge for another 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Pat tomatoes dry with paper towels. Brush tomatoes with honey mixture (reserve the thyme sprigs). Leaving a 3-inch border, distribute cheese, garlic and half the chopped thyme leaves on center of crust. Add black pepper to taste, then layer tomatoes in an overlapping pattern, maintaining the 3-inch border. Drizzle garlic oil over tomatoes, sprinkle with remaining thyme leaves and lay the reserved whole thyme sprigs on top. Gently fold crust up around tomatoes, making a 2-inch border. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk egg and 1 teaspoon water. Using a pastry brush, brush egg wash over crust and sprinkle top of crostata with flaky salt. Bake for about 35 minutes, until pastry is deeply golden brown. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1014953-tomato-crostata-with-honey-thyme-glaze"}