{"@context": "http://schema.org", "@type": "Recipe", "name": "Warm Lentil Salad With Balsamic Roast Squash", "description": "This recipe started out as something else. I had in my pantry a bag of mixed sprouted lentils – black, green, and brown. I cooked them with the intention of making dal, but I so liked the integrity of the cooked lentils – green and black lentils remain intact even after they soften – that I didn’t want to mash them. Meanwhile I had roasted some squash with balsamic vinegar. I ended up warming the lentils in a cumin-scented vinaigrette and serving them with the squash.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/01/01/science/01recipehealth/01recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "dairy-free, gluten-free, healthy, high fiber, kosher, low cholesterol, low-sodium, vegan, vegetarian, lentils, spices, winter squash, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 150}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 295, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "7 grams", "proteinContent": "10 grams", "saturatedFatContent": "2 grams", "sodiumContent": "870 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds kabocha or butternut squash, peeled and cut in small dice (about 3 cups peeled and diced, weighing 1 1/2 to 1 3/4 pounds), or 1 large acorn squash, cut in half \n\n(If using acorn squash, place in a 425 degree oven for 20 minutes before cutting in ", "Salt to taste", "1 tablespoon balsamic vinegar (2 tablespoons if using acorn squash)", "1 tablespoon extra virgin olive oil", "1 cup black lentils (also known as beluga lentils), green Le Puy lentils, or a mixture, rinsed", "1 teaspoon minced ginger", "1 teaspoon turmeric", "1/2 onion (intact)", "1 quart water", "Salt to taste", "1 tablespoon sherry vinegar or red wine vinegar", "1 teaspoon balsamic vinegar", "1 teaspoon Dijon mustard", "1/2 teaspoon cumin seeds, ground", "Salt and freshly ground pepper to taste", "3 tablespoons extra virgin olive oil", "1 tablespoon walnut oil", "1/4 cup chopped or slivered flat leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the lentils, ginger, turmeric, onion, water, and salt to taste in a medium saucepan and bring to a boil. Reduce the heat to medium and cook at a moderate bubble until the lentils have softened and produced a flavorful broth, about 35 to 40 minutes. Remove from the heat. Remove the onion and discard. Place a strainer over a bowl and drain the lentils."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat the oven to 425 degrees. Line a baking sheet with foil. If using cut up squash, place in a bowl or directly on the baking sheet and toss with salt to taste, the balsamic vinegar and 1 tablespoon of the olive oil. Spread on the baking sheet in an even layer and make sure to tip all of the liquid remaining in the bowl over the squash. Roast for 20 to 30 minutes, stirring every 10 minutes so that the squash browns evenly. The squash should be tender all the way through. Remove from the heat. If using acorn squash, spoon a tablespoon of the balsamic vinegar into both cavities, season with salt, brush with olive oil, and place cut side up on a foil-lined baking sheet. Bake 40 to 50 minutes, basting every 10 minutes, until thoroughly tender. Remove from the heat and when cool enough to handle remove the skin and cut the squash into dice. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or measuring cup whisk together the vinegars, mustard, salt and pepper, olive oil, and walnut oil. Toss with the lentils and return to the saucepan. Add a few tablespoons of the lentil broth, stir in the parsley and heat through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the squash in the middle of a wide bowl or serving platter, surround with the lentil salad and serve."}]}