{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Cashew Butternut Squash Soup", "description": "Growing up, I spent a lot of time in vegetarian restaurants even though I was not vegetarian, just on a quest to discover delicious, healthy foods that would help my dad to lose weight and feel good. I was already a fan of butternut squash soup when I was introduced to using cashews as a substitute for cream. This soup is loaded with flavor, fiber and protein. One of my favorite things to do is to ask my guests to figure out the mystery ingredient; nobody ever guesses that I have swapped out the heavy cream for the healthy, raw cashews. This soup is perfect for your vegetarian and vegan guests.", "author": {"@type": "Person", "name": "Dawn Lerman"}, "image": "https://static01.nyt.com/images/2012/11/20/science/wellveggiefatdad/wellveggiefatdad-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, butternut squash, cashew, spices, fall, gluten-free, kosher, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 663}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 208, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "373 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons olive oil or unsalted butter", "1 large onion, peeled and finely chopped", "1 cup (150 grams) raw cashews", "1 clove garlic, finely chopped", "1 large butternut squash (about 2 pounds), peeled and cut into 1/2-inch dice", "5 cups vegetable or chicken stock, plus additional (optional)", "2 tablespoons minced fresh ginger", "2 teaspoons ground cumin", "2 teaspoons ground coriander", "1 teaspoon curry powder", "1 teaspoon ground turmeric", "Kosher salt and freshly ground black pepper to taste", "1 cup coconut milk, plus additional (optional)", "1 sprig fresh rosemary"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In large stockpot or Dutch oven set over medium-high heat, warm the olive oil until shimmering. Add the onions and cook, stirring, until they begin to soften, about 5 minutes. Add the cashews and cook, stirring, until the onions are translucent and the cashews have slightly browned, about 3 minutes. Stir in the garlic and cook for 30 seconds. Add the squash, broth, ginger, cumin, coriander, curry powder, turmeric and stir to combine. Season to taste with salt and pepper, and bring the soup to a simmer. Reduce the heat to low, cover the pot, and cook the soup until the squash is easily pierced with a knife, 20 to 25 minutes. Uncover the soup and let it cool for 15 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Starting on slow speed and increasing to high, purée the soup in small batches, in a blender until smooth. Place a towel over the top of the blender in case of any splatters. You can also use an immersion blender (let the soup remain in the pot), but it will take longer to purée until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a blender, return the soup to the pot, add the coconut milk and rosemary sprig, and cook over low heat, covered, until slightly thickened, for about 15 to 20 minutes. Serve immediately or refrigerate until ready. If serving the soup later, while reheating the soup, thin it out with more broth or coconut milk until the desired consistency."}], "link": "https://cooking.nytimes.com/recipes/1014339-creamy-cashew-butternut-squash-soup"}