{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Sticks With Uncooked Tomato Sauce, Tuna, Capers and Olives", "description": "Now you can buy brown rice noodles that are made of whole grains and contain four grams of fiber per serving; regular rice sticks contain anywhere from 0 to 0.7 grams of fiber per serving (check your packaging to see). Brown rice noodles look just like the regular rice noodles and are just as easy to prepare, but taste a little nuttier. This is a great way to use the last of your summer tomatoes. Because rice sticks don’t get soggy, the dish won’t suffer if it sits, so you could serve this as a cold pasta salad. It’s good either way, hot or cold.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/09/28/science/27recipehealth/27recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 288, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "3 grams", "proteinContent": "11 grams", "saturatedFatContent": "1 gram", "sodiumContent": "511 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound ripe, locally grown tomatoes", "1 to 2 garlic cloves, green shoots removed, finely chopped or puréed", "Salt", "freshly ground pepper to taste", "1 teaspoon balsamic or sherry vinegar", "1 tablespoon extra virgin olive oil", "1 5-ounce can water-packed light tuna, drained and broken up with a fork, or 5 to 6 ounces cooked fresh tuna, cut in thin bite-size pieces", "1 tablespoon capers, rinsed", "10 imported black olives, halved and pitted", "2 tablespoons slivered basil leaves", "7 to 8 ounces thin rice sticks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large pot of water. Cut the tomatoes in half along the equator. Set a strainer over a bowl, and squeeze out the seeds. Rub the seed pods against the strainer to extract the juice, and discard the seeds. Cupping the skin side of the tomatoes in your hand, grate the tomatoes on the large holes of a box grater into a wide bowl. Stir in the garlic, salt and pepper, balsamic vinegar, tuna, capers, olives and olive oil. Allow to sit for 20 to 30 minutes while you soak the rice sticks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rice sticks in a large bowl, and cover with hot water. Soak for 20 minutes or until pliable, and drain. Using kitchen scissors, cut the noodles in half, into roughly 6- to 8-inch lengths."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water comes to a boil, salt generously and add the rice sticks. Boil one minute until tender but still al dente, and drain. Toss at once with the tomato mixture and the basil, and serve."}]}