{"@context": "http://schema.org", "@type": "Recipe", "name": "Mexican Seafood Cocktail", "description": "Given a choice, I’d really rather be eating a Mexican cóctel de mariscos, a tall glass filled with seafood and topped up with an extraordinary tomato salsa spiked with jalapeños and serranos, chopped onion and fresh lime juice. Whenever my travels in Mexico take me to coastal regions, I always stop by at least one beach restaurant to indulge in this stellar concoction. It is known there, aptly, as vuelve a la vida, or “return to life,” whether for a diner in need of restoration or as a morning-after hangover cure.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/07/31/dining/31RECIPE_SPAN/31RECIPE_SPAN-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "", "keywords": "appetizer, seafood", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 12}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 251, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "2 grams", "proteinContent": "37 grams", "saturatedFatContent": "1 gram", "sodiumContent": "940 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 medium tomatoes, about 1 pound", "2 jalapeño chiles", "Salt", "Pinch of pimentón or chipotle chile powder", "12 littleneck clams, scrubbed", "1 pound mussels, scrubbed", "8 large shrimp, shell-on", "1/2 pound squid, sliced in thin rings", "Juice of 2 limes, plus 4 lime wedges for serving", "1/4 pound cooked crab meat", "1/4 cup finely chopped white onion", "4 scallions, slivered", "1 serrano chile, thinly sliced", "2 tablespoons roughly chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a stovetop grill or charcoal barbecue to high (or use broiler if desired). Place tomatoes and chiles on grill and allow to char, turning to black on all sides, about 5 minutes. Let cool to room temperature; do not peel. Chop tomatoes in quarters and place in jar of a blender. Cut stems off chiles, then cut them lengthwise. Remove seeds if desired. Add chiles to blender jar, along with 1/2 teaspoon salt, the pimentón and 1 cup water. Blend to a rough purée, then pour into a bowl and let cool. You should have about 3 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the clams and 1 cup water in a wide skillet with lid. Set pan over high heat and bring to a boil. Cover and let cook until all clams have opened, about 5 minutes. Transfer clams and cooking juices to a large bowl and let cool. Repeat process with mussels, adding another 1 cup water to pan. Transfer to another bowl (separate from clams)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put shrimp in the wide skillet and cover with well-salted water. Place pan over high heat and bring to a simmer, then cook 1 minute. Remove shrimp with slotted spoon and let cool. Add squid to the same pan with simmering water and let cook just until firm, about 30 seconds. Drain squid and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pluck clams and mussels from their shells, reserving clam juice. Peel and devein shrimp and cut in half lengthwise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thin tomato sauce with 1/2 cup clam juice. (Save mussel juice for another use; refrigerate for up to 2 days, or freeze it.) Add lime juice and adjust seasoning. Ladle a little sauce into 4 wide glasses or bowls. Add clams, mussels, shrimp, squid and crab meat to each glass. Add chopped onion and scallion to each glass, then top with remaining sauce. Gently stir with a teaspoon to distribute ingredients. Chill well. Just before serving, garnish with sliced serrano chile and cilantro. Serve with lime wedges."}], "link": "https://cooking.nytimes.com/recipes/1014933-mexican-seafood-cocktail"}