{"@context": "http://schema.org", "@type": "Recipe", "name": "Chorizo Boudin Balls", "description": "Chorizo boudin balls are an appetizer akin to Italian arancini in which Cajun dirty rice is studded with spiced pork and enriched with creamy chicken livers before being draped in panko, fried and served with a garlic aioli. Hearty yet refined, these can be made ahead, chilled (or even frozen) and then cooked just before guests arrive.", "author": {"@type": "Person", "name": "Suzanne Lenzer"}, "image": "https://static01.nyt.com/images/2013/01/23/dining/23SUPERBOWL1/23SUPERBOWL1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "About 48 balls", "recipeCuisine": "creole", "recipeCategory": "", "keywords": "appetizer, chicken liver, ground pork, panko, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 81}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 287, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "196 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound ground pork", "3 tablespoons kosher salt", "1 tablespoon black pepper", "1 tablespoon cayenne pepper", "1 tablespoon red chile flakes", "2 teaspoons chile powder", "2 teaspoons smoked paprika", "2 teaspoons sherry vinegar", "1 1/2 teaspoons dried oregano", "2 tablespoons olive oil", "1 onion, chopped", "3 celery stalks, chopped", "4 garlic cloves, coarsely chopped", "2 to 3 jalapeños, stemmed, seeded and chopped", "1/2 pound chicken livers, cut into 1/2-inch chunks", "1 pound roasted pork shoulder, reserved from <a href='http://www.nytimes.com/recipes/1014504/Roast-Pork-Dip.html'>roast pork dip</a>, cut into 1-inch pieces (see note)", "6 cups just-cooked white rice (should still be warm)", "1 cup chopped parsley", "1 cup chopped cilantro", "1 cup roast pork drippings, reserved from <a href='http://www.nytimes.com/recipes/1014504/Roast-Pork-Dip.html'>roast pork dip</a> (see note)", "1 cup all-purpose flour", "1 cup egg wash (1 large egg beaten in 1 cup milk)", "3 to 4 cups panko (Japanese bread crumbs)", "Vegetable oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine ground pork with salt, pepper, cayenne, chile flakes, chile powder, paprika, vinegar and oregano. Mix to combine well, cover with plastic wrap and let sit at room temperature for about an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in a large skillet over medium-high heat. Add seasoned ground pork and cook until brown, 5 to 7 minutes. Add onion, celery, garlic and jalapeños and cook until vegetables are tender, 8 to 10 minutes. Add chicken livers and roasted pork pieces and cook until livers are colored on the outside but still pink inside, about 2 minutes; remove from heat and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer mixture to a clean work surface and chop into small, even pieces about the size of peas. Place in a large mixing bowl and combine with cooked rice, parsley, cilantro and pork drippings. Stir for 5 minutes or until mixture is sticky and the rice has absorbed all the liquid. Taste and reseason if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place flour, egg wash and panko in three separate dishes. Form boudin mixture into small spheres the size of golf balls. Roll balls in flour, then egg wash, then panko. Place balls on a parchment-lined baking sheet until ready to cook. (You may hold them in the refrigerator overnight, or freeze them, wrapped well, for up to a month. Bring to room temperature before proceeding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large, heavy-bottomed pot with 3 inches of vegetable oil and set over high heat. When oil reaches 375 degrees as registered by a deep-fry thermometer, add boudin balls. Working in batches so as not to crowd the pan, cook until golden brown and heated all the way through, about 2 minutes. Using a slotted spoon, transfer balls to a baking sheet lined with paper towel. Return oil to 375 degrees and repeat process with remaining balls. (They can be kept warm in a 200-degree oven between batches.) Serve hot or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1014502-chorizo-boudin-balls"}