{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom Lasagna", "description": "Like pinot noir, mushrooms are Oregon’s pride, another gift of terroir. The complex flavors in those wines and their bright acidity make them a dandy foil for a sumptuous lasagna. I used an assortment, wild chanterelles if available, cultivated but exotic customers like oyster if possible. Some chestnuts intensify the earthy notes. There is even a tempting option to slip in a whisper of black truffle.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "About 8 servings as a first course, 4 to 6 as a main course", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, sauces and gravies", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 29}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 461, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "3 grams", "proteinContent": "15 grams", "saturatedFatContent": "12 grams", "sodiumContent": "563 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 pound pancetta, sliced thin and slivered", "2 tablespoons extra-virgin olive oil", "1 medium onion, finely chopped", "4 large garlic cloves, slivered", "1 pound mixed mushrooms, sliced shiitake, cremini, oyster, chanterelle, porcini, etc.", "12 chestnuts, roasted, peeled and quartered fresh, jarred or frozen", "12 sage leaves, slivered", "Salt", "pepper", "2 1/4 cups milk", "6 1/2 tablespoons unsalted butter or black truffle butter", "1/2 cup flour", "1/2 pound pasta for lasagna, preferably fresh, parboiled if dry", "3 ounces grana padano, grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the pancetta in a large skillet over medium-low heat, stirring, until the fat starts to render. Increase the heat and cook a few minutes more, until the pancetta barely begins to brown and crisp. Transfer it to a dish. Add the oil to the pan. Add the onion and garlic and sauté until softened. Stir in the mushrooms and sauté over medium heat until they wilt. Stir in the chestnuts and sage. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scald the milk. Melt 6 tablespoons butter or truffle butter on low heat in another saucepan. Whisk the flour into the melted butter. Cook briefly, then gradually whisk in the warm milk. Continue whisking and cooking until the sauce is thick and smooth. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Grease an 8-inch square baking dish with the remaining butter. Cover the bottom of the dish with a film of the sauce, then cover it with a layer of pasta. Spread with half the mushrooms, scatter half the pancetta on top and sprinkle with a third of the cheese. Spread a third of the sauce on the cheese. Repeat the layers. Cover with the remaining pasta, spread with the remaining sauce and scatter the rest of the cheese on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 40 to 45 minutes, until the top is lightly browned."}], "link": "https://cooking.nytimes.com/recipes/1014128-mushroom-lasagna"}