{"@context": "http://schema.org", "@type": "Recipe", "name": "Mediterranean Lentil Purée", "description": "The spicing here is the same as one used in a popular Egyptian lentil salad. The dish is inspired by a lentil purée that accompanies bread at Terra Bistro in Vail, Colo.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/12/04/science/05recipehealth/05recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "", "recipeCuisine": "mediterranean", "recipeCategory": "", "keywords": "appetizer, dairy-free, gluten-free, halal, healthy, kosher, low calorie, low-carb, low cholesterol, low-fat, low-sodium, low sugar, nut-free, vegan, vegetarian, lentils, spices, yogurt, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 174, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "85 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1/4 cup olive oil", "1 large garlic clove, minced or pureed", "1/2 teaspoon freshly ground cumin seeds", "1/2 teaspoon freshly ground coriander seeds", "1/8 teaspoon freshly ground cardamom seeds", "1/4 teaspoon ground fenugreek seeds", "3/4 cup brown or green lentils, washed and picked over", "", "Salt and freshly ground pepper to taste", "1 tablespoon plain low-fat yogurt (more to taste) or additional liquid from the lentils for a vegan version", "Chopped cilantro for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 2 tablespoons of the olive oil and the garlic in a small frying pan or saucepan over medium heat. When the garlic begins to sizzle, add the spices. Stir together for about 30 seconds, then remove from the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the lentils in a medium saucepan, cover by 1 to 2 inches with water, add a bay leaf, and bring to a boil. Add salt to taste, reduce the heat and cook until tender, 40 to 50 minutes. Remove the bay leaf. Taste and adjust salt. Place a strainer over a bowl and drain the lentils. Transfer to a food processor fitted with the steel blade."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Purée the lentils along with the garlic and spices. With the machine running add the additional olive oil. Thin out as desired with the broth from the lentils. The purée should be very smooth; if it is dry or pasty, add more yogurt, broth, or olive oil. Taste and adjust salt. If desired add a few drops of lemon juice. Transfer to a bowl and sprinkle the cilantro over the top if desired, or spread directly on croutons or pita triangles."}], "link": "https://cooking.nytimes.com/recipes/1014386-mediterranean-lentil-puree"}