{"@context": "http://schema.org", "@type": "Recipe", "name": "Blackberry Lime Smoothie With Chia Seeds and Cashews", "description": "I love the flavor and color of blackberries in a smoothie, but I don’t care for the seeds, which that won’t really blend, so I always strain my blackberry smoothies. Make more of the limeade than you need for the smoothie and keep in the refrigerator.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/05/21/science/23recipehealthuse1/23recipehealthuse1-articleLarge-v2.jpg", "recipeYield": "1 serving", "recipeCuisine": "", "recipeCategory": "breakfast, weekday, shakes and smoothies", "keywords": "blackberry, chia seeds, lime, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "recipeIngredient": ["1 tablespoon soaked chia seeds (1 teaspoon dry unsoaked)", "1 heaped tablespoon cashews (1/2 ounce), soaked overnight in water and drained", "1 heaped cup blackberries (about 5 ounces)", "3/4 cup limeade (see below)", "1 tablespoons geranium syrup (see below) or 1 teaspoon rose water", "2 ice cubes", "1/2  cup water", "1/2 cup sugar", "1 to 1 1/4 cups fresh lime juice (to taste)", "4 to 5 cups water, to taste (or for a variation, sparkling water)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the limeade, combine 1/2½ cup water and 1/2½ cup sugar in a saucepan and bring to a boil. Turn down the heat and simmer until the sugar dissolves. Remove from the heat and allow to cool, then combine with the lime juice and additional 4 to 5 cups water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For To make geranium syrup, make the syrup as directed above, and when you take it off the heat, pour 1/2½ cup over 1 sprig rose geranium and allow to steep for 30 minutes. Remove the rose geranium sprig from the syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To soak the chia seeds, place in a jar or bowl and add 4 tablespoons water for every tablespoon of chia seeds. Place in the refrigerator for several hours or overnight. The seeds and water will be become gelatinous. Soak the cashews overnight and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop up a tablespoon of seeds with the gooey liquid and place in a blender (don’t worry, your smoothie won’t have this consistency). Add the remaining ingredients and blend for 1 full minute at high speed. Strain through a medium-mesh strainer and serve."}], "link": "https://cooking.nytimes.com/recipes/1014744-blackberry-lime-smoothie-with-chia-seeds-and-cashews"}