{"@context": "http://schema.org", "@type": "Recipe", "name": "Tuscan Bread and Tomato Soup", "description": "Although some bread soups are very simple mixtures of bread and broth, the ones I love most are packed with produce. And while the traditional versions of the Mediterranean soups are made with white bread, there’s no reason not to use whole-grain breads in these recipes. I don’t recommend sourdough, however, because the flavor is too strong.  Called pappa al pomodoro, this humble mixture of bread, tomatoes, garlic and basil has a luxurious flavor. Although the soup is traditionally made with unsalted Tuscan bread, it works beautifully with any country bread.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/04/19/science/18recipehealth/18recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, soups and stews", "keywords": "canned tomatoes, country bread, healthy, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 98}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 224, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "687 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons extra virgin olive oil", "1 small onion, chopped", "4 garlic cloves, minced", "1 (28-ounce) can chopped tomatoes, with juice", "2 tablespoons tomato paste", "Pinch of sugar", "Pinch of red chili flakes", "Salt", "freshly ground pepper", "4 cups water", "1 pound stale country bread, crusts removed, cut into cubes about 7 cups", "2 to 3 tablespoons slivered fresh basil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the oil in a large, heavy soup pot over medium-low heat. Add the onion, and cook, stirring, until tender, about five minutes. Meanwhile, pulse the tomatoes in a food processor fitted with the steel blade until coarsely blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the garlic to the pot. Cook, stirring, for about a minute until fragrant. Add the tomatoes, tomato paste, sugar, red chili flakes, and salt and pepper. Cook, stirring occasionally, until the tomatoes have cooked down, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the bread cubes into the tomatoes. Add the water, half the basil and salt to taste. Increase the heat, and simmer, stirring and mashing the bread, for about 10 minutes until the soup is thick, like pap. Stir in the remaining basil, and taste and adjust the seasonings. Serve hot, warm or room temperature with the remaining olive oil drizzled over each serving."}]}