{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Bean and Green Bean Salad", "description": "The first time I made this, I used some delicious small red beans that my housekeeper, Ana, brought from El Salvador. I also tested it with canned beans; of course I liked the Salvadoran red beans better, but not having them shouldn’t deter you from making this substantial salad. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/06/18/science/20recipehealth/20recipehealth-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "4 generous servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegetarian, green beans, red beans, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 22}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 284, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "12 grams", "proteinContent": "12 grams", "saturatedFatContent": "3 grams", "sodiumContent": "435 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup small red beans or red kidney beans, washed, picked over and soaked for 6 hours or overnight", "1/2 onion", "3 garlic cloves, 2 of them unpeeled and crushed, 1 of them minced or puréed", "1 bay leaf", "Salt to taste", "3/4 pound green beans, stem ends trimmed", "1 tablespoon chopped fresh tarragon", "2 tablespoons chopped flat-leaf parsley", "1 tablespoon chopped chives", "1 teaspoon fresh thyme leaves", "1 tablespoon fresh lemon juice", "2 tablespoons red wine vinegar or sherry vinegar", "2 teaspoon Dijon mustard", "3 tablespoons extra virgin olive oil", "3 tablespoons plain low-fat yogurt or broth from the beans", "Freshly ground pepper", "1 to 2 ounces crumbled feta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the beans, rinse and place in a heavy saucepan with the onion, the crushed whole cloves of garlic, the bay leaf and enough water to cover by 2 inches. Bring to a boil, reduce the heat and simmer for 30 minutes. Add salt to taste and continue to simmer for an hour to an hour and a half more, until the beans are tender but intact. Turn off the heat and allow to sit for 30 minutes. Remove and discard the onion, garlic cloves and bay leaf. Place a strainer over a bowl and drain the beans. Transfer the beans to a salad bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the beans are simmering, blanch the green beans in salted boiling water for 3 to 4 minutes, or steam them. They should be tender but still have some snap to them. Cut into 2- or 3-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss together the red beans and the herbs. In a small bowl or measuring cup, whisk together the lemon juice, vinegar, mustard, olive oil and 3 tablespoons broth from the beans (or yogurt, if you used canned beans). If you have time, allow the mixture to marinate, in or out of the refrigerator, for 30 minutes before adding the green beans and serving. Add the green beans and toss again just before serving."}], "link": "https://cooking.nytimes.com/recipes/1014811-red-bean-and-green-bean-salad"}