{"@context": "http://schema.org", "@type": "Recipe", "name": "No-Peel Chestnut Purée", "description": "What makes peeling a chestnut so hard is the pellicle, the unpalatable inner skin that clings to the involutions in the nutmeat, said Nancy Petitt, an owner of Delmarvelous Chestnuts in Townsend, Del. A chief virtue of many domestic chestnut cultivars, Ms. Petitt added, is that the “bitter peel stays attached to the shell, instead of the nut.” So, no imports. At home, snip the chestnuts in half, on the horizontal axis, with kitchen shears. Next, place them in a colander and immerse in boiling water. After 3 or 4 minutes, the shells should bubble to the surface. Now the nuts can be boiled until crumbly (about 15 minutes) or moved to the oven. This technique could not be easier, except when it fails. In that event, leave the nuts boiling for 10 minutes total. At this point, the shells and skins should easily slip off. Plan B is to roast the nuts. Score the flat side with an X and place nuts, cut side down, in a glass baking dish. Pour 1/4 inch of water into the bottom, and roast the nuts for 15 to 20 minutes in a 375-degree oven. To peel (while hot), pinch the sides gently.", "author": {"@type": "Person", "name": "Michael Tortorello"}, "image": null, "totalTime": "PT35M", "recipeYield": "1 1/2 cups", "recipeCuisine": "", "recipeCategory": "", "keywords": "side dish, vegetarian, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 179, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "6 grams", "sodiumContent": "163 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 full cups (12 ounces) chestnuts, in shell", "1/2 cup heavy cream", "1 tablespoon butter", "2 tablespoons chestnut or buckwheat honey (optional)", "Salt", "pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set oven to 375 degrees, and bring a large pot of water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the shell and pith from the nut kernel in a colander or blanching basket (as described above). Save the water for now. Toss discolored nuts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer nuts to a glass baking dish filled with 1/4 cup chestnut bath, and roast in oven for 12 minutes. (If ovens are at a premium, you can boil the nuts for 15 to 20 minutes and skip this step.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour chestnuts into a food processor with cream, butter and 1/2 cup chestnut water. Purée until the chestnuts have the texture of a smooth spackle. If the mixture seems more like mortar, add reddish water from the chestnut pot, 1/8 cup at a time, until the consistency seems pleasing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re trying to woo children, make a grand show of adding 2 tablespoons honey. Let them lick the spoon, which might have (just accidentally) touched the chestnut purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add salt and pepper to taste; serve hot."}], "link": "https://cooking.nytimes.com/recipes/1014216-no-peel-chestnut-puree"}