{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkish-Spiced Halibut Skewers With Yogurt Sauce", "description": "Turkish chefs make these beautiful skewers with local swordfish, usually dousing the fish in a garlicky lemony marinade before cooking. Bay leaves (they grow wild) are usually a presence, too. David Tanis took that inspiration and made the fish halibut, adding thinly sliced lemons and onions, along with pinches of aromatic cumin and coriander, and a heavy hand with the bay leaves. You would think this might be overkill, but in fact it only enhances the sweetness of the fish.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/03/20/dining/20KITCH1_SPAN/20KITCH1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "turkish", "recipeCategory": "dinner", "keywords": "halibut, spices, yogurt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 165}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 465, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "2 grams", "proteinContent": "37 grams", "saturatedFatContent": "6 grams", "sodiumContent": "719 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds boneless halibut or other firm-fleshed fish", "Salt and pepper", "1/2 teaspoon cumin seeds, toasted and coarsely ground", "1/2 teaspoon coriander seeds, toasted and coarsely ground", "1/2 teaspoon paprika", "Pinch red pepper flakes", "1 small red onion, thinly sliced", "1 small lemon, thinly sliced", "2 garlic cloves, minced, plus 1 garlic clove, grated or smashed to a paste", "8 bay leaves", "1/2 cup olive oil", "1 cup plain yogurt", "Pinch cayenne", "1 small cucumber, about 2 ounces, peeled and diced", "1 tablespoon chopped mint", "1 tablespoon chopped dill", "1 tablespoon chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut halibut into large chunks of equal size and thread onto skewers. You should have 4 kebabs weighing about 6 ounces each. Lay them in a shallow dish. Season on both sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, put cumin, coriander, paprika, red pepper flakes, onion, lemon, minced garlic and bay leaves. Add olive oil and stir together. Spoon mixture over fish skewers and leave to marinate for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put yogurt in a small bowl. Season with salt and pepper, then add garlic paste, cayenne and cucumber. Mix mint, dill and parsley together, add half to yogurt mixture, and reserve the rest. Stir to combine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a grill or broiler. When it is hot, cook skewers for about 2 minutes per side, until just opaque. (Leave some lemon, onion and bay leaf clinging to fish, so they char a bit.) Transfer to a serving platter. Sprinkle with remaining herb mixture. Serve with yogurt sauce on the side."}]}