{"@context": "http://schema.org", "@type": "Recipe", "name": "Barley and Spring Onion Soup With Fava Beans", "description": "This is a light, sweet onion soup to make when those big, juicy spring onions accompany fresh fava beans in the farmers’ market. You can make a quick vegetable stock with the trimmings while you’re prepping the ingredients.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/05/29/science/29recipehealth1/29recipehealth1-articleLarge-v2.jpg", "totalTime": "PT1H20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "one pot, soups and stews", "keywords": "barley, fava beans, spring onions, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 30}, "recipeIngredient": ["1 pound spring onions", "2 tablespoons extra virgin olive oil, or 1 tablespoon olive oil and 1 tablespoon butter", "1 garlic clove, minced", "1 1/2 quarts vegetable stock or chicken stock", "A bouquet garni made with a bay leaf, a few dried mushrooms or mushroom stems, a Parmesan rind and a couple of sprigs each thyme and parsley, all tied into a cheesecloth bag", "1/2 cup barley", "Salt and freshly ground pepper", "1 pound fava beans, shelled and skinned", "1 to 2 tablespoons chopped fresh herbs, like parsley, tarragon, fresh thyme", "Rounds of baguette or slices of country bread, topped with Gruyère or Parmesan, then toasted until the cheese melts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Quarter the onions lengthwise (stem to root end), then slice thinly across the grain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, heavy soup pot heat the oil over medium heat and add the onions. Cook, stirring often, until they have softened and begun to darken a little; do not let them brown. Add a pinch of salt, the stock and the bouquet garni. Bring to a boil, add the barley, reduce the heat, cover and simmer 1 hour. Taste and adjust salt. Add freshly ground pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bouquet garni and discard. Add the fava beans and continue to simmer for 5 to 8 minutes more. Stir in the herbs. Serve, topping each bowl with the cheese croutons."}]}