{"@context": "http://schema.org", "@type": "Recipe", "name": "Sam Sifton’s Vitello Tonnato", "description": "This unlikely pairing of veal and tuna is shockingly irresistible, as Sam Sifton discovered in bringing the recipe to The Times in 2011. As with all simple cooking, ingredients are key here. Don’t skimp on the veal, or the tuna, or the mayonnaise. They all mingle together to create something better than the sum of their parts.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "main course, summer, tuna, veal eye round, vegetables", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 18}, "recipeIngredient": ["2 pounds boned veal eye round", "1 (7-ounce) container best-quality Italian tuna, shredded", "1 medium yellow onion, peeled, chopped in quarters and stuck with 2 cloves", "1 celery rib, roughly chopped", "1 carrot, peeled and roughly chopped", "1 parsley sprig", "1 1/2 cups chicken broth, preferably low-sodium or homemade", "½ teaspoon kosher salt", "10 black peppercorns, ground", "1 bay leaf", "1 1/2 cups dry white wine", "2 egg yolks", "1 cup extra-virgin olive oil", "1 (12-ounce) container best-quality Italian tuna in olive oil, finely chopped, with its oil", "2 anchovies, rinsed, dried and minced", "1 tablespoon caper brine", "Lemon juice", "Veal broth (see above)", "Kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If necessary, tie the veal with cotton string, so that it resembles a salami. Place the meat in a heavy-bottomed pot or Dutch oven and cover with tuna, onion, celery, carrot, bay leaf, parsley, wine, broth, salt and pepper, then heat over a high flame until it comes to a boil. Immediately reduce heat to very low, cover and simmer for 35 to 40 minutes, or until the internal temperature of the veal reaches 130 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove meat to a large, nonreactive bowl, strain the broth over it, cover and allow the meat to cool in the refrigerator. (Discard solids.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put yolks in a medium bowl. Beat together with a wire whisk. Begin to add oil as you beat, a very little at a time, adding more as each bit is incorporated. When a thick emulsion forms, then you can add oil a little faster, but not much faster. The entire process should take roughly 5 to 7 minutes. (You may not need all the oil.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tuna, anchovies and caper brine to the mixture, then beat to incorporate. Add a few tablespoons of the veal broth to thin the sauce slightly. Taste and adjust seasoning, adding lemon juice or more broth to taste. The sauce should not taste overly mayonnaisey but should lurk in the neighborhood."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cooled veal from its broth, untie and cut across the grain into very thin slices. Arrange these neatly on a platter with the edges of the slices overlapping, and spoon the tuna sauce over the top. Cover and return to refrigerator overnight or until ready to use. Garnish with capers or fried capers, lemon, hard-cooked egg wedges or sprigs of parsley. Serve with copious amounts of bread and a green salad, lightly dressed."}], "link": "https://cooking.nytimes.com/recipes/1014193-sam-siftons-vitello-tonnato"}