{"@context": "http://schema.org", "@type": "Recipe", "name": "Samuel’s Roasted Mushroom Base", "description": "This is the mushroom base that Scott Samuel, a chef instructor at the Culinary Institute of America in Napa, Calif., uses in conjunction with beef in his burgers. I have cut the amount of olive oil to 1/4 cup from 1/2.  Some of America’s biggest food service companies are committed to increasing vegetable consumption, but they don’t want to lose their meat-loving customers, so they are figuring out ways to create dishes with less meat that are still appealing. You may face this challenge in your own family; you want everybody to cut down on meat consumption, but they love their burgers. Mr. Samuel has developed a savory roasted mushroom base that he mixes with hamburger meat for a delicious burger. It looked, smelled, acted and tasted like a burger (well, a very vegetal burger), and it had the added quality of being very moist. Everybody gave it high marks in a taste test, and I made a mental note to make the base at home and use it in burgers, meatballs and more. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/03/12/science/11recipehealth/11recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "1 1/4 pounds (about 3 cups)", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, mushroom, olive oil", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 50}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 170, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "1 gram", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "559 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup extra virgin olive oil", "2 pounds cremini mushrooms, cut in small dice if large, quartered if small", "Kosher salt to taste", "1/4 teaspoon ground black pepper", "1 teaspoon mushroom powder, made by pulverizing dried mushrooms in a spice mill (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Line 2 baking sheets with parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl mix together the olive oil, mushrooms, salt and pepper. Spread in an even layer on the baking sheets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 1 sheet at a time on the middle rack of the preheated oven for 15 to 20 minutes, stirring every 5 minutes, until the mushrooms are tender. They will reduce considerably in volume. Remove from the heat and allow to cool. Process in a food processor fitted with the steel blade until chopped fine but still retaining some texture. Taste and adjust seasonings. Mix in mushroom powder if desired."}], "link": "https://cooking.nytimes.com/recipes/1014594-samuels-roasted-mushroom-base"}