{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Steak and Vegetables With Tortillas", "description": "Here's an idea: Spend the same $30, or $50 or $100 or $300 on meat that you now spend each week or month, but buy less and buy better. You might compare this to an annual purchase of 20 $5 T-shirts made by child labor versus one of five $20 T-shirts made by better-paid and better-treated workers from organic cotton. Expensive meat from real farms is a more extreme example of this less-is-better policy. Then cook the meat differently than you used to. Take this vague interpretation of fajitas, one that focuses on grilled vegetables and makes beef a supporting player. A pound or so of tender, fatty rib-eye or sirloin goes a long way with this recipe. And it makes a lovely impression if you present it whole before slicing or chopping. You can cook everything in a cast-iron skillet (you will most likely need more than one, or you will have to cook in batches) instead of on a grill.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2013/05/29/dining/20130529-FLEX-slide-TDCI/20130529-FLEX-slide-TDCI-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "flour tortillas, steak, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 54}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 996, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "101 grams", "cholesterolContent": null, "fatContent": "53 grams", "fiberContent": "18 grams", "proteinContent": "40 grams", "saturatedFatContent": "15 grams", "sodiumContent": "2021 milligrams", "sugarContent": "26 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["2 ears of corn, shucked", "1 avocado, halved and pitted", "8 radishes, trimmed", "1 fairly firm mango, peeled and halved", "4 limes, halved", "1 large zucchini, sliced lengthwise", "2 large bell peppers or poblanos, cored and halved", "1 bunch scallions, trimmed", "1 head romaine lettuce, outer leaves removed, but left whole", "Olive oil", "Salt and ground black pepper", "1 to 1 1/4 pounds rib-eye or strip steak (about an inch thick)", "8 to 12 small flour tortillas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a gas or charcoal grill for direct cooking; the heat should be high on one side and medium on the other, with the rack about 4 inches from the flame. Have 2 platters handy; one so you can remove the vegetables as they begin to char, and another smaller one for the steak. Get a towel or foil ready for wrapping the tortillas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once you have the vegetables prepped, toss or rub them all with olive oil and sprinkle with salt and pepper. (You will grill even the limes for squeezing on top of everything else.) Blot the steak dry with paper towels and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On the hottest part of the grill, put the corn, avocado, radishes, mango and limes and char lightly, turning as necessary, for no more than 5 minutes. Start the zucchini, peppers, scallions and lettuce on the cooler side; they should be cooked until just tender and browned, 5 to 10 minutes. Transfer the vegetables to the platter as they finish cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the steak with salt and pepper. Score the outer fat, if necessary. If using charcoal, consolidate the coals so that the heat is high again. Put the steak on the hot grill; cook, leaving it alone until the bottom is nicely charred and the steak releases easily, 2 to 4 minutes. Turn and cook for another 3 minutes, more or less, for medium-rare."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove steak from the grill and let it rest for at least 5 minutes. Meanwhile, cook the tortillas on the grill, turning once or twice until lightly charred and stack in a towel or foil, wrapping loosely. Prepare the vegetables for serving: Strip the corn kernels off the cob and scoop out and slice the avocado; the rest of the vegetables you can chop or slice however you like, keeping in mind that you’ll be putting them in tortillas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the steak crosswise, sprinkle with more salt and pepper if you like and return to the platter. Serve the steak and vegetables with the tortillas."}]}