{"@context": "http://schema.org", "@type": "Recipe", "name": "Hete Bliksem", "description": "Phillip Kirschen-Clark, the chef at Vandaag, brings a firm understanding of the intersection between sweet and savory to this side dish to lunchtime sandwiches and evening hen. “Hot lightning” is how the words translate from the Dutch: little fried fingerling potatoes combined with smoked bacon and a tiny dice of tart apples, all of it glossed in stroop, a velvety syrup made of sugar, butter, cream and molasses, then flavored with juniper, nutmeg, mace and cinnamon.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/Bliksem/Bliksem-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "apple, bacon, fingerling potatoes, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 33}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1217, "unsaturatedFatContent": "65 grams", "carbohydrateContent": "92 grams", "cholesterolContent": null, "fatContent": "91 grams", "fiberContent": "6 grams", "proteinContent": "13 grams", "saturatedFatContent": "22 grams", "sodiumContent": "915 milligrams", "sugarContent": "49 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3/4 cup sugar", "2 tablespoons unsalted butter", "1/2 cup heavy cream", "1 tablespoon unsulfured molasses", "1/4 teaspoon kosher salt", "1/2 teaspoon juniper berries, whole", "1/2 nutmeg, cracked, or a pinch of freshly ground nutmeg", "1/2 blade of mace, or a pinch of ground mace", "1 cinnamon stick, broken in half", "1 pound fingerling potatoes", "Kosher salt", "1 head garlic, halved crosswise", "4 sprigs thyme", "4 bay leaves", "1/2 teaspoon cayenne pepper", "8 ounces sliced bacon, cut crosswise into 1/2-inch thick lardons", "Vegetable oil, for frying", "1/2 cup rice flour, or as needed", "1 large Honeycrisp apple, cored, seeded and cut into small dice", "Salt", "Cayenne pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the syrup: In a small saucepan, heat the sugar without stirring until it begins to melt. Stir occasionally until completely melted and a medium caramel color. Carefully stir in butter, cream and molasses. Add salt, juniper berries, nutmeg, mace and cinnamon. Stir until smooth. Remove from heat and steep for 30 minutes, then strain through a fine-meshed strainer. While the syrup is steeping, prepare the poached potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the potatoes: Place the potatoes in a medium saucepan and cover with two inches of water and season heavily with salt. Add garlic, thyme, bay leaves and cayenne pepper. On low heat, poach the potatoes until tender but not bursting, about 25 minutes. Gently strain potatoes and discard garlic, thyme and bay leaves. Set potatoes aside until no longer steaming, then transfer to the refrigerator to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the rest: In a large skillet over medium heat, spread out the bacon and cook, stirring occasionally, until crisp and golden brown. Transfer to paper towels to drain and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wok or deep skillet, pour in vegetable oil to fry the potatoes, heat to 350 degrees. Cut the potatoes into 1-inch slices, and dust thoroughly with rice flour. Shake off excess flour, and place potatoes in the oil. Fry until golden brown and crispy, 2 to 3 minutes. Transfer to paper towels to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a serving bowl, combine the syrup, bacon and apples. Add the potatoes and toss gently to mix. Season to taste with salt and cayenne. Serve."}], "link": "https://cooking.nytimes.com/recipes/1014123-hete-bliksem"}