{"@context": "http://schema.org", "@type": "Recipe", "name": "Leek and Turnip Soup With Kale and Walnut Garnish", "description": "I recommend that you make a quick stock with the leek greens, onion and turnips trimmings while you chop the vegetables. Just throw them in a pot with a couple of quarts of water, bring to a simmer, cover partially and simmer 20 minutes. Strain through a fine strainer into a bowl. Kale, which comes from the same botanical family as turnips, makes a complementary garnish and the crunchy walnuts contrast beautifully with the smooth, sweet-tasting soup.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/04/09/science/08recipehealth/08recipehealth-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, weekday, soups and stews", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, vegan, vegetarian, leek, turnip, walnut, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 32}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 328, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "9 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1726 milligrams", "sugarContent": "14 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 medium onion, chopped", "1 to 2 garlic cloves, minced (to taste, optional)", "1 1/2 pounds leeks (4 medium), white and light green part only, sliced", "1 pound turnips, peeled and cut in wedges", "1/4 pound potatoes, peeled and diced, or 1/4 cup medium grain rice", "6 cups water or vegetable stock ", "1 bay leaf", "Salt and freshly ground pepper", "6 ounces curly kale, stemmed and washed", "1 tablespoon walnut oil", "1/3 cup (1 1/2 ounces) toasted walnuts, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy soup pot or Dutch oven and add the onion. Cook, stirring, until tender, 4 to 5 minutes. Add the leeks and continue to cook, stirring, until they begin to soften, about 3 minutes. Stir in the garlic and cook, stirring, until the garlic smells fragrant, 30 seconds to 1 minute. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add turnips, potatoes or rice, water or stock, bay leaf, and salt, and bring to a boil. Reduce the heat, cover and simmer 45 minutes to an hour. The turnips should be very tender. Remove the bay leaf."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the soup is simmering, blanch the kale in boiling salted water just until tender, 1 1/2 to 2 minutes, or steam for about 3 minutes. Transfer to a bowl of cold water, drain and squeeze out excess water. Place the squeezed bunch of kale on your cutting board and slice into thin slivers. Toss with the walnut oil. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a hand blender, or in batches in a regular blender, purée the soup. If using a regular blender fill only half way and cover the top with a towel pulled down tight, rather than using the lid, because hot soup will jump and push the top off if the blender is closed airtight. Strain and return to the pot (turnips are fibrous and the soup will have a better texture if you strain it). Return to the pot and heat through, stirring. Season to taste with salt and pepper. Ladle into bowls and top with a spoonful of greens and sprinkling of walnuts."}], "link": "https://cooking.nytimes.com/recipes/1014657-leek-and-turnip-soup-with-kale-and-walnut-garnish"}