{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Garlic, Potato and Leek Soup", "description": "A very pale green springtime cousin of vichyssoise, this purée is comforting when served hot, refreshing when cold.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/05/10/science/09recipehealth/09recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves six", "recipeCuisine": "french", "recipeCategory": "dinner, weekday, soups and stews", "keywords": "appetizer, gold potatoes, green garlic, leek, healthy, vegan, vegetarian, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 85}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 234, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1065 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["3/4 pound green garlic (weight includes stalks)", "2 tablespoons extra virgin olive oil", "1 pound leeks, white and light green parts only, rinsed thoroughly and sliced", "1 small celery rib, sliced about 1/4 cup", "Salt to taste", "1 pound Yukon gold or russet potatoes, peeled and diced", "1 1/2 quarts water, vegetable stock or chicken stock", "A bouquet garni made with a bay leaf and 2 sprigs each thyme and parsley", "Freshly ground pepper", "1/4 cup chopped fresh flat-leaf parsley, chervil or tarragon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim off the tough green ends of the garlic bulbs. If the garlic has formed cloves, separate them and remove the thick shells from the tender cloves. If it has not formed cloves, just remove the outside layers. Chop coarsely. You should have about 1 cup chopped green garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large, heavy soup pot over medium heat. Add the leeks, green garlic, celery and 1/2 teaspoon salt. Cook gently for five to 10 minutes until the vegetables have softened but not colored. Add the potatoes, water, bouquet garni and salt to taste. Bring to a boil, reduce the heat, cover and simmer 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Purée the soup using an immersion blender. Alternatively, purée in a standing blender working in 1 1/2-cup batches; pull a towel tightly over the top, rather than a tight-fitting lid, to prevent splashes. Put through a medium strainer, pressing the soup through with the back of a ladle or with a pestle. Reheat, taste and adjust salt. Add freshly ground pepper. Ladle into soup bowls, and sprinkle chopped fresh parsley, chervil or chopped fresh tarragon over each serving. Alternatively, chill and serve cold. You can thin out if you wish with milk or stock."}], "link": "https://cooking.nytimes.com/recipes/1014159-green-garlic-potato-and-leek-soup"}