{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Risotto With Brussels Sprouts", "description": "If you’re looking for a new way to include healthy Brussels sprouts in your diet, look no farther than this tantalizing risotto. Like the other cruciferous vegetables, Brussels sprouts are loaded with sulfurous compounds that are believed to have strong antioxidant properties.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/01/18/health/18recipehealth_600/18recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves four to six", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 67}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 430, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "5 grams", "proteinContent": "18 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1157 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 pound Brussels sprouts, ends trimmed", "Salt to taste", "2 quarts well seasoned chicken or vegetable stock, as needed", "2 tablespoons extra virgin olive oil", "1/2 cup minced onion", "1 1/2 cups arborio or carnaroli rice", "1 to 2 garlic cloves to taste, green shoots removed, minced", "Freshly ground pepper to taste", "1/2 cup dry white wine, such as pinot grigio or sauvignon blanc", "2 teaspoons finely chopped lemon zest", "1 tablespoon freshly squeezed lemon juice", "1/2 cup freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Fill a bowl with ice water. When the water comes to the boil, salt generously and add the Brussels sprouts. Boil two minutes, then transfer to the ice water. Drain, dry on paper towels and cut in quarters."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put your stock or broth into a saucepan, and bring it to a simmer over low heat, with a ladle nearby or in the pot. Make sure that it is well seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium-high heat in a wide, heavy nonstick skillet. Sear the Brussels sprouts just until beginning to brown, about three minutes, stirring and shaking the pan. Remove from the heat, and transfer to a plate or bowl. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining olive oil over medium heat in the same skillet, or in a large, wide saucepan. Add the onion and a generous pinch of salt, and cook gently until it is just tender, about three minutes. Do not brown. Add the rice and the garlic, and stir until the grains separate and begin to crackle. Add the wine, and stir until it has been absorbed. Begin adding the simmering stock, a couple of ladlefuls (about 1/2 cup) at a time. The stock should just cover the rice and should be bubbling, not too slowly but not too quickly. Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock, and continue to cook in this fashion, stirring in more stock when the rice is almost dry. You do not have to stir constantly, but stir often. After 10 minutes, stir in the Brussels sprouts. Continue adding stock and stirring. When the rice is tender all the way through but still chewy, in about 25 minutes, it is done. Taste now and adjust seasoning, adding salt and pepper to taste. Add another ladleful of stock to the rice. Stir in the lemon zest, lemon juice and Parmesan, and remove from the heat. The mixture should be creamy (add more stock if it isn’t). Serve right away in wide soup bowls or on plates, spreading the risotto in a thin layer rather than a mound."}]}