{"@context": "http://schema.org", "@type": "Recipe", "name": "Frisée aux Lardons", "description": "Here is a bistro salad classic of curly endive with bacon and poached egg that demands a kind of ruthlessness from its cooks. You want curly endive with tender, blanched centers. That means the darker green outer leaves must be removed and not used in the dish. You want to expose the pale inner leaves and keep them looking as natural as possible. Don’t chop them. For the lardons, use bacon or, if you don’t want its smoky taste, unsmoked pancetta. And when you fry them, take care to brown the lardons lightly so that they are crisp, but with a little give. Don’t overcook them, or the egg.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/03/11/dining/11frisee/11frisee-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "quick, weekday, salads and dressings", "keywords": "bacon, eggs, endive", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 390, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "3 grams", "proteinContent": "14 grams", "saturatedFatContent": "9 grams", "sodiumContent": "493 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 handfuls tender, pale curly endive (about 10 ounces)", "6 ounces thick-cut bacon, sliced crosswise into 1/4-inch-thick lardons", "2 teaspoons Dijon mustard", "2 tablespoons sherry vinegar", "1/2 teaspoon finely grated garlic", "3 tablespoons extra virgin olive oil", "Salt and pepper", "4 eggs", "12 thin slices from a French baguette, lightly toasted and rubbed with a garlic clove"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash and dry curly endive, place in a shallow salad bowl and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet, simmer bacon for about 5 minutes in a small amount of water. Drain and dry skillet, then cook bacon over medium heat until lightly browned and crisp, but still a bit springy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the vinaigrette, whisk together mustard, vinegar and garlic. Whisk in olive oil. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a low-sided skillet on the stove and fill two-thirds with salted water. Bring to a gentle simmer. Crack each egg into a cup and carefully lower into the water. Poach eggs for 3 to 4 minutes, until whites have set and yolks are still soft. With a slotted spoon, remove to a towel-lined plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly salt endive and toss with vinaigrette, coating well. Divide greens among 4 plates, place an egg in center of each, then add 3 croutons. Spoon warm lardons over salads. Shower with freshly ground black pepper and serve."}]}