{"@context": "http://schema.org", "@type": "Recipe", "name": "Bulgur Maple Porridge", "description": "Bulgur works beautifully as a morning cereal. The best method for making this is to submerge the bulgur in boiling water the night before, then cook the reconstituted grains in the milk in the morning. Maple syrup is my hands down favorite sweetening for any hot cereal; as for additions, I love the crunch of cashews or pecans, and I also love diced dried apricots or blueberries, or both.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/03/05/science/06recipehealth/06recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 2", "recipeCuisine": "", "recipeCategory": "breakfast, weekday", "keywords": "halal, healthy, high fiber, kosher, low cholesterol, low-fat, low-sodium, vegetarian, main course, maple syrup, medium bulgur wheat, milk", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 47}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 318, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "7 grams", "proteinContent": "10 grams", "saturatedFatContent": "3 grams", "sodiumContent": "795 milligrams", "sugarContent": "23 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup medium (#2) bulgur", "Salt to taste", "1 cup water", "1 cup milk (1 percent, 2 percent, or whole, or a non-dairy variety, to your taste)", "1 teaspoon unsalted butter (optional)", "2 to 3 teaspoons maple syrup (more to taste)", "1 ounce dried apricots (5 or 6), chopped", "1/2 cup blueberries", "2 tablespoons chopped toasted pecans or cashews"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The night before, place the bulgur in a medium saucepan with salt to taste (I suggest 1/8 to 1/4 teaspoon) and stir to distribute the salt. Bring 1 cup water to a boil and pour over the bulgur.  Cover with the lid and leave overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the milk to the pot and stir together with a wooden spoon. Bring to a boil over medium-high heat. Reduce the heat to medium-low and simmer, stirring often, or for a thicker porridge stirring constantly, until the mixture has thickened like cream of wheat, 5 to 10 minutes. Stir in the butter, maple syrup and apricots or blueberries if including and continue to stir until the blueberries begin to pop and bleed into the cereal. Serve sprinkled with toasted pecans or cashews if desired."}]}