{"@context": "http://schema.org", "@type": "Recipe", "name": "Outdoor Fish Fry", "description": "Frying fish at home can be intimidating, not least because it’s messy and can leave the house smelling like a grease pit. Here, though, is a recipe that takes the cooking outside, to a large pan set over a propane hob or, as subsequent testing has borne out, to a large roasting pan filled with oil set over a gas grill. Simply heat the oil until it is very hot but not yet smoking, and add to it very fresh strips of fish dipped in a mixture of flour, salt, pepper and Old Bay, then into egg, and finally into panko, and fry until golden brown on each side, super-crisp, with a moist, tender and perfectly cooked interior. Buy a lot of fish. This is one of those recipes where people tend to want seconds and thirds. Serve with slaw and, if you like, tartar sauce.", "author": {"@type": "Person", "name": "John Willoughby And Chris Schlesinger"}, "image": "https://static01.nyt.com/images/2014/08/29/dining/outdoorfishfry/outdoorfishfry-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "About 12 servings", "recipeCuisine": "", "recipeCategory": "easy, quick", "keywords": "fish, panko, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 63}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 628, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "2 grams", "proteinContent": "47 grams", "saturatedFatContent": "4 grams", "sodiumContent": "684 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["6 pounds very fresh striped bass or bluefish", "2 cups flour", "1 tablespoon kosher salt", "1/4 cup freshly cracked black pepper", "1/4 cup Old Bay spice mix", "6 eggs", "1/2 cup half-and-half", "3 cups panko", "1 1/4 to 1 1/2 cups vegetable oil of your choice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut fish into chunks about 2 inches square; you should have about 24 chunks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine flour, salt, pepper and Old Bay in a shallow baking pan (those handy disposable aluminum pans work) and mix well. Crack eggs into a second such pan, then add half-and-half and whisk briefly to combine. Put panko in a third pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dunk chunks of fish sequentially into flour mixture, egg mixture and panko, shaking gently after each dunk to get rid of any excess. Place coated fish chunks into a fourth shallow baking pan right by the stove next to burner."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour vegetable oil into a 20-inch iron skillet; it should come to a depth of about 1/4 inch. Turn a propane burner to medium-high (see note), and set skillet over flame. Heat until oil is hot but not smoking. You can test it by dropping a small bit of fish into the oil; it should bubble furiously."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half the pieces of fish and cook until deep golden brown on the side facing down, about 2 to 3 minutes. Flip over and once again cook until deep golden brown on the downward side, about 2 to 3 minutes more. Remove from oil, drain briefly on paper towels, and hand to your guests."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow oil to heat up until not quite smoking again, then add remaining fish and follow the same procedure. Because the oil will have degraded somewhat, these pieces will take a bit longer, maybe 4 minutes a side."}], "link": "https://cooking.nytimes.com/recipes/1014786-outdoor-fish-fry"}