{"@context": "http://schema.org", "@type": "Recipe", "name": "Sambal Stingray in Banana Leaf", "description": "", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/sambal-stingray-banana-leaf/sambal-stingray-banana-leaf-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "banana leaf, shrimp paste, skate wing, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "recipeIngredient": ["1 ounce (about 1/2 cup) dried red chilies", "2 ounces (about 1/2 cup) dried small shrimp (available in Asian markets)", "10 to 12 large garlic cloves", "8 to 10 shallots, peeled", "3-inch piece ginger, peeled and coarsely chopped", "3-inch piece lemon grass, white end, coarsely chopped", "1 teaspoon belachan shrimp paste, available in Asian markets or 2 teaspoons fish sauce", "1 tablespoon tamarind paste or lime juice, more to taste", "2 tablespoons light brown sugar, more to taste", "1/4 cup raw peanuts", "2 tablespoons vegetable oil, plus more for fish", "1 whole, skinless skate wing, 1 1/2 to 2 pounds, or firm fillets like snapper, about 3/4-inch thick", "3 banana leaves (available frozen at Asian and Latin markets)", "Slices of lemon, for garnish", "Slices of white onion, for garnish", "Sprigs of cilantro, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sambal: In separate bowls, soak the chilies and the dried shrimp in water to cover for 10 minutes, then drain. Remove and discard stems and seeds from the chilies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender, combine the chilies, shrimp and remaining sambal ingredients, except the oil, with 1/2 cup water. Blend until finely chopped but not smooth. Heat the oil in a frying pan over medium heat and add the sambal. Cook, stirring often, until it is moist, thick and dark red, adding water 1 tablespoon at a time if needed to prevent scorching."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the fish: Rinse and dry the fish and sprinkle it with salt. Heat a grill to high, or place a heavy skillet (with a lid) over medium-high heat. Spread one side of the fish with a thin layer of sambal. Place a banana leaf on grill (or in skillet), drizzle lightly with vegetable oil and place the fish on top, sambal side up. Cover grill or pan and cook about 8 minutes, until the banana leaf is toasted and the sambal is dry and fragrant. Remove the leaf and fish from the heat. Place a new banana leaf on grill or in pan, drizzle it with oil, flip fish onto it and spread more sambal on top. Cover and cook another 6 to 8 minutes, until cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place another leaf on a platter. Flip the fish onto it, spoon more sambal over the top and garnish with lemon and onion slices and cilantro sprigs. To serve whole skate, slide the fish off the spine with a spoon."}], "link": "https://cooking.nytimes.com/recipes/1014104-sambal-stingray-in-banana-leaf"}