{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon and Blood Orange Gelée Parfaits", "description": "Inspired by a wonderful dessert in the pastry chef Sherry Yard’s “Desserts by the Yard,” this is a beautifully layered jello. First make the lemon gelée – even better if you have Meyer lemons at your disposal – and let it set in the glasses (this will take about an hour, so plan accordingly). Then make the blood orange jelly and pour on top of the lemon layer. The lemon layer is thinner than the blood orange layer.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/02/12/science/12recipehealth/12recipehealth-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "blood orange, gelatin, meyer lemon, dairy-free, gluten-free, healthy, low cholesterol, low-fat, low-sodium, nut-free, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 170, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "0 grams", "proteinContent": "5 grams", "saturatedFatContent": "0 grams", "sodiumContent": "13 milligrams", "sugarContent": "35 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon powdered unflavored gelatin (1 envelope plus 1/2 teaspoon)", "1 1/4 cups water", "6 to 7 tablespoons sugar (to taste; I like to use organic sugar, which is coarser than regular granulated sugar and has an off-white color)", "2/3 cup strained freshly squeezed lemon or Meyer lemon juice", "2 tablespoons powdered unflavored gelatin (2 envelopes plus 1 teaspoon)", "1/2 cup water", "1/4 cup sugar", "3 1/2 cups freshly squeezed blood orange juice, all but 1/2 cup of it strained of pulp"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Get out six 6- or 8-ounce glasses (I use 6-ounce tumblers that taper out from the bottom)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the lemon layer. Place the gelatin in a medium bowl and pour in 1/4 cup of the water. Allow the gelatin to sit and “bloom” for 10 minutes. Combine the remaining water and the sugar in a saucepan and bring to a bare simmer. Simmer until the sugar has dissolved and remove from the heat. Pour over the gelatin mixture and stir until the gelatin has dissolved. Stir in the lemon juice. Pour about an inch into each of the glasses. Place in the refrigerator until set, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the blood orange gelée. Juice all but one of the oranges and strain. Juice the remaining orange, strain out the seeds but not the pulp, and add to the strained juice. Place the gelatin in a medium bowl and pour in 1/4 cup of the water. Allow the gelatin to sit and “bloom” for 10 minutes. Combine the remaining water and the sugar in a saucepan and bring to a bare simmer. Simmer until the sugar has dissolved and remove from the heat. Pour over the gelatin mixture and stir until the gelatin has dissolved. Stir in the orange juice. Make sure that the lemon layers are set and fill the tumblers with the orange juice mixture. If you want, you can make different patterns, alternating stripes of orange and yellow, but you will have to allow each layer to set before you add the next one. Refrigerate for several hours, until set."}], "link": "https://cooking.nytimes.com/recipes/1014536-lemon-and-blood-orange-gelee-parfaits"}