{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick Fresh Tomatillo Salsa", "description": "Tomatillos, which are closer botanically to the gooseberry than to the tomato, have a wonderful acidic tang. To get the best out of them they should be simmered or grilled for about 10 minutes, until they’re soft and the color has gone from pale green to olive. You can use them for a quick, blended salsa (like the one in this recipe) and also for a cooked salsa, which has a rounder, seared flavor. Use on tacos, or as chip or vegetable dip, or alongside grilled chicken or pork.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/07/29/science/recipehealth29/recipehealth29-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 cups, serving 8", "recipeCuisine": "", "recipeCategory": "condiments", "keywords": "dairy-free, gluten-free, halal, healthy, kosher, low calorie, low-carb, low cholesterol, low-fat, low sugar, nut-free, vegan, vegetarian, jalapeño, tomatillo, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 114}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 21, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "170 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 pound tomatillos, husked and rinsed", "2 to 4 jalapeño or serrano chiles, seeded for a milder salsa, coarsely chopped", "1/4 cup chopped onion, soaked for 5 minutes in cold water, drained and rinsed", "", "1/4 to 1/2 cup coarsely chopped cilantro (to taste)", "Salt to taste (about 1/2 teaspoon)", "1/4 to 1/2 cup water, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tomatillos in a saucepan, cover with water and bring to a boil. Reduce the heat and simmer for 8 to 10 minutes, flipping them over halfway through, until softened and olive green. Remove from the heat. Transfer to a blender. Add the chiles, onion, cilantro, and 1/4 cup water to the blender and blend to a coarse puree.  Transfer to a bowl, add salt, and thin out as desired with water. Taste and adjust salt, and set aside for at least 30 minutes before serving, to allow the flavors to develop."}], "link": "https://cooking.nytimes.com/recipes/1014926-quick-fresh-tomatillo-salsa"}