{"@context": "http://schema.org", "@type": "Recipe", "name": "Amaranth, Ricotta and Greens Pancakes", "description": "These pancakes are inspired by another recipe, for rice, beet greens and ricotta blinis. They are made with amaranth, a high-protein, gluten-free grain and have a lighter texture than the rice cakes. Cooked amaranth is good in baked goods and griddled cakes because it’s so moist. I cooked the amaranth in homemade turkey stock (made and frozen after Thanksgiving), and the stock gave it a very nice flavor; I recommend cooking it in some kind of flavorful stock, whether it’s  vegetable, chicken or turkey.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/06/10/health/10recipehealth/10recipehealth-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "About 20  2 1/2- to 3-inch cakes, serving 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "halal, healthy, kosher, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 13}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 358, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "5 grams", "proteinContent": "17 grams", "saturatedFatContent": "7 grams", "sodiumContent": "643 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup amaranth", "1 cup chicken stock or vegetable stock", "Salt to taste", "1 large bunch chard, stemmed and washed ", "1 cup (8 ounces) ricotta cheese", "2 eggs, beaten", "1/2 cup low-fat milk (2 percent)", "5 tablespoons grated Parmesan", "1/2 cup plus 2 tablespoons whole-wheat pastry flour or white whole-wheat pastry flour", "1 teaspoon baking powder", "1/2 teaspoon salt", "2 tablespoons extra virgin olive oil", "1/2 medium onion, finely chopped (about 2/3 cup)", "2 large garlic cloves, minced", "Freshly ground pepper", "Olive oil or butter for the pan or griddle", "Marinara sauce for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the amaranth. Combine with the stock and salt to taste in a medium saucepan and bring to a boil. Reduce the heat, cover and simmer 30 minutes, until all of the liquid has been absorbed. Remove from the heat and let sit for 15 minutes or longer without disturbing. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the greens above 1 inch of boiling water for about 1 to 2 minutes, just until wilted. Remove from the heat, allow to cool and squeeze out excess water. Chop fine. You should have 1 cup chopped blanched chard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a medium-size skillet and add the onion. Cook, stirring, until tender, about 5 minutes. Stir in the garlic and cook, stirring, until fragrant, about 30 seconds. Add the greens, season with salt and pepper, stir together until well coated with oil, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat together the ricotta, eggs, milk and Parmesan. Sift together the flour, baking powder and salt and whisk into the ricotta mixture. Stir in the greens, amaranth and pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a griddle or a heavy nonstick skillet over medium-high heat. Brush with olive oil or butter, enough to coat the bottom, and drop the batter in by the heaped tablespoon (or use a small ladle or a 1/4-cup measuring cup, filling it only partway). The pancakes should be 2 1/2 to 3 inches in diameter. Cook for about 3 minutes, until lightly browned and risen, and turn over. Cook for another 3 minutes, until brown on the other side. The pancakes will be moist in the middle, but there should not be a raw flour taste. Remove from the heat and serve, or cool on a rack and heat later in a medium-low oven. Serve with a dollop of tomato sauce."}]}