{"@context": "http://schema.org", "@type": "Recipe", "name": "White House Apple Cake", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT1H", "recipeYield": "One 10-inch cake", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, maple syrup, tart apples, dessert, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 74}, "recipeIngredient": ["3/4 cup canola or safflower oil", "1/2 cup light brown sugar (tightly packed)", "1/2 cup honey", "2 eggs", "1 teaspoon vanilla", "1 1/4 cups all-purpose flour", "1 teaspoon baking soda", "1/4 teaspoon salt", "1 teaspoon cinnamon", "1 cup peeled grated apples, like Granny Smith", "1 large orange, optional", "1/4 cup amber maple syrup", "1/3 cup confectioner’s sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Heat the oven to 350 degrees. Grease a 10-inch cake pan and place a silicone sheet or parchment paper on the bottom. (You can substitute a 10-inch spring-form pan, as long as it is tightly sealed at the bottom.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a handheld or electric mixer, combine the oil, brown sugar, honey, eggs and vanilla in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, sift the flour, baking soda, salt and cinnamon. Add half the sifted dry ingredients to the liquid mixture, and mix on a low speed until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the grated apples and the remainder of the dry ingredients. Finish mixing by hand, and pour into the greased cake mold. Bake for 40 to 50 minutes, or until a toothpick inserted in the center comes out clean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the maple glaze: Stir maple syrup and confectioner’s sugar over low heat in a small saucepan until combined. Then increase the heat and boil for 30 seconds. Set aside on the stove top, off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish the cake, run a paring knife around the edge of the cake pan. Invert a serving dish on top of the cake and then flip the cake over onto the dish, carefully lifting away the cake pan. Re-warm the maple glaze, stir it and pour it over the warm cake. You may decorate the platter with peeled orange sections. The cake will stay moist overnight if covered with foil. It does not need to be refrigerated."}], "link": "https://cooking.nytimes.com/recipes/1014183-white-house-apple-cake"}