{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole-Wheat Quinoa Bread", "description": "This moist, hearty bread slices beautifully for sandwiches or toast. The dough is sticky because of the moisture from the cooked quinoa, but resist the urge to add too much flour.  ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/09/21/science/22recipehealth/22recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "Two loaves, about 16 slices in each loaf", "recipeCuisine": "", "recipeCategory": "project", "keywords": "appetizer, healthy, vegan, vegetarian, quinoa, whole wheat flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 163}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 310, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "7 grams", "proteinContent": "10 grams", "saturatedFatContent": "1 gram", "sodiumContent": "355 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 teaspoons active dry yeast", "3 cups lukewarm water", "1 tablespoon agave syrup", "1 tablespoon blackstrap molasses", "2 cups all-purpose or white bread flour", "2 cups whole-wheat flour", "1/4 cup canola oil", "1 scant tablespoon salt", "2 cups cooked quinoa", "3 to 4 cups whole-wheat flour, as needed", "1 egg, beaten with 2 tablespoons water for egg wash", "1 tablespoon sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the yeast and water and stir until dissolved. Stir in the agave syrup and molasses. Whisk in the flours, 1 cup at a time. Stir or whisk this mixture 100 times, for about two minutes. Scrape down the sides of the bowl with a spatula, cover the bowl with plastic and leave to rise in a warm spot for one hour, until bubbly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the oil to the sponge and fold in, using a large spoon or spatula. Add the salt and fold in. Fold in the quinoa, then fold in 2 cups of the whole-wheat flour. Place another 1/2 cup whole-wheat flour on your work surface, then scrape out the dough. Use a paddle to help fold the dough over while kneading until it has absorbed the flour on your work surface. Flour your hands, and knead the dough for 10 minutes, adding flour as necessary, until it is elastic and springs back when you press it with your finger. It will be dense and sticky. Shape the dough into a ball. Rinse and dry your bowl, and coat it with oil. Place the dough in it, then flip the dough over so that it is coated with oil. Cover the bowl tightly with plastic wrap, and set in a warm spot to rise for one hour or until doubled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch down the dough, cover the bowl and allow the dough to rise again for 45 minutes to an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Divide the dough into two parts, and shape into loaves. Place half of the sesame seeds on your work surface, and gently roll the rounded side of one loaf over them so that they stick. Repeat with the remaining sesame seeds and the other loaf. Oil two 9-by-5-inch bread pans, and place the loaves in the pans, first seam side up, then seam side down. Cover with a damp towel and allow to rise for 30 minutes, or until the surface of the loaves rises above the edges of the bread pans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently brush the loaves with egg wash. Using a sharp knife, cut two or three 1/2-inch-deep slashes across the top of each loaf. (If this causes the loaves to deflate, let them sit for another 15 to 20 minutes.) Bake 50 to 55 minutes, brushing again halfway through with egg wash. The bread is done when it is golden brown and responds to tapping with a hollow sound. Remove from the pans and cool on a rack."}]}