{"@context": "http://schema.org", "@type": "Recipe", "name": "Goat Cheese, Chard and Herb Pie in a Phyllo Crust", "description": "Instead of making a top crust for this phyllo pie I take the overhanging layers of phyllo and scrunch them around the rim to make a nice crisp border for the pie. I didn’t want to put on a top layer of phyllo because the filling is quite liquid before it bakes and sets up, and I was afraid that the phyllo would become too soggy.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/02/19/science/20recipehealth/20recipehealth-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "goat cheese, phyllo, swiss chard, halal, healthy, kosher, low sugar, nut-free, vegetarian, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 71}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 190, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "1 gram", "proteinContent": "9 grams", "saturatedFatContent": "5 grams", "sodiumContent": "292 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 generous bunch Swiss chard (about 3/4 pound), stemmed and washed", "Salt to taste", "8 sheets phyllo (4 ounces)", "3 eggs", "6 ounces goat cheese", "3/4 cup low-fat  milk", "2 garlic cloves, pureed or put through a press", "1/2 cup chopped fresh herbs, such as parsley, dill, chives, tarragon, marjoram\nSalt and freshly ground pepper", "2 tablespoons extra virgin olive oil, or 1 tablespoon olive oil and 1 tablespoon melted unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil while you stem and wash the Swiss chard. If the stems are wide and meaty set them aside for another purpose. If they are thin and sinewy, discard. When the water comes to a boil salt generously and add the chard leaves. Fill a bowl with cold water. Blanch the chard for 1 minute, just until tender, and transfer to the bowl of cold water. Drain, take up the chard by the handful and squeeze out excess water. Chop medium-fine. You should have about 1 cup chopped cooked chard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Blend together the eggs and goat cheese, either in an electric mixer or in a food processor fitted with the steel blade. Add the milk and the garlic and blend until smooth. If using a processor, scrape into a bowl. Stir in the blanched chopped chard, the herbs, and salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush a 9- or 10-inch tart pan or cake pan with olive oil and place on a baking sheet for easier handling. Open up the package of phyllo and unfold the sheets of dough. Remove 8 sheets of phyllo and fold the remaining dough back up. Wrap tightly in plastic, return to the box if you wish and either refrigerate or freeze. Lay a sheet of phyllo in the pan, tucking it into the seam of the pan, with the edges overhanging the rim. Brush it lightly with olive oil (or melted butter and oil) and turn the pan slightly, then place another sheet on top, positioning it so that the edges overlap another section of the pan’s rim. Continue to layer in 6 more sheets of phyllo, brushing each one with oil – both the bottom and the sides and edges that overhang the pan -- and staggering them so that the overhang on the rim of the pan is evenly distributed and covers the entire pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the goat cheese and chard filling into the phyllo-lined pan, scraping all of it out of the bowl with a rubber spatula. Scrunch the overhanging phyllo in around the edges of the pan to form an attractive lip. Brush the scrunched rim with olive oil. Place in the oven and bake 40 minutes, until the filling is puffed, set and lightly colored on the surface. Remove from the heat (if it puffed up it will settle) and allow to sit for at least 10 minutes before cutting. Serve hot, warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1014554-goat-cheese-chard-and-herb-pie-in-a-phyllo-crust"}