{"@context": "http://schema.org", "@type": "Recipe", "name": "Strozzapreti With Roasted Tomatoes", "description": "", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Strozzapreti/Strozzapreti-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "all-purpose flour, cherry tomatoes, pecorino, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 91}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 691, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "4 grams", "proteinContent": "29 grams", "saturatedFatContent": "12 grams", "sodiumContent": "831 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 ounces (about 22) cherry tomatoes, halved", "3 tablespoons extra virgin olive oil", "5 garlic cloves, minced", "2/3 cup finely grated pecorino cheese", "1/4 cup, firmly packed, fresh basil or parsley leaves", "1 cup grano duro flour or unbleached all-purpose flour, more as needed", "2 large eggs", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the sauce: Preheat oven to 300 degrees. In a mixing bowl, combine tomatoes, 1 tablespoon oil and 4 minced garlic cloves. Toss well, then spread tomatoes on a baking sheet, cut sides up. Roast until soft and collapsing, about 45 minutes; do not allow to dry or brown. Meanwhile, in a food processor combine remaining minced garlic, cheese, and basil or parsley. Process until very finely chopped. When tomatoes are soft, immediately spread cheese-herb mixture on top and lightly mash with a spoon so cheese melts. Drizzle with 2 more tablespoons oil, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the strozzapreti: On a wooden counter or large cutting board, mound 1 cup flour and make a well in center. Break eggs into well. Using your hands, mix eggs in well, gradually pulling in more and more flour to make a pasty dough. Knead dough briefly, using lightly floured hands if dough is very wet; it should be moist but not sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape wooden board clean. Using a wooden rolling pin (and a very light dusting of flour if necessary), roll dough out as thinly as possible into an approximate rectangle. Using a knife, score rectangle into strips an inch wide and about three inches long. Pick up one piece of dough and press it around a bamboo meat skewer about the diameter of an umbrella spoke. This is most successful if done quickly and not too carefully, so that dough fits tightly round skewer with an overlapping, visible seam. Slide skewer out of pasta and set pasta aside on a plate. Repeat to use remaining dough. Pieces should be irregular in size and shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of lightly salted water to a boil. If desired, return baking sheet of tomatoes to a 300-degree oven just to reheat. Add strozzapreti to pot and cook until tender, slightly chewy and no longer raw in center. This is best done by tasting after strozzapreti float to surface; be careful not to under- or overcook. Drain cooked pasta and pour into a large bowl; immediately add tomatoes. Toss quickly and serve hot."}]}