{"@context": "http://schema.org", "@type": "Recipe", "name": "Giant Green Pie (Torta Pasqualina)", "description": "This savory pie, called torta pasqualina in Italy, is many times made for special occasions because the preparation is a bit fiddly. The finished product, though, is impressive to behold, and you’re sure to draw compliments from your dining companions. Traditional cooks use a strudel-like pastry, rolled out very thin into a large circle, for the pie. At least four layers are necessary, brushed with oil to achieve a flaky crust. (You can get good results with phyllo dough or ordinary pie dough.)", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/03/11/dining/11grnpie/11grnpie-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "10 to 12 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pies and tarts", "keywords": "eggs, greens, ricotta, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 215}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 330, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "4 grams", "proteinContent": "16 grams", "saturatedFatContent": "5 grams", "sodiumContent": "555 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["375 grams all-purpose flour, about 3 cups, plus more as needed", "1 teaspoon salt", "4 tablespoons olive oil", "2 1/2 pounds washed greens (a mix of chard, spinach or other greens) ", "2 tablespoons olive oil, plus more for brushing pastry layers", "3 cups diced onion", "Salt and pepper ", "Grated nutmeg, to taste", "1 cup ricotta", "3 ounces grated Parmesan", "9 large eggs", "2 teaspoons sugar, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Put flour in a large mixing bowl. Stir together 1 cup water, 1 teaspoon salt and 4 tablespoons oil, then pour over flour and mix until dough comes together in a rough ball. Turn out onto a floured board and knead until smooth, 2 to 3 minutes, adding more flour if dough is sticky. Wrap and set aside at room temperature for 30 minutes. (May refrigerate overnight and bring to room temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Bring a large pot of water to a boil. Working in batches, blanch a handful of greens at a time, dropping them into the water until just wilted, then cooling in a colander under running water. Divide greens into 4 balls and squeeze to remove as much water as possible. Chop greens coarsely with a large knife, then squeeze again. There should be about 4 cups cooked greens. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons oil in a large skillet or wide pot over medium heat. Add onions and a little salt and cook, stirring, until softened, about 5 minutes. Add greens, season generously with salt and pepper, and mix well. Turn off heat. Add nutmeg, ricotta and half the Parmesan and mix. Taste and adjust; it should be highly seasoned. Beat 4 of the eggs. Set aside 3 tablespoons beaten egg; add remaining beaten egg to greens and mix well. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Cut dough into 4 pieces and form into balls. Roll out each ball into a very thin 12-inch circle. Place 1 dough circle on a 12-inch pizza pan lined with parchment. Brush lightly with oil, then lay another dough circle on top. Spoon greens evenly over dough to a 2-inch thickness, leaving a 1-inch border of dough. Smooth the surface. With a soup spoon, make 5 indentations in greens and crack a raw egg into each depression. Sprinkle with remaining Parmesan. Cover with another dough circle and paint lightly with oil. Place last dough circle on top. Using a paring knife, trim any excess dough at perimeter of pie. Fold outer edges together and crimp to seal pie. Paint top with reserved beaten egg. Sprinkle with sugar if desired. Using a paring knife, make 2 or 3 steam vents."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for about 45 minutes, until very well browned. Slide torta onto a cutting board and let cool slightly before slicing. May also be served at room temperature."}]}