{"@context": "http://schema.org", "@type": "Recipe", "name": "Greens and Garlic Frittata to Go", "description": "Chop the greens super-fine to achieve the prettiest color. Use whatever looks best in the market (spinach and chard are brightest when it comes to color), or you can use bagged baby spinach. You only need 1/2 cup of chopped greens, but you could use twice that amount.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/08/17/science/22recipehealth/22recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "Serves 2", "recipeCuisine": "", "recipeCategory": "breakfast, easy, quick", "keywords": "eggs, garlic, greens, gluten-free, halal, healthy, kosher, low-carb, low sugar, nut-free, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 348}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 201, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "14 grams", "saturatedFatContent": "5 grams", "sodiumContent": "276 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["4 eggs", "1 tablespoon milk", "Salt and freshly ground pepper to taste", "1/2 to 3/4 cup finely chopped blanched spinach, chard, kale or beet greens (to taste)", "1 garlic clove, minced or pureed", "1 tablespoon, tightly packed, freshly grated Parmesan", "2 teaspoons extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs and milk in a bowl with salt and pepper to taste. Beat in the greens, garlic and the Parmesan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium-high heat in a heavy, 8-inch nonstick omelet pan. Drop a bit of egg into the pan and if it sizzles and cooks at once, the pan is ready. Pour in the egg mixture, scraping in every last bit with a heat-proof rubber spatula. Swirl the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the frittata with the spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking. Once a few layers of egg have cooked during the first couple of minutes of cooking, turn the heat down to low, cover and cook 7 to 10 minutes, until the frittata is puffed and just about set. From time to time remove the lid and loosen the bottom of the omelet with a wooden or heat-proof rubber spatula, tilting the pan, so that the bottom doesn’t burn. It will however turn golden."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the frittata is still runny on the top, wearing oven mitts, slide the frittata out onto a plate or even better, a saucepan lid that has a handle, reverse the pan over the plate or lid, and holding the two together, flip the plate or lid so that the frittata goes back into the pan on its not-quite-cooked side. Finish for no longer than a minute, then reverse onto a platter. Allow to cool to room temperature, and serve, or chill. Cut into 4 wedges to serve. The wedges pack well and are very portable."}], "link": "https://cooking.nytimes.com/recipes/1014983-greens-and-garlic-frittata-to-go"}