{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Baby Back Ribs With Spicy Peanut Shake", "description": "Marinating, it’s said, not only adds flavor and moisture that will stay with the food through the rigors of the grilling process, but also tenderizes whatever you’re about to put over the coals. There’s only one problem with this comforting culinary scenario: It’s mostly not true. These ribs are grilled naked, save for some salt and pepper. Afterward, they are cut into individual ribs and tossed with hoisin sauce, soy sauce, orange juice and ginger and sprinkled with a spicy peanut shake. You get the ease of last-minute preparation and brighter, clearer, more direct flavors and you can show off a bit for your guest as you mix and toss at the last minute.", "author": {"@type": "Person", "name": "John Willoughby And Chris Schlesinger"}, "image": "https://static01.nyt.com/images/2013/08/21/dining/21JPGRILLING1/21JPGRILLING-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "6 appetizer servings, 3 to 4 entree servings", "recipeCuisine": "barbecue", "recipeCategory": "dinner, lunch", "keywords": "baby back ribs, peanut, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 110}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 926, "unsaturatedFatContent": "41 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "67 grams", "fiberContent": "3 grams", "proteinContent": "71 grams", "saturatedFatContent": "21 grams", "sodiumContent": "1133 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2/3 cup dry-roasted peanuts, finely chopped", "1 tablespoon roasted sesame oil", "1 1/2 teaspoons chile powder", "1/4 cup thinly sliced scallions", "2 racks of baby back ribs, about 2 1/4 pounds each", "Salt and pepper to taste", "1/3 cup hoisin sauce", "1/4 cup soy sauce", "1/4 cup orange juice (freshly squeezed is best)", "2 tablespoons minced ginger", "Kosher salt and freshly cracked black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the shake: Combine the peanuts, sesame oil and chile powder in a small bowl and mix well, then put in a sauté pan over medium-low heat and toast, tossing occasionally, until light brown and very fragrant, about 8 to 10 minutes. Remove from heat. When the mixture has cooled to room temperature, stir in the scallions and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, build a fire in your grill; when the coals are all covered with gray ash and the temperature is medium low (you can hold your hand 5 inches above the coals for about 7 seconds), you’re ready to cook. (For a gas grill, turn all burners to high, lower cover and heat for 15 minutes, then turn burners to medium low.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the ribs generously with salt and pepper, put them on the grill directly over the coals, and cook until a peek inside shows that the meat no longer has any pink at the center, about 10 to 12 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the ribs are grilling, prepare all the remaining ingredients but keep in separate containers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the racks of ribs off the grill, cut them into individual ribs, and put them in a large bowl. Add the hoisin, soy, orange juice and ginger one after another and toss with spirit. Lay the ribs out on a platter, sprinkle with the spicy peanut shake and serve."}]}