{"@context": "http://schema.org", "@type": "Recipe", "name": "Berry and Rose Geranium Smoothie", "description": "When I go to a farmers’ market in summer, I can’t resist buying more fruit than I need. I blame those cut fruit samples — one taste, and I’m filling my bag. Fruit from the market is already ripe, and there are times when I need to use up what I have. Smoothies are a great solution; you can blend a lot of fruit into one drink, more than you’d cut up and stir into your morning yogurt.This week I tried something different. I didn’t use frozen bananas in these recipes, as I usually do for smoothies, and I decided not to use dairy. Some of this week’s offerings are pure fruit and ice, sweetened with a rose geranium-infused syrup or agave nectar. When I needed to bulk up a smoothie or make it creamier, I used almond milk. Except for one made with dates and figs, you’ll find these smoothies only moderately sweet. In all of them, you can really taste the fruit. Fragrant rose geranium is very easy to grow in pots, and a little goes a long way. I use it to make a syrup that I add to just about anything I make with berries.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/berrysmoothie/berrysmoothie-articleLarge.jpg", "recipeYield": "One serving", "recipeCuisine": "", "recipeCategory": "shakes and smoothies", "keywords": "healthy, raw, vegan, vegetarian, summer", "aggregateRating": null, "recipeIngredient": ["1/2 cup blueberries", "1/2 cup raspberries", "3/4 cup hulled strawberries", "2 to 3 tablespoons rose geranium syrup (see below)", "4 ice cubes", "1/2 cup sugar", "1/2 cup water", "2 sprigs rose geranium"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place all of the ingredients in the blender. Blend until frothy, about one minute. Serve at once."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the sugar and water, and bring a to a boil. Reduce the heat, and simmer three to five minutes until slightly thick. Add the rose geranium sprigs to the pot, turn off the heat and cover tightly. Allow the rose geranium to steep for 15 minutes. Strain into a jar, and place in the refrigerator. The syrup will keep for about a week."}]}