{"@context": "http://schema.org", "@type": "Recipe", "name": "Parsley Salad With Barley, Dill and Hazelnuts", "description": "I was going to call this a barley salad with parsley, dill and hazelnuts, but it is really a parsley salad, like a Middle Eastern tabbouleh. The relatively small amount of barley contributes substance and a wonderful chewy texture, as do the hazelnuts. I prefer it on the lemony side so I use 3 tablespoons lemon juice, but I’ve given you a range.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/08/23/science/28recipehealth/28recipehealth-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "barley, dill, parsley, dairy-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, low sugar, vegan, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 46}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 318, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "7 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "338 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup barley", "Salt", "4 cups fresh parsley leaves", "3 tablespoons chopped dill", "3/4 cup thinly sliced celery, from the inner heart of the bunch", "4 radishes, sliced thin (halved first and cut in half moons if they’re large)", "1/2 teaspoon ground sumac", "5 tablespoons toasted hazelnuts, skinned", "2 to 3 tablespoons fresh lemon juice (to taste)", "1/4 cup extra virgin olive oil", "1 tablespoon hazelnut oil or walnut oil", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring about 3 cups water to a boil in a medium saucepan and add the barley and salt to taste. Reduce the heat, cover and simmer 45 to 50 minutes, until the barley is tender. Drain and return the barley to the pot. Place a towel over the top of the pot and return the lid. Let sit for 15 minutes. Line a sheet pan with paper towels and place the cooked barley on top to cool. When cool, transfer to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the parsley leaves into fine shreds by gathering together a bunch of leaves, and cutting across the bunch with a chef’s knife. Place in the bowl with the barley. Add the dill, celery, radishes and sumac."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the toasted skinned hazelnuts in a plastic bag or a pastry bag and place on your work surface. With a rolling pin, roll over the nuts to crush them into halves. Don’t crush them completely (but don’t worry if your pieces are smaller than neat halves). Add to the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the lemon juice, salt and pepper to taste, the olive oil and the hazelnut or walnut oil. Toss with the salad and serve."}]}