{"@context": "http://schema.org", "@type": "Recipe", "name": "Paella Master Recipe", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/07/dining/paella/paella-articleLarge-v3.jpg", "totalTime": "PT50M", "recipeYield": "", "recipeCuisine": "spanish", "recipeCategory": "dinner", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 500}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 325, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "504 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["3 tablespoons olive oil", "1/2 pound meat, like chicken thighs, chorizo, pork, etc. (optional)", "Salt and pepper to taste", "1 onion, chopped", "1 bell pepper, minced", "2 cups rice", "1 pinch saffron", "3 1/2 cups liquid (chicken, lobster or vegetable stock; water; wine, etc., or a combination)", "1/2 pound seafood, like shrimp, mussels, squid, etc. (optional)", "1/2 pound vegetables, like olives, tomatoes, snow peas, mushrooms"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 3 tablespoons olive oil in a 12-inch skillet over medium-high heat. When hot, add about 1/2 pound of meat (or a combination of meats), sprinkle with salt and pepper and cook until nicely browned. Add one chopped onion and some minced bell pepper at the same time if you like and cook until soft. (If you want a meatless paella, skip right to the onion.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 cups rice and (if you have it) a pinch of saffron and cook, stirring, until shiny. Add 3 1/2 cups of your liquid of choice, heated, and stir until just combined, then stir in seafood (or lay it on top of the rice). Again, skip the seafood if you want vegetarian paella."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook over medium-high heat, undisturbed. If the pan is too big for your burner, move it around a little; but after that initial stirring, leave it alone. When the mixture starts to dry, begin tasting the rice; if the liquid amount seems O.K., keep going. If the rice seems quite tough, add another 1/2 cup or so of liquid. And if you can smell the bottom starting to burn, lower the heat a bit. About halfway through the cooking (about 10 minutes), add any vegetables, adjust seasonings and stir gently, just once."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The rice is done when tender and still a bit moist; if the mixture has stuck to the bottom of the pan, congratulations: you have <em>socarrat</em>, a characteristic of good paella. This should be served in the pan, in the middle of the table, and dinner guests — up to six — should fight over it."}], "link": "https://cooking.nytimes.com/recipes/1014667-paella-master-recipe"}