{"@context": "http://schema.org", "@type": "Recipe", "name": "Focaccia Dough", "description": "This dough recipe makes enough for three focaccias, so bake one loaf tonight and freeze the remaining dough. This can be topped with sautéed ramps or  roasted potatoes, or simply brushed with good salt and olive oil. Baking it in a cake pan will allow for a nice-looking, gently domed loaf. (The New York Times)", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/29/dining/focacciadough-still/focacciadough-still-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "3 balls of dough (for 9-inch focaccias)", "recipeCuisine": "italian", "recipeCategory": "project", "keywords": "active dry yeast, all-purpose flour, extra virgin olive oil, appetizer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 139}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1247, "unsaturatedFatContent": "47 grams", "carbohydrateContent": "161 grams", "cholesterolContent": null, "fatContent": "57 grams", "fiberContent": "10 grams", "proteinContent": "25 grams", "saturatedFatContent": "8 grams", "sodiumContent": "624 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["3 3/4 teaspoons active dry yeast", "3/4 cup extra-virgin olive oil, more as needed", "11 grams kosher salt (1 tablespoon)", "10 grams sugar (2 teaspoons)", "515 grams all-purpose flour (about 4 cups), more as needed ", "130 grams whole wheat flour (about 1 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1 1/2 cups lukewarm water (105 to 115 degrees) in a large bowl or the bowl of a stand mixer. Sprinkle yeast over it. Let stand until foamy, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir oil, salt and sugar into yeast mixture. Stir in all-purpose and whole-wheat flour until a soft dough forms (you may need to add more all-purpose flour)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough out onto a floured surface. Knead until it is smooth and elastic, about 10 minutes, or knead in a stand mixer with a dough hook attached for about 5 minutes. If using a stand mixer, finish dough by hand, on a floured surface, for 1 minute. Add more all-purpose flour if dough feels very sticky (you want damp but not unworkable dough)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a large bowl. Place dough in bowl and turn to coat it lightly with oil. Cover bowl with a dish towel. Leave in a warm place until dough has doubled in size, about 1 hour.\n\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough into 3 equal-size balls. Tightly wrap in plastic any you are not planning to use right away and freeze. Transfer remaining balls to a baking sheet and cover loosely with a towel. Let rest for 20 to 30 minutes. "}]}