{"@context": "http://schema.org", "@type": "Recipe", "name": "Amazingly Sweet Slow-Roasted Tomatoes", "description": "These don’t look like they are going to taste as amazing as they do, and I know it might be asking a lot to have the oven on for 2 hours on a hot summer day. But it’s on low and the end result will be worth it.  Lean over the plate when you bite into the tomatoes, as the juice may squirt. You can eat these as a snack or a side dish, or put them through a food mill for an incredibly sweet sauce.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/07/24/science/26recipehealth/26recipehealth-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "Serves 4 as a snack, side dish or sauce.", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, summer, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 164}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 56, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "275 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["\n1 pound small plum tomatoes, halved lengthwise\n", "Coarse salt to taste", "A tiny amount of sugar", "1 tablespoon extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Put the halved tomatoes in a bowl and toss with the olive oil. Oil a rack that will fit on top of a baking sheet. Place foil on the baking sheet and oil the foil, and place the rack on top. Place the tomatoes, cut side up, on the rack. Sprinkle with coarse salt and a tiny amount of sugar. Place in the oven and roast for 2 hours. Remove from the heat and allow to cool for about 30 minutes. The tomatoes will look a little dry on the surfaces and the skin will be tough. But when you bite into the tomatoes you’ll experience a rush of incredibly sweet juice and pulp. If you want to use these for a sauce, put through the fine blade of a food mill."}]}