{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek Pumpkin and Leek Pie", "description": "This savory Greek pie, one of my favorites, makes a great vegetarian main dish for Thanksgiving. You can make the filling days before you assemble the pie; you can also make the whole pie ahead, wrap it well and freeze it. Like all winter squash, pumpkin is an excellent source of vitamin A, in the form of beta carotene, and a very good source of vitamin C, potassium, dietary fiber and manganese.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/11/23/science/22recipehealth/22recipehealth-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "Serves eight to 10", "recipeCuisine": "greek", "recipeCategory": "dinner, weekday", "keywords": "healthy, vegetarian, leek, phyllo, pumpkin, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 84}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 245, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "4 grams", "sodiumContent": "484 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 pounds pumpkin, cut into large chunks", "6 tablespoons extra virgin olive oil", "3 large leeks about 1 1/2 pounds, white and light green parts only, cleaned and chopped", "2 large garlic cloves, minced", "1/4 cup chopped fresh dill", "1/4 cup chopped fresh mint", "1/4 teaspoon freshly grated nutmeg", "1 cup crumbled feta cheese (about 4 ounces)", "3 large eggs, beaten", "Salt", "freshly ground pepper", "12 sheets phyllo dough"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Cover a baking sheet with foil. Place the pumpkin pieces on the baking sheet, drizzle 1 tablespoon of the olive oil on top and cover tightly with foil. Place in the oven, and roast for 1 1/2 hours or until thoroughly tender. Remove from the heat, transfer to a strainer or a colander set over a bowl or in the sink, and allow to cool and drain. Turn the oven down to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the cooled pumpkin, and place in a large bowl or in a food processor fitted with the steel blade. Purée coarsely or mash with a fork. Stir in the herbs, nutmeg and feta. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a large, heavy nonstick frying pan. Add the leeks. Cook, stirring, until tender and just beginning to color, five to 10 minutes. Add the garlic, and continue to cook until fragrant, 30 seconds to a minute. Remove from the heat, and add to the pumpkin. Beat the eggs, and stir into the pumpkin mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush a 10- or 12-inch tart pan or cake pan with olive oil and layer in seven sheets of phyllo dough. Place them not quite evenly atop one another, so that the edges overlap the sides of the pan all the way around. Brush each sheet with olive oil (or a mixture of olive oil and melted butter) before adding the next sheet. Fill with the pumpkin mixture, and fold the edges over. Brush the folded-over phyllo with olive oil, then layer five more sheets of dough over the top, brushing each with olive oil (or a combination of melted butter and olive oil). Crimp the edges into the sides of the pan. Pierce the top of the pie in several places with a sharp knife. Bake in a 375-degree oven for 40 to 50 minutes until the top is golden brown. Serve warm or at room temperature. Recrisp the crust if necessary in a low oven for 10 to 20 minutes."}], "link": "https://cooking.nytimes.com/recipes/1014220-greek-pumpkin-and-leek-pie"}