{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Chicken With Root Vegetables and Verjus Beurre Blanc", "description": "", "author": {"@type": "Person", "name": "Jennifer Steinhauer"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner, sauces and gravies", "keywords": "chicken breast, root vegetables, verjuice, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1019, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "81 grams", "fiberContent": "7 grams", "proteinContent": "42 grams", "saturatedFatContent": "42 grams", "sodiumContent": "1491 milligrams", "sugarContent": "20 grams", "transFatContent": "3 grams"}, "recipeIngredient": ["4 tablespoons unsalted butter", "16 small onions white pearl, red pearl, cippolini or a mixture, peeled", "2 teaspoons sugar", "Salt", "white pepper", "16 baby turnips, peeled, or 4 medium turnips, peeled, quartered and trimmed into spheres", "16 baby carrots, peeled", "4 boneless chicken breasts with skin", "Salt", "black pepper", "2 tablespoons olive oil", "1/4 cup Champagne vinegar", "1/2 cup diced shallots", "1 sprig thyme", "1 tablespoon sugar", "1/2 cup white verjus", "3/4 cup diced mushrooms", "1/2 cup strong chicken stock", "1 cup (2 sticks), plus 2 tablespoons, unsalted butter, chilled and diced", "Salt", "white pepper", "12 large seedless grapes, dipped quickly in boiling water and peeled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the vegetables: Place a medium sauté pan over medium heat, and melt 2 tablespoons butter. Add onions and toss until well coated. Add one teaspoon sugar, salt and pepper to taste and 1/4 cup water. Sauté until liquid has evaporated and onions are tender and golden brown on all sides, about 5 minutes. Transfer onions to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out pan and return to medium heat. Melt remaining butter. Add turnips, remaining sugar, salt and pepper to taste and 1/4 cup water. Toss until liquid has evaporated and turnips are lightly browned and beginning to become tender, about 5 minutes. Add carrots and continue to toss until carrots are lightly browned and turnips are golden brown on all sides, another 2 to 3 minutes. Transfer to plate of onions and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the chicken: Heat oven to 450 degrees. Season chicken breasts on both sides with salt and pepper. Place a large heavy oven-proof sauté pan or skillet over high heat until very hot. Add olive oil. Add chicken skin-side down, reduce heat to medium-high and cook without moving for 3 minutes. Transfer pan to oven and continue to cook, without turning breasts, until internal temperature of meat reaches 160 degrees, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the verjus beurre blanc: In a small saucepan, combine vinegar, shallots and thyme. Place over high heat and boil until reduced by half. Add sugar, verjus and mushrooms. Reduce heat to low and simmer until liquid has again been reduced by half. Pour through a fine-meshed strainer into a heat-proof bowl; discard solids. Return liquid to saucepan and place over very low heat. Add chicken stock. Whisk in one cup butter, a little at a time, being careful that sauce does not return to a boil. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish and serve: Place a large sauté pan over medium heat. Add remaining butter and 1/4 cup water. Add vegetables and stir until glazed and thoroughly heated, about 2 minutes. Add grapes and adjust salt and pepper to taste. Arrange vegetables and grapes in centers of 4 warmed dinner plates. Slice each breast into 3 pieces and arrange around vegetables. Spoon verjus sauce around plate."}], "link": "https://cooking.nytimes.com/recipes/1014074-roast-chicken-with-root-vegetables-and-verjus-beurre-blanc"}