{"@context": "http://schema.org", "@type": "Recipe", "name": "Rye Pecan Pie", "description": "To streamline operations in the pastry kitchen at Diner in Williamsburg, Brooklyn, the restaurant’s pastry chef, Avery Wittkamp, devised an enormous solution, which can be easily adopted by home cooks. She bakes this pie in a 10-inch springform pan, using a thicker, stretchable crust that can line the deep sides; it stays in place even when the pie is unmolded. Impressively, the tall bark-brown crust rises over a filling as wide, majestic and mahogany-brown as a redwood tree. She bakes the pie longer than usual to fully brown the crust, and gives it a higher crust-to-filling ratio than a traditional pie. She also deconstructs the traditional pecan pie filling into three strata: the custard, the chopped nuts and the whole nuts, each one delicious and distinct. (Don't be intimidated by homemade crust. Our <a href=\"http://cooking.nytimes.com/guides/how-to-make-pie-crust\">pie crust guide</a> will tell you everything you need to know.)", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/01/22/dining/recipes-ryepecanpie/recipes-ryepecanpie-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "dessert, fall, winter, pecans, rye whiskey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 212}, "recipeIngredient": ["2 1/2 cups all-purpose flour", "1 1/2 teaspoons kosher salt", "1 1/2 tablespoons granulated sugar", "1/2 pound cold unsalted butter, cut into dice", "1/2 cup ice water, more as needed", "About 5 cups dried beans (for baking)", "5 eggs", "1 1/4 cups light brown sugar", "6 tablespoons unsalted butter, melted", "1/3 cup molasses, dark or unsulfured", "1/3 cup light corn syrup", "2 teaspoons vanilla extract", "1/4 teaspoon kosher salt", "3 tablespoons rye or bourbon, not more than 90 proof", "2 cups finely chopped pecans", "2 1/2 cups pecan halves", "Whipped cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: In a mixer fitted with paddle attachment, combine flour, salt and white sugar at low speed. Add butter and mix until pea-size lumps form. Raise the speed to medium-low and add 1/2 cup ice water in a slow, steady stream, mixing just until dough holds together. To test, pinch a small amount of dough. If it is crumbly, add more ice water, one tablespoon at a time. Shape dough into a ball and wrap it loosely in plastic, then roll it into a disk. Refrigerate at least one hour, or up to 3 days, before rolling. (Dough can be frozen for up to a month.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open a 10-inch springform pan, flip the bottom over so the outside surface faces in, then close. This will make removing the pie easier when it is done, by preventing the dough from sinking into the pan’s crease. On a lightly floured surface, roll chilled dough into a circle 16 inches in diameter. Lift it and let it settle into pan, fitting the dough down into the edges. Press the sides firmly against pan and pinch around the top rim. Trim dough with kitchen scissors so it hangs over the rim by one inch, reserving excess. Refrigerate in pan until very cold and firm, at least 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Prick bottom of dough with a fork. Lay a piece of parchment or wax paper in pan, then a piece of aluminum foil. Fill foil lining with dried beans to top of pan. Bake 15 to 25 minutes, until the sides of the crust have set and turned a light golden brown. Remove from oven and lift out the beans, foil and parchment. Patch any holes with reserved dough, pressing firmly. Bake 10 to 15 minutes more, until golden brown. Let cool at least 30 minutes before filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the pie: Heat oven to 325 degrees. In a bowl, whisk together the eggs, brown sugar, melted butter, molasses, corn syrup, vanilla, salt and rye or bourbon. Place baked pie shell, still in the pan, on a sheet pan. Gently pour in the filling. Sprinkle chopped pecans evenly over surface. Working from outside in, arrange pecan halves in concentric circles, without overlapping, until entire surface is covered. (Use only as many as needed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 50 to 60 minutes, just until filling is firm and a wooden skewer comes out clean when inserted into center. (Do not worry if the overhanging crust becomes very dark brown.) Let cool completely. Use a serrated knife to saw off all overhanging pie crust. Carefully remove outer ring of pan. Slice with a large, very sharp knife and serve with whipped cream."}], "link": "https://cooking.nytimes.com/recipes/1014110-rye-pecan-pie"}