{"@context": "http://schema.org", "@type": "Recipe", "name": "Wok-Fried Mozzarella Sticks With Dipping Sauce", "description": "Mario Carbone and Rich Torrisi, of Torrisi Italian Specialties, created this recipe for the 2010 Feast of San Gennaro in New York’s Little Italy. “It’s a Neapolitan feast for the patron saint of Naples,” Mr. Carbone said, explaining the train of thought that led him to put these wok-fried mozzarella sticks on the menu. “In Naples, there’s a lot of street food. A lot of it is fried food.” In some of the better friggitorie — bars that specialize in fried foods — “they fry in what is essentially a wok,” he added. “The culinary advantage of frying like that is that it’s a shallow fry; a few uses, then discard it and refresh the oil in the pan — not like deep-frying in five gallons of oil that never gets changed.”", "author": {"@type": "Person", "name": "Peter Meehan"}, "image": null, "totalTime": "PT50M", "recipeYield": "About 4 servings", "recipeCuisine": "italian", "recipeCategory": "lunch, project", "keywords": "bread crumbs, cheese curd, tomato, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1068, "unsaturatedFatContent": "63 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "81 grams", "fiberContent": "4 grams", "proteinContent": "25 grams", "saturatedFatContent": "13 grams", "sodiumContent": "914 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound ripe tomatoes, peeled and cut into chunks", "2 teaspoons salt", "1/4 cup extra virgin olive oil", "Black pepper", "1 leafy sprig basil", "1 pound cheese curd (available at many cheese shops and Italian specialty stores)", "1 cup kosher salt", "1 cup flour", "2 eggs, beaten", "1 1/2 cups bread crumbs", "2 cups oil for frying, including about 1/2 cup olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the sauce", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pass tomatoes through the grater disc of a food processor. Stir in salt, olive oil, black pepper and basil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut cheese curd into very small pieces and place in shallow, wide heatproof dish a couple inches deep, like a roasting pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In large pot over high heat, bring 2 quarts water to 185 to 190 degrees. Stir in kosher salt, then pour over curds. Let curds sit, undisturbed, for a full minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press curds into corner of the pan with spoon or spatula and gently pack together. In three to four minutes, they will form a mass. The moment that happens, pour water from pan and knead cheese like bread dough until smooth and lump-free. (At this point, if not continuing with recipe, the cheese can be twisted into balls, plunged into cold water or milk to set the shape, and eaten as fresh mozzarella.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press cheese into a loaf pan and refrigerate for at least 15 minutes, to set it. Meanwhile, set up station to bread the mozzarella: a shallow dish of flour, a shallow dish of beaten eggs and a shallow dish of bread crumbs."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the mozzarella", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Move mozzarella to cutting board and trim into batons about 3 inches long and an inch thick. Roll in flour and then egg, flour and then egg again, and heap on the bread crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a wok on stove over high heat. At 375 degrees, use a slotted spoon to lower mozzarella sticks into oil one at a time. Fry for a minute or less — just until golden brown. Drain on rack; blot dry. Serve mozzarella sticks with sauce on the side."}]}], "link": "https://cooking.nytimes.com/recipes/1014087-wok-fried-mozzarella-sticks-with-dipping-sauce"}