{"@context": "http://schema.org", "@type": "Recipe", "name": "Hamantaschen With Poppy Seed Filling", "description": "Purim, which celebrates the biblical story of the Jews’ deliverance from a plot to kill them by Haman, minister to the Persian king, is a special time when people drink, dance and play jokes. Gifts of food called shalah manot are distributed, which include fruit, cookies and, of course, hamantaschen.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2016/02/17/dining/17COOKING-HAMANTASCHEN1/17COOKING-HAMANTASCHEN1-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "About 30 cookies", "recipeCuisine": "jewish", "recipeCategory": "cookies and bars", "keywords": "dessert, poppy seed, purim, raisins, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 144}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 163, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "5 grams", "sodiumContent": "14 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup confectioners’ sugar", "2 large egg yolks", "8 ounces unsalted butter at room temperature, in small pieces", "Grated zest of 1 lemon", "2 1/4 cups all-purpose unbleached flour", "Dash of salt", "1 large egg, beaten, for the glaze", "1 cup milk", "1/2 cup sugar", "Grated zest of 1/2 orange", "1 cup poppy seeds", "1/3 cup raisins", "Juice of 1/2 lemon", "1/2 tablespoon brandy", "1/2 tablespoon orange liqueur", "1/2 tablespoon butter", "1/2 tablespoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the confectioners’ sugar and the egg yolks in a food processor and blend. Add butter and lemon zest and process to blend. Gradually add the flour and the salt, pulsing until it forms a ball. Divide the dough in half, flatten each into a disk, wrap tightly in plastic wrap. Chill until firm, at least 1 hour or up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the filling: Put milk, sugar and orange zest in a saucepan over medium heat. Grind poppy seeds to a fine powder in coffee grinder, taking care not to over-process to a paste. When milk mixture is warm, turn heat to low and add poppy seeds and raisins. Cook at a low simmer stirring frequently until the seeds absorb the milk and the mixture is thick, about 15 minutes. Add the lemon juice, brandy, orange liqueur and butter. Stir and cook for 2 minutes more. Stir in the vanilla extract, remove from the heat and let cool completely, or chill until needed, up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Line 2 baking sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unwrap one of the chilled dough disks and place on a piece of parchment paper that has been dusted lightly with flour. Lightly dust the top of the dough with flour. Cover with a second piece of parchment paper. Let stand at room temperature until malleable, about 5 minutes. Use a rolling pin to press and roll out the dough into a 1/4-inch- thick round between the sheets of parchment, flipping the dough occasionally. Use a plain biscuit or cookie cutter or glass to cut 3-inch circles, placing the circles on the prepared baking sheet spaced 1 inch apart. Place the baking sheet in the refrigerator to chill until firm while you repeat the rolling/cutting process with the second round of dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the first pan of dough rounds from the refrigerator. Place a heaping teaspoon of the filling in the center of each, and press up the sides to form triangles, pinching the ends closed. If the dough is too firm, let stand a minute or two to soften; returning the baking sheet to the refrigerator if the dough becomes too soft. Repeat with the remaining dough rounds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the tops with beaten egg. Bake until golden and dough is delicately firm all the way through, about 13-18 minutes, rotating the racks front to back and top to bottom after about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place trays on wire racks for 10 minutes before transferring cookies on parchment to racks to cool completely."}], "link": "https://cooking.nytimes.com/recipes/1014146-hamantaschen-with-poppy-seed-filling"}