{"@context": "http://schema.org", "@type": "Recipe", "name": "Quintessential Chocolate Chip Cookies", "description": "Sherry Yard's iconic chocolate-chip cookies are just the right mix of chewy and crisp, with a bittersweet morsel of chocolate in each bite. They are the cookies anyone who asks you to make chocolate chip cookies are asking for -- the kind of chocolate cookie that demands to be dunked into a glass of ice-cold milk.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/06/19/dining/19PASTRY1_SPAN/19PASTRY1_SPAN-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "About 4 dozen cookies", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, bittersweet chocolate, sugar, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 2039}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 70, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "2 grams", "sodiumContent": "28 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["185 grams all-purpose flour (1 1/2 cups)", "2 grams baking soda (1/2 teaspoon)", "115 grams butter (4 ounces/1 stick)", "100 grams sugar (1/2 cup)", "80 grams light brown sugar (1/2 cup packed)", "2 grams salt (1/4 teaspoon)", "1 egg", "5 grams vanilla (1 teaspoon)", "225 grams bittersweet chocolate (8 ounces), cut in 1-inch pieces (or use coins)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together flour and baking soda and set aside. In the bowl of a standing electric mixer fitted with the paddle attachment, cream butter until lemony yellow, about 2 minutes. Scrape down sides of bowl and paddle. Add sugar, brown sugar and salt. Continue creaming mixture on medium speed until it is smooth and lump free, about 1 minute. Stop mixer and scrape down sides of bowl and paddle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add egg and vanilla and beat on low speed for 15 seconds, or until they are fully incorporated. Do not over-beat. Scrape down sides of bowl and paddle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On low speed, add sifted flour mixture. Beat slowly until all of the flour is incorporated. Scrape down sides of bowl. Add chocolate chunks and mix in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees with the rack positioned in the lower third of the oven. Line 2 baking sheets with parchment. Spoon heaping teaspoons of dough 2 inches apart onto baking sheets. If not baking right away, remove small handfuls or spoonfuls of dough from mixer and plop them down on the middle of a sheet of parchment or wax paper, creating a log about 1 1/2 inches wide and 12 inches long. Fold parchment over, creating a sausage. Chill for at least 1 hour, preferably overnight. Using a serrated knife, slice chilled dough into 1/3-inch-thick rounds and place them 2 inches apart, in staggered rows, on parchment-lined sheets and proceed. (Dough will keep nicely, tightly wrapped, in the refrigerator for 1 week, or in the freezer for up to 1 month. Thaw frozen dough at room temperature for 30 minutes before slicing.)\n\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake one sheet at a time for 12 to 15 minutes, until lightly browned, rotating the baking sheet front to back halfway through. Remove from heat and slide parchment off baking sheet and onto a work surface. Allow cookies to cool for at least 5 minutes before serving, or for at least 20 minutes before storing in an airtight container. They will keep for up to 3 days at room temperature."}]}