{"@context": "http://schema.org", "@type": "Recipe", "name": "Soft Tacos With Roasted or Grilled Tomatoes and Squash", "description": "If you’ve got the grill fired up you can cook the vegetables in a grill pan. Otherwise roast the tomatoes under the broiler and cook the filling on top of the stove.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/07/24/science/24recipehealth/24recipehealth-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "Enough for 10 tacos", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch", "keywords": "corn tortillas, summer squash, tomato, gluten-free, halal, healthy, kosher, low cholesterol, low-sodium, nut-free, vegetarian, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 142, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "403 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 pound tomatoes", "2 tablespoons extra virgin olive oil", "1/2 medium onion, chopped (about 1 cup chopped)", "2 large garlic cloves, minced", "2 serrano chiles or 1 large jalapeño, minced", "1 1/2 pounds summer squash, cut in 1/4-inch dice", "Salt and freshly ground pepper", "1 cup cooked black beans, rinsed if using canned", "2 to 3 tablespoons chopped cilantro", "10 corn tortillas", "2 to 3 ounces goat cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler. Line a baking sheet with foil and place the tomatoes on the foil. Place under the broiler, about 2 inches from the heat, and broil until charred black. Turn over and broil on the other side until charred black. This takes about 3 minutes on each side in my oven but all broilers/ovens are different. Remove from the heat and allow to cool until you can handle them, then remove the skins, core and cut in half along the equator. Set a strainer over a bowl and squeeze out the seeds (make sure they have cooled before you do this!), then rub the gelatinous pulp that surrounds the seeds through the strainer. Chop the tomatoes and combine with the juice in the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large, heavy skillet over medium heat and add the onion. Cook, stirring often, until tender, about 5 minutes, and add the garlic, chiles, summer squash, and a generous pinch of salt. Turn the heat to medium-high and cook, stirring often, for about 5 minutes, until the squash is tender. Add the chopped tomatoes and their juices and cook, stirring often, until the tomatoes have cooked down and the mixture is fragrant, 5 to 10 more minutes. Add more salt to taste, and freshly ground pepper. Stir in the black beans, add the cilantro, taste, adjust seasonings, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pile onto warm corn tortillas, sprinkle on a little goat cheese, fold the tortillas over and serve."}], "link": "https://cooking.nytimes.com/recipes/1014906-soft-tacos-with-roasted-or-grilled-tomatoes-and-squash"}