{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Empanadas", "description": "Many cultures have put a spin on the empanada. This recipe descends from the Argentine way of making these little meat pies. The Argentine empanada is small, just two or three delicious bites. The technique to master in this recipe is holding the open empanada with one hand and using the other hand to crimp the outer edge and for a decorative braid. The less dexterous among us should use a fork for this.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/07/03/dining/03KITCH_2/03KITCH_2-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "36 empanadas", "recipeCuisine": "spanish", "recipeCategory": "dinner, lunch", "keywords": "beef, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 673}, "recipeIngredient": ["4 ounces lard or butter, plus more for brushing tops", "1 1/2 teaspoons fine sea salt", "750 grams all-purpose flour, about 6 cups, more as needed", "1 pound beef chuck, in 1/8-inch dice (or very coarsely ground)\n", "Salt and pepper", "Lard or olive oil, or a combination, for sautéing", "1 cup diced onion", "2 ounces diced chorizo", "1/2 pound potatoes, peeled and diced", "4 garlic cloves, mashed to a paste", "2 teaspoons chopped thyme", "2 teaspoons chopped marjoram or 1 teaspoon oregano", "1 tablespoon tomato paste", "1 tablespoon pimentón dulce or paprika\n\n", "Large pinch cayenne", "Beef or chicken broth, as necessary, or use water", "1/2 cup chopped scallions, white and green parts", "1/4 cup chopped pitted green olives", "2 hard-cooked eggs, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Put 2 cups boiling water, 4 ounces lard and 1 1/2 teaspoons salt in large mixing bowl. Stir to melt lard and dissolve salt. Cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gradually stir in flour with a wooden spoon until dough comes together. Knead for a minute or two on a floured board, until firm and smooth. Add more flour if sticky. Wrap and refrigerate for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Season chopped beef generously with salt and pepper and set aside for 10 minutes. Melt 3 tablespoons lard in a wide heavy skillet over medium-high heat. Add beef and fry until nicely browned, stirring throughout to keep pieces separate, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat down to medium and add onion and chorizo. Keep turning mixture with a spatula, as if cooking hash, until onion is softened and browned, about 10 minutes. Add potatoes, garlic, thyme and marjoram and stir well to incorporate. (Add a little more fat to pan if mixture seems dry.) Season again with salt and pepper and let mixture fry for 2 more minutes. Stir in tomato paste, pimentón and cayenne, then a cup of broth or water. Turn heat to simmer, stirring well to incorporate any caramelized bits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook for about 10 more minutes, until both meat and potatoes are tender and the sauce just coats them — juicy but not saucy is what you want. Taste and adjust seasoning for full flavor (intensity will diminish upon cooling). Stir in scallions and cool to room temperature, then cover and refrigerate until ready to use. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide chilled dough into 1-ounce pieces and form into 2-inch diameter balls. Roll each piece into a 4 1/2-inch circle. Lay circles on a baking sheet lightly dusted with flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Moisten outer edge of each round with water. Put about 2 tablespoons filling in the center of each round, adding a little chopped green olive and some hard-cooked egg to each. Wrap dough around filling to form empanada, pressing edges together. Fold edge back and finish by pinching little pleats or crimping with a fork. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Place empanadas on parchment-lined or oiled baking sheet, about 1 inch apart. Brush tops lightly with lard or butter and bake on top shelf of oven until golden, 10 to 15 minutes. Serve warm."}], "link": "https://cooking.nytimes.com/recipes/1014844-beef-empanadas"}