{"@context": "http://schema.org", "@type": "Recipe", "name": "Broiled Fish With Chermoula", "description": "In Morocco, <a href=\"http://cooking.nytimes.com/recipes/1012763-chermoula\">chermoula</a> is traditionally used as a marinade for grilled fish. You’ve used the Moroccan herb and spice blend, chermoula  in all sorts of dishes, but not the way it is traditionally used in Morocco, as a marinade and sauce for fish (usually grilled). When you make the chermoula, you can do it as the recipe instructs, in a food processor, or as the Moroccans do, finely chopping all of the herbs. You can also use a mortar and pestle. If you want to you can thin it out with more oil or lemon juice. If the sauce is thick, you can just spread it over the fish with a spatula, like a rub, and let the fish marinate. It is unbelievably delicious and easy. This recipe is for fillets, but you can also use the marinade with a whole fish. I like to use the broiler for this because the juices accumulate on the foil-lined baking sheet and they are delicious poured over the fish. But grilling is traditional.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/04/04/science/05recipehealth/05recipehealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 4", "recipeCuisine": "moroccan", "recipeCategory": "dinner, weekday", "keywords": "chermoula, white fish, dairy-free, gluten-free, halal, healthy, kosher, low-carb, low sugar, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 103}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 163, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "1 gram", "proteinContent": "14 grams", "saturatedFatContent": "2 grams", "sodiumContent": "333 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 to 2 pounds firm white fish fillets, such as halibut, mahi mahi, striped bass", "Salt and freshly ground pepper", "1 recipe chermoula (<a href=\"http://cooking.nytimes.com/recipes/1012763-chermoula\">see recipe</a>)", "Additional lemon juice and wedges or olive oil to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the fish with salt and pepper. In a large baking dish combine the fish with half the chermoula and toss together until the fish is coated. If the chermoula is thick it may be easier to spread it onto the fish with a spatula. Refrigerate for 15 to 30 minutes while you preheat the broiler or prepare a grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a broiler, line a sheet pan with foil and brush the foil with olive oil, or oil a shallow baking dish. Place the fish in the pan in a single layer. If desired drizzle on a little more olive oil or lemon juice. Place under the broiler, close to the heat (about 2 1/2 inches below) and broil 5 minutes. Check the fish; the timing depends on how thick the fillets are; figure on 4 to 5 minutes per 1/2 inch of thickness. It is done when it is opaque and you can pull it apart with a fork. Using a spatula, transfer the fish from the sheet pan or baking dish to a platter or to individual plates. Tip the juices in the pan over the fish fillets. Pass the remaining chermoula and lemon wedges at the table."}], "link": "https://cooking.nytimes.com/recipes/1014644-broiled-fish-with-chermoula"}