{"@context": "http://schema.org", "@type": "Recipe", "name": "Indoor-Smoked Salt-and-Pepper Beef Ribs", "description": "", "author": {"@type": "Person", "name": "Jill Santopietro"}, "image": "https://static01.nyt.com/images/2014/04/07/dining/Beef-Ribs/Beef-Ribs-mediumThreeByTwo440.jpg", "totalTime": "PT7H30M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 18}, "recipeIngredient": ["2 racks beef ribs, 5 to 7 pounds total (see Note 1)", "3 tablespoons kosher salt", "2 tablespoons freshly cracked black pepper", "2 tablespoons brown sugar", "1 tablespoon paprika", "Red pepper flakes, to taste", "1/4 cup finely ground hickory chips, preferably Cameron (see Note 2)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the ribs meat-side down on a baking sheet or cutting board and remove the papery membrane from the back of the rack by inserting a small knife beneath it and levering it. Peel off the membrane and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the salt, pepper, brown sugar, paprika and a pinch of red pepper flakes to taste, breaking up the brown sugar with a fork. Using your hands, cover the meat entirely in this rub."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a stovetop smoker on a burner. (Alternately, you can make one by lining the inside of a large wok with wide, heavy foil.) Place the wood chips on the bottom of the smoker, toward the center. Cover with the drip pan. Set the grate over the drip pan. (If using a homemade wok smoker, place the wood chips on the bottom of the foil-lined wok. Make a drip pan by placing a heavy piece of foil over both the chips and the bottom of the wok, but do not let it rise up the sides. Set a small, round baking rack, about 9 inches in diameter, over the drip pan.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut each rib rack in half. Place two rib pieces, meat-side down, on the baking rack, then set a second baking rack - about 11 inches in diameter, if using a wok - over the ribs and place the remaining two rib pieces, meat-side-down, on top. Cover tightly with foil, making sure there is at least 1 inch of space between the foil lid and the ribs. Set the heat to high. When smoke appears, lower the heat to medium-high and smoke for as long as you can stand the smoke, no more than 2 hours. (The tighter the lid, the less smoke will be released.) Transfer the wok outdoors before removing the lid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 200 degrees. Set the rib racks on a rimmed baking sheet. Place in the oven and cook for 5 hours. The meat will darken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut into individual portions. Serve with napkins and, if you choose, barbecue sauce."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Kitchen 4B: Smoked Ribs at Home", "description": "Jill Santopietro, cook and recipe tester for the New York Times Magazine, creates a smoker out of a wok in her tiny New York City kitchen.", "thumbnailUrl": "https://static01.nyt.com/images/2014/04/07/dining/Beef-Ribs/Beef-Ribs-mediumThreeByTwo440.jpg", "uploadDate": "2009-05-21T19:51:43.000Z", "duration": "PT7M43S"}, "link": "https://cooking.nytimes.com/recipes/1014236-indoor-smoked-salt-and-pepper-beef-ribs"}