{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Wok-Popped Popcorn", "description": "My mother always used the wok for making popcorn. It is the perfect pan for it. An added bonus is that making popcorn adds more patina to your wok, and a well-seasoned wok is the healthiest type of nonstick cookware there is. I have played around with all sorts of seasonings for popcorn; my favorite is the Tunisian mix called tabil, minus the dried garlic. See the recipe below for the mix, which I make up by the jar and keep in my freezer. To help with cleanup, line the lid of your wok with aluminum foil.  ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/12/17/health/17recipehealth/17recipehealth-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "About 12 cups popcorn", "recipeCuisine": "", "recipeCategory": "easy, quick", "keywords": "appetizer, dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-fat, low-sodium, low sugar, nut-free, vegan, vegetarian, popcorn, spices, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 14}, "recipeIngredient": ["2 tablespoons oil – either canola, rice bran, peanut, grape seed, or olive", "6 tablespoons popcorn", "2 teaspoons tabil (see below; more to taste)", "Kosher salt to taste", "2 large garlic cloves, chopped and left out on a piece of paper towel to dry air for 2 days, or 2 teaspoons garlic powder or granulated garlic", "4 tablespoons coriander seeds", "1 tablespoon caraway seeds", "2 teaspoons cayenne"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the oil and a few kernels of the popcorn in a 14-inch lidded wok, cover and place over medium heat. When you hear a kernel pop, quickly lift the lid and pour in all of the popcorn. Cover, turn the heat to medium-low, and cook, shaking the wok constantly, until you no longer hear the kernels popping against the lid. Remove from the heat, transfer to a bowl, immediately add seasonings and toss together."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Tabil", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mortar or spice mill, grind the ingredients together until homogenous. Store in the refrigerator or freezer."}]}], "link": "https://cooking.nytimes.com/recipes/1014412-spiced-wok-popped-popcorn"}