{"@context": "http://schema.org", "@type": "Recipe", "name": "Baron Bagels", "description": "Dan Graf, a genetics major who dropped out of Rutgers, founded Baron Baking in Oakland, Calif., after working in a delicatessen. The son of a Bergen County, N.J., contractor, he grew up accompanying his father to jobs on weekends. Stopping for bagels was part of the ritual. After moving to California, he worked for two years at Saul’s Restaurant and Delicatessen in Berkeley, where he became fascinated with baking. He began baking bagels in his apartment and eventually won an account with his former employer. There are all kinds of bagels; Mr. Graf’s has a chewy bite and an almost pretzel-like crust. This is his recipe.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2016/08/16/dining/baron-bagels/baron-bagels-articleLarge.jpg", "totalTime": "P1DT1H", "recipeYield": "10 bagels", "recipeCuisine": "", "recipeCategory": "breads, project", "keywords": "appetizer, bread flour, yeast, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 291}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 218, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "0 grams", "sodiumContent": "1096 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 teaspoon/3 grams active dry yeast", "5 cups/600 grams bread flour", "3 tablespoons/54 grams sea salt, divided", "1 tablespoon/8 grams diastatic malt powder", "2 tablespoons/40 grams baking soda", "1/4 cup poppy seeds, optional", "1/4 cup sesame seeds, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the yeast in the bowl of a standing mixer. Add 1 2/3 cups/ 365 grams lukewarm water and allow the yeast to activate, about 5 \nminutes. Add flour, 1 tablespoon/18 grams salt and malt powder and mix at low speed for 5 minutes using the dough hook. Cover the dough and allow to rise at room temperature for about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch the dough down and shape into a rough rectangle about 1 to 1 1/2 inches thick, and about 2 times longer than it is wide. If you are having trouble forming the dough, stretch it, wait for the gluten to relax and re-form."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the dough into 10 pieces of about 3 ounces each. Roll each into an 8-inch-long snakelike shape, tapering the dough at each end. Circle the dough around your hand, pinching the ends together and rolling under your palm once or twice to seal. Put the bagels on a Silpat or other nonstick baking sheet on top of a jellyroll pan. Cover well with plastic wrap and refrigerate for about 10 hours, or up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. If you have a baking stone or brick you use for baking, put it on a rack near the bottom of the oven; \nit will retain heat and produce a crisper bagel. Bring a large pot of water to boil, add the remaining salt and the baking soda into the boiling water and remove the bagels from the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully place just enough bagels into the pot to cover the surface of the water, making sure that there are no bagels resting on top of one another. Let them float on 1 side for 1 minute before flipping them to the other side for another minute or so. Remove the bagels and drain well on a cooling rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour poppy or sesame seeds into a bowl wider than the bagels. Working very quickly, remove the bagels one by one and dip them \ninto the topping. Place them back on the Silpat-covered baking sheet, topping side down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake on the second to highest shelf of the oven for 8 to 10 minutes. Then flip the bagels, rotate the pan and continue baking for about 8 minutes, or until they are golden brown."}], "link": "https://cooking.nytimes.com/recipes/1014445-baron-bagels"}