{"@context": "http://schema.org", "@type": "Recipe", "name": "Cellophane Noodle Salad With Cabbage", "description": "This incredibly refreshing salad is loosely based on a recipe for a Thai cellophane noodle salad in Jeffrey Alford and Naomi Duguid’s “Hot, Sour, Salty, Sweet.” The authentic recipe includes more garlic and chiles as well as dried shrimp. Make sure to cut up the noodles before you try to toss them with the other ingredients.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/08/09/science/14recipehealth/14recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": " Serves 4\n", "recipeCuisine": "asian", "recipeCategory": "easy, quick, salads and dressings", "keywords": "cellophane noodles, green cabbage, dairy-free, gluten-free, halal, healthy, kosher, low-sodium, low sugar, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 62}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 325, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "431 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 small green cabbage, finely shredded (about 4 cups)\n", "4 ounces cellophane noodles, soaked for 20 minutes in warm water\n", "1/4 cup chopped roasted peanuts (more to taste)\n", "1 cup chopped cilantro\n", "2 eggs\n", "Salt to taste\n", "2 teaspoons sunflower oil or peanut oil\n", "1 to 3 serrano or Thai chiles, minced (to taste)", "3 tablespoons sunflower oil or peanut oil\n", "2 large garlic cloves, finely minced or pureed\n", "2 tablespoons minced ginger\n", "1/2 teaspoon red pepper flakes\n", "3 tablespoons seasoned rice vinegar\n", "1 tablespoon fresh lime juice\n", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cabbage in a bowl and cover with ice water. Set aside while you prepare the remaining ingredients.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of water to a boil. Salt if desired. Drain the noodles and add to the pot. Boil for 1 1/2 minutes, drain, rinse briefly with cold water and drain thoroughly. Using a scissors, chop coarsely and transfer to a bowl. Drain the cabbage and add to the bowl, along with the peanuts, cilantro and chile(s). Toss together.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat one of the eggs in a bowl and season with salt to taste. Heat 1 teaspoon of the sunflower oil in an 8-inch nonstick skillet over high heat, or in a wok, and add the egg. Swirl the pan and let the egg spread out in a thin pancake. Lift the edges of the pancake to let egg run underneath. It should cook through quickly. Flip over and cook for a few seconds on the other side, then remove from the heat. Repeat with the other egg. Roll up the pancakes and cut in thin strips. Add half the egg shreds to the noodles and set the other half aside.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the garlic, ginger and a generous pinch of salt in a mortar and pestle and pound to a coarse paste. Heat 1 tablespoon of the sunflower oil over medium heat in the same skillet or wok in which you cooked the eggs and add the paste and the red pepper flakes. Cook, stirring, until fragrant, about 1 minute. Transfer to a bowl. Allow to cool slightly. Add the rice vinegar, the lime juice and the remaining 2 tablespoons of sunflower oil and whisk together. Taste and add salt. It should be somewhat salty. Toss with the noodle mixture. Transfer to a platter or a wide bowl, sprinkle the remaining egg shreds over the top, and serve.\n"}], "link": "https://cooking.nytimes.com/recipes/1014963-cellophane-noodle-salad-with-cabbage"}