{"@context": "http://schema.org", "@type": "Recipe", "name": "Celeriac, Potato, Leek and Apple Soup", "description": "A sweet and savory mixture that works well as a soup. \nI’ve always loved the combination of celeriac, potatoes and apples, which I first tasted in France as a celeriac, potato and apple purée. The sweet and savory mixture works very nicely as a soup. I like to strain this soup after I purée it to get a velvety texture. \n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/11/19/science/21recipehealth/21recipehealth-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "16 to 18 demitasse servings or 8 bowls", "recipeCuisine": "french", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "appetizer, main course, dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-fat, vegan, vegetarian, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 128}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 174, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1681 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 medium onion, chopped", "2 leeks, white and light green part only, halved lengthwise, cleaned and sliced or chopped", "Salt to taste", "2 pounds celeriac, peeled and diced (retain tops for bouquet garni and garnish)", "1 large russet potato (about 3/4 pound), peeled and diced", "2 granny smith or braeburn apples, cored, peeled and diced", "2 quarts water, chicken stock, or vegetable stock", "A bouquet garni made with a bay leaf and a couple of sprigs each thyme and parsley, and a stem or two of the celery from the celery root, if still attached", "Freshly ground pepper to taste", "Slivered celery leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large, heavy soup pot over medium heat and add the onion, leeks and a pinch of salt. Cook, stirring, until tender, about 5 minutes. Add the celeriac and a generous pinch of salt, cover partially and cook for another 5 minutes, stirring often, until the celeriac has begun to soften. Add the potatoes, apples, water or stock, salt to taste, and the bouquet garni. Bring to a boil, reduce the heat, cover and simmer 1 hour, or until the vegetables are very tender and the soup is fragrant. Remove and discard the bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend the soup in batches in a blender (cover the top with a towel and hold it down to avoid hot splashes), or through a food mill fitted with the fine blade. The soup should be very smooth. Strain if desired. Return to the pot. Stir and taste. Adjust salt, add freshly ground pepper, and heat through. Serve in small bowls or espresso cups, garnished with thin slivers of celery leaves."}], "link": "https://cooking.nytimes.com/recipes/1015711-celeriac-potato-leek-and-apple-soup"}