{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Wheat Penne or Fusilli With Tomatoes, Shell Beans and Feta", "description": "Shell beans and tomatoes are still available at the end of September in farmers’ markets, and I’ll continue to make pasta with uncooked tomatoes until there are no sweet tomatoes to be found. Shell beans are a rare treat, soft and velvety, to be savored during their short season.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/10/01/science/03recipehealth/03recipehealth-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, lunch, pastas", "keywords": "fall, summer, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course, pasta, shell beans, tomato", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 646, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "109 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "8 grams", "proteinContent": "28 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1947 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 1/4 pounds ripe tomatoes, peeled and chopped (see note)", "Freshly ground pepper to taste", "2 to 3 tablespoons olive oil (to taste)", "2 tablespoons slivered fresh mint or basil", "1 pound shell beans (in the pod), like scarlet runners, borlotti, cannellini or other heirlooms available at your farmers’ market (about 1 3/4 cups)", "1 small onion, halved", "7 cups water", "3 large garlic cloves, 2 crushed, 1 minced", "A bouquet garni made with a few sprigs each parsley and thyme, a Parmesan rind, and a bay leaf", "Salt to taste", "1 pound whole wheat penne, rigatoni or fusilli", "2 ounces feta, crumbled (1/2 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pasta bowl, toss together the tomatoes, minced garlic, salt, pepper, olive oil, and mint or basil. Allow to sit at room temperature for 30 minutes to an hour. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile shell the beans and combine with the onion, water, the crushed garlic cloves, bouquet garni and salt to taste in a heavy saucepan or soup pot. Bring to a boil, reduce the heat, cover and simmer 45 minutes, or until the beans are tender. Taste and adjust salt. Remove and discard the onion, the bouquet garni and the garlic cloves. Drain though a colander set over a bowl. Stir the beans into the tomato mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil, salt generously and add the pasta. Cook al dente, drain and toss with the tomatoes and beans. If desired add about 1/4 cup of the bean broth. Add the feta cheese, toss again and serve at once."}]}