{"@context": "http://schema.org", "@type": "Recipe", "name": "Broiled Teriyaki Tofu with Bitter Greens, Chili, and Scallion Oil", "description": "", "author": {"@type": "Person", "name": "Keith Dixon"}, "image": null, "totalTime": "PT50M", "recipeYield": "2 dinners and 2 lunches the next day", "recipeCuisine": "asian", "recipeCategory": "dinner, lunch", "keywords": "main course, tofu", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "recipeIngredient": ["1 pound very firm tofu sliced into 4 large pieces", "4 tablespoons teriyaki sauce", "1/4 cup vegetable oil", "1 thumb-sized piece of ginger, peeled and halved", "3 scallions, white and green parts, sliced", "2 garlic cloves, peeled and smashed", "2 handfuls of broccolini or broccoli rabe", "1 3/4 cup chicken stock", "1 tablespoon soy sauce", "1 tablespoon sesame oil", "1 pinch red pepper flakes", "1/2 medium onion, diced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler and place a rack as close as possible to the flame. Put the tofu pieces on a plate and rub with all over with the teriyaki sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vegetable oil, one of the pieces of ginger, half the scallions and the garlic cloves to a small saucepan. Heat to a lively simmer, then turn off the heat and allow the oil to steep for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to boil. Add 2 tablespoons salt, then add the broccoli, blanch for 2 minutes, then drain well and shock under cold running water to stop the cooking. Chop into 1-inch lengths and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the chicken stock in a small saucepan over medium heat—add the remaining piece of ginger, the soy sauce and half the sesame oil, and simmer on very low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tofu pieces in an ovenproof skillet or on a baking sheet and broil, turning once, until beginning to caramelize all over, about 4 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the tofu is broiling, pick the piece of ginger out of the scallion oil and discard. Heat ½ of the scallion oil in a large saucepan over high heat. Add the chopped broccoli, the red pepper, the onion and the remaining sesame oil and sauté until warmed through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a mound of the broccoli in the center of a bowl. Place a piece of broiled tofu over the greens. Ladle some chicken stock around the greens, then add a few spoonfuls of the scallion oil. Repeat with a second bowl, top both bowls with the remaining scallions, and serve."}]}