{"@context": "http://schema.org", "@type": "Recipe", "name": "Gluten-Free Raisin Pistachio Biscotti", "description": "I use a mix of almond flour and either millet flour or cornmeal for these. They are irresistible. If you soak the raisins in amaretto before you make the biscotti there will be a slightly bitter edge to the flavor. As in other whole grain biscotti I use some butter here, which makes for a more delicate cookie, requiring a slightly thicker slice than a wheat flour cookie.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/11/05/science/06recipehealth/06recipehealth-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "3 1/2 to 4 dozen biscotti", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "dessert, fall, spring, summer, winter, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 68}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 79, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "31 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["120 grams (approximately 2/3 cup) golden raisins", "125 grams (approximately 1 cup) millet meal or fine cornmeal", "60 grams (approximately 1/2 cup) cornstarch", "150 grams (approximately 1 1/4 cups) almond flour", "10 grams (approximately 2 teaspoons) baking powder", "1 gram (approximately 1/4 teaspoon) salt", "55 grams (2 ounces) butter, at room temperature", "125 grams (approximately 2/3 cup, tightly packed) organic brown sugar", "110 grams eggs (2 large)", "5 grams (1 teaspoon) vanilla extract", "2 grams (1/2 teaspoon) almond extract", "100 grams (approximately 3/4 cup) chopped lightly toasted pistachios"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the raisins in a bowl and cover with warm water (or see variation below). Let sit for 10 minutes, then drain and set the raisins on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Line a baking sheet with parchment. In a medium bowl, mix together the millet flour or cornmeal, cornstarch, almond flour, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer cream the butter and sugar for 2 minutes on medium speed. Scrape down the sides of the bowl and the beater with a rubber spatula and add the eggs, vanilla extract and almond extract. Beat together for 1 to 2 minutes, until well blended. Scrape down the sides of the bowl and the beater. Add the flour mixture and beat at low speed until well blended. Add the pistachios and raisins and beat at low speed until mixed evenly through the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough and shape into 2 wide, flat logs, about 10 inches long by 3 inches wide by 3/4 inch high. Make sure they are at least 2 inches apart on the baking sheet. Place in the oven on the middle rack and bake 50 minutes, until dry, beginning to crack in the middle, and firm. Remove from the oven and allow to cool for 30 minutes or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the logs on a cutting board and carefully cut into 1/2-inch thick slices. Place on two parchment-covered baking sheets and bake one sheet at a time in the middle of the oven for 10 minutes. Turn over and bake for another 10 to 15 minutes, until the slices are dry and lightly browned. "}], "link": "https://cooking.nytimes.com/recipes/1015351-gluten-free-raisin-pistachio-biscotti"}