{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkish Pumpkin Soup", "description": "This is an intriguingly sweet winter squash soup, based on a recipe by Ghillie Basan from her wonderful book, “Classic Turkish Cooking.” The sweetness comes from the squash itself and the allspice and cinnamon, with the addition of only a teaspoon of honey or sugar. The sour and spicy yogurt and chile garnish make a great flavor contrast. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/01/14/science/17recipehealth/17recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4 to 6", "recipeCuisine": "turkish", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "appetizer, main course, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 110}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 241, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "10 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1021 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 large onion, chopped", "1 large leek, white and light green part only, thinly sliced", "2 to 4 garlic cloves (to taste), minced", "Salt to taste", "1 teaspoon ground allspice", "1 teaspoon ground cinnamon", "2 pounds peeled, seeded butternut or kabocha squash, diced (about 6 cups)", "6 cups chicken stock, vegetable stock or water", "3 tablespoons rice", "1 teaspoon honey or sugar", "Freshly ground pepper to taste", "1/2 cup Greek style yogurt", "Aleppo pepper, Turkish red pepper or mild chili powder for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy soup pot or Dutch oven and add the onion and the sliced leek. Cook, stirring, until tender, about 5 minutes. Do not brown. Add a generous pinch of salt and the garlic and cook, stirring, until the garlic smells fragrant, 30 seconds to 1 minute. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the squash, allspice, cinnamon, stock or water, rice, honey or sugar, and salt, and bring to a boil. Reduce the heat, cover and simmer 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a hand blender, or in batches in a regular blender, purée the soup. If using a regular blender fill only half way and cover the top with a towel pulled down tight, rather than airtight with the lid, because hot soup will jump and push the top off if the blender is closed airtight. Return to the pot and heat through, stirring. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the soup into serving bowls. Swirl a tablespoon or two of yogurt into each bowl and sprinkle with Aleppo pepper, Turkish red pepper or chili powder."}]}