{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Pumpkin Tiramisu", "description": "These pretty little pumpkin parfaits are the work of Chloe Coscarelli, the vegan cookbook author. Pumpkin custard and vanilla cake crumbles are soaked in espresso and amaretto, then layered in individual cups (as seen above) or in one large trifle dish. In a rush? Use vegan cake mix like some of our readers do.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2011/10/17/health/well_veggie_tiramisu/well_veggie_tiramisu-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "1 (8-inch) trifle or 6 to 8 mini-trifles", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, kosher, nut-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 47}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1184, "unsaturatedFatContent": "37 grams", "carbohydrateContent": "171 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "7 grams", "proteinContent": "9 grams", "saturatedFatContent": "16 grams", "sodiumContent": "922 milligrams", "sugarContent": "113 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/3 cup cornstarch or arrowroot", "1/4 cup water", "3/4 cup canned coconut milk, mixed well before measuring", "1 (15-ounce) can pumpkin purée", "3/4 cup maple syrup", "2 teaspoons pumpkin pie spice", "1/2 teaspoon salt", "3 cups all-purpose flour (or gluten-free all-purpose flour plus 1 1/2 teaspoons xanthan gum)", "2 cups sugar", "2 teaspoons baking soda", "1 teaspoon salt", "1 3/4 cups soy, almond or rice milk", "1 cup canola oil", "1/4 cup white or apple cider vinegar", "1 tablespoon pure vanilla or almond extract", "1/2 cup amaretto", "1/4 cup water", "3 tablespoons instant espresso", "12 ounces semisweet chocolate chips (dairy-free), ground in a food processor or finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the Pumpkin Crème: In a small bowl, thoroughly mix cornstarch and water with a whisk or fork and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, whisk together coconut milk, pumpkin purée, maple syrup, pumpkin pie spice and salt, and heat over medium heat until it just begins to boil, about 5 minutes. Slowly drizzle cornstarch mixture into the saucepan, whisking continuously. Cook until the mixture becomes very thick, about 5 minutes, whisking frequently. Pour the crème into a bowl and let cool about 15 minutes. Cover the bowl with plastic wrap so that the plastic wrap is touching the top of the crème. Refrigerate for a few hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the Vanilla Cake: Preheat oven to 350 degrees. Lightly grease three 8- or 9-inch round cake pans or one 9-by-13-inch pan and line the bottoms with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together flour, sugar, baking soda and salt. In a separate bowl, whisk together nondairy milk, oil, vinegar and vanilla. Pour the wet mixture into the dry mixture and whisk until just combined. Do not overmix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill each prepared cake pan evenly with batter. Bake for 18 to 20 minutes, or until a toothpick inserted in the center of the cake comes out mostly clean, with a few crumbs clinging to it. Rotate the cakes halfway through the baking time. Cool the cakes completely before assembly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the Espresso Soak: In a small bowl, whisk amaretto, water and espresso until espresso dissolves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble: In a large bowl or trifle dish, place one layer of cake (trim to fit) at the bottom and drizzle it with the Espresso Soak. Spread a layer of Pumpkin Crème on top and generously sprinkle with ground chocolate. Repeat this process for 2 more layers until all components are used up. You could also cut the cake into mini rounds for individual servings in mini trifle dishes or ramekins."}]}