{"@context": "http://schema.org", "@type": "Recipe", "name": "General Tso’s Tofu Sub", "description": "Tyler Kord, the chef-owner of the No. 7  Sub shops in New York, has made the submarine a thing of juiciness, beauty and exoticism. “I like soft bread and fancy ingredients inside,” said Mr. Kord, who worked at a Subway when he was 16, in Ithaca, N.Y., and eventually became sous-chef at Jean-Georges Vongerichten’s Perry Street restaurant in New York. Take General Tso’s Tofu Sub, a brilliant study of layered textures and flavors. The centerpiece is a deep-fried panko-crusted rectangle of firm tofu, golden and crusty outside, and creamy inside. Mr. Kord layers the tofu between edamame purée, homemade pickled cucumbers and a piquant sauce named after General Tso that includes ginger, garlic, soy sauce, vinegar, sesame oil, sugar and chilis. The blender does the work, in three quick steps. The result is startling. It is what Mr. Kord wants it to be: crunchy, creamy, salty, sweet and sour, all in one bite.", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "lunch, sandwiches", "keywords": "ginger, soy sauce, tofu, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 115}, "recipeIngredient": ["1 small chunk of ginger, 1 1/2 inches long, peeled and roughly chopped", "1 clove garlic, roughly chopped", "1/4 cup soy sauce", "2 tablespoons sweet soy sauce", "2 tablespoons white vinegar", "2 tablespoons mirin", "1/2 teaspoon sesame oil", "1 1/2 small red dry Chinese chilis", "1/2 teaspoon salt", "1/2 teaspoon sugar", "1/2 teaspoon xanthan gum, optional", "2 cloves garlic, roughly chopped", "1 small chunk ginger, 1 inch long, peeled and sliced against the grain", "Half a shallot, roughly chopped", "1/4 teaspoon sesame oil", "1/2 teaspoon sugar", "1 1/2 teaspoons salt", "1 small red dry Chinese chili, seeded", "1/2 cup white wine vinegar", "1 scallion, in three-inch lengths, sliced vertically into chiffonade", "1 1/2 cucumbers, peeled, seeded, and sliced crosswise 1/8-inch thick", "3/4 cup frozen, shelled edamame, thawed", "Vegetable oil, for deep frying", "1/4 cup salt", "1 1/2 teaspoons sugar", "1/4 teaspoon paprika", "1/4 teaspoon garlic powder", "1/4 teaspoon onion powder", "8 ounces firm tofu, drained and cut into 4 slices", "3 large egg whites", "3 tablespoons cornstarch", "1/2 cup panko bread crumbs", "2 subway (submarine) sandwich rolls", "Mayonnaise", "Sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the General Tso sauce: In a blender combine ginger, garlic, soy sauce, sweet soy sauce, vinegar, mirin, and sesame oil. Add chilis, salt, sugar, and xantham gum, if using. Process until smooth. Transfer to a small bowl, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the pickles: In a clean blender combine garlic, ginger, shallot, sesame oil, sugar, salt and chili. Blend until slightly smooth, but still mostly chunky. Transfer to a medium bowl, and add the vinegar, scallion and cucumbers. Mix, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the edamame puree: In a clean blender puree edamame and just enough water to make a smooth paste. Transfer to a small bowl, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the tofu: In a deep fryer, preheat vegetable oil to 350 degrees. Meanwhile, in a small bowl, mix together salt, sugar, paprika, garlic powder and onion powder. Place the tofu on a plate, and sprinkle both sides of the tofu with about a tablespoon or more of the salt mixture, saving the rest for later use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the egg whites and cornstarch until blended and smooth. Place panko in a shallow bowl. Dip the seasoned tofu slices into the egg white batter, gently shake off excess batter, and dip in panko, covering the tofu thoroughly. Deep-fry in the oil until deep golden brown, about 4 minutes. Remove and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For assembly: Cut the subway rolls open lengthwise. Spread one side of each with edamame purée, and the other side with mayonnaise. Quickly dip both sides of the fried tofu in the General Tso sauce, and place two slices of tofu, end to end, on one side of each subway roll. Top the tofu with drained pickled cucumbers, garnish with a sprinkle of sesame seeds, and finish by topping with the other side of the roll. Cut in half, and serve immediately."}]}