{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Thai Curry Vegetables", "description": "Drew Spangler Faulkner, a cooking teacher at L’Academie de Cuisine in Bethesda, Md., makes a Thai green curry that is a kind of comfort food. The sauce, made creamy with coconut milk, and gently spicy with the curry paste, is flavorful yet soothing. The vegetables, which are simply dropped into the sauce, and gently simmered for about 12 minutes, turn out tender, not soggy. It is startlingly simple. She makes her own green curry paste, but the recipe calls for any one of three store bought pastes. Although some green curry pastes contain fish or shrimp paste, she has found three brands which do not: Thai Taste, Maesri and Thai Kitchen.", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": "https://static01.nyt.com/images/2018/12/22/dining/el-vegan-thai-curry-vegetables/el-vegan-thai-curry-vegetables-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1696}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 293, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "18 grams", "sodiumContent": "448 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["One 13 1/2-ounce can coconut milk (do not shake can)", "1/2 cup vegetable stock", "4 teaspoons soy sauce or tamari soy sauce", "4 teaspoons palm sugar or brown sugar", "6 tablespoons Thai green curry paste, like Thai Taste, Maesri, and Thai Kitchen, none of which have shrimp or fish paste", "1/2 cup diced (1/2 inch) onion", "2/3 cup diced (1/2 inch) red bell pepper", "2/3 cup diced (1/2 inch) zucchini or other summer squash", "2/3 cup diced (1/2 inch) peeled sweet potato", "2/3 cup sliced bamboo shoots, rinsed and drained", "1 cup green beans, trimmed and cut into 1 1/2 inch lengths", "2/3 cup diced (1/2 inch) Asian eggplant", "1 lime", "8 large basil leaves, cut into thin chiffonade"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the can of coconut milk without shaking it. Spoon 6 tablespoons of the coconut cream from the top of the can into a medium saucepan. Pour remaining contents of can into a medium bowl, and mix well. In a medium bowl, combine vegetable stock, soy sauce, and palm or brown sugar. Stir until the sugar is dissolved."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place saucepan of coconut cream over medium-high heat until it begins to bubble. Add curry paste and reduce heat to medium-low. Stir constantly until very fragrant, about 3 minutes; adjust heat as needed to prevent burning. Add onion, red pepper, zucchini, sweet potato, bamboo shoots, green beans, and eggplant. Stir until vegetables are hot, 2-3 minutes. Stir in coconut milk, bring the mixture to a boil, and reduce heat to low. Simmer, uncovered, until the vegetables are tender, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the soy sauce mixture and a generous squeeze of fresh lime juice to taste; you may use the juice of an entire lime. Stir and mix well. Add up to 1/4 cup water if the curry seems too thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place the curry in a warm serving bowl and garnish with the basil chiffonade. If desired, serve over jasmine rice."}], "link": "https://cooking.nytimes.com/recipes/1015694-vegan-thai-curry-vegetables"}