{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom Ragoût Omelet", "description": "Mushroom ragoût makes a luxurious filling for a simple omelet. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/12/17/science/17recipehealth/17recipehealth-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "Serves 1", "recipeCuisine": "french, mediterranean", "recipeCategory": "breakfast, dinner, lunch, quick", "keywords": "fall, winter, healthy, kosher, low sugar, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 241, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "0 grams", "proteinContent": "14 grams", "saturatedFatContent": "5 grams", "sodiumContent": "303 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 eggs", "2 teaspoons milk", "Salt and freshly ground pepper to taste", "2 teaspoons extra virgin olive oil or unsalted butter", "1/4 cup <a href=\"http://www.nytimes.com/recipes/1015828/mushroom-rago-and-ucirc-t.html\">mushroom ragoût</a>", "1 to 2 teaspoons freshly grated Parmesan, or 1 tablespoon grated Gruyère"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Break the eggs into a bowl and beat with a fork or a whisk until frothy. Whisk in salt and pepper to taste and 2 teaspoons milk. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat an 8-inch nonstick omelet pan over medium-high heat. Add the olive oil or butter. When the oil feels hot when you hold your hand above it, or when the butter stops foaming, pour the eggs right into the middle of the pan, scraping every last bit into the pan with a rubber spatula. Swirl the pan to distribute the eggs evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the omelet with the spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as the eggs are set on the bottom, spoon the mushroom filling over the middle of the egg “pancake,” and sprinkle the cheese over the mushrooms. Jerk the pan quickly away from you then back towards you so that the omelet folds over on itself. If you don’t like your omelet runny in the middle (I do), jerk the pan again so that the omelet folds over once more. Cook for a minute longer. Tilt the pan and roll out the omelet onto a plate. "}]}