{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Pork Cheek, Belly or Turkey-Thigh Salad", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/01/05/magazine/05eat3/05eat3-articleLarge.jpg", "totalTime": "P2D", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, project", "keywords": "main course, pork belly, pork cheek, turkey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "recipeIngredient": ["Pig cheek or piece of pork belly, or 2 turkey thighs; all should have their skin,\nand total weight should be between 2 1/2 and 3 pounds", "Salt and freshly ground black pepper", "Lard, duck fat or oil or a mixture (ideally enough to cover the\nmeat, 6 to 8 cups)", "1 large slice of good bread (1 inch thick and about the same size as the\ncooked meat)", "2 tablespoons olive oil", "2 tablespoons red-wine or sherry vinegar", "1 tablespoon Dijon mustard", "2 teaspoons chopped capers", "8 cups dandelions or other bitter greens like frisée (3 or 4 heads)\nor a mixture."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the meat liberally with salt and pepper. Refrigerate overnight, uncovered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to cook, rinse the meat in cold water; if you’re using the\noven (see next step), heat to 300. Put the fat in a pot that will allow you to submerge the meat, or nearly so. If you’re using lard or duck fat, heat it in\nthe oven until melted; if you’re using oil, warm it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Submerge the meat in the fat, put a piece of parchment paper directly on\ntop and weigh the paper down with something (I used a wooden spoon) to\nkeep it in place. Cook slowly on top of the stove or in the oven, adjusting the\nheat as necessary so the fat bubbles gently — not rapidly — and turning the\nmeat once or twice if it is not completely submerged. (You may wind up cooking at a temperature as low as 250.) It’s done when you can easily pierce it with a skewer, 2 hours or longer for cheek and\nbelly, 1 hour for turkey."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the meat from the fat. Proceed or refrigerate the meat, lightly\ncovered, for a day or two. Heat the oven to 350. (If you’re using turkey, drizzle\nthe bread with olive oil.) Place the meat skin-side up directly on top of the\nslice of bread (you want the meat to just cover the bread; any bread that’s\nexposed may burn). Put on a rack set over a rimmed baking sheet and roast,\nchecking occasionally and adjusting the heat as necessary, until the skin\nbecomes quite crisp, as little as 45 minutes or somewhat longer. Remove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, whisk together the olive oil, vinegar, mustard, capers, salt and pepper. Taste and adjust the seasoning; the dressing should be quite sharp.\nWash and dry the greens. If you’re using turkey, pull out the thigh bones (they\nshould slip out easily). With the meat still on top of the bread, chop the meat\nand bread into bite-size pieces (it doesn’t matter if it crumbles a bit). Toss with\nthe greens and the dressing, and serve."}]}