{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Striped Bass With Charred Kale and Yellow Squash", "description": "Grilling striped bass is a great way to cook the fish because the skin takes on a char that goes well with other strong flavors like oregano-laden chimichurri sauce. Usually paired with meat, chimichurri plays off of bass just as beautifully, as long as you use a light vinegar like champagne or rice wine, rather than balsamic. In preparing the fish, make sure the grill is hot first and be patient about flipping — you usually want about 4 minutes per side for a 7 to 8 ounce piece. Drop some local lacinato kale and thinly sliced yellow squash onto the grill as well for a charred vegetable side.", "author": {"@type": "Person", "name": "Jeff Schwarz And Greg Kessler"}, "image": "https://static01.nyt.com/images/2014/04/08/dining/Bass2/Bass2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "kale, striped bass, yellow squash, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "recipeIngredient": ["2 pounds striped bass, cut into four equal fillets", "2 yellow squash", "2 bunches lacinato kale, stems removed", "¼ cup extra virgin olive oil, plus more for coating fish and vegetables", "Juice of one lemon", "1 teaspoon red chili flakes", "Salt", "Chimichurri sauce (see <a href='http://www.nytimes.com/recipes/1015299/chimichurri-sauce.html'>recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a hot grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coat the fish fillets with a few tablespoons of olive oil. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice the squash lengthwise, using a mandoline or a very sharp knife, and combine with the kale in a large bowl. Drizzle a couple tablespoons of olive oil over the vegetables. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the prepared fish skin-side down on the grill. After about 4 minutes, or when the skin easily lifts off the grill, flip the fillets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the fish is cooking, place the kale and squash on the grill and watch carefully. Turn the vegetables the moment they begin to show grill marks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once they are charred on both sides, return the vegetables to the large bowl and toss with 1/4 cup olive oil, lemon juice and chili flakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the fish from the grill after about 4 minutes on its second side, and top with a spoonful of the chimichurri sauce. Serve with the grilled vegetables."}], "link": "https://cooking.nytimes.com/recipes/1015298-grilled-striped-bass-with-charred-kale-and-yellow-squash"}