{"@context": "http://schema.org", "@type": "Recipe", "name": "Shredded Beet and Radish Slaw With Rice Noodles", "description": "I intended this mixture as a filling for spring rolls, and you can certainly use it this way (though it’s a bit moist). But having mixed it together I tasted it and it was so good, I just wanted to sit down and eat it for dinner, which is what I did – and for lunch the following day. If you do want to wrap this salad, I suggest wrapping it in romaine lettuce leaves.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/10/08/science/08recipehealth/08recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "easy, quick, pastas, salads and dressings", "keywords": "beet, radish, vermicelli, dairy-free, gluten-free, halal, healthy, kosher, low calorie, low cholesterol, low-fat, nut-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 54, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "192 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["2 ounces rice vermicelli (thin rice sticks) or thin rice noodles for stir-fries", "1/4 cup rice vinegar", "2 teaspoons soy sauce", "1 large red beet (7 to 8 ounces), peeled and grated", "1 bunch radishes (5 to ounces), grated", "1/2 cup chopped cilantro, plus sprigs for garnish", "3 tablespoons slivered mint leaves", "2 tablespoons slivered Thai basil leaves (may substitute regular basil if you can’t get the Thai variety)", "1 to 2 tablespoons minced pickled ginger (to taste)", "2 teaspoons finely grated or chopped orange zest", "Salt to taste", "Romaine lettuce leaves for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rice noodles in a large bowl and cover with hot water. Soak for 20 minutes, or until pliable. Meanwhile, bring a large pot of water to a boil. Drain the noodles and add to the boiling water. Boil 1 minute and drain. Rinse with cold water and transfer to a bowl. Using kitchen scissors, cut the noodles into 2-inch lengths. Toss with 2 teaspoons of the rice vinegar and the soy sauce. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the grated beets, radishes and chopped herbs in a large bowl and toss with the remaining rice vinegar and salt to taste. Add the noodles, pickled ginger and orange zest and toss together. Taste and add salt if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, line plates or a platter with lettuce leaves and top the lettuce with the salad. Garnish with cilantro sprigs and serve."}], "link": "https://cooking.nytimes.com/recipes/1015201-shredded-beet-and-radish-slaw-with-rice-noodles"}