{"@context": "http://schema.org", "@type": "Recipe", "name": "Créme Anglaise", "description": "There is a French expression that I love &mdash; p&eacute;ch&eacute; mignon, or a harmless &ldquo;little sin,” and this sweet, fragrant, egg yolk-rich, vanilla seed-flecked custard sauce is mine. I serve it with everything from crumbles to chocolate cake to trifle, the ultimate cr&egrave;me anglaise dessert. Make sure to have a digital thermometer handy when you make it, so you can heat the mixture to just the right temperature without worrying about the eggs curdling. You will also know when they custard sauce has cooled sufficiently.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/12/25/dining/25cremeanglaise/25cremeanglaise-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Makes about 2 2/3 cups", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, eggs, vanilla", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 23}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 200, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": null, "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "48 milligrams", "sugarContent": "27 grams", "transFatContent": null}, "recipeIngredient": ["2 1/4 cups milk", "1 1/2 vanilla beans", "135 grams sugar (2/3 cup), divided", "6 large egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 2 cups milk in a saucepan. Using the tip of a paring knife, split vanilla beans down the middle and scrape seeds into milk. Add pods to milk and bring to a simmer. As soon as it reaches a simmer (you will see bubbles breaking along the edges of the pan), turn off heat, cover pan tightly with plastic wrap and let it sit for 20 minutes. Remove pods and scrape them with the blunt edge of the knife so any residual seeds go into the milk. Set aside saucepan with milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl with ice cubes and place a medium bowl on top of the ice. Set a strainer over the medium bowl, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another bowl, combine egg yolks and half the sugar and beat for about 30 seconds. Beat in remaining 1/4 cup milk. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining sugar to vanilla-infused milk in pan and, using a heatproof rubber spatula, stir for 10 to 20 seconds so sugar doesn&rsquo;t stick to bottom of pan. Bring mixture back to a simmer over medium heat while continuing to stir. When sugar has dissolved and milk comes to a simmer, turn off heat. Place bowl with beaten egg yolks next to saucepan, with a towel coiled around the bottom to keep it steady, and whisk in two-thirds of the hot milk. Whisk mixture back into saucepan. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place saucepan back on low heat. Using a rubber spatula, stir constantly and everywhere until you feel the mixture starting to thicken. (Stirring in a figure eight helps assure that your spatula touches the entire bottom of the pan.) Place a thermometer in the pan and continue to stir constantly until temperature reaches 165 to 180 degrees. Lift spatula from saucepan with some sauce on it and run your finger down the middle. It should leave a canal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately strain mixture into the clean, dry mixing bowl set over ice. Tap strainer to get all of the custard sauce. Stir mixture for a few minutes, then once in a while, until it has cooled to 60 degrees (it should take 20 minutes or less). You can also cool it in the freezer, stirring every few minutes, if you don&rsquo;t have enough ice on hand. Once cool, transfer to a container, cover tightly and refrigerate until ready to use. It will keep in the refrigerator for 2 days. "}], "link": "https://cooking.nytimes.com/recipes/1015855-creme-anglaise"}