{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin Soup Served in a Pumpkin (Potage au Potiron)", "description": "There was a little farm near where we lived, in Alsace, in a small town by the name of Thann, where we got our pumpkins. My mother would make soup just this way; she served it in the pumpkin, too. We kids looked forward to it every year. Along the way I’ve improved it a little bit. I added the croutons, which I sauté in butter and salt. She didn’t do that. I love soup, and this soup in particular. We usually have Thanksgiving up in the Catskills, at our friends’ house. I always say I’m not cooking, and I end up cooking. This is what I make.", "author": {"@type": "Person", "name": "André Soltner"}, "image": "https://static01.nyt.com/images/2013/11/25/dining/video-soltnerstillNEW/video-soltnerstillNEW-mediumThreeByTwo440.jpg", "totalTime": "PT1H40M", "recipeYield": "6 to 8 servings (about 2 quarts)", "recipeCuisine": "french", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "main course, side dish, pumpkin", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 62}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 335, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1096 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pumpkin, 8 to 10 inches in diameter", "8 tablespoons (1 stick) unsalted butter", "1 medium onion, sliced", "2/3 cup dry white wine", "2 small white turnips, peeled and sliced", "1 large carrot, peeled and sliced", "1 large potato, peeled and sliced", "5 cups chicken stock (or water), or as needed", "1 10-inch French-style baguette or 2 small rolls, crusts removed, thinly sliced", "1/2 cup heavy cream", "Salt and ground white pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut off top of pumpkin at least 5 inches across, so that it can serve as a lid. Scoop out and discard all seeds and stringy material. Using a large sturdy spoon, scrape out 6 cups of pumpkin meat, taking care not to break through the shell. Set aside the pumpkin and its lid in a warm place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large soup pot over medium-low heat, melt 2 tablespoons butter. Add onion and sauté until tender, about 5 minutes. Add wine and simmer for 1 minute. Add turnips, carrot, potato, pumpkin meat and enough chicken stock or water to barely cover."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and bring to a boil. Meanwhile, in a large skillet, heat remaining 6 tablespoons butter, and add bread slices, turning until lightly browned on both sides. Set aside half for garnish, and when soup has come to a boil, add remaining half to the soup.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently simmer soup for 1 hour, stirring once or twice. The soup will be very thick; if it seems in danger of burning, reduce heat and stir in a small amount of broth or water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cream, and season to taste with salt and pepper. Using an immersion blender, purée the hot soup in the pot until very smooth. Alternatively, remove soup from heat and allow to cool until no longer steaming, then purée in a food processor or blender. Return soup to a clean pot and reheat gently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour hot soup into pumpkin. Serve from pumpkin, garnishing each serving with one or two reserved toasts."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "André Soltner's Pumpkin Soup", "description": "For Thanksgiving, André Soltner prepares a version of pumpkin soup that he watched his mother make over 75 years ago. The creamy soup is served in a pumpkin and garnished with croutons.", "thumbnailUrl": "https://static01.nyt.com/images/2013/11/25/dining/video-soltnerstillNEW/video-soltnerstillNEW-mediumThreeByTwo440.jpg", "uploadDate": "2013-11-13T22:52:00.000Z", "duration": "PT2M38S"}}