{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry-Brie Arepa", "description": "Chef Mauro says you shouldn’t be intimidated by this vegetarian version of the popular Venezuelan sandwich. Masarepa blanca is a precooked corn flour and can be found in Latin markets as well as some larger grocery stores or ordered online. (Don’t be tempted to substitute with another traditional Mexican flour, masa harina.) “Frying that bread seems like a lot of work, but it’s a simple two-step process,” says Chef Mauro. “The sweetness from the cranberry and earthiness of the Brie, tangy mustard and tartness of the apple — it’s really amazing. Even my 3-year-old enjoyed it.”", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2011/11/22/health/Well_veggie_sandwich3/Well_veggie_sandwich3-articleLarge-v3.jpg", "totalTime": "PT45M", "recipeYield": "6 sandwiches", "recipeCuisine": "", "recipeCategory": "", "keywords": "kosher, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "recipeIngredient": ["2 cups masarepa blanca", "1 teaspoon salt", "1 teaspoon baking powder", "2 to 2 1/2 cups warm water", "1/4 cup vegetable oil", "1 8- to 12-ounce wedge of good Brie cheese, rind removed and sliced thin", "Leftover cranberry sauce, the less gelatinous the better", "1 green apple, peeled and sliced into half moons", "Arugula", "Dijon mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees, with a rack set in the middle position."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk masarepa, salt and baking powder until combined. Slowly add warm water and stir until a dough forms. Form 6 3-inch rounds, about 1/2-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of oil in a 12-inch nonstick skillet over medium-high heat until shimmering. Add half the cakes, and cook 4 minutes on each side, until golden. Transfer to parchment-lined sheet pan and repeat with remaining cakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish in oven for 10 minutes, or until the cakes sound hollow when tapped on the bottom. Immediately split cakes horizontally with fork, and stuff with a couple slices of Brie. Close and let the residual heat melt the Brie."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reopen and schmear some of the cranberry on the bottom slice, along with a couple slices of apple and a bit of arugula. Serve with a small side of Dijon to dip the sandwich in."}], "link": "https://cooking.nytimes.com/recipes/1015362-cranberry-brie-arepa"}