{"@context": "http://schema.org", "@type": "Recipe", "name": "Broccoli Rabe Timbale", "description": "A timbale is a savory custard, gently baked in a water bath and unmolded before serving. You can use either broccoli rabe or baby broccoli for this one; the rabe has a stronger flavor, with a bitter edge. Bake this in individual ramekins or in a 1- or 1 1/2 -quart soufflé dish or ring mold and serve with a <a href=\"http://www.nytimes.com/2008/10/13/health/nutrition/13recipehealth.html\">marinara sauce</a>. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/12/25/dining/25eggs2/25eggs2-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, main course, side dish, broccoli rabe, butter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 14}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 282, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "3 grams", "proteinContent": "18 grams", "saturatedFatContent": "9 grams", "sodiumContent": "462 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound broccoli rabe or baby broccoli (1 medium-size bunch)", "1 tablespoon extra-virgin olive oil", "1 plump garlic clove, minced", "1 teaspoon chopped fresh thyme", "Salt and black pepper", "Soft butter, for the baking dish (or dishes)", "5 large eggs", "3 grams salt (1/2 teaspoon)", "1 cup milk", "50 grams dry bread crumbs (scant 2/3 cup)", "85 grams Gruyère, grated (3/4 cup) ", "50 grams Parmesan, grated (about 1/2 cup)", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the vegetables: Trim away bottoms of stems from broccoli rabe or baby broccoli, then remove greens and florets, keeping them separate from the stems. If stems are thicker than 1/2 inch, cut in half lengthwise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of water to a boil, salt generously and add stems. Blanch for 2 minutes, then add florets and leaves. Continue to blanch for another 3 minutes. Using a skimmer or a spider, transfer all the broccoli rabe or baby broccoli to a bowl of cold water, then drain. (If using broccoli rabe, take handfuls of the greens and squeeze out excess water.) Place on kitchen towels and allow to drain for a few more minutes, then chop fine. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil over medium heat in a medium-size skillet. Add garlic and cook, stirring, until fragrant, 30 seconds to a minute. Add thyme and chopped vegetables. Stir over medium heat for about 1 minute, season to taste with salt and pepper, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the timbale: Heat oven to 325 degrees. Generously butter a 1- or 1 1/2-quart soufflé dish or ring mold, or six 1/2-cup ramekins. Set dish (or ramekins) in a baking pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat eggs in a large bowl. Add salt. Bring milk to a bare simmer: You should see bubbles at the sides of the pan, but the surface of the milk should not break. Remove from heat and whisk into eggs. Stir in bread crumbs, cheeses and vegetable filling. Scrape into large soufflé dish or ladle into smaller ramekins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully pour enough hot water into baking pan to measure about 1 inch up the sides of the baking dish(es). Place pan in oven. Bake a large timbale for 40 to 45 minutes, small ramekins for 30 minutes, until just set. Turn off oven and prop oven door open. Let dish(es) sit in oven, leaving large timbale for 30 minutes to an hour, or small ramekins for 20 minutes. Remove from oven. To unmold, run a knife around the edge of the soufflé dish or ramekins and reverse onto a plate or a platter. Serve warm or room temperature, surrounded with marinara sauce. "}]}