{"@context": "http://schema.org", "@type": "Recipe", "name": "Sablé Breton Galette With Berries", "description": "The sablé is a sweet shortbread that’s buttery and noticeably salty. In this version, the dough is purposely very soft (it’s too soft to roll and cut for cookies) so that it can be patted and pressed into a tart pan, baked, and used as the base of a beautiful berry dessert. You can spread the galette with lemon curd and top it with sliced strawberries or whole raspberries, but it is equally good with whipped cream or ice cream in place of the curd. In fact, it’s good on its own — just cut it into wedges. If you’re not serving a group, leave the galette plain, and when you need a slice or three of tart, cut the galette and top it on the spot.", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": "https://static01.nyt.com/images/2016/01/19/dining/19COOKING_GALETTEWBERRIES/19COOKING_GALETTEWBERRIES-articleLarge-v2.jpg", "totalTime": "PT5H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "brunch, lunch", "keywords": "berries, dough, pastry, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 69}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 487, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "60 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "16 grams", "sodiumContent": "296 milligrams", "sugarContent": "39 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup all-purpose flour", "1 1/4 teaspoons baking powder", "10 tablespoons (1 1/4 sticks) unsalted butter, at room temperature", "2/3 cup granulated sugar", "1/2 teaspoon fleur de sel or ¼ teaspoon fine sea salt", "1 large egg", "About 1 cup lemon curd", "About 3 cups berries (strawberries, raspberries, or blueberries, or a mix of these)", "Red currant jelly, for glazing (optional)", "Confectioners’ sugar, for dusting (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the galette: Whisk the flour and baking powder together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment or in a large bowl with a hand mixer, beat the butter on medium speed until soft and creamy. Add the sugar and salt and beat for another 2 minutes, or until the mixture is very smooth. Beat in the egg and mix for 2 minutes more. Reduce the mixer speed to low, add the flour, and mix only until it is blended into the mixture — you’ll have a very soft dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with a rubber spatula, give the dough a few turns to make sure you’ve picked up all the dry ingredients at the bottom of the bowl, then scrape the dough onto a piece of wax paper or plastic wrap. Press down on the dough to form it into a disk, wrap it well, and chill it for at least 3 hours. (The dough can be refrigerated for up to 3 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to bake the galette, center a rack in the oven and preheat the oven to 325 degrees. Butter a 9- to 9 1/2-inch fluted tart pan with a removable bottom and put it on a baking sheet lined with a silicone baking mat or parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To get the dough going, put it between two pieces of wax paper or plastic wrap and roll it into a circle. If it’s too difficult to roll — it’s soft and it has a tendency to break — skip the rolling part and go directly to the patting part: Put the dough in the center of the tart pan and pat and press it into an even layer. Don’t press the dough up the sides of the pan — you want as flat a surface as you can get. Place the pan on the baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the galette for 40 to 45 minutes, or until the top is golden brown and the edges come away from the sides of the pan; if you press the galette gently, it won’t feel completely firm, but that’s just fine. Transfer the pan to a cooling rack and let the galette rest for 3 minutes or so, then invert it onto another rack, invert again onto a rack, and let cool to room temperature right side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before you’re ready to serve, top the galette: Put the galette on a flat serving plate and spoon over as much lemon curd as you’d like, spreading it in swirls but leaving a little border around the edge bare (the curd will spread when you cut the base). If you’re using strawberries, hull them, leave them whole or slice them in half, and arrange the halves attractively over the curd. If you’ve got raspberries or blueberries or a mélange, scatter the berries over the curd or arrange them neatly in pretty circles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you want to give the galette a little glaze, warm ¼ cup or so of currant jelly with a tiny splash of water until it liquefies (you can do this in a microwave oven or a saucepan). Either drizzle the glaze over the berries — this is my preferred technique — or use a pastry brush or feather to paint the berries with the jelly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you haven’t glazed the berries, you might want to give them a dusting of confectioners’ sugar just before you’re ready to bring the galette to the table."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, cut the galette into wedges and serve as is — nothing more is needed."}], "link": "https://cooking.nytimes.com/recipes/1015637-sable-breton-galette-with-berries"}