{"@context": "http://schema.org", "@type": "Recipe", "name": "Rye Spaetzle Gratin", "description": "Unless you have an Eastern European heritage or a penchant for replicating the hearty cuisine of German beer halls, it may never have occurred to you to make spaetzle at home. I have both, and the small, squiggly egg dumplings are one of the first carb-heavy, comfort-food dishes I crave when the weather turns cold.\n\nMaking spaetzle is simpler than you may think. Mixing the ingredients is as easy as making pancake batter and uses pantry staples.\n\nThe only potentially tricky part is turning the batter into fluffy little dumplings. There are several approaches to this. Some people like to make a thick dough and grate it through the holes of a cheese grater. But if you keep the spaetzle mix as runny as cake batter, you’ll be able to push it through a spaetzle maker (or colander) into a pot of boiling water fairly quickly.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/08/dining/ryespaetzle-still/ryespaetzle-still-mediumThreeByTwo440.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "eastern european, german", "recipeCategory": "dinner", "keywords": "cabbage, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 74}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 407, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "5 grams", "proteinContent": "18 grams", "saturatedFatContent": "13 grams", "sodiumContent": "599 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 medium savoy cabbage (1 1/2 pound)", "3/4 teaspoon whole caraway seeds", "6 tablespoons unsalted butter", "3 large leeks, thinly sliced (3 cups)", "2 garlic cloves, finely chopped", "Large pinch chile flakes", "1 thyme branch", "2 teaspoons apple cider vinegar, or more to taste", "1 3/4 teaspoons kosher salt, more as needed", "180 grams all-purpose flour (1 1/2 cups)", "100 grams rye flour (3/4 cup)", "2 large eggs, lightly beaten", "1 to 1 1/2 cups whole milk, as needed", "8 ounces Gruyère or Emmentaler cheese, grated (2 cups)", "Ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard the outer leaves of cabbage; quarter, core and slice the rest. Using a mortar and pestle or the flat of a knife, lightly crush the caraway seeds. Melt the butter in a very large skillet over medium-high heat. Add the leeks and cook, stirring occasionally, until tender and lightly colored, 5 to 10 minutes. Stir in the caraway, garlic, chile and thyme; cook 1 minute. Add the cabbage and cook, tossing frequently, until very tender and wilted, 7 to 10 minutes. Season with vinegar and 3/4 teaspoon salt or more to taste. Remove from heat and cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. In a large bowl, whisk together the flours and 1 teaspoon salt. In a separate bowl, whisk together the eggs and 1 cup milk. Make a well in the dry ingredients and pour in the wet mixture. Stir with a wooden spoon to combine. The consistency should be that of a sticky cake batter. As the batter sits, it will absorb more liquid; add more milk as needed to keep it loose."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches, press the spaetzle through a spaetzle maker or a colander into the boiling water. (If using a colander, either hold it with oven mitts so you don’t burn yourself over the steaming water, or get a friend to help). As the spaetzle rise to the surface, scoop them out with a slotted spoon and transfer to the skillet with the cabbage. Once all of the spaetzle has been added, toss the mixture well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Scrape the mixture into a 1 1/2-quart gratin dish. Scatter cheese over the top. Bake until golden and bubbly, 20 to 25 minutes. Grind a generous amount of black pepper all over the top of the gratin, then serve."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Rye Spaetzle Gratin", "description": "Mixing up a batch of spaetzle is as easy making pancake batter. But you’ll need a hand to make the dumplings without a spaetzle maker.", "thumbnailUrl": "https://static01.nyt.com/images/2014/04/08/dining/ryespaetzle-still/ryespaetzle-still-mediumThreeByTwo440.jpg", "uploadDate": "2013-11-01T20:25:53.000Z", "duration": "PT3M46S"}}