{"@context": "http://schema.org", "@type": "Recipe", "name": "Colombian Corn and Cheese Arepas", "description": "", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2020/03/02/dining/arepas/merlin_161624505_3a31985d-6abb-493f-ab7e-057bcbc20cb3-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "11 large arepas", "recipeCuisine": "south american", "recipeCategory": "", "keywords": "appetizer, side dish, cheese, corn flour, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 113}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 472, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "3 grams", "proteinContent": "20 grams", "saturatedFatContent": "16 grams", "sodiumContent": "727 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 cups (about 1 pound) precooked white corn flour, like harina P.A.N.", "2 tablespoons sugar", "5 tablespoons unsalted butter, melted", "1 1/2 pounds soft fresh cheese like queso blanco or queso fresco (or mozzarella) coarsely grated (about 4 cups, well packed)", "8 ounces aged cow’s-milk cheese, preferably Mexican cotija (or Manchego or Parmesan), coarsely grated (about 2 cups)", "1 1/2 teaspoons salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the flour and sugar in a large bowl. Gradually add 3 cups warm water, mixing with your fingers, then work in 4 tablespoons of the butter. Knead to a soft dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "One cup at a time, knead in the cheese. Add 1 to 2 tablespoons more water if the mixture seems dry. Taste the dough (some cheeses are very salty), then knead in salt to taste, 1/2 teaspoon at a time. Continue kneading until the dough feels soft and smooth, with no lumps. Set aside to rest for at least 15 minutes, covered with a damp cloth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler or a grill over high heat. Divide dough into 11 portions, roughly 5 ounces or 1/2 cup each. Roll into balls between your palms and set aside on a tray covered with a damp kitchen towel. Flatten each ball into a thick circle, 3 1/2 inches in diameter, flat on both sides. Return to tray and keep covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line broiler or grill rack with aluminum foil and brush foil lightly with remaining 1 tablespoon butter. Arrange arepas on foil and cook about 4 inches from the heat source, turning once, until both sides are golden brown and speckled — about 10 minutes per side. Serve immediately, for breakfast (like corn muffins) or as an accompaniment to soups or stews (like corn bread)."}]}