{"@context": "http://schema.org", "@type": "Recipe", "name": "Bihari Green Beans Masala", "description": "This succulent green bean dish, in a gently spiced sauce of coconut milk,  is from Bihar, a state in India. “It is an everyday, simple dish that is several hundred years old,” said Julie Sahni, a cooking teacher, and author of eight cookbooks.\n\nThe dish requires fresh green string beans, not French haricot verts or Asian long beans, which are thinner, and more dense. “The string beans will plump up, and absorb some of the sauce,” said Ms. Sahni.\n\nThe recipe can be adapted for 12 ounces of raw cauliflower, carrots, eggplant, or brussels sprouts. For the eggplant, Ms. Sahni uses the long, slender Japanese ones, and cuts them on the diagonal, in one-inch slices. She trims and peels the carrots, and cuts them like the eggplant, in one-inch diagonal slices. For the cauliflower, she uses the florets, and cuts them in pieces that are one and a half inches in diameter. For Brussels sprouts, she trims and discards the stems, and cuts the vegetable in half. Very fresh cauliflower cooks in four minutes, the other vegetables in six minutes, Ms. Sahni said.", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT40M", "recipeYield": "2 to 3 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, lunch", "keywords": "green beans, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 108}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 278, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "12 grams", "sodiumContent": "490 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons vegetable oil or light olive oil", "2 tablespoons sliced almonds", "1/2 cup finely chopped onion", "3 large cloves garlic, finely chopped", "1 teaspoon ground cumin", "1 teaspoon ground coriander", "1 teaspoon sweet paprika", "1/2 teaspoon red chili pepper flakes", "3/4 teaspoon kosher salt", "3/4 cup coconut milk", "3/4 pound green beans, trimmed and cut into 1-inch pieces", "1 teaspoon lime juice", "2 tablespoons chopped cilantro."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a 3-quart sauté pan over medium heat. Add almonds and cook, stirring, until light golden. Remove from heat and transfer almonds to a plate or bowl; set aside for garnish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion, garlic, cumin, coriander, paprika, chili pepper flakes and salt to the unwashed sauté pan, and return to medium heat.  Sauté until the onion is tender and begins to fry, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add coconut milk and green beans. Mix well and bring to a boil. Reduce heat to medium-low and cook, covered, until the beans are tender, about 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle beans with lime juice, and toss lightly. Transfer to a warmed serving dish and garnish with almonds and cilantro.  If desired, serve accompanied by plain cooked rice or roti flatbread."}]}