{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetable and Mushroom Pot Pie", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "2 pot pies (2 servings)", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch", "keywords": "mushroom, vegetables, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 48}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 457, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "9 grams", "proteinContent": "18 grams", "saturatedFatContent": "11 grams", "sodiumContent": "270 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["FOR THE MUSHROOM STOCK:", "1 medium onion", "3 medium carrots, unpeeled and cut in large chunks", "2 garlic heads in their skins, cut in half horizontally", "2 cup mixed dried mushrooms, well ground in a blender or food processor", "1 cup white mushrooms, cleaned and trimmed", "1/2 cup canned tomatoes, coarsely chopped", "1 tablespoon butter, at room temperature", "1 tablespoon all-purpose flour", "1 tablespoon lemon juice", "2 tablespoons Madeira", "Salt and freshly ground black pepper", "FOR THE FILLING:", "2 tablespoons butter", "1 pound wild mushrooms or cultivated exotic mushrooms", "3 cups assorted vegetables that have been peeled, trimmed, and cut into 1/2-inch slices or dice, or very small vegetables (such as carrots and fingerling potatoes) left whole", "FOR ASSEMBLY:", "2 tablespoons finely chopped, of two to four of these fresh herbs: tarragon, parsley, chives, chervil", "1 tablespoon truffle butter, chilled and cut into tiny pieces, optional", "2 sheets puff pastry, defrosted in the refrigerator 2 to 3 hours before use, or according to the instructions on the package.", "1 egg", "2 tablespoons milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the mushroom stock: In a large pot, combine onion, carrots, garlic, ground dried mushrooms, fresh white mushrooms and 10 cups water. Bring to a boil over high heat, then reduce heat to low and simmer uncovered for 1 1/2 hours; there will be about 4 cups. Pour through a strainer lined with cheesecloth, reserving stock and discarding the solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return stock to the pot, and add tomatoes. Place over high heat and boil until reduced by half. Strain into a clean pot, and return to medium heat. Knead together the butter and flour, and add to the broth. Simmer for 5 minutes, and add lemon juice, Madeira, and salt and pepper to taste. Cool the stock by placing the pot in a large bowl of ice, then cover and refrigerate until well-chilled. May be refrigerated for up to 3 days, or frozen for up to 2 months."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the filling: In a large sauté pan over medium heat, melt the butter and add fresh wild or cultivated mushrooms. Sauté until the mushrooms release their liquid, 5 to 7 minutes, and immediately remove from heat. Add the liquid to the chilled mushroom stock. Cover and refrigerate the mushrooms until well-chilled; there should be about 1 cup cooked mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil, and set aside a large bowl of ice water. Cook or blanch vegetable one at time until each is barely tender, about 10 minutes for fingerling potatoes, 5 minutes for whole baby carrots, parsnips or turnips. Leeks and squash do not need to be blanched. Remove the vegetables with a slotted spoon and place in the ice water to cool. When all vegetables are blanched and cooled,  drain the vegetables,  cover and refrigerate until well-chilled; there should be about 3 cups cooked vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For assembly: Preheat oven to 400 degrees. Divide chilled vegetables and mushrooms between two 1-quart ceramic soufflé dishes about 6 inches in diameter and 3 1/2 inches deep. Pour 1 cup chilled stock into each dish; reserve any remaining stock for another use. Top each dish with 1 tablespoon chopped herbs and 1/2 tablespoon truffle butter, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut rounds of puff pastry large enough to overhang the dish by 1 1/2 to 2 inches. In a small bowl or cup, beat the egg with the milk. Brush the edge of each round with the egg wash, then invert and place on the dish so the egg helps seal the dish. The puff pastry should not touch the filling or it won’t puff when cooked. Brush tops of pies with remaining egg wash. Place dishes on a baking sheet and bake for 25 minutes. Check to see if pastry is golden, and if necessary, bake 5 to 10 more minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, run a sharp knife around the inside edge of each dish, lifting off the dome in one piece. Place the dome at an angle, top side down, and ladle the vegetables onto half the dome so they spill onto the plate like a cornucopia."}]}