{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Goose", "description": "Here is a bird that throws off a lot of beautiful fat in the oven. You will use some of it to cook the potatoes that go in the roasting pan for the final hour of cooking, but you will have taken off quite a bit before that as well. You can save that goose fat, covered, in the refrigerator for a few weeks, until the next time you want incredible roast potatoes. The British serve roast goose with a sauce of onions sauteed in goose fat, then stewed in milk and cream and thickened with old bread. But I prefer something tart rather than rich — a cranberry relish, for instance, sweetened but not overly so.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/11/19/dining/19COOKING-ROASTEDBIRD/19COOKING-OVENROASTED-articleLarge.jpg", "totalTime": "PT3H15M", "recipeYield": "Serves 10 to 12.", "recipeCuisine": "", "recipeCategory": "brunch, dinner, roasts", "keywords": "goose, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 193}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1086, "unsaturatedFatContent": "57 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "89 grams", "fiberContent": "3 grams", "proteinContent": "45 grams", "saturatedFatContent": "26 grams", "sodiumContent": "933 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 whole goose, approximately 12 pounds", "Kosher salt", "Freshly ground black pepper", "3 pounds small potatoes, ideally red or Yukon gold, peeled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse and dry the goose, rub it inside and out with salt and refrigerate \nuncovered for at least 6 hours, or overnight. The next morning, rub goose well with paper towels, then allow it to sit on a rack in the kitchen for about an hour, to come to room temperature. Trim wing tips and excess fat from goose and reserve for another use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325. Using a clean needle or sharply pointed knife, prick the skin of the goose all over, to allow the fat to run when it roasts. Stick the skin at an angle, so as to pierce just the skin and not the meat of the bird. Season the goose with salt and pepper, then place the rack in a deep roasting\tpan, and cook for one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the potatoes in boiling salted water for approximately 3 to 5 minutes, then drain and reserve the potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After an hour’s roasting, remove the goose from the oven, and pour off the fat from the pan, reserving for another use. Put the goose on its rack back in the pan and add the potatoes. Roast for another hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the goose has roasted for 2 hours total, reduce oven to 275 and continue roasting approximately 30 to 45 minutes, about 15 minutes per pound total, or until an instant-read thermometer registers 165 degrees at the center of the breast. Remove goose to a carving board and allow to rest for 20 to 30 minutes before carving. The bird may be served at room temperature if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove potatoes from pan and keep them warm under foil until ready to serve."}]}