{"@context": "http://schema.org", "@type": "Recipe", "name": "Smashed Potatoes With Eggs and Rosemary Vinaigrette", "description": "Feel free to double the eggs and add other brunch-worthy food alongside or as an underpinning for the potatoes, like smoked salmon, bacon or cured ham.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2015/12/21/dining/21COOKING_POTATOESwEGG2/21COOKING_POTATOESwEGG2-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "eggs, potato, rosemary, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 93}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 480, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "6 grams", "proteinContent": "15 grams", "saturatedFatContent": "5 grams", "sodiumContent": "823 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound small Red Bliss potatoes, peeled", "Salt", "2 sprigs fresh rosemary", "3 cloves garlic", "Juice and grated zest of 1/2 lemon", "3 tablespoons extra-virgin olive oil", "Pinch crushed red chile flakes", "Grape seed or canola oil for frying", "1 tablespoon white vinegar", "2 to 4 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil potatoes in salted water with 1 sprig of the rosemary and 2 cloves of garlic until tender. Drain potatoes and discard rosemary and garlic. Place potatoes on a cutting board and use the side of a cleaver or the bottom of a pot to lightly crush them, keeping them as intact as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strip leaves from remaining rosemary sprig and chop. Mince remaining garlic clove. Place in a dish with lemon juice and zest and whisk in olive oil and chile flakes. Season with salt. Heat oven to 200 degrees. Line a small baking sheet with a couple of layers of paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat grape seed or canola oil on medium-high to a depth of 1/2 inch in a skillet large enough to hold potatoes in a single layer (a 10-inch skillet should work). When oil is hot, add smashed potatoes and fry, turning once, until golden brown and crusty. Season with salt, transfer to baking sheet and place in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring an inch or so of water to a simmer in a shallow 2-quart saucepan. Add vinegar. Break an egg into a teacup and slip the egg out of the cup and into the water. Repeat with second egg. (And with two more eggs if you desire.) Simmer until just set, about 3 minutes. Divide potatoes between two warm plates, give the vinaigrette another whisking and drizzle about half of it over the potatoes. Use a slotted spoon to lift eggs from the water and place onto the potatoes. Drizzle eggs with the rest of the vinaigrette and serve."}], "link": "https://cooking.nytimes.com/recipes/1015224-smashed-potatoes-with-eggs-and-rosemary-vinaigrette"}