{"@context": "http://schema.org", "@type": "Recipe", "name": "Tender Pie Dough", "description": "This makes a large batch of dough. Divide it in half and use both halves, or freeze one portion to use another time.", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": null, "totalTime": "PT20M", "recipeYield": "Two 9-inch pie crusts", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "dessert, flour, pastry", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "recipeIngredient": ["14 tablespoons (1 3/4 sticks) unsalted butter, at cool room temperature, cut into tablespoons", "1/3 cup whole milk", "2 1/2 cups unbleached all-purpose flour", "1 tablespoon and 1 teaspoon superfine sugar", "1/4 teaspoon fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the butter in the bowl of a heavy-duty stand mixer fitted with the paddle attachment at high speed until the butter is smooth, about two minutes. With the mixer running, slowly dribble in the milk, occasionally stopping the mixer and scraping down the sides of the bowl with a silicone spatula. The butter mixture should be fluffy, smooth, and shiny, like a butter cream frosting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the flour, sugar, and salt together in a small bowl. With the mixer speed on low, gradually add the flour mixture and incorporate just until the dough forms a mass on the paddle and the sides of the bowl are clean. Turn out the dough onto a lightly floured surface. Knead a few times until it is smooth and supple. Divide the dough in half. Shape each portion into a disk, about one-inch thick. Wrap each disk in plastic wrap."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate until chilled but not hard, 30 minutes to an hour. (The dough can be refrigerated up to one day, but it will be very hard, and should stand at room temperature for about 30 minutes before rolling out. The dough can also be frozen, double wrapped in plastic, for up to two weeks. Defrost in the refrigerator overnight."}], "link": "https://cooking.nytimes.com/recipes/1015674-tender-pie-dough"}