{"@context": "http://schema.org", "@type": "Recipe", "name": "Ciabatta", "description": "Long before Emily Weinstein was the editor of NYT Cooking, she wrote columns about learning to cook and bake for the Food section’s long-defunct Diner’s Journal blog. This recipe, part of her penultimate baking column, comes from Sarah Black, who was credited for bringing ciabatta to New York in the early 1990s. Make sure to bake it to a very dark brown: Color is flavor here, and the deeply burnished crust makes for a fabulous end result.", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": null, "totalTime": "PT5H45M", "recipeYield": "4 small rectangular loaves, 4 inches x 8 inches", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, lunch, sandwiches", "keywords": "ciabatta bread, flour, yeast, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 89}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 220, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "0 grams", "sodiumContent": "259 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 teaspoons active dry yeast", "1 3/4 ounces hot-to-the-touch water (about 100 to 110 degrees)", "2 teaspoons iodized salt", "16 ounces unbleached bread flour", "13 ounces room-temperature water", "Vegetable oil (for coating the bowls)", "Cornmeal (for sprinkling on the baking stone)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the yeast on top of the 1 3/4 ounces of hot water to let it dissolve, and set aside. Sprinkle the salt on top of the flour and stir to incorporate. Make a well in the center of the flour — salt mixture, and add the cool water little by little."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the yeast has dissolved into the warm water, add it to the mixture, stir to incorporate, then stop and let the mixture sit for 30 minutes.  Cover the bowl with plastic wrap and write the time with permanent marker on the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 30 minutes, sprinkle flour on your work surface, then scrape the dough out onto it. Tap your hands in a little flour, then gently flatten the dough into a rectangle, with the short side facing you. Using a bench scraper, flip the top edge down to just below the center, then flip the bottom side up above the center. Do the same with each side, then turn dough over and dust off the flour. Place the folded dough in a a bowl slicked with vegetable oil and let it sit for 30 minutes, again, covered with plastic wrap with the time written on it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the dough again, using the same method as above. Place the dough in a second oiled bowl, covered with plastic, and let it ferment until it has doubled in volume, 1 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the dough is rising, preheat the oven to 475 degrees, and put a baking stone on the middle rack, and an empty pan (for water) on the bottom rack. After the dough has doubled in volume, sprinkle a little more flour onto your workspace. Then, sprinkle a lot of flour onto the back of a baking sheet. Scrape the dough out onto the counter, tap your hands in flour, and gently flatten the dough into a large, even rectangle of approximately 12” x 8” x 1” high. Use a bench scraper or a knife to cut the dough into 4 equal pieces, approximately 3” wide and 8” long. Fold each piece, top-down to center, then bottom-up to above-center, in the same way you folded the dough in step 3. Place each folded piece seam-side down on the floured baking sheet. Cover with oiled plastic wrap and let it rise for 30 to 60 minutes, or until the dough has doubled in volume."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle more flour on the counter. Take one ciabatta piece at a time and stretch it very gently to lengthen. Turn it upside-down and place back onto the back of the floured sheet tray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After all of the pieces have been stretched, sprinkle 4 tablespoons of a mixture of half cornmeal and half flour on the baking stone. Shuttle the ciabatta pieces off the sheet tray and onto the stone. To shuttle, first gently move the sheet tray back and forth to loosen the dough, then, as the pan is held above the baking stone, a quick shake up and down should help slide the dough onto the actual stone. (If you prefer, you can pick up and balance the piece of dough with two hands or even try to move it with the help of a spatula; you just want to get the loaves onto the stone.) Pour water into the pan on the bottom rack in order to make steam; you can also spritz the loaves with water. Avert your face as you pour the water and quickly close the oven door."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The dough should bake to a very dark brown in approximately 30 minutes. Let the bread cool before cutting into it."}], "link": "https://cooking.nytimes.com/recipes/1015532-ciabatta"}