{"@context": "http://schema.org", "@type": "Recipe", "name": "Savory Roasted Pumpkin Pie", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/savorypumpkinpie/savorypumpkinpie-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 slices", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, fall, pumpkin", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 78}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 454, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "5 grams", "proteinContent": "12 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1253 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["For the crust:", "1 cup whole-wheat flour", "1 teaspoon salt", "1/3 cup cold unsalted butter", "A few tablespoons cold water", "For the filling:", "2 small pie pumpkins", "3 tablespoons olive oil", "2 tablespoons unsalted butter", "3 medium yellow onions", "2 tablespoons olive oil", "1/2 cup Jarlsburg, Gruyère, or Swiss cheese, grated", "2 eggs", "1 tablespoon milk", "Salt, pepper and nutmeg", "2 tablespoons roasted pumpkin seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": " For the crust, combine flour and salt in a small bowl.  Using your fingers, pinch the butter (1/3 cup) into the flour and salt until the mixture resembles coarse meal.  Add water a little at a time until the mixture begins to clump together.  Press the dough into a disc, wrap it in plastic wrap, and keep in the refrigerator as you turn your attention to the other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " Preheat the oven to 450 degrees.  Peel the pumpkins, discard the seeds and stringy innards, and cut the flesh into 1-inch cubes.  Put the pumpkin on a baking sheet or in a Pyrex pan and toss with 1 tablespoon olive oil.  Sprinkle with salt and pepper and bake at 450 degrees for 45 minutes, or until the pumpkin is tender and slightly browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " Meanwhile, melt the butter (2 tablespoons) with the remaining 2 tablespoons olive oil in a cast iron skillet over medium heat.  Slice the onions and cook in the butter and olive oil, stirring frequently, for 45 minutes or until deep brown and fragrant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " Remove the pie dough from the refrigerator and, on a floured surface, roll the dough into as thin a circle as possible.  Fold the dough in half and then into quarters, transfer it to a 9-inch pie plate, and carefully unfold it.  Press the dough into the pie plate and trim away excess dough from the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " Remove the pumpkin from the oven and reduce the temperature to 375 degrees.  Mix together the cooked pumpkin and onions, and carefully transfer this vegetable mixture into the pie crust.  (You may find your pie crust overflowing with vegetables.  In this case, remove some of the pumpkin-onion mixture and set it aside -- it makes a great snack or omelet filling.)  Sprinkle the grated cheese on top of the vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " In a small bowl, beat together the eggs, milk, and salt, pepper, and nutmeg to taste.  Pour this mixture over the vegetables and cheese in the pie crust.  Sprinkle the pumpkin seeds on top of the pie."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " Bake the pie at 375 degrees for 20 to 25 minutes, or until the cheese is melted, the eggs are firm, and the top of the pie is golden brown.  Remove from the oven and let cool for a few minutes before serving."}]}