{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetarian Salade Niçoise", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "eggs, potato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 39}, "recipeIngredient": ["For the dressing (makes about 2 1/4 cups):", "2 tablespoons Dijon mustard", "1 tablespoon whole grain mustard", "1 1/2 cups extra-virgin olive oil", "1/3 cup white wine vinegar", "1 teaspoon dried thyme", "1 teaspoon sea salt", "2 teaspoons fresh ground black pepper", "For the salad:", "2 to 4 baby Yukon Gold potatoes", "3 cloves garlic", "5 whole black peppercorns", "1 bay leaf", "1 teaspoon dried thyme", "5 tablespoons plus 1 teaspoon sea salt", "2 large eggs", "1/4 pound haricots verts or other very small green beans", "1 1/2 large or two medium heirloom or other tomatoes", "1 heart of romaine lettuce, torn into bite-size pieces", "2 cups arugula", "3 cups baby greens", "12 niçoise olives, pitted."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the dressing: In a mixing bowl, combine Dijon mustard, whole grain mustard, olive oil, vinegar, thyme, salt and pepper. Whisk to blend, add 1/4 cup water, and whisk again. Cover and refrigerate for up to two weeks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the salad: In a medium saucepan, combine potatoes, garlic, peppercorns, bay leaf, thyme and one tablespoon of the sea salt. Cover with cold water. Place over high heat to bring to a boil, then reduce heat to low and simmer until tender, 8 to 10 minutes. Turn off heat and let stand in saucepan; do not drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the potatoes are simmering, place the eggs and two tablespoons salt in a saucepan. Cover with cold water. Place over high heat to bring to a boil, then reduce heat to low and simmer for 10 minutes. Turn off heat and let stand in saucepan; do not drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, combine 3 cups water and 1 cup ice cubes; set aside. In a small saucepan, combine 3 cups of water and 2 tablespoons salt. Bring to a boil, add green beans, and blanch until crisp-tender, 1-2 minutes. Drain, rinse under cold water, and transfer to ice water. Allow to sit for 2 minutes, then drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tomatoes into 12 irregular chunks, and sprinkle with remaining 1 teaspoon sea salt. Drain and peel the eggs, and cut each egg lengthwise into quarters. Drain the potatoes, and cut into 1/3-inch rounds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide, shallow serving bowl, mix romaine, arugula and baby greens. Add 3 tablespoons of the dressing to the greens and toss, adding additional dressing as needed. Arrange the tomatoes, eggs, potatoes and green beans around the greens, and sprinkle with olives. Drizzle with some of the remaining dressing. Refrigerate leftover dressing and reserve for another use."}]}