{"@context": "http://schema.org", "@type": "Recipe", "name": "Blueberry Crumb Cake", "description": "It’s easy to find an occasion to serve this cake — breakfast, brunch, lunch, dinner or snacktime will do. The dominant flavor here is the berries. Don’t be tempted to increase the amount of walnuts in the topping — scarcity makes them even more delightful.", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": "https://static01.nyt.com/images/2016/01/28/dining/28COOKING_BLUECRUMBLECAKE2/28COOKING_BLUECRUMBLECAKE2-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 311}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 284, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "6 grams", "sodiumContent": "210 milligrams", "sugarContent": "21 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 tablespoons unsalted butter, at room temperature", "1/4 cup  sugar", "1/3 cup (packed) light brown sugar", "1/3 cup all-purpose flour", "1/4 teaspoon salt", "1/2 cup chopped walnuts", "1 pint (2 cups) fresh blueberries (preferably fresh, or frozen, not thawed)", "2 cups plus 2 teaspoons all-purpose flour", "2 teaspoons baking powder", "1/2 teaspoon baking soda", "1/4 teaspoon salt", "1/4 teaspoon cinnamon", "1/8 teaspoon freshly grated nutmeg", "2/3 cup sugar", "Grated zest of 1/2 lemon or 1/4 orange", "3/4 stick (6 tablespoons) unsalted butter, at room temperature", "2 large eggs, at room temperature", "1 teaspoon pure vanilla extract", "1/2 cup buttermilk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Getting ready:  Center a rack in the oven and preheat the oven to 350 degrees.  Butter an 8x8-inch pan (Pyrex is great for this) and put it on a lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crumbs: Put all the ingredients except the nuts in a food processor and pulse just until the mixture forms clumps and curds and holds together when pressed.  Scrape the topping into a bowl, stir in the nuts and press a piece of plastic against the surface.  Refrigerate until needed.  (Covered well, the crumb mix can be refrigerated for about 3 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cake batter:  Using your fingertips, toss the blueberries and 2 teaspoons of the flour together just to coat the berries; set aside.  Whisk together the remaining 2 cups flour, the baking powder, soda, salt, cinnamon and nutmeg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in the bowl of a stand mixer or in another large bowl, rub the sugar and zest together with your fingertips until the sugar is moist and aromatic.  Add the butter and, with the paddle or whisk attachment, or with a hand mixer, beat the sugar with the butter at medium speed until light, about 3 minutes. Add the eggs one by one, beating for about 1 minute after each addition, then beat in the vanilla extract.  Don’t be concerned if the batter looks curdled — it will soon smooth out.  Reduce the mixer speed to low and add the flour mixture and the buttermilk alternately, the flour in 3 parts, the buttermilk in 2 (begin and end with the dry ingredients).  You will have a thick, creamy batter. With a rubber spatula, gently stir in the berries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the batter into the buttered pan and smooth the top gently with the spatula. Pull the crumb mix from the refrigerator and, working with your fingertips, break it into pieces. There’s no need to try to get even pieces — these are crumbs and they’re supposed to be lumpy and bumpy and every shape and size.  Scatter the crumbs over the batter, pressing them down ever so slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide the sheet into the oven and bake 55 to 65 minutes, or until the crumbs are golden and a knife inserted into the center of the cake comes out clean.  Transfer the cake to a rack and cool just until it is warm or until it reaches room temperature."}], "link": "https://cooking.nytimes.com/recipes/1015511-blueberry-crumb-cake"}