{"@context": "http://schema.org", "@type": "Recipe", "name": "Quesadilla With Mushroom Ragoût and Chipotles", "description": "Mushroom ragoût accepts chipotles willingly. I made a delicious and substantial quesadilla dinner with the ragoût, two tortillas and a bit of cheese in under three minutes.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/12/17/science/20recipehealth/20recipehealth-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "2 quesadillas", "recipeCuisine": "mexican", "recipeCategory": "brunch, dinner, lunch, quick", "keywords": "appetizer, main course, fall, winter, healthy, kosher, low cholesterol, low sugar, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 56}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 190, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "3 grams", "proteinContent": "9 grams", "saturatedFatContent": "4 grams", "sodiumContent": "182 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["6 tablespoons <a href=\"http://www.nytimes.com/recipes/1015828/mushroom-rago-and-ucirc-t.html\">mushroom ragoût</a>", "1 teaspoon chopped canned chipotle in adobo (more to taste)", "4 corn tortillas", "1 1/2 ounces grated Monterey Jack or Gruyère (about 1/3 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the chopped chipotles into the mushroom ragoût. Taste and add more if you want more spice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a microwave: Place a corn tortilla on a plate. Top with a heaped tablespoon of the grated cheese. Add half the mushrooms and spread in an even layer. Sprinkle another heaped tablespoon of the cheese over the mushrooms and top with another tortilla. Press down gently. Repeat with the remaining ingredients. Microwave for 1 to 1 1/2 minutes, until the cheese has melted. Remove from the microwave, cut into quarters, and serve.\n\nUsing a pan: Place a corn tortilla in a pan. Top with a heaped tablespoon of the cheese and half the mushrooms and spread in an even layer. Sprinkle on another heaped tablespoon the cheese. Turn the heat on medium-high and heat until the cheese begins to melt. Place the remaining tortilla on top of the cheese and press down lightly. Flip the quesadilla over in the pan and heat for about 30 seconds, or until the cheese has melted. Flip back over and remove to a plate. Cut into quarters or sixths, and serve. Repeat with the remaining ingredients."}], "link": "https://cooking.nytimes.com/recipes/1015832-quesadilla-with-mushroom-ragout-and-chipotles"}