{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Roasted Yellow Peppers or Red Peppers in Tomato Sauce", "description": "These roasted yellow peppers are filled with a savory mix of quinoa seasoned with garlic and parsley and tossed with Manchego or Parmesan cheese. The roasted peppers make a nice contrast in color and flavor to the sweet tomato sauce. You’ll get plenty of Vitamin C and lycopene from both the peppers and the sauce in this dish.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/10/14/science/sub14recipehealth/sub14recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch", "keywords": "bell pepper, quinoa, gluten-free, halal, healthy, high fiber, low cholesterol, low-sodium, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 149}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 307, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "6 grams", "proteinContent": "10 grams", "saturatedFatContent": "4 grams", "sodiumContent": "896 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 medium-size yellow bell peppers ", "2 tablespoons extra virgin olive oil", "2 garlic cloves, minced", "1/2 cup chopped fresh parsley", "1 1/2 cups cooked quinoa", "2 ounces Manchego cheese or Parmesan, grated (1/2 cup)", "Salt and freshly ground pepper", "1 1/2 cups marinara sauce "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the peppers over a flame, under a broiler or on a grill until uniformly charred. Place in a plastic bag or a tightly covered bowl and allow to cool. When cool enough to handle, remove all of the charred skin, rinse briefly and pat dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully cut away the stem from the peppers. Cut a slit down the side of each pepper, from the stem end to the bottom. Gently open out and remove the seeds and membranes; tip out the juice. Try to keep the peppers in one piece. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the olive oil over medium heat in a large, nonstick skillet and add the garlic. Cook, stirring, until fragrant, about 1 minute. Stir in the parsley and quinoa and mix together until the quinoa is coated with oil. Remove from the heat and stir in the cheese. Season to taste with salt and pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil a baking dish large enough to accommodate all of the peppers. One at a time, lay a pepper in the dish and fill with the quinoa mixture. I do this by gently opening up the pepper, mounding the filling onto one half, and folding the other half back over the filling, overlapping the edges slightly. Lay the peppers in the dish. Cover the baking dish with foil or a lid and bake the peppers for 20 minutes. Meanwhile, reheat the tomato sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the tomato sauce onto serving plates or a serving platter. Top with the stuffed peppers and serve."}], "link": "https://cooking.nytimes.com/recipes/1015227-stuffed-roasted-yellow-peppers-or-red-peppers-in-tomato-sauce"}