{"@context": "http://schema.org", "@type": "Recipe", "name": "Persian Herb Frittata", "description": "This beautiful, verdant Persian-style frittata is made from a recipe that at first glance looks ridiculous. It’s not the list of ingredients, which sound fresh and lovely with heaps of parsley, cilantro, scallions and lettuce. It’s the last line, Step No. 4, which calls for cooking one side of the frittata 40 minutes, then flipping it over, and cooking the other side 40 more minutes. \n\nIn the interminable 80 minutes that it cooks, several things happen. The vegetables give up their moisture, the frittata shrinks in height by two-thirds, and the outside becomes a slightly crisp, dark, golden brown — without burning.", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 large appetizers", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch", "keywords": "eggs, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 45}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 476, "unsaturatedFatContent": "34 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "6 grams", "sodiumContent": "470 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup barberries", "1 cup (about 4 ounces) chopped parsley", "1 cup (about 4 ounces) chopped cilantro", "1 cup (about 4 ounces) chopped scallions, white part only", "2/3 cups (about 6 large leaves) chopped romaine lettuce", "4 large eggs", "2 teaspoons kosher salt", "2 teaspoons black pepper", "1/2 cup walnuts, coarsely chopped", "1/2 cup olive oil", "Yogurt for serving, optional."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, soak the barberries in cold water for 20 minutes. Using a sharp knife, finely chop the parsley, cilantro, scallions and romaine lettuce; combine in a large mixing bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium mixing bowl, combine eggs, salt and pepper. Whisk just until frothy. Drain the barberries, making sure to discard any small stones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place an 11-inch skillet over medium heat. Add 1/4 cup and 2 tablespoons of the olive oil, and heat until shimmering. Add the beaten eggs, barberries and walnuts to the chopped greens. Mix well, and pour into skillet, spreading it evenly. Cover the pan, and cook until set, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover skillet and divide the frittata into four wedges, separating them from one another slightly so that the liquid from the frittata can evaporate. Reduce the heat to low, and cook uncovered until the underside is browned, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the frittata over, one wedge at a time. Drizzle remaining 2 tablespoons olive oil inside the edge of the skillet and between each wedge. Continue to cook uncovered until the underside is browned and the frittata is compact and crisp on both sides, an additional 40 minutes. Serve hot or at room temperature, with yogurt on the side, if desired."}], "link": "https://cooking.nytimes.com/recipes/1015617-persian-herb-frittata"}