{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Crumb Crostata", "description": "When I saw my mother making her apple turnover, I knew company was coming. I also knew the dough scraps would be my treat. She&rsquo;d roll them in sugar and cinnamon, bake them and we&rsquo;d enjoy the flaky, light, buttery morsels together with a cold glass of milk. My mom&rsquo;s specialty was that apple turnover. Mine, apple crostata. I love its organic shape, and fact that it doesn&rsquo;t require a dish or pie pan. And because the crostata is baked directly on a sheet pan, it retains its flakiness better than a pie.", "author": {"@type": "Person", "name": "Claudia Fleming"}, "image": "https://static01.nyt.com/images/2015/11/02/dining/apple-crostata/apple-crostata-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "apple, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 304}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 418, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "12 grams", "sodiumContent": "129 milligrams", "sugarContent": "25 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 cups all-purpose flour", "1 tablespoon sugar", "1/2 teaspoon salt", "1/2 cup (1 stick) unsalted butter, chilled and cut into small pieces", "1/3 cup ice cold water, more as needed", "1 egg, beaten", "Raw sugar, for garnish", "6 to 8 Granny Smith or other tart apples, peeled and cut into 16 slices each (about 6 cups total)", "1/4 cup brown sugar", "1 teaspoon cornstarch", "1/4 teaspoon ground cinnamon", "1/4 teaspoon lemon zest", "1/4 teaspoon vanilla extract", "1/4 cup granulated sugar", "1 1/2 cups all-purpose flour", "1/4 cup brown sugar", "1/4 teaspoon ground cinnamon", "1/2 cup (1 stick) unsalted butter, melted and cooled to room temperature", "Bacon toffee, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Combine flour, sugar, and salt in a food processor and blend for 5 seconds. Add butter, pulsing, until mixture resembles small peas. Add ice water and continue to pulse until mixture comes together in moist clumps; if mixture is too dry add a bit more water a tablespoon at a time. Gather dough into a ball, flatten into a disc, wrap in plastic and chill for at least 1 hour or freeze for up to a month. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a large bowl toss together  sliced apples, brown sugar, cornstarch, cinnamon, zest and vanilla. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crumble: In a medium bowl, mix together granulated sugar, flour, brown sugar, and cinnamon. Drizzle in melted butter and, using a fork, stir until mixture is crumbly and all the flour is incorporated; the crumbs should be smaller than 1 inch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees and line a baking sheet with parchment paper. Remove dough from refrigerator and let sit at room temperature for 10 to 15 minutes. On a lightly floured surface, roll the dough into a 14-inch circle. Transfer to baking sheet and chill until firm, about 15 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove baking sheet from refrigerator and let soften for 1 to 2 minutes. Arrange filling evenly in the center of the dough, leaving a 4-inch border all around; reserve the juices. Brush exposed dough border with beaten egg and fold edge in up over fruit, making pleats every 2 inches. Pour remaining juices over exposed fruit, brush the folded outer edge with beaten egg, and sprinkle with raw sugar. Cover exposed fruit with about 1 cup crumble."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake crostata until crust is golden brown and filling is bubbling, about 40 to 50 minutes. Remove and let cool before serving. Serve with <a href=\"http://www.nytimes.com/recipes/1015739/bacon-toffee.html\">bacon toffee sauce</a>, if desired."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Claudia Fleming's Apple Crumb Crostata", "description": "When Claudia Fleming was at Gramercy Tavern, she was known for her all-American desserts. Mark Bittman invited her to share her Thanksgiving specialty: apple crumb crostata with bacon toffee.", "thumbnailUrl": "https://static01.nyt.com/images/2015/11/02/dining/apple-crostata/apple-crostata-mediumThreeByTwo440.jpg", "uploadDate": "2013-11-15T20:39:37.000Z", "duration": "PT3M5S"}}