{"@context": "http://schema.org", "@type": "Recipe", "name": "Preserved Crushed Tomatoes", "description": "Preserved summer tomatoes are a sort of pantry insurance policy: you'll have captured a bright tomato flavor to add to your cooking for the remainder of the year. Use these crushed tomatoes as you would the canned kind you buy at the store, in jambalaya (<a href=\"http://cooking.nytimes.com/recipes/6679-shrimp-jambalaya\">Pierre Franey's shrimp jambalaya recipe</a> is a good start), tomato soup (<a href=\"http://cooking.nytimes.com/recipes/1015865-tomato-bisque-with-fresh-goat-cheese\">this unusual version</a> incorporates fresh goat cheese) or pasta sauce (like this <a href=\"http://cooking.nytimes.com/recipes/11518-zappa-family-spaghetti-sauce\">spaghetti sauce</a>, Kim Severson's family recipe). You’ll need four or five quart-sized jars (32 ounces each) or eight or 10 pint-sized ones (16 ounces each); when the time comes to use the purée, simply open a jar and use the purée as you would the store-bought stuff.", "author": {"@type": "Person", "name": "Cathy Barrow"}, "image": "https://static01.nyt.com/images/2013/09/11/dining/11TOMATO/11TOMATO-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "4 to 5 quart-sized jars, or 8 to 10 pint-sized jars", "recipeCuisine": "", "recipeCategory": "", "keywords": "summer, tomato, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 18, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "5 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["8 pounds ripe firm red tomatoes (10 to 12, depending on size)", "Lemon juice, bottled lemon juice or citric acid", "Salt (kosher, pickling or fine sea salt only), optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Cut an X in the base of each tomato. Gently drop tomatoes into water. When they bob to the surface, remove and place in an ice bath."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a rack in a large stockpot or line pot with a folded kitchen towel, then fill it with water and bring to a boil. Add quart or pint jars and boil for 10 minutes. Jars may be left in warm water until ready to fill. Alternatively, sterilize jars by running them through a dishwasher cycle, keeping them warm in the machine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place canning rings in a small saucepan, cover with water and bring to a boil. Turn off heat and add flat lids to soften their rubber gaskets. Rings and lids may be left in water until jars are filled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and core tomatoes and scoop out gel and seeds. With your hands, tear and crush tomatoes into a large nonreactive pot. After adding a few tomatoes, bring them to a brisk boil, crushing further with a potato masher or the back of a large spoon. (This will keep tomatoes and juice from separating in the jar.) Continue to add crushed tomatoes, maintaining a bubbling, brisk boil. When they are all added, boil for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle hot tomatoes into warm jars, leaving a little more than 1/2 inch head space to accommodate lemon juice. If using citric acid, fill to 1/2 inch head space. Into every quart jar, add 2 tablespoons lemon juice or 1/2 teaspoon citric acid. For pints, use 1 tablespoon lemon juice or 1/4 teaspoon citric acid. If using salt, add 1 teaspoon to each quart or 1/2 teaspoon to each pint."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe jar rims clean with a damp towel. Place lids on jars, screw on rings and lower jars upright into the pot of boiling water. Return to a full boil and process for 45 minutes for quarts or 35 minutes for pints. If there are both in the pot, process for the longer time. Transfer jars to a folded towel and cool for 12 hours. Jars will ping as they seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cool, test seals by removing rings and lifting jars by their flat lids. If a seal has formed, lids will stay tight. Unsealed jars should be refrigerated and used within a week or reprocessed. Rings and jars may be reused, but a new flat lid must be used each time."}], "link": "https://cooking.nytimes.com/recipes/1015089-preserved-crushed-tomatoes"}