{"@context": "http://schema.org", "@type": "Recipe", "name": "Dark ’n’ Stormy", "description": "The dark ’n’ stormy has become a cult highball due to a felicitous combination of its no-fault simplicity and the balance of its exotic, headstrong ingredients, each of which is perfectly suited to the common goal: reviving the flagging, heat-pummeled constitution. It is simply dark rum — very dark rum — with ginger beer and some fresh lime. The rich spirit is shaken awake by the buoyant piquancy of the ginger beer, while the lime slashes through the sweetness of both. The drink has its roots in Bermuda, and emigrated up the Atlantic seaboard with the sailing set. Gosling’s rum has a rather sniffy and debatable lock on the recipe, having in fact trademarked its version, even going to the point of threatening with the specter of litigation anyone who might suggest concocting one with another rum. Gosling’s is a delicious rum, and being the dark rum from Bermuda, it is unquestionably synonymous with the dark ‘n’ stormy. But, any number of dark rums are interchangeably lovely in this drink, including Coruba, Zaya, Cruzan’s Blackstrap and the Lemon Hart 151 from Guyana.", "author": {"@type": "Person", "name": "Toby Cecchini"}, "image": "https://static01.nyt.com/images/2014/04/23/dining/Dark-n-Stormy/Dark-n-Stormy-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "brunch, easy, cocktails", "keywords": "ginger beer, lime juice, rum", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 57}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 110, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "0 grams", "proteinContent": "0 grams", "saturatedFatContent": "0 grams", "sodiumContent": "9 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["2 ounces dark rum", "1/2 ounce fresh-squeezed lime juice", "1/2 ounce simple syrup, or to taste", "4-6 ounces fresh ginger beer."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Build the drink in a highball glass filled with ice, adjusting for sweetness and tartness. Depending on when you stop the fermentation of the ginger beer, it may be fully dry or still retain enough sweetness that additional simple syrup is unnecessary. Garnish with a wedge of lime. Serves 1."}], "link": "https://cooking.nytimes.com/recipes/1015320-dark-n-stormy"}