{"@context": "http://schema.org", "@type": "Recipe", "name": "Bobby Flay's Chicken With Roquefort", "description": "This recipe came to us from Bobby Flay in advance of the opening of his restaurant Gato. The chicken gets a jolt of flavor not only from the cheese but also from a honey and sherry vinegar gastrique, basically a sauce made from caramelized sugar or another sweet ingredient like the honey, deglazed with vinegar and then reduced.  ", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2014/01/14/dining/recipes-ovenblisteredchicken/recipes-ovenblisteredchicken-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "cheese, chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 360}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 678, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "0 grams", "proteinContent": "40 grams", "saturatedFatContent": "21 grams", "sodiumContent": "747 milligrams", "sugarContent": "17 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/4 cup clover honey", "1/2 cup aged sherry vinegar", "Kosher salt and ground black pepper", "8 tablespoons (1 stick) unsalted butter at room temperature", "1/4 cup crumbled Roquefort cheese at room temperature", "4 skin-on boneless chicken breasts, 8 ounces each", "2 tablespoons canola oil", "4 sprigs fresh rosemary, plus more for garnish."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Put honey in a small saucepan and cook over medium-low heat until lightly golden brown, about 5 minutes. Add vinegar and cook until reduced and thickened, about 15 minutes. This sweet deglazed sauce is called a gastrique. Season to taste with salt and pepper. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the butter and blue cheese in a small bowl until well blended, and season to taste with salt and pepper. Using your fingers, gently loosen the skin from the chicken breasts and stuff about 1 heaping tablespoon of the blue cheese butter under the skin of each breast, smoothing the skin to evenly distribute the butter over the surface of the breast meat. Season both sides of the chicken with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in large ovenproof sauté pan over medium heat until it begins to shimmer. Put chicken in the pan, skin-side down, and cook until fat renders and skin is golden brown and crispy, about 5 minutes. Turn chicken and add four rosemary sprigs to pan. Place in oven and roast until breasts are just cooked through, about 5 minutes longer. Remove pan from oven and heat broiler. Spread the remaining butter over the tops of each breast and place under the broiler until golden brown and blistered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove each breast to a plate, spoon some of the pan drippings over each breast and immediately drizzle with some of the gastrique. Garnish with rosemary."}], "link": "https://cooking.nytimes.com/recipes/1015956-bobby-flays-chicken-with-roquefort"}