{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Lobster Pasta", "description": "This dish is a little fiddly, but it is well worth the effort, and much of the prep can be done ahead. The sauce is rich with the essence of lobster, balanced with a good kick of hot pepper. It needs a good chewy pasta like bucatini or thick spaghetti.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/01/15/dining/15kitch/15kitch-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas", "keywords": "lobster, pasta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 194}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 984, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "101 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "8 grams", "proteinContent": "75 grams", "saturatedFatContent": "12 grams", "sodiumContent": "1705 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 lobsters, 1 1/2 pounds each", "2 tablespoons butter", "1 small carrot, chopped", "1 celery rib, chopped", "1 bay leaf", "A few thyme sprigs", "2 tablespoons olive oil", "1 small onion, finely diced", "4 garlic cloves, minced", "1/2 teaspoon hot red pepper flakes (pepperoncino)", "Salt and pepper", "1/2 cup white wine", "2 cups tomato purée", "1/2 cup heavy cream", "1 pound bucatini pasta, or other firm-textured dry pasta", "3 tablespoons chopped parsley", "1 teaspoon lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam or boil lobsters for 6 minutes. Cool to room temperature under running water. Separate claws and tails from lobster heads. Remove tail meat from shell. Pull away black vein and discard, then cut meat into 1/2-inch slices and set aside. Crack claws with mallet, without removing meat, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a large knife, split lobster heads in half lengthwise. Remove and discard stomach sacks located just behind eyes (remove green tomalley also if you wish) and roughly chop tail shell. Heat butter in a wide saucepan or skillet over medium high heat. Add heads and shells, with any collected juices, and sauté for about 1 minute. Add carrot, celery, bay leaf and thyme and cook, stirring, for 1 minute more. Add 3 cups water and simmer rapidly for about 10 minutes to reduce by half. Strain, discarding shells, herbs and vegetables. You should yield 1 1/2 cups rich lobster broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe pan with paper towel and return to stovetop over medium-high heat. Warm the olive oil, then add diced onion, garlic and hot pepper flakes. Season generously with salt and pepper. Cook, stirring, until onions are completely soft, about 10 to 15 minutes. Take care not to let onion mixture brown. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wine and simmer rapidly for 2 minutes, then add tomato purée and lobster broth. Simmer for 5 minutes, then add cream and simmer until sauce has thickened somewhat, about 5 minutes more. Turn off heat and adjust seasoning (it should be spicy). You can prepare up to this point several hours in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to a boil. Add pasta and cook until al dente. Reheat sauce, add cracked lobster claws and simmer for 2 minutes. Add sliced lobster meat and cook for a minute or less, until just heated through. Mix parsley and lemon zest together. Drain pasta and add to sauce, tossing to coat noodles and distribute lobster meat, then transfer to a warm bowl or platter. Arrange one claw on top of each serving and sprinkle with parsley mixture."}], "link": "https://cooking.nytimes.com/recipes/1015941-spicy-lobster-pasta"}