{"@context": "http://schema.org", "@type": "Recipe", "name": "Steamed Whole Fish With Ginger and Sesame", "description": "Steaming a whole fish is an excellent, and speedy, way to cook. The fish here, dabbed with ginger and a few other aromatics, is transformed by the process, and delivers a sweet, near-melting succulence. The pan juices are the only sauce necessary. A traditional bamboo steamer is great to have, but any sizable steamer will work, or you can rig up a steamer using a large pot. Make sure that the makeshift rack sits an inch or so above the boiling water, and that the pot has a lid.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/09/04/dining/04KITCH3_SPAN/04KITCH3_SPAN-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fish, ginger, sesame oil, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 204}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 414, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "2 grams", "proteinContent": "65 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1015 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 whole fish, like black sea bass or red snapper, about 1 1/2 pounds each, gutted and scaled by a fishmonger", "Salt and pepper", "2 tablespoons Chinese sweet wine or dry sherry", "2 tablespoons soy sauce", "2 tablespoons grated ginger", "3 garlic cloves, minced", "1 tablespoon chile bean paste, available in a Chinese grocery", "1 teaspoon sesame oil, more for dressing", "2 teaspoons vegetable oil", "2 bunches scallions, cut in 3-inch lengths", "1 bunch cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse fish with cold water, pat dry and season inside and out with salt and pepper. Place both fish on a heatproof platter or shallow baking dish. (Dish must be slightly smaller than inside dimensions of steamer.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together sweet wine, soy sauce, ginger, garlic, chile bean paste and 1 teaspoon sesame oil. Pour over fish and let marinate, turning once, for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up steamer with 3 inches of water in the bottom, then set rack 1 inch over water. Bring water to a rapid boil. Place fish, still on platter with marinade, on rack and cover with lid. (If using a bamboo steamer, cover top with a dish towel to retain steam.) Steam fish for 10 to 12 minutes, until just done. Flesh should look opaque, and there should be no pink at the bone when probed gently with a paring knife. Carefully remove platter from steamer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place a skillet or wok over high heat and add vegetable oil. When oil looks hazy, add scallions and toss to coat. Sprinkle lightly with salt and stir-fry until slightly charred, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, scatter scallions over fish and top liberally with cilantro sprigs. (To make a tastier cilantro garnish, dress sprigs lightly with sesame oil and salt.) Using 2 forks, serve top fillet from carcass. Remove and discard skeleton to reveal lower fillet. Give each diner some fish, scallions and cilantro. Spoon pan juices over each serving."}], "link": "https://cooking.nytimes.com/recipes/1015025-steamed-whole-fish-with-ginger-and-sesame"}