{"@context": "http://schema.org", "@type": "Recipe", "name": "Butternut Squash and Purple Potato Latkes", "description": "Purple potatoes add a bit of color and some extra nutrients but regular white potatoes work, too. \nOf course you can use white potatoes for these, but I loved the idea of the color combo when I created the recipe. The purple doesn’t show up so much once you have browned the latkes but the anthocyanins in the potatoes are still there.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/11/26/science/26recipehealth/26recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "About 20 to 24 latkes, serving 6", "recipeCuisine": "eastern european", "recipeCategory": "brunch, dinner", "keywords": "appetizer, side dish, dairy-free, halal, healthy, kosher, low sugar, nut-free, vegetarian, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 54}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 224, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "3 grams", "sodiumContent": "407 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 medium onion, grated\n", "3 cups grated butternut squash (1 small squash)", "3 cups grated purple potatoes", "3 tablespoons chopped or slivered fresh sage (more to taste)", "Salt and freshly ground pepper", "1 teaspoon baking powder", "3 tablespoons oat bran", "1/4 cup all-purpose flour or cornstarch", "2 eggs, beaten", "About 1/4 cup canola, grape seed or rice bran oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Place a rack over a sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the grated onion in a strainer set over a bowl while you prepare the other ingredients. Then wrap in a dishtowel and squeeze out excess water, or just take up by the handful to squeeze out excess water. Place in a large bowl and add the squash, potatoes, sage, baking powder, salt and pepper, oat bran, and flour or cornstarch. Add the eggs and stir together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large heavy skillet over medium-high heat. Add 2 to 3 tablespoons of the oil and when it is hot, take up heaped tablespoons of the latke mixture, press the mixture against the spoon to extract liquid (or squeeze in your hands), and place in the pan. Press down with the back of the spatula to flatten. Repeat with more spoonfuls, being careful not to crowd the pan. In my 10-inch pan I can cook 4 at a time without crowding; my 12-inch pan will accommodate 5.  Cook on one side until golden brown, about 3 minutes. Slide the spatula underneath and flip the latkes over. Cook on the other side until golden brown, another 2 to 3 minutes. Transfer to the rack set over a baking sheet and place in the oven to keep warm. The mixture will continue to release liquid, which will accumulate in the bottom of the bowl. Stir from time to time, and remember to squeeze the heaped tablespoons of the mix before you add them to the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot topped with low-fat sour cream, Greek style yogurt or crème fraiche."}], "link": "https://cooking.nytimes.com/recipes/1015733-butternut-squash-and-purple-potato-latkes"}