{"@context": "http://schema.org", "@type": "Recipe", "name": "White Peach Purée", "description": "Puréeing fresh white peaches, a main ingredient in Bellinis, the signature Venetian drink, creates a perfect simulacrum between baby food and wallpaper paste — a dull, brownish pap with a smattering of bright pink rags scattered through it. Worse yet, this dubious pudding begins almost immediately to oxidize, turning into a brown-gray of even less distinction. But add a splash of lemon juice and something much better happens. The lemon leaches the brilliant pink hue from the skins of the peach and incorporates it into the whole, brightening the mix, amplifying the aroma and transforming it all into the very manna you’d want from this fruit.", "author": {"@type": "Person", "name": "Toby Cecchini"}, "image": null, "totalTime": "PT10M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "easy, non-alcoholic drinks, sauces and gravies", "keywords": "peach, simple syrup", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 190, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "13 milligrams", "sugarContent": "44 grams", "transFatContent": null}, "recipeIngredient": ["8 cups/2 liters/roughly 2 1/2 pounds ripe white peaches (buy them hard and leave them out at room temp for a couple of days until they reach proper ripeness.)", "4 ounces fresh lemon juice", "3 ounces rich simple syrup (2 cups sugar to 1 cup hot water, stir to dissolve)."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash and quarter peaches, keeping the skin on. In a blender, purée all ingredients together for a couple of minutes, until consistent and without lumps. Strain through a fine sieve or chinois, working the purée through with a large spoon by scraping the inside of the sieve back and forth to allow the sediment to open up. It can be frozen at this point or covered and refrigerated for up to a week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "You may use the purée as is for Bellinis or turn it into a sorbet by using roughly a liter of it in an ice cream maker."}], "link": "https://cooking.nytimes.com/recipes/1015310-white-peach-puree"}