{"@context": "http://schema.org", "@type": "Recipe", "name": "Outdoor Fried Chicken for a Crowd", "description": "Chicken thighs are cooked in two stages in this recipe, which was designed to be made outdoors on a propane burner. First, you fry the chicken to render the fat from the skin and get it beautifully browned. Then you put it in a low oven to finish cooking it all the way through. Not only does this result in more-tender chicken, but but it also makes for a much more relaxed and low-key approach.", "author": {"@type": "Person", "name": "John Willoughby"}, "image": "https://static01.nyt.com/images/2013/12/04/dining/04FRY1_SPAN/04FRY1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "12 to 15 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, lunch", "keywords": "chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 46}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1149, "unsaturatedFatContent": "72 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "95 grams", "fiberContent": "4 grams", "proteinContent": "49 grams", "saturatedFatContent": "17 grams", "sodiumContent": "867 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["8 pounds (about 21) bone-in, skin-on chicken thighs", "About 1 quart buttermilk", "3/4 cup loosely packed rubbed sage leaves", "1/4 cup Old Bay seasoning", "1 tablespoon kosher salt", "1/3 cup freshly cracked black pepper", "2 cups all-purpose flour", "1 tablespoon baking powder", "3 cups vegetable oil", "3 strips thick-cut bacon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put thighs in a large roasting pan or other flat pan that will hold them all in a single layer. Add buttermilk to cover, cover pan tightly with plastic wrap, and refrigerate for at least 12 hours and up to 24, turning once or twice. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 250 degrees. Combine sage, Old Bay, salt and pepper; mix well. Remove thighs from buttermilk, drain, then sprinkle on both sides with spice mix, rubbing lightly to make sure it adheres. Put flour and baking powder in a big paper bag and shake to mix. Working in batches, add about a third of the thighs and shake to coat with flour mixture; remove thighs from bag and repeat with next 2 batches. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put vegetable oil and bacon in a 20-inch skillet. Set skillet over high flame; keep an eye on the thermometer because you want to be ready to fry when oil hits about 370 degrees. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When oil is up to heat, remove bacon and drain it to eat later. Shake excess flour off 1 thigh and add thigh to oil; there should be intense bubbling. Shake excess flour off half the remaining thighs and add them to pan, skin side down; oil should come about halfway up sides of thighs. Cook until golden brown on the side facing down, about 7 to 9 minutes. Flip over and cook until golden brown on the second side, another 5 to 7 minutes. Remove and drain on a paper towel. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow oil to come back up to 370 degrees and repeat with remaining thighs. They may take 1 to 2 minutes less per side to brown. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put browned thighs in a roasting pan or a large sheet pan and cook in oven until cooked through with no trace of pink, about 30 minutes. Remove from oven and serve warm, or wait up to 2 hours and serve at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1015768-outdoor-fried-chicken-for-a-crowd"}