{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Short Ribs in Plum Sauce", "description": "A pressure cooker can take an afternoon's project and turn it into a dinner-in-an-hour affair. Case in point: These short ribs, adapted from the cookbook author Lorna Sass, would have required a few hours on the stove. Here they can be made in a fraction of the time.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "balsamic vinegar, leek, pressure cooker, short ribs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 311}, "recipeIngredient": ["4 pounds meaty short ribs, excess fat removed", "1 1/2 cups chicken or beef broth", "1 cup coarsely chopped leeks (green parts included) or onions", "1 tablespoon balsamic vinegar, plus more if needed", "2 tablespoons Japanese soy sauce", "1 1/4 cups tightly packed pitted prunes", "4 to 6 large Yukon Gold potatoes, washed and left whole", "1 to 1 1/2 tablespoons grated fresh ginger", "Salt and freshly ground pepper", "1/4 cup thinly sliced scallions, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim excess surface fat from the ribs. In a 6-quart or larger pressure cooker, combine broth, leeks and vinegar. Pour 2 tablespoons of soy sauce onto a large plate, and turn the meat in it to coat thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place meat in the cooker with any unabsorbed soy sauce. Scatter prunes\naround the sides; distribute the potatoes on top. Lock lid in place. Over high heat, bring to high pressure. Reduce heat just enough to maintain high pressure. Cook for 30 minutes. Turn off heat and allow pressure to decrease naturally, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove lid, tilting it away from you to allow the steam to escape. Remove\npotatoes, and set aside. The ribs should be fork tender. If not, simmer with lid ajar until done. Transfer meat to a platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the broth, and degrease in a fat separator or refrigerate overnight. Discard congealed fat. Return broth and solids to the cooker. To thicken the sauce and intensify the taste, boil over high heat, stirring often, until syrupy, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add more vinegar, if needed, to balance the sweetness and intensify the\nflavors. Stir in ginger to taste. Adjust seasonings with salt and pepper. Quarter\nthe potatoes, and return them and the meat to the cooker to reheat and coat\nwith sauce. Transfer to a platter or individual plates, and garnish with scallions.\nServe any extra sauce on the side."}]}