{"@context": "http://schema.org", "@type": "Recipe", "name": "French Yogurt Cake With Marmalade Glaze", "description": "In France, this cake is usually served with a little sweetened crème fraiche, but it lends itself to other toppings as well. Fresh soft fruit, like sliced peaches or plums, is a natural with this as is berries with a touch of sugar. And, because the cake is plain and just a little tangy from the yogurt, it pairs happily with lemon cream, curd or mousse and is delicious with chocolate mousse or chocolate sauce.", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": "https://static01.nyt.com/images/2016/01/28/dining/28COOKING_YOGURTCAKE2/28COOKING_YOGURTCAKE2-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 296}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 342, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "162 milligrams", "sugarContent": "26 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup all-purpose flour", "1/2 cup ground almonds (or, if you’d prefer, omit the almonds and use another 1/2 cup all-purpose flour)", "2 teaspoons baking powder", "Pinch of salt", "1 cup sugar", "Grated zest of 1 lemon", "1/2 cup plain yogurt", "3 large eggs", "1/4 teaspoon pure vanilla extract", "1/2 cup flavorless oil, such as canola or safflower", "1/2 cup lemon marmalade, strained, for glazing the top (optional)", "1 teaspoon water, for glazing the top (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Getting ready: Center a rack in the oven and preheat the oven to 350 degrees.  Generously butter an 8 1/2-x-4 1/2-inch loaf pan, place the pan on a lined baking sheet and set aside. Whisk together the flour, ground almonds, if you’re using them, baking powder and salt and keep near by as well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the sugar and zest in a medium bowl and, working with your fingertips, rub the zest into the sugar until the sugar is moist and aromatic. Add the yogurt, eggs and vanilla to the bowl and whisk vigorously until the mixture is very well blended. Still whisking, stir in the dry ingredients, then switch to a large rubber spatula and fold in the oil. You’ll have a thick, smooth batter with a slight sheen.  Scrape the batter into the pan and smooth the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide the baking sheet into the oven and bake 35 to 40 minutes for the round cake or 50 to 55 minutes, or until the cake begins to come away from the sides of the pan; it will be golden brown and a knife inserted into the center of the cake will come out clean. Transfer the pan to a rack, cool for 5 minutes, then run a blunt knife between the cake and the sides of the pan. Unmold and cool to room temperature right-side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the glaze: Put the marmalade in a small pot or a microwave-safe bowl, stir in the teaspoon of water and heat (on the range or in the microwave oven) until the jelly is hot and liquefied. Using a pastry brush, gently brush the cake with the glaze."}], "link": "https://cooking.nytimes.com/recipes/1015559-french-yogurt-cake-with-marmalade-glaze"}