{"@context": "http://schema.org", "@type": "Recipe", "name": "Panzanella With Crisp Chicken Skin", "description": "This Tuscan bread salad uses leftover roast chicken to make an amazing one-bowl meal. Instead of simply shredding chicken meat and skin and tossing it with tomatoes and bread, spend an few extra minutes crisping up the skin first. It’s a huge reward for the effort. The skin goes from floppy to crunchy and almost baconlike.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/09/24/dining/24dinner/24dinner-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, quick, salads and dressings", "keywords": "bread, chicken", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 81}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 547, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "3 grams", "proteinContent": "26 grams", "saturatedFatContent": "8 grams", "sodiumContent": "670 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 pounds very ripe tomatoes; a mix of varieties and colors is nice", "2 garlic cloves, peeled and smashed", "3/4 teaspoon kosher sea salt, more to taste", "6 tablespoons plus 1 teaspoon olive oil, more as needed", "1 tablespoon lemon juice", "1/2 teaspoon Dijon mustard", "Freshly ground black pepper, to taste", "2 cups leftover or rotisserie chicken including some skin (about 1/2 chicken)", "1 tablespoon capers, drained and patted dry", "1 6-inch length of ciabatta or baguette (about 4 ounces), preferably stale, cut into 1-inch cubes", "3 sprigs fresh thyme or 2 sprigs fresh oregano", "Chopped fresh basil, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut tomatoes into bite-sized pieces and transfer to a large bowl. Using a large chef’s knife, mince 1 of the smashed garlic cloves. Add a pinch of salt and using the flat side of your knife, smash into a fine paste. Add garlic paste to the tomatoes along with 1/4 teaspoon salt and 1 tablespoon olive oil. Toss to coat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine the lemon juice, mustard, 1/4 teaspoon salt and black pepper to taste. While whisking constantly, slowly drizzle in 3 tablespoons olive oil until the mixture is thickened. Remove the skin from the chicken, shred the meat and combine with the vinaigrette. Roughly chop the chicken skin and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 10-inch skillet over high heat, add 1 teaspoon olive oil. When oil is shimmering, add the chicken skin and capers. Cook while stirring occasionally until the skin is crisp and the capers are beginning to brown, about 4 minutes. Transfer to a plate lined with paper towels to drain any excess oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pan over medium heat, add 2 tablespoons olive oil, bread cubes, the remaining smashed garlic clove, 1 sprig of fresh thyme or 1 sprig of fresh oregano and 1/4 teaspoon salt. Cook while stirring occasionally until toasted and golden, about 5 minutes. Remove from the heat and cool completely. When cool, discard the garlic and thyme and add bread cubes to the tomato mixture. Add the leaves of the remaining uncooked thyme or oregano, the shredded chicken and toss to combine. Transfer to a platter or individual plates and serve garnished with the capers, chicken skin, chopped basil, and freshly ground black pepper."}], "link": "https://cooking.nytimes.com/recipes/1015153-panzanella-with-crisp-chicken-skin"}