{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Cranberry Slab Pie", "description": "A slab pie is nothing more than a regular pie writ large. Baked in a 9-x-13-inch pan, this pie feeds 24 but is easier to make (and to carry) than 3 separate pies. The filling was inspired by an e-mail from Pete Wells, our restaurant critic, who mused about his ideal Thanksgiving dessert; the brown sugar, ginger and rum give it a complex and more autumnal flavor than most apple pies. Serve with whipped crème fraîche and small glasses of good, aged rum. (Don't let making your own pie crust intimidate you: our <a href=\"http://cooking.nytimes.com/guides/how-to-make-pie-crust\">pie guide</a> has everything you need to know.)", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/11/04/dining/apple-cranberry-slab-pie/apple-cranberry-slab-pie-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "18 to 24 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 464}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 430, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "11 grams", "sodiumContent": "279 milligrams", "sugarContent": "39 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 3/4 cups all-purpose flour (450 grams)", "1 teaspoon fine sea salt (6 grams)", "3 sticks plus 6 tablespoons butter, preferably a high-fat, European-style butter, chilled and cut into 1/2-inch pieces (15 ounces/425 grams)", "6 to 8 tablespoons ice water, more as needed", "6 3/4 pounds apples, preferably a mixture of Gala, Golden Delicious and Granny Smith, peeled, cored and sliced 1/4-inch thick (21 cups/about 3 kilograms)", "1 1/2 packed cups light brown sugar (300 grams)", "3/4 cup maple syrup", "1 cup dried cranberries (150 grams)", "6 tablespoons instant tapioca (75 grams)", "3 tablespoons dark rum", "1 1/2 teaspoons finely grated lemon zest (3 grams)", "2 tablespoons lemon juice", "1 tablespoon grated fresh ginger (18 grams)", "1 1/4 teaspoons fine sea salt (9 grams)", "2 1/4 teaspoons ground cinnamon (6 grams)", "3/4 teaspoon grated nutmeg", "2 tablespoons unsalted butter, diced small (1 ounce/28 grams)", "1 large egg, lightly beaten", "1 tablespoon heavy cream", "1 1/2 tablespoons Demerara sugar (20 grams)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: In a food processor, briefly pulse together flour and salt. Add butter and pulse until mixture forms chickpea-size pieces. Add ice water, 1 tablespoon at a time, and pulse until mixture is just moist enough to hold together. Form dough into two balls, one about 2/3 of dough and the other the remaining 1/3 of dough. Wrap each with plastic and flatten into disks. Refrigerate at least 1 hour and up to 2 days before rolling out and baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly flour a work surface and remove the plastic wrap from the larger dough ball. Using a lightly floured rolling pin, roll out the dough ball to a 12-by-16-inch rectangle, dusting with flour if dough sticks. (Leave smaller dough ball in the fridge.) Transfer rolled-out dough to a 9-by-13-inch baking dish. Carefully line the pan with dough, pressing it into bottom of pan and completely up the sides. Crimp the top edges. Chill dough in fridge until ready to fill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out remaining dough ball to a 10-by-13-inch rectangle, dusting with flour if dough is sticking. Using a decorative cookie cutter (like apples, leaves or hearts), cut out dough shapes. Reroll scraps if necessary to use up as much dough as possible. Transfer cutouts to a small baking sheet. Return baking pan and sheet to refrigerator to chill while you prepare filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Arrange a wire rack in the lowest position in the oven. Place a large rimmed baking sheet on the floor of the oven to preheat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a large bowl, combine apples, sugar, maple syrup, cranberries, tapioca, rum, lemon zest and juice, ginger, salt, cinnamon and nutmeg. Let mixture stand 10 minutes. Pour filling into bottom pie crust and dot with 2 tablespoons diced butter. Arrange dough cutouts on top of apple mixture, overlapping it slightly and making sure several cutout edges touch sides of pan. Whisk together egg and cream. Brush over crust; sprinkle with Demerara sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Move rimmed baking sheet from oven floor to lowest rack. Place pie pan on baking sheet and bake for 20 minutes. Reduce oven temperature to 375 degrees. Continue baking until crust is golden brown and juices are bubbling thickly, 40 to 60 minutes longer. Loosely tent top of pie with foil if crust browns before filling is ready. Transfer pie to a wire rack to cool completely before serving."}], "link": "https://cooking.nytimes.com/recipes/1015423-apple-cranberry-slab-pie"}