{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Carrot, Parsnip and Potato Latkes", "description": "Indian flavors add a new dimension to potato latkes. \nI love the Indian flavors in these irresistible latkes. The heat comes from the chiles, the spice from the nigella seeds.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/11/26/science/25recipehealth/25recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Makes 2 to 2 1/2 dozen, serving 6", "recipeCuisine": "", "recipeCategory": "brunch, dinner", "keywords": "appetizer, side dish, dairy-free, halal, healthy, kosher, nut-free, vegetarian, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 51}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 60, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "2 grams", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "128 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cups, tightly packed, mixed grated carrots and parsnips (about 1 pound)", "3 cups grated potatoes (use a starchy potato like Idaho or Yukon gold)", "1 teaspoon baking powder", "Salt and freshly ground pepper to taste", "2 serrano chiles or 1 jalapeño, minced (seeded if desired)", "1/2 cup chopped cilantro", "1 tablespoon nigella seeds", "1/4 cup chopped chives", "1/4 cup all-purpose flour or cornstarch", "2 eggs, beaten", "About 1/4 cup canola, grape seed or rice bran oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Place a rack over a sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl mix together the carrots and parsnips, potatoes, baking powder, salt and pepper, chiles, cilantro, nigella seeds, chives, and flour or cornstarch. Add the eggs and stir together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large heavy skillet over medium-high heat. Add 2 to 3 tablespoons of the oil and when it is hot, take up heaped tablespoons of the latke mixture, press the mixture against the spoon to extract liquid (or squeeze in your hands), and place in the pan. Press down with the back of the spatula to flatten. Repeat with more spoonfuls, being careful not to crowd the pan. In my 10-inch pan I can cook 4 at a time without crowding; my 12-inch pan will accommodate 5.  Cook on one side until golden brown, about 3 minutes. Slide the spatula underneath and flip the latkes over. Cook on the other side until golden brown, another 2 to 3 minutes. Transfer to the rack set over a baking sheet and place in the oven to keep warm. The mixture will continue to release liquid, which will accumulate in the bottom of the bowl. Stir from time to time, and remember to squeeze the heaped tablespoons of the mix before you add them to the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot topped with low-fat sour cream, Greek yogurt or crème fraiche, or other toppings of your choice such as salsa, chutney or yogurt blended with cilantro, mint, and garlic."}], "link": "https://cooking.nytimes.com/recipes/1015732-spicy-carrot-parsnip-and-potato-latkes"}