{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheese Soufflé", "description": "I swoon at a well-made cheese soufflé, a dish that nobody seems to make anymore. When I was learning to cook, that soufflé seemed like the ultimate challenge, and never was I more proud than when I made my first successful one, puffed high and golden brown, its center still a molten sauce. They are actually quite easy. But they do require the best eggs and cheese (and I wouldn’t scoff at a truffle), and attention when you beat the egg whites, because if you overbeat them they’ll break apart when you fold them into the béchamel with the cheese. Instead of Gruyère alone you can also use a mix of nutty-tasting Gruyère style cheeses; for example, use a mix of Comté (French Gruyère), Beaufort or Fribourg and Gruyère, or substitute Comté for all of the Gruyère.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/12/25/dining/25eggs1/25eggs1-articleLarge.jpg", "totalTime": "PT1H40M", "recipeYield": "5 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "butter, cheese, eggs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 151}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 311, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "0 grams", "proteinContent": "18 grams", "saturatedFatContent": "12 grams", "sodiumContent": "377 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["55 grams butter (3 tablespoons plus 2 teaspoons)", "35 grams Parmesan (1/3 cup), grated", "20 grams minced shallot (2 tablespoons)", "45 grams flour (4 tablespoons), sifted", "1 1/2 cups milk", "3 grams salt (1/2 teaspoon), more as needed", "Pinch of freshly ground white pepper", "Pinch of nutmeg", "6 large egg yolks", "7 large egg whites", "1 gram cream of tartar (1/8 teaspoon)", "100 grams Gruyère cheese (1 cup), grated", "1 good-size black or white truffle, grated (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using 10 grams (2 teaspoons) butter, grease a 2-quart soufflé dish. Dust with 12 grams (2 tablespoons) Parmesan. Heat oven to 400 degrees with rack positioned in the lower third."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the béchamel: Place a strainer over a large bowl and set aside. Heat remaining butter over medium heat in a heavy medium-size saucepan. Add shallot and cook, stirring, until softened (do not brown), 2 to 3 minutes. Stir in flour and cook, stirring, for about 3 minutes, until smooth and bubbling, but not browned. It should have the texture of wet sand. Remove from heat and whisk in milk all at once. Return to heat and bring to a simmer while whisking. Continue to whisk until mixture begins to thicken. Turn heat to very low and simmer for 5 to 10 minutes, stirring often with a whisk and scraping bottom and edges of pan with a rubber spatula. The sauce will be quite thick and should have no taste of raw flour. Add 3 grams ( 1/2 teaspoon) salt, the white pepper and the nutmeg. While it is still hot, strain sauce into the large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately beat egg yolks into sauce, one at a time. Adjust salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a stand mixer or using electric beaters, begin beating egg whites on low speed. When they begin to foam, add cream of tartar and a pinch of salt. Continue to beat until they form stiff but not dry peaks. Be careful not to overbeat or egg whites will fall apart when you fold them into sauce, which will make your soufflé mixture grainy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a large rubber spatula, stir a quarter of the egg whites into sauce. Stir in Gruyère, remaining Parmesan and truffle if using. Gently fold remaining whites into mixture, working rapidly but gingerly so whites don’t collapse. Carefully spoon or pour mixture into prepared soufflé dish and place dish on a baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in oven, turning heat down to 375 degrees as soon as you close the oven door. Bake 30 to 35 minutes, until soufflé has puffed above the top of the dish, and soufflé top is golden brown. Turn off oven. If desired, let sit 5 minutes (the sauce in the middle will thicken slightly, but the soufflé will remain puffed) or serve at once. The center of the soufflé should be saucy. When you serve the soufflé, spoon sauce from the middle over each fluffy serving."}]}