{"@context": "http://schema.org", "@type": "Recipe", "name": "Mac 'n' Cheese", "description": "Can mac ‘n’ cheese be haute? Yes, in the hands of Maximo Lopez May, the executive chef of Wall & Water at the Andaz Wall Street Hotel in Manhattan, who adds exotic mushrooms. “It only works if the mushrooms are great,” he said, “so go for elegant ones, like chanterelles or trumpets.” If your budget doesn’t allow for those, then use oyster mushrooms, hen o’ the woods or cremini. But use a mix.", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 45}, "recipeIngredient": ["Sea salt", "1 pound dry strascinati, strozzapreti, orechiette, cavatelli, or rigatoni pasta", "4 tablespoons unsalted butter, plus 1 tablespoon for buttering baking dish", "4 slices day-old country bread, cut into 3/4-inch cubes", "2 tablespoons minced fresh thyme leaves", "1 small onion, finely chopped", "2 cloves garlic, minced", "4 cups oyster mushrooms, turmpet mushroomr, or hen o' the woods, wiped clean, trimmed and left whole, if small, or cut lengthwise, in half or thirds, if large", "2 tablespoons extra virgin olive oil, optional", "1 cup white wine", "1 cup heavy cream", "1 cup milk, or as needed", "10 ounces, or more, as needed, Cato Corner Bloomsday cheese, or Gruyère, or Emmental, grated or finely chopped", "Zest of 2 lemons, finely grated", "1/4 cup roughly chopped fresh parsley leaves", "Black pepper, freshly ground"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees F. Bring a large pot of lightly salted water to a boil. Add pasta, and cook until al dente, 10 to 13 minutes, depending on the size of the pasta. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pan over medium heat, melt 4 tablespoons butter. Remove from heat and set aside. In a small bowl, combine bread, thyme, and half the melted butter. Mix and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large sauté pan over medium heat, combine remaining melted butter, onion and garlic. Sauté until onion is translucent, 3 to 5 minutes. Add mushrooms, adding olive oil if pan looks dry, and sauté until tender, about 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the mushrooms are tender, add wine and stir until it has evaporated. Add cream and 1 cup milk, and bring to a boil. Add the pasta, 10 ounces grated cheese, lemon zest and chopped parsley. Mix well, and season with salt and pepper to taste. If desired, add more milk and cheese as needed for a creamy, cheesy sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a 10-inch diameter baking dish, 3- to 4-inches deep. Pour in pasta mixture, and top with bread mixture. Bake, uncovered, until the bread turns golden brown, 7 to 10 minutes. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1015597-mac-n-cheese"}