{"@context": "http://schema.org", "@type": "Recipe", "name": "All Whole-Wheat Sandwich Bread", "description": "The dough will be somewhat stiff. So to get it into the pan, first pat and coax it into a rectangle shape a little smaller than the pan, smoothing out the cracks and holes as you work. Then transfer the rectangle to the pan and use the back of your hand to gently press the dough into the pan.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT3H", "recipeYield": "1 large loaf", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, lunch, sandwiches", "keywords": "bread, whole wheat flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 81}, "recipeIngredient": ["3 1/2 cups whole-wheat flour, plus more as needed", "2 tablespoons vital gluten", "2 teaspoons salt", "1 1/2 teaspoons instant yeast", "1 tablespoon sugar or honey, or more to taste", "2 tablespoons neutral oil, like grapeseed or corn, or softened butter, plus more for the bowl and the pan", "Scant 1 1/3 cups cool milk, preferably whole or 2 percent (warm the milk to at least 70 degrees if you’re working by hand)", "All purpose flour for dusting and kneading as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the whole wheat flour and vital gluten in a food processor, add the salt and yeast, and process for 5 seconds. With the machine running, add the sweetener, the oil or butter, and most of the milk through the feed tube (you’ll need a little less milk if you’re using a liquid sweetener). Process for about 30 seconds, then remove the cover. The dough should be in a well-defined, barely sticky, easy-to-handle ball. If it’s too dry, add milk 1 tablespoon at a time and process for 5 or 10 seconds after each addition. If too wet, which is unlikely, add a tablespoon or two of flour and process briefly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a little more of the oil to grease a large bowl. Shape the dough into a rough ball, place it in the bowl, and cover with plastic wrap or a damp towel. Let rise for at least 2 hours, until nearly doubled in bulk. Deflate the ball and shape it once again into a ball; let rest on a lightly floured surface for about 15 minutes, covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using only enough white flour to keep the dough from sticking to your hands or the work surface, flatten it into a rectangle as described in the headnote; let it rest for a few minutes. Use the remaining oil or butter to grease an 8 1/2 by 4 1/2-inch loaf pan. Place the loaf in the pan, flattening the top of it with the back of your hand. Cover and let rest for 1 hour, or until the top of the dough is nearly level with the top of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Brush the top of the loaf lightly with water, then put in the oven. Bake for about 45 minutes, or until the bottom of the loaf sounds hollow when you tap it (it will fall easily from the loaf pan) or the internal temperature reads about 210 degrees. Remove the loaf from the pan and cool on a wire rack."}], "link": "https://cooking.nytimes.com/recipes/1015493-all-whole-wheat-sandwich-bread"}