{"@context": "http://schema.org", "@type": "Recipe", "name": "Leek, Kale and Potato Latkes", "description": "These delicious cumin-scented potato pancakes are laced with leeks and crispy kale, adding a putatively healthy touch to the standard fried latke. You can serve them with Greek yogurt, sour cream or crème fraîche. But a chutney or yogurt blended with cilantro, mint and garlic would make for excellent eating as well. You might even try a salsa.\n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/11/26/science/29recipehealth/29recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Makes 2 to 2 1/2 dozen, serving 6", "recipeCuisine": "", "recipeCategory": "brunch, dinner", "keywords": "appetizer, side dish, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low calorie, low-carb, low-fat, low-sodium, low sugar, nut-free, vegetarian, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 127}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 58, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "120 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["5 cups, tightly packed, grated potatoes (use a starchy potato like Idaho or Yukon gold)", "2 large leeks, halved lengthwise, cleaned and sliced very thin", "1/2 pound kale, stemmed, washed, dried and finely chopped or cut in thin slivers (about 3 cups, tightly packed)", "1 teaspoon baking powder", "Salt and freshly ground pepper to taste", "2 teaspoons cumin seeds, lightly toasted and coarsely ground", "1/4 cup chopped chives", "1/4 cup all-purpose flour or cornstarch", "2 eggs, beaten", "About 1/4 cup canola, grape seed or rice bran oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Meanwhile, place a rack over a sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl mix together the potatoes, leeks, kale, baking powder, salt and pepper, cumin, chives, and flour or cornstarch. Add the eggs stir together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large heavy skillet over medium-high heat. Add 2 to 3 tablespoons of the oil and when it is hot, take up heaped tablespoons of the latke mixture, press the mixture against the spoon to extract liquid (or squeeze in your hands), and place in the pan. Press down with the back of the spatula to flatten. Repeat with more spoonfuls, being careful not to crowd the pan. In my 10-inch pan I can cook 4 at a time without crowding; my 12-inch pan will accommodate 5.  Cook on one side until golden brown, about 3 minutes. Slide the spatula underneath and flip the latkes over. Cook on the other side until golden brown, another 2 to 3 minutes. Transfer to the rack set over a baking sheet and place in the oven to keep warm. The mixture will continue to release liquid, which will accumulate in the bottom of the bowl. Stir from time to time, and remember to squeeze the heaped tablespoons of the mix before you add them to the pan.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot topped with low-fat sour cream, Greek yogurt or crème fraiche, or other toppings of your choice such as salsa, chutney or yogurt blended with cilantro, mint, and garlic."}], "link": "https://cooking.nytimes.com/recipes/1015736-leek-kale-and-potato-latkes"}