{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom and Grain Cheeseburgers", "description": "", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/03/31/health/nutrition/31recipehealth/31recipehealth-articleLarge-v3.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 burgers.", "recipeCuisine": "", "recipeCategory": "", "keywords": "gluten-free, healthy, high fiber, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 30}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 252, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "5 grams", "proteinContent": "12 grams", "saturatedFatContent": "4 grams", "sodiumContent": "595 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 to 3 tablespoons extra virgin olive oil, as needed", "1/2 cup finely chopped onion", "1 1/4 pounds mushrooms, sliced", "Salt to taste", "2 garlic cloves, minced", "2 teaspoons chopped fresh sage", "Freshly ground pepper", "1 1/4 cups cooked brown rice or barley", "1/4 cup chopped fresh parsley", "1 egg", "3/4 cup cooked chickpeas (1/2 can)", "2 ounces Gruyère cheese, sliced very thin with a cheese slicer"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Heat 1 tablespoon of the oil over medium heat in a heavy ovenproof skillet and add the onion. Cook, stirring, until it is tender, about 3 minutes. Turn the heat up to medium-high and add the mushrooms. Cook, stirring often, until the mushrooms have begun to sweat and soften, about 3 minutes. Turn the heat back down to medium, add a generous pinch of salt, the garlic and sage, and continue to cook until the mushrooms are tender, about 3 minutes. Taste, adjust seasoning and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place half the mushrooms in a food processor fitted with the steel blade and the other half in a large bowl, along with the rice or barley and the parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chickpeas and egg to the food processor and purée with the mushrooms. Stir into the rice and mushroom mixture and mix everything together. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a heavy ovenproof skillet over medium-high heat. Seasoned cast iron is good, and so is a heavy nonstick pan that can go into the oven. Moisten your hands lightly and shape 4 large or 6 smaller patties. Add the remaining tablespoon of oil to the pan and, working in batches if necessary, cook the burgers for 2 minutes on one side, until nicely browned. Carefully turn the patties over and place the pan in the oven. Bake 5 minutes. Remove the pan from the oven and lay thin slices of Gruyère on top of each burger. Return to the oven and bake for another 5 minutes, or the patties are lightly browned and the cheese has melted. Remove from the heat and serve, with or without buns, ketchup and the works."}]}