{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Cashew Tart", "description": "You'll need ring molds and plenty of time to make this decadent tart, which is featured in \"The Food Network South Beach Wine & Food Festival Cookbook.\" The dish, created by Michael Laiskonis, executive pastry chef of the famed Le Bernardin restaurant in New York City, was served at a tribute dinner for chefs Eric Ripert and Maguy Le Coze. What makes this tart particularly appealing — besides its taste and texture — is that each component can be prepared a day or two in advance and then assembled at the last minute.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "Serves 8", "recipeCuisine": "", "recipeCategory": "", "keywords": "cashew, chocolate, dessert, fall, kosher, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "recipeIngredient": ["2 1/2 cups all-purpose flour, plus extra for dusting", "1 cup almond flour", "1/2 cup plus 1 tablespoon sugar", "1/4 cup unsweetened cocoa powder", "1/2 teaspoon fine sea salt", "3/4 cup (1 1/2 sticks) unsalted butter, at room temperature, cut into pieces", "2 large egg yolks", "2 tablespoons water", "1/2 cup salted cashews, crushed", "1 1/4 cups sugar", "1/2 cup water", "1 tablespoon glucose syrup", "1/2 teaspoon freshly squeezed lemon juice", "3/4 cup heavy cream", "2 tablespoons unsalted butter", "1 cup heavy cream", "2 tablespoons glucose syrup (or corn syrup)", "10 ounces 55 percent to 61 percent couverture chocolate, chopped", "2 tablespoons unsalted butter, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the paddle attachment, combine the all-purpose flour, almond flour, sugar, cocoa powder and salt. Gradually add the butter with the motor running. Add the egg yolks and water, and mix until just incorporated. Turn the dough out onto a lightly floured surface. Form it into a flat rectangle and wrap it tightly in plastic. Place the dough in the refrigerator and let it rest for at least an hour or up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the dough from the refrigerator and place it on a lightly floured surface. Roll it out until 1/8-inch thick. Brush away any excess flour, and cut out eight 3 1/2-inch rounds. Line a baking sheet with parchment paper. Place eight 2-inch ring molds on the baking sheet, and top them with the dough rounds. Trim the top edge, and press the dough into the base of each ring to ensure there are no air pockets. Refrigerate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees Fahrenheit with a rack in the middle position. Bake the shells for 7 to 8 minutes. Rotate the baking sheet and continue to bake for an additional 7 to 8 minutes. Remove from the oven and let the shells cool completely; then unmold them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the caramel filling. Combine the sugar, water, syrup and lemon juice in a medium saucepan. Cover the saucepan and cook to a dark amber color, about 8 minutes, over medium heat. Meanwhile, in another saucepan, heat the cream until warm. Remove the caramelized sugar from the heat and deglaze the pan with the warmed cream. Return the caramel to low heat and cook until the sugar has completely dissolved. Remove from the heat and whisk the butter into the caramel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chocolate ganache. In a small saucepan, bring the cream and syrup to a boil. Meanwhile, place the chocolate in a large heatproof bowl. Remove the cream mixture from the heat and gradually pour it over the chocolate, stirring to emulsify. Let the ganache cool to 95 degrees Fahrenheit, and then stir in the butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the tarts. Arrange the tart shells on a clean baking sheet and line the bottom of each shell with some cashews, to reach about halfway up the sides. Reserve additional cashews for garnishing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm the caramel if necessary, and spoon just enough to cover the cashews in each shell. The shells at this stage should be only one-half to two-thirds full, allowing ample space for the ganache. Let the tarts stand for up to 30 minutes to let the caramel set slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm the ganache if necessary, and fill the remaining space in each tart with the ganache. Let the tarts stand for 30 minutes to 1 hour, at room temperature, to let the ganache set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a finished tart on the center of each plate, and garnish with some cashews, some candied lemon peel, and a scoop of your favorite ice cream."}], "link": "https://cooking.nytimes.com/recipes/1015223-chocolate-cashew-tart"}