{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Anchovies, Garlic, Chiles and Kale", "description": "If you don’t have an after-work, go-to pasta dish, this may fill the void. The backbone of flavor comes from pantry staples — a pungent mix of anchovies, garlic, red pepper flakes and capers, which gives pasta more than enough character for a satisfying dinner. But kale (or chard, spinach or other greens) adds a fresh, earthy flavor and enough vegetable content to turn it into a one-dish meal.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/03/12/dining/12kalepasta/12kalepasta-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, quick, pastas", "keywords": "anchovy fillets, kale, pasta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 855}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 488, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "94 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "7 grams", "proteinContent": "21 grams", "saturatedFatContent": "1 gram", "sodiumContent": "532 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["Salt, as needed", "1/2 pound pasta", "3 tablespoons good olive oil, more for drizzling", "1/4 to 1/2 teaspoon crushed red chile flakes, to taste", "4 fat garlic cloves, smashed and peeled", "2 tablespoons drained capers, patted dry with a paper towel to encourage browning", "4 anchovy filets", "1 small bunch kale, chopped (or use 3 large handfuls chopped kale)", "Black pepper", "Squeeze of lemon, optional", "Grated pecorino or Parmesan cheese, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a heavily salted pot of water to a boil. Cook pasta until al dente. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat oil in the largest skillet you have. Add chiles and a pinch of salt and toast until golden, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add smashed garlic, capers and anchovies. Let cook until everything is golden, the capers look crisp around the edges and the anchovies have dissolved into the oil, about 3 to 4 minutes. (You can help anchovies dissolve by mashing them with a wooden spoon as they cook.) Add kale and 2 tablespoons water and sauté until kale wilts and cooks in the pan and is well coated with oil, about 5 minutes. You might have to add more water if the water evaporates before the kale finishes cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add drained pasta and toss well. Add more salt if necessary and plenty of black pepper, and serve drizzled with more oil and a squeeze of lemon if the dish needs a lift. Cheese isn't necessary but if you like pecorino and have some on hand, feel free to shower it on top."}], "link": "https://cooking.nytimes.com/recipes/1015085-pasta-with-anchovies-garlic-chiles-and-kale"}