{"@context": "http://schema.org", "@type": "Recipe", "name": "Homemade Orgeat Syrup", "description": "Mai tai recipes call for a seldom-employed artificial almond syrup called orgeat, or orzata, depending on whether you’re buying the faux-French version or the faux-Italian one. The problem is that faux-ness. Though orgeat is conceptually tethered to tiki, its twisted history predates tiki’s by a long stretch. Orge is the French for “barley,” and orgeat, orzata or, in Spanish, horchata, originally referred to a common method of making barley water, a nourishing drink, by crushing the grain in a mortar and pestle and adding water to it to emulsify the fats. Along the line, almonds were added to the mix, and eventually the humble grain got shoved out in favor of the rich and aromatic nut.", "author": {"@type": "Person", "name": "Toby Cecchini"}, "image": null, "totalTime": "PT5M", "recipeYield": "1.6 liters", "recipeCuisine": "", "recipeCategory": "non-alcoholic drinks", "keywords": "almond, almond extract, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 350, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "6 milligrams", "sugarContent": "44 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/10 pounds blanched or toasted blanched almonds", "1 1/2 pounds sugar (1/2 demerara, 1/2 white)", "1 tablespoon orange-flower water", "2 teaspoons almond extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine almonds with 11 ounces of water in a blender and blend briefly until uniformly but roughly chopped. Pour into a nonreactive bowl and add one liter of boiling water. Stir well and let stand for three hours. Line a sieve or chinois with overlapping layers of fine cheesecloth, arranging them in an X pattern and leaving a fair amount trailing over to grab hold of. Pour in the mixture and allow it to filter through, assisting with a wooden spoon if necessary. Fold up the ends of the cheesecloth carefully to trap the pulp in a bag and squeeze out the remaining liquid. (This is important, as the pulp retains a fair amount of emulsion.) Discard cheesecloth and pulp. Place emulsion mixture in a pan, add sugar and heat mildly through (140 degrees or less), stirring until sugar is fully dissolved. Remove from heat and allow to cool to room temperature. Add orange-flower water and almond extract and funnel into a clean, capped bottle to refrigerate. Optionally you may add 2 or 3 ounces of vodka to the syrup, as a preservative."}], "link": "https://cooking.nytimes.com/recipes/1015317-homemade-orgeat-syrup"}