{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Brussels Sprouts With Shallots and Sherry", "description": "This recipe came to The Times in 2011 from Grace Young, the chef and cookbook writer. Make sure the Brussels sprouts are dry before they are put into the pan, or the liquid will turn the stir-fry into a braise. This dish can be made ahead of time, all the better for a Thanksgiving feast or a weeknight dinner.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2011/11/08/health/well_veggie_stir2/well_veggie_stir2-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, gluten-free, kosher, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 90}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 154, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "253 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound brussels sprouts", "3 tablespoons dry sherry", "1 tablespoon soy sauce (low-sodium if desired)", "1/2 teaspoon salt", "1/4 teaspoon freshly ground pepper", "3 tablespoons peanut or canola oil", "1/3 cup thinly sliced shallot", "1 tablespoon minced garlic", "1/4 cup roasted pine nuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the ends off the brussels sprouts and remove and discard any discolored outer leaves. Shave a scant 1/4-inch-thick slice off one side of each sprout and put cut side down. Cut scant 1/4-inch-thick slices to make about 6 cups. Transfer the brussels sprouts to the colander of a salad spinner and rinse under cold water. Put the colander into the salad spinner and spin to remove excess water. Combine the sherry and soy sauce in a cup. Combine the salt and pepper in a small dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or a 12-inch skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in the oil by adding it to the sides of the pan and swirling the pan, then add the shallots and garlic and stir-fry no more than 10 seconds, until the aromatics are fragrant. Add the brussels sprouts, sprinkle with the salt mixture and stir-fry for 1 minute, just until the brussels sprouts are bright green. Swirl the sherry mixture into the wok, cover and cook 1 minute, until almost all the liquid has evaporated. Uncover and stir-fry for 2 minutes, until the Brussels sprouts are crisp-tender and the liquid has just evaporated. Sprinkle with the pine nuts."}]}