{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggplant and Tomato Pie", "description": "Tomatoes have another week or so to go in most farmers’ markets. This robust summer pie, topped with a layer of tomato slices flecked with thyme, is a nice party piece. It also packs well once cooled, so take leftovers to work for lunch.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/09/23/health/23recipehealth-span/23recipehealth-span-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "1 pie, serving 6 generously", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "eggplant, tomato, fall, summer, halal, healthy, high fiber, kosher, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 370}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 203, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "5 grams", "proteinContent": "10 grams", "saturatedFatContent": "4 grams", "sodiumContent": "628 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 <a href=\"http://www.nytimes.com/2009/06/22/science/22recipehealth.html?ref=vegetablepies\">Whole Wheat Yeasted Olive Oil Crust</a> (1/2 recipe)", "1 1/2 pounds eggplant (2 medium)", "Salt and freshly ground pepper", "2 eggs", "1/3 cup milk", "1 1/2 cups marinara sauce", "2 teaspoons fresh thyme leaves", "2 ounces Gruyère, grated (1/2 cup)", "1 ounce Parmesan, grated (1/4 cup)", "2 medium-size fresh tomatoes, in season, sliced", "2 tablespoons extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a lightly oiled 9- or 10-inch tart pan with the dough. Using a fork, pierce at regular intervals to allow for even baking. Refrigerate or freeze until ready to prebake and fill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees Fahrenheit. Slice the eggplant about 1/3 inch thick and toss with salt to taste and 1 tablespoon olive oil. Line 1 to 2 baking sheets (as needed) with foil and brush the foil with olive oil. Lay the eggplant slices on the foil in 1 layer. Roast in the hot oven for 15 to 20 minutes, until the slices are soft when pierced with a knife and browned in spots. Remove from the oven and carefully fold the foil up over the eggplant slices (be careful not to burn yourself!). Crimp the edges of the foil and allow the eggplant to steam for another 15 to 20 minutes. It should now be completely cooked. Turn the oven down to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat together the eggs in a medium bowl. Set the tart pan on a baking sheet to allow for easy handling. Using a pastry brush lightly brush the bottom of the crust with the beaten egg and place in the oven for 10 minutes. Remove from the oven and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the milk into the eggs. Add salt (I usually use about 1/2 teaspoon) and pepper. Spread 1/4 cup tomato sauce over the bottom of the crust. Top with a layer of eggplant slices. Season with salt and pepper. Spoon one third of the remaining sauce over the eggplant and sprinkle with thyme, Parmesan, and half of the Gruyère. Repeat the layers one or two more times, depending on the size of your eggplant slices, ending with the Gruyère. Pour on the egg and milk mixture. It should seep down into the layers; if it looks like it’s not moving and going to overflow the crust, use a fork to create some holes so it does seep down. Arrange the sliced tomatoes on top and sprinkle any remaining thyme over the tomatoes. Drizzle on 1 tablespoon of olive oil. Place in the oven and bake for 40 to 45 minutes, until set and bubbling and browned on the top and edges. Remove from the heat and allow to sit for at least 10 minutes before serving. Serve hot, warm, or room temperature."}]}