{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry-Orange Jelly", "description": "This is the cranberry sauce for cooks who secretly (or not so secretly) like the kind that comes in a can, a quivering ruby mass with an unexpected dash of orange and spice. Guests can scoop it out of a pretty glass bowl, but it’s more fun to unmold it onto a cake plate and serve it in slices. Make sure the water your use to unmold your jelly is quite hot, not just warm. The idea is to melt the outer jelly layer just enough so that the whole mold can slip right out.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/10/27/dining/27COOKING-CRANORGJELLY2/27COOKING-CRANORGJELLY2-mediumThreeByTwo440.jpg", "totalTime": "PT20M", "recipeYield": "12 to 16 servings", "recipeCuisine": "american", "recipeCategory": "jams, jellies and preserves", "keywords": "cranberry, side dish, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 131}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 184, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "2 grams", "proteinContent": "0 grams", "saturatedFatContent": "0 grams", "sodiumContent": "3 milligrams", "sugarContent": "31 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 cups Lillet (see note)", "1/2 cup orange liqueur, like Grand Marnier", "2 cups sugar", "2 tablespoons juniper berries (optional)", "2 12-ounce bags fresh or frozen cranberries (about 8 cups; frozen can be substituted)", "Nonstick cooking spray (if chilling in a mold)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy saucepan, combine Lillet, liqueur, sugar and juniper berries if using. Bring to a boil over medium-high heat. Add cranberries and return to a boil. Reduce the heat to low and simmer until all the cranberries burst and are very soft, at least 10 minutes total (or use a candy thermometer and cook mixture to 210 to 215 degrees). The mixture should be reduced and thickened, like a very loose jam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the sauce into a bowl through a sieve, pushing on the solids with a rubber spatula to extract all the liquid. Discard the solids. Stir the liquid and transfer to a pretty serving bowl or a mold. (If using a mold, spray the insides first with nonstick cooking spray.) A funnel or liquid measuring cup with a spout can be useful for transferring without splashing the sides. Cover and refrigerate for at least three hours, or up to several days. Keep refrigerated until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you chilled the jelly in a mold, turn it out by placing the mold in a large bowl. Carefully pour hot water into the bowl so it comes up the sides of the mold, melting the jelly just enough to release it from the mold. After 3 minutes, try unmolding the jelly onto a serving dish. If it doesn’t come out, return to the bowl and try again 2 minutes later. Repeat until the jelly is released. If necessary, return it to the refrigerator to firm up before serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Cranberry Jelly", "description": "This is the cranberry sauce for cooks who secretly (or not so secretly) like the kind that comes in a can, a quivering ruby mass with an unexpected dash of orange and spice.", "thumbnailUrl": "https://static01.nyt.com/images/2015/10/27/dining/27COOKING-CRANORGJELLY2/27COOKING-CRANORGJELLY2-mediumThreeByTwo440.jpg", "uploadDate": "2016-11-17T16:49:49.000Z", "duration": "PT1M54S"}, "link": "https://cooking.nytimes.com/recipes/1015472-cranberry-orange-jelly"}