{"@context": "http://schema.org", "@type": "Recipe", "name": "Preserved Tomato Purée", "description": "A little work in prime tomato season will help carry bright summer flavors into the cold of January, giving you a base for pasta sauces, gumbo, enchiladas, shakshuka, bouillabaisse — a world of possibility. It’s an afternoon of chopping, puréeing, simmering and canning, the heat of the day reminding you that the cooler nights, spicy pasta all’arrabbiatas and warming chana masalas are just around the corner. You’ll need three quart-sized jars (32 ounces each) or six pint-sized ones (16 ounces each).", "author": {"@type": "Person", "name": "Cathy Barrow"}, "image": "https://static01.nyt.com/images/2014/09/11/dining/tomato1-still/tomato1-still-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "3 quart-sized jars or 6 pint-sized jars", "recipeCuisine": "", "recipeCategory": "", "keywords": "summer, tomato, vegan, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 18, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "5 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["8 pounds firm, ripe, red tomatoes (about 10 to 12, depending on size)", "Lemon juice, bottled lemon juice or citric acid", "Salt (kosher, pickling or fine sea salt only), optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel, core and roughly chop tomatoes. Put in a large nonreactive pot, cover and simmer 10 minutes. Purée through medium disc of a food mill to remove skins and most seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a rack in a large stockpot or line pot with a folded kitchen towel, then fill with water and bring to a boil. Add quart or pint jars and boil 10 minutes. Jars may be left in warm water until ready to fill. Alternatively, sterilize jars by running them through a dishwasher cycle, keeping them warm in the machine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place canning rings in small saucepan, cover with water and bring to a boil. Turn off heat and add flat lids to soften rubber gaskets. Rings and lids may be left in water until jars are filled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring purée to a boil, then down to a sturdy simmer and cook to reduce by one third, about 30 minutes. Ladle hot purée into warm jars, leaving a little more than 1/2 inch head space to accommodate lemon juice. If using citric acid, fill to 1/2 inch head space."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Into every quart jar, add 2 tablespoons lemon juice or 1/2 teaspoon citric acid. For pints, use one tablespoon lemon juice or 1/4 teaspoon citric acid. If using salt, add 1 teaspoon to each quart or 1/2 teaspoon to each pint jar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe jar rims clean with a damp towel. Place lids on jars, screw on rings and lower jars upright into pot of boiling water. Return to a full boil and process for 45 minutes for quarts or 35 minutes for pints. If there are mixed sizes, process for the longer time. Transfer jars to a folded towel and let cool for 12 hours. Jars will ping as they seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cool, test the seals by removing rings and lifting jars by their flat lids. If a lid releases, the seal has not formed. Unsealed jars should be refrigerated and used within one week or reprocessed. Rings and jars may be reused, but a new flat lid must be used each time."}]}