{"@context": "http://schema.org", "@type": "Recipe", "name": "Saffron Ravioli With Wild Mushrooms and Cashew Cheese", "description": "", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2011/11/21/health/Well_veggie_saffron/Well_veggie_saffron-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "6 to 8 servings; about 30 ravioli", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, kosher, vegan, vegetarian", "aggregateRating": null, "recipeIngredient": ["1 cup raw cashews", "2 tablespoons extra-virgin olive oil", "1/4 cup chopped white onion", "1/4 teaspoon chopped garlic", "1/4 cup chopped shallots", "1/4 cup chopped leek, white and pale green parts", "1/2 pound cremini, morel or chanterelle mushrooms, stemmed and chopped", "1 tablespoon water", "1 tablespoon freshly squeezed lemon juice", "2 tablespoons nutritional yeast", "1/2 teaspoon sea salt", "1 teaspoon saffron", "2 1/2 cups water", "1 cup semolina flour", "3 cups unbleached all-purpose flour", "3 teaspoons Ener-G egg replacer", "1/4 teaspoon sea salt", "3 tablespoons palm oil, melted", "Fine yellow cornmeal or semolina flour, for dusting", "2 1/2 cups tomato sauce", "2 cups raw cashews", "1/4 cup freshly squeezed lemon juice", "2 tablespoons extra virgin olive oil", "1/4 cup water", "1/2 teaspoon sea salt", "Minced fresh parsley, capers and tomato sauce, for garnish", "2 1/2 pounds butternut squash, peeled, seeded and cut into 2-inch cubes", "2 tablespoons extra-virgin olive oil", "1/2 teaspoon ground or freshly grated nutmeg", "1 fresh sage leaf, finely chopped", "Sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the ravioli filling: the day before using, put the cashews in a bowl and add enough cold water to cover them. Cover and let soak overnight in the refrigerator. Do the same for the cashews you will use to make the Cashew Creme Fraiche (see recipe below)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large sauté pan, heat 1 tablespoon of the olive oil over medium heat. Add the onion, garlic, shallots and leek and sauté until tender, about 5 minutes. Add the mushrooms and cook until their liquid has evaporated, about 10 minutes. Drain well and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the liquid from the cashews and rinse under cool water. Put the cashews, the remaining 1 tablespoon of olive oil, and the water, lemon juice, nutritional yeast and salt in a food processor fitted with the metal blade and process until smooth. Add the mushroom mixture and pulse a few times, until the mushrooms are incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pasta: soak the saffron in the water for about 30 minutes. Put the flours, egg replacer, saffron-infused water and salt in a stand mixer fitted with the paddle attachment. Add the palm oil and mix well. The dough should be smooth and not stick to your fingers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press the dough into a rectangle and roll it, a small section at a time, through a pasta machine. You may have to repeat several times to reach the desired thickness of approximately 1/8 inch. Sprinkle the surface with a small amount of cornmeal or semolina flour to prevent the dough from sticking. Cut the pasta sheets into 2-inch rounds or squares."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the ravioli, put the pasta pieces on a floured surface. Place a teaspoonful of filling in the center of each square, brush the edges of the dough with a bit of water, top with another piece of pasta, and press the edges with your fingers to seal, and then crimp with a fork. Spray the ravioli with canola oil cooking spray on one side, then flip them over and spray the other side. (If you don’t have cooking spray, brush both sides lightly with olive oil.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and cook the ravioli until just tender, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon tomato sauce into shallow bowls. Top with alternating layers of ravioli and Cashew Crème Fraîche. Scatter a bit of parsley over the sauce, top with a spoonful of capers and serve at once."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Cashew Creme Fraiche", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the presoaked cashews, rinse under cold water and drain again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a blender. Add the lemon juice, olive oil, water and salt and process until smooth. The mixture will keep covered in the refrigerator for up to 5 days."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Butternut Squash Filling", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the butternut squash on a rimmed baking sheet, drizzle with the olive oil, and toss with your hands until evenly coated. Bake the squash for 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool, then transfer to a large bowl. Add the nutmeg and sage and mash until smooth. Season with salt to taste. Use as an alternative filling for ravioli, following the instructions above."}]}], "link": "https://cooking.nytimes.com/recipes/1015368-saffron-ravioli-with-wild-mushrooms-and-cashew-cheese"}