{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange Cake, Ancona-Style", "description": "Orange cake is a terrific dessert to serve after the rich, meaty stews of winter: boeuf bourguignon, short ribs, lamb tagine.\n\nThe method that Marcella Hazan uses here — poking holes into the cake and letting orange syrup seep in — has a similar effect to brining: what would otherwise be a dry cake becomes flavorful, fragrant, and juicy. And it’s even better than brining, because it always works, takes no time, and also makes the cake last longer. ", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2013/11/10/magazine/10eat5/10eat5-articleLarge-v3.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, lunch", "keywords": "butter, cake, orange peel, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 65}, "recipeIngredient": ["2 cups plus 2 tablespoons all-purpose flour, plus flour for dusting the pan", "3 eggs", "Grated peel of 3 oranges", "4 tablespoons (1/2 stick) butter, softened to room temperature, plus butter for \ngreasing the pan", "1 cup plus 3 tablespoons sugar", "2 tablespoons ouzo liqueur", "1 tablespoon whole milk", "2 1/2 teaspoons baking powder", "2 cups freshly squeezed orange juice, with 3 tablespoons sugar dissolved in it."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the flour, eggs, orange peel, 4 tablespoons softened butter, sugar and ouzo in a food processor, and run until all the ingredients are evenly amalgamated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the milk and baking powder, and process again to incorporate into the mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thickly smear a tube pan with butter, and dust with flour. Put the cake mixture \nin the pan (it won’t fill it up all the way), and place the pan in the preheated oven. Bake for 40 to 45 minutes, until the top of the cake becomes a rich gold color. \n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cake is done, place the bottom of the pan over a tumbler or tall \nmug, using pot holders, and push down to raise the loose bottom. Take the \ntube with the cake out of the hoop, work the cake loose from the bottom with \na knife and lift it away from the tube. Place it on a plate with a slightly raised rim."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake is still warm, poke many holes in it using a chopstick or any \nsimilar narrow tool. Into each of the holes, slowly pour some of the orange \njuice. At first the hole fills to the brim with juice, but this will subsequently — in \nabout an hour — be absorbed by the cake. Serve at room temperature, with \nmore orange juice drizzled over each slice. \n"}]}