{"@context": "http://schema.org", "@type": "Recipe", "name": "Hungarian Potato and Egg Casserole", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "eastern european, russian", "recipeCategory": "brunch", "keywords": "potato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 168}, "recipeIngredient": ["1 1/2 pounds (about 5 medium) russet, Idaho, or other baking potatoes, unpeeled and scrubbed", "Salt", "2 tablespoons vegetable oil", "1 pound (about 2 large) onions, thinly sliced", "6 large eggs", "1 tablespoon unsalted butter, at room temperature", "Freshly ground black pepper", "Sweet Hungarian paprika", "2 cups sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the potatoes in a large pot, and add enough cold, lightly salted water to cover by 2 inches. Bring to a boil over high heat. Cook until potatoes are just tender, about 20 minutes. Drain and rinse under cold water until cool enough to handle. Peel potatoes and cut into 1/2-inch rounds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a medium sauté pan over medium heat. Add vegetable oil, and heat until shimmering. Add onions, and sauté until soft and almost caramelized, about 25 minutes; lower heat if they begin to brown too quickly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the eggs in a large pot, and add enough cold water to cover by 2 inches. Bring to a boil over high heat, then reduce heat to medium-low and simmer for 10 minutes. Drain and rinse under cold water until cool enough to handle. Peel the eggs, and cut into 1/3-inch rounds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Generously coat the inside of a 1 to 1 1/2 quart baking dish with the butter. Arrange a layer of half the potatoes in the dish, then a layer of half the onions, and then a layer of half the eggs. Season with salt and pepper and a light sprinkling of paprika. Spread with half the sour cream. Repeat with the remaining potatoes, onions and eggs, and season to taste with salt and pepper. Spread with remaining sour cream, and sprinkle with paprika."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the baking dish, and place in the center rack of the oven. Bake for 45 minutes. If desired, serve with a green salad."}], "link": "https://cooking.nytimes.com/recipes/1015584-hungarian-potato-and-egg-casserole"}