{"@context": "http://schema.org", "@type": "Recipe", "name": "Balkan Eggplant and Chile Purée", "description": "This is an eggplant-centric version of ajvar (pronounced “eye-var), the Balkan red pepper and eggplant relish. Serve it with toasted pita triangles or warm pita bread. It differs from other eggplant purées because once the eggplant is cooked and puréed with the other ingredients, the purée itself is simmered until thick.  \n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/09/23/health/24recipehealth-span/24recipehealth-span-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Makes about 1 1/2 cups", "recipeCuisine": "eastern european", "recipeCategory": "dips and spreads", "keywords": "appetizer, chili, eggplant, dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-sodium, low sugar, nut-free, vegan, vegetarian, fall, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 68}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 209, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "6 grams", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "508 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds eggplant (2 medium)", "Olive oil", "2 to 3 small chiles, preferably red ones", "2 tablespoons tomato paste", "Salt to taste", "2 to 3 teaspoons paprika", "2 garlic cloves, cut in half, green shoots removed", "1/4 cup extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Line a baking sheet with foil or parchment and oil lightly with olive oil. Cut the eggplants in half lengthwise, then with the point of a knife score them down to the skin, but not through it. Place cut side down on the oiled baking sheet, and bake for 30 minutes, until thoroughly softened and beginning to collapse. Remove from the oven and place, cut side down, in a colander in the sink. Leave to drain and cool for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the chiles over a burner flame, or under the broiler, until charred. Transfer to a bowl, cover tightly and allow to cool. Put on plastic gloves and peel and seed the chiles. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the eggplant and purée in a food processor fitted with the steel blade. Add the chiles to the food processor, along with the tomato paste and salt to taste. Process until everything is blended together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the garlic and 1/4 teaspoon salt in a mortar and pestle and mash until you have a smooth purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of olive oil over medium heat in a medium-size nonstick skillet and add the garlic. Cook for about 30 seconds, then stir in the paprika. Cook, stirring, for about 30 seconds, then stir in the eggplant purée. Bring to a simmer and cook stirring, until the purée is quite thick. Stir in the remaining olive oil, taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat, cool and transfer to a jar. Place a thin film of olive oil over the top if storing."}], "link": "https://cooking.nytimes.com/recipes/1015145-balkan-eggplant-and-chile-puree"}