{"@context": "http://schema.org", "@type": "Recipe", "name": "Moroccan Carrot Dip", "description": "This vegan dip from America's Test Kitchen has a bright, spiced flavor that goes beautifully with pita chips.  To retain the appealing, brilliant orange color, be careful not to brown the carrots when cooking them.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dips and spreads", "keywords": "appetizer, carrot, whole wheat pita, dairy-free, gluten-free, kosher, nut-free, vegan, vegetarian, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 122}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "2 pounds carrots (about 12), peeled and sliced ¼ inch thick", "Salt", "Pepper", "2 garlic cloves, minced", "3/4 teaspoon ground coriander", "3/4 teaspoon ground cumin", "3/4 teaspoon ground ginger", "1/8 teaspoon chili powder", "1/8 teaspoon ground cinnamon", "1/3 cup water", "1 tablespoon white wine vinegar", "1 tablespoon minced fresh cilantro", "4 (8 inch) whole-wheat pita breads, cut into 6 wedges", "Olive oil spray", "1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Dip", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil in a large saucepan over medium-high heat until shimmering. Add the carrots and 1/2 teaspoon salt and cook until they begin to soften, 5 to 7 minutes. Stir in the garlic, coriander, cumin, ginger, chili powder and cinnamon and cook until fragrant, about 30 seconds. Add the water and bring to a simmer. Cover, reduce the heat to low, and cook, stirring occasionally, until the carrots are tender, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Off the heat, mash the carrots with a potato masher, leaving a few coarse pieces for texture. Stir in the remaining 2 tablespoons oil and vinegar. Transfer to a bowl, cover, and refrigerate until the dip is chilled, about 30 minutes. Season with salt and pepper to taste and sprinkle with the cilantro before serving. The dip can be refrigerated in an airtight container for up to 2 days. Season with additional vinegar, salt and pepper to taste and sprinkle with the cilantro before serving."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Pita Chips", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust the oven racks to the upper-middle and lower-middle positions and heat the oven to 350 degrees. Spread the pita wedges, smooth-side down, over 2 rimmed baking sheets. Spray the top of each chip with oil and then sprinkle with the salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the chips until they begin to crisp and brown lightly, 8 to 10 minutes. Flip the chips over so their smooth side is facing up and continue to bake until the chips are fully toasted, 8 to 10 minutes longer. Remove the baking sheets from the oven and let cool before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make Garlic-Herb Pita Chips, mix 1½ teaspoons garlic powder and 2 tablespoons minced fresh thyme, basil, or oregano with the salt before sprinkling it over the chips in step 1."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make Chili-Spiced Pita Chips, mix 1 tablespoon chili powder (or you can substitute curry powder or smoked paprika), ½ teaspoon garlic powder, and a pinch cayenne pepper with the salt before sprinkling it over the chips in step 1."}]}]}