{"@context": "http://schema.org", "@type": "Recipe", "name": "Maple-Glazed Fresh Ham With Hard Cider Sauce", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT3H", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "pork", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 15}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1163, "unsaturatedFatContent": "36 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "65 grams", "fiberContent": "4 grams", "proteinContent": "61 grams", "saturatedFatContent": "23 grams", "sodiumContent": "1209 milligrams", "sugarContent": "57 grams", "transFatContent": null}, "recipeIngredient": ["1 cup kosher salt (if brining)", "3/4 cup sugar (if brining)", "1 8- to 10-pound butt or shank portion fresh ham (half a leg), skin on", "1 1/2 cups raisins", "1/2 cup dark rum", "1 cup packed dark brown sugar", "2/3 cup fresh sage leaves", "4 teaspoons dry mustard", "4 teaspoons finely grated lemon zest (from about 2 lemons)", "8 cloves garlic, peeled", "4 teaspoons kosher salt", "4 teaspoons black peppercorns", "1 cup maple syrup", "1 liter hard apple cider (or substitute regular apple cider)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If brining the ham, combine salt and white sugar with 2 quarts water in a pot large enough to fit the ham comfortably. Stir well to dissolve. Add ham, cover, and place in refrigerator for 12 to 24 hours. Remove, rinse well, and dry with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine raisins and rum and allow to sit while ham cooks, at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 500 degrees. Place brown sugar, sage, mustard, lemon zest, garlic, salt and peppercorns in a blender or a food processor fitted with a steel blade, and process until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife, score entire surface of ham in a crosshatch pattern, cutting down just through skin to the flesh underneath. (If you are cutting to the right depth, the skin will spread apart a bit as you cut.) Rub outside of ham all over with spice mixture, pressing it gently into crosshatch spaces between the skin. Put roast on a rack in a large roasting pan and place in oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 20 minutes, reduce oven setting to 300 degrees. After 1 hour, begin painting ham every 15 minutes or so with maple syrup. Continue roasting until the very center of ham reaches an internal temperature of 145 degrees, 2 to 2 1/2 hours total cooking time. (Begin checking at 1 1/2 hours to be sure.) To check for doneness, insert a meat thermometer into the absolute center of the roast, let it sit for 5 seconds, then take the reading."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While ham is cooking, place cider in a medium saucepan and bring to a boil over high heat. Reduce heat to medium high, and simmer vigorously until liquid is reduced by about half, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ham is done, remove it from roasting pan, cover it loosely with foil, and allow it to rest for 20 to 30 minutes. Tip roasting pan to the side so you can spoon off all the fat from pan juices, then place pan on stove over medium-high heat. Add reduced cider, and bring to a simmer, scraping bottom of pan to free the browned bits. Skim any film off surface and season liquid as needed with salt and pepper. Add rum-soaked raisins, along with any remaining rum, and stir to combine. Pour into a gravy boat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carve ham into thick slices, drizzle with raisin-cider sauce and serve, passing remaining sauce separately."}]}