{"@context": "http://schema.org", "@type": "Recipe", "name": "Pappardelle With Beets, Beet Greens and Goat Cheese", "description": "If you don’t mind eating pink pasta and you like beets with goat cheese, you’ll love this. I roasted my beets, blanched the greens and paired them with wide pappardelle noodles and goat cheese, both excellent partners. Make sure that you don’t drain the water from the pasta pot when the noodles are done (lift them out with a pasta insert or with a skimmer), as you need some of the cooking water to thin out the goat cheese.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/11/23/science/24recipehealth/24recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H10M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "kosher, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 39}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 421, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "6 grams", "proteinContent": "17 grams", "saturatedFatContent": "5 grams", "sodiumContent": "515 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 bunch beets, with a generous bunch of greens attached", "Salt to taste", "1 tablespoon extra virgin olive oil", "1 or 2 garlic cloves, to taste", "10 ounces pappardelle", "4 ounces goat cheese", "Freshly ground pepper", "1 tablespoon chopped chives (optional)", "1/4 cup chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Cut the beets away from the greens, scrub them and place in a baking dish or casserole. For this pasta you will need about 3/4 pound of beets, which may or may not be the entire bunch. Add 1/4 inch of water to the pan, cover tightly and place in the oven. Roast until tender, about 30 minutes for small beets, 40 to 45 for medium and 50 minutes to an hour for large beets. Remove from the heat and allow to cool until you can handle them. Slip off the skins and cut in 1/4-inch dice. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the beets are roasting, stem and wash the greens. Bring a large pot of water, preferably one with a pasta insert, to boil, salt generously and add the greens. Blanch for about 1 minute, just until tender, and transfer to a bowl of ice water. Drain, squeeze out excess water and chop medium-fine. Keep the heat on under the water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy skillet and add the garlic. Cook just until fragrant, about 30 seconds, and stir in the greens, the diced beets, and salt and pepper to taste. Stir together just until coated with oil. Stir in the chives, and turn the heat to low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water in the pot back to a boil and add the pappardelle. Cook al dente. Remove 1 1/2 cups of the pasta water from the pot, stir 1/2 cup of it into the beets and greens, and crumble in the goat cheese. Drain the pappardelle and add to the pan, along with the parsley and another 1/2 cup of the pasta water. Toss together, and if the mixture seems gummy add more of the remaining pasta water. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1015490-pappardelle-with-beets-beet-greens-and-goat-cheese"}