{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Brussels Sprouts, Butternut Squash and Apple", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "2 to 3 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "apple, brussels sprouts, butternut squash, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 87}, "recipeIngredient": ["For the brussels sprouts:", "1 1/2 cups brussels sprouts, trimmed, halved", "2 cups butternut squash, peeled and cut into 1-inch asymmetrical chunks", "2 cups (about 1 large) Honeycrisp, Cortland, or Granny Smith apple, cored and cut into 1-inch asymmetrical chunks", "1 shallot, cut crosswise into 1/4-inch slices", "2 tablespoons olive oil", "5 fresh sage leaves", "Salt and freshly ground pepper", "1/2 tablespoon maple syrup", "For the walnuts: (purchased candied walnuts may be substituted)", "6 cups vegetable oil", "6 ounces walnut halves", "2 cups confectioners' sugar", "kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. In a large, shallow, baking dish, toss the brussels sprouts, butternut squash, apple and shallot with olive oil and sage leaves. Season with salt and pepper to taste. Bake without stirring until vegetables and apple are wrinkled, slightly brown, and the edges of the squash are beginning to crisp, 45 minutes to 1 hour. Meanwhile, prepare the walnuts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the walnuts: Place a deep fryer or high-sided saucepan over high heat, and add vegetable or canola oil to come no closer than 3 inches from the top of the pot; when walnuts are added the oil will bubble and rise. Heat to 375 degrees. If using a saucepan, reduce heat to very low to hold temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot over high heat, bring 4 cups water to a boil. Add walnuts and boil for 10 seconds. Drain well and immediately toss with confectioners’ sugar. Spread flat on a baking sheet and allow to dry for a few minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Have baking sheet lined with paper towels nearby. Working in batches if necessary, add walnuts to oil and stir once or twice. Fry until amber-brown, about 30 seconds. Using a wire skimmer or heatproof slotted spoon, remove walnuts from oil, and transfer to paper towels. Sprinkle lightly with salt and allow to cool for 5 minutes before handling. May be stored in an airtight container at room temperature for up to three days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: Remove vegetables from oven, drizzle with maple syrup and sprinkle with 2 to 3 tablespoons of halved or roughly crumbled walnut pieces. Serve, if desired, with walnut bread."}]}