{"@context": "http://schema.org", "@type": "Recipe", "name": "Brown Sugar Pork Ribs", "description": "", "author": {"@type": "Person", "name": "David Latt"}, "image": null, "totalTime": "PT12H", "recipeYield": "4 servings", "recipeCuisine": "barbecue", "recipeCategory": "dinner, lunch", "keywords": "pork, ribs", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 15}, "recipeIngredient": ["1 rack of pork ribs", "1/2 teaspoon cayenne", "1 pound brown sugar", "1/4 cup kosher salt", "Pepper", "6 ounces tomato paste", "1 small yellow onion (peeled, finely chopped)", "2 cloves garlic (peeled, finely chopped)", "Olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim excess fat, the membrane, and flap from the ribs. Reserve the flap, trimmed of its membrane, to grill for tacos. Spread a piece of plastic wrap on the counter 5” longer than the rack. Dust the meat side of the ribs with the cayenne."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the brown sugar and kosher salt.  Spread half the dry mix on the plastic wrap. Lay the ribs on top, then cover with the rest of the dry mix. Cover with a second piece of plastic wrap, seal, fold in half and place into a Ziploc or plastic bag. Refrigerate in a pan overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the morning remove the ribs. The dry mix will have transformed into a slurry.  In a sauce pan sauté the onions and garlic with olive oil until lightly browned; season with pepper. Remove the ribs from the plastic bag. Use a rubber spatula to remove most of the liquid from the ribs and plastic bag and transfer to the sauce pan. Add the tomato paste. On a low flame simmer the sauce for 20 minutes. Taste and adjust the flavor if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large baking tray with tin foil. Place a wire rack on top of the baking tray, then put the ribs on the rack. The ribs can either be cooked in a 350 degree oven or on the “cold” side of a covered grill with the heat on high. Cook the ribs 30 minutes on each side, then baste the ribs with the sauce another 30 minutes on each side or until done. Remove from the oven, cut apart the individual ribs, and serve."}], "link": "https://cooking.nytimes.com/recipes/1015519-brown-sugar-pork-ribs"}