{"@context": "http://schema.org", "@type": "Recipe", "name": "Ginevra Iverson’s Chocolate Hazelnut Ice Cream", "description": "This recipe came to The Times from Ginevra Iverson, a chef and former owner of Calliope in New York. To make this luscious ice cream, she melts a few tablespoons of butter along with the gianduja (hazelnut-imbued chocolate) before whisking it into the custard. The only potentially tricky part is combining those two mixtures; the custard and melted gianduja need to be the same temperature, otherwise you could break the two emulsions and the whole thing will contract and curdle. Feel free to substitute plain old Nutella for the gianduja, and when folding the roasted hazelnuts in, mind the nut dust you sometimes get from peeling them.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/05/21/dining/dj-take/dj-take-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 1 1/2 pints", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "dessert, gianduja, hazelnut", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "recipeIngredient": ["3/4 cup hazelnuts", "6 ounces gianduja (chocolate-hazelnut) paste (about 3/4 cup)", "2 tablespoons unsalted butter", "1 cup half-and-half", "3/4 cup granulated sugar", "Pinch salt", "1 vanilla bean, split and scraped", "6 egg yolks", "2 cups heavy cream", "Melted bittersweet chocolate, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and spread hazelnuts on a rimmed baking sheet. Toast in the oven for 10 minutes, or until fragrant. Let cool for about 10 minutes (or until cool enough to handle but still warm) and rub the nuts in a dish towel to remove most of the skins (some will cling and that’s O.K.)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, melt together gianduja paste and butter, either over a pot with 1 inch of simmering water or in a microwave. Keep mixture warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, bring the half-and-half, sugar, salt and vanilla bean to a simmer until the sugar melts, taking care not to boil. Stir occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place egg yolks in a small bowl. Slowly whisk in a 1/4 cup of the hot half-and-half mixture, whisking constantly and carefully so as not to scramble the yolks. Slowly pour the egg mixture back into the remaining half-and-half, whisking constantly. Heat the custard through, but do not simmer. If you see curdled clumps in your custard, pass through a fine strainer before continuing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While whisking constantly, slowly pour the warm custard into the warm melted chocolate (you want the two mixtures to be the same temperature). Once the chocolate custard is thoroughly combined and smooth, whisk in heavy cream. Cover custard and transfer to the refrigerator to chill for at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour chocolate hazelnut custard into an ice cream machine and chill according to the manufacturer’s instructions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold whole hazelnuts into ice cream, excluding any powder from the nuts (it just feels gritty on the tongue). Serve at once or freeze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, drizzle with melted bittersweet chocolate."}], "link": "https://cooking.nytimes.com/recipes/1015051-ginevra-iversons-chocolate-hazelnut-ice-cream"}