{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheese Pumpkin Soup With Sage and Apple", "description": "For cooking, forget the giant pumpkins that are meant for life as jack o’lanterns. The flat, lesser known heirloom variety called the Long Island cheese pumpkin is the prizewinner. This sweet, beige pumpkin gets its name from its resemblance to a wheel of cheese. Making pumpkin soup is a go-to way to prepare the fruit. As with any soup, the key is the quality of stock used. It should add flavor, but not too much or it will eclipse the taste of the pumpkin. Vegetable stock is the best choice here. Roasting the pumpkin with the seeds intact (except for a handful to be used as garnish) intensifies the flavor and adds a slight nuttiness to the soup. Adding sage and some raw apple brings aroma and acidity to the recipe. Finish with pumpkin oil for added richness.", "author": {"@type": "Person", "name": "Jeff Schwarz And Greg Kessler"}, "image": "https://static01.nyt.com/images/2014/02/07/dining/recipe-cheese-pumpkin-soup/recipe-cheese-pumpkin-soup-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4-6 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "apple, carrot, pumpkin, sage, stock, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 105}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 482, "unsaturatedFatContent": "34 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1432 milligrams", "sugarContent": "15 grams", "transFatContent": null}, "recipeIngredient": ["1 cheese pumpkin, cut in half from stem to bottom", "2 carrots, peeled", "1 medium onion", "6 cups vegetable stock", "12 sage leaves", "1 cup plus 2 tablespoons olive oil", "2 apples, peeled and halved, cores removed, chopped", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove about 1 cup of seeds from the pumpkin halves. Clean off any pumpkin meat from the seeds before setting them aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub the pumpkin halves with 1 tablespoon of olive oil and place them seed side down on a sheet tray lined with aluminum foil. Cook in the oven for about 50 minutes or until a sharp knife easily pierces the skin and flesh."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut the carrots and onion into a medium dice and sauté them in the remaining tablespoon of olive oil over low heat until tender. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 cup of olive oil in a small saucepan over medium heat. When it begins to simmer, add 3 to 4 sage leaves at a time, frying them for about 6 to 8 seconds each. Remove the leaves with tongs or a slotted spoon and place on a plate lined with paper towels. Continue this process until all the sage is fried. Turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately place the reserved pumpkin seeds in the leftover, sage-infused oil, for about 20 seconds or until they begin to brown. Pour the contents of the pan into a metal strainer set over a metal bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the seeds on a plate lined with paper towels and sprinkle generously with salt. Set the oil aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pumpkin is cooked, remove it from oven and let it cool for 10 minutes. Then remove and discard any seeds from the flesh."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop out the pumpkin meat from one pumpkin half and place it in a blender. Add half of the cooled carrots and onions, and one chopped apple to the blender. Add vegetable stock to the ¾ mark on the blender and close the lid. Blend on low, then gradually increase the speed as the ingredients combine. Pour the contents into a large pot or bowl. Repeat with the remaining sautéed carrots and onions, chopped apple and vegetable stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: ladle soup into bowls. Garnish with pumpkin seeds, 2 to 3 sage leaves and a drizzle of the reserved pumpkin-sage oil."}]}