{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Sweet Potato Oven Fries", "description": "I don’t know what I like best about these sweet wedges – the way the sweet potato skins crisp and caramelize, the creamy texture of the sweet flesh, or the subtle flavors of the spices and infused oil.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/01/14/science/15recipehealth/15recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, quick", "keywords": "appetizer, side dish, dairy-free, gluten-free, halal, healthy, high fiber, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 189}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 400, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "9 grams", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "587 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["2 inches lemon grass stalk, hard papery layers discarded, the rest coarsely chopped", "1 tablespoon coarsely chopped ginger", "Salt to taste", "1/4 cup extra virgin olive oil", "2 pounds orange-fleshed sweet potatoes, also sold as yams", "1/2 teaspoon cumin seeds, lightly toasted and coarsely ground", "1/2 teaspoon coriander seeds, lightly toasted and coarsely ground"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chopped lemon grass and ginger in a mortar and pestle and add a generous pinch of kosher salt. Pound and grind until you have obtained a coarse paste. Add 1 tablespoon of the olive oil and work the ingredients together with the pestle. Scrape into a small saucepan and add the remaining olive oil. Stir together and bring to a very gentle sizzle over medium-low heat. Sizzle, shaking or swirling the pan often, for 2 minutes and turn off the heat. Allow the mixture to steep for 30 minutes. Strain into a large bowl, pressing the ginger and lemon grass against the strainer to extract all of the oil. You should have 3 tablespoons of oil. Add a little more olive oil if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile preheat the oven to 400 degrees. Line a baking sheet with parchment and brush the parchment with olive oil. Cut the sweet potatoes in half lengthwise. If they are very long, cut the halves in half crosswise as well. Cut each half into 4 long wedges – smaller sweet potatoes will yield 8 wedges, larger will yield 16."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the sweet potato wedges in the bowl with the oil. Add the ground cumin and coriander, and salt to taste, and toss together until the wedges are thoroughly coated with oil. Place on the baking sheet in a single layer (use 2 baking sheets if necessary). Place in the oven and set the timer for 10 minutes. Turn the wedges over and roast for another 10 minutes. Turn the wedges again and roast for another 5 to 10 minutes, depending on the thickness of the wedges and how fast they are caramelizing. The wedges should be tender when pierced and there should be some caramelized bits, especially at the thin tips. Remove from the heat and allow to cool slightly before eating."}], "link": "https://cooking.nytimes.com/recipes/1015948-roasted-sweet-potato-oven-fries"}