{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Oat Groats", "description": "“Groat” — not to be confused with “grit” — is an old Scottish term for a dehulled oat kernel. Like steel-cut oats, which are just pieces of groat that get broken during dehulling, groats have been prepared and eaten as hot cereal or gruel for centuries, sustaining generations of hard-working farmers and laborers. These days, it’s fortifying the food elite. Quinn and Karen Hatfield of Hatfield’s in Los Angeles use the hearty grain as inspiration for an elegant (some might even say delicate) vegetarian entrée of wild-mushroom “cannelloni.” To make the dish, creamy, hollandaise-enriched groats flecked with herbs and lemon zest are combined with mushrooms and then stuffed into oat crepes.", "author": {"@type": "Person", "name": "Merrill Stubbs"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Serves 4 as a side dish", "recipeCuisine": "", "recipeCategory": "breakfast, dinner, lunch", "keywords": "egg, oat groats, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 572, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "34 grams", "sodiumContent": "338 milligrams", "sugarContent": "3 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["1 cup oat groats", "Salt", "½ pound plus 2 tablespoons unsalted butter", "2 large egg yolks", "2 teaspoons lemon juice", "2 medium shallots, finely chopped", "Zest of 1 lemon", "1 tablespoon finely chopped chives", "1 tablespoon finely chopped tarragon", "1 tablespoon finely chopped parsley", "Freshly ground black pepper."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the groats in a 2-quart saucepan with 1½ quarts water and 1 teaspoon salt. Bring to a simmer over medium heat and cook 30 to 40 minutes, stirring every once in a while, until the groats are tender but still have a pleasant chew. Strain the groats and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the hollandaise: dice ½ pound of the butter into ½-inch cubes and allow to sit out at room temperature. Set up a double boiler with about an inch of water in it, or a 2-to-3-quart saucepan with a round metal bowl that fits securely in the pot without touching the top of the water. Bring the water to a gentle simmer on the stovetop, without the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl, whisk the yolks with ½ ounce cool water and set it over the gently simmering water. Whisk constantly until the yolks thicken considerably, begin to hold a slight peak and are very warm to the touch, 2 to 5 minutes. (Be careful: if the water is too hot, the eggs will curdle. If you see a slight graininess begin to form at the edge, pull the bowl off the saucepan and allow it to cool before continuing, still whisking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the yolks have thickened, begin adding the butter, a few cubes at a time. Whisk constantly over the heat, steadily adding the butter until it has all been incorporated. Remove the hollandaise from the heat and add the lemon juice and salt to taste. Keep the hollandaise in a warm place (like on an unlit burner on the stovetop) for up to an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide sauté pan, melt the remaining 2 tablespoons butter over medium-low heat and add the shallot and a large pinch of salt. Cook the shallot gently, without letting it color, until it is tender and aromatic, 2 to 3 minutes. Add the cooled groats and stir well to reheat. When hot, turn off the heat and add about a cup of the hollandaise to create a creamy consistency; the quantity you add is your preference, but the groats should not become soupy or get lost in the sauce. Working quickly so that the heat of the groats doesn’t split the hollandaise, add the lemon zest, herbs, and salt and pepper to taste. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1015342-creamy-oat-groats"}