{"@context": "http://schema.org", "@type": "Recipe", "name": "Frittata with Bread and Bottarga", "description": "Going out on New Year’s Eve has always been, according to my parents, for amateurs. Their long-standing alternative: stay home and eat well. The ritual starts with caviar and Champagne. Then Dad might prepare steak tartare and Mom, a chocolate soufflé. Good stuff. Now, all grown up (and then some), I realize they’re on to something. A low-key, intimate gathering starring good food is my preferred way to ring in the new. But in these lean times — and in my significantly smaller kitchen — putting out a succulent spread and entertaining the troops chez moi calls for some creativity. This frittata can be cut in half and served as a meal for two with a bitter chicory salad, or sliced into strips and put into a salad of its own.", "author": {"@type": "Person", "name": "Charlotte Druckman"}, "image": null, "totalTime": "PT25M", "recipeYield": "6 to 8 snack-size slices", "recipeCuisine": "italian", "recipeCategory": "quick", "keywords": "bottarga, bread, eggs, sea salt", "aggregateRating": null, "recipeIngredient": ["6 eggs", "2 teaspoons sea salt", "2 tablespoons chives, chopped", "Stale, crusty loaf of good Italian bread (Pugliese or ciabatta)", "Bottarga du tonno (for shaving)", "Olive oil (for the pan and for drizzling)", "A healthy dollop of sour cream or crème fraîche", "Freshly ground coarse black pepper to taste."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crack eggs into a mixing bowl. Add sea salt and chives. Whisk with a fork until whites and yolks are fully incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tear bread into large, bite-sized croutons and drop into the egg mixture; use enough bread to cover the surface area of the frittata to achieve something halfway between a bread pudding and an omelet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat an ovenproof, 10-to-12-inch omelet pan over low-medium flame. Pour olive oil into pan, enough to coat and then some. You want sizzle, not smoke."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour frittata mixture into the pan. Gently jiggle the pan to get a “pizza effect” (i.e., the chives and bread pieces are evenly distributed). Increase the flame to high to let the bottom of the frittata set (this takes 1 to 3 minutes). While it’s setting, use a spatula to loosen the eggy batter from the sides of the pan. As you do this, you are raising the frittata from above to cool it off so it stays loose. The bottom should set like a pie crust: even and golden, but not brown. The top should still be liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Move the pan into the oven to cook the top. This should take less than 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To garnish, shave bottarga over the top (about 1 tsp. per serving); drop a large dollop of sour cream or crème fraîche in the center; drizzle with olive oil and add cracked pepper to taste."}]}