{"@context": "http://schema.org", "@type": "Recipe", "name": "Buttery French TV Snacks", "description": "Good butter is the key to these easy, delectable cookies. Before the pastry chef Anita Chu began work on her “Field Guide to Cookies” (Quirk Books), she was a Berkeley-trained structural engineer with a baking habit she couldn’t shake. One of her favorite cookies is the croq-télé, or TV snack, a chunky cookie she adapted from the Paris pastry chef Arnaud Larher. “There is no leavening to lift it, no eggs to hold it together,” she said. “It’s all about the butter.”", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/24/dining/French-TV-Snacks/French-TV-Snacks-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 2 dozen cookies.", "recipeCuisine": "french", "recipeCategory": "easy, weekday", "keywords": "appetizer, dessert, butter, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 296}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 92, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "2 grams", "sodiumContent": "41 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup blanched almonds or hazelnuts, lightly toasted and cooled to room temperature", "1/2 cup sugar", "1/2 teaspoon kosher or flaky sea salt (if using fine or table salt, use 3/8 teaspoon)", "1 cup all-purpose flour", "7 tablespoons cold unsalted butter, cut into 1/2-inch pieces."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Position 2 oven racks in top third and bottom third of oven. Preheat oven to 325 degrees. Line two cookie sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, grind nuts, sugar and salt to a fine meal. In a mixer, beat flour and butter together on low speed until texture is sandy. Add nut mixture and mix on low until dough starts to form small lumps; keep mixing until dough just holds together when pinched between fingers. Do not use wet fingers: the cookies will collapse."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pinch off about a teaspoon of dough and place in palm of your hand. With tips of fingers, pinch and press dough together until cookie has a flat bottom and pointed top, like a rough pyramid. Cookies need not be perfectly smooth or equal size. Place on parchment about 1 inch apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake about 15 minutes, rotating cookie sheets halfway through. Cookies should be turning golden brown on edges. Cool on sheets 5 minutes, then transfer to wire racks and cool completely before storing in airtight containers up to 1 week."}]}