{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Cheek Goulash", "description": "", "author": {"@type": "Person", "name": "Pete Wells"}, "image": "https://static01.nyt.com/images/2014/04/09/dining/Beef-Cheek-Goulash/Beef-Cheek-Goulash-articleLarge-v2.jpg", "totalTime": "PT6H", "recipeYield": "6 to 8 main-course servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 436, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "6 grams", "proteinContent": "46 grams", "saturatedFatContent": "7 grams", "sodiumContent": "1002 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/3 cup rendered duck fat or safflower oil", "5 large onions (2 pounds), halved and thinly sliced", "5 red bell peppers, trimmed and roughly chopped", "3/4 cup tomato paste", "1 tablespoon plus 2 teaspoons sweet paprika", "1 1/2 teaspoons hot paprika", "2 tablespoons red wine vinegar", "2 tablespoons dried marjoram", "1 tablespoon finely chopped garlic", "2 teaspoons caraway seeds, toasted and freshly ground", "1/8 teaspoon grated lemon zest", "2 teaspoons finely chopped fresh marjoram, plus additional for garnish", "1 1/2 teaspoons finely chopped fresh thyme", "1/4 teaspoon finely chopped fresh rosemary", "3 1/2 pounds beef cheeks, trimmed and halved, or 3 1/2 pounds deckle (second cut) brisket, cut into 2-inch chunks", "Salt and pepper", "2 tablespoons pickling liquid from a jar of cornichons or other sour pickles, or apple cider vinegar, to taste."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy pot over medium-low heat, melt the duck fat (or heat the oil) and add the onions. Reduce heat to very low and cook slowly cook, stirring occasionally, until onions are a very dark brown, 1 1/2 to 2 hours. If necessary, toward the end of cooking, raise heat to medium and stir constantly until onions are browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the red peppers in a steamer over boiling water and steam until very soft, 15 to 20 minutes. Transfer peppers to a food mill or blender and purée (straining afterward if using a blender). You should have 3/4 cup purée; reserve any remainder for another use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomato paste to the onions and cook until paste darkens, about 5 minutes. Add the sweet and hot paprikas and mix well. Add 7 cups water, the red pepper purée, the vinegar, dried marjoram, garlic, ground caraway seeds and lemon zest. Add half of each of the fresh marjoram, thyme and rosemary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the beef cheeks generously with salt and pepper and add them to the pot. Bring liquid to a bare simmer and cook partly covered, stirring only 3 or 4 times, for at least 3 hours, then add the rest of the fresh herbs and begin to check the cheeks’ tenderness with a fork. They are done when they fall easily from the fork, after about 4 hours. They should be meltingly tender, but not fall apart. As some pieces will take longer than others, pull them from the liquid as they are done. Spread the cooked beef cheeks in a single layer on a baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the cheeks are done, pass the cooking liquid through a colander. (Don’t use a sieve, as you want to push tiny bits of onion through to make a slightly chunky sauce.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the sauce over the cheeks and season to taste with salt, pepper, additional fresh marjoram and cornichon juice. Serve immediately, very hot, or reheat by covering baking sheet and returning cheeks to oven at 350 degrees."}], "link": "https://cooking.nytimes.com/recipes/1015258-beef-cheek-goulash"}