{"@context": "http://schema.org", "@type": "Recipe", "name": "Cornmeal Coconut Biscotti", "description": "When I use a grainy flour like cornmeal I always include some fat in the biscotti, and this time I went with coconut oil, which contributes great flavor and a sweet perfume. Use fine or medium-grind cornmeal and make sure to use fine coconut flakes. I used organic sugar (not brown) for these; the sugar is off-white rather than white, and coarser than regular granulated sugar.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/11/05/science/08recipehealth/08recipehealth-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "3 dozen biscotti ", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "dairy-free, halal, healthy, kosher, low cholesterol, low-sodium, vegetarian, dessert, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 78, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "3 grams", "sodiumContent": "27 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["125 grams (approximately 1 cup) whole wheat flour", "30 grams (approximately 1/4 cup) all-purpose flour", "125 grams (approximately 3/4 cup) fine or medium-ground cornmeal", "90 grams (approximately 1 cup) unsweetened fine coconut flakes", "5 grams (approximately 1 teaspoon) baking powder", "Pinch of salt", "55 grams (2 ounces) coconut oil", "125 grams (2/3 cup tightly packed) organic sugar", "165 grams (3 large) eggs", "5 grams (approximately 1 teaspoon) vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Line a baking sheet with parchment. Whisk together the flours, cornmeal, coconut flakes, baking powder and salt in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer, or in a large bowl with a whisk or electric beater, beat together the coconut oil and sugar at medium speed for 2 minutes. Scrape down the sides of the bowl and the beater. Add the eggs and vanilla and beat together for another minute. Scrape down the sides of the bowl and the beater. Turn off the mixer and add the flour mixture. Mix in at low speed until combined. The batter will be moist and sticky. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spatula or a bowl scraper, scrape out half the batter onto the baking sheet. Moisten your hands so the dough won’t stick, and form a log, about 10 inches long by 2 1/2 inches wide. Repeat with the other half of the batter. The logs can be on the same baking sheet but make sure there is at least 2 inches of space between them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven and bake 40 to 45 minutes, until lightly browned, beginning to crack on the top, and dry. Remove from the oven and cool on a rack for 20 minutes (or longer). Place on a cutting board and cut 1/2 inch slices straight across the logs. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cookies on baking sheets and return, one sheet at a time, to the middle rack of the oven. Bake 15 minutes and flip the biscotti over. Bake another 10 minutes, or until lightly browned. Remove from the heat and allow to cool."}]}