{"@context": "http://schema.org", "@type": "Recipe", "name": "Brandied Pumpkin Pie", "description": "Pumpkin pie made with canned pumpkin is all well and good, but pumpkin pie made with fresh butternut squash purée is even better. Thin-skinned and easy to cut, butternut squash turns soft and velvety if you roast it, and a quick whirl in the food processor or a blender quickly reduces to it to a luscious purée. Here we’ve kept the seasonings on the light side to best showcase the character of the squash. But feel free to amp up the cinnamon and ginger if you like a spicier slice. The brandy is optional, and if you’d rather not use it, you can leave it out (or substitute another spirit; bourbon is excellent). If you bake the pie a day ahead, keep it covered at room temperature until serving time — the refrigerator wreaks havoc on the crust. (Don't let making your own pie crust intimidate you: our <a href=\"http://cooking.nytimes.com/guides/how-to-make-a-pie-crust \">pie guide</a> has everything you need to know.)", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/11/11/multimedia/clark-brandied-pumpkin/clark-brandied-pumpkin-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts, times classics", "keywords": "dessert, fall, pumpkin, squash", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1052}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 428, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "17 grams", "sodiumContent": "267 milligrams", "sugarContent": "22 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 cups all-purpose flour (150 grams)", "1/4 teaspoon fine sea salt", "10 tablespoons (141 grams) unsalted butter (1 1/4 sticks), preferably a high-fat, European style, chilled and cubed", "2 to 4 tablespoons ice water, as needed", "1 3/4 cups squash or pumpkin purée (see note)", "3 large eggs", "1 cup heavy cream", "3/4 cup dark brown sugar (160 grams)", "2 tablespoons brandy", "2 teaspoons ground ginger (4 grams)", "1 1/2 teaspoons ground cinnamon (3 grams)", "1/2 teaspoon kosher salt (3 grams)", "1/4 teaspoon grated nutmeg", "Pinch ground clove"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: In a food processor, pulse together the flour and salt. Add butter and pulse until the mixture forms chickpea-size pieces. Add ice water, 1 tablespoon at a time, and pulse until the dough just comes together. It should be moist, but not wet. On a lightly floured surface, gather the dough into a ball. Flatten into a disk with the heel of your hand. Cover tightly with plastic wrap and refrigerate for at least 1 hour and up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll out dough to a 12-inch circle. Transfer crust to a 9-inch pie plate. Fold over any excess dough, then crimp edges. Prick crust all over with a fork, then chill crust for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the dough chills, heat oven to 375 degrees. Line chilled crust with aluminum foil and fill with pie weights or dried beans. Bake for 20 minutes; remove foil and weights and bake until pale golden, 5 to 7 minutes more. Cool on rack until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower oven temperature to 325 degrees. In a large bowl, whisk together the pumpkin purée, eggs, cream, dark brown sugar, brandy, ginger, cinnamon, 1/2 teaspoon salt, the nutmeg and clove. Pour mixture into the cooled pie shell. Transfer pie to a large baking sheet. Bake until crust is golden and center jiggles just slightly when shaken, 50 to 60 minutes. Cool completely before serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Fresh Pumpkin Pie", "description": "Melissa Clark’s trick for making creamy pumpkin pie: use fresh butternut squash instead of canned pumpkin.", "thumbnailUrl": "https://static01.nyt.com/images/2014/11/11/multimedia/clark-brandied-pumpkin/clark-brandied-pumpkin-mediumThreeByTwo440.jpg", "uploadDate": "2014-11-14T15:37:39.000Z", "duration": "PT3M23S"}, "link": "https://cooking.nytimes.com/recipes/1015413-brandied-pumpkin-pie"}