{"@context": "http://schema.org", "@type": "Recipe", "name": "April Bloomfield's Clam Chowder", "description": "Fish chowder is the type of dish you might find in England at a country pub or in a fishing village. But the addition of Quahog clams and intensely flavorful Long Island sweet corn makes this particular chowder unmistakably American, and, with its hearty vegetables, bacon, potatoes and cream, a great dish for the Thanksgiving table. I usually like to start cooking early on Thanksgiving and potter around the kitchen, enjoying the warm steamy kitchen and the smells of chowder and pumpkins roasting. It reminds me of what I give thanks for every year: the warmth and comfort of family and friends, who gather around the pot with their bowls.", "author": {"@type": "Person", "name": "April Bloomfield"}, "image": "https://static01.nyt.com/images/2013/11/27/dining/27MEMBLOOMFIELD1/27MEMBLOOMFIELD1-mediumThreeByTwo440.jpg", "totalTime": "PT1H45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "appetizer, main course, clams, corn", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 67}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 507, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "2 grams", "proteinContent": "14 grams", "saturatedFatContent": "17 grams", "sodiumContent": "788 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 tablespoons olive oil", "1/2  onion, sliced", "3 cloves garlic, smashed", "3 to 4 bay leaves", "1 1/2 cups dry white wine", "30 large (15 to 20 pounds) quahog clams, scrubbed", "2 cups heavy cream", "2 cups whole milk", "1 cup diced Yukon Gold or russet potato", "1/4 cup olive oil, plus additional as needed for finishing", "2 slices smoked bacon, cut into 1/4-inch strips", "1 large carrot, cut into 3/4-inch pieces", "2 medium celery stalks, cut into 1/4-inch pieces", "1 large Spanish onion, cut into 3/4-inch pieces", "1/2 cup dry white wine", "2 dried pequin chilies, crumbled, or a pinch or red pepper flakes", "1 cup fresh or frozen corn kernels, defrosted", "1/4 cup roughly chopped celery leaves", "Maldon salt or other flaky sea salt", "1/2 lemon", "1/4 cup roughly chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the clams: In a large stockpot, combine the olive oil, onion, garlic, bay leaves and wine. Bring to a simmer and add the clams. Cook covered, until the clams have opened, about 15 minutes. Remove from heat and allow the clams to cool until they can be handled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove clams from shells, discarding shells and reserving liquid in the pot. Remove the tough foot from each clam, chop finely and place in a bowl. Chop the remaining portion of each clam into medium dice, add to bowl and set aside. Strain cooking liquid through a fine strainer into a separate bowl or pitcher and set aside. You should have as much as 2 quarts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chowder: In a medium pot, combine cream, milk and potatoes. Place over medium-high heat and bring to a boil. Reduce heat to low and simmer until potatoes are tender but still keep their shape, about 15 minutes. Remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large soup pot over medium heat, heat olive oil until almost smoking. Add bacon and sauté until it colors slightly, about 2 minutes. Add carrot, celery stalks and onion, stirring until just tender, about 8 minutes. Stir in clams, then add wine and chiles or pepper flakes. Allow wine to reduce until almost evaporated, then add 4 cups (or as desired) of the reserved clam broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove about half the potato mixture from its pot and purée in a food processor or blender. Add purée to the soup pot with vegetables and clams, along with remaining potato mixture. Bring back to a simmer and add corn. Cook until corn is tender but still has snap, about 5 minutes. Add half the celery leaves and half the parsley leaves, and mix well. Season to taste with salt and a squeeze of lemon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle into bowls and garnish each with a bit of the remaining parsley and celery leaves, and if desired, a drizzle of olive oil."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "April Bloomfield's Clam Chowder", "description": "Mark Bittman describes April Bloomfield’s clam chowder dish as a “very fall, New England dish.” She demonstrates how to make this coarse-chopped soup.", "thumbnailUrl": "https://static01.nyt.com/images/2013/11/27/dining/27MEMBLOOMFIELD1/27MEMBLOOMFIELD1-mediumThreeByTwo440.jpg", "uploadDate": "2013-11-13T22:36:51.000Z", "duration": "PT2M59S"}, "link": "https://cooking.nytimes.com/recipes/1015713-april-bloomfields-clam-chowder"}