{"@context": "http://schema.org", "@type": "Recipe", "name": "Homemade Ginger Beer", "description": "To get the full aromatic flush and fizzy burn of fresh ginger, you have to make your own ginger beer. It is amazingly simple. There’s no sterilization needed, and this method is forgiving — you can actually play about with the levels and ingredients. Moreover, the resulting ginger beer blows anything else you’ve ever had straight out of contention. Take a pinch of packaged yeast and something acidic for the yeast to thrive in (like lemon or lime juice or cream of tartar) along with some sugar syrup and grated ginger, lob it all in a plastic bottle of distilled or spring water, shake it up and stash it somewhere dark and warm for two days. After two days you stop the fermentation by chilling it in the fridge. That’s it. The result is a cloudy, dry mixer with pinprick carbonation and a straight-up goose of fresh ginger. That is thrilling come dark ’n’ stormy hour, not just for its authenticity and superior flavor but also because you can now brag about your homemade ginger beer.", "author": {"@type": "Person", "name": "Toby Cecchini"}, "image": "https://static01.nyt.com/images/2010/08/23/t-magazine/23casestudy-darkstormy/23casestudy-darkstormy-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "non-alcoholic drinks", "keywords": "ginger, lemon, yeast", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 123}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 134, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "0 grams", "proteinContent": "0 grams", "saturatedFatContent": "0 grams", "sodiumContent": "33 milligrams", "sugarContent": "32 grams", "transFatContent": null}, "recipeIngredient": ["2 ounces freshly grated ginger", "4 ounces lemon juice", "6 ounces simple syrup", "1/8 teaspoon commercial baker’s, brewer’s or Red Star Pasteur Champagne yeast", "20 ounces non-chlorinated water (filtered, distilled or spring)", "1 to 4 grams cream of tartar (not necessary, but traditional, to help the yeast and bacteria thrive)."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take a 1.5-liter plastic bottle of spring water and empty it into a clean pitcher. Use some of it to make simple syrup by stirring 1/2 pound sugar into 1 cup hot water until fully dissolved."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large measuring cup, mix all ingredients and stir well. Funnel back into the plastic bottle and cap tightly. Store in a warm, dark place for 24 to 48 hours. (I put mine inside a box, to contain it if it should blow.) The top of the bottle will expand and become tight. Check it and very slowly release the pressure if it’s looking groaningly tight. Some people ferment it with no top, or with the top on loosely, to allow gas to escape. I suppose if you wanted to get fancy you could spend $1.50 on a fermentation lock and stop worrying about it. If the temperature is quite warm, above 80F, a single day may be sufficient. The longer you let it ferment, the drier the final mix will be."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 48 hours, refrigerate it to stop the fermentation. Once chilled, you can strain out the pulp and dead yeast, which will have made a sediment on the bottom. Makes 1 liter and will keep up to a week in the refrigerator."}], "link": "https://cooking.nytimes.com/recipes/1015319-homemade-ginger-beer"}