{"@context": "http://schema.org", "@type": "Recipe", "name": "Swordfish With Lemon and Fennel", "description": "This dish is truly clever weeknight cooking — sophisticated, fast, unfussy and wholly delicious. Swordfish is cut into chunks, which cook faster than steaks, and then is sautéed in olive oil, butter or, for the best results, a combination of the two. The fat protects the fish from the heat of the pan, preventing the fish from drying out. It also provides lots of flavor, as do fennel seeds, garlic, lemon zest and red pepper flakes, which are added to the pan after the fish has cooked for a few minutes. Fennel fronds are a nice garnish, offering their light anise flavor and feathery texture, though you could use chopped fresh basil, parsley or cilantro instead. Cumin or coriander seeds can stand for the fennel seeds, or you can leave them out altogether and double the chile.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Swordfish-With-Lemon-and-Fennel/Swordfish-With-Lemon-and-Fennel-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick", "keywords": "main course, swordfish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 496}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 323, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "1 gram", "proteinContent": "34 grams", "saturatedFatContent": "5 grams", "sodiumContent": "448 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds swordfish steaks, about 1-inch thick", "Kosher salt and freshly ground black pepper", "1/2 teaspoon fennel seeds", "1 1/2 tablespoons olive oil", "1 tablespoon butter", "2 garlic cloves, minced", "Finely grated zest of 1/2 lemon", "1/4 teaspoon crushed red chile flakes, more to taste", "1 tablespoon fresh lemon juice", "2 teaspoons chopped fresh fennel fronds", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife, cut the skin off the swordfish, then cut the fish into 1-inch cubes. Season fish cubes generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mortar and pestle or the flat side of a heavy knife, lightly crush the fennel seeds to release their flavor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet large enough to hold all the fish cubes in one layer, heat the olive oil and butter over medium heat until the butter melts. Add the fish to the pan and let cook, turning the fish and basting with the oil and butter, for 3 minutes. Stir in the garlic, fennel seeds, lemon zest and chile flakes and continue to cook, stirring gently so as not to break up the fish cubes, until the fish is just cooked through, about 2 minutes longer. Gently stir in the lemon juice. Taste and add more salt and chile flakes if desired. Garnish with fennel fronds and lemon wedges."}]}