{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom Ragoût", "description": "I like to use this as a gravy at Thanksgiving, instead of actual gravy, but that is far from its only use. I serve it on its own, as a side dish, as the base for a risotto and a filling for a pie, taco and quesadilla, as a sauce for pasta and an omelet filling. You can make it with all wild mushrooms for a splurge, with some wild mushrooms, or with a mix of cultivated oyster mushrooms (much less expensive than wild mushrooms like chanterelles) and button or creminis. Make this big batch and use it for lots of other dishes throughout the week.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/12/17/science/16recipehealth/16recipehealth-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner", "keywords": "dairy-free, healthy, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian, fall, winter, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 629}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 93, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "357 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 ounce (about 1 cup) dried mushrooms, preferably porcinis", "2 tablespoons extra virgin olive oil", "2 shallots or 1/2 medium onion, finely chopped", "2 garlic cloves, minced", "1 pound white or cremini mushrooms, cleaned, trimmed, and quartered or sliced 1/2 inch thick", "1 pound wild mushrooms, trimmed and brushed clean, or oyster mushrooms, trimmed and torn into pieces if very large", "Salt to taste", "2 teaspoons all-purpose flour", "1/2 cup dry white wine such as sauvignon blanc or pinot grigio", "2 teaspoons chopped fresh rosemary or 1 teaspoon dried", "2 teaspoons chopped fresh thyme", "Freshly ground pepper", "2 to 4 tablespoons finely chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dried mushrooms in a pyrex measuring cup or a bowl and pour on 2 cups boiling water. Let soak 30 minutes, while you prepare the other ingredients. Place a strainer over a bowl, line it with cheesecloth or paper towels, and drain the mushrooms. Save the liquid. Squeeze the mushrooms over the strainer and rinse until they are free of sand. Chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy skillet or a wide saucepan and add the shallots or onion. Cook, stirring often, until tender, 3 to 5 minutes. Add the garlic, stir together for about 30 seconds, until fragrant, then add the fresh mushrooms, rosemary and thyme, and turn up the heat slightly. Cook until the mushrooms begin to sweat, then add a generous pinch of salt. Stir for about 5 minutes over medium-high heat as the mushrooms continue to soften and sweat. Add the flour and continue to cook the mushrooms, stirring, until they have softened a little more and you can no longer see the flour, about 2 minutes. Add the reconstituted dried mushrooms and the wine and turn the heat to high. Cook, stirring, until the liquid boils down and glazes the mushrooms, about 5 minutes. Stir in the dried mushroom soaking liquid, bring to a simmer, add salt to taste, and cook over medium-high heat, stirring often, until the mushrooms are thoroughly tender and fragrant and the surrounding broth is thick, about 10 to 15 minutes. Remove from the heat, stir in some freshly ground pepper and the parsley, taste and adjust salt."}]}