{"@context": "http://schema.org", "@type": "Recipe", "name": "Game Day Nachos", "description": "Here is a heavily-loaded platter of shredded pork inflected with the flavors of cumin, coriander and lime, layered with tortilla chips and sliced radishes, flecks of scallion and leaves of cilantro, drifts of shredded cheddar and lime-scented sour cream, to be accompanied by hot sauce, napkins and beer. It is football-watching food, but doubles nicely as dinner for teens, young adults, anyone interested in the inhaling of the delicious. The pork is an all-day affair, requiring five to seven hours of roasting in a low oven so that the meat achieves a collapsing sweetness beneath a burnished crust. But the rest of the recipe is easy work indeed: bowls of the condiments may be combined on a platter with the shredded meat and diced skin in any manner you deem appetizing.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/01/29/dining/29BOWL_SPAN/29BOWL-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "10 to 12 servings or more", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch", "keywords": "appetizer, main course, cheese, pork, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 195}, "recipeIngredient": ["1 bone-in pork shoulder, butt or picnic ham, 7 to 10 pounds", "Juice of 1 orange", "Juice of 1 lime", "2 tablespoons kosher salt", "2 tablespoons ground cumin", "1 tablespoon plus 1 teaspoon ground coriander", "1 tablespoon dark brown sugar", "1 tablespoon ground black pepper", "4 cloves garlic, peeled and minced", "Finely grated zest of 1 lime", "Juice of 1 lime", "1 cup sour cream", "4 to 5 cups (about 12 ounces) unsalted tortilla chips", "4 radishes, thinly sliced", "1 cup (about 6 ounces) shredded Cheddar", "1 cup coarsely chopped cilantro leaves", "1 cup sliced scallions", "Hot sauce to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pork in a large shallow bowl and pour the orange and lime juice over it, then turn the pork to coat. In a small bowl, mix the salt, cumin, coriander, brown sugar, black pepper and garlic. Discard excess juice from the bowl containing the pork, then rub the pork all over with the spice mixture. Cover with plastic wrap and refrigerate until ready to cook, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300. Remove pork from refrigerator, discard any juices and place in the bottom of a roasting pan. Cook for 5 to 7 hours, or until pork yields easily to the tines of a fork. Allow meat to rest for up to an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, put pork on a cutting board, reserving the pan juices and fat. Using two forks, shred the meat off the bone, chopping it up if desired. Place in a large bowl and moisten with some of the reserved pan juices. Dice as much of the skin as you desire and add it to the meat, mixing to combine. Cover and keep in a warm oven until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the nachos, mix the lime zest and remaining juice into the sour cream in a small bowl, then refrigerate until needed. On a large platter, spread half the tortilla chips and cover with a layer of about half the meat. Sprinkle with half the sliced radishes and a third of the grated cheese. Repeat with another layer of chips, meat, radishes and cheese, then top with the sour cream, scallions, cilantro leaves and any remaining cheese. Serve with hot sauce. "}], "link": "https://cooking.nytimes.com/recipes/1015990-game-day-nachos"}