{"@context": "http://schema.org", "@type": "Recipe", "name": "Crisp Potato Cake (Galette de Pomme de Terre)", "description": "A well-seasoned cast-iron pan is ideal for making this easy, comforting side dish. Make sure the potatoes are sliced thin, and dry them well before assembling the dish. This will ensure full crispiness.", "author": {"@type": "Person", "name": "Harold Mcgee"}, "image": "https://static01.nyt.com/images/2014/04/15/dining/potatogalette-still/potatogalette-still-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "potato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 342}, "recipeIngredient": ["2 pounds (about 3 medium) potatoes, peeled and sliced very thinly", "1 tablespoon olive oil, or as needed", "Freshly ground nutmeg", "Freshly ground black pepper", "1 tablespoon minced fresh parsley", "1 tablespoon minced garlic", "Salt", "Fresh thyme leaves for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat potatoes dry if very starchy or moist. In a sauté pan large enough to fit potato slices in just two layers, spread 1 tablespoon oil and sprinkle with nutmeg and pepper to taste. Starting in center, arrange potato slices in a closely overlapping, attractive spiral. When pan is filled, repeat to make a second layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pan over medium heat and cover. Slowly cook potatoes until well browned on underside, about 15 minutes, occasionally shaking pan gently to avoid sticking. Wipe inside of lid as needed to keep it dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press potatoes down with a flat spatula and remove from heat. Place a larger platter over pan and flip it upside down, transferring potatoes to the platter. Check pan to make sure it is clean and has enough oil to keep potatoes from sticking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide galette, raw side down, back into pan, and return to medium heat. Cover and cook until well browned, about 15 minutes. Meanwhile, prepare a persillade by combining parsley and garlic in a small bowl. To serve, slide galette onto a serving platter, season to taste with salt, and garnish with persillade or thyme."}], "link": "https://cooking.nytimes.com/recipes/1015206-crisp-potato-cake-galette-de-pomme-de-terre"}