{"@context": "http://schema.org", "@type": "Recipe", "name": "5-Ingredient Apple Pie", "description": "This straightforward recipe for apple pie is from the vegan chef and cookbook author Chloe Coscarelli. It calls for storebought crusts, so you really can throw it together and have it in the oven in about 15 minutes.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2012/11/21/health/wellveggie_desserts3/wellveggie_desserts3-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "One 9-inch pie", "recipeCuisine": "", "recipeCategory": "", "keywords": "apple, pie crust, dairy-free, kosher, nut-free, vegan, vegetarian, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 75}, "recipeIngredient": ["1/2 cup sugar, plus extra for sprinkling", "2 tablespoons all-purpose flour", "1 teaspoon ground cinnamon", "6 apples, peeled and thinly sliced", "2 store-bought pie crusts (I prefer the vegan brand Wholly Wholesome)", "Soy milk (optional, for brushing)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Lightly grease a 9-inch pie pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together sugar, flour and cinnamon in a large bowl. Add apples and mix with a large spoon until apples are evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll out 1 dough until it is about 1/8 inch thick. Carefully lift the dough and fit it into the prepared pan, letting about 1 inch hang over the sides. Fill the pie shell with the apple filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll out the second disc of dough until it is about 1/8 inch thick and cut out eight 1-inch strips. My lattice technique does not require any weaving. Instead, lay four strips horizontally on top of the filling, leaving about 1/2 to 3/4 inch between strips. You may want to use a metal spatula to transfer the dough strips from your work surface to your pie. Lay the remaining four strips diagonally over the first four strips, creating a diamond-like shape between strips. Fold the overhanging dough over the edges of the lattice top. Crimp the dough between your two index fingers to make a decorative border"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the top and edges of the pie crust with nondairy milk and sprinkle with sugar for an extra sweet and crisp top. Bake for 50 to 55 minutes, until the crust is nicely browned."}], "link": "https://cooking.nytimes.com/recipes/1015019-5-ingredient-apple-pie"}