{"@context": "http://schema.org", "@type": "Recipe", "name": "Millet Polenta With Mushrooms and Broccoli or Broccoli Raab", "description": "I had envisioned serving this savory mix of mushrooms over a bowl of farro, and farro – or brown rice or barley, for that matter – would certainly work well. But I made the mushrooms on the same day that I made the polenta in Millet Polenta With Tomato Sauce, Eggplant and Chickpeas and ended up spooning them over the millet, which was so delicious and comforting that I voted on the polenta as the accompanying grain. Cornmeal polenta would also work well.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/10/29/science/01recipehealth/01recipehealth-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 6", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner, lunch", "keywords": "fall, winter, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 18}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 248, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "7 grams", "proteinContent": "10 grams", "saturatedFatContent": "2 grams", "sodiumContent": "925 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 ounce (1/2 cup) dried mushrooms, like porcinis", "1 cup millet", "Salt to taste", "4 cups water or vegetable stock", "1 tablespoon unsalted butter", "6 ounces fresh shiitake mushrooms, stems removed, caps sliced", "1 pound white or cremini mushrooms, wiped if gritty and cut in thick slices", "2 tablespoons extra-virgin olive oil", "Salt and freshly ground pepper", "2 shallots, minced", "2 garlic cloves, minced", "1 teaspoon chopped fresh thyme", "1 teaspoon chopped fresh rosemary", "2 teaspoons soy sauce", "1/4 cup dry white wine, such as Sauvignon blanc (optional)", "1 tablespoon chopped fresh parsley", "1 to 2 ounces Parmesan, grated (1/4 to 1/2 cup) (optional)", "1 bunch broccoli or broccoli rabe, broken into florets or coarsely chopped and steamed until tender, about 5 minutes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dried mushrooms in a pyrex measuring cup or a bowl and pour on 1 cup boiling water. Let soak 20 minutes, while you prepare the other ingredients. Place a strainer over a bowl, line it with cheesecloth or paper towels, and drain the dried mushrooms. Squeeze the mushrooms over the strainer then rinse, away from the bowl with the soaking liquid, until they are free of sand. Squeeze dry over the strainer and set aside. If very large, chop coarsely. Set aside the broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. While the dried mushrooms are soaking, start the millet polenta. Heat a 10-inch cast iron skillet over medium-high heat and add the millet. Toast, stirring or shaking the pan, until the grains begin to pop and smell sort of like popcorn. Add the water or stock and salt (up to 1 teaspoon, to taste). Transfer the pan to the hot oven. After 25 minutes, give the millet a stir and then bake for another 20 to 25 minutes. There should still be some liquid in the pan. Stir in the butter and bake for another 5 to 10 minutes, until the millet is thick and no more water or stock is visible in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the millet is in the oven cook the mushrooms. Heat a large, heavy frying pan over medium-high heat and add 1 tablespoon of the olive oil. When the oil is hot (you can feel the heat when you hold your hand above the pan), add the shiitakes and the fresh mushrooms. Don’t stir for 30 seconds to a minute, then cook, stirring or tossing in the pan, for a few minutes, until they begin to soften and sweat. Add the remaining oil, turn the heat to medium, and add the shallots, garlic, thyme and rosemary. Stir together, add salt to taste and freshly ground pepper to taste, and cook, stirring often, for another couple of minutes, until the shallots and garlic have softened and the mixture is fragrant. Add the chopped dried mushrooms, the soy sauce and wine and cook, stirring often and scraping the bottom of the pan, until the wine has evaporated. Add the broth from the dried mushrooms, turn up the heat and cook, stirring, until it has reduced by about a third. The mushrooms should be moist. Stir in the parsley, taste, adjust seasonings, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the polenta is done, remove it from the oven and if desired, stir in the Parmesan. Spoon onto plates or wide bowls, make a depression in the middle with the back of your spoon and top with the mushrooms. Arrange steamed broccoli or broccoli rabe next to the mushrooms or on top, and serve."}], "link": "https://cooking.nytimes.com/recipes/1015287-millet-polenta-with-mushrooms-and-broccoli-or-broccoli-raab"}