{"@context": "http://schema.org", "@type": "Recipe", "name": "Korean Fried Cauliflower", "description": "Long before the Cheesecake Factory made this dish popular in the United States, it was made at Yardbird in Hong Kong by the Canadian chef Matt Abergel. Food that is “Korean-fried” combines the thin, crisp crust of Japanese tempura with the fire of Korean gochujang, a spicy staple available in any Asian market. The Yardbird version also includes tempura mix and red yuzu kosho, a tart Japanese condiment made of red chiles, yuzu and salt. If those are out of reach, feel free to substitute your own favorite flavors — many versions of the sauce include a little ketchup — and use any tempura batter that you like. Just don’t leave off the toasted sesame seeds; they add a nutty crunch at the very end.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2013/10/14/dining/kfc-recipe/kfc-recipe-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 side-dish servings", "recipeCuisine": "korean", "recipeCategory": "", "keywords": "cauliflower, gochujang, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 177}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 772, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "164 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "193 milligrams", "sugarContent": "19 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 tablespoons gochujang (Korean red pepper paste)", "1/2 cup sugar", "6 cloves garlic, puréed", "3 tablespoons red yuzu kosho", "1/4 cup mirin", "1 cup/140 grams tempura flour or tempura batter mix", "1 large egg yolk", "1 scant cup/150 grams potato starch", "1 cup plus 3 tablespoons/150 grams Japanese wheat flour or karaage ko", "Canola oil, as needed for deep-frying", "1 head cauliflower, cut into 2-inch florets", "Toasted sesame seeds, for garnish", "Lime wedges, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: In a small saucepan over low heat, combine the gochujang, sugar, garlic, yuzu kosho, mirin and 1 cup water. Simmer until thickened slightly and reduced by half, about 20 minutes. Remove from heat and set aside at room temperature. Sauce may be made up to two weeks ahead and stored covered and refrigerated; bring to room temperature before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tempura batter: Fill a pitcher with 1 3/4 cups ice-cold water, and set aside. In a large mixing bowl, combine the tempura flour (or batter mix), egg yolk and 1 cup of the water. Whisk to blend, then add the potato starch, wheat flour and remaining 3/4 cup water. The mixture should have the consistency of thin pancake batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a deep fryer or large pot halfway with canola oil and bring to 350 degrees. Coat the florets with the batter and, working in batches if necessary, deep-fry until florets have a dark golden crust, 2 to 3 minutes. The crust should be crispy while the cauliflower retains some crunch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove browned florets from oil and drain on paper towels. Transfer to a warmed platter and drizzle thoroughly with sauce. Garnish with toasted sesame seeds and lime wedges. Serve hot."}]}