{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Onion Soup With Cheese Toasts", "description": "Onion soup is an excellent antidote to blustery, cold weather. Jacques Pépin showed me his way when I first met him years ago in California. His admonishments: Don’t overcrowd the pan or the onions won’t brown. Keep the heat high but not too high, so the onions don’t cook too fast and burn. Be generous with the salt and pepper. Bay leaf and thyme are essential, everything else is negotiable. A little red wine is nice, a splash of Cognac couldn’t hurt. A welcome all-purpose remedy, especially at this time of year. ", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/01/01/dining/01KITCH1_SPAN/01KITCH1_SPAN-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "weekday, soups and stews", "keywords": "appetizer, main course, gruyère, onion, red wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 104}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 372, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "6 grams", "proteinContent": "15 grams", "saturatedFatContent": "6 grams", "sodiumContent": "779 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Olive oil", "3 pounds red onions, peeled, sliced 1/8-inch thick\n", "Salt and pepper\n", "1 cup dry red wine\n", "2 bay leaves\n", "1 small bunch thyme, tied with string\n", "8 garlic cloves, roughly chopped\n", "2 tablespoons brandy (optional)\n", "6 slices day-old bread, lightly toasted\n", "6 ounces grated Gruyère\n", "1 teaspoon chopped thyme\n", "1 tablespoon chopped sage\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set 2 large, wide skillets over medium-high heat. When pans are hot, add 1 tablespoon oil and a large handful of sliced onions to each pan. Season onions with salt and pepper, then sauté, stirring occasionally, until they are a ruddy dark brown, about 10 minutes"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer onions to soup pot and return pans to stove. Pour 1/2 cup water into each pan to deglaze it, scraping with a wooden spoon to dissolve any brown bits. Pour deglazing liquid into soup pot. Wipe pans clean with paper towel and begin again with more oil and sliced onions. Continue until all onions are used. Don’t crowd pans or onions won’t brown sufficiently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place soup pot over high heat. Add wine, bay leaves, thyme bunch and garlic. Simmer rapidly for 5 minutes, then add 8 cups water and return to boil. Turn heat down to maintain a gentle simmer. Add 2 teaspoons salt. Cook for 45 minutes. Skim off any surface fat, taste and adjust seasoning. (May be prepared to this point up to 2 days in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, add brandy to soup, if using, and simmer 5 minutes. Remove the thyme. Make the cheese toasts: Heat broiler. Place toasted bread on baking sheet. Mix grated cheese with chopped thyme and sage, along with a generous amount of pepper. Heap about 1 ounce of cheese mixture on each toast. Broil until cheese bubbles and browns slightly. Ladle soup into wide bowls and top with toast."}]}