{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate-Apricot Babka", "description": "You may think it unfathomable to change up a classic babka recipe, but maybe there’s something to be said about playing with a classic. Ann Amernick, the author of “The Art of the Dessert,” adds apricot jam to her chocolate babka for a little acidity. Poundcake crumbs lighten the filling a bit, soaking up the jam. It’s a twist on the traditional, and perhaps a new favorite.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2014/04/28/dining/Chocolate-Apricot-Babkas/Chocolate-Apricot-Babkas-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "1 large Bundt babka or 2 loaf babkas", "recipeCuisine": "", "recipeCategory": "", "keywords": "apricot, chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 50}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 291, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "8 grams", "sodiumContent": "65 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups all-purpose flour", "3/4 cup cake flour", "1/8 teaspoon salt", "1/3 cup sugar", "1/4 ounce or 2 1/2 teaspoons active dry yeast, or 1 cake (6/10 ounces) fresh yeast", "1/2 cup whole milk at room temperature", "1/2 cup eggs (whole eggs or just yolks)", "1 teaspoon vanilla extract", "4 ounces unsalted butter (1 stick), preferably high fat, at room temperature, plus 2 tablespoons unsalted butter", "Flour for dusting", "6 ounces apricot preserves (3/4 cup)", "3/4 cup dry poundcake crumbs", "2 ounces unsalted high-fat butter, melted", "4 ounces good bittersweet chocolate", "6 tablespoons all-purpose flour", "3 tablespoons sugar", "2 teaspoons cinnamon (optional)", "3 tablespoons unsalted butter, diced and chilled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make dough, combine flours, salt and all but 1 tablespoon sugar in mixer fitted with dough attachment and mix on medium speed. In a small bowl, stir yeast with one tablespoon warm water and reserved tablespoon sugar just until sugar and yeast have dissolved. Reduce mixer speed to low, add yeast mixture, milk, eggs and vanilla. Beat until dough is shiny and elastic, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add one stick butter by spoonfuls until thoroughly incorporated, then beat on low speed for about 5 minutes. When finished, dough should be silken and rich like very thick ice cream. Transfer to a large bowl, cover with plastic wrap and set aside. When dough has doubled in size, after 2 hours, flour a cutting board and your hands. Then push dough down on board, cover well with plastic wrap and refrigerate for 1 to 2 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make filling, purée apricot preserves in a food processor until smooth. In a small bowl, combine cake crumbs, preserves and butter; mix until smooth. Set aside. Grate chocolate by hand in large holes of a box grater or in a food processor. If using a food processor, pulse into large chunks. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make streusel topping, in a small bowl mix flour, sugar and cinnamon. Add cold butter and using your fingers, mix together until crumbly. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, line one Bundt pan or two 8 1/2 by 4 1/2-inch loaf pans with parchment paper, not letting paper come more than 1 inch above top of pans. Remove dough from refrigerator and divide it in half. On a lightly floured surface, roll one piece of dough into a 12 x 8-inch rectangle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a metal spatula, spread half the apricot filling over dough within 1/2 inch of edges. Sprinkle with half the grated chocolate. Beginning with long side, roll dough up tightly and fold in ends. Twist babka lengthwise to create a spiral, holding one end of babka in each hand. Place twisted babka in half the prepared Bundt pan or in a loaf pan, pressing dough firmly into pan. Melt remaining 2 tablespoons butter. Brush babka top with melted butter and sprinkle with half the streusel. Repeat with second half of babka dough. Cover loosely with plastic wrap. Let loaves rise at room temperature until they reach top of pan or about doubled in volume, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and bake for about 45 minutes, or until a cake tester inserted in center comes out clean. Allow babka to cool for 30 minutes before cutting. Slice babka and serve."}], "link": "https://cooking.nytimes.com/recipes/1015726-chocolate-apricot-babka"}