{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Duck with Orange and Ginger", "description": "For a festive occasion, a burnished whole duck makes quite an impression &mdash; fancier than chicken and more elegant than turkey. Roasting the duck is not so difficult to do, but it can be smoky; to be on the safe side, dismantle your smoke alarm and turn on a good exhaust fan. (If your oven has a convection fan, don&rsquo;t use it; that way you avoid unnecessarily sputtering fat blowing about.). Seasoning the duck ahead and leaving it in the fridge overnight helps to deepen the flavor and keeps work to a minimum the following day. This one is seasoned with orange zest, along with fair amount of ginger and five-spice powder, which gives it a marvelous perfume; serve it with mashed butternut squash.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/12/18/dining/18KITCH_SPAN/18KITCH-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "duck, orange, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 443}, "recipeIngredient": ["1 5- to 6-pound Pekin (Long Island) duck ", "3 tablespoons kosher salt ", "1 tablespoon 5-spice powder, preferably homemade (see note) ", "1 large orange, zested and cut into 6 wedges", "1 tablespoon grated ginger", "1 tablespoon grated garlic", "2 cups orange juice", "1 tablespoons honey", "2 tablespoons Demerara sugar", "2 tablespoons soy sauce", "1 2-inch piece of ginger, thickly sliced ", "3 star anise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse duck and pat dry. Remove neck and giblets and save for another purpose. Remove excess fat from cavity and tail area and trim off a bit of flappy neck skin. Prick duck skin all over with tip of sharp paring knife, making sure not to penetrate meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together salt and 5-spice powder. Season interior of duck with 1 tablespoon salt mixture; use remainder to generously season exterior (you may have a little left over). Combine orange zest with grated ginger and garlic, then smear mixture inside cavity. Place orange wedges in cavity. Tie legs together. Secure neck flap with wooden skewer or toothpicks. Place duck on rack in roasting pan breast-side-up and refrigerate overnight, uncovered. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Meanwhile, bring duck to room temperature and make the glaze: Bring orange juice, honey, sugar and soy sauce to a simmer. Add sliced ginger and star anise, then reduce mixture until you have a medium-thick syrup, about 10 minutes. Remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast duck for 2 hours, carefully pouring off fat \nand turning duck over every 30 minutes. Paint with \nglaze and roast another 30 minutes (2 1/2 hours in \nall). Tent with foil if glaze begins to get too dark. \nDuck is done when temperature at thickest part of \nleg reads 165 degrees.  Paint duck once more, keep \nwarm and let rest 20 minutes. Use poultry shears to \ncut into quarters (remove backbone first) or carve in the traditional way,\nremoving legs from carcass and slicing breast. \nServe with <a href=\"http://www.nytimes.com/recipes/1015834/mashed-butternut-squash.html\">mashed butternut squash</a> if desired."}], "link": "https://cooking.nytimes.com/recipes/1015833-roast-duck-with-orange-and-ginger"}