{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Rice Casserole", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch", "keywords": "rice, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 63}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 456, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "2 grams", "proteinContent": "13 grams", "saturatedFatContent": "10 grams", "sodiumContent": "419 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 teaspoons butter", "1 teaspoon salt", "1 cup Uncle Ben's or other converted rice", "1 Poblano chile", "1/2 cup sour cream", "1/8 cup plus 1/4 cup chopped onion", "2 tablespoons chopped cilantro", "Salt", "1 tablespoon vegetable oil", "1 garlic clove", "1 cup corn kernels, fresh or frozen", "1/8 cup peas, fresh or frozen", "4 ounces grated Cheddar cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven broiler. In a small saucepan, bring 2 cups water to a boil and add butter and salt. When the butter is melted, add rice and return to a boil. Reduce heat to very low, cover rice with a tight-fitting lid, and cook 25 to 30 minutes. Spread rice on a baking sheet to cool. (To cool quickly, put the rice on the baking sheet in the freezer for 10 to 15 minutes, stirring every five minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place poblano on a broiling pan about 2 inches from the broiler. Using a pair of tongs, turn poblano every 3 to 5 minutes, until blistered all over, about 15 minutes. (Alternatively, the poblano may be roasted directly over a gas flame, turning every minute until blistered all over, 3 to 5 minutes.) Transfer to a paper bag and allow to cool. Reduce oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the poblano is cool enough to handle, gently scrape away blistered outer skin and discard the top. Slice open lengthwise and gently scrape away and discard seeds. Slice lengthwise in quarter-inch strips, and cut cross-wise into quarter-inch dice. In a small bowl, combine the sour cream, 1/8 cup chopped onion, and chopped cilantro. Season with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet over medium heat, heat vegetable oil until shimmering. Add 1/4 cup chopped onion and garlic. Sauté until translucent, 1 to 2 minutes. Add diced poblano and sauté 1 minute, then remove from heat and transfer to a casserole or clay pot. Add the rice, corn, and peas. Toss lightly. Add sour cream mixture and grated cheese. Mix lightly but thoroughly. Cover the casserole or clay pot with a lid or foil; if using a Pyrex casserole, reduce oven temperature to 325 degrees. Bake until thoroughly heated, about 30 minutes. Serve with a green salad, if desired."}], "link": "https://cooking.nytimes.com/recipes/1015541-creamy-rice-casserole"}