{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Squash and Red Onion Gratin With Quinoa", "description": "I have given you several winter squash gratins over the years; this is my favorite to date, because of the sweet layer of flavor of the roasted squash and the texture of the black quinoa.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/01/20/health/20recipehealth/20recipehealth-articleLarge.jpg", "totalTime": "PT1H25M", "recipeYield": "Serves 6", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, lunch", "keywords": "fall, winter, gluten-free, halal, healthy, kosher, nut-free, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 366}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 227, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "3 grams", "proteinContent": "10 grams", "saturatedFatContent": "3 grams", "sodiumContent": "489 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds butternut or kabocha squash, peeled, seeds and membranes removed, and cut in small dice (1/2 to 3/4 inch) (about 4 cups diced)\n", "2 tablespoons extra virgin olive oil\n", "Salt and freshly ground pepper to taste\n", "1/2 red onion, chopped\n", "1 leek, white and light green parts only, cut in half, cleaned thoroughly, and chopped\n", "2 garlic cloves, minced\n", "2 teaspoons fresh thyme\n", "2 ounces Parmesan, grated (1/2 cup)\n", "3 eggs\n", "1/2 cup milk (2 percent)\n", "1/2 cup cooked rainbow or black quinoa\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Cover a baking sheet with parchment or foil. Toss squash with 1 tablespoon of the olive oil and season with salt and pepper. Spread on baking sheet in an even layer. Place in oven and roast for about 30 minutes, stirring every 10 minutes, until tender and caramelized. Remove from the oven and turn the heat down to 350 degrees. You should have about 2 cups roasted squash.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat remaining olive oil in a medium skillet and add onion. Cook, stirring, until it begins to wilt, about 3 minutes. Add leek and a generous pinch of salt and cook, stirring, until onion and leek are tender, another 3 to 5 minutes. Add garlic and thyme and cook, stirring, until the garlic is fragrant, 30 seconds to a minute. Remove from the heat.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a 2-quart baking dish or gratin. In a large bowl, beat eggs and add salt and pepper to taste (I use about 1/2 teaspoon salt). Whisk in milk. Add onions and leek mixture, squash, Parmesan and quinoa, and combine well. Scrape into the prepared baking dish.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 35 to 40 minutes, until set and the top is lightly browned. Remove from the oven and allow to cool for 10 minutes or longer before serving.\n"}], "link": "https://cooking.nytimes.com/recipes/1015965-roasted-squash-and-red-onion-gratin-with-quinoa"}