{"@context": "http://schema.org", "@type": "Recipe", "name": "Tart Dough", "description": "While Dorie Greenspan uses this dough for savories, it’s really an all-purpose recipe that produces a not-too-rich, slightly crisp crust that is as happy holding pastry cream for a strawberry tart as it is encasing a creamy cheese filling for a quiche. This is a good dough to use anytime you see a recipe calling for pâte brisée. Be prepared: The dough should chill for at least 3 hours.", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": null, "totalTime": "PT5H15M", "recipeYield": "Makes one 9 - to 9 ½-inch tart shell", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, main course, dough, pastry", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1267, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "124 grams", "cholesterolContent": null, "fatContent": "75 grams", "fiberContent": "4 grams", "proteinContent": "23 grams", "saturatedFatContent": "46 grams", "sodiumContent": "699 milligrams", "sugarContent": "5 grams", "transFatContent": "3 grams"}, "recipeIngredient": ["1 1/4 cups all-purpose flour", "1 teaspoon sugar", "1/2 teaspoon salt", "6 tablespoons (3/4 stick) very cold (or frozen) unsalted butter, cut into bits", "1 large egg", "1 teaspoon ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dough in a food processor: Put the flour, sugar and salt in the processor and whir a few times to blend. Scatter the bits of butter over the flour and pulse several times, until the butter is coarsely mixed into the flour. Beat the egg with the ice water and pour it into the bowl in 3 small additions, whirring after each one. (Don’t overdo it — the dough shouldn’t form a ball or ride on the blade.) You’ll have a moist, malleable dough that will hold together when pinched. Turn the dough out onto a work surface, gather it into a ball (if the dough doesn’t come together easily, push it, a few spoonfuls at a time, under the heel of your hand or knead it lightly), and flatten it into a disk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dough by hand: Put the flour, sugar, and salt in a large bowl. Drop in the bits of butter and, using your hands or a pastry blender, work the butter into the flour until it is evenly distributed. You’ll have large and small butter bits, and that’s fine — uniformity isn’t a virtue here. Beat the egg and water together, drizzle over the dough, and, using a fork, toss the dough until it is evenly moistened. Reach into the bowl and, using your fingertips, mix and knead the dough until it comes together. Turn it out onto a work surface, gather it into a ball (if the dough doesn’t come together easily, push it, a few spoonfuls at a time, under the heel of your hand or knead it some more), and flatten it into a disk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill the dough for at least 3 hours. (The dough can be refrigerated for up to 5 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to make the tart shell, butter a 9- to 9 1/2-inch fluted tart pan with a removable bottom (butter it even if it’s nonstick)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To roll out the dough: I like to roll out the dough between sheets of wax paper or plastic wrap or in a lightly floured rolling cover, but you can roll it out on a lightly floured work surface. If you’re working between sheets of paper or plastic wrap, lift the paper or plastic often so that it doesn’t roll into the dough, and turn the dough over frequently. If you’re just rolling on the counter, make sure to lift and turn the dough and reflour the counter often. The rolled-out dough should be about ¼ inch thick and at least 12 inches in diameter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dough to the tart pan, easing it into the pan without stretching it. (What you stretch now will shrink in the oven later.) Press the dough against the bottom and up the sides of the pan. If you’d like to reinforce the sides of the crust, you can fold some of the excess dough over, so that you have a double thickness around the sides. Using the back of a table knife, trim the dough even with the top of the pan. Prick the base of the crust in several places with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill — or freeze — the dough for at least 1 hour before baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven and preheat the oven to 400 degrees. Press a piece of buttered foil (or use nonstick foil) against the crust’s surface. If you’d like, you can fill the covered crust with rice or dried beans (which will be inedible after this but can be used for baking for months to come) to keep the dough flat, but this isn’t really necessary if the crust is well chilled. Line a baking sheet with a silicone baking mat or parchment paper and put the tart pan on the sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To partially bake the crust: Bake for 20 minutes, then very carefully remove the foil (with the rice or beans). Return the crust to the oven and bake for another 3 to 5 minutes, or until it is lightly golden. Transfer the baking sheet to a cooling rack and allow the crust to cool before you fill it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To fully bake the crust: Bake for an additional 10 minutes, or until it is an even golden brown. Transfer the baking sheet to a cooling rack and allow the crust to cool before you fill it."}], "link": "https://cooking.nytimes.com/recipes/1015673-tart-dough"}