{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato and Goat Cheese Gratin With Black Olives", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "4 servings as a side dish", "recipeCuisine": "", "recipeCategory": "", "keywords": "side dish, sweet potato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 43}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 489, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "8 grams", "proteinContent": "8 grams", "saturatedFatContent": "15 grams", "sodiumContent": "709 milligrams", "sugarContent": "11 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 pounds sweet potatoes or yams", "3 ounces  butter, unsalted", "1 large shallot, finely chopped", "3 ounces creamy fresh goat cheese", "Kosher salt and black pepper to taste", "1/4 cup Niçoise olives, pitted", "2 tablespoons olive oil", "4-5 basil leaves, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. If you are using an aluminum baking sheet, cover the bottom with parchment paper or Silpat, so that the potatoes won’t discolor and turn brown while baking. If you are using a ceramic or stainless-steel baking sheet, you don’t need to cover the bottom. Slice each sweet potato in half, lengthwise, and place face down on the tray. Bake until they are soft, about 35 to 45 minutes. Remove and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat in the oven to 400 degrees, place the pitted olives on a small baking sheet, and bake until they become hard and brittle, about 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the olives are baking, place a medium-size sauté pan with a heavy bottom over medium heat. Add the butter and brown it until it turns a hazelnut color and has a nutty fragrance, about 5 to 6 minutes.  Add the chopped shallots and allow to cook for about 3 minutes until translucent. Be careful not to burn the butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the sweet potatoes are cool, scoop out the insides and place in a bowl. Pour the butter and shallot mixture over the sweet potatoes, and mix. Season with salt and pepper, to taste, going lightly on the salt since the olives, which are added at the end, are salty. Place the sweet potato mix in a baking dish so that the sweet potatoes are one-inch thick. Spread the creamy goat cheese, in shallow dollops, over the sweet potatoes so that the sweet potatoes are clearly visible, at the edges and elsewhere. Bake at 400 degrees until the cheese and potatoes start to brown in some spots, about 15 minutes. The gratin won’t brown like a traditional potato gratin; the colors of the sweet potatoes and the goat cheese will still be very present, but the goat cheese will turn beige, and the potatoes will begin to brown a bit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the olives are cool, chop them finely, and mix with the olive oil and the chopped basil. Spoon the olive mixture over the sweet potatoes and serve."}]}