{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh and Wild Mushroom Stew", "description": "Craving wild mushrooms? My compromise is to make a stew using mostly cultivated mushrooms. But I give them a boost of wild flavor in a couple of ways. The first is to make an intense, flavorful broth with a handful of dried porcini. The other is to actually buy some wild mushrooms. A scant half-pound of chanterelles, even if pricey, won’t break the bank. The rest of the rustic stew (call it a ragout if you wish) is made of shiitake, cremini and oyster mushrooms. As it simmers, this saucy, herbaceous mushroom stew gains depth and character. Spooned over pasta or nestled up to a soft mound of polenta, it evokes the comfort of home and the primal in each bite.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/01/06/dining/recipes-wildmushroomstew/recipes-wildmushroomstew-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "main course, mushroom, wild mushrooms", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1049}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 129, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "6 grams", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "550 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds cultivated brown mushrooms, like shiitake, cremini or portobello", "1/2 pound pale wild mushrooms, like chanterelle (or use King trumpet or oyster)", "Extra virgin olive oil", "1 large onion, diced", "Salt and pepper", "1 teaspoon chopped thyme", "1 teaspoon chopped sage or rosemary", "Pinch red pepper flakes or cayenne", "1 tablespoon tomato paste", "3 small ripe tomatoes, peeled, seeded and chopped", "1 tablespoon all-purpose flour", "Porcini broth, heated, or use chicken or vegetable broth", "1 tablespoon butter", "3 garlic cloves, minced", "3 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean mushrooms, keeping colors separate, and trim tough stems. (Save stems for stock.) Slice mushrooms about 1/8-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide skillet, warm 2 tablespoons olive oil over medium high heat. Add onion, season with salt and pepper and cook, stirring, until onion has softened and browned, about 10 minutes. Remove from pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 more tablespoon oil and turn heat to high. Add brown mushrooms, season lightly and stir-fry until nicely colored, about 3 minutes. Lower heat to medium. Add thyme, sage, red pepper and tomato paste. Add tomatoes, stir well, and cook for 1 minute. Season again with salt and pepper. Sprinkle with 1 tablespoon flour, stir to incorporate and cook for 1 minute more. Stir in reserved onions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 cup mushroom broth and stir until thickened, about 1 minute. Gradually add 1 more cup broth and cook for 2 minutes. Sauce should have gravy-like consistency; thin with more broth if necessary. Adjust seasoning. (May be prepared to this point several hours ahead and reheated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, put butter and 1 tablespoon olive in wide skillet over medium high heat. When butter begins to brown, add chanterelles, season with salt and pepper, and sauté for about 2 minutes, until cooked through and beginning to brown. Add garlic and parsley, stir to coat and cook 1 minute more. Add chanterelles to brown mushroom mixture and transfer to a warm serving bowl. Accompany with polenta or pasta if you wish."}], "link": "https://cooking.nytimes.com/recipes/1015198-fresh-and-wild-mushroom-stew"}