{"@context": "http://schema.org", "@type": "Recipe", "name": "Alder's Pub Cheese With Potato Bread Chips", "description": "Pub cheese is a traditional bar snack, but this version, served at Alder by the chef Wylie Dufresne, takes a number of liberties with the usual recipe. A red-wine reduction seasoned with miso and mustard add color and a complex tang. The “potato chips” are easy to make if you have a rolling pin and four hours, or serve the concoction with your favorite cracker.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/10/22/dining/22takeaway/22takeaway-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "2 1/2 cups pub cheese", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, dips and spreads", "keywords": "appetizer, cheese", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 271, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "8 grams", "sodiumContent": "331 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 loaf sliced potato bread, crusts removed", "Melted butter, for brushing", "Sea salt, for sprinkling", "1 (750 ml) bottle red wine", "5 cloves garlic, peeled", "2 large shallots, peeled", "2 thyme branches", "1 bay leaf", "1 whole clove", "1 tablespoon Dijon mustard", "1 tablespoon red miso paste", "2/3 cup whole milk", "6 ounces cream cheese (2/3 cup), at room temperature", "10 ounces aged cheddar, coarsely grated (2 1/4 cups)", "Pistachio nuts, chopped, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the potato bread chips, heat the oven to 200 degrees. Place a slice of bread on a clean surface and use a rolling pin to flatten it as thinly as possible. Brush both sides of the bread with butter and sprinkle lightly with salt. Repeat with remaining bread slices. Spread flattened slices out on baking sheets. Bake until golden and crisp, about 4 hours. Chips can be made the day before."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chips bake, prepare the pub cheese: In a large pot over medium heat, combine the wine, garlic, shallots, thyme, bay leaf and clove. Bring mixture to a boil; reduce heat and simmer until the wine has almost evaporated, about 1 hour and 15 minutes. Strain mixture through a fine-mesh sieve into a bowl (you should have about 1/3 cup); use a rubber spatula to press on the solids and extract additional liquid. Whisk in mustard and miso. Cool to room temperature. This can be made up to a week ahead; refrigerate if not using the same day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a medium bowl in a freezer to chill. Meanwhile, in a blender or food processor, combine 1/3 cup of the wine mixture (save the rest or discard), milk, cream cheese and cheddar. Run until the mixture is fairly smooth; stop to scrape down the sides occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the mixture into a medium-sized pot. Cook over medium-low heat, stirring occasionally, until the mixture reaches 150 degrees on an instant read thermometer and the cheese is melted, 8 to 10 minutes. Pour mixture into the chilled bowl and whisk to cool. Chill in the refrigerator until very cold, at least 4 hours (or up to 5 days)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve pub cheese in a bowl or ramekins, or mounded on a plate, with the potato bread chips alongside. Garnish pub cheese with pistachio nuts if using."}], "link": "https://cooking.nytimes.com/recipes/1015254-alders-pub-cheese-with-potato-bread-chips"}