{"@context": "http://schema.org", "@type": "Recipe", "name": "Flaming Baba au Rhum", "description": "While you can flambé pretty much any confection that’s soaked in a high-proof spirit, a baba au rhum is one of the booziest options. It’s based on an airy but rich yeast dough, which can absorb more liquor than your average cake without falling apart. And, unlike crepes, it’s easy to serve to a crowd. This is an afternoon project with delicious, sophisticated results.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/12/26/multimedia/clark-baba-rum/clark-baba-rum-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "cake, rum, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 103}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 530, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "17 grams", "sodiumContent": "205 milligrams", "sugarContent": "23 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 tablespoons sugar", "1 (1/4-ounce) package active dry yeast", "4 large eggs, at room temperature", "250 grams all-purpose flour (2 cups)", "4 grams fine sea salt (1/2 teaspoon)", "10 tablespoons unsalted butter, slightly softened and cut into cubes, more for greasing pan", "55 grams bittersweet chocolate, chopped (1/3 cup)", "150 grams dark brown sugar (3/4 cup)", "1 1/2 inches fresh ginger, cut into coins", "3 strips orange peel", "2 whole cloves", "1 cinnamon stick", "3/4 cup dark rum", "1/2 cup heavy cream", "3/4 cup crème fraîche", "7 to 15 grams confectioner’s sugar  (1 to 2 tablespoons), to taste", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 1/2 cup warm water into the bowl of an electric mixer. Stir in sugar and sprinkle in yeast. Let stand until foamy, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With mixer on low, beat in eggs, one at a time. Beat in flour and salt. Add butter, a few cubes at a time, and beat until batter is smooth, about 2 minutes. Scrape down sides of bowl and cover loosely with plastic wrap. Let stand in a warm place until doubled in volume, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a 10- or 12-cup bundt pan with softened butter. Spoon half the batter into bottom of pan. Sprinkle chocolate over top of batter, making sure the chocolate doesn’t touch the sides of the pan. Spoon remaining batter over chocolate. Cover with plastic wrap and let rise until doubled, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Remove plastic wrap and transfer pan to oven. Bake until deep golden and firm to the touch, 30 to 40 minutes. Let baba cool in the pan, set on a wire rack, for 10 minutes. Turn out onto rack while it is still warm and let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine brown sugar, 1 1/2 cups water, ginger, orange peel, cloves and cinnamon. Bring to a boil over medium heat; reduce heat to medium-low and simmer 5 minutes. Remove from heat and let cool completely. Strain into a bowl; discard solids. Stir 1/2 cup rum into liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place wire rack with cake over a rimmed baking sheet. Pour rum syrup slowly over surface of cake, allowing excess to drip into  baking sheet below. Pour extra syrup from pan into a bowl and then pour it back on top of cake. Repeat several times until most of the syrup has soaked into the cake. (Reserve extra syrup for serving; you should have a least 1/3 cup left over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer, whip heavy cream to soft peaks. Beat in crème fraîche. Beat in confectioner’s sugar, to taste, and vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cake on large platter. Place remaining 1/4 cup rum in a small skillet over high heat. Tilt skillet slightly so that rum catches fire. (If you don't have a gas range, use a long-handled match or lighter to set rum on fire.) Pour flaming rum over cake and let it burn off. Spoon whipped cream into the hollow center of the cake, then slice; or slice and then dollop with whipped cream. Serve cake with reserved rum syrup."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Flaming Baba au Rhum", "description": "A baba is traditionally baked with raisins, but Melissa Clark makes hers with chocolate.", "thumbnailUrl": "https://static01.nyt.com/images/2013/12/26/multimedia/clark-baba-rum/clark-baba-rum-mediumThreeByTwo440.jpg", "uploadDate": "2013-12-27T22:18:58.000Z", "duration": "PT3M54S"}, "link": "https://cooking.nytimes.com/recipes/1015862-flaming-baba-au-rhum"}