{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Ribs with Mol Coloradito", "description": "The earthy, fruity, spicy, though not especially fiery “little red” mole -- one of Oaxaca’s seven classic sauces -- is cooked separately and seared onto the ribs at the end to form a savory crust.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2014/04/22/dining/Coloradito-Beef-Ribs/Coloradito-Beef-Ribs-articleLarge.jpg", "totalTime": "PT3H15M", "recipeYield": "", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch", "keywords": "beef, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 21}, "recipeIngredient": ["8 pounds meaty beef short ribs", "Coarse salt and pepper", "2 tablespoons vegetable oil", "1 medium onion, finely chopped", "1 carrot, finely chopped", "2 celery stalks, finely chopped", "1 bay leaf", "7 guajillo chiles", "1 ancho chile", "2 tablespoons vegetable oil", "1 small onion, chopped", "2 garlic cloves, chopped", "1/2 teaspoon ground cumin", "1 cinnamon stick", "1 clove", "2 tablespoons sesame seeds", "1 teaspoon dried oregano", "1 bay leaf", "1 teaspoon coriander seeds", "1/2 ripe plantain, peeled and diced", "1/3 cup yellow raisins", "1/4 cup slivered almonds", "1/2 cup crushed tomatoes with their liquid", "1 ounce unsweetened chocolate, chopped", "2 teaspoons brown sugar, or to taste", "2 teaspoons red wine vinegar, or to taste", "1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 300 degrees. Very generously season the ribs on all sides with salt and pepper. Heat a Dutch oven or large heavy pot over medium-high heat. Add the oil and heat for 1 minute. In a single layer, working in several batches if needed, brown the ribs well all over, 6 to 8 minutes a side. Transfer the ribs to a platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion, carrot, and celery and cook until browned, 5 minutes, stirring often. Return the ribs to the pot and add the bay leaf and water to cover. Bake, tightly covered, until very tender, about 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the mole. Tear open the chilies, removing and discarding the stems and seeds. Place the chilies in a bowl with 2 cups warm water and soak until softened, 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large saucepan over medium-high heat. Add the onion and garlic and cook until translucent but not brown, stirring with a wooden spoon, about 3 minutes. Stir in the cumin and cook for 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chilies to the pan, reserving the soaking liquid. Sauté until fragrant, about 2 minutes. Add the soaking liquid and all remaining ingredients. Gently simmer until the plantains and raisins are soft, about 20 minutes, stirring occasionally. Remove the cinnamon stick. Puree the sauce in a blender until smooth, then return it to the saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/2 to 1 cup of the rib cooking liquid until the sauce is thick but pourable. Adjust the seasoning, adding salt, sugar, or vinegar to taste — the mole should be highly seasoned and a little sweet with just a faint hint of tartness. (The mole can be prepared up to one day ahead and reheated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, turn on the broiler or heat the oven to 450 degrees. Spoon half of the mole over the bottom of a baking dish just large enough to hold the ribs. Remove the ribs from their braising liquid, drain well, and place on top. Spoon the remaining mole over the ribs. Broil or bake until the mole sizzles and browns, 2 to 4 minutes on each side under the broiler, or 8 to 12 minutes in the oven."}]}