{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Turkey Stock", "description": "When you’re making a turkey, making stock with the bones is the logical next step. This recipe, from the Los Angeles chef Suzanne Goin, has the usual aromatics — carrots, celery, onions — plus a concentrated shot of white wine and a dried chile, which add a welcome breath of freshness. (Sometimes poultry stock can taste flat.) Roasting the bones and the vegetables in the same pan streamlines the process and adds depth of flavor. You can use this stock in virtually any recipe that calls for chicken stock (except for chicken soup).", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2013/11/20/dining/video-recipelab-turkey-stock/video-recipelab-turkey-stock-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "About 3 quarts", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "turkey bones, turkey stock", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 308}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 157, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "0 grams", "proteinContent": "22 grams", "saturatedFatContent": "1 gram", "sodiumContent": "291 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 leftover carcass from a 10- to 15-pound roasted turkey, preferably including neck, wing and leg bones", "4 or 5 onions, quartered (no need to peel; just rub off any papery skins)", "2 large or 3 small carrots, peeled and cut into chunks", "4 large or 5 small celery ribs, cut into chunks", "2 cups white wine", "2 large or 3 small garlic cloves, smashed and peeled", "4 sprigs fresh thyme", "2 bay leaves", "1 teaspoon black peppercorns", "1 whole arbol (or another small dried red) chile", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Using a sturdy knife or your hands, cut or tear turkey carcass into large pieces. Arrange in a single layer in a roasting pan and roast until brown and sizzling, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and transfer pieces to a stockpot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onions, carrots and celery to the empty roasting pan and place over medium heat. Sauté briefly, just to loosen the crusty turkey bits from bottom of pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to oven and cook until vegetables are browned around the edges, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from oven and place it over medium heat. Add white wine and cook, stirring, until wine is reduced to a syrup, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wine-vegetable mixture to stockpot. Add garlic, thyme, bay leaves, black peppercorns and chile. Add 6 quarts water and place over medium-high heat just until mixture comes to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately reduce heat to low, skim any foam floating on top and simmer, skimming as needed, for 3 hours. Add 1 teaspoon salt and taste. If stock tastes watery, keep simmering until stock is flavorful. Taste for salt again and add more if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain stock through a sieve into a large container or containers. Discard solids. Let stock cool slightly, then refrigerate. Skim off any fat from the top of the stock. Use within 4 days or freeze."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Roasted Turkey Stock", "description": "Julia Moskin makes roasted turkey stock adapted from a recipe by Suzanne Goin of A.O.C. restaurant.", "thumbnailUrl": "https://static01.nyt.com/images/2013/11/20/dining/video-recipelab-turkey-stock/video-recipelab-turkey-stock-mediumThreeByTwo440.jpg", "uploadDate": "2013-11-20T22:45:54.000Z", "duration": "PT50S"}, "link": "https://cooking.nytimes.com/recipes/1015731-roasted-turkey-stock"}