{"@context": "http://schema.org", "@type": "Recipe", "name": "Limoncello Once Removed", "description": "It’s one of those things you never think about, limoncello, until it pops up as a suddenly great idea: that dazzling bright yellow, half-frozen, lemony tang, like an adult slushie. Though it is also sweet, its penetrating citrine pop cuts like the Jaws of Life at the close of a hearty meal. It helps to have another pair of hands while setting this up, but once you’ve gotten the initial setup in place, it takes care of itself.", "author": {"@type": "Person", "name": "Toby Cecchini"}, "image": "https://static01.nyt.com/images/2012/10/02/t-magazine/02limoncello-cecchini/02limoncello-cecchini-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "cocktails, project", "keywords": "everclear, lemon", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 102}, "recipeIngredient": ["1 3/4 liters of Everclear, or other strong or overproof spirit", "18 lemons, whole, well washed, preferably organic", "superfine or white sugar", "food-grade cheesecloth, rinsed and wrung out", "strong butcher’s twine", "large sealable glass vessel or urn, with lid."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the spirit into the well-cleaned urn. Drape the cheesecloth in crossing swaths, making sure to gauge the length so that once the weight of the lemons is pending, they cannot reach the spirit. Bind the cheesecloth tightly in place on the outside edge of the urn with the butcher’s twine, wrapping it under a lip to make certain it is well held. Place the lemons into their hammock and cap the whole with the lid. If the lid has a plastic or rubber gasket, you may wish to remove it, lest it leach any off-flavors into the mix. Store in a stable environment out of sunlight for nine weeks. Given variables like temperature and humidity, your limoncello may be ready before then. Warmer climates will speed up the process. Avoid opening the jar, as it will set the curing process back, but do pay attention to the color of the mix; you want it rich with a kind of varnished yellow, but it can actually go too far, overextracting into a brown color with an intensity that can be too much for some people’s taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At the end of the aging period you should have roughly 1 4/10 liters of unsweetened lemon spirit at roughly 60 percent alcohol by volume, or 120 proof. Make a simple syrup of ½ liter water and the same of sugar. When dissolved fully, add to the lemon spirit and mix well. Taste for strength, balance and sweetness and adjust water for dilution and/or sugar if necessary. Be cautious not to drown the lemon’s bite and aromatics with too much sugar, but also bear in mind that if you’re serving your limoncello from the freezer, you will perceive slightly less sweetness in the frozen mixture."}], "link": "https://cooking.nytimes.com/recipes/1015304-limoncello-once-removed"}