{"@context": "http://schema.org", "@type": "Recipe", "name": "Steamed Clams in Spicy Tomato Sauce", "description": "Include mollusks in your seafood week. Clams are high in Omega 3 fatty acids, low in calories, and very high in iron.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/12/03/science/06recipehealth/06recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "mediterranean", "recipeCategory": "", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low calorie, low-carb, low cholesterol, low-fat, low-sodium, nut-free, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 83}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 602, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "5 grams", "proteinContent": "77 grams", "saturatedFatContent": "2 grams", "sodiumContent": "3300 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4-1/2 pounds clams, such as littlenecks", "2 tablespoons extra virgin olive oil", "1 cup dry white wine, such as pinot grigio or sauvignon blanc", "1 small onion or 2 shallots, minced", "4 garlic cloves, minced", "1/4 to 1/2 teaspoon red pepper flakes, or 1 dried chile de arbol, broken in half", "1 (28-ounce) can chopped tomatoes in juice", "1/4 teaspoon sugar", "1 strip of orange zest", "1 teaspoon fresh thyme leaves or 1/2 teaspoon dried thyme", "Pinch of saffron (optional)", "Salt and freshly ground pepper to taste", "3 to 4 tablespoons finely chopped fresh parsley or cilantro", "A drizzle of olive oil or squeeze of lemon juice for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the clams in several changes of water and scrub with a small brush, such as a toothbrush. Discard any that are open or that have cracked shells."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the wine in a large, lidded pan that will accommodate all of the clams (a wok with a lid works well). Bring to a boil and reduce by half. Add the clams, cover and cook over high heat, shaking the pan from time to time, for 2 to 3 minutes, until the clams open. Remove from the heat. Discard any clams that have not opened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a strainer over a bowl, line with cheesecloth and drain the clams. Set the liquid and the clams aside in separate bowls. You can keep the clams in the shell or remove them, whichever is most convenient for serving (it’s prettiest with the clams in the shell)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, wide, lidded skillet or casserole and add the shallots. Cook, stirring, until tender, about 3 minutes, and add the garlic and red pepper flakes or chile de arbol. Cook, stirring, until fragrant, about 30 seconds to a minute, and add the tomatoes and juice, the sugar, orange zest, thyme, saffron, and the liquid from the clams. Add salt and pepper to taste, bring to a simmer over medium heat, reduce the heat and simmer 20 to 25 minutes, stirring often, until the mixture has cooked down and is very fragrant. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the clams into the tomato sauce and heat through, stirring. Add the parsley or cilantro, stir again, and serve in wide soup bowls. Drizzle a little olive oil and a few drops of lemon juice over each serving if you wish"}], "link": "https://cooking.nytimes.com/recipes/1015765-steamed-clams-in-spicy-tomato-sauce"}