{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Rice or Farro With Miso-Roasted Squash, Leeks, Red Pepper and Tofu", "description": "Tofu, red peppers, leeks and winter squash all benefit from the same sweet/salty marinade in this dish. The squash sweetens as it roasts and is irresistible. I recommend that you roast more than the recipe calls for because it makes a delicious snack. The vegetables look pretty against a tawny grain like red rice or farro.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/10/29/science/30recipehealth/30recipehealth-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "Serves 4", "recipeCuisine": "asian", "recipeCategory": "dinner, lunch", "keywords": "dairy-free, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 364, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "7 grams", "proteinContent": "13 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1008 milligrams", "sugarContent": "13 grams", "transFatContent": null}, "recipeIngredient": ["A 14-ounce block of organic extra-firm tofu (find one that is not too dry), cut into 8 slices ", "3 tablespoons soy sauce", "1 tablespoon minced ginger", "1 garlic clove, minced", "1 tablespoon honey or agave nectar", "2 teaspoons lime juice", "2 tablespoons light miso", "2 tablespoon mirin", "1 tablespoon dark sesame oil", "3 tablespoons grapeseed oil or sunflower oil", "1 large red bell pepper, sliced", "1 1/2 pounds winter squash (1 medium-size butternut, for example), peeled, seeds membranes scraped away, and cut in ½-inch dice", "2 or 3 leeks, white and light green parts only, cut in half lengthwise and cleaned"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Line a sheet pan with parchment. Pat each slice of tofu dry with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the soy sauce, ginger, garlic, honey or agave nectar, lime juice, miso, mirin, and oils. Pour into a dish that can accommodate all of the tofu slices in a single layer (like a baking dish). Place the tofu slices in the marinade and turn them over. Leave to marinate for 15 minutes, turning once or twice. Transfer to the baking sheet. Add the peppers to the dish with the marinade and toss to coat thoroughly, then place on the baking sheet in a single layer. Retain the marinade for the squash and leeks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the baking sheet in the oven and roast for 15 to 20 minutes, turning the peppers once with tongs, until the edges of the tofu are just beginning to color and the marinade sets on the surface, and the peppers are sizzling and beginning to color on the edges. Remove from the heat and transfer the tofu and peppers to a bowl or platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn up the oven to 425 degrees. Toss the squash and leeks thoroughly with the marinade. Spread on the baking sheet in an even layer. Place in the oven and roast the leeks for 20 minutes, turning once halfway through, until tender and lightly browned, and the squash for 30 minutes, stirring every 10 minutes, until tender and caramelized. Remove from the heat. Remove the outer layer or layers of the leek (they will be tough and papery), leaving the tender inner part."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon rice into bowls or onto plates. Top with the squash. Arrange two slabs of tofu, 1 or 2 pieces of leek, and a portion of peppers on each plate. If desired, spoon any remaining marinade over the rice, and serve."}], "link": "https://cooking.nytimes.com/recipes/1015285-red-rice-or-farro-with-miso-roasted-squash-leeks-red-pepper-and-tofu"}