{"@context": "http://schema.org", "@type": "Recipe", "name": "Seitan Roulade With Oyster Mushroom Stuffing", "description": "This savory entrée by VegNews food columnist Robin Robertson is filled with flavorful stuffing and covered in a zesty marinade, making it a classic, meat-free main course. This homemade wheat meat comes together in less than 10 minutes and makes the perfect plant-based substitute in stews, stir-fries and sandwiches.<br/><br/>", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2010/11/15/health/15well_seitan/15well_seitan-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 servings.", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dairy-free, kosher, nut-free, vegan, vegetarian, fall, main course, oyster mushroom, vital wheat gluten flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 13}, "recipeIngredient": ["1 cup vital wheat gluten flour", "3/4 cup vegetable stock", "1 pound uncooked seitan (<a href=\"http://cooking.nytimes.com/recipes/1015388-seitan-piccata\">see recipe</a>)", "1/2 cup soy sauce", "3 tablespoons olive oil", "1 small yellow onion, minced", "1 cup oyster mushrooms, coarsely chopped", "1 cup vegan sausage, cooked and crumbled", "1 tablespoon minced fresh parsley", "1 teaspoon minced fresh thyme", "Salt to taste", "Freshly ground black pepper to taste", "4 cups finely diced bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the seitan. In a large bowl, combine flour and vegetable stock. Stir to make a soft dough. Knead for 3 minutes and let rest for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place seitan in a shallow baking dish. Cover with soy sauce and marinate for 30 minutes at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees Fahrenheit. In a large skillet over medium heat, heat olive oil. Add onion, cover, and cook, stirring a few times until softened, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add mushrooms, vegan sausage, parsley, thyme, salt and pepper. Stir for 5 minutes longer, then transfer to a large bowl. Stir in the bread and mix well. Add a small amount of water if the stuffing mixture is too dry. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the uncooked seitan (reserve the marinade) between two sheets of plastic wrap and roll out with a rolling pin until it is approximately 1/4-inch thick. Using your hands, spread the stuffing over seitan to within 1/2-inch of the edges, then roll it up. In a lightly oiled shallow baking pan, place rolled seitan seam-side down. Pierce in several places with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the reserved marinade over the roast and bake uncovered for 40 to 45 minutes, basting once after 20 minutes. When the surface of the roast is firm and golden brown, remove from oven and let rest for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a serrated knife, cut the roast into 1/2-inch-thick slices. Arrange on serving platter and serve with remaining marinade and your favorite vegan gravy."}]}