{"@context": "http://schema.org", "@type": "Recipe", "name": "Peppers Stuffed With Rice, Zucchini and Herbs", "description": "I used a medium-grain rice that I buy at my local Iranian market for these peppers. The package says that the rice is great for stuffing vegetables because it doesn’t swell too much, and it’s right. It goes into the peppers uncooked and steams in the oven, inside the peppers (so it’s important to cook them long enough and cover the baking dish). Make sure that you spoon the sauce left in the baking dish over the rice once the peppers are done. These are good hot or at room temperature. I like to use green peppers.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/10/15/science/16recipehealth/16recipehealth-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, green pepper, rice, zucchini, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 57}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 268, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "558 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["6 medium peppers, preferably green", "2 medium zucchini (about 3/4 pound), shredded", "Salt to taste", "1/3 cup extra virgin olive oil", "2 garlic cloves, minced", "1/2 cup finely chopped fresh mint", "1/4 cup chopped fresh dill or parsley", "1 scant cup uncooked medium grain rice", "Freshly ground pepper", "2 tablespoons tomato paste dissolved in 2/3 cup water", "2 tablespoons freshly squeezed lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the peppers. With a sharp paring knife, cut away the tops, then reach in and pull out the membranes and seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the shredded zucchini with salt and let drain in a colander for 20 minutes. Take up handfuls of zucchini and squeeze out as much liquid as possible. Transfer to a medium bowl and add the garlic, mint, parsley or dill, and rice. Season with salt and pepper. Stir in 1/4 cup of the olive oil and let sit for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile preheat the oven to 375 degrees. Oil a baking dish large enough to accommodate all of the peppers.  Fill the peppers about 3/4 of the way full with the stuffing, and replace the caps. Place in the oiled baking dish. Mix together the tomato paste and water with the remaining olive oil and the lemon juice. Season to taste. Add to the baking dish. Cover the dish with foil. Place in the oven and bake 45 minutes to an hour, until the peppers are soft. Remove from the heat and allow to cool to room temperature, or serve hot. Remove the tops of the peppers and spoon the sauce in the baking dish over the rice before serving."}], "link": "https://cooking.nytimes.com/recipes/1015229-peppers-stuffed-with-rice-zucchini-and-herbs"}