{"@context": "http://schema.org", "@type": "Recipe", "name": "Hortopita", "description": "This terrific recipe for a massive pile of mixed greens, herbs, leek and winter squash, all encased in homemade phyllo dough, came to The Times from the noted Greek-born food writer and cooking instructor Diane Kochilas, with whom Mark Bittman cooked in her Athens apartment. It’s a bit of work, to be sure, but Kochilas has codified the process so that it’s straightforward, and the results are both delicious and impressive. It's important to note that the phyllo dough created here need not be the extremely thin version we see in pastries, but rather a reasonably thin and easily worked dough rich in olive oil. It seems daunting. It is not.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/01/15/multimedia/bittman-athens/bittman-athens-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "1 pie, 8 to 12 servings", "recipeCuisine": "greek", "recipeCategory": "dinner", "keywords": "leek, spinach, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 28}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 303, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "7 grams", "proteinContent": "5 grams", "saturatedFatContent": "3 grams", "sodiumContent": "682 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds pumpkin or butternut squash, peeled, seeded and shredded", "Coarse sea salt", "1 bunch Swiss chard (preferably green stemmed)", "1/2 pound flat-leaf spinach", "1 bunch sweet sorrel", "1 bunch Mediterranean hartwort, about 1 1/2 cups, chopped", "1 bunch chervil, about 1 1/2 cups chopped", "1 1/2 cups snipped fresh dill", "3 bunches wild fennel, leaves only, about 2 1/2 cups chopped", "1 small bunch parsley, chopped", "1 small bunch fresh oregano, chopped", "1 small bunch mint leaves, chopped", "1 cup extra-virgin olive oil", "1 leek, tough greens trimmed and discarded, whites rinsed well and chopped", "2 red onions, finely chopped", "1 recipe for <a href=\"http://cooking.nytimes.com/recipes/1015957-basic-phyllo-dough\">homemade phyllo</a>, at room temperature and divided into four equal-size balls", "Flour for rolling out the pastry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the pumpkin in a colander, salt lightly and toss. Weight the pumpkin with a\nplate and weights (some canned food will do), and drain for about an hour. Trim,\nwash, drain and coarsely chop the greens and herbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350. Squeeze the pumpkin to get rid of as much liquid\nas possible. Heat 2 tablespoons olive oil in a large skillet (or wide pot), and cook\nthe pumpkin until it wilts and most or all of its liquid has evaporated. Transfer to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe the skillet clean, and heat 2 tablespoons of olive oil in it; cook down\nthe leek and onions, stirring, until wilted. Transfer to the bowl with the pumpkin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat another 2 tablespoons of oil in the skillet, and wilt the chard and spinach; add to the bowl. Add the remaining greens and herbs to the bowl, and season to taste with a generous amount of salt and a little pepper. Reserve 8 tablespoons of olive oil; stir what remains into the greens mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil a 15-inch round pan or a shallow, rectangular roasting or sheet pan\n(16 inches by 12 inches). Roll out the first dough ball on a lightly floured surface, using the shape of your pan as the guide. For round pans, roll out to a circle about 18 inches in diameter; for rectangular pans, roll out to a rectangle about 3 inches larger than the perimeter of the pan. Place the dough inside, leaving about 2 inches hanging over the edge. Brush\nwith two tablespoons of olive oil. Repeat with the second piece of dough. Brush that too with olive oil. Spread the filling evenly over the phyllo."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat the rolling process for the third sheet, placing it over the filling and\npressing down gently. Brush with olive oil. Finally, roll out the last piece of dough to a slightly smaller piece, and place it over the surface of the pie. Join and fold in the bottom and top overhanging dough, rolling it around the perimeter of the pan to form a pretty rim. Brush the top of the pie generously with olive oil. Score into serving pieces (do not cut through to the bottom)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the center rack of the oven, and bake for about 40 to 50 minutes, or\nuntil the pastry is golden and crisp and the pie pulls away from the perimeter\nof the pan. Remove, cool in the pan and serve warm or at room temperature."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "The Rollout: An Ikarian Greens Pie", "description": "Greek chef Diane Kochilas shows Mark Bittman how to prepare a traditional pie loaded with fresh greens. And in Greece, that means preparing a hand-rolled phyllo dough laced with olive oil.", "thumbnailUrl": "https://static01.nyt.com/images/2014/01/15/multimedia/bittman-athens/bittman-athens-mediumThreeByTwo440.jpg", "uploadDate": "2014-01-15T17:17:42.000Z", "duration": "PT4M12S"}, "link": "https://cooking.nytimes.com/recipes/1015958-hortopita"}