{"@context": "http://schema.org", "@type": "Recipe", "name": "Devil's Food White-Out Cake", "description": "The cake is three layers of devil’s food with a fourth one crumbled over the icing, artfully if your cake is neat, desperately if it’s not. Crumb topping is a great mask for many of the aesthetic problems a cake might have.", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": "https://static01.nyt.com/images/2015/12/21/dining/21COOKING_DEVILSFOODCAKE/21COOKING_DEVILSFOODCAKE-articleLarge.jpg", "totalTime": "PT2H40M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "", "keywords": "chocolate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 178}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 284, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "7 grams", "sodiumContent": "146 milligrams", "sugarContent": "32 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/3 cups all-purpose flour", "1/2 cup unsweetened cocoa powder", "3/4 teaspoon baking soda", "1/2 teaspoon baking powder", "1/4 teaspoon salt", "1 1/4 sticks (10 tablespoons) unsalted butter, at room temperature", "1/2 cup (packed) light brown sugar", "1/2 cup sugar", "3 large eggs, at room temperature", "1 teaspoon pure vanilla extract", "2 ounce bittersweet chocolate, melted and cooled", "1/2 cup buttermilk or whole milk, at room temperature", "1/2 cup boiling water", "4 ounces semisweet or milk chocolate, finely chopped, or 2/3 cup store-bought mini chocolate chips", "1/2 cup egg whites (about 4 large)", "1 cup sugar", "3/4 teaspoon cream of tartar", "1 cup water", "1 tablespoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven and preheat to 350 degrees. Butter two 8-by-2-inch round cake pans, dust the insides with flour, tap out the excess and line the bottoms with parchment or wax paper. Put the pans on a baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cake: Sift together the flour, cocoa, baking soda, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with a stand mixer, preferably fitted with a paddle attachment, or with a hand mixer in a large bowl, beat the butter on medium speed until soft and creamy. Add the sugars and continue to beat for another 3 minutes. Add the eggs one by one, beating for 1 minute after each addition. Beat in the vanilla; don’t be concerned if the mixture looks curdled. Reduce the mixer speed to low and mix in the melted chocolate. When it is fully incorporated, add the dry ingredients alternately with the buttermilk, adding the dry ingredients in 3 additions and the milk in 2 (begin and end with the dry ingredients); scrape down the sides of the bowl as needed and mix only until the ingredients disappear into the batter. At this point, the batter will be thick, like frosting. Still working on low speed, mix in the boiling water, which will thin the batter considerably. Switch to a rubber spatula, scrape down the bowl and stir in the chopped chocolate. Divide the batter evenly between the two pans and smooth the tops with the rubber spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 25 to 30 minutes, rotating the pans at the midway point. When fully baked, the cakes will be springy to the touch and a thin knife inserted into the centers will come out clean. Don’t worry if the tops have a few small cracks. Transfer the cake pans to a rack and cool for about 5 minutes, then run a knife around the sides of the cakes, unmold them and peel off the paper liners. Invert and cool to room temperature right side up. (The cooled cake layers can be wrapped airtight and stored at room temperature overnight or frozen for up to 2 months.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to fill and frost the cake, inspect the layers. If the cakes have crowned, use a long serrated knife and a gentle sawing motion to even them. With the same knife, slice each layer horizontally in half. Set 3 layers aside and crumble the fourth layer; set the crumbs aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling and frosting: Put the egg whites in a clean, dry mixer bowl or in another large bowl. Have a candy thermometer at hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the sugar, cream of tartar and water in a small saucepan and stir to combine. Bring the mixture to a boil over medium-high heat, cover the pan and boil for 3 minutes. Uncover and allow the syrup to boil until it reaches 242 degrees on the candy thermometer. While the syrup is cooking, start beating the egg whites."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the syrup is at about 235 degrees, begin beating the egg whites on medium speed with the whisk attachment or with a hand mixer. If the whites form firm, shiny peaks before the syrup reaches temperature, reduce the mixer speed to low and keep mixing the whites until the syrup catches up. With the mixer at medium speed, and standing back slightly, carefully pour in the hot syrup, pouring it between the beater(s) and the side of the bowl. Splatters are inevitable — don’t try to scrape them into the whites, just carry on. Add the vanilla extract and keep beating the whites at medium speed until they reach room temperature, about 5 minutes. You should have a smooth, shiny, marshmallowy frosting. Although you could keep it in the fridge in a pinch, it’s really better to use it right now."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the cake: Put a bottom layer cut side up on a cardboard cake round or on a cake plate protected by strips of wax or parchment paper. Using a long metal icing spatula, cover the layer generously with frosting. Top with a second layer, cut side up, and frost it. Finish with the third layer, cut side down, and frost the sides and top of the cake. Don’t worry about smoothing the frosting — it should be swirly. Now, cover the entire cake with the chocolate cake crumbs, gently pressing the crumbs into the filling with your fingers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate the cake for about 1 hour before serving. (If it’s more convenient, you can chill the cake for 8 hours or more; cover it loosely and keep it away from foods with strong odors.)"}]}