{"@context": "http://schema.org", "@type": "Recipe", "name": "Coke-Brined Fried Chicken", "description": "John Currence, of City Grocery in Oxford, Miss., spent a long time in New Orleans after Hurricane Katrina hit, and was justly celebrated for his hard work there helping to rebuild a cathedral of Southern fried chicken, Willie Mae’s Scotch House. In his 2013 cookbook, “Pickles, Pigs and Whiskey,” Currence paid tribute to the wet batter used on Willie Mae’s legendary dish. But for the purpose of weekend chicken warriors we have omitted it in our adaptation of his homage, concentrating instead on Currence’s use of a Coke-based poultry brine that not only adds some sweetness to the chicken thighs he uses but mildly tenderizes them along the way. Let the meat sit in the brine for a few hours before using, but not so long as overnight, where it really begins to break down. Then dry the thighs, dredge them in seasoned flour, and fry in peanut oil, ideally enhanced by lard. The result is mahogany-brown chicken with a crisp crust and a luscious interior.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/01/29/dining/29JPBOWL1/29JPBOWL1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "southern", "recipeCategory": "dinner", "keywords": "chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 381}, "recipeIngredient": ["5 cups Coca-Cola", "1 tablespoon kosher salt", "10 sprigs fresh thyme", "4 cloves garlic, peeled and sliced", "4 teaspoons mild hot sauce like Crystal, Texas Pete or Cholula", "8 to 12 chicken thighs, preferably free-range, organic", "3 cups all-purpose flour", "1 tablespoon kosher salt", "2 teaspoons ground black pepper", "2 teaspoons smoked Spanish paprika", "1 1/2 teaspoons garlic powder", "1 1/2 teaspoons onion powder", "1 teaspoon cayenne pepper", "3 cups peanut oil", "1 cup lard, optional, or replace with peanut oil", "Hot sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the brine: Combine cola, salt, thyme, garlic and hot sauce in a large metal bowl and stir until the salt has dissolved. Add the chicken thighs, cover and refrigerate 3 to 5 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the seasoned flour: In a wide, shallow bowl or pan, combine the flour, salt, pepper, paprika, garlic powder, onion powder and cayenne."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Put the peanut oil in a large heavy-bottom pot or Dutch oven over medium heat until it reaches 375 degrees on a candy thermometer. While the oil heats, remove the chicken from the brine and pat dry. Dredge the thighs in the flour and shake to remove excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches of 2 or 3 at a time, carefully lower thighs into the hot oil. The oil temperature will plummet when the cold chicken goes into the pan; turn up the heat and carefully monitor the temperature. Cook for a little more than 3 minutes on one side, a little more than 3 minutes on the other, and then a final 3 minutes on the first side. Remove to a wire rack or paper towel to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The juices should run clear when the chicken is poked with a knife. If necessary, transfer the browned chicken to a baking sheet and bake until the internal temperature reaches 165 degrees on a instant-read thermometer. Serve hot or at room temperature with hot sauce."}], "link": "https://cooking.nytimes.com/recipes/1015992-coke-brined-fried-chicken"}