{"@context": "http://schema.org", "@type": "Recipe", "name": "Celery Root, Endive, Avocado And Blue Crab Salad", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "blue crabs, meyer lemon", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 535, "unsaturatedFatContent": "36 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "6 grams", "proteinContent": "13 grams", "saturatedFatContent": "8 grams", "sodiumContent": "488 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons minced shallots", "Juice of 2 Meyer lemons, plus extra if desired", "1/4 teaspoon kosher salt", "1/4 teaspoon freshly ground black pepper", "3/4 cup vegetable oil", "2 tablespoons extra virgin olive oil, plus more for sprinkling", "1/2 cup heavy cream", "Pinch of cayenne pepper", "1 large Granny Smith apple", "1 large celery root, peeled and sliced into 1/8-inch matchsticks", "1 large Belgian endive, cut in half lengthwise, then sliced thinly diagonally", "12 ounces blue crab meat", "2 tablespoons chives, in 1-inch lengths", "2 tablespoons roughly chopped celery leaves", "1/4 cup roughly chopped parsley", "1 large ripe avocado"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare dressing: In a medium bowl, combine shallots, lemon juice, salt and black pepper. Allow to sit for 5 minutes, then gradually whisk in the vegetable oil and olive oil. Add the heavy cream and cayenne pepper, stirring to blend. Adjust seasonings to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and core the apple, and cut into 1/8-inch matchsticks. Place in a large mixing bowl with the celery root, endive and 10 ounces of the crab. Add about half of the dressing, and toss to coat; add more dressing, if desired. Add the chives, 1 tablespoon of the celery leaves and all but 1 tablespoon of the parsley. Add additional lemon juice and salt and pepper as desired, to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, peel avocado and slice into thin wedges. Place in a medium bowl, and toss with just enough olive oil to coat the wedges. Season with salt and pepper to taste. Divide the avocado among six plates. Divide the celery root mixture among plates, placing it on top of the avocado but allowing some of the avocado to show at one side. In a small bowl, combine the remaining crab meat, parsley and celery leaves. Add 1/2 tablespoon of the dressing, and toss to combine; reserve the remaining dressing for another use. Place a spoonful of crab mixture on top of each salad as garnish. Serve immediately."}]}