{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Cupcakes", "description": "Right or wrong I’ve always viewed the cupcake as a frosting transport system, and if you’re not a huge frosting fan (I’m not), then I figured, why bother? Then I remembered a friend had mentioned a recipe from Maida Heatter that was, in her words, a “grown-up cupcake.” I figured perhaps I owed the miniature confections a chance. Ms. Heatter’s recipe, modestly entitled, “Chocolate Cupcakes” from her 1974 book “Maida Heatter’s Book of Great Desserts,” produced a rich, moist crumb that relies on cocoa powder for its deep chocolatey flavor. But it’s her topping of semi-sweet chocolate ganache that separates these cupcakes from the crowd. No buttercream, no food coloring, and no diabetic shock after consumption. Just a really nice chocolate cake that’s a bit on the small side.", "author": {"@type": "Person", "name": "Suzanne Lenzer"}, "image": "https://static01.nyt.com/images/2017/01/24/dining/24COOKING-CHOCOLATE-CUPCAKES2/23COOKING-CHOCOLATE-CUPCAKES2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "24 cupcakes", "recipeCuisine": "", "recipeCategory": "easy, cakes", "keywords": "cake, chocolate, ganache, dessert, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 895}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 204, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "6 grams", "sodiumContent": "116 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups sifted all-purpose flour", "1 teaspoon baking soda", "1/2 teaspoon salt", "1/2 cup unsweetened cocoa powder (preferably Dutch process)", "2/3 cup/5 1/3 ounces unsalted butter (1 1/3 sticks)", "1 teaspoon vanilla extract", "1 1/2 cups granulated sugar", "3 eggs", "1 cup milk", "6 ounces of semisweet chocolate chips", "1/3 cup heavy cream", "1 tablespoon granulated sugar", "1 1/2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees and line 4 6-cup muffin tins with cupcake liners. Sift together the flour, soda, salt, and cocoa powder and set aside. Use a standing mixer or hand-mixer to cream the butter. Add the sugar and vanilla and mix to combine. Add the eggs one at a time, beating after each one until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On the lowest speed, alternately add the dry ingredients in three additions and the milk in two. Beat only until smooth and fully combined, you don’t want to overwork the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop the batter into the prepared pans filling each about two-thirds full (don’t bother to smooth the tops--the batter will level itself as it cooks). Bake the cupcakes for about 25 minutes, or until the tops are puffed and spring back when lightly pressed. Be careful not to overbake the cakes, but know that if you take them out too early they may sink a bit. Cool the cakes in the muffin tins for about 5 minutes and then remove them to a rack and let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the ganache, put all the ingredients in a small, deep saucepan over medium-low heat. Cook, whisking occasionally to combine, until the chocolate and butter are nearly melted. Take the pan off the heat and whisk continuously until all the chocolate is melted; the ganache should be shiny and without any lumps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the ganache is about room temperature, use a butter knife to spread it evenly on top of the cakes; sprinkle with nonpareil if you like. The cakes can be made a day in advance and refrigerated (they actually get better) or frozen in an airtight container."}]}