{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Zucchini", "description": "Fried food is probably not on anyone’s lists of healthy eats, but you have to start with this: Fat is good for you.\n\nThere are differences among fats, of course, but with trans-fats in full retreat and lard and butter making comebacks, the whole fat-eating thing is starting to make some sense. Of course, the key word is moderation. You can eat fat as long as it’s high quality and you don’t eat it to the exclusion of plants.\n\nThat’s one reason you shouldn’t reject deep-frying at home; I do it about once a month. The second reason is that you know you love it. The third is that it can be fast and easy. The fourth is that you can deep-fry plants. (And anything else.)", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2013/10/23/dining/23JPFLEX3/23JPFLEX3-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, quick", "keywords": "side dish, zucchini", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 137}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1016, "unsaturatedFatContent": "56 grams", "carbohydrateContent": "90 grams", "cholesterolContent": null, "fatContent": "65 grams", "fiberContent": "7 grams", "proteinContent": "21 grams", "saturatedFatContent": "6 grams", "sodiumContent": "997 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 medium zucchini, about 2 pounds", "3 eggs", "Salt", "Black pepper", "1 cup all-purpose flour", "3 cups bread crumbs, preferably fresh", "Neutral oil, such as canola or grapeseed, for deep-frying", "1/4 cup chopped fresh parsley leaves for garnish", "2 lemons, quartered, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim stem ends from zucchini and cut either crosswise into slices about 1/2-inch thick or into French-fry-like sticks. Heat the oven to 200. Beat eggs with salt and pepper in a shallow bowl or pie plate. Set up an assembly line of a plate of flour, the plate of eggs and a plate of bread crumbs. Have a baking sheet ready, and several rectangles of wax or parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coat a zucchini piece in the flour, dip in the egg and coat in the bread crumbs. You want a thin, even layer of each coating; shake off any excess. Put coated zucchini on baking sheet in a single layer, top with wax or parchment paper and repeat with remaining slices. Chill for at least 10 minutes or up to 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large heavy skillet or a deep broad saucepan over medium heat and pour in enough oil to come up the sides at least 1/2 inch. While the oil heats, line a plate with paper towels. The oil is ready when a pinch of flour sizzles immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a few zucchini pieces in the oil without crowding. When the bottoms brown, after 2 to 3 minutes, turn and cook the other side for 2 to 3 minutes, adjusting heat to keep oil sputtering without smoking or burning zucchini. As each piece is done, put it on the paper towels to drain, turning to blot it on both sides if needed. Transfer to an ovenproof platter and keep warm in oven while you finish cooking. Add and heat up oil as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish with parsley and serve with lemon wedges."}], "link": "https://cooking.nytimes.com/recipes/1015255-fried-zucchini"}