{"@context": "http://schema.org", "@type": "Recipe", "name": "Rhubarb Syrup", "description": "Rhubarb cooks down so quickly, this project takes less than an hour and the payoff is astonishing. It also has a pleasing economy: you get a lovely syrup to make drinks with, alcoholic and nonalcoholic, while the fibrous pulp that you strain off may in fact be the best part, spooned atop yogurt with fresh strawberries, or as a silky, tart ice-cream topping. This could be made as a simple syrup, but it's hard then to adjust the sweetness for differing tastes and applications. Sometimes you want to incorporate it as a sour into drinks that have other sweetened ingredients; and if you want to use the pulp on ice cream or sweetened yogurt, keeping it tart is a better option. So, just just simmer down the fruit with one vanilla pod and use it unsweetened, which offers more room to maneuver.", "author": {"@type": "Person", "name": "Toby Cecchini"}, "image": "https://static01.nyt.com/images/2010/07/01/t-magazine/01casestudy-rhubarb/01casestudy-rhubarb-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "non-alcoholic drinks", "keywords": "rhubarb, vanilla", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 86}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 87, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "7 grams", "proteinContent": "4 grams", "saturatedFatContent": "0 grams", "sodiumContent": "37 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["3 to 4 pounds rhubarb stalks, trimmed of leaves", "1 vanilla pod, split lengthwise", "8 to 10 cups water."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the rhubarb in cold water, trim the ends, and cut into 1/2-inch pieces. (There’s no need to peel them or worry about the fibers, as these simply melt down.) Place the fruit in a 6 to 8-quart pot and add cold water to cover. Bring to a boil, immediately reduce the heat to a low simmer, and cover, stirring occasionally. When all the chunks have broken down into a uniform soup — 20 minutes or so — remove it from the heat. Uncover and allow to cool. As soon as it is cool enough to handle, ladle into a fine-mesh strainer over a spouted collecting bowl. (You may have to do this in batches.) The pulp will become a mass, so stirring it in the strainer with a wooden spoon will allow it to drain better. Once it’s drained, put the pulp and the syrup into separate containers and refrigerate immediately. Makes 2-plus liters of syrup and 2 pounds of pulp. Will keep for a week refrigerated."}], "link": "https://cooking.nytimes.com/recipes/1015324-rhubarb-syrup"}