{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Roasted Fish With Wild Mushrooms", "description": "A very large whole roasted fish brought to the table with head and tail intact is a visually dramatic and incredibly tasty dinner party main course. Even better is that it&rsquo;s both a breeze to cook (season it up, throw it in the oven and wait), and to serve (big fish have big bones, which makes it easy to scoop the flesh off the skeleton). Do not forget to call your fishmonger ahead to order a large fish. \n\nThis recipe, with lemons, herbs and crisp wild mushrooms, will work with any 4- to 6-pounder, from delicate black sea bass to salmon-colored arctic char. The variety of fish here is less important than the size. Generally speaking, you&rsquo;ll need about a pound of fish per person, though three-quarters of a pound will do if you&rsquo;re serving it in the context of a multi-course meal. Also, if you can&rsquo;t find one very large fish, you can use two smaller ones, 1 1/2 to 2 1/2 pounds each. In that case, feel free to squeeze them into one roasting pan.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/12/18/dining/18APPE_SPAN/18APPE-articleLarge.jpg", "totalTime": "PT1M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick", "keywords": "fish, mushroom, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 100}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 518, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "3 grams", "proteinContent": "78 grams", "saturatedFatContent": "3 grams", "sodiumContent": "423 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 (4- to 6-pound) whole fish, such as black sea bass, blackfish or arctic char, cleaned\n", "3 tablespoons extra-virgin olive oil, more as needed\n", "1/4 teaspoon coarse kosher salt, more as needed\n", "1/4 teaspoon black pepper, more as needed\n", "Thinly sliced lemon, as needed, plus lemon wedges for serving\n", "1 small bunch fresh herbs, such as sage, thyme or rosemary\n", "1 pound wild mushrooms, including maitake and oyster, cut into 1-inch pieces\n", "Best quality extra-virgin olive oil, for serving\n", "Flaky sea salt, for serving\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Coat fish with oil and season it generously inside and out with salt and pepper. Stuff cavity with lemon slices and herbs. Transfer to a baking sheet or large roasting pan and bake until the flesh is opaque and separates easily from the backbone, 35 to 45 minutes for a 4-pound fish, 45 to 60 minutes for a 6-pound fish. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While fish cooks, toss mushrooms with 3 tablespoons oil, 1/4 teaspoon salt and 1/4 teaspoon pepper. Spread mushrooms out in one layer on 1 or 2 baking sheets, taking care not to crowd them. When fish is done, remove from oven and turn on broiler. Broil mushrooms until they are crisp and golden, 5 to 10 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let fish rest in roasting pan for 5 minutes. Using back of a fork, scrape away fish skin and divide top fillet among plates. Lift away backbone and discard; scoop bottom fillet away from its skin (which should stick to the pan) and divide among plates. Drizzle fillets with good olive oil, season with flaky sea salt and serve with lemon wedges and crispy mushrooms on the side. "}], "link": "https://cooking.nytimes.com/recipes/1015842-whole-roasted-fish-with-wild-mushrooms"}