{"@context": "http://schema.org", "@type": "Recipe", "name": "Bibimbap With Clams, Kale, Daikon and Carrots", "description": "The broth from the clams is used to season the rice in this version of bibimbap. Prepare all of the vegetables first", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Bibimbap-With-Clams-Kale-Daikon-and-Carrots/Bibimbap-With-Clams-Kale-Daikon-and-Carrots-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings.", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, gluten-free, healthy, high fiber, nut-free", "aggregateRating": null, "recipeIngredient": ["2 tablespoons rice vinegar", "1 tablespoon sesame oil", "2 large garlic cloves, minced or puréed", "2 to 3 scallions, minced", "1 tablespoon toasted sesame seeds", "Salt to taste", "Korean red pepper paste (kochujang) to taste (available at Korean markets)", "1 daikon radish, grated", "1 bunch kale, stemmed and washed in 2 changes of water", "1/2 pound carrots, cut in matchsticks or grated", "Soy sauce to taste", "20 Manila clams", "1/2 cup dry white wine", "1/2 cup water", "1 to 2 garlic cloves, to taste, crushed", "1 tablespoon minced ginger", "2 scallions, finely chopped", "1 dried red chili pepper", "1 teaspoon sugar", "1 teaspoon soy sauce", "1 teaspoon sesame oil", "1 1/2 to 2 cups brown rice, barley, quinoa or another grain of your choice, cooked (keep hot)", "4 eggs (optional)", "Korean red pepper paste (kochujang) to taste (available at Korean markets)", "2 sheets nori seaweed (kimgui), lightly toasted* and cut into thin strips (optional)", "2 teaspoons toasted sesame seeds or black sesame seeds", " Toast nori sheets (if not toasted already) by quickly passing them over a gas flame (hold with tongs) until crisp."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": " In a small bowl or measuring cup, mix together the rice vinegar, sesame oil, garlic, scallions, sesame seeds, chili paste and salt to taste for the vegetables. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In separate bowls, toss the prepared daikon and carrots with salt to taste and cover with cold water. Soak for 15 to 30 minutes. Drain and squeeze dry. Place in separate bowls and toss each with 1 tablespoon of the vinegar and sesame oil mixture. Add salt or soy sauce to taste. Set aside in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch the kale for 2 to 3 minutes in salted boiling water. Transfer to a bowl of cold water, drain and squeeze out excess water.  Remove from the heat and toss in a bowl with 1 tablespoon of the vinegar and sesame oil mixture. Add salt or soy sauce to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the clams in several changes of water and brush them to remove sand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the wine, water, crushed garlic, ginger, scallions and dried chili pepper in a lidded pot or pan and bring to a boil. Add the clams, cover and steam until they open, about 3 minutes. Using tongs, remove the clams to a bowl, cover and keep warm. Strain the liquid in the pot through a cheesecloth-lined strainer set over a bowl and return to the pan. Add the sugar, soy sauce, sesame oil and any liquid that has accumulated in the bowl with the clams, and bring to a boil. Reduce to about 1/2 to 1/3 cup and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry the eggs in a nonstick skillet until the whites are set and the yolks are still runny. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 4 wide soup bowls. Place a mound of hot grains in the middle of each one and top with a spoonful of the broth from the clams. Surround with the clams and vegetables, as well as kimchi if desired, each ingredient in its own little pile. Place a fried egg and a small spoonful of chili paste on top of the rice and garnish with the toasted nori and sesame seeds. Serve at once. Diners should break the egg into the rice. Pass the chili paste and add more as desired."}], "link": "https://cooking.nytimes.com/recipes/1015435-bibimbap-with-clams-kale-daikon-and-carrots"}