{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Beef Ribs With Vegetables", "description": "", "author": {"@type": "Person", "name": "David Latt"}, "image": null, "totalTime": "PT3H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, ribs", "aggregateRating": null, "recipeIngredient": ["3 tablespoons olive oil", "Sea salt", "Freshly ground black pepper", "4 lbs. beef rib bones or short ribs, washed", "2 medium onions, peeled, roughly chopped", "5 cloves garlic, peeled, roughly chopped", "1 tablespoon sweet butter", "3 medium Yukon potatoes, peeled, roughly chopped", "6 brown mushrooms, washed, sliced", "3 large carrots, peeled, cut into thick rounds", "2 celery stalks, cut into one-inch lengths", "3 broccoli crowns, washed, the florets cut apart", "10 Brussels sprouts, trimmed, quartered", "1 cup Italian parsley, roughly chopped", "1 teaspoon fresh rosemary", "4 cups water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a Dutch oven or high-sided frying pan, heat 1 tablespoon of the olive oil and season with sea salt and freshly ground black pepper. Brown the ribs on all sides, then remove, and discard the fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 1 tablespoon of olive oil in the pan and brown 1 onion and 2 garlic cloves. Deglaze the pan with the water, add back the ribs, cover, and put into a 400 degree oven for 1 hour. Remove the pan, turn over the ribs, and put back in the oven for another hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Check the ribs. The meat should be tender and almost falling off the bone. If you're using short ribs, you may need to increase the cooking time another hour and you may have to add another cup of liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the ribs into one container. Strain out the onions and garlic and discard. Put the braising liquid into a second container and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, peel the thick layer of fat off the braising liquid and discard. In the same pan you used the day before, heat the olive oil and butter. Brown the potatoes, mushrooms, and the rest of the onions, add the ribs and the braising liquid. Cover and simmer for 15 minutes. Add the carrots, celery, broccoli, parsley, the rest of the garlic, and Brussels sprouts. Cover and simmer another 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the ribs in bowls with plenty of vegetables, the braising liquid, and a fresh baguette."}], "link": "https://cooking.nytimes.com/recipes/1015512-braised-beef-ribs-with-vegetables"}