{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn Chowder", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "corn", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 46}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 415, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "7 grams", "proteinContent": "8 grams", "saturatedFatContent": "14 grams", "sodiumContent": "686 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 onions, diced", "4 tablespoons unsalted butter or olive oil", "6 ears of corn", "1/2 cup heavy cream", "2 teaspoons salt", "freshly ground black pepper", "4 sprigs micro greens, like pea shoots, for garnish."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife, cut the kernels off the ears of corn and set aside, reserving the cobs. In a large saucepan, combine the cobs, 1 of the diced onions, and 8 cups water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place over high heat to bring to a boil, then reduce heat to medium. Cover and cook for 20 minutes. Turn off heat and allow to steep for an additional 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the corncobs are steeping, place a large saucepan over medium-low heat, and add butter or olive oil. Add remaining diced onion and sauté until translucent and soft, about 20 minutes; do not allow to take on any color. Add corn kernels and sauté until slightly translucent, about 5 minutes. Remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the stock has finished steeping, strain it, discarding the cobs and onions. Add 6 cups to the pot of corn kernels; discard any remaining stock or reserve for another use. Return to medium heat and simmer until the corn is soft, about 2 minutes. Add heavy cream, reduce heat to low, and cook for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove half the soup and allow to cool until no longer steaming when stirred. Hot soup cannot be puréed in a blender, because the aeration makes the top blow off, and the hot soup spews all over. Working in batches, purée the soup in a blender until kernels are partly broken, or smooth, depending on your preference, then return to pot, reheating gently if necessary. Season with salt and a few grinds of black pepper. Divide among four bowls, and garnish with micro greens."}], "link": "https://cooking.nytimes.com/recipes/1015535-corn-chowder"}