{"@context": "http://schema.org", "@type": "Recipe", "name": "Zuni Café Chicken", "description": "You don’t need a brick oven for this perfect roast chicken from the legendary chef Judy Rodgers — but you do need a hot one, and a day or so to dry-brine the bird before using it. If you don't have the time to dry-brine, don't. You'll still end up with one of the best roast chickens you've ever had. Just dry the bird really well with paper towels before seasoning and dab it again before putting it into the sizzling pan. Rodgers’s technique, which involves drying and seasoning the chicken, then flipping it while cooking, results in a wonderfully browned bird, with crackling skin and moist meat. Serve it over a <a href=\"http://cooking.nytimes.com/recipes/10721-warm-bread-salad\">bread salad</a>, as she did, or with well-dressed greens and a baguette. You win either way.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2018/06/07/dining/zuni-chicken/zuni-chicken-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 or more servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 542}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1043, "unsaturatedFatContent": "46 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "73 grams", "fiberContent": "1 gram", "proteinContent": "90 grams", "saturatedFatContent": "21 grams", "sodiumContent": "1663 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["One small chicken, 2 3/4 to 3 1/2 pounds", "4 sprigs fresh thyme, marjoram, rosemary or sage", "Sea salt", "1/4 teaspoon ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the chicken 1 to 3 days before serving (for 3 1/4- to 3 1/2-pound chickens, at least 2 days): Remove and discard the lump of fat inside the chicken. Pat the chicken very dry (a wet chicken will spend too much time steaming before it begins to turn golden brown)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide a finger under the skin of each of the breasts, making 2 little pockets, then use a fingertip to gently loosen a pocket of skin on the outside of the thickest section of each thigh. Push an herb sprig into each of the 4 pockets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using about 3/4 teaspoon sea salt per pound of chicken and pepper to taste, season the chicken liberally all over with salt and the pepper. Sprinkle a little of the salt just inside the cavity and on the backbone. Twist and tuck the wing tips behind the shoulders. Cover loosely and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to cook the chicken, heat the oven to 475 degrees. Depending on your oven and the size of your bird, you may need to adjust the heat to as high as 500 degrees or as low as 450 degrees during roasting to brown the chicken properly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Choose a shallow flameproof roasting pan or dish barely larger than the chicken, or use a 10-inch skillet with an all-metal handle. Preheat the pan over medium heat. Wipe the chicken dry and set it breast side up in the pan. It should sizzle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the center of the oven and watch for it to start sizzling and browning within 20 minutes. If it doesn’t, raise the temperature progressively until it does. The skin should blister, but if the chicken begins to char, or the fat is smoking, reduce the temperature by 25 degrees. After about 30 minutes, turn the bird over (drying the bird and preheating the pan should keep the skin from sticking). Roast for another 10 to 20 minutes, depending on size, then flip back over to re-crisp the breast skin, another 5 to 10 minutes. Total oven time will be 45 minutes to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken from the roasting pan and set on a plate. Pour the clear fat from the pan, leaving the drippings. Add about a tablespoon of water to the hot pan and swirl. Slash the stretched skin between the thighs and breasts of the chicken, then tilt the bird and plate over the roasting pan to drain the juice into the drippings. As the chicken rests, tilt the roasting pan and skim the last of the fat. Place over medium-low heat, add any juice that has collected under the chicken, and bring to a simmer. Stir and scrape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the chicken into pieces and pour the pan drippings over the chicken."}], "link": "https://cooking.nytimes.com/recipes/1015770-zuni-cafe-chicken"}