{"@context": "http://schema.org", "@type": "Recipe", "name": "Roy Choi’s Braised Short-Rib Stew", "description": "Here is an adaptation of the Korean braised-short-rib stew known as galbijjim, a staple of neighborhood potlucks and church suppers and, in the words of the Los Angeles chef Roy Choi, “that meal from home that every Korean kid says his or her mom does best.” His recipe (well, my version of his recipe, which is his version of his mom’s) is rich and deeply flavored, thickly sauced and pungent with sugar, spice, soy and garlic. It is the sort of meal you could put together on a weekend afternoon and serve for nights to come. It is the best sort of family food.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2020/02/10/dining/roy-choi-stew/merlin_167226090_3ff938cd-6b16-47b1-880e-fec6453c9765-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "asian, korean", "recipeCategory": "brunch, dinner, lunch", "keywords": "main course, short ribs", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 781}, "recipeIngredient": ["4 pounds bone-in short ribs", "1 small bunch scallions, trimmed and roughly chopped", "1 1/2 cups soy sauce", "1/4 cup chopped fresh ginger", "1 small yellow onion, roughly chopped", "1/2 cup garlic cloves, peeled (about 2 heads)", "1/2 cup granulated sugar", "1/2 cup mirin", "1/2 cup fresh orange juice", "1/2 cup apple juice", "1/2 pound shiitake mushrooms, stems reserved for another use, halved or quartered if large", "1 cup jarred, peeled chestnuts", "1 cup taro, peeled and cut into large dice (about a 3-inch segment)", "1 cup carrots, peeled and cut into large dice (about 2 carrots)", "1 cup butternut squash, peeled and cubed (about half a squash)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put short ribs in a bowl, and cover with water. Drain, and discard water. Repeat twice. Remove short ribs from bowl, and score them diagonally across the top of the meat. Return ribs to the bowl, and rinse again. Remove, and pat dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender or food processor, combine scallions, soy sauce, ginger, onion, garlic, sugar, mirin, orange juice and apple juice, then pulse to purée. Add a little water if you need to thin out the sauce so it combines."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put puréed sauce in a heavy-bottomed pot or Dutch oven with a lid, add 3 cups water and stir to combine. Bring pot to a boil over high heat, then add the ribs to the pot and lower heat to a simmer. Cover pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook ribs over low for at least 2 hours. Add vegetables, cover and simmer, 30 minutes more or so, until meat is tender and vegetables are cooked through. Serve warm."}]}