{"@context": "http://schema.org", "@type": "Recipe", "name": "New Mexican Pozole", "description": "In New Mexico, there is abundance and generosity and plenty of comfort food at holiday parties. Posole, the savory and hearty, rather soupy stew made from dried large white corn kernels simmered for hours, is traditional and easy to prepare. Stir in a ruddy red purée of dried New Mexico chiles to give the stew its requisite kick. This is satisfying, nourishing, fortifying fare. The corn stays a little bit chewy in a wonderful way (canned hominy never does), and the spicy broth is beguiling.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/12/04/dining/04KITCH_SPAN/04KITCH_SPAN-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, pozole", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 533}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 588, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "54 grams", "fiberContent": "1 gram", "proteinContent": "21 grams", "saturatedFatContent": "19 grams", "sodiumContent": "567 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds dried hominy (posole), available in Latino groceries, soaked overnight in cold water", "3 ounces dried red New Mexico chiles (about 10 large chiles)", "2 pounds fresh pork belly, cut in 2-inch cubes", "2 pounds pork shoulder, not too lean, cut in 2-inch chunks", "Salt and pepper", "1 large yellow onion, peeled, halved and stuck with 2 cloves", "1 bay leaf", "1 tablespoon chopped garlic", "2 teaspoons cumin seeds, toasted until fragrant and coarsely ground", "2 cups finely diced white onion, soaked in ice water, for garnish", "Lime wedges", "Roughly chopped cilantro, for garnish", "Toasted Mexican oregano, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain soaked hominy and put in large soup pot. Cover with water and bring to boil. Let simmer briskly for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While hominy is cooking, make red chile purée: Toast dried chiles lightly in cast-iron skillet or stovetop grill, just until fragrant. Wearing gloves, slit chiles lengthwise with paring knife. Remove and discard stems and seeds. Put chiles in saucepan and cover with 4 cups water. Simmer 30 minutes and let cool. In blender, purée chiles to a smooth paste using some cooking water as necessary. Purée should be of milkshake consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season pork belly and pork shoulder generously with salt and pepper. After posole has cooked 1 hour, add pork shoulder, pork belly, onion stuck with cloves, bay leaf, garlic and cumin. Add enough water to cover by 2 inches, then return to a brisk simmer. While adding water occasionally and tasting broth for salt, simmer for about 2 1/2 hours more, until meat is tender and posole grains have softened and burst. Skim fat from surface of broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in 1 cup chile purée and simmer for 10 minutes. Taste and correct seasoning. (At this point, posole can be cooled completely and reheated later. Refrigerate for up to 3 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle posole, meat and broth into wide bowls. Pass bowls of diced onion, lime wedges, cilantro and oregano, and let guests garnish to taste."}]}