{"@context": "http://schema.org", "@type": "Recipe", "name": "Hazelnut, Orange  and Honey Biscotti", "description": "Orange, hazelnut and honey make a wonderful combination in this whole wheat biscotti. The hard cookies should be sliced thin, which will yield a lot of cookies! They are wonderful dipped in tea. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/11/05/science/07recipehealth/07recipehealth-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "5 dozen smaller cookies (cut across the log)", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "dairy-free, healthy, kosher, low cholesterol, low-fat, low-sodium, low sugar, vegetarian, dessert, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 94}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 50, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "16 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["220 grams (approximately 1 3/4 cups) whole wheat flour", "120 grams (approximately 1 1/3 cups) hazelnut flour", "5 grams (approximately 1 teaspoon) baking powder", "1/8 teaspoon (pinch) of salt", "190 grams (1/2 cup) honey", "165 grams (3 large) eggs", "2 tablespoons orange liqueur, such as Cointreau, or orange juice", "5 grams (approximately 1 teaspoon) vanilla extract", "2 tablespoons finely chopped orange zest", "100 grams hazelnuts, toasted, skinned and chopped (approximately 3/4 cup chopped)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Line a baking sheet with parchment. Whisk together the flour, hazelnut flour, baking powder and salt in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer, or in a large bowl with a whisk or electric beater, beat together the honey and eggs for 2 minutes. Scrape down the sides of the bowl and beaters. Add the vanilla, orange liqueur or juice, and orange zest and beat for another minute. Turn off the mixer, scrape down the bowl and beaters, and add the flour mixture. Mix in at low speed until combined. The batter will be sticky. Add the hazelnuts and mix until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spatula or a bowl scraper, scrape out half the batter onto the baking sheet. Moisten your hands so the dough won’t stick, and form a log, about 12 inches long by 2 1/2 inches wide. Repeat with the other half of the batter. The logs can be on the same baking sheet but make sure there is at least 2 inches of space between them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven and bake 40 to 45 minutes, until lightly browned and dry. Remove from the oven and cool on a rack for 20 minutes (or longer). Place on a cutting board and slice thin, about 1/3 inch, either straight across the logs (for more, but smaller biscotti) or on the diagonal (for more traditionally shaped biscotti). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cookies on baking sheets and return one sheet at a time to the middle rack of the oven. Bake 15 minutes. Flip the cookies over and bake for another 10 to 15 minutes, until hard and lightly browned. Remove from the heat and allow to cool."}], "link": "https://cooking.nytimes.com/recipes/1015352-hazelnut-orange-and-honey-biscotti"}