{"@context": "http://schema.org", "@type": "Recipe", "name": "Kimchi Omelet With Sriracha Syrup", "description": "The ingredient list is short and the cooking method quick and unfussy — so much so that this kimchi omelet doesn’t seem like a restaurant recipe at all. But then you bite in. There is a delicate balance of flavors — sweet, salty, spicy — and textures — soft, crunchy, sticky — that only a skilled chef could so precisely devise. That the ingredients are not expensive and the technique not daunting only makes it more appealing.\n\nThe premise is simple: you sauté chopped store-bought kimchi in a pan, then add beaten eggs. What elevates this from your standard brunch is the sriracha syrup, made from simmered rice vinegar and sugar spiked with thick red hot sriracha chili sauce (or any other hot sauce). Combined with the kimchi, there’s just enough heat to make your tongue tingle but not burn. For that you can add more sriracha on the side if you like. Or serve it with more kimchi. It makes a hearty breakfast, an unusual lunch or a light dinner. And a simple one, too.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/04/16/dining/dj-take/dj-take-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "1 main course serving, or 2 to 4 appetizer servings", "recipeCuisine": "", "recipeCategory": "breakfast, easy, quick", "keywords": "cabbage kimchi, eggs, sriracha, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 248}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 572, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "73 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "3 grams", "proteinContent": "14 grams", "saturatedFatContent": "4 grams", "sodiumContent": "890 milligrams", "sugarContent": "68 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup rice vinegar", "1/3 cup sugar", "1 to 2 teaspoons sriracha hot sauce, more to taste", "1 tablespoon vegetable oil", "1/2 cup kimchi, coarsely chopped", "2 large eggs, beaten", "Salt, as needed", "Black pepper, as needed", "Toasted black sesame seeds, for garnish", "Cilantro leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sriracha syrup, in a small pot set over medium heat combine vinegar and sugar. Bring to a boil and simmer until syrup is reduced by about half, 6 to 8 minutes. Remove from heat and allow syrup to cool slightly. Stir in sriracha sauce and set aside while you make the omelet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small nonstick pan set over medium-high heat, add oil and warm until shimmering. Add kimchi and cook, stirring, until warm, about 30 seconds. Add eggs and quickly scramble mixture with a fork. Pat flat with a spatula; cook, without moving, until almost set but still slightly loose on top, 1 to 2 minutes. Season with salt and pepper. Slide omelet onto a plate, folding half of it over the filling. Drizzle with sriracha syrup and garnish with sesame seeds and cilantro leaves."}]}