{"@context": "http://schema.org", "@type": "Recipe", "name": "The Temporary Vegetarian: A Portuguese Empada", "description": "The Portuguese-born, New York-based chef Luisa Fernandes makes a savory empada — Portuguese stuffed pastry — that is similar to a ratatouille wrapped in puff pastry. She sautés eggplant, tomatoes, squash, onions and garlic, and once the vegetables are cooled, she tucks them into the pastry in muffin tins, and bakes them until they are golden. Serve them for lunch with a salad.", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "portuguese", "recipeCategory": "dinner, lunch", "keywords": "squash, zucchini", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 12}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 132, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "302 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil", "1 cup finely chopped red onion", "1 garlic clove, finely chopped", "1 cup finely (1/3 inch) diced zucchini", "1 cup finely diced yellow squash", "1 cup finely diced eggplant", "1/2 cup finely diced tomatoes", "2 teaspoons finely chopped fresh thyme", "2 tablespoons finely chopped parsley", "1 tablespoon red wine vinegar", "salt and freshly ground pepper", "1 sheets 14 by 16 inch sheet puff pastry", "1 tablespoon  all-purpose flour, plus additional as needed", "1 tablespoon butter, or non-stick cooking spray", "1 large egg, beaten."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. ln a large skillet over medium heat, heat olive oil until shimmering. Add onions and garlic, and sauté until translucent, about 5 minutes. Add zucchini, squash, and eggplant, and sauté until tender but have not lost their shape, about 10 minutes. Add tomatoes, thyme and parsley, and cook until tomatoes soften but do not lose their shape, about 5 minutes. Add red wine vinegar. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix 1 tablespoon flour with 3 tablespoons water. Mix well, and add to the vegetables. Cook for 3 minutes, stirring. Transfer to a baking sheet to cool until no longer steaming, then place in refrigerator to chill, uncovered, for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one sheet of puff pastry on a lightly floured work surface. Using a 3 1/2- to 4-inch-in-diameter cookie cutter or cup, cut out six disks. Using a 1-1/2 inch cookie cutter, cut out six more disks. Roll all the disks out to 1/8 inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter or spray a six-cup muffin pan with 3-inch diameter cups. Place a large disk in each of the holders; the dough should overlap the holder by about an inch. Add one sixth of the chilled vegetables to each cup. Place the small circle of pastry on top of the vegetables, and fold over the edges of the larger circle to fully enclose the empada. (It may be possible to pinch together the edge of the large disk of dough without using the smaller disk.) Brush the tops with beaten egg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake empadas until golden brown, 25 to 40 minutes. Using a knife, gently loosen from the muffin tins. Transfer to plates, and serve hot. If desired, serve with a salad."}], "link": "https://cooking.nytimes.com/recipes/1015680-the-temporary-vegetarian-a-portuguese-empada"}