{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Shrimp With Chard, Chiles and Ginger", "description": "Spicy sautéed chard with chiles and ginger is full of flavor, easy and pleasing with pretty much any protein. Here, it moves to the center of the plate with plump, seared shrimp. Any kind of chard can be used for this dish, but rainbow or red will be prettier than white-stemmed Swiss chard. That’s because those stems go right into the pan along with the leaves. It’s not only less wasteful, but the stems also add a pronounced, succulent texture to the mix. \n", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/09/09/dining/09Dinner/09Dinner-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick", "keywords": "chard, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 237}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 264, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "26 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1210 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds cleaned extra-large shrimp ", "1/2 teaspoon kosher salt, more for seasoning the shrimp ", "2 bunches red or rainbow chard, rinsed (about 1 pound) ", "3 tablespoons extra-virgin olive oil ", "4 cloves garlic, minced ", "1 hot chile like Thai or Hungarian wax, seeded if desired and thinly sliced ", "1 long mild or sweet chile like Italian frying, thinly sliced ", "1 shallot, chopped ", "1 teaspoon grated fresh ginger root ", "2 teaspoons light brown sugar ", "1 teaspoon freshly ground black pepper ", "1 to 2 teaspoons sherry vinegar, to taste ", "1/2 cup cilantro leaves "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season shrimp generously with salt. Wash and trim chard, thinly slicing the stems. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over medium heat, heat 1 tablespoon of the oil, then add shrimp and sear until lightly browned, about 2 minutes per side. Transfer shrimp to a plate. Add the remaining 2 tablespoons oil to the skillet, let heat for a few seconds, then add garlic, chile peppers, shallot and ginger and sauté until slightly browned, about 3 minutes. Stir in sugar, pepper and salt and cook for 1 minute longer. Stir in chard stems and sauté until they start to soften, about 2 minutes.\n\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the greens to the skillet along with 2 tablespoons water and immediately cover the pan. Keep it covered for 2 to 3 minutes to allow the greens to wilt. Once the greens have cooked down, remove the lid and continue cooking for a few more minutes to allow the water to evaporate. Add the shrimp and any liquid accumulated on the plate and cook just until the shrimp are heated through, about 1 minute longer. Drizzle with the sherry vinegar and gently toss to coat. Serve hot, garnished with the cilantro. "}], "link": "https://cooking.nytimes.com/recipes/1015090-seared-shrimp-with-chard-chiles-and-ginger"}