{"@context": "http://schema.org", "@type": "Recipe", "name": "Gravy From a Brined Bird", "description": "The lifeblood of a Thanksgiving meal is the gravy. To make it truly delicious, you need the hot fat and juices from the turkey and the consistency of texture that comes from pulling all the elements together just before the gravy hits the table. The addition of drippings fortified with wine allows you to build flavor.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": null, "totalTime": "PT25M", "recipeYield": "About 4 cups", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, quick, condiments, sauces and gravies", "keywords": "butter, flour, gravy, turkey stock", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "recipeIngredient": ["4 tablespoons unsalted butter", "1/2 cup all-purpose flour", "Pan drippings to taste", "1/2 cup dry white wine (or use water)", "4 cups homemade turkey stock or low-salt canned chicken broth", "Salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a roux: melt butter in a large skillet. Add the flour all at once, whisking until incorporated. Cook, whisking occasionally, until the roux begins to look grainy, 3 to 4 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the roast turkey is done cooking, pour the pan drippings into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Deglaze the roasting pan by adding the wine, bringing it to a boil and scraping the pan with a wooden spoon, adding a little water as needed to incorporate the browned bits. Add to the drippings in the bowl. Skim off the fat with a spoon, or put in the refrigerator or freezer until the fat has congealed on top, then remove fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the gravy: Bring the broth to a simmer in a covered saucepan, then slowly add 3 cups of the broth to the cold or room-temperature roux, whisking constantly. Slowly add the reserved drippings, starting with a few tablespoons; taste, then whisk in more a little at a time until the gravy tastes right. Season with salt, if needed, and pepper. To adjust the consistency, add more broth for a thinner gravy or simmer for a few minutes for a thicker one. \n\nKeep warm until ready to serve."}]}