{"@context": "http://schema.org", "@type": "Recipe", "name": "Puréed Roasted Squash and Yams With Citrus", "description": "This aromatic dish is inspired by a recipe in Lynne Rossetto Kasper’s wonderful book “The Splendid Table.” The dish was traditional at Yom Kippur among the Italian Jews of Emilia-Romagna. Ms. Kasper says that in Italy the dish is often served with poached turkey, which says to me that it’s perfect for Thanksgiving.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2011/11/01/science/31recipehealth/31recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, gluten-free, kosher, nut-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 121, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "4 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "363 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 good-size butternut squash, about 3 pounds", "1 1/2 pounds sweet potatoes (or yams, the kind with the dark orange flesh)", "3 tablespoons mixed finely chopped orange and lemon zest", "1/4 to 1/2 teaspoon ground cinnamon (to taste)", "1 tablespoon extra virgin olive oil", "Salt and freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Cover a large baking sheet with foil and brush the foil with olive oil. Cut the squash in half lengthwise (see below) and scoop out the seeds and fibers. Lay on the baking sheet, cut side down. Pierce the sweet potatoes in several places with the tip of a paring knife and place them on the baking sheet. Place in the oven and bake 1 hour, or until the potatoes and squash are thoroughly tender when pierced with a knife. Turn the oven down to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 1 quart of water to a boil in a saucepan and add the zests. Boil for 3 minutes and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the squash and sweet potatoes are tender, remove the skins and mash the rest with a fork, potato masher or standing mixer fitted with the paddle, or put it through a food mill. (A food processor makes the mixture too watery, Ms. Kasper says.) Stir in the citrus zest, the cinnamon, olive oil, and salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the mixture into a heavy skillet or saucepan and cook, stirring, over medium heat, stirring, for 10 to 15 minutes, until it is thick and steamy. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1015466-pureed-roasted-squash-and-yams-with-citrus"}