{"@context": "http://schema.org", "@type": "Recipe", "name": "Mixed Grains Risotto With Kale, Walnuts and Black Quinoa", "description": "You may be surprised by the quantity of slivered kale that goes into this risotto. It will cook down as you stir and simmer the rice. Get into the habit of cooking and freezing grains ahead so you can make multigrain risottos like this without having to take the extra step of cooking the quinoa — though it only takes 15 to 20 minutes to cook this grain. Note that you might not use all of the stock; I just don’t like coming up short. Freeze what you don’t use.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/12/10/science/09recipehealth/09recipehealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner", "keywords": "fall, winter, gluten-free, healthy, high fiber, low cholesterol, low sugar, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 145}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 478, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "7 grams", "proteinContent": "20 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1140 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 generous bunch black or curly kale (about 3/4 pound)", "6 to 7 cups well seasoned chicken stock or vegetable stock", "2 tablespoons extra virgin olive oil", "1/2 cup minced onion", "Salt to taste", "2/3 cup Arborio rice", "1 to 2 garlic cloves (to taste), minced", "1/2 cup dry white wine, such as Pinot Grigio or Sauvignon Blanc", "3 cups cooked black quinoa", "1/2 cup chopped walnuts", "Freshly ground pepper to taste", "1/2 cup freshly grated Parmesan cheese (2 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stem the kale and wash in 2 rinses of water. Stack the leaves and cut crosswise in slivers. You will have 6 to 8 cups slivered kale, depending on the type you use (it will cook down). Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a simmer in a saucepan, with a ladle nearby or in the pot. Make sure that the stock is well seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy nonstick skillet or a wide, heavy saucepan. Add the onion and a generous pinch of salt, and cook gently until it is just tender, about 3 minutes. Do not brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the rice and the garlic and stir until the grains separate and begin to crackle. Add the wine and stir until it has evaporated and been absorbed by the rice. Begin adding the simmering stock, a couple of ladlefuls (about 1/2 cup) at a time. The stock should just cover the rice, and should be bubbling, not too slowly but not too quickly. Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock and continue to cook in this fashion, adding more stock and stirring when the rice is almost dry, for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the kale and continue to add stock by the ladleful and stir the rice for another 10 to 15 minutes, or until the rice is just tender all the way through but still chewy (al dente) and the kale is tender. Add freshly ground pepper, taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another ladleful of stock to the rice. Stir in the quinoa and walnuts and stir together for a minute, then add the Parmesan and remove from the heat. The mixture should be creamy (stir for a few more minutes if it is watery – or add more stock if it the mixture is dry). Serve right away in wide soup bowls or on plates."}]}