{"@context": "http://schema.org", "@type": "Recipe", "name": "Rustic Apple Streusel Pie", "description": "Be sure to slice the apples thin so that they cook in the amount of time needed to bake the crust — this isn’t a chunky filling.", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": null, "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "apple, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 126}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 342, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "7 grams", "proteinContent": "3 grams", "saturatedFatContent": "3 grams", "sodiumContent": "71 milligrams", "sugarContent": "42 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 recipe Tender Pie Dough (<a href=\"http://cooking.nytimes.com/recipes/1015674-tender-pie-dough\">see recipe</a>)", "4 pounds Granny Smith apples, peeled, cut into 1/4-inch-thick slices and trimmed", "2/3 cup superfine sugar", "3 tablespoons unbleached all-purpose flour, plus more for rolling out the dough", "2 teaspoons pure maple syrup, preferably Grade B", "2 teaspoons fresh lemon juice", "1/2 teaspoon ground cinnamon", "3/4 teaspoon pure vanilla extract", "1 large egg, well beaten with a hand blender", "1/3 cup plus 1 tablespoon unbleached all-purpose flour", "1 tablespoon superfine sugar", "1 tablespoon light brown sugar", "1/8 teaspoon ground cinnamon", "2 1/2 tablespoons unsalted butter, melted", "1/8 teaspoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Position a rack in the center of the oven and preheat to 350°F. Line a half-sheet pan with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, gently toss the apples, sugar, flour, maple syrup, lemon juice, cinnamon, and vanilla in a medium bowl until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the streusel. Combine the flour, superfine sugar, brown sugar, and cinnamon in a small bowl. Stir the melted butter and vanilla together in another small bowl. Gradually stir the butter mixture into the flour mixture, just until evenly moistened (you may not need all of the butter). Squeeze the mixture in your hands until thoroughly combined. Crumble the mixture in the bowl to make fine crumbs with some small lumps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly flour a work surface. Unwrap the dough and rap the entire circumference around its edge on the work surface. Dust the top of the dough with flour. Roll out into a 15-inch round. Transfer the dough to a 9-inch pie pan, centering it in the pan, and let the excess dough hang over the sides. Heap the apples in the crust, mounding them high in the center. Bring up the edges of the dough, pleating the dough as needed around the circumference of the dish — the center of the filling will be visible. Brush the exposed crust with the egg. Place the streusel over the exposed filling to cover it, then sprinkle any remaining streusel over the crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pie on the half-sheet pan. Bake, rotating the pan halfway through, until the crust is golden brown and any juices that escape are thick, about 1 hour. If the crust is browning too quickly, tent it with parchment paper. Remove from the oven and cool on a wire rack for 1 hour. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1015635-rustic-apple-streusel-pie"}