{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate-Pumpkin Bread Pudding", "description": "This warm pumpkin bread pudding from Chloe Coscarelli, the vegan chef and cookbook author, is generously-spiced and studded with semisweet chocolate chips. It’s a rich and creamy dessert that’s free of dairy and eggs but will leave everyone feeling as if they have indulged.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2010/11/01/health/01well_pudding/01well_pudding-articleLarge-v3.jpg", "totalTime": "PT1H", "recipeYield": "14 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "bread, pumpkin, semisweet chocolate chips, dairy-free, kosher, nut-free, vegan, vegetarian, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 168}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 190, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "5 grams", "sodiumContent": "213 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup coconut milk", "1 15-ounce can organic pumpkin", "1/2 cup brown sugar (can use maple syrup)", "1/2 teaspoon salt", "1 1/2 teaspoons cinnamon", "1 1/2 teaspoons nutmeg", "1/2 teaspoon ginger", "1/2 teaspoon cloves", "10 cups cubed day-old bread of your choice (about 10 to 12 slices of sandwich bread, depending on the thickness of slices)", "3/4 cup semisweet chocolate chips (Guittard and Ghirardelli are among those that are nondairy)", "2 tablespoons brown sugar", "Powdered sugar for dusting (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Grease 14 4-ounce ramekins (single-serving ceramic dishes) or a 9-by-13-by-2-inch baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender, process coconut milk, pumpkin, brown sugar, salt and spices until smooth. In a large bowl, toss the bread cubes with the pumpkin mixture and chocolate chips until each bread cube is coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using ramekins: Evenly sprinkle about 1/2 teaspoon brown sugar into the bottom of each greased ramekin. Fill each ramekin to the top with the mixture and lightly press it down with the back of a spoon. If using a 9-by-13 baking dish: Fill the baking dish with the mixture and lightly press it down with the back of a spoon. Evenly sprinkle about 2 tablespoons brown sugar over the top of the bread pudding. The brown sugar will help the pudding to caramelize on the edges. (Steps 1 through 3 can be done up to three days in advance; store covered in the refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 25 to 30 minutes, until top is lightly browned. If using ramekins: Let the pudding cool a few minutes, then carve around the edges with a knife to loosen and unmold. Garnish with powdered sugar if desired and serve warm. If using a 9-by-13 baking dish: Let the pudding cool a few minutes before serving. Cut into portions, then garnish with powdered sugar if desired and serve warm. The pudding can be baked right before serving or earlier that day and then reheated for 8 to 10 more minutes right before serving."}]}