{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Vegetable Tempura", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "2 servings", "recipeCuisine": "japanese", "recipeCategory": "dinner, lunch", "keywords": "vegan, vegetarian, vegetables", "aggregateRating": null, "recipeIngredient": ["For the dipping sauce:", "1/2 ounce dried kelp (kombu)", "1 dried shiitake mushroom", "1 tablespoon mirin (available in Asian markets and some supermarkets)", "1 tablespoon light-colored soy sauce", "1 tablespoon peeled, grated daikon", "1/2 teaspoon peeled grated ginger", "For the tempura:", "Vegetable oil, for frying", "1 cup sifted cake flour plus 2 tablespoons, plus 1/2 cup or as needed for dipping", "Four to five 1/3-inch thick slices zucchini, ends trimmed", "Four to five 1/3-inch thick slices slender Asian eggplant, ends trimmed", "Four to five 1/4-inch thick slices yam, peeled or unpeeled, ends trimmed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the dipping sauce: Combine kelp and shiitake mushroom in a small bowl. Add 1 cup cold water and allow to soak for 3 hours. Strain and set the clear, amber liquid aside; discard kelp and mushroom.  Pour mirin and light-colored soy sauce in a small pot over medium-high heat, and bring to a boil.  Add 1/2 cup of the soaking liquid from the kelp and mushroom.  Remove from heat, and set aside.  In a separate bowl, mix the daikon and ginger; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the tempura:  Pour oil into a large wok or pot so that the oil is two inches deep. Heat over medium-high heat until oil is 350 degrees. Set aside a baking sheet with a rack lined with paper towels, and a small long-handled fine-meshed strainer for removing excess fried batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 1 cup ice-cold water into a medium bowl. Add 1 cup plus 2 tablespoons cake flour, and whisk to blend lightly. Place about 1/2 cup cake flour into another bowl. Dip each slice of vegetable into dry flour, shake off excess, and then dip each slice of vegetable into the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry the vegetables in batches to be sure they are not crowded. Place 4 to 5 vegetable pieces in the oil and fry, turning once or twice, until golden and crisp, 2 to 2 1/2 minutes. Using the long-handled strainer, remove excess bits of fried batter to keep the oil clean. Transfer to the baking sheet to drain. Continue until all the vegetables are fried."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a paper napkin in the center of a platter, and arrange the vegetables on the platter. Pour off excess moisture from grated daikon and grated ginger. Place daikon and ginger mixture in the center of the dipping sauce, arranged as a little pointed mound. Serve tempura with dipping sauce."}], "link": "https://cooking.nytimes.com/recipes/1015695-vegan-vegetable-tempura"}