{"@context": "http://schema.org", "@type": "Recipe", "name": "Rugelach", "description": "These light and flaky pastries, popular among American and European Jews, are adapted from a recipe by Dorie Greenspan, the prolific cookbook author and winner of four James Beard Awards. The crescent shape and layers of filling might look complicated, but the dough is quite simple to put together (hello, food processor!) and easy to work with. Beyond that, it's really just a matter of rolling, spreading and cutting. These are meant to be bite-sized – about one-inch long – but if you want them bigger, go right ahead. (Should you choose to go larger, Dorie suggests rolling the dough into rectangles instead of circles and cutting the dough into bigger triangles. In that way, you would ultimately get more layers of filling and dough.)", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": "https://static01.nyt.com/images/2016/11/30/dining/30COOKING-RUGELACH1/30COOKING-RUGELACH1-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "36 cookies", "recipeCuisine": "", "recipeCategory": "", "keywords": "apricot jam, butter, cream cheese, flour, marmalade, raspberry jam, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 317}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 94, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "32 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 ounces cold cream cheese, cut into 4 pieces", "1 stick (8 tablespoons) cold unsalted butter, cut into 4 pieces", "1 cup all-purpose flour", "1/4 teaspoon salt", "2/3 cup raspberry jam, apricot jam or marmalade", "2 tablespoons sugar", "1/2 teaspoon ground cinnamon", "1/4 cup chopped nuts (I prefer pecans, but you can use walnuts or almonds)", "1/4 cup plump, moist dried currants", "4 ounces bittersweet chocolate, finely chopped, or 2/3 cup store-bought mini chocolate chips", "1 large egg", "1 teaspoon cold water", "2 tablespoons sugar, preferably decorating (coarse) sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dough: Let the cream cheese and butter rest on the counter for 10 minutes — you want them to be slightly softened but still cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the flour and salt in a food processor, scatter over the chunks of cream cheese and butter and pulse the machine 6 to 10 times. Then process, scraping down the sides of the bowl often, just until the dough forms large curds — don’t work it so long that it forms a ball on the blade."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out, gather it into a ball and divide it in half. Shape each half into a disk, wrap the disks in plastic wrap and refrigerate for at least 2 hours, or up to 1 day. (Wrapped airtight, the dough can be frozen for up to 2 months.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling: Heat the jam in a saucepan over low heat, or do this in a microwave, until it liquefies. Mix the sugar and cinnamon together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two baking sheets with parchment or silicone mats. (Silicone baking mats are great for rugelach.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To shape the cookies: Pull one packet of dough from the refrigerator. If it is too firm to roll easily, either leave it on the counter for about 10 minutes or give it a few bashes with your rolling pin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working on a lightly floured surface, roll the dough into a 11- to 12-inch circle. Spoon (or brush) a thin gloss of jam over the dough, and sprinkle over half of the cinnamon sugar. Scatter over half of the nuts, half of the currants and half of the chopped chocolate. Cover the filling with a piece of wax paper and gently press the filling into the dough, then remove the paper and save it for the next batch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a pizza wheel or a sharp knife, cut the dough into 16 wedges, or triangles. (The easiest way to do this is to cut the dough into quarters, then to cut each quarter into 4 triangles.) Starting at the base of each triangle, roll the dough up so that each cookie becomes a little crescent. Arrange the roll-ups on one baking sheet, making sure the points are tucked under the cookies, and refrigerate. Repeat with the second packet of dough, and refrigerate the cookies for at least 30 minutes before baking. (The cookies can be covered and refrigerated overnight or frozen for up to 2 months; don’t defrost before baking, just add a couple of extra minutes to the baking time.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Getting ready to bake: Position the racks to divide the oven into thirds and preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish: Stir the egg and water together, and brush a bit of this glaze over each rugelach. Sprinkle the cookies with sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cookies 20 to 25 minutes, rotating the sheets from top to bottom and front to back at the midway point, until they are puffed and golden. Transfer the cookies to racks to cool to just warm or to room temperature."}], "link": "https://cooking.nytimes.com/recipes/1015634-rugelach"}