{"@context": "http://schema.org", "@type": "Recipe", "name": "Good for Almost Everything Pie Dough", "description": "", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch", "keywords": "butter, pastry, pie crust, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 260, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "10 grams", "sodiumContent": "130 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 cups all-purpose flour", "2 tablespoons sugar", "3/4 teaspoon salt", "1 1/4 sticks (10 tablespoons) very cold (frozen is fine) unsalted butter, cut into 10 pieces", "2 1/2 tablespoons very cold (frozen is even better) vegetable shortening, cut into 2 pieces", "About 1/4 cup ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the flour, sugar and salt in a food processor fitted with a metal blade; pulse just to combine the ingredients. Drop in the butter and shortening and pulse only until the butter and shortening are cut into the flour. Don’t overdo the mixing— what you’re aiming for is to have some pieces the size of fat green peas and others the size of barley. Pulsing the machine on and off, gradually add about 3 tablespoons of the water— add a little water and pulse once, add some more water, pulse again and keep going that way. Then use a few long pulses to get the water into the flour. If, after a dozen or so pulses, the dough doesn’t look evenly moistened or form soft curds, pulse in as much of the remaining water as necessary. or even a few drops more, to get a dough that will stick together when pinched. Big pieces of butter are fine. Scrape the dough out of the work bowl and onto a work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gather the dough into a ball, flatten it into a disk, and wrap it in plastic. Refrigerate the dough for at least 1 hour before rolling. (If your ingredients were very cold and you worked quickly, though, you might be able to roll the dough immediately: the dough should be as cold as if it had just come out of the fridge.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To roll out the dough: Have a buttered pie plate at hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "You can roll the dough out on a floured surface or between sheets of wax paper or plastic wrap or in a rolling slipcover. (I usually roll this dough out on the floured counter.) If you are working on a counter, turn the dough over frequently and keep the counter floured. If you are rolling between paper, plastic or a in slipcover, make sure to turn the dough over often and to lift the paper, plastic or cover frequently so that it doesn’t roll into the dough and form creases."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’ve got time, slide the rolled-out dough into the fridge for about 20 minutes to rest and firm up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fit the dough into the pie plate and, using a pair of scissors, cut the excess dough to a 1/4- to 1/2-inch overhang. Fold the dough under on itself, so that it hangs over the edge just a tad, and flute or pinch the crust to make a decorative edge. Alternatively, you can finish the crust by pressing it with the tines of a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To partially or fully bake a single crust: Refrigerate the crust while you preheat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter the shiny side of a piece of aluminum foil, fit the foil, buttered side down, tightly against the crust and fill with dried beans or rice or pie weights. Put the pie plate on a baking sheet and bake the crust for 25 minutes. Carefully remove the foil and weights and, if the crust has puffed, press it down gently with the back of a spoon. For a partially baked crust, return the pie plate to the oven and bake for about 8 minutes more, or until the crust is very lightly colored. To fully bake the crust, bake until golden brown, about another 10 minutes. Transfer the pie plate to a cooling rack and cool to room temperature before filling."}], "link": "https://cooking.nytimes.com/recipes/1015570-good-for-almost-everything-pie-dough"}