{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Onion Tart", "description": "For four generations, the Vongerichten family has been turning out this tart, which is like a quiche but creamier. Chef Jean-Georges says, \"My grandmother taught me how to make the basic Pate Brisee pastry crust when I was young. The one thing I learned simply by eating her endless variations on delicious tarts for dinner every night is that this dough can be used for just about anything—sweet or savory.\"", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2011/10/12/health/Well_veggie_onion/Well_veggie_onion-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "kosher, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "recipeIngredient": ["1 large white onion, very thinly sliced", "4 tablespoons (1/2 stick) unsalted butter", "Kosher salt and freshly ground black pepper", "1/4 cup all-purpose flour", "3/4 cup whole milk, warmed", "1/3 cup heavy cream, warmed", "2 large eggs, lightly beaten", "Freshly grated nutmeg, to taste", "1/2 recipe Pate Brisee", "1 3/4 cups all-purpose flour, plus more as needed", "1/2 teaspoon kosher salt", "6 tablespoons (3/4 stick) unsalted butter, preferably cultured, cut up and chilled", "2 tablespoons plus 1 teaspoon vegetable shortening, chilled", "1 large egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "To prepare the crust", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixer fitted with the paddle attachment, mix the flour, salt, butter and shortening on low speed until crumbly. With the machine running, add 2 tablespoons cold water and the egg. Beat just until the dough comes together in large clumps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough in half and press each half into a 1-inch-thick round disk. Wrap each tightly in plastic and refrigerate until firm, at least 1 hour or up to 3 days; let stand at room temperature for 15 minutes before rolling. Alternatively, the dough can be frozen for up to 1 month; thaw in the refrigerator overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For each crust, on a lightly floured surface with a lightly floured rolling pin, roll 1 piece of dough into a 10-inch round. Carefully transfer the dough to an 8-inch round fluted tart pan with a removable bottom, pressing the dough gently against the bottom and up the sides. If necessary, trim the edges against the rim."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the dough with foil, then fill with dried beans or pie weights. Freeze overnight, or until very hard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To blind bake a tart shell, preheat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the frozen crust until the edges are set, about 20 minutes. Remove the foil and beans. Poke holes all over the bottom of the crust with a fork, then return to the oven. Bake until the bottom is set and the crust is blonde, about 8 minutes. Let cool in the pan on a rack."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To make the tart", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. In a large skillet, combine the onion, 2 tablespoons of the butter and a generous pinch of salt. Cover and cook, stirring occasionally, over medium-low heat until very tender and pale gold, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan, melt the remaining 2 tablespoons butter over medium-low heat. Add the flour and cook, whisking constantly, until the mixture smells nutty, about 2 minutes. Whisk in the milk and cream in a slow, steady stream. Still whisking, bring to a boil and cook for 2 minutes. Remove from the heat and let cool slightly, whisking occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in the eggs, a little at a time, until well incorporated and smooth. Stir in the onion, then season to taste with salt, pepper and nutmeg. Transfer the mixture to the tart shell, spreading it in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden brown and a knife inserted in the center comes out clean, about 1 hour. Let cool in the pan on a rack for 20 minutes. Unmold and serve warm."}]}]}