{"@context": "http://schema.org", "@type": "Recipe", "name": "Noodle Bowl With Broccoli and Smoked Trout", "description": "This is a filling but light meal in a bowl. The stock is based on one in Deborah Madison’s  “Vegetarian Cooking for Everyone.” I prefer to use nutty buckwheat noodles in this soup. For a vegetarian version, substitute tofu for the smoked trout. You can use firm or silken tofu; cut it into squares and add to the broth after you simmer the broccoli for 3 minutes.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/10/22/science/24recipehealth/24recipehealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 4", "recipeCuisine": "japanese", "recipeCategory": "dinner, lunch, quick", "keywords": "dairy-free, halal, healthy, high fiber, kosher, nut-free, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 356, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "7 grams", "proteinContent": "23 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1674 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 dried shiitake mushrooms or a small handful of dried porcinis or other dried mushrooms", "1 bunch scallions, sliced", "1 4- to 6-inch stick of kombu", "1 medium carrot, sliced thin", "A handful of mushroom stems, or a couple of dried shiitakes", "7 cups water", "Soy sauce to taste (2 to 3 tablespoons)", "1 to 2 tablespoons rice wine (mirin) (optional)", "Salt and sugar to taste", "6 ounces Japanese soba or udon noodles, cooked and tossed with 2 teaspoons sesame oil ", "3 broccoli crowns, cut or broken into small florets", "1/2 pound smoked trout fillets, cut into four 2-ounce pieces", "1 bunch scallions, thinly sliced, light and dark green parts kept separate", "2 teaspoons black sesame seeds for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all the ingredients for the stock except the salt and sugar in a saucepan and bring to a simmer. Cover and simmer 20 minutes. Strain. Season to taste with salt and a little sugar if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a simmer. If the noodles have been refrigerated, warm them by placing them in a strainer and dipping the strainer into the simmering broth. Then distribute the noodles among four deep soup bowls. Add the broccoli to the stock and simmer 3 minutes. Add the trout fillets and the white and light green parts of the scallions. Cover and turn off the heat. Allow to sit for 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a piece of trout on top of the noodles in each bowl. Ladle in the soup, taking care to distribute the broccoli and scallions evenly among the bowls. Sprinkle black sesame seeds and the dark green part of the scallions over each serving and serve."}], "link": "https://cooking.nytimes.com/recipes/1015249-noodle-bowl-with-broccoli-and-smoked-trout"}