{"@context": "http://schema.org", "@type": "Recipe", "name": "Butter and Buttermilk", "description": "This recipe is adapted from Anne Mendelson, the author of “Milk: The Surprising Story of Milk Through the Ages.” It’s a bit of a project. There’s a fair amount of stirring, processing, straining and separating. But the result is butter and buttermilk from your own kitchen, making this a fun recipe to make with children in advance of meals featuring their flavors.\n", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/16/dining/Butter-and-Buttermilk/Butter-and-Buttermilk-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Roughly 2 cups buttermilk and 1/2 pound (1 cup) butter", "recipeCuisine": "", "recipeCategory": "condiments, dips and spreads", "keywords": "milk", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 249, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": null, "proteinContent": "2 grams", "saturatedFatContent": "16 grams", "sodiumContent": "39 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["3 cups cream, light or heavy, but preferably a combination of the two (not ultrapasteurized -- and, if possible, not homogenized)", "1/4 cup cultured buttermilk, with live cultures (check the carton)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir together the cream and buttermilk in a bowl and let stand at room temperature to ripen until the mixture becomes thick and sour-smelling (16 to 24 hours). Cover tightly and refrigerate for several hours or overnight, until thoroughly chilled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in refrigerator a food processor fitted with the steel blade, 2 metal mixing bowls and a wire-mesh strainer in the refrigerator. Have ready 2 to 3 cups of ice water. (Cold is your friend here, warmth the enemy.) Set up the food processor and add half the cream (or all of it, if you have a machine with at least 11-cup capacity). Leave the rest in the refrigerator. Begin processing and watch closely as the cream thickens and whips. (It will take longer with homogenized and/or ultrapasteurized cream.) Soon after this stage, within a few minutes or even seconds, the cream will start to look less white. As soon as you see it breaking into something slightly granular, stop the machine and take a look. Cautiously proceed until the cream is quite definitely separated into cloudy whitish buttermilk and clumps of ivory or yellow butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the strainer over a chilled bowl and dump in the contents of the processor, scraping out any clinging butter particles with a rubber spatula. Put the strainer and bowl in the refrigerator while you repeat the processing with the rest of the cream. Add the second batch of butter to what you have in the strainer. Measure the strained buttermilk, pour it into a storage container and chill in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn out the butter into another bowl and add roughly as much ice water -- straining out the ice -- as you have buttermilk. Work the butter into a mass with a strong wooden spoon or spatula. Drain off as much liquid as you can and go on working the butter. You will see it becoming smoother and waxier under the spoon, as the butterfat comes together in a continuous mass. When no more liquid seems to be coming out, pat it dry with paper towels, pack it into a small container and promptly refrigerate it, tightly covered."}], "link": "https://cooking.nytimes.com/recipes/1015521-butter-and-buttermilk"}