{"@context": "http://schema.org", "@type": "Recipe", "name": "Fall Vegetable Cookpot: Braised Red and Green Cabbage", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 servings as a side dish", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "cabbage, main course, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 293, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "10 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1430 milligrams", "sugarContent": "20 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons white vinegar", "1 large head red cabbage, cored, 4 intact outer leaves set aside, remaining leaves finely julienned", "4 intact outer leaves of a Savoy cabbage", "4 tablespoons olive oil", "1 white onion, thinly sliced", "2 cups vegetable broth", "1 large Napa cabbage, cored, leaves finely julienned", "2 teaspoons reduced balsamic vinegar or Saba", "3 teaspoons crushed juniper berries", "Freshly ground black pepper", "Fleur de sel", "1 1/2 teaspoons whole juniper berries", "1 1/2 teaspoons whole black peppercorns", "1 1/2 teaspoons fleur de sel", "1 1/2 teaspoons fresh thyme leaves", "1 1/2 teaspoons finely chopped lime zest", "4 ounces peeled butternut squash, sliced 1/4 inch thick", "4 ounces peeled Honeycrisp or Gala apple, sliced 1/4 inch thick", "4 ounces peeled celery root, sliced 1/4 inch thick", "4 ounces peeled pear, sliced 1/4 inch thick", "1/2 cup plus 2 tablespoons vegetable broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the cabbage: Prepare two large bowls of ice water, and set aside. Bring two pots of heavily salted water, each with a tablespoon of white vinegar, to a boil. Add 4 outer leaves of red cabbage to one pot, and 4 outer leaves of Savoy cabbage to the other. Blanch until tender, about 2 minutes. Remove and plunge into the separate ice baths. Drain and set aside, keeping them separate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place two cast iron pans over low heat, add 2 tablespoons olive oil to each pan, and heat until shimmering. In one pan combine julienned red cabbage and half the onion, and sauté until the onion is translucent, 5 minutes. Add 1 cup of the vegetable broth, cover pan with plastic wrap. In the second pan, combine julienned Napa cabbage and remaining half onion, and sauté until onion is translucent, 5 minutes. Add remaining 1 cup vegetable broth, and cover pan with plastic wrap. Cook both pans of cabbage until cabbage is tender and the liquid has evaporated, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When red cabbage is tender, add reduced balsamic vinegar or Saba, 1 1/2 teaspoons crushed juniper berries, pepper and fleur de sel to taste; mix well. When Napa cabbage is tender, add 1 1/2 teaspoons crushed juniper berries, and pepper and fleur de sel to taste; mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For assembly: Preheat oven to 350 degrees. Place a blanched red cabbage leaf in the palm of your hand, and add a quarter of the braised red cabbage in the center. Form a snug ball with the whole leaf as a wrapper. Repeat to make 4 balls of red cabbage. Repeat with blanched Savoy cabbage, using julienned Napa cabbage as the filling, to make 4 balls of green cabbage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mortar, combine 1 1/2 teaspoons juniper berries, 1 1/2 teaspoons black peppercorns, 1 1/2 teaspoons fleur de sel, 1 1/2 teaspoons thyme, and 1 1/2 teaspoons lime zest. With a pestle, grind the mixture coarsely, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bottom of a large covered baking dish, arrange butternut squash, apple, celery root and pear so that they slightly overlap at the edges of the dish. Add the eight balls (alternating red and green), vegetable broth, and ground juniper berries and seasonings. Cook, covered, for 40 minutes. Serve hot."}]}