{"@context": "http://schema.org", "@type": "Recipe", "name": "Brisket Barley Soup with Crispy Kale", "description": "Making soup out of brisket has a major advantage over the usual braising: Because you are cooking the meat submerged in broth, it stays juicy. As it simmers, the brisket cubes soften enough so you can cut them with your spoon. The chewiest thing in the soup will be the barley, but in a good way. Some slabs of brisket comes more thoroughly trimmed than others, so you may have to do some knife work when you get it home. But fear not, if your broth ends up a little greasy, just chill it and then spoon the fat off the top when it’s cold.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/11/27/dining/27APPE/27APPE-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "brisket, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 739, "unsaturatedFatContent": "27 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "7 grams", "proteinContent": "39 grams", "saturatedFatContent": "19 grams", "sodiumContent": "838 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pounds brisket, fat trimmed, cut into 1-inch cubes", "1 1/2 tablespoons coarse kosher salt, more as needed", "1 1/2 teaspoons black pepper, more as needed", "3 tablespoons extra-virgin olive oil, more as needed", "3 leeks, thinly sliced", "2 celery stalks, diced", "2 garlic cloves, finely chopped", "3 thyme sprigs", "2 bay leaves", "2 carrots, peeled and cut into 1/2-inch chunks", "2 parsnips, peeled and cut into 1/2-inch chunks", "2 medium turnips or kohlrabi, peeled and cut into 1/2-inch cubes", "2/3 cup pearled barley", "2 teaspoons white wine vinegar, more as needed", "10 ounces Tuscan kale (1 large bunch or 2 small), ribs removed and leaves sliced 1-inch thick"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season brisket with 1 tablespoon salt and 1/2 teaspoon pepper. Let stand at room temperature for 30 minutes to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons oil in a large pot over medium-high heat. Add brisket in batches and cook, turning occasionally, until well-browned, 8 to 10 minutes per batch. Drizzle in additional oil if pan seems dry. Transfer browned meat to a paper towel-lined plate to drain. Add leek, celery and garlic to pan; cook until soft, about 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return meat to pot. Pour in 12 cups water, thyme, and bay leaves. Bring liquid to a simmer over medium heat. Cook, part covered, for 1 hour. Stir in carrots, parsnips, turnips, barley and remaining 1/2 tablespoon salt and 1 teaspoon pepper. Simmer until barley is cooked through and meat is tender, 45 minutes to 1 hour more. Stir in vinegar. Taste and adjust seasonings, if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving make the kale: heat oven to 450 degrees. Make sure kale is very dry, then toss kale with remaining 1 tablespoon oil and a pinch of salt. Spread it out on one or two baking sheets. It should fit in one layer without crowding. Roast until leaves are crisp in places (some spots will still be soft), 5 to 10 minutes. Serve kale on top of soup."}], "link": "https://cooking.nytimes.com/recipes/1015740-brisket-barley-soup-with-crispy-kale"}