{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Bean and Poblano Tacos", "description": "There are many kinds of tacos, some piled high and overstuffed and some more minimal, meant to be more a snack than a meal. These little tacos are in the second category, similar to what you might find in a Mexican market for a quick bite. Savory black beans and roasted poblano chiles make a satisfying vegetarian version. Fresh soft corn tortillas, hot off the griddle, are essential.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/10/02/dining/02KITCH2/02KITCH2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch", "keywords": "black beans, corn tortillas, poblano chili, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 152}, "recipeIngredient": ["1/2 pound black beans, rinsed and soaked 4 to 6 hours, or overnight if possible", "1 small onion, halved", "1 bay leaf", "1 large sprig epazote (optional)", "1 teaspoon salt", "4 poblano chiles", "Soft corn tortillas", "1/2 pound fresh mozzarella or Oaxacan-style string cheese, shredded", "1/2 pound queso fresco, available in Latino groceries", "8 ounces crème fraîche or Mexican crema"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain beans, put in medium pot, add water to cover and bring to a boil over hight heat. Add onion, bay leaf, epazote and salt and reduce heat to a gentle simmer. Cook for about 1 hour, longer if necessary, adding water occasionally if liquid falls below surface of beans. When beans are tender, taste and adjust salt. Keep beans warm in their broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, roast poblano chiles over a charcoal grill, under the broiler or directly on a gas stovetop burners until skins are completely blackened and blistered. Set chiles aside to cool, then split lengthwise. Scrape away skins and seeds with a paring knife. Cut cleaned chiles into 1/2-inch ribbons, transfer to small bowl and season lightly with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, warm the tortillas on a hot griddle or cast iron pan over a burner. Put 2 warm tortillas side by side on a small plate. With a slotted spoon, place 2 tablespoons beans on each tortilla. Top with a few shreds of mozzarella and 2 or 3 strips of poblano. Crumble a little queso fresco and drizzle about 1 teaspoon crème fraîche on each taco."}], "link": "https://cooking.nytimes.com/recipes/1015176-black-bean-and-poblano-tacos"}