{"@context": "http://schema.org", "@type": "Recipe", "name": "Rosemary Shortbread", "description": "This basic, buttery shortbread practically begs that you customize it to suit your own tastes or pantry supplies. The dough, which comes together quickly in a food processor, is already enhanced with rosemary, but nuts, seeds, citrus zest, spices, vanilla or minced dried fruit — or a combination of some of these — all make fine additions. Scale it up, scale it down. Add more salt, or use less. As long as you maintain the butter-flour ratio (one stick of butter for every cup of flour), you are free to play around. But the shortbread is delicious all on its own: tender, rich, crumbly, irresistible. ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/11/19/dining/19COOKING-SHORTBREAD2/19COOKING-SHORTBREAD2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "One 8- or 9-inch shortbread", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, rosemary", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 659}, "recipeIngredient": ["2 cups all-purpose flour", "2/3 cup granulated sugar", "1 tablespoon finely chopped fresh rosemary", "1 teaspoon plus 1 pinch kosher salt", "1 cup (2 sticks) unsalted cold butter, cut into 1-inch chunks", "1 to 2 teaspoons rosemary, chestnut or other dark, full-flavored honey (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. In a food processor, pulse together flour, sugar, rosemary and salt. Add butter, and honey if desired, and pulse to fine crumbs. Pulse a few more times until some crumbs start to come together, but don't overprocess. Dough should not be smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press dough into an ungreased 8- or 9-inch-square baking pan or 9-inch pie pan. Prick dough all over with a fork. Bake until golden brown, 35 to 40 minutes for 9-inch pan, 45 to 50 minutes for 8-inch. Transfer to a wire rack to cool. Cut into squares, bars or wedges while still warm."}], "link": "https://cooking.nytimes.com/recipes/1015820-rosemary-shortbread"}