{"@context": "http://schema.org", "@type": "Recipe", "name": "Veracruzana Chicken Stew with Winter Squash", "description": "This is loosely based on a chicken stew from the Mexican state of Veracruz. The cuisine of Veracruz, more than any of the other cuisines of Mexico, retains much Spanish influence, and this is a perfect example. There are not even any chilies in this stew, though I’ve added some cayenne for a little punch.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Veracruzana-Chicken-Stew/Veracruzana-Chicken-Stew--articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "4 to 6 servings.", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, gluten-free, healthy, high fiber, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 63}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 140, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "5 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "702 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 medium onion, peeled and quartered", "4 garlic cloves, unpeeled", "1 28-ounce can tomatoes in juice", "2 tablespoons extra virgin olive oil", "6 to 8 skinned chicken legs and/or thighs (can use boneless thighs)", "Salt and freshly ground pepper", "1 1/2 cups chicken stock", "10 medium green olives, pitted and finely chopped", "1 tablespoon capers, rinsed and finely chopped", "1/4 cup raisins (optional)", "1 sprig fresh rosemary", "1 teaspoon dried oregano, preferably Mexican", "1 2-inch cinnamon stick", "1 bay leaf", "1/4 teaspoon cayenne", "1 pound butternut squash, peeled and cut in small dice", "2 tablespoons dry sherry (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler. Line a small baking sheet or a pie tin with foil and place the onion and garlic on it. Place under the broiler, close to the heat. Broil for 2 minutes and check. As soon as the garlic skin is charred, remove the cloves and set aside. Turn the onion, using tongs, and continue to broil, turning often, until it is charred and softened, 5 to 10 minutes. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the garlic and transfer to a blender with the onion and tomatoes (do this in 2 batches if your blender is small). Blend until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil over medium-high heat in a deep lidded frying pan or a heavy casserole. Season the chicken with salt and pepper and brown for 5 minutes on each side, in batches if necessary. Transfer to a bowl. Pour off the fat from the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Keep the heat high and add the remaining olive oil. Add the blended tomato mixture to the pan all at once. It should sear and splutter. Cook, stirring, for a couple of minutes, until the mixture thickens noticeably, then add 1/2 cup of the stock and salt to taste. Turn the heat down to low and simmer, stirring from time to time, for 15 minutes. Stir in the remaining chicken broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the chicken pieces to the sauce, along with any liquid that has accumulated in the bowl. Add the olives, capers, raisins, rosemary, oregano, cinnamon stick, bay leaf, cayenne and squash and bring back to a simmer. Season to taste with salt and pepper, cover and simmer over low heat for 30 minutes, or until the chicken and squash are tender. Stir in the sherry, if desired, and continue to simmer for another 5 minutes. Taste and adjust seasoning. Serve with rice or other grains."}], "link": "https://cooking.nytimes.com/recipes/1015417-veracruzana-chicken-stew-with-winter-squash"}