{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork and Green Chile Tacos", "description": "The best taco consists of a warm corn tortilla with a spoonful or two of savory filling. That’s it! If you’re feeling extravagant, add a drizzle of salsa or crema, maybe a sprinkling of queso fresco, a slice or two of jalapeño. Here, the filling is pork simmered with tomatillos, green chiles and spices, an exquisite mixture even if it’s gone in three bites. (Make extra!)", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/10/02/dining/02KITCH1/02KITCH1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch", "keywords": "corn tortillas, green chili, pork shoulder, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 130}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 490, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "3 grams", "proteinContent": "31 grams", "saturatedFatContent": "11 grams", "sodiumContent": "795 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons olive oil or lard", "3 pounds pork shoulder, cut in 1/2-inch cubes ", "Salt and pepper", "2 cups diced onion", "4 garlic cloves, minced", "1 teaspoon cumin seeds, toasted until fragrant and coarsely ground", "1 teaspoon coriander seeds, toasted until fragrant and coarsely ground", "1 bay leaf", "1 cup diced tomato", "1/2 pound tomatillos, husk on, left whole", "3/4 cup chopped roasted hot green chile, like Anaheim (about 6 chiles)", "Soft corn tortillas", "1 large white sweet onion, finely diced, soaked for 30 minutes in cold water and drained", "Sliced fresh or pickled jalapeños (optional)", "Oregano, for sprinkling", "Cilantro sprigs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put olive oil in a wide deep skillet over medium-high heat. Add pork and season with salt and pepper. Stir-fry pork until lightly browned, about 5 minutes. Remove pork with slotted spoon, leaving fat in pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion to pan, season with salt and pepper and cook until softened and lightly browned, about 5 minutes. Add garlic, cumin, coriander, bay leaf and tomato. Return pork to skillet. Add tomatillos and green chile. Stir well. Add 4 cups water and bring mixture to a boil. Reduce heat to a brisk simmer and cook, uncovered, for 30 minutes or until meat is tender and sauce has thickened. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, warm the tortillas on a hot griddle or cast iron pan over a burner. Put 2 warm tortillas side by side on a small plate. Spoon 2 tablespoons pork mixture onto each taco. Garnish each taco with 1 teaspoon chopped onion, 2 to 3 jalapeño slices, a pinch of oregano and a few cilantro sprigs."}]}