{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Beet Greens, Tofu and Beets", "description": "I had lots of beet greens on hand during the week that I was testing all of these beet recipes, so I decided to combine them with julienned beets in a stir-fry. The greens should be crisp-tender.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/10/08/science/09recipehealth/09recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, quick", "keywords": "beet, beet greens, tofu, dairy-free, gluten-free, healthy, high fiber, kosher, nut-free, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 142}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 223, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "7 grams", "proteinContent": "14 grams", "saturatedFatContent": "2 grams", "sodiumContent": "641 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1/2 teaspoon sugar", "1/4 to 1/2 teaspoon salt (to taste)", "1 tablespoon soy sauce", "2 teaspoons dry sherry", "2 teaspoons sesame oil", "1 tablespoon grapeseed oil, sunflower oil or peanut oil", "6 ounces firm tofu, diced (1 cup)", "2 teaspoons minced garlic (2 large cloves)", "1 tablespoon minced fresh ginger", "2 large or 4 small beets (1/2 pound), peeled and cut in 2-inch julienne (about 2 heaped cups julienne)", "1 medium-size leek, white and light green parts only, cut in half lengthwise, cleaned and sliced thin", "1 pound beet greens, stemmed, washed well in 2 changes of water, and coarsely chopped (about 6 cups tightly packed; it’s fine if water remains on the leaves)", "2 teaspoons sesame seeds", "1/4 cup minced cilantro", "2 teaspoons cornstarch dissolved in 2 tablespoons water or stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the sugar and salt in 1 small container, the soy sauce, sherry and sesame oil in another, and place within arm’s reach of your wok. Have the other ingredients in separate containers within arm’s reach of your wok."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in the oil by adding it to the sides of the pan and swirling the pan, then add the tofu and spread out in a single layer. Don’t stir for 1 minute, then stir-fry for 1 to 2 minutes, until it begins to color. Add the garlic and ginger and stir-fry for no more than 10 seconds. Add the beets and stir-fry for 1 minute. Add the leek and stir-fry for 30 seconds to a minute, until it softens, then add the beet greens and salt and sugar. Stir-fry for 1 to 2 minutes, until the greens have wilted. Add the sesame seeds, soy sauce, sherry and sesame oil, and cilantro and stir-fry for 1 minute. Stir in the dissolved cornstarch and stir-fry until the liquid in the wok glazes the vegetables and tofu, less than a minute. Remove from the heat and serve with rice, noodles or other grains."}], "link": "https://cooking.nytimes.com/recipes/1015202-stir-fried-beet-greens-tofu-and-beets"}