{"@context": "http://schema.org", "@type": "Recipe", "name": "Banana Cake With Chocolate Chips and Walnuts", "description": "", "author": {"@type": "Person", "name": "David Latt"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, easy, lunch", "keywords": "banana, cake, chocolate chips, walnut, dessert, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 23}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 517, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "16 grams", "sodiumContent": "592 milligrams", "sugarContent": "38 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 ripe bananas", "1 1/2 tablespoons baking soda", "1/4 teaspoon vanilla", "2 eggs", "1 cup plus 1 tablespoon sweet butter, room temperature", "1 cup white sugar", "1/2 cup light brown sugar", "2/3 cup half and half", "2 1/2 cups flour", "Pinch of sea salt", "Pinch of cayenne", "1/2 cup raw walnuts", "1/2 cup semi-sweet chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1 tablespoon of butter and paint the inside of a 9 x 3 round cake pan, then put the pan in the freezer for 30 minutes. (The frozen butter prevents the batter from sticking to the pan.) On a cookie sheet bake the walnuts in a 350 degree oven for 20 minutes, turning every 5 minutes or so; let cool, roughly chop, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl mash the bananas with a fork, add the baking soda and vanilla. Stir well and set aside. In a mixer use the whisk to cream together the softened butter and both sugars. Add the eggs, mashed bananas, half and half and whisk until blended. Mix in the flour half a cup at a time, being careful not to over-beat. Remove the bowl from the mixer. Use a rubber spatula to blend in the walnuts and chocolate chips. Pour the batter into the buttered cake pan; it will only fill the pan half-way."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cake in a 350 oven for 60-70 minutes, turning the pan every 20 minutes so the cake cooks evenly. Test to see if the cake is done by inserting a wooden skewer. If the top is browning too quickly, lightly lay a sheet of aluminum foil over the top. When the skewer comes out clean, take the cake out of the oven and place it on a wire rack for 30 minutes. Remove the cake from the pan, putting it back on the wire rack to finish cooling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving dust the top with powdered sugar and shaved chocolate. Serve warm or at room temperature with vanilla ice cream or freshly whipped cream."}]}