{"@context": "http://schema.org", "@type": "Recipe", "name": "Dried Porcini Consommé", "description": "A refreshing and light soup that can be an appetizer or full first course. \nI could drink this refreshing consommé for lunch every day. It makes a very light and satisfying appetizer soup or first course.\n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/11/19/science/19recipehealth/19recipehealth-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Makes enough for 10 to 12 shots or 4 to 6 bowls.\n", "recipeCuisine": "french", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "appetizer, main course, dairy-free, halal, healthy, kosher, low calorie, low-carb, low cholesterol, low-fat, low sugar, nut-free, vegan, vegetarian, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 45}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 44, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "339 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 ounce dried porcini mushrooms (about 1 cup, approximately)", "2 cups boiling water", "1/4 pound fresh white mushrooms, cleaned\n", "1 quart chicken or vegetable stock\n", "2 large garlic cloves, sliced thin", "1 tablespoon soy sauce", "Salt and freshly ground pepper", "A few drops fresh lemon juice", "1 tablespoon chopped fresh chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dried porcinis in a bowl or a pyrex measuring cup and cover with 2 cups boiling water. Let sit for 30 minutes. Meanwhile, wipe the fresh mushrooms, trim away the bottoms if they are sandy, break off the stems and set them aside. Set aside half of the caps in a separate bowl and slice the rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a strainer with cheesecloth and set it over a bowl. Drain the porcinis through the cheesecloth-lined strainer. Squeeze over the strainer to extract as much flavorful liquid as possible and set aside the broth. Rinse the reconstituted mushrooms in several changes of water. Measure the mushroom soaking water and add enough water to make 4 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a soup pot or a large saucepan, combine the mushroom soaking liquid, the chicken or vegetable stock, the soaked porcinis, fresh mushroom stems and sliced caps, garlic, and salt to taste, and bring to a simmer. Cover and simmer over very low heat for 30 minutes. Strain the soup and return to the saucepan. Add salt and freshly ground pepper to taste, and the soy sauce. \n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the fresh mushroom caps you set aside paper-thin and toss with a couple of drops of lemon juice. Ladle the soup into bowls or espresso cups, garnish with a couple of slices of mushroom and a sprinkling of chives, and serve.\n"}], "link": "https://cooking.nytimes.com/recipes/1015709-dried-porcini-consomme"}