{"@context": "http://schema.org", "@type": "Recipe", "name": "Cauliflower Sformato", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT2H", "recipeYield": "Six four-ounce flans", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch", "keywords": "cauliflower, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 39}, "recipeIngredient": ["Salt", "Half a large head (about 12 ounces) cauliflower", "1 cup milk, plus 1/4 cup or as needed", "2 tablespoons butter", "2 tablespoons, plus 1 1/2 teaspoons flour", "2 large eggs, beaten", "1/4 cup Parmigiano-Reggiano, plus more for garnishing", "Freshly grated nutmeg", "Freshly ground black pepper", "Unflavored nonstick spray", "cracked or coarse black pepper, for garnish", "1/2 cup heavy cream", "4 ounces Gorgonzola dolce "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees F. Place a large pot of lightly salted water over high heat to bring to a boil. Cut the half head of cauliflower into quarters, removing the outer leaves and the tougher part of the stem. With a sharp knife, cut the florets into 1 inch pieces, and slice the center stalk thinly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve a packed 3/4 cup of the florets, and add remaining florets and sliced stems to the boiling water. Boil until tender, 5 to 10 minutes. Drain well and transfer to a blender. Blend, adding 1/4 cup milk, or as needed, to make a very thick, smooth, puree. Pour into a large bowl, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pot over medium-high heat, heat 1 cup of milk just until steaming. Season with salt to taste. Cover and turn off heat. In a second small pot over medium heat, melt 1 tablespoon of the butter, and whisk in flour. Cook until thickened, whisking constantly, about 3 minutes. Add hot milk and whisk constantly to make a thick béchamel, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the béchamel into the cauliflower puree. Add eggs, 1/4 cup Parmigiano-Reggiano, a pinch of nutmeg, and salt to taste. In a small sauté pan over medium-high, heat remaining 1 tablespoon butter, and add 3/4 cup cauliflower florets. Sauté until tender. Season with salt and pepper to taste, and fold florets into béchamel mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a kettle of water to a boil. Lightly coat the insides of six four-ounce ramekins with nonstick spray, and fill almost to the top with the flan mixture. Place in a baking dish and add boiling water until it reaches two-thirds up the sides of the ramekins. Cover tightly with a sheet of aluminum foil, and bake for 40 minutes. Uncover, and cook until the centers are firm yet still jiggle a little. Remove ramekins from the water and cool to room temperature. Cover and refrigerate overnight or up to three days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Bring a kettle of water to a boil. Meanwhile, allow ramekins to sit at room temperature until no longer chilled. Place in a baking dish and add boiling water until it reaches two-thirds up the sides of the ramekins. Cover tightly with foil, and bake until reheated, about 15 minutes. Meanwhile, prepare the fonduta sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pot over low heat, combine the heavy cream and Gorgonzola dolce. Stir until melted and smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, remove the sformato from the water bath. Run a knife around the inside of a ramekin, and place a small plate on top. Invert, and remove the ramekin. The sformato should unmold effortlessly. Repeat with remaining ramekins. Spoon fonduta sauce over each sformato, and sprinkle the top with a little black pepper and grated Parmigiano-Reggiano."}], "link": "https://cooking.nytimes.com/recipes/1015526-cauliflower-sformato"}