{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Pâte à Choux", "description": "A piping bag (an inexpensive investment, and it lasts forever) is the easiest way to form the dough into whatever shape you choose, but you can always use a plastic freezer bag with one corner snipped off, or two spoons. The imperfections that occur with a plastic bag or spoons can be repaired by dipping your finger into water and smoothing out the rough spots.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/01/12/magazine/12eat2/12eat2-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "2 to 4 dozen pastries, depending\n\non size", "recipeCuisine": "french", "recipeCategory": "breakfast, brunch, lunch", "keywords": "butter, flour, pastry, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 77}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 42, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "2 grams", "sodiumContent": "27 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 tablespoons unsalted butter, plus a little more for greasing the baking sheet", "Salt", "1 cup flour", "4 eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 and grease a baking sheet with butter. Put the butter and a  pinch of salt in a saucepan over high heat; add 1 cup water and bring to a boil. Turn the heat to low and add all the flour at once; stir constantly until the mixture pulls away from the pan and forms a ball, about 30 seconds. Remove the pan from the heat and beat in the eggs one at a time; use an electric mixer if you like, and  beat until the mixture is smooth. (At this point, you can cover the dough and refrigerate it for up to two days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re planning on piping out the dough, scoop it into a pastry bag with a  1/2-inch tip, or a plastic freezer bag with a corner cut off. Pipe the pastry onto the baking sheet, or just use two spoons to form your desired shape. Cream puffs should be circles about 1 inch wide and a little over 1 inch tall; éclairs should be 3-to-4-inch fingers, about 1 inch wide."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the pastries are golden brown, nicely puffed up and sound hollow when you tap on them, about 30 minutes for cream puffs and 40 minutes for éclairs. Use a skewer to prick one or two holes in each one to allow the steam to escape; transfer to a rack and let cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To fill the pastries using a pastry bag, poke a hole into the pastry and pipe \nthe filling into it, or cut off the top caps of each pastry, spoon in the filling,  and close it up like a sandwich. (Éclairs can be slit open and filled, too.) Serve as is, or drizzle with chocolate sauce."}], "link": "https://cooking.nytimes.com/recipes/1015880-baked-pate-a-choux"}