{"@context": "http://schema.org", "@type": "Recipe", "name": "Fennel, Kale and Rice Gratin", "description": "Two types of greens provide delicious contrast in this comforting yet light dish, which is perfect for a weeknight dinner or a festive side. It's a flexible recipe, lending itself to all sorts of adaptations. Make it once, and then make it your own.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/01/21/health/21recipehealth/21recipehealth-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, lunch", "keywords": "fall, winter, gluten-free, halal, healthy, high fiber, kosher, low sugar, nut-free, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 505}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 265, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "5 grams", "proteinContent": "12 grams", "saturatedFatContent": "5 grams", "sodiumContent": "603 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt to taste", "1 bunch black kale, stemmed and washed in 2 changes water", "3 tablespoons extra virgin olive oil", "1 medium onion, finely chopped", "1 1/2 pounds bulb fennel, trimmed, quartered, cored and chopped (about 4 cups chopped)", "Freshly ground pepper to taste", "2 large garlic cloves, minced", "1/4 cup chopped fresh dill", "3 eggs", "1/2 cup low-fat milk (2 percent)", "1 cup cooked rice, preferably short-grain", "3 ounces Gruyère cheese, grated (3/4 cup)", "1/4 cup breadcrumbs, or a mixture of breadcrumbs and freshly grated Parmesan (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a rolling boil, add a generous amount of salt and add kale. Blanch for 2 to 3 minutes, remove from the water with a deep fry skimmer or a slotted spoon and transfer to a bowl of cold water. Drain and, taking the greens up by the handful, squeeze hard to expel excess water. Chop medium-fine or cut in thin ribbons."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the oil over medium heat in a large, heavy skillet and add onion. Cook, stirring often, until tender, about 5 minutes, and add fennel. Cook, stirring often, until the fennel begins to soften. Add salt to taste and continue to cook, stirring often, until the fennel is very tender and fragrant, about 8 minutes. Add garlic and kale, stir together for another minute, then stir in dill. Season to taste with salt and pepper, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Oil a 2-quart gratin or baking dish. Beat eggs in a large bowl. Whisk in milk and salt to taste (I use about 1/2 teaspoon). Stir in fennel and kale mixture, rice and Gruyère, and combine well. Taste and adjust seasonings. Scrape into baking dish. Sprinkle breadcrumbs over the top if using, and drizzle on the remaining tablespoon of oil. Bake 35 to 40 minutes, until set and the top and sides are beginning to color. Remove from oven and allow to sit for at least 10 minutes before serving. This is good hot, warm, or room temperature."}]}