{"@context": "http://schema.org", "@type": "Recipe", "name": "Bacon-Onion Jam", "description": "Here is a shockingly good accompaniment to chicken-liver pâté that came to The Times from the kitchen of the Fort Defiance in Brooklyn. But don't think that is its only use. Bacon-onion jam is also a terrific sandwich condiment. Paired with crumbled blue cheese, it's a fantastic topping for a serious, grown-up pizza pie. And because the recipe makes a lot of jam, all three options are possible. One note: Take your time. The point is to cook the mixture until it has achieved full jamminess. The onions should really caramelize. Covered, it will keep in the refrigerator for a week or so.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/01/26/magazine/26eat/mag-26Eat-t_CA0-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dips and spreads", "keywords": "appetizer, bacon, jam, onion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 233}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 223, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "1 gram", "proteinContent": "6 grams", "saturatedFatContent": "6 grams", "sodiumContent": "287 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound slab bacon, diced into cubes", "4 medium-size white or Spanish onions, peeled and diced", "1 1/2 teaspoons mustard seed", "2 1/2 tablespoons dark brown sugar", "1/4 cup balsamic vinegar", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a Dutch oven or heavy pot over medium heat, and add the bacon. Cook, stirring occasionally, until the fat is completely rendered and the bacon has started to crisp, approximately 12 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain all but 1 tablespoon of the fat from the pot, and add the onions, mustard seed, brown sugar, vinegar and 3 tablespoons of water. Stir to combine, then cover the pot, lower the heat and allow the mixture to cook undisturbed for 15 or 20 minutes. Remove the top, stir again and then partly cover the pot. Allow the mixture to cook until most of the liquid is gone and the onions have achieved a dark brown jamminess, approximately 60 to 70 minutes. \n\n(Add a little more water as needed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the jam, and add salt and pepper if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove mixture from heat, and allow to cool slightly. Spoon the jam into a jar or bowl, then allow to cool completely. Store, covered, in the refrigerator for up to a week."}], "link": "https://cooking.nytimes.com/recipes/1015978-bacon-onion-jam"}