{"@context": "http://schema.org", "@type": "Recipe", "name": "Gluten-Free Pumpkin Dumplings With Radicchio", "description": "Silvana Nardone, the founding editor of the food magazine Every Day With Rachael Ray, developed this recipe for her gluten-intolerant son. It's incredibly easy. Just mix together a can of pumpkin purée, a couple eggs and a cup of gluten-free flour blend. Plop spoonfuls into a pot of boiling water, and in minutes – dumplings. Toss those with a quick sauté of onion, red pepper flakes and radicchio for a filling, healthy dinner. The dumplings are super light and pillowy, but if you prefer a firmer texture, add more gluten-free flour, 1 tablespoon at a time, to the pasta dough.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2010/11/01/health/01well_glutenb/01well_glutenb-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, gluten-free, kosher, nut-free, vegetarian, fall, gluten-free flour blend, pumpkin purée, radicchio, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 69}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 258, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "7 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "521 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 15-ounce can pure pumpkin puree", "2 large eggs, lightly beaten", "1 cup store-bought gluten-free flour blend", "Salt", "2 tablespoons extra-virgin olive oil", "1 medium onion, finely chopped", "1/4 teaspoon crushed red pepper flakes", "1 small head radicchio, sliced into 1/4-inch strips (about 2 cups)", "2 tablespoons chopped fresh flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. In a large bowl, combine the pumpkin puree, eggs, flour and 1 teaspoon salt to make the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan, heat the olive oil over medium heat. Add the onion and red pepper flakes and cook until softened, about five minutes; remove from the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water comes to a boil, use a teaspoon to scoop up the dough and form a dumpling, then carefully slide the dumpling off the spoon and into the boiling water. Continue forming dumplings until half the dough is used. Cook until the dumplings float, then simmer for about two minutes; remove with a slotted spoon and add to the saucepan with the onion. Repeat with the remaining dumpling dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the saucepan with the onion to medium-high heat. Toss in three-quarters of the radicchio and stir gently until just wilted, about two minutes; season with 1/2 teaspoon salt or to taste. To serve, divide the dumplings and sauce among four bowls and top with the remaining radicchio and parsley."}]}