{"@context": "http://schema.org", "@type": "Recipe", "name": "Miso-Glazed Sea Bass", "description": "Fish baked in miso is quintessentially Japanese, but I first learned about it years ago from the very American James Beard. Miso marries well with oily fish like salmon, mackerel or black cod, but mild firm-fleshed fish like sea bass or halibut also make fine candidates. Simply coat fish fillets or steaks with a mixture of miso, sake, mirin and a little ginger. An egg yolk may be added to help burnish and glaze the fish under the broiler. Serve with a pile of wilted greens dabbed with sesame oil.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/11/27/dining/27KITCH_SPAN/27KITCH_SPAN-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, quick", "keywords": "fish, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 235}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 268, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "37 grams", "saturatedFatContent": "2 grams", "sodiumContent": "730 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds sea bass, mackerel or cod, skin off, and cut into a dozen 2-ounce slices", "1 tablespoon white miso", "1 tablespoon red miso", "1 tablespoon sake", "1 tablespoon mirin", "2 teaspoons soy sauce", "2 teaspoons grated ginger", "1 tablespoon sugar", "2 egg yolks", "Salt", "1 pound tender mustard greens or spinach, stemmed and washed", "1 teaspoon toasted sesame oil", "Pickled ginger, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay fish slices in a shallow glass or earthenware baking dish. Put white and red miso, sake, mirin, soy sauce, ginger and sugar in a small bowl and stir well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dot half the miso mixture evenly over fish, then rub with fingers to lightly coat slices. Leave to marinate 10 to 15 minutes. Heat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat egg yolks into remaining miso mixture. With a spoon, smear tops of fish slices with this egg-enriched mixture. Bake on top shelf of oven for 6 to 8 minutes, until fish is firm, then place pan under broiler to glaze. Broil 1 to 2 minutes until topping begins to brown. With a spatula, transfer fish to serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring 4 cups well-salted water to a boil in a wide stainless steel skillet. Add mustard greens and cook until wilted, about 1 minute. Drain in colander, rinse briefly with cold water, then press out excess water with wooden spoon. Transfer to serving dish. Drizzle with sesame oil and garnish with thin slices of pickled ginger."}]}