{"@context": "http://schema.org", "@type": "Recipe", "name": "S’Mores Pie", "description": "This showstopper of a dessert is everything traditional s'mores are – chocolatey, gooey, crunchy – in grown-up, travel-friendly pie form. It is not difficult to make, but it does take some time, so set aside a few hours to make and assemble all of the worthy parts. Ultimately, what you end up with is a chocolate pudding pie in a graham cracker crust, topped with a blanket of homemade marshmallow that's browned to perfection.", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2016/06/13/dining/13COOKING_SMORESPIE1/13COOKING_SMORESPIE1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "brunch, dinner, lunch", "keywords": "butter, chocolate, graham cracker, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 250}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 515, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "21 grams", "sodiumContent": "141 milligrams", "sugarContent": "35 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 cups graham cracker crumbs (10-15 graham crackers)", "8 tablespoons melted butter", "7 ounces milk or dark chocolate, or a mixture of both, broken into chunks", "1 cup heavy cream", "1 egg", "Pinch of salt", "1 teaspoon unflavored gelatin", "1/2 cup cold water, divided", "3/4 cup sugar", "1/4 cup light corn syrup", "1/2 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust. Crumble graham crackers into the work bowl of a food processor and process until finely ground. Alternatively, you can put them in a bag and whack them with a rolling pin until finely crushed. Pour melted butter into crumbs and mix (hands are best for this) until the butter is fully incorporated and the texture is that of wet sand. Butter or oil a 9-inch pie pan and firmly press the graham cracker crumbs against the sides, then against the bottom of the pan (the underside of a measuring cup works well for smoothing the bottom crust). Chill for at least 30 minutes to avoid crumbling when serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the crust chills, preheat the oven to 350 degrees and prepare the chocolate filling. Put the chocolate in a large mixing bowl. Heat the cream in a saucepan until scalded — do not boil. Pour the cream over the chocolate and allow to stand for 1 minute. Whisk the cream and chocolate together until glossy and smooth. Add a pinch of salt, then crack the egg into the chocolate mixture and whisk to fully incorporate. Pour into chilled crust and bake for 25 minutes, or until the filling is set but still slightly wobbly in the center. Remove from the oven and cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the marshmallow topping. Pour 1/4 cup water into the bowl of a stand mixer and sprinkle the gelatin on top. In a large saucepan over medium-high heat, stir together the remaining 1/4 cup of water, sugar and corn syrup just until sugar is dissolved. Heat until a candy thermometer reads 260 degrees, or hard-ball stage. Remove from heat, turn stand mixer to medium speed to begin beating the bloomed gelatin, and slowly pour in sugar syrup, aiming it down the side of the bowl to prevent splatter, and scraping any remaining syrup from the pan with a heat-proof spatula. Slowly increase the speed of the mixer, and beat until the mixture is white, fluffy and doubled in volume. Add vanilla and beat for a few moments more. Pour the mixture on top of the cooled chocolate layer, gently spreading it to the edges of the crust with a spatula. Refrigerate, uncovered, 30 to 60 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The last step: brûlée the marshmallow. A torch is best for this (a propane torch from the hardware store or a butane crème brûlée torch). If using a torch, clear the area of any flammable items, ignite the torch, and slowly wave the flame over the surface of the marshmallow until you achieve the desired level of toastiness. If you do not have a torch, use the broiler of your oven. Preheat the broiler, cover the edges of the pie crust with foil or pie shields, place the pie on a baking sheet and broil — watching carefully to prevent burning — for 2 to 3 minutes, rotating as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To slice the pie, it helps to dip your knife in hot water, then dry it with a towel. The heat facilitates easy slicing through the marshmallow layer."}], "link": "https://cooking.nytimes.com/recipes/1015346-smores-pie"}