{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Big Tray Chicken", "description": "At Spicy Village in in Manhattan’s Chinatown, the Spicy Big Tray Chicken arrives on an aluminum tray. You eat it on a foam plate with a plastic fork or chopsticks. It’s a mound of chicken nearly afloat in a bath of dark, spicy sauce that contains star anise, Sichuan peppercorns, chile, garlic, cilantro, a few mystery ingredients and potatoes.  Those of you who live in or visit New York should eat this dish whenever you can, but it can absolutely be prepared at home. It’s not precisely a simple recipe. But it’s an excellent project one. And you can improve on the ingredients. At Spicy Village, both MSG and Budweiser are ingredients. We managed to make do without the MSG and used Negra Modelo beer.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2013/11/17/magazine/17eat/mag-17Eat-t_CA0-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "at least 4 servings", "recipeCuisine": "chinese", "recipeCategory": "brunch, dinner, lunch, project", "keywords": "beer, chicken legs, chicken thighs, sichuan peppercorns, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 404}, "recipeIngredient": ["3 pounds bone-in, skin-on chicken \nthighs and legs", "2 teaspoons salt, plus more to taste", "2 teaspoons, plus 1 tablespoon black \npepper, plus more to taste", "1 12-ounce beer", "1 pound new potatoes", "1 to 2 quarts vegetable oil", "2 tablespoons sliced garlic", "2 teaspoons cumin seeds", "2 teaspoons fennel seeds", "1 teaspoon Sichuan peppercorns, roughly chopped", "1 star anise, left whole", "2 dried chiles, minced", "1 1/2 tablespoons Sichuan hot bean sauce", "2 tablespoons dark rice wine (preferably Fujian Cooking Wine)", "3 to 4 cups chicken stock or water", "2 tablespoons sugar", "1/4 cup soy sauce", "Cilantro, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "With a cleaver, chop the chicken into 2-inch pieces, and toss with 2 teaspoons salt and 2 teaspoons black pepper. (Use chicken scraps to make stock if you can.) Cover with the beer and marinate it in the refrigerator overnight or for at least  a few hours. Cook the potatoes in salted water until nearly done; drain; cut into bite-size pieces if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat at least 2 inches of the oil in a wok or tall, narrow pot over high heat. \nThe more oil you use, the more chicken you can cook at one time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oil is hot, fry the chicken, in batches if necessary, until slightly brown; depending on your heat, this could take 1 to 5 minutes. Stir frequently. Remove with a spider or slotted spoon and let rest until cool, then fry again — up to 5 minutes depending on your heat — until nicely browned and crisp; remove. If you have the time, refrigerate the chicken before proceeding."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the oil to about 2 tablespoons (reserve the rest for frying or other \nuses), and turn the heat to high. Add the garlic, and cook a few seconds, then \nadd another tablespoon of oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cumin seeds, fennel seeds, Sichuan peppercorns, anise and dried chiles, and stir to combine. Add the hot bean sauce, and stir; return \nthe chicken to the wok or skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the dark rice wine and 2 cups stock or water, and stir to create a  sauce. Add 1 tablespoon black pepper, the sugar and soy sauce; bring to a \nvigorous boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the potatoes, and continue to boil for another 10 to 15 minutes, adding \nmore liquid as needed to keep the mixture soupy; you want to wind up with 1 to \n2 cups sauce and tender potatoes. Taste, and adjust seasoning; add more black pepper if the taste isn’t strong."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the chicken, potatoes and broth into bowls. Garnish with cilantro and serve with noodles or rice."}], "link": "https://cooking.nytimes.com/recipes/1015473-spicy-big-tray-chicken"}