{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Rillettes", "description": "Rillettes, the French version of pulled pork turned into a rich spread, demands the same piercing acidity and almost chalky mineral notes to cut like a laser through the fattiness. Though rillettes are often served with Chablis or Sancerre, bubbles make the combination even better. Pork is the easiest, though duck and rabbit are delicious, too. Just remember that you need more-or-less equal parts fat and lean.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT5H", "recipeYield": "About 2 cups, or 8 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, pork", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 456, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "0 grams", "proteinContent": "15 grams", "saturatedFatContent": "15 grams", "sodiumContent": "336 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 pound pork belly, best available, skin discarded", "1 pound boneless pork shoulder, best available, skin discarded", "1/2 teaspoon mustard seeds", "1/2 teaspoon ground black pepper", "2 teaspoons salt, or more, preferably sea salt", "6 cloves garlic, crushed", "3 bay leaves", "1 cup dry white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely dice pork and place in a heavy 4-quart pot. Add mustard seeds, pepper, salt, garlic and two of the bay leaves. Mix well. Add wine. Bring to a boil, reduce to a very slow simmer and cook, skimming any foam, for 30 minutes. Add 1 cup water, return to a very slow simmer, cover and cook for 2 1/2 hours, stirring once or twice during this time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover and increase heat to medium. Cook 20 to 30 minutes more until any liquid is pure fat, not water. You can tell if you look at a spoonful of the liquid and there are no little water bubbles. Taste the fat and adjust the seasonings if needed; do not under-season because the rillettes will be served fairly cold. Set aside to cool 1 hour. Remove bay leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mash and shred the mixture, using your fingers, 2 forks, or (what I think works really well) a pastry cutter. Transfer to a crock or glass jar with a lid that clamps tight, pressing down so there are no air bubbles. Top with the remaining bay leaf, cover and refrigerate until thoroughly chilled, at least 4 hours or overnight. Remove from refrigerator 30 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1015775-pork-rillettes"}