{"@context": "http://schema.org", "@type": "Recipe", "name": "Endive and Radicchio Salad With Caramelized Pear", "description": "This recipe came to The Times from Bruno Davaillon, the executive chef of the celebrated Rosewood Mansion on Turtle Creek restaurant in Dallas. It is an elegant twist on the ubiquitous blue cheese-pear salad combination. Grilling the radicchio removes the bitterness from the leafy green, helping it to better complement the pears and endive.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2010/11/19/science/18welldallas/18welldallas-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "endive, pear, radicchio, fall, kosher, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "recipeIngredient": ["3 Comice pears", "Olive oil, for drizzle", "Honey, for drizzle", "1 tablespoon allspice", "Butter, one pat", "3 ounces Roquefort style blue cheese", "5 ounces butter, softened", "1 teaspoon Worcestershire sauce", "Salt", "Pepper", "3 tablespoons flour", "2 eggs, beaten", "3 tablespoons Panko style bread crumbs", "Cooking oil for deep frying (such as olive or peanut oil)", "2 ounces walnuts, chopped", "1 shallot, minced", "2 tablespoons walnut oil", "Salt", "", "Pepper", "3 endives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the pears, cut them in half and trim to remove the seeds. Reserve one uncooked pear to finish the salad, and roast the remaining two. Preheat oven to 400 degrees Fahrenheit. Place the two pears cut side down on a baking sheet lined with parchment paper. Drizzle pears with olive oil, honey and allspice and top with a small pat of butter. Cover with aluminum foil and bake for 20 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the blue cheese fritters. Combine cheese and butter in a mixing bowl until soft and fully incorporated. Add Worcestershire sauce and salt and pepper to taste. Form into small balls and refrigerate for 15 minutes, or until firm. Once firm, roll the balls between your palms to obtain a perfectly round shape. Dredge balls in flour, then beaten egg, then bread crumbs. The uncooked fritters can be reserved in the refrigerator until ready to fry. To fry, heat enough oil to cover the fritters in a fryer to 375 degrees. Add fritters to the pan and fry until golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the walnut dressing. Toast walnuts in sauté pan for five minutes. Allow to cool, then chop. In a separate bowl, combine honey and ice wine vinegar and mix well. Add minced shallot and walnut oil. Mix with chopped walnuts and salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salad. Cut radicchio in half and drizzle with olive oil and season with salt and pepper. Cook on hot grill for a couple of minutes on each side. Slice washed and dried endive into long strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the salad, lay roasted radicchio on large plate. Season endive with walnut dressing and arrange around the radicchio. Top with roasted pear and freshly fried fritters. Finish with raw pear shavings."}]}