{"@context": "http://schema.org", "@type": "Recipe", "name": "Coconut Butternut Squash Soup", "description": "Once you’ve got the squash baked, this soup comes together quickly. The mellow flavors of squash, kale and red onions synergize delectably and look gorgeous together as well.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2017/08/25/dining/25COOKING-BUTTERNUT-SOUP2/25COOKING-BUTTERNUT-SOUP2-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, gluten-free, kosher, nut-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1716}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 154, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "3 grams", "sodiumContent": "701 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["1 large butternut squash (about 1 1/2 pounds)", "2 tablespoons olive oil or other vegetable oil", "1 large yellow or sweet white onion, chopped", "1 medium apple, any variety, peeled and diced", "2 cups prepared vegetable broth, or 2 cups water with 1 vegetable bouillon cube", "2 teaspoons good-quality curry powder", "2 teaspoons grated fresh or jarred ginger, or more, to taste", "Pinch of ground nutmeg or allspice", "1 14-ounce can light coconut milk", "Salt and freshly ground pepper to taste", "2 medium red onions, quartered and thinly sliced", "1 good-size bunch kale (about 10 to 12 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To bake the squash, preheat oven to 375 degrees. Cut in half and place halves, cut side up, in a foil-lined, shallow baking dish and cover tightly with more foil. Bake for 30 to 50 minutes, until you can easily pierce the flesh with a knife. Scoop out and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat about half the oil in a soup pot. Add the onion and sauté over medium-low heat until golden, about 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the apple, squash, broth and spices. Bring to a steady simmer, then cover and simmer gently until the apples are tender, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the solids to a food processor with a slotted spoon, in batches if need be, and process until smoothly pureed, then transfer back to the soup pot. Or better yet, simply insert an immersion blender into the pot and process until smoothly pureed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the coconut milk and return the soup to a gentle simmer. Cook over low heat for 5 to 10 minutes, until well heated through. Season with salt and pepper. If time allows, let the soup stand off the heat for an hour or two, then heat through as needed before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, heat the remaining oil in a large skillet. Add the red onions and sauté over low heat until golden and soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, strip the kale leaves off the stems and cut into thin shreds. Stir together with the onions in the skillet, adding just enough water to moisten the surface. Cover and cook over medium heat, stirring occasionally, until the kale is bright green and just tender, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle soup into each bowl, then place a small mound of kale and onion mixture in the center."}], "link": "https://cooking.nytimes.com/recipes/1015484-coconut-butternut-squash-soup"}