{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Chops Fried in Parmesan Batter", "description": "This dish comes from the celebrated Italian cook Marcella Hazan. She showed me how to pound lamb chops for her splendid dish, and teased me for not doing it thoroughly enough.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2013/11/10/magazine/10eat3/10eat3-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "easy, quick", "keywords": "bread crumbs, butter, lamb chops, parmesan, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 58}, "recipeIngredient": ["12 single-rib lamb chops, partly boned and flattened as described below*", "1/2 cup freshly grated Parmesan, spread on a plate", "2 eggs, beaten lightly in a deep dish", "1 cup fine dry unflavored bread crumbs, spread on a plate", "Vegetable oil", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the chops on both sides in the grated Parmesan, pressing the chop firmly against the crumbs, using the palm of your hands to make the cheese adhere to the meat. Tap the chops gently against the plate to shake off excess cheese. Dip them into the beaten egg, letting the excess flow back into the dish. Turn  the chops in the bread crumbs, coating both sides, and tap them again to shake off excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour enough oil in a skillet to come 1/4 inch up the sides, and turn on the heat to medium. When the oil is very hot, slip as many chops into the pan as will fit without crowding. When one side forms a nice golden crust, sprinkle it with salt and pepper, turn the chop and sprinkle salt and pepper on the other side. As soon as the second side has formed a crust, transfer to a warm platter, using a slotted spoon or spatula. Repeat the procedure, slipping more chops into the pan as soon as there is room for them. When all the \nchops are done, serve promptly."}], "link": "https://cooking.nytimes.com/recipes/1015376-lamb-chops-fried-in-parmesan-batter"}