{"@context": "http://schema.org", "@type": "Recipe", "name": "David Firestone's Latkes", "description": "Back in 1992 the food writer Molly O’Neill playfully named David Firestone “the Latke King” in her “New York Cookbook,” and included a recipe he had modified from his mother’s and grandmother’s. Mr. Firestone, who was for many years an editor at The Times, now uses a food processor to make big batches, sometimes just for the family, sometimes for 60 friends or more. As for the olive oil, it may be the liquid symbol of Hanukkah, but in his house it’s imported from Italy.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2013/11/06/dining/06MASHUP_SPAN/06MASHUP-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 16 latkes", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "appetizer, side dish, potato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 91}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 369, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "5 grams", "sodiumContent": "158 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 large yellow onion, quartered", "2 1/2 pounds Idaho baking potatoes, unpeeled", "2 eggs, lightly beaten", "1/4 cup matzo meal", "4 to 5 teaspoons chopped fresh parsley", "1 teaspoon salt", "1/4 teaspoon ground black pepper", "2 to 3 cups olive oil", "Portuguese pumpkin preserves, for serving (<a href=\"http://cooking.nytimes.com/recipes/1015339-portuguese-pumpkin-preserves\" target=\"_blank\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the onion in a food processor. Pulse the blade a few times until the onion is diced into crunchy bits. Remove blade and scrape the bits into a small bowl. Return the food processor bowl to the machine. No need to wash it yet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrub the potatoes with a brush, and cut lengthwise to fit into the processor feed tube. Put the medium-coarse shredding disk into the processor and turn it on. Begin feeding in the potato slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When potatoes are shredded, place in a colander over a large bowl. Dump in the onion bits and mix everything around with your hands, squeezing out the potato moisture as you work."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the potato liquid out of the bowl, but leave the starch that clings to the bowl. Dump in the shredded potato and onion mix. Add the eggs, matzo meal, parsley, salt and pepper. Stir the mixture briskly, then let sit for about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large cast-iron skillet, pour 1/4 inch of olive oil. Over high heat, get the oil very hot. Using a 1/4-cup measure or a long-handled serving spoon, start spooning the batter into the skillet. Flatten each with a metal spatula to a diameter of 4 to 5 inches. Do not try to make the latkes uniformly round. Reduce heat to medium and cook latkes until golden brown on one side, about 5 minutes. Turn them over and fry some more, another 5 minutes or so. When crispy on the outside and moist inside, remove latkes and place on several thicknesses of paper towels. Repeat until you run out of batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve latkes immediately, with pumpkin preserves."}], "link": "https://cooking.nytimes.com/recipes/1015336-david-firestones-latkes"}