{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetable Risotto", "description": "Dried mushrooms are reconstituted in hot water. Lettuce and fennel are sweated down in some hot butter in a big, heavy-bottomed pot, then set aside. Onion takes their place, followed by short-grained arborio rice, followed by hot water. Then the cook stirs and stirs, performing the old dance of risotto. (I tried the dish using the stock left by the mushrooms but found it too muddy and dank.) The mushrooms, diced small, go into the pot along with some more water and stirring. Then, at the end, the lettuce and fennel, some Parmesan, a heavy dusting of nutmeg and whatever butter is left. The result is remarkable, particularly in the matter of the lettuce, a mineral thread of flavor above the soft forest floor of the rice.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2013/11/24/magazine/24eat/24eat-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "arborio rice, fennel, lettuce, mushroom, risotto, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 82}, "recipeIngredient": ["1/2 ounce dried mushrooms", "6 tablespoons unsalted butter", "5 green leaf lettuce leaves, shredded", "1 leaf of a fennel bulb, finely diced", "1 small onion, finely diced", "1 cup arborio rice", "2 tablespoons grated Parmesan", "Kosher salt", "Nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the mushrooms in a bowl, and pour hot water over them. Allow them to steep for 20 minutes, then squeeze them out and mince. Reserve the mushroom broth for another purpose."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put four cups of water in a pot, and set it over high heat to boil. Keep it hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy saucepan set over medium heat, melt 5 tablespoons butter and when it foams, cook the lettuce and fennel until soft. Lift them out of the pan and set aside. Add another tablespoon of butter if necessary, and cook the onion until translucent. Add the rice, and stir until it is glistening and hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a cup of the hot water to the mixture, and stir it until the liquid is absorbed, approximately 5 minutes. Add another cup of the water, and stir again until it is absorbed. Add the mushrooms, and stir again, then add a pinch of salt and another half cup of the hot water. When the liquid has been absorbed, taste the rice to see if the grains offer the slightest resistance to your teeth. If not, add the rest of the water, and stir again to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the lettuce, the fennel, the Parmesan and any remaining butter, then grate nutmeg generously over the mixture."}]}