{"@context": "http://schema.org", "@type": "Recipe", "name": "Watermelon and Pancetta Risotto", "description": "The important thing for this dish is to have good, sweet, ripe watermelon that is firm enough to retain its shape once cubed, as well as good-quality pancetta, cut thick enough so that you can cube it to match the shape of the melon. Don’t use prepackaged pancetta or have it sliced into paper-thin wisps. Also important is to use good chicken stock. The best, obviously, is to make it yourself. But if that’s not available, good, organic, low-sodium stock will work, too.", "author": {"@type": "Person", "name": "Eric Asimov"}, "image": "https://static01.nyt.com/images/2014/04/28/dining/watermelon/watermelon-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 main-course portions", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "arborio rice, pancetta, watermelon, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1154, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "117 grams", "cholesterolContent": null, "fatContent": "57 grams", "fiberContent": "5 grams", "proteinContent": "33 grams", "saturatedFatContent": "25 grams", "sodiumContent": "1796 milligrams", "sugarContent": "15 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["6 cups chicken stock", "10 to 12 ounces pancetta, cubed", "6 tablespoons butter", "1/2 medium-sized onion, diced", "16 ounces arborio rice", "3/4 cup dry white wine", "Salt and pepper", "1/2 cup grated Parmigiano-Reggiano", "3 cups cubed watermelon or to taste", "1/2 cup chopped mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, bring the stock to a boil, then switch off heat. Stock will stay warm until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the pancetta over low-to-medium heat, stirring, until browned, 10 to 15 minutes. Reserve with fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat four tablespoons of the butter in a large heavy-bottomed pot. Add the onions, and over medium-heat sauté until softened but not browned. Add the rice, and sauté, stirring, until the rice is coated with the oil and becomes translucent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in enough wine to cover rice and cook, stirring, until the wine reduces by about two-thirds, about 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the wine is absorbed, add stock, beginning with one cup or enough to cover rice. Stir the simmering broth, more or less constantly as the stock is absorbed. Pausing briefly is fine as long as the rice on the bottom does not begin to burn. When the top layer of rice is exposed, add more broth. I usually add by the cup, although others prefer more frequent additions of smaller amounts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the second addition of broth, season the rice with salt and pepper, so that it can be absorbed throughout the cooking. Taste periodically and add salt if necessary. After about 20 minutes or so, most of the broth will most likely be gone. With the last addition, add cheese and the remaining butter. The rice should be turning creamy but the individual kernels should retain their integrity and be firm in the center. Taste to be sure."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the pancetta with its fat, the watermelon and the mint. Remove from heat, blend it well, and allow it to sit for a couple of minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1015700-watermelon-and-pancetta-risotto"}