{"@context": "http://schema.org", "@type": "Recipe", "name": "Orecchiette With Grated Squash, Walnuts and Ricotta Salata", "description": "I don’t know why it had never occurred to me to grate hard winter squash until I started envisioning this pasta. If you have a food processor with a grater blade, this will be the easiest way you’ve ever prepared winter squash, short of sticking it in the oven skin and all. The cooked grated squash lodges in the indentations of the ear-shaped orecchiette, a perfect pairing.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/11/23/science/23recipehealth/23recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "weekday, pastas", "keywords": "butternut squash, olive oil, orecchiette, walnut, kosher, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 82}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 421, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "69 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "6 grams", "proteinContent": "14 grams", "saturatedFatContent": "3 grams", "sodiumContent": "428 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 pound butternut squash (about half of a large squash)", "2 tablespoons extra virgin olive oil", "Salt to taste", "2 garlic cloves, minced", "2 ounces walnut pieces (about 1/2 cup), coarsely chopped", "3 tablespoons chopped fresh marjoram, or 2 tablespoons chopped fresh sage", "Lots of freshly ground pepper", "1 pound orecchiette", "2 ounces ricotta salata, grated (about 1/2 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large pot of water. When it comes to a boil, add a generous amount of salt and keep at a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, peel the squash (I use a vegetable peeler for this), cut it into chunks that will fit your food processor tube fitted with the grater blade, and grate. Alternately, grate with the large holes of a box grater."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium-high heat in a large, heavy skillet and add the grated squash and salt to taste. Cook, stirring often, for 8 to 10 minutes, until the squash has softened. Add the garlic, walnuts and half the marjoram or all of the sage and cook, stirring, for another minute. Turn the heat down to medium."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/2 cup of the water for the pasta and cook for another couple of minutes, until it has been absorbed and evaporated from the pan. Add another 1/2 cup water and continue to cook for another 3 minutes, or until the squash mixture is tender and moist. Taste, adjust salt, and add a generous amount of pepper. Keep warm while you cook the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the pot of water back to a rolling boil and add the orecchiette. Cook al dente, usually 10 to 11 minutes. Add 1/2 cup of the cooking water to the squash mixture before draining, then drain the pasta and toss with the squash, along with the remaining marjoram and the ricotta salata. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1015488-orecchiette-with-grated-squash-walnuts-and-ricotta-salata"}