{"@context": "http://schema.org", "@type": "Recipe", "name": "Old-Fashioned Chocolate Pudding Pie", "description": "This is your grandma’s puddin’ pie, only it’s vegan — a smooth, cool and creamy pudding in a classic graham cracker shell. To make life even easier, you can use a store-bought crust. For added grandma love, serve with vegan whipped cream and shaved chocolate. (This recipe is an adaptation of one found in “Vegan Pie in the Sky: 75 Out-of-This-World Recipes for Pies, Tarts, Cobblers and More” by Isa Chandra Moskowitz and Terry Hope Romero.)", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2011/10/11/health/Well_veggie_pudding/Well_veggie_pudding-articleLarge-v4.jpg", "totalTime": "PT4H15M", "recipeYield": "One 9-inch pie", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "dairy-free, kosher, nut-free, vegan, vegetarian, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 226}, "recipeIngredient": ["1 3/4 cups finely ground graham crackers (made from 10 ounces of whole graham crackers)", "3 tablespoons sugar", "4 tablespoons melted nonhydrogenated margarine, melted coconut oil or canola oil", "1 tablespoon plain soy milk or almond milk", "3 cups almond milk", "1/4 cup cornstarch", "1/3 cup sugar", "3 tablespoons unsweetened cocoa powder", "Big pinch of salt", "1/4 cup semisweet chocolate chips", "1 teaspoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees and lightly spray a 9-inch pie plate with nonstick cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, combine the graham crumbs and sugar. Drizzle in the oil or melted margarine. Use a spoon to blend the mixture thoroughly to moisten the crumbs, then drizzle in the soy milk and stir again to form a crumbly dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the crumbs into the pie plate. Press crumbs into the sides of the plate first, then work your way down to the bottom. Bake for 8 to 10 minutes until firm. Let the crust cool before filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small (2-quart) saucepan off the heat, combine 1 cup of the almond milk and the cornstarch. Use a fork to whisk until the cornstarch is good and dissolved. Whisk in the remaining almond milk, the sugar, cocoa powder and salt. It’s O.K. if the cocoa is a bit clumpy at first; it will dissolve eventually."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the mixture to a boil, whisking occasionally. Keep a close eye because once boiling, you want to lower the heat and bring it to a slow rolling boil. Whisk consistently until the mixture is thickened, which should be about 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chocolate chips and mix to melt. Stir in the vanilla extract. Pour the pudding into the prepared pie shell and let cool for about 15 minutes on the counter, just until it stops steaming like mad. To keep a skin from forming, place a circle of parchment paper over the filling. Refrigerate and let set for at least 3 hours."}], "link": "https://cooking.nytimes.com/recipes/1015406-old-fashioned-chocolate-pudding-pie"}