{"@context": "http://schema.org", "@type": "Recipe", "name": "Bibimbap With Chicken and Mushrooms", "description": "One chicken breast is stretched into a hearty meal here, with lots of rice or other grains and vegetables.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Bibimbap-With-Chicken-Broccoli-Rabe-Mushrooms-and-Turnip/Bibimbap-With-Chicken-Broccoli-Rabe-Mushrooms-and-Turnip-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings.", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, gluten-free, healthy, high fiber, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 32}, "recipeIngredient": ["8 ounces boneless skinless chicken breast, thinly sliced across the grain", "1 tablespoon soy sauce", "1 teaspoon brown sugar", "1 tablespoon sesame oil", "1 to 2 garlic cloves, to taste, minced or puréed", "1 tablespoon minced ginger", "2 scallions, finely chopped", "Freshly ground pepper to taste", "2 tablespoons rice vinegar", "1 tablespoon sesame oil", "2 large garlic cloves, minced or puréed", "2 to 3 scallions, minced", "1 tablespoon toasted sesame seeds", "Salt to taste", "Korean red pepper paste (kochujang) to taste (available at Korean markets)", "2 medium turnips, thinly sliced, then cut in matchsticks", "3/4 pound broccoli rabe, thick stems trimmed away", "6 fresh shiitake mushrooms, stemmed and sliced", "Soy sauce to taste", "1 tablespoon canola oil", "1 1/2 to 2 cups brown rice, barley, quinoa or another grain of your choice, cooked (keep hot)", "4 eggs (optional)", "Korean red pepper paste (kochujang) to taste (available at Korean markets)", "2 sheets nori seaweed (kimgui), lightly toasted* and cut into thin strips (optional)", "2 teaspoons toasted sesame seeds or black sesame seeds", "Toast nori sheets (if not toasted already) by quickly passing them over a gas flame (hold with tongs) until crisp."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Marinate the chicken. Mix together the soy sauce, sesame oil, garlic, ginger, scallions and pepper and toss with the sliced chicken. Refrigerate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the rice vinegar, sesame oil, garlic, scallions, sesame seeds, chili paste and salt to taste in a small bowl or measuring cup. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chicken is marinating, toss the prepared turnips with salt to taste and place in a colander in the sink for 15 to 30 minutes. Rinse and squeeze dry. Place in a bowl and toss with 2 teaspoons of the vinegar and sesame oil mixture. Add salt or soy sauce to taste. Set aside in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the broccoli rabe over an inch of boiling water until tender, about 5 minutes, or blanch for 3 to 4 minutes in salted boiling water. Transfer to a bowl of cold water, drain and squeeze out excess water.  Remove from the heat and toss in a bowl with 1 tablespoon of the vinegar and sesame oil mixture. Add salt or soy sauce to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wok or large, heavy skillet over medium-high heat until a drop of water evaporates immediately on contact. Add the canola oil. Stir-fry the chicken for 3 to 5 minutes, until it is lightly browned and displays no sign of pink, and remove to a plate. Do not overcook or the pieces will be dry. Add the shiitakes to the pan, let sit without stirring for 1 minute, then stir-fry for another minute or two, until tender. Remove to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry the eggs in the hot pan or in a separate nonstick skillet until the whites are set and the yolks are still runny. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 4 wide soup bowls. Place a mound of hot grains in the middle of each one and surround with the chicken and vegetables, as well as kimchi if desired, each ingredient in its own little pile. Place a fried egg and a small spoonful of chili paste on top of the rice and garnish with the toasted nori and sesame seeds. Serve at once. Diners should break the egg into the rice. Pass the chili paste and add more as desired."}], "link": "https://cooking.nytimes.com/recipes/1015429-bibimbap-with-chicken-and-mushrooms"}