{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Prosciutto and Whole Garlic", "description": "This pasta dish, known as maccheroni alla San Giovanniello in Italy, is amazing in the summer months, when there are good fresh tomatoes around. But you can make it any time of year with canned tomatoes. You could also make it with much less prosciutto, really just enough to season the oil — a quarter cup or so. No matter how much you use, start with a hunk of prosciutto so you can dice chunks; you don’t want little thin slices. If you've got great basil, you can even skip the cheese. If you use fresh tomatoes, you can blanch and peel the tomatoes if you don't like the skins, but it's not really necessary.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/04/27/dining/27COOKING-PASTA1/27COOKING-PASTA1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, quick, pastas", "keywords": "garlic, pasta, prosciutto, tomato, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 263}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 785, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "95 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "8 grams", "proteinContent": "32 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1156 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["1/3 cup olive oil or butter", "10 cloves garlic, lightly crushed", "1/2 cup prosciutto or other salted ham or slab bacon, cut into cubes or strips", "6 plum tomatoes, or 1 1/2 cups drained canned tomatoes", "Salt and ground black pepper to taste", "1 pound cut pasta, such as ziti or penne", "1 cup roughly chopped fresh basil leaves", "1 cup freshly grated Pecorino Romano or Parmesan cheese, or a combination"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the oil, garlic, and ham in a medium to large skillet over medium-low heat. Cook slowly, stirring occasionally, until the garlic becomes deep golden, nearly brown, all over, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Core and chop the plum tomatoes (or crush the canned tomatoes) and add them, along with salt and pepper, to the skillet. Stir and simmer while you salt the boiling water and cook the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the pasta when it is tender but firm, reserving a little of the cooking water and adding it to the sauce if it appears dry (quite likely if you used fresh tomatoes). Toss the pasta with the sauce and most of the basil, along with the cheese. Mince the remaining basil, garnish the pasta with it, and serve."}], "link": "https://cooking.nytimes.com/recipes/1015616-pasta-with-prosciutto-and-whole-garlic"}