{"@context": "http://schema.org", "@type": "Recipe", "name": "Mandarin Rice Stuffing With Chestnuts and Shiitake Mushrooms", "description": "The brown rice is cooked in vegetable broth to infuse it with more flavor. It needs to be cooked in advance and chilled before stir-frying. Hot rice is too moist to stir-fry and results in gummy rice. You can buy cooked chestnuts in a jar, but I prefer the taste of fresh roasted chestnuts.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2011/11/08/health/well_veggie_stir/well_veggie_stir-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "8 servings.", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, gluten-free, kosher, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 291, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "346 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/3 cups long-grain brown rice", "2 2/3 cups vegetable broth", "1 tablespoon soy sauce (low-sodium if desired)", "1 tablespoon Asian-style sesame oil", "3/4 teaspoon salt", "1/4 teaspoon ground white pepper", "3 tablespoons peanut or canola oil", "1 tablespoon minced ginger", "1 tablespoon minced garlic", "4 ounces fresh shiitake mushrooms, stems removed and caps cut into scant 1/4-inch slices (about 2 1/2 cups)", "1 cup red bell peppers cut into 1/4-inch dice", "1 1/2 cups cooked chestnuts, quartered", "1/2 cup roasted chopped pecans", "1/4 cup chopped cilantro", "1 bunch scallions (about 1 1/2 cups chopped)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "To roast chestnuts", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the tip of a sharp paring knife to cut an X on the flat side of each chestnut. Put the chestnuts in a plastic container and put in the freezer for 15 minutes. Meanwhile, preheat the oven to 425 degrees. Put the chestnuts on a jelly roll pan or baking dish, cut side up, and roast 20 minutes. Remove pan from the oven and allow chestnuts to cool until warm to the touch. Remove the shell and peel the chestnuts. Roasted chestnuts will keep in the refrigerator in a covered container for 2 to 3 days."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To roast pecans", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pecans in an empty wok and stir-fry for 2 minutes over medium heat until the nuts are golden. The pecans can be roasted several days ahead."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To prepare the stuffing", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 2-quart saucepan, bring the broth to a boil over high heat. Add the rice and return to a full boil. Cover, reduce the heat to low and simmer until the liquid is absorbed, about 40 minutes. Turn off the heat and let stand 5 minutes. Fluff the rice, cover, and allow it to completely cool before refrigerating. Makes about 4 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the soy sauce and sesame oil in a cup. Combine the salt and pepper in a small dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in 2 tablespoons of the peanut oil by adding it to the sides of the pan and swirling the pan, then add the ginger and garlic using a metal spatula to stir-fry no more than 10 seconds, until the ginger and garlic are fragrant. Add the mushrooms and bell peppers and stir-fry for 30 seconds, until all the oil is absorbed. Swirl in the remaining 1 tablespoon peanut oil, add the rice, and stir-fry for 1 minute, breaking up the rice with the spatula. Swirl in the soy sauce mixture, sprinkle with the salt mixture, and stir-fry for 1 minute, until well combined. Add the chestnuts, pecans and cilantro, and stir-fry for 1 minute, until heated through. Stir in the scallions."}]}]}