{"@context": "http://schema.org", "@type": "Recipe", "name": "Simple Sea Scallops Persillade", "description": "Sea scallops are available all year, but are abundant and quite welcome in winter. Like all shellfish, they are best when they are ultra-fresh. If you can get them like that, just let the freshness shine. These simple scallops are nearly naked, adorned with nothing more than butter, garlic and parsley. The idea is to accentuate, not mask, that straight-from-the-sea feeling.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/01/29/dining/29KITCH_SPAN/29KITCH_SPAN-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick", "keywords": "main course, parsley, scallops", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 127}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 208, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "0 grams", "proteinContent": "7 grams", "saturatedFatContent": "8 grams", "sodiumContent": "227 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 freshly shucked sea scallops, about 1 ounce each, cleaned, with coral attached if possible", "Salt and pepper", "2 tablespoons olive oil", "4 tablespoons unsalted butter", "4 garlic cloves, minced ", "4 tablespoons roughly chopped flat leaf parsley", "Lemon wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse scallops to rid them of any sand. With a paring knife, remove the small hard “foot” from the edge of each scallop. Blot scallops dry with paper towels. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put olive oil in wide cast-iron pan over medium-high heat. When oil is hot and nearly smoking, place scallops in pan in one layer. Leave scallops until well browned on one side, 2 to 3 minutes, then turn and cook for 1 minute on other side. Remove scallops to a plate, browned side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe pan clean with paper towels and return to stove. Turn down heat slightly. Add butter and swirl pan to melt. Add garlic and let it bloom — that is, cook without browning for 30 seconds. Return scallops to pan, browned side up, and gently heat through. Sprinkle with 3 tablespoons parsley and turn off heat. Put 2 scallops per person in scallop shells or small shallow bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tilt pan and spoon butter sauce evenly over each serving. Sprinkle with remaining 1 tablespoon parsley. Serve immediately with lemon wedges. "}]}