{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Chocolate Chip Banana Cake", "description": "This vegan delight came to The New York Times by way of Chloe Coscarelli, the vegan chef and cookbook author. The tender loaf is gently spiced with cinnamon, nutmeg, cloves and ginger and dotted throughout with dairy-free chocolate chips. Bonus: It's versatile. You can make it in a Bundt pan, a 10-inch loaf pan or in a muffin tin (it makes about 18 muffins). To quote one happy reader: \"Delicious! Like my platonic ideal of chocolate-chip banana bread.\" High praise, indeed.", "author": {"@type": "Person", "name": "Chloe Coscarelli"}, "image": "https://static01.nyt.com/images/2012/11/21/health/wellveggie_desserts2/wellveggie_desserts2-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "1 bundt or 5- by 10-inch loaf", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, gluten-free, kosher, nut-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 356}, "recipeIngredient": ["2 cups all-purpose flour (or gluten-free all-purpose flour plus 1 teaspoon xanthan gum)", "1 cup sugar", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1 teaspoon salt", "1/2 teaspoon ground cinnamon", "1/2 teaspoon ground nutmeg", "1/2 teaspoon ground cloves", "1/2 teaspoon ground ginger", "1 cup mashed bananas (approximately 2 very ripe bananas, mashed on a plate using the back of a fork)", "1 cup canned coconut milk, mixed well before measuring", "1/2 cup canola oil", "2 teaspoons white or apple cider vinegar", "1 tablespoon pure vanilla extract", "1 1/2 cups semisweet chocolate chips (dairy free)", "Powdered sugar for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Lightly grease a Bundt pan or a 5- by 10-inch loaf pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together flour, sugar, baking powder, baking soda, salt, cinnamon, nutmeg, cloves and ginger. In a separate bowl, whisk together bananas, coconut milk, oil, vinegar and vanilla. Pour the wet mixture into the dry mixture and whisk until just combined. Fold in the chocolate chips; do not over-mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the batter evenly into the prepared  pan. Bake for about 40 to 45 minutes in a Bundt pan or 50 to 60 minutes in a loaf pan until a toothpick inserted in the center of the cake comes out with a few crumbs clinging to it. Check the cake often and if it gets too brown on top, cover with foil and continue to bake. Rotate the pan halfway through baking time. Let cool, then sift powdered sugar over top."}]}