{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet and Sour Peppers Stuffed With Rice or Bulgur and Fennel", "description": "These sweet and sour peppers are great on their own, but they can also be filled. I like the filled peppers both cold, as sort of a salad, and warm. This is one instance in which fleshy red peppers work best.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/10/15/science/18recipehealth/18recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fennel, red pepper, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 29}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 389, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "75 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "8 grams", "proteinContent": "8 grams", "saturatedFatContent": "1 gram", "sodiumContent": "959 milligrams", "sugarContent": "19 grams", "transFatContent": null}, "recipeIngredient": ["3 cups water", "1/3 cup sugar", "1/3 cup sherry vinegar", "1 onion, sliced", "6 garlic cloves, sliced", "Salt to taste", "1 bay leaf", "4 sprigs fresh thyme", "4 medium or 3 large red peppers, cut in half, seeds and membranes removed", "2 tablespoons extra virgin olive oil", "2 medium-size fennel bulbs (about 3/4 pound), finely chopped", "2 garlic cloves, minced", "2 cups cooked red, brown or black rice, or bulgur", "Freshly ground pepper to taste", "1/2 cup chopped fresh mint, parsley, dill or chervil, or a mix", "1 to 2 ounces feta, crumbled (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer the peppers. Combine the water, sugar, vinegar, sliced onion, sliced garlic, salt, bay leaf and thyme in a large saucepan and bring to a simmer. Add the peppers, turn the heat to medium and boil gently for 15 minutes, checking and spooning liquid over the peppers from time to time if they are not submerged. Remove from the heat, allow to cool, cover and refrigerate until cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large skillet and add the fennel and a pinch of salt. Cook, stirring often, until the fennel is tender and fragrant, about 5 minutes. Add the garlic and continue to cook, stirring, for another 30 seconds to a minute, until fragrant, then stir in the rice or bulgur and mix together. Season to taste with salt and pepper and remove from the heat. Stir in the herbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a strainer over a bowl and drain the peppers. Blot them dry with paper towels and arrange on a platter or on plates if serving cold. Arrange in a lightly oiled baking dish if serving hot, and preheat the oven to 350 degrees. Fill with the rice mixture and spoon 2 teaspoons of the marinade over the filling of each serving. Sprinkle on the feta. Serve or chill if serving cold. If serving warm place in the oven for 15 minutes, until the cheese softens. "}]}