{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek Lentil Pie", "description": "I consider lentils a convenience food, so quickly do they cook. I used up the last of my ripe summer tomatoes in a simple <a href=\"https://cooking.nytimes.com/recipes/1016862-lentil-and-tomato-stew\">lentil and tomato stew</a> and used the leftover stew to fill an amazing Greek phyllo pie, an idea I came across when I was reading about all the things Greeks do with lentils in Diane Kochilas’s “The Greek Vegetarian.”", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/10/10/science/16recipehealthgreek/16recipehealthgreek-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "1 9-inch pie, serving 6", "recipeCuisine": "greek, mediterranean", "recipeCategory": "dinner", "keywords": "fall, spring, summer, winter, halal, high fiber, kosher, low sugar, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 98}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 379, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "10 grams", "proteinContent": "14 grams", "saturatedFatContent": "8 grams", "sodiumContent": "475 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons extra virgin olive oil", "1 medium onion, chopped", "2 garlic cloves, minced", "2 cups cooked lentils, with 1/4 cup of the broth from cooking, or 2 cups <a href=\"http://cooking.nytimes.com/recipes/1016862-lentil-and-tomato-stew\">lentil and tomato sauce stew</a>", "1/2 cup chopped fresh herbs, such as parsley, dill, mint, oregano", "5 ounces feta, crumbled (about 1 1/4 cups)", "1 tablespoon unsalted butter", "12 sheets phyllo dough"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a medium-size heavy skillet and add onion. Cook, stirring, until tender, 5 to 8 minutes. Add a generous pinch of salt and garlic and stir together until fragrant, 30 seconds to a minute. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium-size bowl combine cooked onion and garlic with lentils, herbs, and feta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Combine butter and remaining olive oil in a ramekin or pyrex measuring cup, or in a small pot, and heat gently until butter has melted. Brush a 9-inch straight sided tart pan or cake pan, either ceramic or metal, with butter and oil. Lay your phyllo dough out on a work surface and cover completely with a kitchen towel. Moisten another kitchen towel, and place on top of the dry towel. Remove phyllo one sheet at a time, replacing towels each time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay a sheet of phyllo in the pan, tucking it into the seam of the pan, with edges overhanging rim. Brush it lightly with butter and oil and turn pan slightly, then place another sheet on top, positioning it so that edges overlap another section of pan’s rim. Continue to layer in 5 more sheets of phyllo, brushing each one with butter and oil and staggering them so that overhang on the rim of pan is evenly distributed and covers entire pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill lined pan with lentil filling, then fold overhanging edges in over filling, brushing each one lightly with butter/oil mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Layer remaining 5 sheets of dough over top, brushing each sheet with butter and olive oil and rotating pan slightly after each addition. Crimp edges into sides of pan. Brush top with butter and oil. Pierce top of pie in several places with a sharp knife. Bake 45 to 50 minutes, until top is golden brown. Serve warm or at room temperature. Re-crisp phyllo before serving if necessary in a low oven for 10 to 20 minutes."}], "link": "https://cooking.nytimes.com/recipes/1016863-greek-lentil-pie"}