{"@context": "http://schema.org", "@type": "Recipe", "name": "Sauerkraut and Apples", "description": "In the Chesapeake, seafood often finds its way onto the Thanksgiving menu. But in Baltimore, which has a strong eastern European and German immigrant history, the holiday table demands something else. “The absence of sauerkraut when turkey is present, Thanksgiving included, is unthinkable, comparable to potatoes without gravy or crisp French fries without ketchup,” wrote John Shields, the chef and owner of Gertrude’s restaurant in Baltimore, in his cookbook “Chesapeake Bay Cooking.” (Sauerkraut is a mainstay well beyond Thanksgiving; Gertrude’s hosts an annual Krautfest in January.) \nTraditionally, homemakers fermented the cabbage in earthenware crocks in their cellars, but these days the fresh stuff is available to buy. On Thanksgiving, it’s often simply served as a side, or incorporated into dishes like this, in which the sauerkraut is braised in beer with bacon and apples.", "author": {"@type": "Person", "name": "Jennifer Steinhauer"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19MARYLAND/19MARYLAND-articleLarge.jpg", "totalTime": "PT55M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "apples, bacon, sauerkraut, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 89}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 220, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "6 grams", "proteinContent": "4 grams", "saturatedFatContent": "7 grams", "sodiumContent": "850 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons butter", "4 slices bacon, cut into 1/2-inch pieces", "1 small onion, thinly sliced", "3 tart apples, such as Stayman, Pippin, Granny Smith or Jonagold, peeled, cored, and thinly sliced", "2 pounds sauerkraut, drained and rinsed", "1 bottle (12 ounces) beer (you may substitute apple cider)", "Black pepper, to taste", "1/2 teaspoon caraway seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in a large heavy pot over medium-high heat. Add bacon and cook, stirring often, until fat has started to render, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss onion and apples in the fat and cook, stirring occasionally, until onions begin to soften, about 3 minutes. Stir in sauerkraut."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add beer and season with pepper and caraway seeds. Bring mixture to a boil, then cover the pot. Reduce heat so mixture is just simmering and cook for 45 minutes. Or transfer the covered pot to a 350-degree oven and bake for 1 hour. Stir and serve hot."}], "link": "https://cooking.nytimes.com/recipes/1016892-sauerkraut-and-apples"}