{"@context": "http://schema.org", "@type": "Recipe", "name": "Blueberry or Blackberry Compote with Yogurt or Ricotta", "description": "Blueberries don’t need much in the way of sweetener (blackberries are more tart, so you might want to use a little more with them), yet this simple compote will transform a plain bowl of yogurt or ricotta cheese into a dessert – or a very nice breakfast. The compote is modeled on Deborah Madison’s recipe in her lovely book, \"Seasonal Fruit Desserts.\" She sweetens her compote with maple syrup or maple sugar, which is also a lovely way to go. The small amount of cinnamon brings out the essential essence of the berries. I like to add a touch of rose water; the floral essence is beautiful with the berries. Don’t simmer for too long, or the compote will become more like jam – though it is also nice as a sort of jam with toast. Ricotta is richer than yogurt, so I serve less of it with the berries.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/05/20/science/19recipehealth/19recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "about 1 cup compote, serving 4", "recipeCuisine": "american, french", "recipeCategory": "breakfast, brunch, lunch", "keywords": "dessert, side dish, gluten-free, halal, kosher, low cholesterol, low-sodium, nut-free, vegetarian, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 77}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 314, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "15 grams", "saturatedFatContent": "10 grams", "sodiumContent": "106 milligrams", "sugarContent": "21 grams", "transFatContent": null}, "recipeIngredient": ["3/4 pound (2 boxes) blueberries or blackberries (about 2 1/2- 2 3/4 cups)", "1/8 teaspoon ground cinnamon", "2 to 3 tablespoons mild honey or agave nectar, or organic sugar, to taste", "1 teaspoon fresh lemon or lime juice", "1/4 teaspoon rose water", "2 cups plain Greek or thick yogurt, or 1 1/3 cups ricotta", "1 teaspoon cornstarch mixed with 2 tablespoons water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all ingredients except cornstarch dissolved in water and ricotta or yogurt in a saucepan. Add 1 tablespoon water and bring to a simmer over medium heat. Simmer until blueberries release their juices and blackberries begin to break apart, about 10 minutes. Stir occasionally from time to time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in dissolved cornstarch and stir until mixture thickens. Remove from heat and allow to cool, or serve warm, spooned over yogurt or ricotta.\nAlternative method: I use this method with blackberries, since  as they break down more: Toss the berries in a bowl with 2 tablespoons organic sugar. Cover and refrigerate overnight. The next day, add 1 more tablespoon sugar, honey or agave nectar if desired and proceed with step 1 of the recipe."}]}