{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Chile Breakfast Quesadillas", "description": "If there is one ingredient absolutely necessary for traditional New Mexican cooking, it is the long, spicy, local green chile. Try this easy recipe for a good basic green chile sauce. It adds a Southwestern kick to nearly anything, but it is especially nice spooned liberally over a hearty breakfast quesadilla.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/09/03/dining/03KITCH1/03KITCH1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch", "keywords": "cheese, cumin seeds, green chile, queso fresco, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 63}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 887, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "7 grams", "proteinContent": "41 grams", "saturatedFatContent": "22 grams", "sodiumContent": "1183 milligrams", "sugarContent": "10 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 tablespoons butter, lard or vegetable oil", "1 small onion, finely diced", "Kosher salt", "4 garlic cloves, minced", "2 tablespoons all-purpose flour", "2 cups chicken broth or water", "2 cups chopped Hatch or Anaheim green chiles (roasted, peeled and seeded), from about 2 pounds chiles", "1/2 teaspoon cumin seeds, toasted and coarsely ground", "1/2 teaspoon oregano", "4 large flour tortillas, plain or whole wheat", "8 ounces grated cheese, such as Oaxaca string cheese or Monterey Jack", "2 tablespoons butter", "2 medium-size cooked peeled potatoes, cut in small cubes, about 1 1/2 cups (optional)", "6 to 8 eggs, lightly beaten", "Salt and pepper", "4 ounces queso fresco or cotija cheese, crumbled", "Handful of cilantro sprigs", "1 firm-ripe avocado, sliced", "Radishes, optional, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the green chile sauce:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put butter in a heavy-bottomed saucepan over medium heat. Add onion, season lightly with salt and cook, stirring, until softened but not browned, about 5 minutes. Add garlic and cook for 1 minute more. Sprinkle in flour and stir to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add broth a little at a time, whisking constantly until thickened, about 2 minutes. Add chopped chile, cumin, oregano and about 1/2 teaspoon salt. Lower heat and simmer, stirring occasionally, for 15 to 20 minutes. You should have about 3 cups medium-thick sauce. (May be prepared in advance and refrigerated for up to 5 days.) Keep sauce warm."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the quesadillas:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Set a large cast-iron skillet over medium-high heat. Warm tortillas on both sides, one at a time, without allowing them to crisp or brown much. Place tortillas on a baking sheet (you may need 2) and sprinkle each with 2 ounces of the grated cheese. Put in oven to melt cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in a small skillet over medium heat. Add potatoes if using, heat them through and let lightly brown. Season eggs with salt and pepper, pour over potatoes and quickly stir mixture until eggs are soft-scrambled. Remove tortillas from oven and place 1/4 of the cooked egg mixture at the center of each. Fold tortillas in half and transfer to 4 warm plates. Spoon 1/4 cup warm green chile sauce over each quesadilla. Sprinkle with queso fresco and top with cilantro sprigs and avocado slices. Garnish with whole or halved radishes if desired. Serve immediately."}]}], "link": "https://cooking.nytimes.com/recipes/1016785-green-chile-breakfast-quesadillas"}