{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato, Quinoa, Spinach and Red Lentil Burger", "description": "You can use blond or black quinoa for these delicate burgers. Black will look striking against the sweet potato’s orange when you cut into the burgers. The red lentils pale to yellow when you cook them; they contribute texture and flavor. The burgers have a decidedly Mediterranean flavor, with feta and mint included in the mix. But I still like to serve them with raita or chutney; a more Mediterranean condiment would be yogurt seasoned with puréed garlic and mint.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2019/07/31/science/31cooking/16recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "10 patties", "recipeCuisine": "american, indian", "recipeCategory": "dinner, lunch, burgers", "keywords": "fall, spring, winter, halal, kosher, low cholesterol, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 591}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 275, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "462 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1/3 cup quinoa (blond or black), rinsed", "1/3 cup red lentils, rinsed", "1 2/3 cups water", "Salt to taste", "1 1/2 pounds sweet potatoes, baked", "3 cups, tightly packed, chopped fresh spinach", "3 ounces feta, crumbled (about 3/4 cup)", "3 tablespoons chopped fresh mint", "1/4 cup minced chives", "2 teaspoons fresh lemon juice", "Freshly ground pepper to taste", "1 cup panko or chickpea flour (you will not use all of it)", "1/4 cup grape seed oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine quinoa, red lentils, water and salt to taste (I used a rounded 1/2 teaspoon) in a saucepan and bring to a boil. Reduce heat, cover and simmer 15 to 20 minutes, until quinoa is tender and blond quinoa displays a thread, and lentils are just tender. Drain off any water remaining in the pot through a strainer, tapping strainer against the sink to remove excess water, then return quinoa and lentils to the pot. Cover pot with a towel, then return the lid and let sit undisturbed for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skin sweet potatoes and place in a large bowl. Mash with a fork. Add spinach and mash together (I use my hands for this). Add quinoa and lentils, feta, mint, chives, lemon juice, and salt and pepper to taste. Mix together well. Mixture will be moist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take up about 1/3 cup of the mixture and form into a ball (you can wet your hands to reduce sticking). Roll the ball in the panko or chickpea flour, then gently flatten into a patty. Set on a plate and continue with the rest of the mixture. Refrigerate uncovered for 1 hour or longer (the longer the better)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to cook, place a rack over a sheet pan. Heat 2 tablespoons oil in a 12-inch, heavy nonstick frying pan over high heat. Swirl the pan to coat with the hot oil. Lower heat to medium. Place 4 to 5 patties in the pan (do not crowd), and cook until well browned on one side, about 4 minutes. Turn and brown for about 4 more minutes. Remove to rack. Heat remaining oil in the pan and cook remaining patties. Keep patties warm in a low oven until ready to serve. Serve with a salad and your choice of toppings, such as the usual (ketchup, mustard, relish), or yogurt raita, garlic yogurt, or chutney."}], "link": "https://cooking.nytimes.com/recipes/1016342-sweet-potato-quinoa-spinach-and-red-lentil-burger"}