{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Paella", "description": "Here is a recipe inspired by the cooking exploits of Manny Howard, a size-large Brooklynite with a generous spirit, a healthy capacity for self-deception and the cooking skills of a dude-ranch Escoffier. It may be slightly intimidating to consider: a giant pan of rice and protein cooked on an outdoor grill. But it is remarkably easy to pull off if you have a paella pan (available online and in most cookware stores) and a healthy amount of patience. The whole game is in the preparation, so that you’re not muddling around with ingredients while the fire burns down. Read the recipe two or three times before you get started and, the first time you make the paella, make sure you have everything ready before even you light the fire. Your overall time will improve with practice. But the flavors will be sublime from the very first attempt.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/02/26/dining/recipes-grilledpaella/recipes-grilledpaella-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "spanish", "recipeCategory": "dinner", "keywords": "chicken, rice, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 636}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1086, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "90 grams", "cholesterolContent": null, "fatContent": "51 grams", "fiberContent": "2 grams", "proteinContent": "64 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1643 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["A handful of wood chips, such as fruit or hickory (optional)", "One large pinch saffron", "2 1/4 quarts low-sodium chicken broth", "1/4 cup extra-virgin olive oil", "2 pounds chicken thighs", "Salt and freshly ground black pepper", "1 pound chorizo, cut into half-moons", "1 medium onion, peeled and finely chopped", "1 tablespoon minced garlic", "4 cups short-grain rice, such as arborio", "1 1/2 pounds jumbo shrimp, peeled, deveined, chopped", "1 cup fresh or frozen peas", "2 dozen littleneck clams, cleaned", "2 tablespoons finely chopped parsley (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using, soak the wood chips in water. In a large pot, stir the saffron into the chicken broth and set over medium heat. Once hot, lower the heat and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In an 18-inch paella pan, heat the olive oil over medium-high heat. (A large, wide, shallow, flameproof saucepan may be substituted — or, in a pinch, an enameled Dutch oven.) Season the chicken thighs all over with salt and pepper and brown on all sides in the hot oil. Transfer to a plate. Cook the chorizo in the same pan until it starts to brown. Transfer to a second, paper-towel-lined plate. Remove the pan from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light a charcoal grill with about a large cereal box’s worth of charcoal. Return the paella pan to the stove and set over medium-high heat. When hot, add the onion and cook until translucent, about 4 minutes. Add the garlic and stir until fragrant, then add the rice and stir to coat. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock, paella pan, chicken, chorizo and other ingredients to a table near the grill. When the fire is at its peak heat (all of the coals are lit, and you can hold your hand over the hottest part of the fire for only a few seconds), quickly stir the shrimp, chorizo and peas into the rice, then add 2 quarts of stock. Add the clams hinge-side up so that when they open in the heat, their juices are released into the rice. Nestle the chicken on top. Using thick gloves and a pair of tongs, carefully remove the grill grate. Drain the wood chips and drop them into the fire. Quickly replace the grill grate and set the paella pan on the grate. Cover the grill and cook the paella until all the liquid has absorbed, 25 to 30 minutes. If the rice is underdone, add another cup of stock and return to the fire for 5 to 7 minutes. Season with salt and pepper to taste and, if you choose, top with parsley."}]}