{"@context": "http://schema.org", "@type": "Recipe", "name": "Laurie Colwin’s Creamed Spinach With Jalapeño Peppers", "description": "This recipe is from the celebrated food writer Laurie Colwin, and in some ways it is quintessentially hers. There’s the delicious richness of the dish, its unfussiness and nostalgic value. There is the constant awareness of the plight of the busy home cook, those who would just as soon use a package of frozen spinach if the results are just as good as if you washed and chopped an untold number of bunches of fresh spinach yourself. And there is a twist: the jalapeños, which are a preventative measure against the gloppy blandness of steakhouse creamed spinach, adding sharpness to the dish but not too much heat. You can use either fresh or pickled jalapeños here — the latter add nice zing — and panko bread crumbs are a good substitution for fresh if you don’t have them (or a few pieces of stale bread) in the pantry. (The New York Times)", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/02colwinrecipe/02colwinrecipe-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "easy, weekday, casseroles, dips and spreads", "keywords": "side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 176}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 205, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "9 grams", "sodiumContent": "251 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 10-ounce packages whole-leaf frozen spinach (do not thaw)", "4 tablespoons butter, additional for buttering pan", "2 tablespoons all-purpose flour", "2 tablespoons chopped onion", "1 clove garlic, minced", "1/2 cup evaporated milk", "Black pepper", "3/4 teaspoon celery salt", "6 ounces Monterey Jack cheese, cut into cubes", "1 pickled or fresh jalapeño pepper, chopped, or more to taste", "1/2 cup soft buttered bread crumbs (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Meanwhile, cook spinach according to package directions. Drain, reserving 1 cup of liquid, and chop finely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a shallow 8-inch-square casserole dish or other shallow 4- to 6-cup baking dish. Melt remaining 4 tablespoons butter in a saucepan and add flour. Blend and cook 2 to 3 minutes. Do not brown. Add onion and garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the spinach liquid slowly, then add evaporated milk, some black pepper, celery salt and cheese. Mix well and add jalapeño and spinach. Cook until all is blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn into the casserole dish, top with buttered bread crumbs and bake until lightly browned, about 45 minutes."}]}