{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto with Roasted Winter Squash", "description": "Roasting squash lightly caramelizes it, making a naturally sweet vegetable even sweeter. I stir a small portion of the roasted squash into this luxurious risotto at the beginning, and the rest at the end of cooking. The squash that is added at the beginning falls apart as the risotto cooks, enriching the mixture and adding color.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/12/16/health/nutrition/16recipe.health.ready/16recipe.health.ready-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 279}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 420, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "4 grams", "proteinContent": "15 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1118 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 pound winter squash (about 1/2 of a good-size butternut, for example), such as butternut, banana or hubbard, peeled, seeded and cut in 1/2 inch dice", "2 tablespoons extra virgin olive oil", "7 to 8 cups vegetable or chicken stock, as needed", "1 small or 1/2 medium onion", "2 large garlic cloves, minced or pressed", "Salt to taste", "1 1/2 cups Arborio or Carnaroli rice", "1/2 cup dry white wine, such as Pinot Grigio or Sauvignon Blanc", "1 teaspoon chopped fresh sage", "1 to 2 ounces Parmesan cheese, grated (1/4 to 1/2 cup), to taste", "3 to 4 tablespoons chopped fresh parsley", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425ºF. Cover a baking sheet with foil. Toss the squash with 1 tablespoon of the olive oil and spread on the baking sheet in an even layer. Place in the oven and roast for 30 to 40 minutes, stirring every 10 minutes, until tender and caramelized. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a simmer in a saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining oil over medium heat in a large, heavy nonstick frying pan or a wide saucepan and add the onion. Cook, stirring, until the onion begins to soften, about 3 minutes, and add one third of the squash, the garlic, and about 1/2  teaspoon salt. Cook, stirring, until the onion is tender and the garlic fragrant, about 1 minute, and add the rice. Cook, stirring, until the grains of rice are separate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the wine and cook over medium heat, stirring constantly. The wine should bubble, but not too quickly. When the wine has just about evaporated, stir in a ladleful or two of the simmering stock, enough to just cover the rice and squash. The stock should bubble slowly. Cook, stirring often, until it is just about absorbed. Add the sage and another ladleful of the stock, and continue to cook in this fashion, not too fast and not too slowly, adding more stock when the rice is almost dry, for 20 to 25 minutes, or until the rice is cooked al dente. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining roasted squash and another 1/2 cup of stock to the rice. Stir in the Parmesan and parsley, and immediately remove from the heat. Add freshly ground pepper, taste one last time and adjust salt. The rice should be creamy. Serve at once."}], "link": "https://cooking.nytimes.com/recipes/1016517-risotto-with-roasted-winter-squash"}