{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Caramel Macarons", "description": "There are American macaroons, usually generously sized, coconut-based confections. And then there are French macarons, diminutive and almond imbued. This recipe skews French, but with a twist. Instead of the typical buttercream or ganache filling, there’s a crunchy caramel candy layer in between the cocoa layers. These are fudgy little confections more like candy than cookies. They also happen to be both gluten-free and can be kosher for Passover, if you use kosher-for-Passover confectioners' sugar. You can make the macarons five days ahead, but don’t fill them more than a day ahead. Or serve them without the caramel for something slightly less sweet, but just as intense.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/04/multimedia/clark-macaroon/clark-macaroon-mediumThreeByTwo440.jpg", "totalTime": "PT1H45M", "recipeYield": "About 2 1/2 dozen filled macarons", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, gluten-free, kosher", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 218}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 93, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "26 milligrams", "sugarContent": "16 grams", "transFatContent": null}, "recipeIngredient": ["180 grams confectioners’ sugar (1 3/4 cups), see note ", "95 grams almond flour or ground almonds (1 cup)", "30 grams natural unsweetened cocoa powder (5 tablespoons) ", "1/4 teaspoon fine salt ", "3 large egg whites, at room temperature ", "255 grams granulated sugar (1 cup plus 3 tablespoons)", "57 grams bittersweet chocolate (2 ounces), chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two or three baking sheets with parchment or nonstick baking mats. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, whisk together confectioners’ sugar, almond flour, cocoa powder and salt. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place egg whites in the bowl of a stand mixer fitted with whisk attachment. Beat on medium speed until egg whites are white in color and hold onto the bottom of the whisk, 2 to 3 minutes. Continue to beat, slowly adding 40 grams (3 tablespoons) granulated sugar until peaks are stiff, about 1 minute. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a rubber spatula, gently fold almond mixture into egg whites in 4 batches, until there are no traces of egg whites."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon batter into a pastry bag or a heavy-duty plastic bag, cutting a small hole in a corner of the plastic bag. Pipe 1-inch rounds of batter, an inch apart from one another, onto the baking sheets.. (Alternatively, use a 1/2 teaspoon measure to form the rounds.) Pick up baking sheets and bang them against work surface. Let sheets sit at room temperature for 30 minutes to dry tops. (Don’t skip this step; it helps the macarons rise nicely.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Bake macarons until puffed and firm, 10 to 12 minutes, rotating the sheets halfway through baking. Transfer sheets to rack to cool completely, then overturn cookies on the baking sheets so that flat bottoms are facing up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the caramel, combine the remaining 215 grams (1 cup) granulated sugar with 1/4 cup water in a clean, dry skillet over medium heat. Cook, swirling the pan occasionally to help distribute the sugar until it completely melts and turns a rich reddish brown (imagine the color of an Irish setter), about 15 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, spoon caramel over half the overturned cookies; immediately sandwich with remaining, unfilled cookies. If the caramel hardens before you’re done, gently melt it over low heat and continue filling cookies. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a small saucepan with water and bring to a simmer. Place chocolate in a heatproof bowl and place over pot. Heat, stirring frequently, until melted. (Or melt chocolate in the microwave.) Using a fork, drizzle cookies with melted chocolate. Let the caramel and chocolate set at room temperature or in the refrigerator. The caramel should harden to the texture of hard candy."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Chocolate Caramel Macarons", "description": "Melissa Clark takes the best parts of a French macaron and an American macaroon and creates a sweet sandwich cookie for Passover.", "thumbnailUrl": "https://static01.nyt.com/images/2014/04/04/multimedia/clark-macaroon/clark-macaroon-mediumThreeByTwo440.jpg", "uploadDate": "2014-04-04T18:18:15.000Z", "duration": "PT3M4S"}}