{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Corn, Squash, and Tomatoes With Ginger, Garlic and Cilantro", "description": "Coconut oil gives this dish fragrance without heaviness. With a big bunch of Thai basil in hand, I wanted a sweet stir-fry with Thai flavors. I stir-fried the vegetables in coconut oil, and I loved the results. The medley has that coconut fragrance without the heaviness it would have with coconut milk. I served the vegetables with black rice, which was beautiful, but any other rice, noodles or grains like quinoa would work. Make sure that your corn is sweet and your tomatoes are juicy. You can also use the lower-priced tomatoes “for sauce” that may be at your farmers’ market.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/07/16/science/15recipehealth/15recipehealth-articleLarge.jpg", "totalTime": "PT7M", "recipeYield": "Serves 4", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "dairy-free, halal, kosher, low cholesterol, vegan, vegetarian, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 59}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 115, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "6 grams", "sodiumContent": "553 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup vegetable stock, chicken stock or water", "1 to 2 tablespoons soy sauce (to taste)", "2 teaspoons cornstarch", "2 tablespoons coconut oil", "1 red onion, cut in half lengthwise and sliced across the grain in half-moons", "1 tablespoon minced ginger", "1 tablespoon minced garlic", "2 zucchini or similar summer squash (about 10 to 12 ounces), diced", "Kernels from 2 ears sweet corn", "1 pound ripe tomatoes, diced (about 2 1/2 cups)", "1/4 to 1/2 teaspoon salt (to taste)", "1/4 to 1/2 teaspoon sugar (to taste)", "1/4 cup chopped Thai basil", "2 tablespoons chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine stock or water, soy sauce and cornstarch in a small bowl or measuring cup and stir to dissolve cornstarch. Place this mixture and all the other ingredients near the burner in the order they will be used."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or 12-inch steel skillet over high heat until a drop of water evaporates within a second or two when added to pan. Swirl in coconut oil and add onion, garlic and ginger. Stir-fry for about 2 minutes, until onion is crisp-tender, and add squash. Stir-fry for about a minute, until you can just see the squash becoming translucent, and add corn. Stir-fry for about 2 minutes, and add tomatoes, salt, and sugar. tir-fry for about 2 minutes, until the tomatoes have collapsed and stir-fry is beginning to look saucy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in Thai basil and cilantro. Stir cornstarch mixture and add to pan. Continue to stir-fry for about 30 seconds, until vegetables are glazed. Remove from heat and serve, with rice, noodles or other grains."}], "link": "https://cooking.nytimes.com/recipes/1016662-stir-fried-corn-squash-and-tomatoes-with-ginger-garlic-and-cilantro"}