{"@context": "http://schema.org", "@type": "Recipe", "name": "Du Jour Doughnuts", "description": "This classic yeast doughnut is a specialty of T. J. and Vera Obias, the husband-and-wife team of pastry chefs at Du Jour Bakery, in Park Slope, Brooklyn. The dough is light and airy, and the sugar crystals add crunch. After cutting out the doughnuts, test whether they have risen enough by touching them with a fingertip; if they spring back slowly, they are sufficiently proofed. Springing back fast means they need more time, and not springing back means they are overproofed.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2014/11/05/dining/05JPHUNGRY8/05JPHUNGRY8-articleLarge-v2.jpg", "totalTime": "PT13H45M", "recipeYield": "8 4-inch doughnuts and 8 doughnut holes", "recipeCuisine": "american", "recipeCategory": "breakfast, snack, pastries", "keywords": "bread flour, butter, sugar, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 65}, "recipeIngredient": ["About 11 cups vegetable oil", "3 3/4 cups/485 grams bread flour", "1/4 cup/50 grams sugar, plus about 2 cups/400 grams sugar for rolling doughnuts", "1 tablespoon/11 grams kosher salt", "1 tablespoon/9 grams instant yeast", "6 large eggs", "2 sticks, plus 5 tablespoons/296 grams cold, cubed unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a large bowl. Combine the flour, 1/4 cup sugar, salt and yeast in the bowl of a stand mixer fitted with the dough hook attachment. Turn mixer to speed 1 and stir the ingredients together. Add the eggs and continue to mix on speed 1, scraping bowl and dough hook as necessary, until dough forms, about 2 minutes. Increase speed to 2, then add the butter in 3 additions, making sure butter is completely emulsified before adding more and scraping the bowl and dough hook as necessary, about 10 minutes total. The dough should be smooth and stretchy. Place finished dough in the prepared bowl, cover with plastic wrap and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with parchment paper. Turn the dough out onto a well-floured surface and use a floured rolling pin to roll it to a 1/2-inch thickness. Using a round doughnut or cookie cutter, cut out 4-inch diameter rounds with 1-inch-diameter holes. Arrange the doughnuts on the prepared baking sheet, cover loosely with plastic wrap and let proof at room temperature until visibly puffy and airy, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a wire rack over a baking sheet and place the remaining 2 cups of sugar in a shallow bowl. In a heavy-bottom large pot or deep fryer, heat at least 2 inches of oil until a deep-fry thermometer registers 350 degrees. Working in batches, use a slotted metal spoon or spatula to carefully place the doughnuts and holes in the hot oil. Fry, flipping once, until light golden brown, about 1 minute per side. When done, transfer each to the wire rack and return oil to 350 degrees between batches. While still warm, roll doughnuts and holes in sugar and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1016953-du-jour-doughnuts"}