{"@context": "http://schema.org", "@type": "Recipe", "name": "Quiche With Red Peppers and Spinach", "description": "The real spring vegetable here is the spinach, lush and beautiful at this time of year. You can always get red peppers in a supermarket, and when you cook them for a while, as you do here, even the dullest will taste sweet. I make the pepper mixture first, then wilt the spinach in the same pan and line the tart shell with the savory mix. If you can, make the pepper and spinach filling a day ahead. It dries out a little if it sits overnight in the refrigerator and is less likely to dilute the custard.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/21/dining/Red-Peppers-and-Spinach/Red-Peppers-and-Spinach-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 generous servings", "recipeCuisine": "french, mediterranean", "recipeCategory": "dinner, lunch", "keywords": "halal, high fiber, kosher, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 282}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 365, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "4 grams", "proteinContent": "12 grams", "saturatedFatContent": "9 grams", "sodiumContent": "555 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "1 medium-size onion (yellow or spring onion), chopped", "2 large garlic cloves, or 1 small bulb green garlic, peeled and  minced", "Salt to taste", "2 large red bell peppers (about 3/4 pound), seeded and cut in thin 1-inch strips", "1 teaspoon chopped fresh thyme leaves", "1 generous bunch spinach, stemmed, washed in 2 changes of water, and coarsely chopped", "Freshly ground pepper to taste", "2 egg yolks", "2 whole eggs", "1 (9-inch) <a href=\"https://cooking.nytimes.com/recipes/1016266-whole-wheat-pie-dough\">whole wheat pâte brisée pie crust,</a> fully baked and cooled", "Freshly ground pepper", "2/3 cup milk", "2 ounces Gruyère, grated (1/2 cup)", "1 ounce Parmesan, grated (1/4 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil over medium heat in a large, heavy skillet and add onion. Cook, stirring, until tender, about 5 minutes, and add a generous pinch of salt, the garlic, peppers and thyme. Cook, stirring often, for 5 minutes, then turn the heat to medium low and continue to cook for  5 to 10 minutes more, until peppers are very tender and sweet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn up heat to medium-high and, a handful at a time, add spinach and stir until each handful wilts. If there is liquid remaining in the pan turn up the heat and stir while you let it cook off. Remove from heat and transfer to a bowl. If you are making filling a day ahead, refrigerate uncovered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat together egg yolks and eggs in a medium bowl. Set tart pan on a baking sheet  for easy handling. Using a pastry brush, lightly brush bottom of the crust with some of the beaten egg and place in oven for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add salt (I use 1/2 teaspoon), pepper, and milk to the remaining eggs and whisk together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread pepper and spinach mixture in an even layer in the crust. Stir together cheeses and sprinkle in an even layer on top. Very slowly pour in the egg custard over the filling. If your tart pan has low edges, you may not need all of it to fill the shell, and you want to avoid the custard spilling over.  Place quiche, on baking sheet, in the oven and bake for 30 to 35 minutes, until set and just beginning to color on the top. Remove from oven and allow to sit for at least 10 minutes before serving. Serve hot, warm or room temperature."}], "link": "https://cooking.nytimes.com/recipes/1016269-quiche-with-red-peppers-and-spinach"}