{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Chicken Liver Pasta With Wild Morels", "description": "Fresh wild mushrooms are the most delicious indulgence, whether it’s gray-brown morels in the springtime, golden chanterelles in the summer, or russet-colored porcini in the fall. True, they are expensive (unless you know how to pick your own), but a mere half-pound is all you need for this creamy pasta — and chicken livers are cheap. Serve the pasta in small portions; it is undeniably a bit on the rich side. If you can’t find wild mushrooms, use an assortment of cultivated mushrooms, like cremini, oyster mushrooms, King trumpets or shiitake. To give them more wild mushroom flavor, soak just a few a few dried morels or porcini in warm water. When softened, chop them very fine and stir into the sauce.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/05/28/dining/28KITCH1/28KITCH1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas", "keywords": "chicken liver, morels, pasta", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 150}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 568, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "70 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "5 grams", "proteinContent": "29 grams", "saturatedFatContent": "8 grams", "sodiumContent": "847 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound wild morels (or other mushrooms)", "1 pound chicken livers", "All-purpose flour, for dusting", "Salt and pepper", "Pinch of cayenne", "1 tablespoon olive oil", "2 tablespoons butter", "2 large shallots, finely diced", "1/4 cup dry sherry", "2 to 3 cups chicken stock (or mushroom stock)", "1/2 cup crème fraîche", "1 pound pappardelle or other pasta", "4 egg yolks", "3 tablespoons lemon juice", "1/2 teaspoon grated lemon zest", "2 teaspoons chopped fresh tarragon", "1 tablespoon chopped parsley", "1 tablespoon finely cut chives", "2 ounces thinly sliced prosciutto, cut into 1/2-inch ribbons (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut stems from mushrooms (reserve for making mushroom stock, if desired) and cut them to bottom into halves or quarters. If they seem at all sandy, swish them very briefly in a bowl of warm water and blot on kitchen towels, then set aside. Put a large pot of water on to boil for the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim chicken livers: cut each liver into two lobes, discarding any veiny bits, then cut livers into 1-inch pieces. Put about 1 cup flour in a low bowl and add 1 teaspoon salt, a generous amount of black pepper and a pinch of cayenne. Dip liver chunks in flour mixture, then set them aside in one layer on a baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in a wide skillet over medium high heat. Quickly brown liver pieces on all sides, then remove them from the pan and blot on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter and shallots to pan and cook, stirring frequently, until shallots are softened and beginning to brown, about 2 minutes. Add mushrooms, season generously with salt and pepper and cook them together with the shallots for about 5 minutes, until they are somewhat soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add sherry and cook for a minute or so, then add 2 cups chicken stock. Bring to a simmer and add previously browned liver. Cook for about 5 minutes. It should look quite saucy. Add more chicken stock, if necessary. Taste and adjust seasoning. Stir in crème fraîche and turn off heat"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil pasta until al dente and drain. While pasta is cooking, beat egg yolks, lemon juice and lemon zest together in a small bowl. Pour egg mixture slowly into chicken liver sauce, then stir for a minute or so over low heat until slightly thickened, being careful not to curdle egg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide pasta among bowls and spoon sauce over. Mix tarragon, parsley and chives together and sprinkle over each serving. Scatter prosciutto ribbons on top, if using, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1016401-creamy-chicken-liver-pasta-with-wild-morels"}