{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet and Sour Stir-Fried Radishes With Their Greens", "description": "The bitterness of radish greens pairs wells with a sweet-and-sour sauce in this stir-fry. We always toss out radish greens, but we shouldn’t. They are as nutritious as any green, and they have a pleasantly bitter flavor that is very much like that of turnip greens, which are a close relative. The bitterness works very well against a sweet and \nsour stir-fry sauce. The radishes should be barely cooked. This is a great dish for large, colorful breakfast radishes. The big bunches I get at my farmers’ market weigh a pound, sometimes a little more. Use 2 bunches if yours are smaller.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/07/17/science/18recipehealth/18recipehealth-articleLarge.jpg", "totalTime": "PT4M", "recipeYield": "Serves 3 to 4 as a side dish", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "dairy-free, halal, high fiber, kosher, low cholesterol, vegan, vegetarian, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 71}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 67, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "2 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "251 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 generous bunch large radishes, with greens (about 1 pound total), or 2 smaller bunches", "1 tablespoon soy sauce", "1 tablespoon rice vinegar", "2 teaspoons agave nectar or honey", "2 tablespoons chicken stock, vegetable stock or water", "Salt and freshly ground pepper to taste", "1 tablespoon peanut, canola, sunflower, or grape seed oil", "2 teaspoons minced garlic", "2 teaspoons minced ginger", "1 bunch scallions, chopped, white and green parts separated", "1/4 cup chopped cilantro", "1 teaspoon cornstarch dissolved in 2 tablespoons water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away greens from radishes and trim off bottoms of the stems. Wash in 2 changes of water and spin dry. Chop coarsely. Trim away tips of radishes and quarter lengthwise if large, cut in half if small."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or measuring cup combine soy sauce, vinegar, agave nectar or honey, and stock or water. Have all ingredients within arm’s length of your burner."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok over high heat until a drop of water evaporates within a second or two when added to the pan. Add oil to wok or pan and swirl to coat sides, then add garlic and ginger and stir-fry for no more than 10 seconds. \n\nAdd white parts of scallions and stir-fry for 30 seconds to a minute. Add radish greens, salt and pepper and stir-fry for 1 to 2 minutes more, until they wilt, and stir in radishes. Stir-fry for 1/2 minute and add soy sauce mixture. Stir-fry for a minute more, then stir in ilantro and scallion greens, stir together for a few seconds, add cornstarch slurry and stir until vegetables are glazed (less than 30 seconds). Remove from heat and serve."}]}