{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti With Shrimp, Kale and Tomatoes", "description": "I like to use black kale for this. I blanch it in the pasta cooking water, then I add the chopped blanched leaves to the tomato sauce at the end of cooking, just so they will heat through and soften a little more. I sear the shrimp and make the tomato sauce in the same pan. You can toss shrimp in the tomato sauce or just top each serving with them, which is the way to go if there are vegetarians at the table.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/02/25/science/28recipehealth/28recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner, quick", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, low sugar, nut-free, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 191}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 427, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "6 grams", "proteinContent": "16 grams", "saturatedFatContent": "1 gram", "sodiumContent": "506 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 medium-size bunch black kale, stemmed and washed well in 2 changes water", "Salt to taste", "2 tablespoons extra virgin olive oil", "12 medium shrimp, peeled and deveined", "Freshly ground pepper to taste", "2 garlic cloves, minced", "1/4 to 1/2 teaspoon red pepper flakes (to taste)", "1-14 1/2-ounce can chopped tomatoes in juice", "1/4 teaspoon sugar", "1/2 to 1 teaspoon oregano or thyme (to taste)", "3/4 pound spaghetti", "Crumbled feta or freshly grated Parmesan for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pasta pot with water and bring to a boil. Add salt to taste and the kale. Boil 2 to 3 minutes, until tender, then using a Chinese skimmer, a strainer or a slotted spoon, transfer to a bowl of cold water (do not drain water in the pot; you’ll use it for the pasta). Drain kale and a handful at a time, squeeze out excess water. Chop medium fine and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "(You can do this step while you are waiting for the water to come to a boil for the kale). Season shrimp with salt and pepper to taste. Heat olive oil over medium-high heat in a large, heavy skillet or a wide saucepan and add shrimp. Do not stir for a minute, then turn shrimp and toss in the pan until seared on the edges, pink and cooked through, about 4 minutes. Remove to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat down to medium and add garlic and hot pepper flakes. Cook, stirring, until fragrant, 10 to 20 seconds (the pan will be quite hot), and stir in tomatoes with liquid, sugar, salt and oregano or thyme. Turn heat up to medium-high and stir often as tomatoes come to a brisk boil. Turn heat down to medium and cook, stirring often, until tomatoes have cooked down and taste very fragrant, about 10 minutes. Stir in kale and simmer for another 3 to 5 minutes. Stir in shrimp or keep separate, remove from the heat and keep warm. If sauce seems dry you can add some cooking water from the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring water in pot back to a boil and add spaghetti. Cook al dente, following timing instructions on the package but checking for doneness a minute before the indicated time. Set aside 1/2 cup of the cooking water from the pasta, in case you want to moisten the sauce more, drain pasta and toss with tomato and kale mixture. Add water from the pasta only if you think the mixture seems dry. Serve the pasta and top each serving with 3 shrimp if you haven’t tossed the shrimp with the sauce. Pass crumbled feta or grated Parmesan at the table for sprinkling."}], "link": "https://cooking.nytimes.com/recipes/1016077-spaghetti-with-shrimp-kale-and-tomatoes"}