{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-fried Broccoli Stalks and Flowers, Red Peppers, Peanuts and Tofu", "description": "Probably most of you have used broccoli time and again in stir-fries. In this version I cut the stalks into 2-inch julienne, which is almost like adding a separate vegetable to the mix of broccoli flowers and red pepper (also cut in julienne). There’s a lot of texture at play here – crisp-tender vegetables, crunchy peanuts and soft tofu. You can add a little spice if you want, but I’ve made the chili flakes optional.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/06/17/science/16recipehealth/16recipehealth-articleLarge.jpg", "totalTime": "PT7M", "recipeYield": "4 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "dairy-free, high fiber, kosher, low cholesterol, low-fat, vegan, vegetarian, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 212}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 297, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "8 grams", "proteinContent": "24 grams", "saturatedFatContent": "2 grams", "sodiumContent": "619 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 bunch broccoli", "One 14-ounce box firm tofu, drained and cut in 1/4-inch thick, 2-inch by 3/4-inch dominoes", "1 to 2 tablespoons soy sauce (more to taste)", "1 tablespoon Chinese cooking sherry (Shaoxing rice wine) or dry sherry", "1/4 cup vegetable stock or water", "1/4 to 1/2 teaspoon salt, or to taste", "2 to 3 teaspoons minced garlic", "2 to 3 teaspoons minced ginger", "1/4 to 1/2 teaspoon red pepper flakes (optional)", "2 tablespoons peanut, canola, rice bran, sunflower, or grape seed oil", "1/4 cup lightly roasted unsalted peanuts", "1 red bell pepper, cut in 2-inch julienne", "2 tablespoons chopped cilantro", "1/2 teaspoon sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut broccoli stems away from crowns. Peel stems, slice lengthwise, then cut in 2-inch julienne. Cut crowns in thin slices and collect all of the flower buds that fall off onto your cutting board in the same bowl with the sliced crowns."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dry tofu slices on paper towels. In a small bowl or measuring cup combine soy sauce, rice wine or sherry, and stock or water. Combine salt and sugar in another small bowl and garlic, ginger and red pepper flakes in another. Have all ingredients within arm’s length of your pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or 12-inch steel skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in 1 tablespoon of the oil by adding it to the sides of pan and swirling the pan, then add tofu and stir-fry until lightly colored, 1 to 2 minutes. Remove to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl in remaining oil, add garlic, ginger and pepper flakes if using and stir-fry for no more than 10 seconds. Add peanuts, all of the broccoli – stems, crowns and flower buds – and red peppers, and stir-fry for 1 minute. Add salt, pepper, and sugar, toss together and add soy sauce mixture. Stir-fry for 1 to 2 minutes, until vegetables are crisp-tender, and return tofu to the wok. Add cilantro and stir together for about 30 seconds. Serve with additional soy sauce as desired and hot grains or noodles."}], "link": "https://cooking.nytimes.com/recipes/1016578-stir-fried-broccoli-stalks-and-flowers-red-peppers-peanuts-and-tofu"}