{"@context": "http://schema.org", "@type": "Recipe", "name": "Broccolini and Edamame Salad With Coconut", "description": "Sprouting broccoli (or broccolini) mixed with edamame and coconut is typical of the inventive combinations favored by the British chef Yotam Ottolenghi. After blanching, the vegetables are seasoned with black mustard seeds and curry leaves, which makes for an extremely aromatic and compelling dish that’s good warm or at room temperature. As for the fresh coconut, you can buy frozen freshly grated coconut at many international grocery stores. Otherwise, to use a fresh coconut, use a screwdriver to poke two or three holes, preferably in the eyes of the coconut. Drain any water, then use a hammer to bang along the equator of coconut until it splits open, and scoop out the flesh. Place flesh in a food processor fitted with a grating disc and grate. One coconut yields more flesh than you’ll need for this recipe; freeze the extra for up to three months.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/09/10/dining/10COOKBOOK1/10COOKBOOK1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "quick, snack", "keywords": "appetizer, side dish, broccoli, broccolini, coconut, curry, edamame", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 39}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 336, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "11 grams", "proteinContent": "11 grams", "saturatedFatContent": "8 grams", "sodiumContent": "48 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["14 ounces (2 bunches) purple sprouting broccoli or broccolini, trimmed", "1/2 pound haricots verts, trimmed", "7 ounces (about 1/2 cup) shelled frozen edamame", "4 tablespoons olive oil", "1 medium yellow onion, finely diced", "2 1/2 teaspoons black mustard seeds", "30 fresh curry leaves, or 40 dried curry leaves", "3 whole dried chiles", "Zest of 1 lime, plus 1 1/2 tablespoons lime juice, more to taste", "Zest of 1 lime", "2/3 cup cilantro leaves", "2/3 cup fresh coarsely grated coconut"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to boil. Add broccoli (you should have about 6 cups),  and haricots verts and blanch 3 to 4 minutes, until just tender but still with a bite. Use slotted spoon to transfer vegetables to colander and run under cold water. Pat dry, transfer to large bowl, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pot of water to a boil and add edamame. Blanch for 2 minutes. Transfer to colander, run under colder water, pat dry, and add to vegetables. Sprinkle 1/2 teaspoon salt over vegetables, stir and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons olive oil in sauté pan over medium-high heat. Add onion and 1/4 teaspoon salt; cook for 4 minutes until soft. Add black mustard seeds and when seeds begin to pop, add curry leaves, chiles and lime zest. Sauté for 2 minutes before pouring mixture over vegetables. Stir and let sit 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, add lime juice, cilantro and coconut, and drizzle with remaining olive oil. Gently stir and serve."}], "link": "https://cooking.nytimes.com/recipes/1016798-broccolini-and-edamame-salad-with-coconut"}