{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Peppers with Garlic Yogurt", "description": "This dish is very much in the Turkish spirit of mixing warm vegetables with cool, garlicky yogurt. Various types of peppers will work.\nThis is a typical Turkish way to use  grilled peppers. Turkish cuisine features  cool, garlicky yogurt with warm vegetables. You can use a mix of peppers for this (in Turkey, longish, thin-skinned green peppers are the norm), and you don’t have to stick to sweet peppers, though I prefer the sweet against the pungent yogurt.\n\nRoasted peppers will keep for a week in the refrigerator. They will continue to release liquid, which they can marinate in. Warm the peppers before serving, or serve them at room temperature with the topping.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/08/05/science/06recipehealth/06recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "mediterranean, turkish", "recipeCategory": "dinner, lunch", "keywords": "appetizer, side dish, fall, summer, gluten-free, halal, kosher, low cholesterol, low-sodium, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 39}, "recipeIngredient": ["1 1/2 pounds mixed sweet peppers", "Salt and freshly ground pepper to taste", "1 cup Greek yogurt or drained yogurt", "2 to 4 tablespoons fresh lemon juice, to taste", "2 to 4 garlic cloves, mashed in a mortar and pestle with a generous pinch of salt", "Extra virgin olive oil for drizzling", "Chopped fresh dill, parsley or mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill peppers over coals, under a broiler or over a gas flame until blackened. Remove from heat and place in a bowl. Cover bowl and allow  peppers to sit for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skin peppers, cut in half and remove seeds and membranes, holding  peppers over bowl to catch juices. Cut lengthwise into wide strips and place in a bowl. Strain juice into bowl with peppers and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mortar and pestle, purée garlic with a generous pinch of salt. Stir  into the yogurt. Add lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange peppers on a platter or on individual plates. Spoon yogurt on top, drizzle on a little olive oil, garnish with chopped herbs if desired  and serve."}]}