{"@context": "http://schema.org", "@type": "Recipe", "name": "Almost-Spit-Roasted Moroccan Lamb", "description": "For special occasions in Morocco, a whole lamb is turned on a spit over coals for hours, until the exterior is browned and crisp, with tender juicy meat within. Paula Wolfert, the great American authority on Moroccan food, gives this slow-roasting method for achieving similar delicious results in a home oven. Ask your butcher for front quarter of lamb (also called a half bone-on chuck). It is comprised of the neck, shoulder, front shank, and some ribs, all in one piece. Alternatively, ask for 2 large bone-in shoulder roasts. The lamb emerges succulent and fragrant, thanks to careful basting with butter and spices. Serve it with warm chick peas, cumin-flavored salt and a dab of spicy harissa.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/06/11/dining/11KITCH2/11KITCH2-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "8 to 10 servings", "recipeCuisine": "moroccan", "recipeCategory": "dinner, project", "keywords": "coriander seeds, cumin seeds, lamb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 252}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 159, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "10 grams", "sodiumContent": "73 milligrams", "sugarContent": "0 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 front quarter of lamb, about 10 to 12 pounds, or two 5- to 6-pound bone-in lamb-shoulder roasts", "Salt", "6 ounces unsalted butter, softened", "2 teaspoons cumin seeds, lightly toasted and finely ground", "2 teaspoons coriander seeds, lightly toasted and finely ground", "2 teaspoons paprika", "1/2 teaspoon pimentón", "6 garlic cloves, smashed to a paste with a little salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim lamb of extraneous fat, but leave a thin layer of fat covering the meat (or ask your butcher to do this). Use a sharp paring knife to cut slits all over the lamb. Lightly salt meat on both sides and place in a large roasting pan. Mix together butter, cumin, coriander, paprika, pimentón and garlic. Smear butter mixture over surface of meat. Allow meat to come to room temperature. Heat oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast lamb, uncovered, for 30 minutes, until it shows signs of beginning to brown. Reduce heat to 350 degrees. Continue roasting for 3 to 4 hours, basting generously every 15 minutes or so with buttery pan juices, until meat is soft and tender enough to pull away easily from bones and skin is crisp. If surface seems to be browning too quickly, tent loosely with foil and reduce heat slightly. In this case, remove foil, baste lamb and allow skin to crisp before removing from oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer lamb to a large platter or cutting board and serve piping hot. Encourage guests to tear pieces of lamb with fingers; alternatively, carve meat from bones and chop into rough pieces. Serve with cumin-flavored salt, harissa and warm chickpeas if desired."}], "link": "https://cooking.nytimes.com/recipes/1016562-almost-spit-roasted-moroccan-lamb"}