{"@context": "http://schema.org", "@type": "Recipe", "name": "White Tepary Bean and Potato Purée", "description": "Tepary beans are very small beans native to the Southwest and Mexico. They are among the most drought-tolerant foods in the world – they would have to be, grown as they are during the extremely hot, dry summers in the Sonora desert and southern Arizona. A dietary staple of native American tribes in Arizona, they are very high in protein and have a low glycemic index. There are two varieties, brown and white. I’m using small white tepary beans here; regular small white navy beans can be substituted. The teparies have a particularly sweet, meaty flavor. The purée, which is in some ways like a white bean brandade, isn’t a main dish, it is more of a comforting, high-protein stand-in for mashed potatoes. But it is substantial.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/10/health/14recipehealth/14recipehealth-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "Yield: Serves 6 to 8", "recipeCuisine": "southwestern", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian, fall, winter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 17}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 171, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "6 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "216 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound / 1 1/8 cups tepary beans or small white beans, soaked in 1 quart water for at least 4 hours or overnight", "1 onion, cut in half", "2 large garlic cloves, crushed", "1 bay leaf", "2 sprigs thyme", "Salt to taste", "3/4 pound Yukon gold or other fairly starchy potatoes, peeled and cut in large dice", "2 tablespoons extra virgin olive oil", "1/2 teaspoon red pepper flakes (more to taste)", "2 garlic cloves, minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain soaked beans and place in a large saucepan or Dutch oven with 1 quart water, the onion and crushed garlic cloves. Bring to a gentle boil, add bay leaf and thyme, cover, reduce heat and simmer 30 minutes. Add salt to taste and simmer another 30 minutes. Add potato and continue to simmer another 30 minutes to an hour, until beans and potatoes are very tender. Using tongs, remove onion, bay leaf and thyme sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large strainer over a bowl and drain beans and potato. Transfer to a food processor, add 1/2 cup of bean broth, and process until smooth and creamy. Taste and adjust salt. Add pepper if desired. Transfer to a wide bowl or an oven-proof serving dish. Thin out as desired with more broth. Serve hot or warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For optional garnish, heat olive oil over medium heat in a small frying pan and add garlic and red pepper flakes. When garlic begins to sizzle and smell fragrant, 30 seconds to a minute, remove from heat and drizzle over beans."}], "link": "https://cooking.nytimes.com/recipes/1016972-white-tepary-bean-and-potato-puree"}