{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp-Stuffed Mirlitons", "description": "The mirliton is a pale green squash with an end puckered up like a toothless granny. They are native to Louisiana, but if you grew up eating from certain Latin American culinary canons, you might know them as chayote. \nIn New Orleans, mirliton stuffed with shrimp is a dish both common and fancy. The chef David Guas, who grew up in Louisiana and now runs the Bayou Bakery in Washington, D.C., ate this version at his Granny Lilly’s holiday table in Amite, La. His recipe is a version of her original, but with a touch of heat from cayenne pepper as influenced by Justin Wilson, a relative who had a long-running cooking show on New Orleans public television that he punctuated with the tagline “I guaranteeeeee!”  \nUse the freshest shrimp you can find. Something from the Gulf of Mexico would lend authenticity. And be careful scooping the flesh from the mirlitons. The skin is thin and can break easily.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19LOUISIANA/19LOUISIANA-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 entree or 12 side dish servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "main course, mirliton, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 309, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "8 grams", "proteinContent": "14 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1346 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 mirlitons (chayote squash)", "1/4 tablespoon butter, softened", "1/2 teaspoon lemon juice", "1 1/2 teaspoons chopped parsley", "2 1/4 teaspoons salt", "1/4 teaspoon black pepper", "1/3 teaspoon cayenne", "1 tablespoon Worcestershire sauce", "3/4 cup bread crumbs", "1 tablespoon grapeseed, canola or other neutral oil", "3/4 cup sweet onions, chopped", "2 tablespoons bell peppers, diced small", "2 tablespoons celery, diced small", "2 1/4 teaspoons minced garlic (3 to 4 cloves)", "1/2 cup chopped green onions", "1/2 cup chopped tomatoes", "12 ounces of chopped shrimp (about 13 large, unpeeled shrimp)", "1 1/3 cups shrimp, chicken or vegetable stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut mirlitons in half and scoop out the large seed in the middle. Boil in salted water to cover for 25 minutes, or until tender when punctured with the tines of a fork. Be careful not to overcook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain and cool for 15 minutes, then scrape out insides into a colander to drain. Leave 1/4 inch of flesh inside shell, being careful not to puncture skin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop drained mirliton flesh and add to a medium bowl. Mix in butter, lemon juice, parsley, salt, pepper, cayenne, Worcestershire sauce and 1/2 cup bread crumbs; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Heat oil in a medium saucepan or cast-iron skillet over medium heat. Add onion, bell pepper and celery and sauté until almost translucent. Add garlic, green onion and tomatoes for just about 2 minutes. Add shrimp for 30 seconds to give them a touch of color. Quickly remove pan from heat and let it sit for 3 to 5 minutes to cool slightly. Fold sautéed ingredients into mirliton mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop stuffing mixture into each mirliton half. Place mirliton in an oven-safe 1 1/2-inch deep pan. You may need two pans. Dust top of each mirliton evenly with remaining bread crumbs. Pour stock into pans to a half-inch depth, before covering and baking. Cover pans tightly with foil and bake for 20 minutes. Remove foil and bake for an additional 15 minutes or until tops are lightly browned."}], "link": "https://cooking.nytimes.com/recipes/1016945-shrimp-stuffed-mirlitons"}