{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Beans With Tofu and Chiles", "description": "This crunchy, colorful stir-fry has an added kick from serrano chiles. I can’t resist buying an array of beans when they’re at summer farmers’ markets. I love to mix yellow and green beans in this crunchy, colorful stir-fry, but don’t hesitate to make it if all you can find is green. For added kick and color I threw in some serrano chiles from my garden that had ripened to bright red. Thai chiles will work too.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/07/15/science/14recipehealth/14recipehealth-articleLarge.jpg", "totalTime": "PT7M", "recipeYield": "4 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "dairy-free, halal, high fiber, high protein, kosher, low cholesterol, vegan, vegetarian, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 208}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 264, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "6 grams", "proteinContent": "19 grams", "saturatedFatContent": "2 grams", "sodiumContent": "580 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["One 14-ounce box firm tofu, drained and cut in 1/4-inch thick, 2-inch by 3/4-inch dominoes", "1 to 2 tablespoons soy sauce (to taste)", "1 tablespoon Chinese cooking sherry (Shaoxing rice wine) or dry sherry", "1/2 cup vegetable stock, chicken stock, or water", "1/4 to 1/2 teaspoon salt, to taste", "1/4 to 1/2 teaspoon sugar, to taste", "1 teaspoon cornstarch or arrowroot dissolved in 2 tablespoons vegetable stock, chicken stock, or water", "2 tablespoons peanut, canola, sunflower, or grape seed oil", "1 tablespoon minced garlic", "1 tablespoon minced ginger", "1 or 2 Thai or serrano chiles, minced (to taste)", "1 pound green beans, or 1/2 pound each yellow and green beans, stem ends trimmed", "1 bunch scallions, white and green parts separated", "1/2 cup chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain and dry tofu slices on paper towels. In a small bowl or measuring cup combine soy sauce, rice wine or sherry, and stock or water. Combine salt and sugar in another small bowl and cornstarch slurry in another. Have all ingredients within arm’s length of your pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or 12-inch steel skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Add 1 tablespoon of the oil to the wok or pan and swirl the pan so that the oil coats the sides, then add tofu and stir-fry until lightly colored, 1 to 2 minutes. Remove to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl in remaining oil, add garlic, ginger and chiles and stir-fry for no more than 10 seconds. Add beans and white parts of the scallions, and stir-fry for 2 minutes. Add salt and sugar, toss together and add soy sauce mixture. Stir-fry for 1 to 2 minutes, until vegetables are crisp-tender. Return tofu to the wok along with scallion greens, cilantro and cornstarch slurry. Stir together just until lightly glazed, and remove from heat. Serve with hot grains or noodles."}]}