{"@context": "http://schema.org", "@type": "Recipe", "name": "Wine-Braised Oxtail", "description": "Don’t be scared off by oxtail just because you may never have cooked it before. It’s as meaty and rich as short ribs, and just as straightforward to prepare. In this hearty braise, the meat is simmered in wine with carrots and celeriac. Feel free to substitute other vegetables for those roots. For example: mushrooms, celery stalks, turnips, rutabaga, winter squash chunks, and sweet potatoes would all be happy additions to the pot. Or leave the vegetables out and serve the whole thing over mashed potatoes, egg noodles or polenta. Like all braises, it can be made at least four days ahead, and gets better as it sits.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/02/06/multimedia/clark-oxtail/clark-oxtail-mediumThreeByTwo440.jpg", "totalTime": "PT4H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "celeriac, oxtail, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 349}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1210, "unsaturatedFatContent": "37 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "75 grams", "fiberContent": "7 grams", "proteinContent": "76 grams", "saturatedFatContent": "29 grams", "sodiumContent": "1276 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["2 1/2 teaspoons coarse kosher salt, more as needed\n", "2 teaspoons black pepper\n", "1/2 teaspoon ground allspice\n", "5 pounds beef oxtails, patted dry\n", "2 tablespoons extra-virgin olive oil\n", "4 shallots, peeled, trimmed and sliced lengthwise 1/4-inch-thick \n", "4 large carrots, peeled and cut into 3-inch lengths\n", "2 small or 1 large celeriac, peeled and cut into 2-inch chunks\n", "1 tablespoon tomato paste\n", "6 large garlic cloves, finely chopped\n", "1 bottle (750 milliliters) dry red wine\n", "1 cup chicken stock\n", "5 parsley sprigs, plus 1/4 cup chopped parsley leaves \n", "2 rosemary branches\n", "2 bay leaves\n", "Grated zest of 1 lemon\n", "Torn celery leaves, for garnish (optional) \n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine salt, pepper and allspice. Add oxtail to bowl and rub the mixture all over the meat. Cover with plastic wrap and refrigerate at least 2 hours or overnight. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat an 8-quart Dutch oven, or a heavy soup pot with a lid, over medium-high heat. Add oil and warm through. Add as many oxtail pieces as you can fit in a single layer without overcrowding the pot. Sear, turning occasionally, until the meat is uniformly golden brown all over, including the sides. Transfer meat to a plate; repeat until you’ve browned all the oxtail."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add shallot to the pan drippings and cook over medium heat until lightly caramelized, about 10 minutes. Add carrot and celery root and cook 5 minutes. Stir in tomato paste and two-thirds of the garlic (save the rest for garnish) and cook 1 minute. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Pour wine and stock into pot. Bundle parsley sprigs, rosemary branches and bay leaves with kitchen twine and drop into pot. Bring mixture to a simmer and cook over medium heat until liquid has reduced by half, about 15 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return oxtail to pot and bring to a simmer. Cover pot and transfer to oven. Cook, turning oxtails every 30 minutes, until meat is fork tender, 3 to 3 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer oxtails to a plate. Spoon off fat from surface of pan juices and discard (there will be a lot of it). Toss oxtails with remaining pan gravy. Taste and adjust seasonings if necessary. In a small bowl, toss together chopped parsley, garlic, lemon zest and a pinch of salt. Scatter mixture over oxtails and garnish with the celery leaves, if using, before serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Wine-Braised Oxtail", "description": "Melissa Clark braises oxtail with red wine, carrots and celery root for flavorful, fork-tender meat.", "thumbnailUrl": "https://static01.nyt.com/images/2014/02/06/multimedia/clark-oxtail/clark-oxtail-mediumThreeByTwo440.jpg", "uploadDate": "2014-02-07T21:59:57.000Z", "duration": "PT3M30S"}}