{"@context": "http://schema.org", "@type": "Recipe", "name": "Du Pont Turkey With Truffled Zucchini Stuffing", "description": "Turkey was served often at Winterthur, an ancestral home of the du Pont family, in Delaware. The birds were raised on the estate, in great enough numbers for the family to give them to employees at Thanksgiving and Christmas. The land was purchased in 1810 by Eleuthère Irénée du Pont; the house was built in 1839 and opened to the public as a museum of American decorative arts in 1951. Many of its recipes survive, among them one for truffled turkey and stuffing, which Pauline Foster du Pont, who was married to Eleuthère Irénée's grandson, included in her personal handwritten cookbook.\n\nFirst, three pounds of zucchini were boiled, then peeled, mashed and seasoned with salt, pepper and butter. This was the stuffing. Then the contents of an entire can of black truffles were sliced and slipped under the turkey’s skin. To serve, the meat was carved and then put back in its skin so that the turkey appeared to be whole. In this adaptation, the bird is rubbed with truffle butter, and the zucchini (finely chopped, not mashed) is bolstered with bread crumbs and more truffle butter. But it does not suggest replicating the reassembled turkey. The du Ponts had staff for that. You will have enough to do at Thanksgiving without attempting it.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19DELAWARE/19DELAWARE-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "main course, truffle butter, turkey, zucchini", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 596, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "3 grams", "proteinContent": "68 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1375 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "3 medium onions, chopped fairly fine", "6 cloves garlic, minced", "Salt", "1 teaspoon ground ginger", "6 tablespoons black truffle butter", "3 pounds zucchini, trimmed and chopped fairly fine", "1 1/2 cups dry whole-wheat bread crumbs", "1/4 cup finely chopped flat-leaf parsley", "2 tablespoons finely chopped mint leaves", "Ground black pepper", "1 10- to 12-pound turkey, preferably heritage breed, at room temperature", "Juice of 1 lemon", "1/4 cup flour (for gravy, optional)", "1/2 cup stock or white wine (for gravy, optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large sauté pan. Add onion and garlic and cook on low about 10 minutes, until soft. Add 1 teaspoon salt and the ginger. Stir in 4 tablespoons of the truffle butter. Fold in the zucchini. Cook on medium-low, stirring, until zucchini softens and most of the liquid it gives off has evaporated, about 7 minutes. Remove from heat. Stir in bread crumbs, parsley and mint. Season to taste with salt and pepper. Store in refrigerator if not using immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 3 hours before serving time, heat oven to 400 degrees. Rub the outside of the turkey with remaining truffle butter. Brush the inside with lemon juice. Loosely stuff the turkey with the zucchini mixture. Truss or skewer the cavity."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place turkey on a roasting rack in a roasting pan. Roast 45 minutes. Baste with pan drippings. Reduce heat to 350 degrees and roast about 1 hour 15 minutes longer, until an instant thermometer registers 155 degrees in the thigh. Baste from time to time. Remove turkey from the oven. Scoop out zucchini stuffing, place in a serving dish and keep warm. Let turkey rest for 20 minutes before carving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make gravy, if desired: Place roasting pan over medium heat. Whisk 4 tablespoons flour into pan drippings, scraping the pan. Whisk in 1/2 cup stock, white wine or water. Add any juices from the carving board. Simmer until gravy is as thick as heavy cream. Season with salt and pepper."}]}