{"@context": "http://schema.org", "@type": "Recipe", "name": "Soba Noodles With Shiitakes, Broccoli and Tofu", "description": "Soba noodles are Japanese, not Chinese, but I love using them in Chinese stir-fries. They have a wonderful nutty flavor, and buckwheat has a lot going for it nutritionally – it is a good source of manganese, copper and magnesium, and it is also high in phytonutrients. To make a quick vegetable stock, simmer the shiitake mushroom stalks in a small amount of water for about 20 minutes.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/02/04/science/06recipehealth/06recipehealth-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, halal, healthy, high fiber, kosher, low cholesterol, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 373}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 252, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "3 grams", "proteinContent": "11 grams", "saturatedFatContent": "1 gram", "sodiumContent": "498 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup chicken or vegetable stock", "1 tablespoon rice wine or dry sherry", "1 tablespoon soy sauce (more to taste)", "1/2 teaspoon sugar", "Salt to taste", "1 tablespoon minced garlic", "1 tablespoon minced ginger", "1/4 to 1/2 teaspoon red pepper flakes, or 1 to 2 serrano or Thai chiles, minced", "8 ounces soba noodles", "2 teaspoons sesame oil", "1/2 pound baby broccoli", "2 tablespoons grapeseed oil, peanut oil, sunflower oil or canola oil", "1/2 pound tofu, cut in dominoes or small dice", "6 ounces fresh shiitake mushrooms, stemmed (discard stems or use for stock), caps sliced", "1 bunch scallions, thinly sliced, dark green parts separated", "1/2 cup coarsely chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine stock, soy sauce, rice wine or sherry, sugar and salt to taste in a small bowl. Stir until sugar and salt dissolve. Combine garlic, ginger, and pepper flakes or minced chile in another bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large saucepan or pot of water to a boil, add salt to taste and baby broccoli. As soon as water comes back to a boil (about 1 minute), use a skimmer to remove broccoli and transfer it to a bowl of cold water. Drain in a colander, then on paper towels. Cut stems away from florets and slice about 1/2 inch thick. Bring water back to a boil and cook soba. Drain and toss with 2 teaspoons sesame oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place all ingredients within reach of your wok. Heat a 14-inch flat-bottomed wok over high heat until a drop of water evaporates within a second or two when added. Swirl in 1 tablespoon of the oil and add tofu. Stir-fry 1 to 2 minutes, until it begins to color, and remove to a plate. Add remaining oil and garlic, ginger and chile. Stir-fry for no more than 10 seconds and add mushrooms. Stir-fry for 1 minute and add broccoli and the light parts of the scallions. Stir-fry 1 to 2 minutes. Add the noodles, tofu and the stock mixture. Reduce  heat to medium and stir-fry 1 to 2 minutes. Add cilantro and the dark green part of the scallions, stir-fry another 30 seconds to a minute, until well combined, and serve."}], "link": "https://cooking.nytimes.com/recipes/1016016-soba-noodles-with-shiitakes-broccoli-and-tofu"}