{"@context": "http://schema.org", "@type": "Recipe", "name": "Mini Bell Peppers Stuffed with Goat Cheese", "description": "This side dish is a way to take advantage of the mini sweet peppers that are showing up by the bag in supermarkets. They should be roasted briefly and not peeled.\nMy oldest brother, Dan, and his wife, Margaret, hosted a wonderful party in Minneapolis in May to celebrate their 50th anniversary. The savory food on the gorgeous vegetarian buffet was catered by the well-known Minneapolis restaurant Lucia’s, whose chef/owner, Lucia Watson, is a friend of the family. One of my favorite items was minipeppers stuffed with goat cheese, the inspiration for this recipe. Mini sweet peppers have begun to proliferate in supermarkets; the ones I’m finding come in 12-ounce bags, roughly 12 to a bag (though they range in size, some being about two inches long, others about three), usually a mix of red and yellow. They are thin skinned, with very small seedpods and membranes. I roast them briefly to soften them and sweeten the flavor. There is no need to peel them,   and they should not be roasted so long that the skin loosens. You will probably have a little filling left over, but it’s nice as a spread so it won’t go to waste. These will keep for 3 days in the refrigerator. Bring to room temperature before serving.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/08/05/science/05recipehealth/05recipehealth-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "fall, summer, gluten-free, halal, kosher, low-carb, low sugar, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 87}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 97, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "165 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound mini sweet peppers (1 package, usually 12) or small lipstick peppers", "6 ounces goat cheese (1/2 of a 12-ounce log)", "1/3 cup low-fat (not nonfat) cottage cheese", "3 tablespoons plain low-fat (not nonfat) Greek yogurt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Line a sheet pan with foil. Place peppers on the baking sheet and roast 8 to10 minutes (small peppers – less than 2 inches long – will cook faster), turning them over halfway through. The peppers should be soft but not charred, except perhaps in a few spots. Remove from heat and allow to cool. If there are some larger peppers in the bag and they haven’t softened in 10 minutes, return to oven for another 5."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While peppers are cooling, make filling. Combine goat cheese, cottage cheese and yogurt in a food processor fitted with a steel blade and process until mix is very smooth, at least one minute. Scrape down sides of bowl and process for another minute. Transfer to a pastry bag fitted with a 3/8-inch star tip."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When peppers have cooled, slice off ends just below the shoulders. Carefully remove any seeds and membranes. The peppers should be intact, but sometimes, they split down one side. Place any that have not split upright in a small glass or cup to facilitate filling, and pipe in goat cheese mix. Lay those that have split on a plate, pipe on the filling and close the pepper around the filling. Arrange  stuffed peppers on a plate or platter. Serve at once, or chill until 30 minutes before serving. Bring to room temperature so  cheese is soft and creamy."}], "link": "https://cooking.nytimes.com/recipes/1016711-mini-bell-peppers-stuffed-with-goat-cheese"}