{"@context": "http://schema.org", "@type": "Recipe", "name": "Savory Potato Tart", "description": "We all love a rich, creamy French potato gratin, but for a special occasion, or just for fun, make this version, which is encased in buttery flaky pastry so the gratin becomes a savory tart. Serve a small slice alongside roasted meats, or a larger portion for a vegetarian lunch, accompanied by a green salad. If you want to make it a few hours ahead, or even a day before, it reheats beautifully.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/10/22/dining/22KITCHEN4/1022KITCHEN4-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "8 to 10 servings", "recipeCuisine": "french", "recipeCategory": "dinner, lunch, pies and tarts", "keywords": "appetizer, main course, side dish, butter, flour, potato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 270}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 386, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "15 grams", "sodiumContent": "423 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 cups/250 grams all-purpose flour, plus more for dusting", "1/2 teaspoon salt", "1/2 pound (2 sticks) cold unsalted butter cut in 1/2-inch chunks", "1/2 cup ice water", "2 pounds medium yellow-fleshed potatoes, such as Yukon Gold, peeled", "1 1/4 cups crème fraîche", "1 tablespoon kosher salt", "1/2 teaspoon black pepper", "Pinch of grated nutmeg", "2 garlic cloves, minced", "2 teaspoons chopped fresh thyme", "1 egg yolk", "1 tablespoon cream or crème fraîche"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the pastry:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put flour and salt in a mixing bowl (or use a food processor or a stand mixer with paddle attachment). Add half the butter and mix well, until mixture resembles coarse meal. Add remaining butter chunks and the water and mix until dough comes together. Remove dough, divide into two equal pieces and dust with flour. Quickly form each piece into a ball, then press down to make two 1-inch-thick disks. Wrap and refrigerate for at least an hour. (May be made a day in advance or frozen for up to 2 weeks.)"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the filling:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice potatoes as thinly as possible, using a sharp knife, mandolin or food processor. Put potato slices in a large bowl and add crème fraîche, salt, pepper, nutmeg, garlic and thyme. Mix well with hands, making sure all slices are coated and seasoning is well distributed. Set aside."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the tart:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. On a well-floured surface, roll out each pastry disk to 12 1/2 inches in diameter. Line an 11-inch fluted French tart pan (with removable bottom) with one sheet of pastry, pressing in at the sides and leaving a 1-inch overlap hanging."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the potatoes to the tart pan in even layers, making sure to scrape in all remaining crème fraîche with a rubber spatula. Lay the second pastry sheet on top. With a paring knife, trim excess dough and crimp the edges all around to seal. Make a few slits in the dough to allow steam to escape. Line a baking sheet with aluminum foil and set tart on it. Stir egg yolk and cream together and paint the top of the tart generously."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 10 minutes at 425 degrees, then reduce heat to 350 degrees and bake for 1 hour more, until top is golden and potatoes are tender when probed with a paring knife. Cool slightly, then set tart pan over a small, sturdy bowl, so that the bottom of the tart pan is elevated and the fluted ring comes off. Carefully transfer tart to a plate. Serve small slices, hot or at room temperature. May be cooled completely and reheated if desired."}]}], "link": "https://cooking.nytimes.com/recipes/1016882-savory-potato-tart"}