{"@context": "http://schema.org", "@type": "Recipe", "name": "Thai Rice Soup With Pork-Cilantro Meatballs", "description": "Jok, also called congee, is a rice porridge that’s like the oatmeal of Asia -- a soft, soothing, filling breakfast that can be sparked with add-ins and toppings for flavor and crunch. Before dawn in Bangkok, jok vendors begin the battle to make the juiciest meatballs, the tiniest ginger matchsticks and the liveliest pickled fresh chiles. This recipe, which also makes a great lunch on a chilly weekend morning, is adapted from two cooks: Leela Punyaratabandhu, author of Simple Thai Food, who makes a vendor-style, puddingy jok; and Chrissy Teigen, the Thai-American supermodel, who makes a simpler version, adapted from her mother Vilaluck’s home recipe.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/07/16/dining/16SUPERMODEL_CONGEE/16SUPERMODEL_CONGEE-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, lunch", "keywords": "cilantro, oyster", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 494}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 305, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "1 gram", "proteinContent": "16 grams", "saturatedFatContent": "5 grams", "sodiumContent": "390 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["2 large cloves garlic, peeled", "2 tablespoons finely chopped cilantro roots or stems", "1/2 teaspoon white peppercorns", "1 pound ground pork", "1 tablespoon oyster sauce", "1 teaspoon soy sauce", "1 cup jasmine or long-grain rice", "6 cups light chicken stock (see note)", "6 to 8 eggs, optional", "Red chile powder (preferably Thai, but ancho or Aleppo will do)", "1  2-inch piece fresh ginger, peeled and cut into matchsticks", "2 scallions, white and green parts, finely chopped", "1/4 cup loosely packed fresh cilantro leaves", "Fish sauce and sriracha, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the meat mixture:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pound or grind the garlic, cilantro and white pepper together into a coarse paste. Transfer to a bowl and add the pork, oyster sauce and soy sauce. Mix well, cover and refrigerate at least 1 hour or overnight."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the soup:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy pot, combine the rice and stock and bring to a gentle boil, then reduce to a simmer. Simmer, uncovered, for 30 minutes, stirring occasionally and scraping up any starch from the bottom to prevent scorching. Add 2 cups hot water and simmer 30 minutes more. Add another 2 cups hot water and simmer 20 to 30 minutes more, until the rice begins to fall apart in the soup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "From the refrigerator, remove the dumpling mixture and the eggs, if using. Heat your serving bowls. Adjust the heat under the soup so that it bubbles gently. Pinch off pieces of the meat mixture to make bite-size balls, dropping them one at a time into the soup. When all of the meatballs have firmed up and turned opaque, about 2 to 3 minutes after adding the last one, the soup is ready."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, scoop a ladleful of  soup into a  bowl. Crack one egg, if using, into the  bowl. Gently ladle more hot soup over the raw egg, covering it completely. After about 4 minutes, the eggs will be softly cooked. Dust  each bowl with chile powder and sprinkle with ginger, scallions and cilantro. Serve immediately, passing fish sauce and sriracha at the table. Each diner breaks the egg yolk and scoops up the egg  with the soup. \n\nNote: Use a very light-bodied chicken stock. If using prepared or canned broth or bouillon cubes, dilute with water until the salt and chicken flavors are very mild."}]}], "link": "https://cooking.nytimes.com/recipes/1016651-thai-rice-soup-with-pork-cilantro-meatballs"}