{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Root Vegetables With Polenta", "description": "In this comforting, perfect winter dinner I roast the vegetables and make the polenta in the oven at the same time. To accommodate the temperature requirements of each element of the dish, I use a slightly higher temperature than I usually use for polenta and I roast the vegetables at a lower temperature for longer. I top the polenta with a ladleful of marinara sauce, and spoon the vegetables on top. You could serve the polenta with only the roasted vegetables as well, so I have made the marinara sauce optional.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/04/science/04recipehealth/04recipehealth-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner", "keywords": "fall, winter, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 280}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 264, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "6 grams", "proteinContent": "7 grams", "saturatedFatContent": "4 grams", "sodiumContent": "859 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 large carrots (3/4 to 1 pound), peeled and cut into 3/4-inch pieces (quarter at the fat ends, cut in half at the thin ends, then cut in thick slices)", "1 large parsnip (about 1/2 pound), quartered, cored and cut in 3/4-inch pieces", "1 medium-size fennel bulb, quartered, cored and cut in 3/4 inch pieces", "1 medium or large red onion, cut in large dice", "2 tablespoons extra virgin olive oil", "Salt and freshly ground pepper to taste", "Chopped fresh rosemary, thyme or sage, about 2 teaspoons (optional)", "1 cup polenta", "1 quart water", "1 teaspoon salt", "1 tablespoon unsalted butter", "1/2 cup freshly grated Parmesan (optional but recommended)", "1 batch marinara sauce (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Line a sheet pan or a baking dish with parchment or foil. Toss vegetables with the olive oil and salt and pepper to taste. Add fresh herbs if using. Spread vegetables in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine polenta, water, and salt in a 2-quart baking dish and stir together. Place polenta and vegetables in the oven. If you can’t fit both pans on the same (middle) rack, place vegetables on a lower rack. Roast vegetables for 30 to 40 minutes, stirring every 10 minutes or until soft and beginning to caramelize. Remove from the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If serving this with marinara sauce, make the sauce while the vegetables and polenta are in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue to bake the polenta until it has been in the oven for 40 to 45 minutes and has absorbed the water. Remove from oven and stir in butter. Use a fork or a spatula to stir the polenta well, and return to oven for 5 to 10 more minutes. Remove from oven and stir again. Carefully taste a little bit of the polenta; if it is not completely soft, return to the oven for 5 to 10 more minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove polenta from oven and stir in 1/3 cup grated Parmesan, if using. Immediately spoon polenta onto plates and make a depression in the middle. Ladle on some marinara sauce and top with a generous spoonful of roasted vegetables. Sprinkle on remaining Parmesan and serve."}], "link": "https://cooking.nytimes.com/recipes/1016098-roasted-root-vegetables-with-polenta"}