{"@context": "http://schema.org", "@type": "Recipe", "name": "Bright Green Pesto and Its Many Uses", "description": "I’ve been making pesto forever and have never been able to keep it bright green. It has such promise, such flavor, and I know that the pasta or whatever else I use it in will taste wonderful. But I’ve always been frustrated by how quickly the basil oxidizes and the color goes from bright green to drab. So I decided to try blanching the leaves very briefly to see if that would solve the problem and voilà! It did. You  need to blanch the basil for only  five seconds, and you don’t want to blanch it for more than 10. Doing this  leaches out a wee bit of the basil’s vivid flavor, but not enough to change that of the  pesto significantly. The texture and color are wonderful, and the pesto will keep  for several days in the refrigerator (but it’s best to wait until you’re ready to use the pesto before adding the garlic and cheese).", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/09/09/science/08recipehealth/08recipehealth-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "2/3 cup", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner, lunch", "keywords": "appetizer, main course, side dish, fall, spring, summer, winter, gluten-free, halal, kosher, low-carb, low cholesterol, low sugar, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 110}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 175, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "0 grams", "proteinContent": "4 grams", "saturatedFatContent": "3 grams", "sodiumContent": "122 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2 cups tightly packed, fresh basil leaves", "Salt to taste", "2 tablespoons  lightly toasted pine nuts or untoasted chopped walnuts", "1/3 cup extra-virgin olive oil", "2 garlic cloves, halved, green shoots removed", "1/3 to 1/2 cup  freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium-size saucepan full of water to a boil while you rinse basil leaves. Fill a bowl with ice water and place it next to the saucepan with a skimmer close by (a Chinese skimmer is good for this). When water comes to a boil, salt generously and add basil leaves. Push them down into the water with the back of a skimmer to submerge, count to five, then remove immediately with skimmer and transfer to ice water. Drain and squeeze out excess water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pine nuts or walnuts in a food processor and process until finely ground. Add blanched basil and kosher salt to taste (I use 1/4 to 1/2 teaspoon) and process until finely chopped. With machine running, slowly add olive oil and continue to process for a full minute, or until the mix is reduced to a fine purée. Transfer to a bowl. You should have about 1/2 cup of purée ."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to use the pesto, purée garlic in a mortar and pestle, or put through a garlic press, and stir into the pesto (or if using a mortar and pestle, add the puréed basil to the mashed garlic in mortar and work garlic and pesto together with pestle). Add Parmesan  and stir in. The pesto will condense when you add the cheese, so even though you’ve added a half-cup of cheese to the purée, you will end up with about 2/3 cup of pesto. Follow the instructions in recipes for thinning out with water."}], "link": "https://cooking.nytimes.com/recipes/1016791-bright-green-pesto-and-its-many-uses"}