{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Wheat Focaccia With Tomatoes and Fontina", "description": "", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/07/22/science/22recipehealth/22recipehealth-articleLarge-v2.jpg", "totalTime": "PT4H30M", "recipeYield": "1 large focaccia, 12 generous servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "focaccia", "aggregateRating": null, "recipeIngredient": ["1 teaspoon/4 grams active dry yeast", "3/4 cup/90 grams all-purpose flour", "1 teaspoon/4 grams active dry yeast", "3 tablespoons extra-virgin olive oil, more for oiling bowls and pans", "1 1/4 cups/155 grams unbleached all-purpose flour", "2 cups/250 grams whole wheat or durum flour", "1 3/4 teaspoons/12 grams fine sea salt", "2 tablespoons extra-virgin olive oil", "6 ounces/180 grams thinly sliced or grated fontina", "1 pound/450 grams fresh ripe tomatoes, sliced", "Coarse sea salt, to taste (optional)", "Chopped, slivered or torn fresh basil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the sponge:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl or the bowl of a stand mixer, combine yeast and 1/2 cup/120 milliliters lukewarm water. Stir to dissolve. Whisk in flour. Cover with plastic wrap and let rise in a warm place until bubbly and doubled in volume, about 45 minutes."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the dough:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together yeast and 1 cup/240 milliliters lukewarm water in a small bowl and let stand until creamy, a few minutes. Add to sponge, along with the olive oil. If using a stand mixer, add flours and salt and mix, with the paddle attachment, until ingredients are combined, 1 to 2 minutes. Change to the dough hook and knead on medium speed for 8 minutes. The dough should come together and slap against the sides of the bowl; it will be slightly tacky. If making dough by hand, whisk in all-purpose flour, then fold in salt and whole wheat flour, 1 cup at a time. Scrape dough onto a lightly floured work surface and knead for 8 to 10 minutes, until soft and velvety. Return to bowl (oil bowl lightly with olive oil first)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover bowl tightly with plastic wrap and let dough rise in a warm spot until doubled, about 11/2 hours. (Dough can be held in the refrigerator for up to 5 days; first punch it down, oil it lightly and seal in a plastic bag. Bring to room temperature before proceeding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a 12-x17-inch sheet pan with olive oil. Line with parchment and oil the parchment. Turn dough onto parchment. Oil or moisten your hands, and press out dough until it just about covers the pan. Dough may be sticky. Cover with a towel and let it relax for 10 minutes, then continue to press it out until it reaches edges of pan. Cover with a damp towel and let rise in a warm spot for 45 minutes to an hour, or until dough is full of air bubbles."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the topping:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "30 minutes before baking, heat oven (preferably with a baking stone in it) to 425 degrees. Lightly oil your fingertips, then use them to dimple the dough, pressing down hard to make indentations. Drizzle olive oil over dough.  Arrange cheese over surface. Top with tomatoes, then sprinkle with sea salt if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pan in oven (on baking stone, if using). Use a spray bottle to spray oven with water three times during the first 10 minutes of baking. Bake 20 to 25 minutes, until edges are crisp and top is golden. If you wish, remove focaccia from pan and bake directly on stone for the last 10 minutes of baking. Remove from pan at once and cool on a rack. Sprinkle basil over top. For a softer focaccia, cover with a towel when you remove it from the oven. Serve warm or at room temperature."}]}], "link": "https://cooking.nytimes.com/recipes/1016672-whole-wheat-focaccia-with-tomatoes-and-fontina"}