{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Herbs Omelet", "description": "This is called a “fines herbes” omelet in France, and usually contains finely minced parsley and chives, sometimes tarragon or chervil as well. The herbs should be sweet ones rather than bitter or sharp; basil, mint, and dill would also work. This is a classic French rolled omelet, served hot, right out of the pan, an utterly satisfying quick meal. The classic French omelet is made with butter, but in the Mediterranean a healthier version is made with olive oil. Use a nonstick pan for this.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/07/30/health/nutrition/30recipehealth.ready/30recipehealth.ready-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "2 rolled omelets, serving 2", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 251, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "1 gram", "proteinContent": "15 grams", "saturatedFatContent": "5 grams", "sodiumContent": "326 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["4 large or extra-large eggs", "Salt and freshly ground pepper", "1 tablespoon plus 1 teaspoon milk", "3 tablespoons minced chopped herbs, such as parsley, dill, chives, tarragon, chervil, basil, mint (use no more than 3)", "1 tablespoon plus 1 teaspoon extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Break 2 eggs into a bowl and beat with a fork or a whisk until frothy. Add salt  and freshly ground pepper to taste (about 1/8 teaspoon salt), and 2 teaspoons milk. Whisk half the herbs into the eggs and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat an 8-inch nonstick omelet pan over medium-high heat. Add 2 teaspoons of the olive oil. When the oil feels hot when you hold your hand above it, pour in the eggs, scraping every last bit into the pan. Swirl the pan to distribute the eggs evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the omelet with the spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking. As soon as the eggs are set on the bottom, jerk the pan quickly away from you then back towards you so that the omelet folds over on itself. Tilt the pan and roll out onto a plate. Repeat with the remaining eggs and herbs, and serve."}]}