{"@context": "http://schema.org", "@type": "Recipe", "name": "Frittata Template", "description": "There is a technique to making a frittata that is always the same, no matter what the filling. The eggs are beaten with salt, pepper, and sometimes a little bit of milk, the filling stirred in, and the omelet cooked in a wide skillet. You can use cooked vegetables, chopped herbs, leftover vegetable stews like ratatouille, fresh tomato sauce, even leftover risotto to fill a frittata. Frittatas and omelets are a great way to stretch a small amount of leftovers into a meal.\nTemplates will be useful to you, because you may have a different vegetable or filling on hand from the one called for in a given frittata recipe. Using the template, you’ll be able to make the frittate, substituting what you have.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/07/28/health/nutrition/28eggs.omeletonly.ready/28eggs.omeletonly.ready-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "one 2- to 10-egg flat omelet", "recipeCuisine": "mediterranean", "recipeCategory": "", "keywords": "low-fat, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 111}, "recipeIngredient": ["2 to 10 large or extra-large eggs", "Salt and freshly ground pepper", "1 to 3 tablespoons low-fat milk", "1 tablespoon extra virgin olive oil", "The filling of your choice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl. Stir in the salt, pepper, milk, and the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium-high heat in a heavy nonstick skillet. Use an 8-inch skillet for 2 eggs, a 10-inch skillet for 4 to 8 eggs, and a 12-inch skillet for 10 eggs. Hold your hand above it; it should feel hot. Drop a bit of egg into the pan and if it sizzles and cooks at once, the pan is ready. Pour in the egg mixture. Swirl the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the frittata with the spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking. A 2-egg omelet will be done quickly, with just the tilting of the pan and letting the eggs run underneath until it is no longer or only slightly moist on the top. Once it is set, slip it out of the pan onto a plate. It’s fine to leave the top a little runny (that’s the way they like them in France.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "A larger frittata, one cooked in a 10- or 12-inch pan, must be covered and cooked over low heat. Turn the heat down to low, cover (use a pizza pan if you don’t have a lid that will fit your skillet), and cook 5 to 10 minutes, depending on the number of eggs, shaking the pan gently every once in a while. From time to time remove the lid and loosen the bottom of the frittata with a wooden spatula, tilting the pan, so that the bottom doesn’t burn. It will however turn a deep golden brown. The eggs should be just about set; cook a few minutes longer if they’re not."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "A large frittata usually requires finishing underneath the broiler. Heat the broiler. Place the pan under the broiler, not too close to the heat, for 1 to 3 minutes, watching very carefully to make sure the top doesn’t burn (at most, it should brown very slightly, and it will puff under the broiler). Remove from the heat, shake the pan to make sure the frittata isn’t sticking, and allow it to cool for at least 5 minutes and for up to 15. Loosen the edges with a wooden or plastic spatula. Carefully slide from the pan onto a large round platter. Cut into wedges or into smaller bite-size diamonds. Serve hot, warm, at room temperature, or cold."}], "link": "https://cooking.nytimes.com/recipes/1016415-frittata-template"}