{"@context": "http://schema.org", "@type": "Recipe", "name": "Barley and Herb Salad With Roasted Asparagus", "description": "When fat stalks of asparagus come into the markets, what better thing to do with them than roast or grill them? What’s more, the California chef and teacher John Ash, demonstrating a recipe at the recent “Healthy Kitchens, Healthy Lives” conference at the Culinary Institute of America in Napa Valley – an event that bridges health care, nutrition science and cooking – insists that not only does asparagus taste better when it’s not cooked in or near water, but also that it doesn’t cause that distinctive odor in urine many people experience after eating it. I can’t vouch for the latter claim, but asparagus is intensely delicious when you roast it And it’s a beautiful addition to this lemony mix of barley and herbs. For the herbs, I like to mix sweet (tarragon, chives) with bitter (parsley, marjoram, thyme). Cooked barley will keep for 3 days in the refrigerator and can be frozen. The dressed grains will be good for 2 to 3 days.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/05/science/07recipehealth/07recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4 as a main dish salad, 6 as a side", "recipeCuisine": "mediterranean", "recipeCategory": "", "keywords": "appetizer, main course, side dish, dairy-free, halal, high fiber, kosher, low cholesterol, low-sodium, low sugar, nut-free, vegan, vegetarian, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 47}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 449, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "12 grams", "proteinContent": "10 grams", "saturatedFatContent": "4 grams", "sodiumContent": "895 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup barley", "3 cups water", "Salt, preferably kosher salt, to taste", "1 pound thick-stemmed asparagus", "2 tablespoons extra- virgin olive oil", "Freshly ground pepper to taste", "1/2 cup chopped fresh herbs, such as parsley, marjoram, chives, tarragon and thyme", "1 1/2 tablespoons fresh lemon juice", "1 tablespoon sherry vinegar", "Salt to taste", "1 teaspoon lemon zest", "1 small garlic clove, puréed", "1/2 teaspoon dry mustard or 1 teaspoon Dijon mustard", "6 tablespoons extra- virgin olive oil", "Lemon wedges or sliced lemon for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 3- quart saucepan over medium-high heat and add barley. Toast in the pan, shaking pan or stirring grains until they begin to smell a little bit like popcorn. Add water and bring to a boil. Add salt to taste (I suggest 1/2 to 3/4 teaspoon for 1 cup barley), reduce heat, cover and simmer 45 to 50 minutes, until barley is tender (it will always be chewy). Drain off any liquid remaining in the pot through a strainer (set it over a bowl if you think you might want to use the barley water in a stock or risotto – it’ll keep for a day in the refrigerator).  Shake strainer and return barley to the pot. Cover pot with a clean dishtowel and return the lid. Allow barley to sit for 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, roast asparagus and make dressing. Preheat oven to 425 degrees F. Line a baking sheet with parchment. Snap off woody ends of the asparagus and place on parchment-lined baking sheet. Add olive oil and salt and pepper to taste and toss together until all of the asparagus is coated with oil (I do this with my hands). Make sure that asparagus is in one layer on the baking sheet in the pan and place in oven. Roast for about 12 minutes, or until tender and beginning to shrivel. It should be browned in spots. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together lemon juice, vinegar, salt, lemon zest, garlic, and mustard. Whisk in olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer cooked barley to a large bowl. Add herbs and vinaigrette and toss together until barley is evenly coated with dressing. Arrange on a platter or on plates. Lay stalks of roasted asparagus on over the top, and serve."}], "link": "https://cooking.nytimes.com/recipes/1016220-barley-and-herb-salad-with-roasted-asparagus"}