{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta with Spicy Tomato Sauce", "description": "The sauce for this pantry pasta is a vegetarian take on arrabbiata and amatriciana sauces, two spicy tomato sauces from Southern Italy that include pancetta or guanciale. The authentic versions would call for grated Pecorino Romano cheese, but I’ve already broken with tradition here, so use either Pecorino of Parmesan.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/10/15/health/nutrition/15recipe.health.ready/15recipe.health.ready-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 99}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 366, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "5 grams", "proteinContent": "14 grams", "saturatedFatContent": "2 grams", "sodiumContent": "517 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 (28-ounce) can chopped tomatoes in juice", "1 tablespoon extra virgin olive oil", "2 garlic cloves, minced", "1 small dried red chili pepper, crumbled, or 1/4 teaspon red pepper flakes", "Salt to taste", "1 teaspoon dried oregano or 2 teaspoons slivered fresh basil", "1 pound penne, bucatini, pericatelli, or spaghetti", "1/2 cup freshly grated Pecorino Romano or Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large pot of water for the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulse the chopped tomatoes in a food processor fitted with the steel blade, or pass through the medium blade of a food mill with their juice before you begin. Heat the oil over medium heat in a large, wide nonstick skillet or saucepan and add the garlic and crumbled chili (or flakes). Cook, stirring, for 30 seconds to a minute, until the garlic is translucent and begins to smell fragrant, and add the tomatoes and their juice, salt, and oregano if using. Stir and turn up the heat. When the tomatoes begin to bubble, lower the heat to medium and cook, stirring often, until thick and fragrant, 15 to 25 minutes. Taste and adjust seasonings. Keep warm while you cook the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pasta water comes to a boil, add a tablespoon of salt and the pasta. Cook the pasta al dente, following the timing instructions on the package but checking a minute or two before the time on the package. When the pasta is done, transfer to the pan with the sauce, add the basil if using, and toss together over medium heat until it is well coated with the sauce. Add half the cheese, toss together and serve, passing the remaining cheese at the table."}], "link": "https://cooking.nytimes.com/recipes/1016480-pasta-with-spicy-tomato-sauce"}