{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato and Pea Patties With Indian Spices", "description": "This is another one of Suvir Saran’s ideas, which I have adapted. The whole \nspices in this mix contribute not only amazing flavors, but texture as well. I used a combination of light-fleshed sweet potatoes and red boiling potatoes: I loved the sweetness of the sweet potatoes with the spices, but the mix needed something starchier to hold it together, so I added some red potatoes.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/05/13/science/14recipehealth/14recipehealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 patties", "recipeCuisine": "american, indian", "recipeCategory": "dinner, lunch, burgers", "keywords": "dairy-free, halal, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 211, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "263 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["3/4 pound sweet potatoes, preferably light-fleshed, baked and cooled", "1/2 pound red boiling potatoes, scrubbed and quartered", "1/2 cup finely chopped fresh cilantro leaves", "6 tablespoons grape seed oil", "2 dried red chiles, coarsely ground in a mortar and pestle or spice mill, or 1/2 to 3/4 teaspoon red pepper flakes (to taste)", "1 tablespoon coriander seeds", "2 teaspoons cumin seeds", "1/4 teaspoon cayenne pepper", "2 teaspoons fresh lemon juice", "Salt to taste (Suvir Saran uses about 1 1/2 teaspoons kosher salt)", "1 cup frozen peas, thawed, or 1 cup fresh peas, steamed or boiled for 5 minutes", "1 cup panko or chickpea flour (you will not use all of it)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel cooled baked sweet potatoes and place in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place quartered red potatoes in a steamer over 1 inch of boiling water and steam for 15 to 20 minutes, until tender. Remove from heat and add to bowl with sweet potatoes. Mash potatoes together. The red skins will fall apart. Stir in cilantro."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 2 tablespoons of the oil with ground red chiles or red pepper flakes, coriander seeds and cumin seeds in a large, heavy skillet and heat over medium-high heat until cumin is fragrant and golden-brown, 1 to 2 minutes. Stir in cayenne and then scrape in potato mixture and salt to taste. Stir in peas and cook just until potatoes and peas are  warmed through, about 2 minutes, stirring and scraping the bottom of the skillet often to  work in any browned bits. Transfer mixture to a large bowl. Stir in lemon juice, taste and adjust salt, and set aside to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take up about 1/3 cup of the mixture and form into a ball (you can wet your hands to reduce sticking). Roll ball in the panko or chickpea flour, then gently flatten into a patty. Set on a plate and continue with the rest of the mixture. Refrigerate uncovered for 1 hour or longer (the longer the better)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to cook, place a rack over a sheet pan. Heat 2 tablespoons of oil in a 12-inch, heavy nonstick frying pan over high heat. Swirl pan to coat with the hot oil. Lower heat to medium. Place 4 to 5 patties in the pan (do not crowd), and cook until well browned on one side, about 4 minutes. Turn and brown for about 4 more minutes. Remove to rack. Heat remaining oil in the pan and cook remaining patties. Keep patties warm in a low oven until ready to serve. Serve with a salad and your choice of toppings, such as the usual (ketchup, mustard, relish), or yogurt raita, garlic yogurt, or chutney."}], "link": "https://cooking.nytimes.com/recipes/1016340-potato-and-pea-patties-with-indian-spices"}