{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Apple Rings", "description": "I came across this utterly simple idea in Deborah Madison’s “Vegetarian Cooking for Everyone.” She serves hers as a dessert with ice cream, a lovely use for the apples (which she also embellishes with raisins and pine nuts). I think they make a great addition to the Thanksgiving buffet, to go with the turkey along with cranberry sauce. Or serve them with your latkes next month! Breakfast is another meal where these are welcome, right on top of your whole wheat buttermilk pancakes. I find that the apples will caramelize most efficiently if you don’t crowd the pan, so I begin by sautéing the apples in 2 batches, then I combine the batches for the final addition of vanilla and optional brandy or calvados. Both tender apples like McIntosh, Gala, Macoun and Cortland, as well as firmer apples like Braeburns, work well in this dish.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/18/science/19recipehealthrings/19recipehealthrings-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, dinner, snack", "keywords": "dessert, side dish, fall, winter, gluten-free, halal, kosher, low cholesterol, low-sodium, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 93}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 122, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "4 grams", "proteinContent": "0 grams", "saturatedFatContent": "2 grams", "sodiumContent": "2 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 large apples", "1 lemon wedge", "2 tablespoons unsalted butter", "1 tablespoon raw brown (turbinado) sugar", "1/2 teaspoon cinnamon", "1 teaspoon vanilla extract", "2 tablespoons calvados or brandy (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Core apples and rub inside with lemon wedge. Peel if desired (I don’t). Slice about 1/4 inch thick, or a little bit thicker."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt half the butter over medium-high heat in a large, heavy skillet. When it stops foaming (wait this long so that the apples sear when you add them to the pan) add half the apples, half the sugar and half the cinnamon. Cook, flipping apple rings often, until apples are caramelized, 10 to 12 minutes. Test, using the tip of a knife or the edge of a spoon, to see if the apples are soft all the way through. Remove to a bowl. Repeat with remaining apples, butter, sugar and cinnamon. When second batch is caramelized return first batch to pan. Add vanilla and brandy if using and continue to cook, flipping apples, until the liquid evaporates. Transfer to a bowl or serving dish. Serve warm."}], "link": "https://cooking.nytimes.com/recipes/1016991-sauteed-apple-rings"}