{"@context": "http://schema.org", "@type": "Recipe", "name": "Wild Rice With Mushrooms", "description": "In Wisconsin, wild rice is truly wild, not cultivated as in other states, the tassels rising and swaying over rivers, lakes and floodplains come late August and September. Called manoomin by the local Chippewa, it is a protected crop that can be harvested only by state residents holding a valid license. And only by hand, as the Chippewa have always done, using wooden flails gently (the grains should fall from the stalk without great effort) from canoes propelled by paddles or push poles.\nShellie Holmes of Rhinelander, Wis., who shares her recipe here, likes to cook wild rice just until it pops open. This is a break with her family’s tradition, which favored a chewier texture and did not allow popping.\n“Do not mix with other rice,” she urged, lest you lose the flavor of the wild.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19WISCONSIN/19WISCONSIN-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "button mushrooms, cremini, dry sherry, wild rice, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 478}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 298, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "10 grams", "sodiumContent": "203 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["8 ounces long-grain Wisconsin wild rice", "8 tablespoons (1 stick) butter", "1 pound cremini or button mushrooms, sliced", "1/2 teaspoon salt, more to taste", "Black pepper, to taste", "1/3 cup dry sherry, such as Dry Sack (do not use cream sherry)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 5 cups water to a boil. Stir in rice, then reduce heat so liquid is just simmering. Cover and cook until grains just begin to pop, about 40 minutes. Drain excess liquid from rice and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt 4 tablespoons butter in a large skillet over medium-high heat. Add half the mushrooms and cook, stirring occasionally, until they have released their liquid and are golden brown, about 8 minutes; remove to a plate. Repeat with remaining butter and mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return all the mushrooms to the skillet and season with the salt and pepper, to taste. Very carefully add sherry to deglaze the pan, and cook until most of the liquid has evaporated but mushrooms are still moist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix mushrooms into prepared rice and season again with salt and pepper."}]}