{"@context": "http://schema.org", "@type": "Recipe", "name": "English Pea and Onion Salad", "description": "Jonathon Sawyer is no snob. Although he runs the kitchens in a slew of acclaimed restaurants in the Cleveland area, including The Greenhouse Tavern, the chef decided to honor Thanksgiving and his home state, Ohio, by sending along a personal recipe that calls to mind the processed-food delights that, for decades, characterized the cooking of the Midwest. “Think of this salad as a little slice of nostalgia from the canned-and-frozen households of the mid-20th century,” he wrote in an email.\n\nMr. Sawyer recommends frozen peas (“I think frozen peas are magical,” he said) and organic eggs, but over the years he has seen the dish made with Miracle Whip, cubes of cheese from the deli, powdered Ranch dressing, French’s fried onions. “The real goal of having a salad like this on the holiday table is it’s a tart, sweet and delicious break from the overindulgence of roasted birds, velvety gravy and buttery potatoes,” he said. And hey, that break from the overindulgence happens to have bacon in it.", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19OHIO/19OHIO-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, quick, salads and dressings", "keywords": "bacon, onion, peas, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 301, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "3 grams", "proteinContent": "12 grams", "saturatedFatContent": "7 grams", "sodiumContent": "419 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 ounces slab bacon, cut into 1/4-inch cubes", "2 lemons, zested and juiced", "1 tablespoon extra-virgin olive oil", "1 small onion, diced and rinsed under cold water", "3 tablespoons mayonnaise", "4 tablespoons grated Parmesan cheese", "4 tablespoons mixed chopped fresh herbs, such as parsley, mint, tarragon and basil", "2 large eggs, hard-cooked and finely diced", "Salt and pepper", "2 cups fresh or thawed frozen peas", "2 tablespoons sliced almonds, toasted", "2 tablespoons bread crumbs, toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees and line a baking sheet with foil. Spread bacon cubes on baking sheet and cook until caramelized and crispy, 15 to 20 minutes. Strain off rendered fat and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine lemon zest and juice, olive oil, onion, mayonnaise, 2 tablespoons Parmesan, 2 tablespoons fresh herbs and the eggs in a large bowl. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re using fresh peas, chop them to tenderize; if using frozen, strain off  excess moisture. Fold peas into dressing. Transfer mixture to a shallow serving bowl and spread in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle remaining 2 tablespoons fresh herbs over the top, then create a layer of the remaining 2 tablespoons Parmesan cheese. Top with almonds, then bread crumbs and finally bacon."}], "link": "https://cooking.nytimes.com/recipes/1016928-english-pea-and-onion-salad"}