{"@context": "http://schema.org", "@type": "Recipe", "name": "Dandelion or Chard Colcannon", "description": "There are two choices here for the greens. Dandelion greens are bitter and chard is not, or only slightly so. I think the potatoes taste particularly sweet against the bitter dandelion greens, but if you don’t want such a profound contrast, use chard. Make sure to remove the stringy stems from the dandelion greens (which, Jennifer McLagan writes in her book “Bitter,” is really dandelion chicory and not the wild greens that like to take over your lawn and garden). The dandelion greens will retain their tough texture even when cooked, which also contrasts nicely with the soft, comforting potatoes, but it is a good idea to chop them finely. I don’t peel the potatoes; I like to mash them skins and all. Bunches of either red or green dandelion greens  will work here.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/05/health/05recipehealthcolcannon/05recipehealthcolcannon-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "About 4 cups, serving 6", "recipeCuisine": "irish", "recipeCategory": "dinner", "keywords": "fall, winter, gluten-free, halal, kosher, low cholesterol, low sugar, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 43}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 171, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "4 grams", "sodiumContent": "378 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 pounds Yukon gold potatoes, scrubbed", "Salt to taste", "1 generous bunch dandelion greens or 1 bunch Swiss chard", "1 tablespoon extra virgin olive oil", "1 medium size leek, white and light green parts only, cleaned and chopped", "2 1/2 tablespoons unsalted butter", "3/4 to 1 cup warm or hot milk", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place potatoes in a saucepan and cover by an inch with water. Bring to a boil, add salt to taste, reduce heat to medium-low and cover partially. Simmer until tender, 25 to 30 minutes. Drain, return to pot and cover pot tightly. Let steam in the dry pot for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, stem dandelion greens or chard, wash in 2 changes of water, and chop fine. You should have 5 to 6 cups chopped greens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil over medium heat in a heavy skillet and add leek and a generous pinch of salt. Cook, stirring, until leek is tender but not browned, 3 to 5 minutes. Add greens, a handful at a time, and stir until each addition has wilted enough to make room for more. When all greens have been added, turn heat to medium, add salt to taste, and stir over medium heat for 5 minutes, until greens are completely wilted and somewhat tender (dandelion greens will remain tough). Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mash potatoes with a potato masher or in a standing mixer fitted with the paddle. Heat 3/4 cup of the milk with butter until butter melts, and gradually add to potatoes. Add wilted greens and leeks and mix until well blended. If desired, add the last 1/4 cup milk. Season to taste with salt and pepper. Serve hot."}]}