{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange-Almond Flan", "description": "No dish is as Spanish as a creamy flan. But the version from the cookbook Ana Benarroch de Bensadón is made with oranges, almonds and sugar, with no cream or condensed milk that would keep it from sharing a kosher table with meat dishes.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2014/04/07/dining/orangeflan-still/orangeflan-still-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, kosher", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 75}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 378, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "38 milligrams", "sugarContent": "62 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cups granulated sugar", "8 large egg yolks", "4 large eggs", "1 tablespoon grated orange zest", "3/4 cup freshly squeezed orange juice", "3/4 cup whole blanched almonds, finely ground, or 1 cup finely ground almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. In a medium saucepan, combine 1 cup sugar with 1/4 cup water. Stir until completely dissolved. Place pan over medium heat, stirring constantly, until syrup begins to bubble. Stop stirring and allow pan to sit until syrup begins to turn golden at edges, brushing down any sugar crystals with a brush dipped in cold water. Occasionally rotate pan to mix syrup without stirring it, then replace over heat. Continue doing this until syrup is evenly golden brown. Pour caramel into an 8-inch round flan mold or cake pan, or 10 to 12 3-inch fluted molds, tilting to spread caramel evenly along bottom. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, mix together remaining 2 cups sugar with 1 cup water. Bring to a boil over medium heat, and boil for 4 minutes. Remove from heat and set aside to cool until lukewarm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together yolks and whole eggs until blended, then pour through a fine mesh strainer into a bowl. Add orange zest, orange juice and ground almonds. Whisk in sugar syrup. Pour into caramel-lined mold or molds, filling to just below rim. Cover mold or molds tightly with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place mold or molds into a larger pan. Pour enough hot water into large pan to reach halfway up side of flan mold. Bake until a knife inserted halfway into flan comes out clean, 30 minutes to 1 hour, depending on type of pan and oven used."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow flan to cool, then refrigerate until thoroughly chilled, at least 2 hours. Just before serving, warm base of pan by dipping it briefly in a pan of hot water. Invert onto a plate, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1016063-orange-almond-flan"}