{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon and Garlic Chicken With Cherry Tomatoes", "description": "This is a summery dish to make in the middle of a cold winter (or early spring), but you can find decent cherry tomatoes even now, from Florida or from Mexico. I marinate the breasts in lemon juice, olive oil, garlic and rosemary before I pound them. This makes them very flavorful, a great savory contrast to the sweet tomato topping. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/22/science/26recipehealth/26recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4 ", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, quick", "keywords": "dairy-free, healthy, kosher, low sugar, nut-free, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 656}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 338, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "1 gram", "proteinContent": "32 grams", "saturatedFatContent": "2 grams", "sodiumContent": "629 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "3 tablespoons fresh lemon juice", "2 garlic cloves, minced or pureed", "1 teaspoon chopped fresh rosemary", "Salt and freshly ground pepper to taste", "2 boneless skinless chicken breasts (most weight 8 to 10 ounces)", "1/4 cup dry white wine", "2 heaped cups cherry tomatoes, – about 3/4 pound", "Pinch of sugar", "2 tablespoons all-purpose flour or a gluten- free flour such as rice flour or corn flour", "2 tablespoons grapeseed, sunflower or canola oil", "1 tablespoon chopped flat-leaf parsley", "1/4 cup freshly grated Parmesan (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir together the olive oil, lemon juice, garlic, rosemary, and salt and pepper in a large bowl. Cut each chicken breast into 2 equal pieces (3 if they weigh 12 ounces or more) and place in the bowl. Stir together and refrigerate 15 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken from marinade and pat dry with paper towels (discard marinade). Place two sheets of plastic wrap (1 large sheet if you have extra-wide wrap) on your work surface, overlapping slightly, to make 1 wide sheet, and brush lightly with olive oil. Place a piece of chicken in the middle of plastic sheet and brush lightly with oil. Cover the chicken with another wide layer of plastic wrap. Working from the center to the outside, pound chicken breast with the flat side of a meat tenderizer until about 1/4 inch thick. (Don’t pound too hard or you’ll  tear  the meat. If that happens  it won’t be the end of the world, you’ll just have a few pieces to cook.) Repeat with the remaining chicken breast pieces. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the pounded chicken breasts with salt and pepper on one side only. Dredge lightly in the flour (you will not use all of it) and tap the breasts to remove excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn oven on low. Heat a wide, heavy skillet over high heat and add oil. When oil is hot, place one or two pieces of chicken in the pan – however many will fit without crowding. Cook for 1 1/2 minutes, until bottom is browned in spots. Turn over and brown other side, about 1 1/2 minutes. (Do not overcook or chicken will be dry.) Transfer to a platter or sheet pan and keep warm in the oven. If there is more than a tablespoon of fat in the pan, pour some off into a jar or bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat on burner down to medium-high. Add wine to pan and stir with a wooden spoon to deglaze. Add cherry tomatoes and cook, stirring often or tossing in the pan, until they begin to shrivel and burst. Add sugar and salt and pepper to taste and continue to cook, tossing the tomatoes in the pan and stirring often, for 5 to 10 minutes, until tomatoes have collapsed but are still intact. Top chicken breasts with the tomatoes, sprinkle with parsley and with Parmesan if using, and serve. "}]}