{"@context": "http://schema.org", "@type": "Recipe", "name": "Shortcut Choucroute", "description": "This pork and vegetable braise requires about 3 hours of time and 5 minutes of work. Spend a few minutes making broad strokes with a sharp knife and layer the ingredients in a deep roasting pan. Then walk away for more than 2 hours. Pass through the kitchen again to uncover the pan and turn the oven up, then go back to your business. You’ve just spent a productive 3 or so hours cooking and doing something else.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/09/24/dining/24TIME2/24TIME2-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner, roasts", "keywords": "cabbage, pork shoulder, sauerkraut, sausage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 325}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 655, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "10 grams", "proteinContent": "42 grams", "saturatedFatContent": "13 grams", "sodiumContent": "1982 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 head green cabbage", "1 quart sauerkraut", "2 large onions", "4 bay leaves", "1 tablespoon caraway seeds or juniper berries", "Black pepper", "1 pound boneless pork shoulder roast (or 1 1/2 pounds bone-in)", "1 pound smoked sausage", "1 bottle not-too-sweet riesling (or a little more than 3 cups beer, apple cider, chicken stock or water)", "Salt", "Baguettes, butter and coarse mustard, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 300 degrees. Core the cabbage; cut it into wide ribbons and scatter in the bottom of a large roasting pan. Drain the sauerkraut and spread it on top of the cabbage. Halve the onions and nestle them among the vegetables. Tuck in the bay leaves and sprinkle with the caraway seeds or juniper berries and lots of black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the meat and sausages on top of everything and pour in the wine or other liquid. Sprinkle the meat with salt and pepper and cover tightly with foil. Transfer to the oven and cook, undisturbed, for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Test the pork shoulder by inserting a fork into the thickest part: If it slides out easily, turn the oven up to 450 degrees, leave the pan uncovered and return it to the oven until the meat and the vegetables brown a bit, another 25 to 30 minutes. If the pork isn’t fork-tender, re-cover the pan and return it to the oven for another 30 minutes before proceeding."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, just break the pork into chunks with two forks and set the pan on the table with a serving spoon and plates, plenty of roughly torn baguettes and crocks of mustard and butter. Don’t bother removing the bay leaves unless they really bug you."}], "link": "https://cooking.nytimes.com/recipes/1016834-shortcut-choucroute"}