{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta with Dried Mushrooms and Tomato Sauce", "description": "This meaty, savory pasta sauce is just one reason to keep dried porcini mushrooms on hand. Along with intense flavor, porcinis are an excellent source of  riboflavin and niacin, and a good source of selenium and potassium.  They also contain a powerful antioxidant called L-ergothioneine.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/10/16/health/nutrition/16recipehealth.ready/16recipehealth.ready-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 56}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 498, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "101 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "11 grams", "proteinContent": "17 grams", "saturatedFatContent": "1 gram", "sodiumContent": "785 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 ounce dried porcini mushrooms (about 1 cup)", "1 tablespoon extra virgin olive oil", "1/4 cup finely chopped onion or shallot", "2 to 3 plump garlic cloves, minced", "Salt", "1 (28-ounce) can chopped tomatoes in juice, coarsely pureed in a food processor fitted with the steel blade", "1 teaspoon fresh thyme leaves, chopped, or 1/2 teaspoon dried thyme", "Freshly ground pepper", "3/4 pound fusilli or other pasta of your choice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the mushrooms in a bowl or a pyrex measuring cup and cover with hot water. Let soak 15 to 30 minutes, until thoroughly soft. Line a strainer with cheesecloth and set it over a bowl. Drain the mushrooms and squeeze them over the strainer. Then rinse in several changes of water and chop coarsely. Measure out 1/4 cup of the mushroom soaking liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large pot of water for the pasta. Heat the olive oil in a large, wide, heavy nonstick frying pan over medium heat and add the onion or shallot. Cook, stirring, until tender, 3 to 5 minutes. Add the garlic and stir together for minute, until fragrant, then add the mushrooms and stir together for a minute or two, until fragrant. Add the tomatoes and their juice, the mushroom soaking liquid you set aside, the thyme, and 1/2 teaspoon salt. Stir and turn up the heat. When the tomatoes begin to bubble, lower the heat to medium and cook, stirring often, until thick and fragrant, 15 to 20 minutes. Add a generous amount of pepper, taste and adjust seasonings. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pasta water comes to a boil, add a tablespoon of salt and the pasta. Cook al dente, following the timing directions on the package but checking a minute or two before the time on the package. Remove 1/4 cup of the pasta cooking water and stir it into the mushroom sauce. When the pasta is cooked through but still firm to the bite, remove another 1/2 cup water, drain the pasta and toss with the sauce in the frying pan if possible. If you wish to thin out the sauce or moisten the pasta further, add 1/4 to 1/2 cup of the pasta cooking water or more of the mushroom soaking liquid. Serve hot; pass the Parmesan at the table."}], "link": "https://cooking.nytimes.com/recipes/1016479-pasta-with-dried-mushrooms-and-tomato-sauce"}