{"@context": "http://schema.org", "@type": "Recipe", "name": "Persian-Spiced Lamb Shanks", "description": "Rare grilled lamb chops or a roasted leg of lamb can be delightful and are easy to cook if you’re in a hurry. However, with a little planning, you’ll find it’s the shank of the lamb that deserves the most praise. Careful, slow simmering will coax lamb shanks to a flavorful succulence unlike the other cuts. Lamb shanks are versatile, too, easily adaptable to recipes from many different cuisines. This heady Persian spice mixture yields a braise that is complex and nuanced, yet the flavors are balanced, with subtle hints of orange, lime and rosewater. Basmati rice is the perfect accompaniment. Prepare the lamb shanks up to 2 days before serving, if desired. Refrigerate them covered in broth and reheat for 30 minutes in a 350 degree oven or over gentle heat on the stovetop.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/11/05/dining/05KITCHEN/5KITCHEN-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, roasts", "keywords": "chicken broth, lamb shanks, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 612}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 791, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "2 grams", "proteinContent": "63 grams", "saturatedFatContent": "21 grams", "sodiumContent": "1403 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 meaty lamb shanks (ask for the hind shanks), about 4 1/2 to 5 pounds", "Salt", "2 teaspoons ground cinnamon", "1 teaspoon grated nutmeg", "1 teaspoon ground cardamom", "1 teaspoon ground dried rosebuds, optional", "1 teaspoon ground black pepper", "1 teaspoon turmeric", "Vegetable oil", "1/4 teaspoon crumbled saffron", "Juice of 2 limes, about 4 tablespoons", "3 teaspoons rosewater, available from Middle Eastern grocery shops", "1 large onion, roughly chopped", "1/2 teaspoon ground dried lime, or the zest of 1 fresh lime", "Zest of 1 orange, plus 1 tablespoon more for garnish", "A few thyme sprigs", "2 fresh bay leaves", "6 cups hot chicken broth or water", "2 tablespoons roughly chopped parsley, for garnish", "2 tablespoons roughly chopped mint or dill, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim any excess fat from lamb shanks and season generously with salt. Mix together the cinnamon, nutmeg, cardamom, rosebuds (if using), black pepper and turmeric. Sprinkle evenly over shanks and rub into meat. Let sit at room temperature at least an hour, or wrap and refrigerate overnight, then bring to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a Dutch oven or deep, heavy pot over medium-high heat and add oil to a depth of 1/2 inch. When oil is hot, add 2 lamb shanks and fry until nicely browned on all sides, about 5 minutes. Remove and set aside, then brown the 2 remaining shanks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put saffron in a small bowl with lime juice, 2 teaspoons rosewater and 1/2 cup warm water. Let steep for 10 minutes. Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove all but 2 tablespoons oil from Dutch oven. Add chopped onion and cook over medium heat until softened and lightly colored, 8 to 10 minutes. Season onion with salt, then add lime zest, orange zest, thyme sprigs and bay leaves. Stir in saffron mixture. Lay in the lamb shanks and add the broth. Bring to a boil, then turn off heat and cover pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pot to oven and bake for about 1 1/2 hours, covered, until meat is tender when probed and beginning to fall from the bone. Remove lamb shanks to a deep serving dish and keep warm. Strain braising juices through a fine-mesh sieve into a bowl, pressing with a wooden spoon to obtain all the liquid (discard thyme, bay leaves and onions). Skim fat, then taste and add salt if necessary. Add 1 more teaspoon rosewater, if desired. Reheat strained juices and pour over lamb shanks. Combine parsley, mint and reserved orange zest and sprinkle over top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a large spoon to break the tender shank meat into large chunks. Serve in low, wide soup plates, giving each portion a spoonful of the juices. Accompany with steamed Basmati rice, lavash flatbread or a loaf of crusty French bread."}], "link": "https://cooking.nytimes.com/recipes/1016943-persian-spiced-lamb-shanks"}