{"@context": "http://schema.org", "@type": "Recipe", "name": "Brown Sugar-Cured Salmon", "description": "This grilled and smoked salmon recipe by the food writer Betty Fussell calls for curing the fish for several hours with salt, brown sugar and spices before smoking it over indirect heat on your grill. While the fatty fish absorbs the smoke beautifully, the fish can also be successfully cooked in a grill pan, or under the broiler. The salt and sugar cure, laced with sweet spices, both flavors the fish and firms up its flesh, giving it a meaty, silky texture. Serve it with a crisp salad for a light supper, or with rice for something more substantial.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/07/30/multimedia/clark-salmon-fussell/clark-salmon-fussell-mediumThreeByTwo440.jpg", "totalTime": "PT4H25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "brown sugar, hickory chips, salmon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 374}, "recipeIngredient": ["4 skin-on, center-cut wild king or other salmon fillets (2 1/2 pounds total)", "1/4 cup light brown sugar", "2 teaspoons coarse kosher salt", "1 teaspoon ground black pepper", "1/4 teaspoon ground allspice", "1/4 teaspoon ground mace", "Finely grated zest of 1 lemon, plus lemon wedges for serving", "Olive oil", "1 1/2 cups hickory chips, soaked for 30 minutes and drained"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat fish dry with paper towels. In a small bowl, combine sugar, salt, pepper, spices and zest. Rub mixture all over fish. Place in a dish, cover and let cure in the fridge for at least 4 hours and preferably 8 hours. Rinse fillets and pat dry. Generously oil salmon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light the grill. Once coals are hot, scatter drained hickory chips over coals. (If you’re using a gas grill, place them in a disposable metal pan on the grill next to the salmon.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place salmon flesh-side down on grill and cover, closing top vent so not much smoke is released. Smoke salmon, covered, for about 5 to 6 minutes, then flip. (If the fish is sticking to the grill grate, then it’s not ready to flip. Cook for another 3 to 10 minutes, depending upon how hot your fire is. The fish is done when the interior is medium pink and exterior crisp and smoky. Serve with lemon wedges."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Brown Sugar-Cured Salmon", "description": "Melissa Clark uses hickory wood chips to grill salmon cured with brown sugar, allspice and mace.", "thumbnailUrl": "https://static01.nyt.com/images/2014/07/30/multimedia/clark-salmon-fussell/clark-salmon-fussell-mediumThreeByTwo440.jpg", "uploadDate": "2014-08-01T18:22:49.000Z", "duration": "PT3M3S"}, "link": "https://cooking.nytimes.com/recipes/1016707-brown-sugar-cured-salmon"}