{"@context": "http://schema.org", "@type": "Recipe", "name": "Beet, Greens and Cheddar Crumble", "description": "This unusual, savory crumble is reminiscent of macaroni and cheese, but vegetable matter (beets and beet greens) standing in for the pasta. The vegetables are bound with a rich béchamel laced with grated clothbound cheddar, and the whole thing is topped with peppery oatmeal crumbs. As written, the recipe is at once comforting and sophisticated. If you like things on the fiery side, a squirt of sriracha does the trick. And if you or your family feel the need for meat to complete the meal, a side of grilled sausages would fill the bill beautifully.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/03/26/dining/26CASSEROLE4/26JPCASSEROLE4-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "beets, cheese, greens, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 678}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 368, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "4 grams", "proteinContent": "10 grams", "saturatedFatContent": "13 grams", "sodiumContent": "578 milligrams", "sugarContent": "8 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 pound medium beets", "3 sprigs fresh thyme branches plus 3/4 teaspoon fresh thyme leaves", "2 garlic cloves, peeled", "1/4 teaspoon black peppercorns", "Kosher salt and black pepper", "1 1/4 pounds beet greens, Swiss chard or a mix of both", "11 tablespoons cold unsalted butter, more for greasing pan", "150 grams all-purpose flour (1 1/3 cups)", "2 cups milk", "9 ounces sharp Cheddar, grated (2 1/4 cups)", "2 to 3 tablespoons English mustard powder, to taste", "1 teaspoon Worcestershire sauce", "1/2 teaspoon Tabasco sauce, more as needed", "25 grams rolled oats (1/4 cup)", "20 grams toasted hazelnuts, chopped (3 tablespoons)", "1 1/2 teaspoons grated Parmigiano-Reggiano", "1/4 teaspoon freshly grated nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine beets, thyme branches, garlic and peppercorns in a large pot. Cover with cold salted water. Bring to a simmer over medium-high heat; cook until beets are tender, 15 to 30 minutes depending on size. Remove with a slotted spoon. Add greens and cook for 2 minutes (do this in batches if necessary); remove with tongs and transfer immediately to a bowl of ice water. Drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once beets are cool enough to handle, peel them and slice crosswise into 1/4-inch-thick slices. Roughly chop greens’ leaves and stalks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the béchamel: In a small saucepan over low heat, melt 5 tablespoons butter. Stir in 75 grams flour ( 2/3 cup). Cook, stirring constantly, for 2 minutes; roux should smell cooked but remain white. Slowly whisk in milk until mixture forms a thick, smooth sauce. Stir in 8 ounces Cheddar (2 cups) until melted. Stir in mustard powder, Worcestershire and Tabasco. Season with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crumble topping: In a small bowl, stir together remaining 2/3 cup flour, the oats and the hazelnuts. Use your fingers to work in 6 tablespoons butter, the remaining 1 ounce Cheddar ( 1/4 cup) and the Parmigiano-Reggiano. It should be a mixture of large and small pieces. Season with a pinch of salt, pepper and the nutmeg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to assemble the dish, heat oven to 350 degrees. Butter a 2-quart gratin or baking dish. Spread a layer of béchamel on the bottom. Top with a layer of beets, followed by a layer of greens and stalks. Season generously with salt and pepper, and sprinkle with thyme leaves. Spread another layer of béchamel on top and repeat process to fill dish (you will end up with 3 or 4 layers). Cover entire surface with crumble topping. Transfer dish to oven and bake until bubbling and golden brown in spots, 45 minutes to 1 hour."}], "link": "https://cooking.nytimes.com/recipes/1016159-beet-greens-and-cheddar-crumble"}