{"@context": "http://schema.org", "@type": "Recipe", "name": "Garam Masala Pumpkin Tart", "description": "President Obama’s first state dinner at the White House, just before Thanksgiving in November 2009, honored Manmohan Singh, then the prime minister of India, and his wife, Gursharan Kaur. The chef for the dinner was Marcus Samuelsson, who decided to incorporate some Indian touches into the menu. Both naan and cornbread were served, and the dessert for each of the 400 guests was a pear Tatin and a pumpkin pie tartlet. \n\n“I flavored what I consider a very American pumpkin pie with a staple of Indian cuisine: garam masala,” Mr. Samuelsson wrote in his new cookbook, “Marcus Off Duty: The Recipes I Cook At Home,” where he gives the recipe, but as a large tart, not an individual tartlet. It adds a worldly touch to an American tradition, ideally suited to Washington.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19DCWASH/19DCWASHjpg-articleLarge.jpg", "totalTime": "PT2H45M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "dessert, garam masala, pumpkin purée", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 165}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 254, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "8 grams", "sodiumContent": "243 milligrams", "sugarContent": "25 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 cups/175 grams all-purpose flour, more for dusting", "1 teaspoon/5 grams kosher salt", "Grated zest of 3 lemons", "8 tablespoons/114 grams/1 stick unsalted butter, in 1/2-inch pieces", "4 large eggs", "1 cup/200 grams, packed, light brown sugar", "2 teaspoons/6 grams garam masala", "1 15-ounce/425-gram can plain pumpkin purée", "1 cup/240 milliliters half-and-half", "2 tablespoons/30 milliliters pure maple syrup", "Juice of 1 lemon", "1-inch piece/15 grams fresh ginger, peeled and minced", "1 teaspoon/5 milliliters vanilla extract", "Whipped cream or tart vanilla frozen yogurt for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place flour, 1/2 teaspoon salt and 1/3 of the lemon zest in a food processor and pulse to blend. Add butter and pulse until mixture resembles coarse meal. Add 2 tablespoons water. Pulse until mixture comes together. If necessary, add a little more water. Turn dough onto a lightly floured surface and form into a smooth disk. Wrap in plastic and refrigerate 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll dough out on a lightly floured surface to 12 1/2 inches in diameter. Fit dough into an 11-inch straight-sided loose-bottom tart pan without stretching it, pressing the dough into the sides of the pan. Trim excess dough. Refrigerate 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Line pastry with foil, then fill with pastry weights or dry beans. Bake 8 minutes. Remove foil and weights and bake 4 to 6 minutes longer. Remove from oven and set aside on a cooling rack. Reduce oven temperature to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat eggs in a large bowl. Add remaining ingredients, including the rest of the lemon zest and the salt. Whisk until thoroughly blended. Place pastry-lined tart pan on a baking sheet. Pour in filling. Bake 40 to 50 minutes until almost set — it will jiggle just a little in the center. Allow to cool at least 30 minutes before removing the outside of the pan. Serve at room temperature, with whipped cream or frozen yogurt if desired."}], "link": "https://cooking.nytimes.com/recipes/1016910-garam-masala-pumpkin-tart"}