{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Portobello Mushrooms", "description": "The key to giving a portobello (or any mushroom) dense texture is to cook it slowly in oil so that most of its moisture is driven out. My biggest successes came in taking whole mushrooms and cooking them, covered, for as long as two hours. Nearly as good, however, and more than twice as fast, is to cut up the mushrooms and cook them in oil, uncovered, for 30 to 45 minutes. At that point, you not only have fabulous mushrooms, which you can use in a pasta sauce, as I do here, or to top salads or stir into rice dishes, but you also have very good-flavored oil. To further improve the mushrooms' flavor, I like to use the trick popularized by Marcella Hazan: add a few reconstituted dried porcini to the portobellos.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/27/dining/Pasta-With-Slow-Cooked-Portobello/Pasta-With-Slow-Cooked-Portobello-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, easy, lunch", "keywords": "main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 666}, "recipeIngredient": ["8 ounces portobello mushrooms", "3 cloves garlic", "2 or 3 thyme sprigs", "1/2 cup extra virgin olive oil", "Salt and pepper to taste", "1/4 cup dried porcini mushrooms, optional", "3 cups tomatoes, peeled, seeded and chopped (canned are fine)", "1 pound penne or other cut pasta", "Freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim hard parts from mushrooms and discard. Rinse mushrooms quickly to remove grit; cut caps into slices and stems into small chunks. Combine in a medium skillet with 1 clove garlic (crushed and peeled), thyme, olive oil and some salt and pepper. Cook over sufficiently low heat so that mixture bubbles but mushrooms do not brown. Continue to cook, stirring infrequently, until they are quite shrunken in size and appear firm, 30 to 45 minutes. (At this point, you can pause for several hours before resuming cooking.) If you are using porcinis, soak them in hot water to cover for a few minutes so that they soften."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large pot of water to boil for pasta and salt it. Mince remaining garlic. Turn heat under oil to medium, and add garlic to the portobellos along with the drained porcinis. Cook, stirring occasionally, until garlic begins to color. Add tomatoes and raise heat to medium high. Cook, stirring occasionally, until they break up and become saucy, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook pasta until it is tender but not mushy. Taste sauce and adjust its seasoning. When pasta is done, drain it, toss with sauce, top with Parmesan, and serve."}]}