{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Rice Noodles With Beets and Beet Greens", "description": "I like to use golden or Chioggia beets for this stir-fry. Whatever beets you use, slice them very thin; for best results use a mandolin. Use a wok, not a pan, for stir-fried noodles as noodles will spill out of a pan. Tongs are a good tool for stirring and tossing the noodles, but a long-handled spatula will also work.\n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/02/04/science/05recipehealth/05recipehealth-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "Serves 4 to 5", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "dairy-free, halal, healthy, high fiber, kosher, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 384, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "5 grams", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "548 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["7 ounces rice vermicelli or thin rice stick noodles", "1/2 cup chicken stock or vegetable stock", "1 tablespoon soy sauce (more to taste)", "1 tablespoon Shao Hsing rice wine or dry sherry", "Salt to taste ", "1/2 teaspoon sugar", "1 tablespoon minced garlic", "1 tablespoon minced ginger", "1/4 to 1/2 teaspoon red pepper flakes, or 1 to 2 serrano or Thai chiles, minced ", "2 eggs", "2 tablespoons peanut oil, grapeseed oil, sunflower oil or canola oil", "4 small or 2 medium beets (1/2 pound), preferably golden or Chioggia beets, peeled and very thinly sliced, then cut into half-moons", "2 medium-size leeks, white and light green parts only, cut in half, cleaned of sand, and thinly sliced", "1 generous bunch beet greens, stemmed, washed well in 2 changes of water, and coarsely chopped or cut in ribbons", "1/2 cup chopped walnuts", "1/2 to 1 cup coarsely chopped cilantro", "2 teaspoons walnut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place noodles in a large bowl and cover with warm water. Soak for 20 – 30  minutes, until soft. Drain in a colander and using kitchen scissors, cut into 6-inch lengths. Set aside within reach of your wok. Combine stock, soy sauce, rice wine or sherry, salt and sugar in a small bowl and stir until salt and sugar dissolve. Combine garlic, ginger, and pepper flakes or minced chile in another bowl. Have all ingredients within reach of your wok."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat eggs in a bowl and season with a little salt. Heat a 14-inch flat-bottomed wok over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in 2 teaspoons of oil by adding it to the sides of the wok and swirling the wok. Make sure that the bottom of the wok is coated with oil and add beaten eggs, swirling the wok so that the eggs form a thin pancake. Cook 30 seconds to a minute, until set. Using a spatula, turn pancake over and cook for 5 to 10 more seconds, until thoroughly set, then transfer to a plate or cutting board. Roll up or fold in half and cut into strips using the edge of your spatula or a knife. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl remaining oil into wok and add garlic, ginger, and pepper flakes or chile. Stir-fry no more than 10 seconds and add beets and leeks. Stir-fry 2 minutes, until beets are crisp-tender. Add greens and walnuts and stir-fry until greens wilt, about 1 minute. Add noodles and stock mixture. Reduce heat to medium and stir-fry 1 to 2 minutes, until noodles are just tender. Add cilantro and eggs and stir-fry another 30 seconds to a minute, until well combined. Remove from heat and serve."}], "link": "https://cooking.nytimes.com/recipes/1016015-stir-fried-rice-noodles-with-beets-and-beet-greens"}