{"@context": "http://schema.org", "@type": "Recipe", "name": "Sazerac", "description": "Paul Gustings, the bartender at Broussard's in New Orleans, is nothing if not exacting when it comes to his Sazerac. “It has to be Old Overholt,” he said of his choice of rye. And not the standard two ounces, but an ounce and three-quarters. The glass must be rinsed with the anise-flavored liqueur Herbsaint, not absinthe. And, he said, “I use much more Peychaud’s that others do: 11 dashes.” That’s only, however, if you’re halfway through the bottle of bitters. If you’ve just opened it, it’s 13, according to Mr. Gustings, who says the dashes are smaller at that point; if you’re near the end, make it 10 dashes. The extra dose of bitters gives the drink a rosier glow than most Sazeracs, and a very dry finish.", "author": {"@type": "Person", "name": "Robert Simonson"}, "image": "https://static01.nyt.com/images/2014/08/04/dining/sazerac-still/sazerac-still-articleLarge.jpg", "totalTime": "PT2M", "recipeYield": "1 drink", "recipeCuisine": "", "recipeCategory": "", "keywords": "bitters, lemon twist, rye, simple syrup", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "recipeIngredient": ["1 3/4 ounces Old Overholt rye", "1/8 ounce simple syrup (see note)", "11 dashes Peychaud’s bitters", "3 dashes Herbsaint liqueur", "Lemon twist"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill a rocks glass. Meanwhile, in a mixing glass three-quarters filled with ice, mix the rye, simple syrup and bitters and stir until chilled, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the Herbsaint into the chilled rocks glass and rotate until the liqueur coats the inside of the glass. Strain the contents of the mixing glass into the rocks glass. Rub the lemon twist along the rim of the rocks glass, twist over the drink and discard."}], "link": "https://cooking.nytimes.com/recipes/1016708-sazerac"}