{"@context": "http://schema.org", "@type": "Recipe", "name": "Persimmon Pudding", "description": "Wild persimmons start to blush along the country roads of Indiana in late September, stealing the colors of sunset and weighing down their trees like Christmas balls. They are native to the landscape, unlike the Chinese and Japanese varieties cultivated in California and found in grocery stores. Foraging carries on through November, when the fruit claims a place at the Hoosier Thanksgiving table in the form of a dark gold pudding, distant kin to the sweet persimmon bread offered to early colonials by the Cherokee.\nThis recipe comes from Alverta S. Hart of Mitchell, Ind. This fall, the town hosted its annual Persimmon Festival and as always, the most suspenseful event was the persimmon pudding contest. Ms. Hart submitted her first pudding in 1962 as an 18-year-old bride, and re-entered every year for nearly four decades until she became a judge, then chairwoman of the event, winning on and off and collecting every color of ribbon along the way.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19INDIANA/19INDIANA-articleLarge.jpg", "totalTime": "PT1H40M", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "snack, custards and puddings", "keywords": "persimmon, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 167}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 478, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "85 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "9 grams", "sodiumContent": "443 milligrams", "sugarContent": "42 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons/56 grams butter, melted, plus more for the dish", "5 Fuyu persimmons (about 2 1/4 pounds), trimmed and chopped", "2 eggs, beaten", "2 cups/400 grams sugar", "1 teaspoon/8 grams baking soda", "1 cup/240 milliliters buttermilk", "1 1/2 cups/190 grams all-purpose flour", "2 1/2 teaspoons/12 grams baking powder", "1 cup/240 milliliters heavy cream", "1/4 teaspoon/ 1 1/2 grams salt", "1/2 teaspoon/3 milliliters vanilla extract", "Dash of cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees and butter a 2-quart baking dish. Purée persimmons in a food processor or blender until smooth. Strain pulp through a fine mesh strainer into a bowl, using the back of a spoon or a spatula to push purée through. Measure out 2 cups of pulp (discard remaining pulp)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine eggs, sugar and persimmon pulp in a large bowl and beat with an electric mixer on medium speed until well mixed. Stir baking soda into buttermilk, then add to persimmon mixture and beat to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, sift together flour and baking powder. Beat flour mixture into persimmon mixture in 3 batches, alternating with the cream, beginning and ending with the flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in melted butter, salt, vanilla and cinnamon. Transfer batter to prepared dish and bake until pudding is set, 1 hour to 1 hour 15 minutes."}], "link": "https://cooking.nytimes.com/recipes/1016923-persimmon-pudding"}