{"@context": "http://schema.org", "@type": "Recipe", "name": "Thanksgiving Mixed Bean Chili With Corn and Pumpkin", "description": "A third riff on the native American combination of beans, squash and corn for this week of vegetarian Thanksgiving main dish recipes. This is a straightforward vegetarian chili, one that is a favorite around my house throughout the year. You can turn up the heat if you wish, adding more chili, a chipotle, or fresh chopped chili peppers.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/10/health/13recipehealth/13recipehealth-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "Yield: Serves 6 generously", "recipeCuisine": "southwestern", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, nut-free, vegan, vegetarian, fall, winter, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 178}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 155, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "6 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "657 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 pound mixed dried beans, such as pintos and black beans, pintos and red beans, or heirloom beans such as San Franciscano, Good Mother Stallards, and Sangre de Toros (see note), washed, picked over, and soaked for at least 4 hours or overnight in 2 quart", "2 onions, 1 halved, 1 finely chopped", "4 garlic cloves, 2 crushed and peeled, 2 minced", "1 bay leaf", "2 tablespoons grapeseed or sunflower oil", "3 tablespoons mild ground chili (or use hot, or use more)", "1 tablespoon cumin seeds, ground", "1 14-ounce can chopped tomatoes", "Pinch of sugar", "2 tablespoons tomato paste dissolved in 1 cup water", "2 cups diced winter squash (about 3/4 pound)", "1 cup corn kernels (fresh or frozen)", "Salt to taste", "1/2 cup chopped cilantro", "Grated or crumbled cheese for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place beans and soaking water in a large, heavy pot. Add halved onion and bring to a gentle boil. Skim off any foam that rises, then add crushed garlic and bay leaf, reduce heat, cover and simmer 30 minutes. Add salt and continue to simmer another 45 minutes to an hour.  Using tongs or a slotted spoon, remove and discard onion and bay leaf."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": ". Meanwhile, heat oil over medium heat in a heavy skillet and add chopped onion. Cook, stirring often, until tender, about 5 minutes. Add a generous pinch of salt, stir in chopped garlic, stir together for 30 seconds to a minute, until fragrant, and add ground chili and cumin. Cook, stirring, for 2 to 3 minutes, until mixture begins to stick to pan. Add chopped tomatoes with juice, pinch of sugar, and salt to taste. Bring to a simmer and cook, stirring often, until tomatoes have cooked down and mixture is beginning to stick to the pan, about 10 minutes. Stir in tomato paste dissolved in water and bring back to a simmer. Simmer, stirring often, for 10 minutes, until mixture is thick and fragrant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir tomato mixture into beans. Add winter squash and bring to a simmer. Taste and adjust salt. Simmer, stirring often so that the chili mixture doesn’t settle and stick to the bottom of the pot, for 45 minutes. Add more water if chili seems too thick. Stir in corn and simmer for another 10 minutes. The beans should be very soft and the chili thick and fragrant. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shortly before serving stir in cilantro. Simmer for 5 minutes. Spoon into bowls. If you wish, top with grated cheddar, Monterey jack, or crumbled queso fresco. Serve with biscuits or cornbread."}], "link": "https://cooking.nytimes.com/recipes/1016971-thanksgiving-mixed-bean-chili-with-corn-and-pumpkin"}