{"@context": "http://schema.org", "@type": "Recipe", "name": "Chopped Herb Salad With Farro", "description": "This dish is modeled on a Middle Eastern tabouli. Add just one cup of cooked farro or spelt to a generous mix of chopped parsley, mint, arugula and other herbs like basil or dill. \n\nNotice that I’m calling this dish a chopped herb salad with farro and not a farro salad with chopped herbs. It’s modeled on an authentic Middle Eastern tabouli, which should be all about the parsley, with just a small amount of bulgur. I add just one cup of cooked farro or spelt to a generous mix of chopped parsley, mint, arugula and other herbs like basil or dill. There are also chopped tomatoes in the mix, all of it tossed with lemon juice and olive oil.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/08/26/science/27recipehealth/27recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 6", "recipeCuisine": "mediterranean, middle eastern", "recipeCategory": "dinner, lunch, snack, salads and dressings, vegetables", "keywords": "appetizer, side dish, dairy-free, halal, kosher, low cholesterol, low-sodium, low sugar, nut-free, vegan, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 155}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 157, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "5 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "381 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["2 cups chopped fresh flat-leaf parsley (from 2 large bunches)", "1/4 cup chopped fresh mint", "1 cup chopped arugula or a mix of arugula and other herbs", "3/4 pound (2 large) ripe tomatoes, very finely chopped", "1 bunch scallions, finely chopped", "1 cup cooked farro or spelt", "1 teaspoon ground sumac", "Juice of 1 to 2 large lemons, to taste", "Salt to taste", "1/4 cup extra-virgin olive oil", "Small leaves from 1 romaine lettuce heart, leaves separated, washed and dried (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine parsley, mint, arugula and/or other herbs, tomatoes, scallions, farro, sumac, lemon juice and salt to taste. Refrigerate for 2 to 3 hours so  the farro marinates in the lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add olive oil, toss together, taste and adjust seasonings. The salad should taste lemony. Add more lemon juice if it doesn’t.  Serve with lettuce leaves if desired."}], "link": "https://cooking.nytimes.com/recipes/1016766-chopped-herb-salad-with-farro"}