{"@context": "http://schema.org", "@type": "Recipe", "name": "Devil’s Food Cake With Black Pepper Buttercream", "description": "Like all the best devil’s food cakes, this six-layer beauty has a deeply fudgy flavor and a light and feathery texture. In between the tender cake layers, a black pepper and vanilla buttercream creates a soft and creamy contrast to the dense fudge frosting on the top and sides. With six layers and two frostings, this cake is definitely a project, but one well worth making if you want to impress. And you can make it in stages. The frostings can be made up to a week ahead and stored in the refrigerator. Bring them to room temperature and briefly beat with an electric mixer before assembling the cake. The cake layers themselves can be baked a day ahead. Store them, well-wrapped, at room temperature.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/30/multimedia/clark-devils-food-cake/clark-devils-food-cake-mediumThreeByTwo440.jpg", "totalTime": "PT2H30M", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "butter, chocolate, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 366}, "recipeIngredient": ["10 tablespoons/140 grams unsalted butter, softened, more for greasing pans", "2/3 cup/70 grams unsweetened natural (not Dutch-processed) cocoa powder, more for pans", "3/4 cup/180 milliliters whole milk", "2 cups/200 grams cake flour", "1 1/2 teaspoons/10 grams baking soda", "1/2 teaspoon/3 grams baking powder", "1/2 teaspoon/3 grams kosher salt, more as needed", "1 3/4 cups/350 grams granulated sugar", "3 large eggs", "2 teaspoons/10 milliliters vanilla extract", "5 large egg whites", "1 cup/200 grams granulated sugar", "Large pinch kosher salt", "3 sticks plus 2 tablespoons/365 grams unsalted butter, softened", "1 vanilla bean pod, split lengthwise, seeds scraped", "1 teaspoon/5 grams coarsely ground black pepper", "1 1/2 cups/300 grams granulated sugar", "1 cup/240 milliliters heavy cream", "Pinch kosher salt", "6 ounces/170 grams unsweetened chocolate, coarsely chopped", "8 tablespoons/112 grams unsalted butter, diced", "2 teaspoons/10 milliliters vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Heat oven to 350 degrees. Grease 3 8-inch round baking pans, line the bottoms of each with a round of parchment paper and grease the paper. Use a little cocoa powder to coat the insides of the pans, rotating pans so the cocoa comes up the sides, then tap out excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together cocoa powder and 2/3 cup boiling water. Whisk in milk. In a separate bowl, whisk together cake flour, baking soda, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl fitted with the paddle attachment, beat butter and sugar until fluffy. Beat in eggs 1 at a time, until incorporated. Beat in vanilla. With the mixer running on low speed, beat in a third of the dry ingredients, followed by half the cocoa mixture. Add remaining portions, alternating between two mixtures. Beat until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide batter evenly among prepared pans. Bake until the centers of the cakes are firm to the touch, 30 to 40 minutes. Cool cakes in their pans on a wire rack for 10 minutes; turn them out onto the rack to cool completely. (Peel off parchment paper if it sticks to the cakes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the buttercream: Fill a medium pot halfway with water (or use a double-boiler) and bring to a simmer. In a heatproof bowl that fits over pot, whisk together egg whites, sugar and salt. Cook, whisking constantly, until the sugar dissolves and mixture reaches 140 degrees on a candy or instant-read thermometer, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer, whip until completely cooled and thick, about 5 minutes. Beat in butter a little at a time, until the frosting is smooth and spreadable. Beat in vanilla bean seeds and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a serrated knife, slice each cake in half horizontally. Place one bottom layer on a large platter or cake stand. Top evenly with a thin layer of buttercream. Repeat, alternating between cake and frosting, ending with a layer of cake. Cover cake loosely with plastic wrap and refrigerate while you prepare fudge frosting. (Cake can rest in the refrigerator for up to 1 day.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the frosting: In a medium saucepan over medium heat, combine sugar, heavy cream and salt. Simmer, stirring occasionally, until sugar completely dissolves, about 5 minutes. Scrape mixture into a bowl. Stir in chocolate, butter and vanilla until smooth. Set bowl over a larger bowl filled with ice. Use a hand mixer or an immersion blender with the whisk attachment to whip until mixture is thick and cool, about 5 minutes. Spread frosting over the top and sides of the cake."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Devil’s Food Cake", "description": "Melissa Clark makes the most devilish of devil’s food cakes by using two types of frosting: black pepper buttercream and chocolate fudge.", "thumbnailUrl": "https://static01.nyt.com/images/2014/04/30/multimedia/clark-devils-food-cake/clark-devils-food-cake-mediumThreeByTwo440.jpg", "uploadDate": "2014-05-05T18:09:00.000Z", "duration": "PT3M20S"}, "link": "https://cooking.nytimes.com/recipes/1016313-devils-food-cake-with-black-pepper-buttercream"}