{"@context": "http://schema.org", "@type": "Recipe", "name": "Carrot, Parsnip and Potato Colcannon", "description": "Carrots and parsnips, whose flavors are quite similar, outweigh the potatoes in this sweet, light colcannon. Because parsnips can be fibrous, this is one instance where I recommend straining the mixture or putting it through a food mill.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/04/health/04recipehealthcolcannon/04recipehealthcolcannon-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 6", "recipeCuisine": "irish", "recipeCategory": "", "keywords": "gluten-free, halal, high fiber, kosher, low cholesterol, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 216, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "7 grams", "proteinContent": "4 grams", "saturatedFatContent": "4 grams", "sodiumContent": "588 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 ounces Yukon gold potatoes, scrubbed", "1 pound carrots, peeled, quartered, and cut into 3-inch lengths", "1 pound parsnips, peeled, quartered, cored and cut into 3-inch lengths", "Salt to taste", "1 tablespoon extra virgin olive oil", "1 medium leek, white and light green parts only, cleaned and chopped", "2 to 3 tablespoons unsalted butter (to taste)", "3/4 cup milk", "Freshly ground pepper", "1 tablespoons chopped fresh dill or chervil (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place potatoes, carrots, and parsnips in a saucepan and cover by an inch with water. Add salt to taste, bring to a boil, reduce heat to medium-low and cover partially. Simmer until tender, 25 to 30 minutes. Drain, return to pot and cover pot tightly. Leave to steam in covered pot for 5 minutes. Peel potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat olive oil over medium heat in a heavy skillet and add leek. Cook, stirring often, until it begins to wilt, about 3 minutes. Add salt to taste and continue to cook, stirring, until very tender, 3 to 5 more minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mash vegetables with a potato masher or in a standing mixer fitted with the paddle, or put through a food mill. Combine milk and butter and heat until butter melts. Gradually add to purée, stirring or beating on low speed. Stir in leeks and mix until well blended. Season to taste with salt and pepper. Put through the fine or medium blade of a food mill, or press through a medium-mess strainer. Garnish if desired with dill or chervil. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1016938-carrot-parsnip-and-potato-colcannon"}