{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Hearts of Celery Vinaigrette", "description": "Braised celery has a much milder flavor than raw celery, and needs a robust, lemony sauce. I was introduced to this dish in France and I’ve always loved it. It’s a great starter or side dish, and it keeps for a few days in the refrigerator.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/11/11/health/nutrition/11recipes.health.ready/11recipes.health.ready-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 84, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "347 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["3 celery hearts, cut in half lengthwise, ends trimmed", "2 tablespoons extra virgin olive oil", "1/2 medium onion, sliced", "Kosher salt", "4 garlic cloves, sliced", "1 cup chicken or vegetable stock", "2 tablespoons lemon juice plus 1 large lemon, sliced", "1/4 cup dry white wine", "Freshly ground pepper", "1 tablespoon finely chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400ºF. Bring a large pot of generously salted water to a boil and drop in the celery. Boil until partially cooked, about 3 minutes. Drain, pat dry and lay side by side, cut side up, in a baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in medium skillet over medium heat and add the onion and 1/2 teaspoon salt. Cook, stirring, until the onion softens, about 5 minutes, and add the garlic. Stir together for a minute, until fragrant, and add the stock, lemon juice, and the wine. Bring to a boil on top of the stove and pour over the celery. Season the celery with salt and pepper and lay the lemon slices on top. Cover tightly and place in the oven. Braise for 40 minutes, or until the celery is thoroughly tender but still holds its shape. Remove from the heat and allow the celery to cool in the liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, remove the celery from the pot and cut the halved bunches lengthwise in half again. Transfer to a platter or a wide serving dish. Pour the liquid into a saucepan and bring to a boil. Reduce by about half. Pour over the celery. Drizzle on the remaining tablespoon of olive oil, grind on some pepper, sprinkle on the parsley and serve, or chill and serve cold or at room temperature. Spoon liquid from the platter over each portion."}]}