{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Watermelon and Feta Salad", "description": "I love watermelon and feta salad, whether the watermelon is grilled or not. The sweet, juicy watermelon against the salty, creamy feta and pungent onions is a winning combination. This version introduces heat — if you serve it right after grilling the melon (it isn’t a must) — and char. Throw the watermelon slices, with the rind, onto the grill after or before you’ve grilled your meat or fish or vegetables. Grill them on both sides until just charred, then cut away the rinds and dice up the melon for the salad.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/07/08/science/08recipehealth/08recipehealth-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "Serves 4", "recipeCuisine": "greek, mediterranean", "recipeCategory": "dinner, lunch, quick, salads and dressings", "keywords": "appetizer, gluten-free, halal, kosher, low cholesterol, nut-free, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 138}, "recipeIngredient": ["1 small red onion, sliced", "3 large or 4 smaller 1-inch-thick slices watermelon", "3 tablespoons extra-virgin olive oil", "2 tablespoons sherry vinegar", "Salt to taste", "2 tablespoons chopped fresh mint", "2 ounces feta cheese, crumbled", "1/4 to 1/2 teaspoon Aleppo pepper or mild chili powder (to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place sliced onion in a bowl and cover with water and 1 teaspoon of the \nvinegar. Soak 5 minutes, then drain and rinse. Drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a medium-hot grill. Use 1 tablespoon of the olive oil to brush the \nwatermelon slices lightly. Grill for about 3 minutes per side, or until charred. Remove from heat and dice. Transfer, with juice, to a large salad bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onions and remaining ingredients and toss together. Let sit for a few \nminutes or for up to an hour before serving. Toss again just before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": ""}]}