{"@context": "http://schema.org", "@type": "Recipe", "name": "Oak Ice Cream", "description": "Much of the joy of cooking for guests is in seeing the pleasure they take from your well-prepared meal. But there is a way to up the ante: serve a dish so unusual that they don’t think they could make it themselves. This ice cream, from Mads Refslund of Acme restaurant in New York, a leading chef in the New Nordic movement, is one of those dishes. The inclusion of toasted oak will raise eyebrows, but requires little additional work and yields wonderful results. The preparation of the custard may require a few steps, but is actually quite simple, and the ice cream machine does most of the heavy lifting. If you have time, you can let the oak infuse for longer; the oak flavor will deepen without becoming overwhelming. ", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2014/02/19/dining/20140219-NORDIC-slide-IL0O/20140219-NORDIC-slide-IL0O-articleLarge.jpg", "totalTime": "PT1H35M", "recipeYield": "1 quart", "recipeCuisine": "scandinavian", "recipeCategory": "", "keywords": "dessert, ice cream", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "recipeIngredient": ["3 cups whole milk", "1 1/4 cups heavy cream", "1 cup medium-toasted oak shavings or chips (available at LDCarlson.com, 800-321-0315, or home-brewing supply stores)", "6 1/2 tablespoons granulated sugar", "6 1/2 tablespoons turbinado (raw) sugar", "5 tablespoons honey", "1/2 teaspoon salt", "8 large egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare an ice cream maker according to manufacturer’s directions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine the milk, cream and oak shavings. Place over high heat and bring to a boil, watching carefully to keep from boiling over, then reduce heat to low and simmer for 5 minutes. Remove from heat and let mixture infuse for 45 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain through a thin mesh colander or strainer into a heatproof bowl; discard oak shavings. Return mixture to a clean medium saucepan over very low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer at medium speed, whisk together the granulated sugar, turbinado sugar, honey, salt and egg yolks until almost doubled in volume, about 2 minutes. Add 1/3 of the warm oak-infused liquid and mix just until combined well, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return sugar and egg mixture to the saucepan of warm oak-infused milk, and gently stir in an “S” shape, taking care to scrape the bottom of the pan. Mixture will be ready when it appears silky and has thickened so that it coats the back of a wooden spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove mixture from heat and set aside. Fill a large bowl with water and ice; place saucepan in it and cool to room temperature, stirring occasionally to ensure even cooling. Freeze mixture in an ice cream maker according to manufacturer’s directions, about 35 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finished ice cream will have the consistency of soft serve and should be served immediately or promptly placed in freezer to help solidify. Serve within 2 days for best results."}], "link": "https://cooking.nytimes.com/recipes/1016055-oak-ice-cream"}