{"@context": "http://schema.org", "@type": "Recipe", "name": "The Best Clam Chowder", "description": "This is a basic New England clam chowder, though with leeks used in place of the traditional onions, and a splash of wine to add a floral note. Also: thyme. Very continental! It is shockingly delicious and deserves its title as best. Bacon will add a smoky note to the stew. If you use it, it may be worth it to go the whole distance and get expensive double-smoked bacon instead of the standard supermarket fare. The salt pork, which is not smoked, will take the meal in the opposite direction, emphasizing the pure flavor of the clams.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/08/03/dining/COOKING-BEST-CLAM-CHOWDER2/COOKING-BEST-CLAM-CHOWDER2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1307}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 398, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "3 grams", "proteinContent": "9 grams", "saturatedFatContent": "15 grams", "sodiumContent": "544 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["24 medium-size quahog clams, usually rated ‘‘top neck’’ or ‘‘cherrystone,’’ rinsed", "1 tablespoon unsalted butter", "1/4 pound slab bacon or salt pork, diced", "2 leeks, tops removed, halved and cleaned, then sliced into half moons", "3 large Yukon Gold potatoes, cubed", "1/2 cup dry white wine", "3 sprigs thyme", "1 bay leaf", "2 cups cream", "Freshly ground black pepper to taste", "1/4 cup chopped parsley."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the clams in a large, heavy Dutch oven, add about 4 cups water, then set over medium-high heat. Cover, and cook until clams have opened, approximately 10 to 15 minutes. (Clams that fail to open after 15 to 20 minutes should be discarded.) Strain clam broth through a sieve lined with cheesecloth or doubled-up paper towels, and set aside. Remove clams from shells, and set aside as well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse out the pot, and return it to the stove. Add butter, and turn heat to \nmedium-low. Add bacon or salt pork, and cook, stirring occasionally, until the fat has rendered and the pork has started to brown, approximately 5 to 7 minutes. Use a slotted spoon to remove pork from fat, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the leeks to the fat, and cook, stirring frequently, until they are soft \nbut not brown, about 10 minutes. Stir in potatoes and wine, and continue cooking until wine has evaporated and the potatoes have just started to soften, approximately 5 minutes. Add enough clam broth to just cover the potatoes, approximately 3 cups, reserving the rest for another \nuse. Add the thyme and the bay leaf."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Partly cover the pot, and simmer gently until potatoes are tender, \napproximately 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, chop the clams into bits about the size of the bacon dice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When potatoes are tender, add cream and stir in chopped clams and reserved bacon. Add black pepper to taste. Let come to a simmer, and remove from heat. (Do not let chowder come to a full boil.) Fish out the thyme and the bay leaf, and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The chowder should be allowed to sit for a while to cure. Reheat it to a \nbare simmer before serving, then garnish with chopped parsley. Serve \nwith oyster crackers."}], "link": "https://cooking.nytimes.com/recipes/1016717-the-best-clam-chowder"}