{"@context": "http://schema.org", "@type": "Recipe", "name": "Gluten-Free Pasta e Fagiole", "description": "It’s important to use a gluten-free pasta that won’t fall apart for this dish. Andean Dream quinoa macaroni is a good choice.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 249, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "6 grams", "proteinContent": "11 grams", "saturatedFatContent": "2 grams", "sodiumContent": "583 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound dried white or borlotti beans, washed and picked over, soaked in 1 quart of water for 6 hours or overnight", "1 tablespoon olive oil", "1 medium or large onion, chopped", "2 teaspoons chopped fresh or 1/2 teaspoon crumbled dried rosemary", "2 to 4 large garlic cloves (to taste), minced or pressed", "1 (28-ounce) can chopped tomatoes, with liquid", "Salt and freshly ground pepper", "1 heaped tablespoon tomato paste", "A bouquet garni made with 1 bay leaf, 1 Parmesan rind, 1 small dried red pepper, and a couple of sprigs of thyme and parsley", "1/2 pound (1 cup) gluten-free macaroni", "2 ounces Parmesan cheese, grated (1/2 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the beans. Heat the oil over medium heat in a large, heavy casserole or Dutch oven and add the onion. Cook, stirring, until just tender, about 5 minutes. Add 1/2 teaspoon salt, the rosemary and the garlic and stir together for another minute, until the garlic is fragrant. Add the tomato paste and stir for another minute or two, then stir in the tomatoes, add some salt and pepper, and cook, partially covered, for 15 minutes, stirring often, until the tomatoes have cooked down and the mixture is very fragrant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans, bouquet garni and 2 quarts water. Bring to a boil, reduce the heat, cover and simmer 1 hour. Add salt to taste (1 to 2 teaspoons), cover and simmer another 30 minutes to an hour, until the beans are tender. Remove the bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Read the cooking instructions accompanying the pasta you are using. The pasta will take a little longer, as the liquid is not going to be at a rolling boil, so add a few minutes to the instructions. Stir the pasta into the simmering beans. When it is cooked al dente, taste and adjust seasonings. Serve, passing the grated Parmesan in a bowl."}], "link": "https://cooking.nytimes.com/recipes/1016535-gluten-free-pasta-e-fagiole"}