{"@context": "http://schema.org", "@type": "Recipe", "name": "Mojo Turkey", "description": "You need not conjure New England with your Thanksgiving turkey. This recipe nods to what happened when Cuban culture drifted onto the Thanksgiving tables of South Florida, with a bird dressed in a marinade of sour oranges (a mixture of orange and lime juice works as well) mixed with a lot of garlic and oregano. Serve the bird with black beans and white rice on the side — and a Key lime pie for dessert.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19FLORIDA/19FLORIDA-articleLarge.jpg", "totalTime": "PT6H", "recipeYield": "10 to 12 servings", "recipeCuisine": "american, cuban", "recipeCategory": "dinner", "keywords": "lime, oregano, sour orange juice, turkey, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 208}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 596, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "2 grams", "proteinContent": "77 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1337 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 12- to -14- pound turkey, giblets and neck removed", "2 heads of garlic, peeled and chopped", "2 tablespoons ground cumin", "2 tablespoons kosher salt, plus more to taste", "2 tablespoons black pepper, plus more to taste", "2 cups sour orange juice, or 1 cup fresh orange juice and 1 cup fresh lime juice", "1/4 cup extra-virgin olive oil", "1/4 cup fresh oregano leaves, roughly chopped", "1 orange, cut into quarters", "1 lime, cut into quarters", "1 small yellow onion, peeled and cut into quarters"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse turkey well in cold water and pat very dry with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the marinade: Combine garlic, cumin, salt and pepper in a large mixing bowl and mash the mixture together with the back of a kitchen spoon to make a kind of paste. Stir sour orange juice (or orange and lime juices) and oil into the paste and whisk to combine. Add oregano leaves and mix again. Reserve 1/2 cup of marinade and put aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put turkey in a roasting pan that can fit in the refrigerator and cover with remaining marinade, making sure to get a lot of it into the turkey’s open cavity. Cover and refrigerate overnight, or for at least a few hours. Baste a few times with marinade."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, heat oven to 450 degrees. Remove turkey from marinade and place on a clean cutting board. Discard marinade and clean roasting pan well. Return turkey to roasting pan, tuck the tips of the wings under the bird and shower it with salt and pepper. Place orange, lime and onion quarters in the turkey’s cavity, then truss its legs together with cotton string. Roast turkey, uncovered, in the oven for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce oven heat to 325 degrees. Baste turkey with pan juices, and add remaining marinade to the pan. Continue roasting turkey, basting every 30 minutes and tenting it with foil if the skin is turning too dark, until an instant-read thermometer inserted into the thickest part of the thigh without touching bone registers 165 degrees, approximately 2 hours 45 minutes to 3 hours more. Transfer to a cutting board or platter and allow to rest at least 30 minutes before carving."}]}