{"@context": "http://schema.org", "@type": "Recipe", "name": "Quinoa Salad With Roasted Carrots and Frizzled Leeks", "description": "This quinoa salad, filled with soft roasted carrots, currants and a pomegranate molasses-spiked dressing, makes enough to feed a crowd, though you can easily halve the recipe for a smaller group. You can make it  with any color quinoa you come across – it comes in shades of tan (called white), rusty red and brownish black. Just don’t mix them together in one pot because they all have slightly different cooking times. As for the pomegranate molasses, it's available in specialty shops and online, but if you don’t have it, substitute a good quality balsamic vinegar spiked with a little honey if you like. You can toss together the quinoa, dressing and carrots the day before serving, but don’t add the arugula until the last minute to keep it as fresh and crisp as possible.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/11/multimedia/clark-quinoa-salad/clark-quinoa-salad-mediumThreeByTwo440.jpg", "totalTime": "PT1H15M", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "carrot, leek, quinoa, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 103}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 213, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "6 grams", "proteinContent": "7 grams", "saturatedFatContent": "0 grams", "sodiumContent": "389 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["1 leek, trimmed", "3/4 cup plus 2 tablespoons extra-virgin olive oil, more for frying leeks and for serving", "Kosher salt and black pepper", "2 1/2 tablespoons lemon juice", "2 1/2 tablespoons pomegranate molasses, more for serving", "2 pounds carrots, peeled and sliced into 1/4-inch-thick coins", "2 cups quinoa (13 ounces)", "1/3 cup dried currants", "6 ounces fresh arugula"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut leek in half lengthwise and rinse away any grit. Slice thinly. In a small skillet over medium heat, warm 1/4 inch olive oil. Add a handful of leeks and fry until golden brown, 15 to 30 seconds. Remove with a slotted spoon and transfer to a paper-towel-lined plate. Sprinkle lightly with salt. Repeat with remaining leeks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together lemon juice, molasses, 1 teaspoon salt and a large pinch of pepper. Whisk in 3/4 cup oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Toss carrots with 2 tablespoons oil, 1 teaspoon salt and some pepper. Spread on one or two large baking sheets so they fit in one layer. Roast carrots, tossing occasionally, until tender and golden brown, 30 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While carrots roast, bring a large pot of salted water to a boil. Add quinoa and cook until tender, 10 to 12 minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss warm quinoa with currants. Add carrots and half the dressing and toss well. Taste and add dressing or salt (or both) if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, toss arugula with enough dressing to lightly coat. (Leftover dressing will last for five days stored in the refrigerator.) Spread arugula on a serving platter. Top with quinoa and the frizzled leeks. Drizzle with more pomegranate molasses and a little olive oil before serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Quinoa Salad for a Crowd", "description": "Melissa Clark makes a quinoa salad with soft roasted carrots and crunchy fried leeks that can serve as a side course or a main dish.", "thumbnailUrl": "https://static01.nyt.com/images/2014/04/11/multimedia/clark-quinoa-salad/clark-quinoa-salad-mediumThreeByTwo440.jpg", "uploadDate": "2014-04-11T20:12:02.000Z", "duration": "PT3M11S"}, "link": "https://cooking.nytimes.com/recipes/1016239-quinoa-salad-with-roasted-carrots-and-frizzled-leeks"}