{"@context": "http://schema.org", "@type": "Recipe", "name": "Seeded Chocolate Chip Cookies", "description": "When I make chocolate-chip cookies, I always use a <a href=\"http://www.nytimes.com/recipes/1014826/quintessential-chocolate-chip-cookies.html\">recipe from the pastry chef Sherry Yard</a>, with whom I wrote two cookbooks, as my touchstone. It doesn’t matter whether or not I’m adding ingredients like nuts and seeds, or using different types of flours. I always use a quality dark chocolate (70 percent or higher), and I cut it into chunks the way she does. I don’t skimp on quantity when it comes to the chocolate, but in this adaptation I’ve reduced the sugar by 25 percent and thrown in a good measure of rolled oats, sunflower seeds, chia seeds and pumpkin seeds. I’ve made these cookies using half whole-wheat flour and using all unbleached all-purpose flour, and I prefer the whole-wheat version — and not just because it’s healthier. I love the nutty flavor of the flour, which complements the nutty flavor of the seeds.\n<br/><br/>\nYou would think that adding wholesome ingredients like oats and seeds to a classic chocolate-chip cookie would result in something weighty, vintage 1970s, but on the contrary, the oats and seeds stretch the dough and make the cookies lighter than all-flour cookies. Bake them until they’re nice and dark on the bottom, and when you rotate the trays halfway through, tap them on the oven racks to get the cookies to flatten a bit. The end result is a crisp cookie with no shortage of melting chocolate chunks.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/06/03/science/05recipehealth/05recipehealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 4 dozen cookies", "recipeCuisine": "", "recipeCategory": "", "keywords": "chia seeds, chocolate, sunflower seeds, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 183}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 72, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "2 grams", "sodiumContent": "30 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup/60 grams whole-wheat flour", "1/2 cup/65 grams all-purpose flour", "1/2 teaspoon/2 grams baking soda", "4 ounces (1 stick)/ 115 grams unsalted butter, at room temperature", "1/4 cup/50 grams organic granulated sugar (regular will work also)", "1/2 cup/80 grams packed light brown sugar", "1/4 teaspoon/2 grams fine sea salt", "1 egg", "1 teaspoon vanilla/5 milliliters", "1/4 cup plus 2 teaspoons/50 grams sunflower seeds", "2 heaped tablespoons/25 grams pumpkin seeds", "1 tablespoon/12 grams chia seeds", "1/2 cup (scant)/50 grams rolled oats", "8 ounces/225 grams bittersweet chocolate (or more if desired), cut in 1-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together flours and baking soda and set aside. In bowl of a standing mixer fitted with the paddle attachment, cream butter until lemony yellow, about 2 minutes. Scrape down sides of the bowl and paddle. Add organic sugar, brown sugar and salt. Continue creaming mixture on medium speed until it is lump free, about 1 minute. Stop mixer and scrape down sides of the bowl and the paddle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add egg and vanilla and beat on low speed for 15 seconds, or until they are fully incorporated. Do not overbeat. Scrape down sides of the bowl and paddle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On low speed, add sifted flour mixture. Beat slowly until all of the flour is incorporated. Scrape down sides of bowl. Add seeds, oats and chocolate chunks and mix in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees with racks adjusted to the lower third and middle of the oven. Line two baking sheets with parchment paper. Spoon dough by heaped teaspoons (or use a 1-inch scoop) 2 inches apart onto prepared baking sheets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 14 to 15 minutes, until lightly browned, rotating baking sheets from top to bottom and from front to back halfway through the baking. Remove from oven and slide parchment off the baking sheet and onto a work surface. Allow cookies to cool for at least 10 minutes before serving, or for at least 20 minutes before storing in an airtight container. Cookies will keep for three days at room temperature."}]}