{"@context": "http://schema.org", "@type": "Recipe", "name": "Uncooked Tomato and Mint Sauce with Poached Eggs", "description": "This dish turns summer tomatoes into a salsa cruda that can also work well with most any kind of fish. My friend and colleague Clifford A. Wright serves this delicious salsa cruda with grilled salmon. It’s also wonderful with most other fish, grilled, oven-roasted or pan-cooked, and it makes a terrific sauce for foods like cooked grains, the vegetarian burgers I published a few weeks ago or simply cooked green vegetables. One of my favorite uses is in a Mediterranean huevos rancheros: poach an egg, set it on a lightly charred corn tortilla, sprinkle the egg with a little salt and pepper if desired and spoon on the sauce.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/07/22/science/21recipehealth/21recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "italian, mediterranean", "recipeCategory": "breakfast, brunch, dinner, lunch", "keywords": "dairy-free, gluten-free, halal, high protein, kosher, low-carb, low-fat, low-sodium, low sugar, nut-free, vegetarian, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 173, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "348 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 ripe plum tomatoes (about 1 pound)", "2 plump garlic cloves, peeled, halved, green shoots removed", "Salt and freshly ground pepper to taste", "1/2 cup fresh mint leaves, lightly packed.", "3 tablespoons extra virgin olive oil", "4 to 6 eggs", "1 tablespoon vinegar (any type)", "4 to 6 corn tortillas", "Feta cheese for crumbling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut tomatoes in half lengthwise. Place a box grater in a wide bowl, and using the large holes of the grater, grate tomatoes by rubbing the cut side against the grater, with the skin side cupped in your hand. When you feel the holes of the grater against the inside of the tomato skin, you are done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on a food processor fitted with a steel blade and drop in the garlic. When it is chopped and adhering to the sides of the bowl, stop the machine and scrape down the sides with a spatula. Add tomatoes, salt, pepper, mint and olive oil. Process in the machine for 1-2 minutes, until sauce is frothy. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Poach eggs. Fill a lidded frying pan with water and bring to a boil. Set timer for 4 minutes. Add 1 tablespoon vinegar. One at a time, break eggs into a teacup, then tip from teacup into pan (do this 2 at a time). Immediately turn off heat and cover pan tightly. Leave for 4 minutes. Using a slotted spoon or spatula, carefully remove poached eggs. Set on a towel to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While eggs are poaching, heat tortillas by placing them one at a time directly over the flame, until the edges are charred. If you don’t have a gas stove, wrap in foil and heat for 10 minutes in a 350-degree oven. Place a tortilla on each plate and top with a poached egg. Spoon 3 tablespoons of the sauce over the eggs and serve."}]}