{"@context": "http://schema.org", "@type": "Recipe", "name": "Gluten-Free Apple, Pear and Cranberry Pecan Crumble", "description": "This has moved to the top of my favorite crumbles list. I have made apple crumbles before, but I hadn’t cooked the apples first in my other recipes. It makes a huge difference in the sweetness and comfort level of the dish. The pear also contributes to the overall sweetness of the dessert and I love the tangy flavor of the dried cranberries. I have used a gluten-free mix of certified oats (produced in a gluten-free facility) and millet flour, which makes a crumble topping that is truly crumbly. Both tender apples like McIntosh, Gala, Macoun and Cortland, as well as firmer apples like Braeburns and Fujis work well in this dish", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/20/science/21recipehealth/21recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "brunch, dinner, snack", "keywords": "dessert, fall, winter, gluten-free, halal, high fiber, kosher, low-sodium, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 93}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 392, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "6 grams", "proteinContent": "4 grams", "saturatedFatContent": "10 grams", "sodiumContent": "61 milligrams", "sugarContent": "31 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 cups / 125 grams rolled oats", "1/2 cup / 70 grams quinoa flour or millet flour (grind quinoa or millet in a spice mill to make the flour)", "1/3 cup / 63 grams raw brown (turbinado) sugar", "1/2 teaspoon freshly grated nutmeg", "1/8 to 1/4 teaspoon salt (to taste)", "3 ounces (6 tablespoons) cold unsalted butter, cut into 1/2-inch pieces", "1/4 cup / 30 grams pecans", "1 teaspoon lemon zest", "2 pounds / 900 grams / 4 large apples, peeled and cut in approximately 1/2-inch dice (see note)", "2 tablespoons / 60 grams unsalted butter", "2 tablespoons  / 30 grams raw brown (turbinado) sugar", "2 tablespoons fresh lemon juice", "1 teaspoon vanilla extract", "1/2 teaspoon cinnamon", "1/4 teaspoon nutmeg", "1 large ripe but firm pear, peeled, cored and diced", "1 cup / 60 grams dried cranberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make crumble topping first. Preheat oven to 350 degrees. Cover a baking sheet with parchment. Place oats, quinoa flour, sugar, salt and nutmeg in a food processor fitted with steel blade and pulse several times to combine. Add the butter and pulse until the butter is evenly distributed throughout the grain mix. The mixture should have a crumbly consistency. You can also combine ingredients in a standing mixer fitted with the paddle and mix at low speed until mixture has a crumbly consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread topping over parchment-covered baking sheet in an even layer. Place in oven and bake 10 minutes. Rotate pan, stir mixture, and bake another 10 minutes, until nicely browned. Remove from heat and allow to cool. Stir in pecans and lemon zest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn oven up to 375 degrees. Butter a 2-quart baking dish. Cook apples in 2 batches. Heat half the butter over medium-high heat in a large heavy skillet until it foams and foam subsides. Add apples and wait until they begin to sizzle, then add half the sugar and cook, stirring and tossing in the pan, until apples just begin to caramelize, about 10 minutes. Transfer to a bowl and repeat with remaining butter, apples and sugar. When second batch has caramelized, add first batch back into pan, then add lemon juice, vanilla extract, cinnamon and nutmeg and stir together for another minute. Stir in diced pear and dried cranberries and stir everything together. Remove from heat and scrape into buttered baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread crumble topping over apple mixture in an even layer. Place in oven and bake 30 minutes, until bubbling and top is nicely browned. Allow to cool for at least 10 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1016993-gluten-free-apple-pear-and-cranberry-pecan-crumble"}