{"@context": "http://schema.org", "@type": "Recipe", "name": "Tacos with Roasted Potatoes, Squash and Peppers (Rajas)", "description": "You can turn the heat up or down on this taco, depending on your taste for spiciness. Season the potatoes, onions and squash before roasting. A comforting filling that you can heat up or tone down, depending on your taste for spicy. If you like heat, use a preponderance of poblanos and Anaheims for your peppers; if not, use more bell peppers. I season the potatoes, onions and squash with cumin and chili powder before I roast them, and serve the tacos with a cooked salsa ranchera.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/08/19/science/20recipehealth/20recipehealth-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "Serves 4", "recipeCuisine": "mexican", "recipeCategory": "brunch, dinner, lunch, tacos", "keywords": "appetizer, main course, gluten-free, halal, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegetarian, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 66}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 395, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "9 grams", "proteinContent": "12 grams", "saturatedFatContent": "4 grams", "sodiumContent": "945 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 pound potatoes, such as Yukon golds, cut into 1-inch chunks", "Salt to taste", "1 teaspoon lightly toasted cumin seeds, ground", "1 teaspoon mild chili powder", "2 tablespoons extra-virgin olive oil", "1/2 pound summer squash, preferably a dense squash like Ronde de Nice, cut into 1-inch chunks", "1 medium red onion, cut in half lengthwise and sliced in half-moons", "1 pound mixed sweet and hot peppers (such as a mix of poblanos and bell peppers), roasted, peeled, seeded and cut in thin 2-inch strips", "8 warm corn tortillas", "1 recipe salsa ranchera (without chipotles)", "3 ounces goat cheese (about 3/4 cup crumbled)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Line 2 baking sheets with parchment. Place potatoes on one baking sheet and toss with salt to taste, 3/4 teaspoon each of the ground cumin and chili powder, and 1 tablespoon of the olive oil. Spread in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place squash and onion slices on other parchment-covered baking sheet and toss with the remaining olive oil, salt to taste, cumin and chili powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Depending on the size of your oven, roast vegetables together or separately on the middle rack. Roast potatoes for 20 to 25 minutes, stirring after 10 minutes, or until lightly browned and tender all the way through. Remove from oven and transfer to a large bowl. Roast squash and onions for about 15 minutes, stirring after 10 minutes, until tender and lightly colored. Remove from oven and add to bowl with potatoes. Add pepper strips (rajas) and toss together. Season to taste with salt, and add more chili powder if desired. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon filling onto warm tortillas and add a generous spoonful of salsa. Top with goat cheese and serve."}]}