{"@context": "http://schema.org", "@type": "Recipe", "name": "Daniel Boulud’s Chicken Tagine", "description": "This recipe for an elegant North African stew comes out of the kitchen of Boulud Sud, Daniel Boulud’s sophisticated Mediterranean French restaurant in New York. It is a dish steeped in the flavors of North Africa, but also of France. Chicken serves as the protein, bathed in a blend of North African spices — cinnamon and coriander, turmeric, ginger powder and cardamom — combined with tomatoes, saffron and a little stock. Preserved lemons and olives added at the end provide bite. Tagines are often cooked with root vegetables and dried fruits. Boulud, who famously grew up on a farm, in Lyon, uses cauliflower. ‘‘It is maybe a little more French approach to the tagine,’’ he said. Blanching the cauliflower and tomatoes before cooking them may cause some cooks to blanch themselves. But the effort is worth it.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/08/02/dining/02COOKING_CHICKENTAGINE2/02COOKING_CHICKENTAGINE2-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "french, moroccan", "recipeCategory": "dinner", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2336}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1036, "unsaturatedFatContent": "52 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "76 grams", "fiberContent": "12 grams", "proteinContent": "59 grams", "saturatedFatContent": "18 grams", "sodiumContent": "1695 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 1/2 tablespoons sweet paprika", "1 teaspoon garlic powder", "2 teaspoons cinnamon", "3 tablespoons ground coriander", "1 tablespoon plus 1 teaspoon ground turmeric", "1 tablespoon ginger powder", "1/2 tablespoon ground cardamom", "2 1/2 teaspoons ground allspice", "8 chicken thighs, approximately 3 pounds", "Kosher salt and freshly ground black pepper to taste", "2 tablespoons spice mix", "1/3 cup extra-virgin olive oil", "3 Roma tomatoes", "1 head cauliflower, cut into bite-size florets", "1 large white onion, diced", "3 cloves garlic, diced", "1 tablespoon grated fresh ginger", "1 pinch saffron", "1 tablespoon tomato paste", "2 cups chicken stock, homemade or low-sodium", "3 tablespoons preserved lemons, approximately 2 lemons, roughly chopped", "1 cup green olives, like Castelvetranos", "1/2 bunch cilantro, leaves picked and stems discarded."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the spices in a dry sauté pan set over low heat, and toast them gently until they release their fragrance, 2 minutes or so. Transfer to a bowl, and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350. Season the chicken thighs with the salt, pepper and 2 tablespoons of the spice mix, along with 2 tablespoons of the olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil over high heat, and set a large bowl of ice water to the side. Core the tomatoes, and score an X on their bottoms. Boil the cauliflower florets in the water for 3 minutes, then submerge them in the ice water. Boil the tomatoes for 20 seconds, and chill them in the ice water as well. Remove the cauliflower when it is cold, and pat the florets dry. Peel the skin off the tomatoes, then cut them into quarters lengthwise. Trim away the seeds to make petals."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining olive oil in a large sauté pan set over medium heat, and sear the chicken in batches, starting skin-side down, until the thighs are browned. Remove the chicken to a large Dutch oven or tagine pot. Remove all but two tablespoons of the fat in pan, then return it to the heat, and brown the cauliflower and add to the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat below the pan, and add the onion, garlic, ginger and saffron. Cook, stirring, until the onions are translucent, approximately 5 minutes. Add tomato paste and chicken stock, and simmer until reduced by 1/3."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour sauce over the chicken and cauliflower, cover the pot and transfer to oven for 20 minutes. Remove, stir in the tomatoes, preserved lemon and olives, then cover the pot again and cook for an additional 20 minutes or until the chicken is cooked through. Serve the chicken in the pot, garnished with the cilantro leaves, with couscous. Reserve remaining spice mix for the next batch or another use. It keeps well in a sealed container."}], "link": "https://cooking.nytimes.com/recipes/1016987-daniel-bouluds-chicken-tagine"}