{"@context": "http://schema.org", "@type": "Recipe", "name": "Curry-Creamed Spinach and Tofu (or Pork) With Potato Crust", "description": "Coconut milk and yogurt lighten creamed spinach and make it more flavorful, and the addition of tofu or pork turns it into a main course. A crust of thinly sliced potatoes adds a welcome if nontraditional crust.  ", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/13/magazine/13eat1/mag-13eat-t_CA0-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, weekday, casseroles", "keywords": "appetizer, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 111}, "recipeIngredient": ["Salt", " 3 pounds\tspinach, trimmed\n", "2 tablespoon butter\n", "2 teaspoons garam\tmasala or\tcurry powder\n", "¼  teaspoon nutmeg\n", "2 cups coconut milk\n", "½ cup yogurt", "1 brick firm or extra-firm tofu, cut into ½-inch cubes, or 12 ounces\t thinly\t\nsliced pork shoulder", "1 large russet potato, thinly sliced  (with\ta mandoline if\tyou have one)", " 2 tablespoons olive oil", " Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425. Bring a large pot of water to boil, and salt it. When the water is boiling, add the spinach, and cook for about a minute. Plunge the \nspinach into a large bowl of ice water, squeeze the moisture from the leaves and roughly chop them. \n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the butter and garam masala (or curry powder) and nutmeg in a large saucepan over medium heat. When the spices are fragrant, add the coconut \nmilk, yogurt, spinach, tofu (or pork) and 1 teaspoon salt. Bring to a boil, and cook, stirring occasionally, until the spinach has absorbed much of the liquid; taste, and adjust the seasoning, and transfer to an ovenproof dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the potato slices with the oil, and sprinkle with salt and pepper. Lay them over the top of the spinach and tofu (or pork) without overlapping too much. Bake until the potatoes are golden and crisp, 25 to 35 minutes. Scoop into bowls, and serve. \n"}], "link": "https://cooking.nytimes.com/recipes/1016237-curry-creamed-spinach-and-tofu-or-pork-with-potato-crust"}