{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Goat Cheese, Roasted Pepper, and Greens Sandwich", "description": "The title of this recipe was getting very long, so I left the last option – roasted artichoke hearts – out of it. I included them in my sandwich because I had some shriveling artichokes in my produce bin (along with the shriveling red pepper I used) and it didn’t take very long to trim and roast them. But it’s not a must; the peppers and goat cheese with the greens are what really stand out. I stir everything together and spread it on the bread. It’s always a good idea to have a roasted pepper on hand for quick dinners like this.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/05/27/science/30recipehealth/30recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "1 serving", "recipeCuisine": "american, french, italian", "recipeCategory": "dinner, lunch", "keywords": "fall, spring, summer, winter, halal, high fiber, kosher, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 58}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 372, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "5 grams", "proteinContent": "16 grams", "saturatedFatContent": "8 grams", "sodiumContent": "539 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 red pepper, roasted (you’ll  need only half of it for 1 sandwich)", "Salt and freshly ground pepper to taste", "1 trimmed artichoke heart, quartered if small, sliced about 1/2 inch thick if large and tossed with 1 tablespoon extra-virgin olive oil and salt and pepper to taste (optional)", "1 tablespoon chopped blanched greens, such as beet greens, chard, or spinach", "1 ounce goat cheese (about 1/4 cup)", "2 slices whole-grain country bread", "1 1/2 teaspoons extra-virgin olive oil", "1 clove garlic (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dice roasted red pepper  small  and toss with salt, pepper and a teaspoon of olive oil. Measure out 1/4 cup, tightly packed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If including artichoke hearts in the mix, preheat oven or toaster oven to 425 degrees. Cover a baking sheet with parchment and spread the artichoke hearts over the pan in a single layer. Roast for 10 minutes and turn over the pieces. Return to oven and roast for another 10 minutes, until browned and tender. Remove from heat and cut in small dice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mash goat cheese in a bowl and add peppers, chopped greens, and diced roasted artichoke hearts if using. Mash together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If desired, rub 1 slice of bread with a cut clove of garlic, then purée garlic and stir into the goat cheese mixture. Spread goat cheese mixture over the bread. Top with the other slice of bread (rub it with garlic if desired) and press down firmly. Drizzle remaining olive oil over top slice of bread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast  in  toaster oven  3 to 4 minutes, until cheese has melted. Remove from oven, press down firmly, cut in half and serve."}], "link": "https://cooking.nytimes.com/recipes/1016400-grilled-goat-cheese-roasted-pepper-and-greens-sandwich"}