{"@context": "http://schema.org", "@type": "Recipe", "name": "Craig Claiborne’s Smothered Chicken", "description": "Craig Claiborne was a child of Mississippi who started as food editor of The Times in 1957 and did as much as anyone to help bring home cooking into the spotlight. The dish “belongs in the ‘comfort’ category,” he wrote in 1983, “a food that gives solace to the spirit when you dine on it.” You could give your smothered chicken some European flair with mushrooms and small onions in the gravy, as Claiborne did in his experiments with Pierre Franey, then his kitchen co-pilot. Or you could send yourself south to the Creole tastes of the Delta, with a blend of tomatoes, chopped celery, onion and green peppers added to the sauce. But sometimes the easiest way is the best. Try it.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/09/22/multimedia/classic-smotheredchicken/classic-smotheredchicken-mediumThreeByTwo440.jpg", "totalTime": "PT1H20M", "recipeYield": "4 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, easy, weekday, times classics", "keywords": "chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1202}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 682, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "0 grams", "proteinContent": "53 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1161 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 chicken, about 3 1/2 pounds, spatchcocked (split down the backbone, breast left intact and unsplit)", "Kosher salt, to taste", "Freshly ground pepper, to taste", "2 tablespoons unsalted butter", "2 tablespoons all-purpose flour", "1 1/2 cups chicken broth, ideally homemade"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Craig Claiborne believed a cast-iron skillet to be essential for the authentic preparation of this dish. Sprinkle the chicken on both sides with salt and pepper. Select a skillet large enough to hold the chicken comfortably when it is opened up, as for broiling. Fold wings under to secure them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in the pan and add the chicken, skin side down. Cover chicken with a plate that will fit comfortably inside the skillet. Place a heavy can, stone or brick on top of the plate to weigh it down. Cook over low heat, checking the chicken skin, until it is nicely browned, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove weight and plate. Turn chicken so skin side is up. Replace plate and weight and continue cooking for about 15 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken and pour off fat from the skillet, leaving about 2 tablespoons in the pan. Add the flour to the fat, stirring with a wire whisk over medium heat. Gradually add the chicken broth and, when thickened, return chicken to the skillet, skin side up. Add salt and pepper to taste. Cover with the plate and weight and continue cooking over low heat about 20 to 30 minutes longer or until the meat is exceptionally tender. Spoon the sauce over it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut chicken into serving pieces, and serve with the sauce and fluffy rice on the side."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Craig Claiborne’s Smothered Chicken", "description": "Sam Sifton recreates a classic chicken and gravy dish from The Times’s former food editor Craig Claiborne. This Southern recipe first appeared in the newspaper in 1983.", "thumbnailUrl": "https://static01.nyt.com/images/2014/09/22/multimedia/classic-smotheredchicken/classic-smotheredchicken-mediumThreeByTwo440.jpg", "uploadDate": "2014-09-23T16:02:56.000Z", "duration": "PT2M46S"}, "link": "https://cooking.nytimes.com/recipes/1016832-craig-claibornes-smothered-chicken"}