{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Tomatoes and Lentils With Dukkah-Crumbled Eggs", "description": "At once homey and inspired, this recipe from Diana Henry lifts stewed lentils out of the quotidian by topping them with harissa-roasted plum tomatoes, runny-centered eggs, and a pungent, Middle Eastern nut-and-spice mix called dukkah. Ms. Henry calls for making the dukkah with a mortar and pestle, which helps maintain a chunky, rustic texture. A food processor works, too, just add the nuts last so they don’t turn into paste, and don’t overdo the processing. You’re looking for coarsely rather than finely ground. You can make the dukkah, lentils and tomatoes a few days ahead. Just heat them up before serving.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/09/10/dining/10COOKBOOK2/10COOKBOOK2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "british", "recipeCategory": "dinner, lunch", "keywords": "dukkah, eggs, hazelnuts, lentils, sesame seeds, tomatoes, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 45}, "recipeIngredient": ["1/2 cup hazelnuts (skins on)", "1/3 cup sesame seeds", "1 teaspoon nigella seeds", "1 tablespoon sunflower seeds", "3 tablespoons coriander seeds", "1 tablespoon white peppercorns", "1 1/2 tablespoons cumin seeds", "1 teaspoon ground paprika", "1/2 tablespoon sea salt flakes", "12 large plum tomatoes, halved", "3 tablespoons olive oil", "2 teaspoons store-bought harissa", "1/2 tablespoon sugar", "Salt and black pepper, to taste", "6 extra-large eggs", "1 tablespoon olive oil", "1/2 yellow onion, finely chopped", "1 celery stalk, finely chopped", "1 1/3 cups Puy or green lentils", "1 sprig of thyme", "1 bay leaf", "Juice of 1/2 lemon", "1 tablespoon sherry vinegar", "1/4 cup extra-virgin olive oil", "2 tablespoons chopped cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make dukkah, put hazelnuts in a dry skillet and toast over high heat until nuts smell roasted. Do not go too far, as they burn easily. Transfer to a plate to cool slightly, then crush in a mortar to a coarsely ground mixture. Put sesame and nigella seeds in dry skillet and toast until golden brown. Follow with sunflower seeds. Coarsely crush all toasted seeds and add to nuts. Toast coriander seeds until fragrant and coarsely grind. Repeat with peppercorns and cumin seeds. Combine nuts, seeds and toasted spices with the paprika and sea salt. Store in airtight container until needed. Alternatively, place all toasted spices and seeds together in a food processor and pulse until finely ground. Add nuts at end and pulse until they are coarsely ground."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For tomatoes, heat oven to 375 degrees. Lay tomatoes on single layer in roasting pan. Mix olive oil and harissa together and toss with tomatoes to coat, ending cut-side up; sprinkle with sugar and season with salt and pepper. Roast for 45 minutes to 1 hour, or until caramelized in parts and slightly shrunken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook lentils. Heat oil in saucepan and gently sauté onion, celery and garlic until soft but not browned. Add lentils and stir. Add thyme and bay leaf. Pour in 3 cups of water, bring to a boil, reduce heat and simmer, uncovered, until lentils are just tender, about 15 to 25 minutes. When cooked, lentils should absorb all liquid (drain any excess liquid if they haven’t, or add a little more water if they dry out while cooking). Remove thyme and bay leaf. Add lemon juice, vinegar, olive oil and cilantro. Taste for seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the eggs in boiling water for 6 minutes. They should still be a little runny in the middle. Rinse in cold water and once cool enough to handle, quickly peel. Roll lightly in dukkah and set each on top of a serving of lentils and tomatoes. Break the egg in half to see yolk (optional) and sprinkle more dukkah on top. Serve immediately."}]}