{"@context": "http://schema.org", "@type": "Recipe", "name": "Scallion Cream Cheese, Bagel Shop Style", "description": "This recipe for a loftier version of cream cheese is also a formula for any number of dips and spreads. Instead of scallions, you might add horseradish, sriracha, toasted walnuts, blue cheese crumbles, maple syrup or honey.  When shopping for cream cheese, choose one with the shortest list of ingredients; anything besides cream, milk, and salt is a filler or a preservative. But even if you start with less-than-perfect cream cheese from the supermarket, whipping it in a stand mixer and adding heavy cream to loosen the mixture will produce a smooth, fluffy spread. Sour cream would work just as well as heavy cream.  It's best to make this just before serving — at Baz Bagel & Restaurant in Little Italy, they make it three times a day to preserve the fresh taste — but it also lasts well in the refrigerator.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": null, "totalTime": "PT10M", "recipeYield": "6 to 8 servings", "recipeCuisine": "jewish", "recipeCategory": "breakfast, easy, quick, condiments, dips and spreads", "keywords": "cream cheese, scallion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 14}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 259, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "0 grams", "proteinContent": "4 grams", "saturatedFatContent": "15 grams", "sodiumContent": "214 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 pound cream cheese, preferably without additives or fillers, such as Ben’s or Gina Marie", "1/2 to 3/4 cup heavy cream", "2 tablespoons freshly chopped scallions or chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cream cheese in a stand mixer fitted with the paddle attachment. Mix at low speed until smooth. Pour in 1/2 cup heavy cream and raise the speed to medium-low. Mix until whipped and fluffy, adding more cream if needed to loosen the mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At low speed, fold in scallions just until combined. Scrape into a serving bowl and keep refrigerated until ready to serve. (Can be made up to 1 day ahead.)"}]}