{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry Sauce With Pinot Noir", "description": "Some of the best wine on the planet comes from Oregon, and with this recipe Jenn Louis, the chef behind Lincoln Restaurant and Sunshine Tavern in Portland, has found a way to weave it into the Thanksgiving feast: as a boon companion to cranberries. “Many deep red wines, or port, can overwhelm the punchy berry,” said Ms. Louis. “Instead, Oregon pinot noir keeps the cranberry sauce bright and clean.” The recipe here doesn’t hold back; it is shot through with allspice, cloves, peppercorns, rosemary, cinnamon, vanilla and honey, in a mix that calls to mind the rusticity and abundance of the Pacific Northwest.", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19OREGON/19OREGON-articleLarge-v3.jpg", "totalTime": "PT20M", "recipeYield": "2 1/2 cups", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, condiments, sauces and gravies", "keywords": "cranberry, gluten-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 243}, "recipeIngredient": ["10 whole allspice berries", "10 whole cloves", "10 whole black peppercorns", "4 cups fresh or thawed frozen cranberries", "1 1/2 cups Oregon pinot noir", "1 cup light brown sugar, loosely packed", "1 cup clover or wildflower honey", "1 cup fresh orange juice", "6 strips orange zest, about 1 inch by 3 inches, removed with a vegetable peeler", "2 (4-inch) sprigs rosemary", "1 small cinnamon stick", "1 vanilla pod"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine allspice, cloves and peppercorns in a spice grinder or coffee grinder and pulse until finely ground."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine cranberries, wine, brown sugar, honey, orange juice, orange zest, rosemary, cinnamon stick and ground spices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the tip of a paring knife, split vanilla pod lengthwise. Use the back of the knife to scrape seeds from pod. Add seeds and pod to pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring mixture to a boil, then reduce heat to a gentle simmer. Cook, stirring often, until cranberries have burst and liquid thickens slightly, about 15 minutes. Remove from heat and discard zest, rosemary sprigs, cinnamon stick and vanilla pod. Transfer mixture to a bowl and let cool."}]}