{"@context": "http://schema.org", "@type": "Recipe", "name": "Salt-Packed Cold Roast Beef With Bread-Crumb Salsa", "description": "When you cook a large piece of meat or a whole fish in a thick crust of salt, the crust provides both gentle heat and even seasoning. For beef tenderloin, a relatively bland cut, salt-baking is easy and ensures a particularly tasty dish. Serving the perfectly plain, perfectly cooked beef alongside a riotous crunchy salad of fried croutons, tomatoes, lemon segments and scallions makes for a lively main course.\n\nThis recipe – reproduced verbatim from \"Prune,\" the first cookbook by the New York chef Gabrielle Hamilton – isn't like other recipes. (This makes sense, because Ms. Hamilton isn't like other chefs – self-taught, with a quirky menu that reflects her American childhood, French parentage and global palate.) It reflects the book, which is written more like a kitchen manual for Prune's sous chefs than a cookbook for a home kitchen. The recipe may seem long, but with her helpful detail and entertaining language, cooking becomes a pleasure.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/11/05/dining/05JPCOOKBOOK2/05JPCOOKBOOK2-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "beef tenderloin, bread crumbs, cherry tomatoes, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 19}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 770, "unsaturatedFatContent": "43 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "61 grams", "fiberContent": "4 grams", "proteinContent": "28 grams", "saturatedFatContent": "14 grams", "sodiumContent": "856 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["24 ounces trimmed and clean beef tenderloin", "1 tablespoon grapeseed oil", "2 teaspoons finely and freshly ground black pepper", "2 to 3 pounds kosher salt (Diamond Crystal only)", "1 1/2 cups cold water", "1 cup extra-virgin olive oil", "6 ounces day-old peasant bread, torn into free-form smallish croutons", "1 pound assorted sweet cherry tomatoes, split in half", "1 bunch scallions, sliced thinly in rings, from the white all the way up through as much of the green stalk as is edible", "4 small cloves fresh and sticky new garlic, thinly sliced", "1 packed tablespoon plus 1 packed teaspoon salt-packed anchovies, rinsed, filleted and then minced", "2 lemons, zested, supremed and deseeded, and all the juice from what’s left of the skeleton after supreming the segments", "2 tablespoons red wine vinegar", "1/2 cup clean and dry flat-leaf Italian parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the beef:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy cast-iron skillet over medium heat for 5 whole minutes and make sure the hood is on. Rub the fillet with 1 tablespoon oil, then sprinkle and coat evenly with black pepper. Brown the meat thoroughly on every side and the cut ends so that you have formed a nice crust universally around the fillet, creating a barrier for the coming salt crust. (This takes 7 to 8 minutes to brown correctly.) Remove the meat from the pan and let cool on a wire rack set in a sheet pan to have a cool and mostly dry piece of meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the salt with the water to form what looks like bright white wet sand. Spread a thin but solid and even layer of salt on the bottom of a 1/4 sheet pan and set the roast on it, then pack the remaining moist salt tidily around the browned meat, forming a solid case resembling a cast on a broken leg. Where there are cracks, redistribute the salt and fix them. This should be a fun and unfussy task. If you need more salt or more water or less water and more salt, mix up whatever mortar you need to get the beef encased."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the salt-crusted beef on its sheet pan into a 250-degree oven and let it cook for 45 minutes. If you weighed it properly at the outset, 45 minutes at 250 degrees is fail-safe. Otherwise, use an insta-read  thermometer and go in through a cut end to the direct center, and pull it when it hits 125 degrees inside. Crack the salt crust, dust the granules of clinging salt off with a clean, dry side towel, and set to rest on a tray in your station. Don’t refrigerate, but label properly the time and date for Health Department."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the bread-crumb salsa:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small, deep-sided sauté pan, heat the 1 cup of olive oil over medium-high heat. The oil should be just deep enough to submerge the first tip of your index finger. Good olive oil is rarely recommended for frying, so don’t ever do this when you go on to work in a real restaurant, but here at Prune, I really prefer the flavor it adds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oil makes its beautiful, veinous, streaking patterns in the pan, which will move faster as the oil gets hotter, drop in a test piece of crouton. When it sizzles on contact, the oil is ready. Fry the croutons until golden brown, remove with a slotted spoon, and drain in a stack of basket-style coffee filters. Set aside the frying oil to cool. Mix together the tomatoes, scallions, garlic, anchovies, lemon flesh and zest and juice, and the red wine vinegar and toss well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss in the fried bread croutons and dress with 1/3 cup of the now-cool olive oil left over from frying. Rough up the parsley leaves briefly in your hands just to release the grassy aroma and add to the salsa. Sparingly season with salt and pepper to taste, keeping in mind that the filet will bring its own seasoning to the plate."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To plate:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the beef to order, keep portion at 6 ounces. Shingle meat. Drape a good big spoonful of salsa over meat,  but let the perfect wall-to-wall pink of the fillet show — don’t hide that beauty under carelessly placed salsa. Drizzle with some of the remaining fry oil to finish. Do not season further."}]}]}