{"@context": "http://schema.org", "@type": "Recipe", "name": "Salt-Baked Chicken", "description": "", "author": {"@type": "Person", "name": "Eileen Yin-Fei Lo"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "chicken, ginger, kosher salt, main course", "aggregateRating": null, "recipeIngredient": ["1 fresh chicken, about 3 pounds, washed, interior membranes removed, drained, dried thoroughly inside and out", "1 1/2 teaspoons dry vermouth", "1 teaspoon salt", "1 slice of fresh ginger, peeled", "3 scallions, without whisker ends and green tips, washed and dried thoroughly", "1 piece of eight-star anise", "Cheesecloth sufficient to wrap entire chicken", "6 pounds kosher salt", "6 sprigs of coriander for garnishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub inside of chicken cavity with dry vermouth and salt, then place ginger, scallions and anise inside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap chicken entirely in cheesecloth, knotting cloth at neck and tail."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour all kosher salt into a wok and heat over medium flame from 30 to 45 minutes, stirring frequently, until salt is quite hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop out a well in the salt, place chicken, breast side down, in well, then cover completely with salt. Cover wok. Bake chicken for 1 to 1 1/4 hours over medium heat. Chicken should be thoroughly cooked in this time, but to make certain, if desired, pierce thigh with fork. If juice runs clear, the chicken is cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken from wok, brush off salt, remove cheesecloth and discard ingredients in chest cavity. Place chicken on chopping block, cut off legs and wings. Then either cut chicken into bite-size pieces with a cleaver or shred meat with fingers into two-inch-long strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange on a serving platter and garnish with coriander. Serve with individual dishes of scallion-ginger sauce."}]}