{"@context": "http://schema.org", "@type": "Recipe", "name": "Pre-Summer Greek Salad With Shaved Broccoli and Peppers or Beets", "description": "Classic Greek salad is a summer dish in my house; impossible to make if tomatoes are not in season and wonderful. But other vegetables take to the same treatment – a simple dressing with a high ratio of acid (in this case a combination of lemon juice and vinegar with olive oil), feta cheese and lots of mint and parsley. \n\nI don’t normally use uncooked broccoli flowers. But in this case, I slice the florets paper-thin, allowing the flower buds to crumble off when I cut the crowns. Cut like this the broccoli yields to the dressing and maintains its brightness for a much longer time than cooked broccoli does. I’ve made this salad combining broccoli with sweet red pepper and combining it with roasted Chioggia beets (yellow beets also work; red ones, however, bleed into the broccoli). I like both versions equally.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/06/17/science/19recipehealth/19recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "greek, mediterranean", "recipeCategory": "dinner, lunch", "keywords": "fall, spring, summer, winter, gluten-free, halal, high fiber, kosher, low cholesterol, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 63}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 162, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "3 grams", "sodiumContent": "280 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 small red onion, cut in half lengthwise, then thinly sliced across the grain", "3 good size broccoli stalks (usually 1 bunch; stems and crowns)", "1 red bell pepper, cut in thin 2-inch slices, or 2 medium or 4 small beets, roasted, halved and sliced in thin half-moons", "Salt and freshly ground pepper to taste", "2 ounces feta, crumbled (about 1/2 cup)", "2 tablespoons slivered flat-leaf parsley leaves", "2 tablespoons slivered fresh mint leaves", "1 tablespoon fresh lemon juice", "1 tablespoon sherry vinegar", "1/4 cup plus 1 tablespoon extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place onion in a bowl and cover with cold water. Soak while you prepare the broccoli (or for at least 5 minutes), then drain and rinse with cold water. Drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut broccoli stems away from the crowns and peel. Cut in half and lay on the flat side on your cutting surface. Using a vegetable peeler, shave thin ribbons off the stalks. Place in a bowl. Cut crowns in half and lay flat on your cutting board. Using a chef’s knife, shave off the flower buds and slice paper thin where the stems and florets are attached. Add to the bowl with the stems. Add onion and red pepper or beets. Season to taste with salt and pepper. Add herbs and feta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together lemon juice, vinegar and olive oil. Add to vegetables and toss together. Serve at once or leave to marinate for about 15 minutes before tossing again and serving."}], "link": "https://cooking.nytimes.com/recipes/1016581-pre-summer-greek-salad-with-shaved-broccoli-and-peppers-or-beets"}