{"@context": "http://schema.org", "@type": "Recipe", "name": "Refried Bean, Zucchini and Corn Gratin", "description": "This is my own interpretation of a traditional Southwestern dish (that has many interpretations) called Three Sisters Casserole. Three Sisters refers to the Native American practice of growing corn, beans and squash in the same field. I’ve seen many different recipes for Three Sisters Casserole and Three Sisters Gratin, some using winter squash, more using summer squash. Sometimes the vegetables are combined and topped with a layer of polenta. In this version, each element gets its own flavorful layer. Although you can use canned beans for the dish, I urge you to use simmered beans because the refried beans will taste best if you reduce them in their flavorful broth.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/10/health/11recipehealth/11recipehealth-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "southwestern", "recipeCategory": "dinner, casseroles", "keywords": "fall, winter, gluten-free, halal, high fiber, kosher, nut-free, vegetarian, main course, side dish, zucchini", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 222}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 524, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "76 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "16 grams", "proteinContent": "24 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1021 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cups simmered black beans or pinto beans, with liquid (<a href=\"http://cooking.nytimes.com/recipes/1016030-a-big-pot-of-simmered-pintos\">see recipe</a>)", "2 tablespoons grapeseed or sunflower oil", "2 teaspoons cumin seeds, ground", "1 chipotle in adobo, seeded and minced (optional)", "Salt to taste", "1 teaspoon mild or hot chili powder (more to taste)", "2 tablespoons extra virgin olive oil", "1/2 cup minced onion", "Salt to taste", "2 garlic cloves, minced", "1 1/2 pounds zucchini or mixed zucchini and yellow squash, sliced about 1/4 inch thick", "1/2 to 1 teaspoon oregano, preferably Mexican oregano, to taste", "2 cups corn kernels (fresh or frozen)", "1 1/4 cups milk", "1 serrano chile, minced", "1/4 cup cornmeal or polenta", "Salt to taste", "1/2 cup grated asadero, Monterey Jack or pecorino", "1/4 cup crumbled queso cotijo, queso fresco, or feta", "1 tablespoon butter or extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Oil or butter a 2-quart baking dish or gratin dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refry beans: Drain off about 1/2 cup of liquid from beans, retaining it in a separate bowl to use later for moistening beans, should they dry out. Heat oil over medium-high heat in a large, heavy nonstick frying pan and add ground cumin and chili.  Cook, stirring over medium heat, for about a minute, until the spices begin to sizzle and cook. Add beans and optional chipotle.  Fry beans, stirring and mashing with the back of a spoon, until they thicken and form a thin crust on the bottom of the pan. Stir up crust and mix into the beans.  Cook until beans are thick but not dry, about 10 minutes. Add liquid you saved from the beans if they seem too dry. Taste refried beans and adjust salt (they probably won’t need any as the broth reduces when you refry them). Spread in an even layer in the baking dish. (Note: If you use canned beans, do not drain. The frying process will go more quickly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and dry skillet. Heat over medium heat and add olive oil. Add onion and cook, stirring, until tender, about 5 minutes. Add a pinch of salt and garlic and cook, stirring, until garlic is fragrant, about 30 seconds. Add squash, oregano, salt and pepper, and turn up heat slightly. Cook, stirring often or tossing in pan, until squash is translucent and tender, 5 to 10 minutes. Taste and adjust seasoning. Spread in an even layer over the beans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine corn and milk in a saucepan and bring to a simmer. Simmer 5 minutes, until corn is just tender. Stir in cornmeal and minced serrano, add salt to taste, and continue to simmer until mixture is thick, 3 to 5 minutes. Stir in grated cheese. Remove from heat and spread in an even layer over squash. Sprinkle crumbled cheese over top. Dot with butter or drizzle on oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in oven and bake 25 minutes, until bubbly and crumbled cheese is lightly browned. Serve hot or warm."}], "link": "https://cooking.nytimes.com/recipes/1016969-refried-bean-zucchini-and-corn-gratin"}