{"@context": "http://schema.org", "@type": "Recipe", "name": "Main Dish Salad with Tuna and Vegetables", "description": "For the past couple of decades restaurant menus have named any salad that features tuna, whether fresh or canned, raw or cooked, a Niçoise salad. Few of them resemble the traditional summer salad of Nice made with tomatoes and thin-skinned green peppers, cucumbers and other local vegetables such as fava beans and baby artichokes, olives, anchovies, hard-cooked eggs and oil-packed tuna. I often make a meal of a tuna, potato and vegetable salad. If tomatoes are out of season, I shred a carrot; and if green beans don’t look good I use broccoli. Make sure to include lots of minced fresh herbs.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/09/30/health/nutrition/30recipe.health.ready/30recipe.health.ready-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4 to 6 as a main dish", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 14}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 438, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "10 grams", "proteinContent": "18 grams", "saturatedFatContent": "4 grams", "sodiumContent": "873 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons red or white wine vinegar or sherry vinegar", "1 tablespoon fresh lemon juice", "1 small garlic clove, finely minced or pureed in a mortar and pestle", "Salt and freshly ground pepper to taste", "1 teaspoon Dijon mustard", "1/2 cup extra virgin olive oil (can substitute some yogurt for some of the olive oil for a low-fat dressing)", "1 pound medium-size Yukon gold or red bliss potatoes, cut in 1/2 inch dice", "1 6 1/2-ounce can olive oil packed or water-packed light (not albacore) tuna, drained", "1 red or green pepper, cut in thin slices", "3 or 4 tomatoes, cut in wedges, or 1/2 pound carrots, shredded or cut in thin wide strips using a vegetable peeler", "1/2 pound green beans, trimmed and cut in half if long, or broccoli florets", "2 hard-cooked eggs, peeled and cut in wedges", "1 small head of Boston lettuce, romaine heart, or 4 to 5 cups mixed baby salad greens, washed and dried", "2 to 4 tablespoons chopped fresh herbs, such as parsley, basil, tarragon, chives, marjoram"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or pyrex measuring cup, whisk together the vinegar and lemon juice with the garlic, salt, pepper, and Dijon mustard. Whisk in the olive oil and yogurt if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the potatoes above 1 inch simmering water for 10 to 15 minutes, until tender. Transfer to a large salad bowl, aand season with salt and pepper. Add the tuna and while the potatoes are hot toss with 1/4 cup of the dressing. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using green beans, bring a pot of generously salted water to a boil, and fill a bowl with ice water. Add the green beans to the boiling water and cook 4 to 5 minutes, until just tender. Transfer to the ice water, cool and drain. Dry on paper towels. If using broccoli, steam for 5 minutes, refresh with cold water, and dry on paper towels. Add the cooked vegetables to the salad bowl, along with the red or green pepper, carrots if using, and half the herbs, and toss together with another 1/4 cup of the dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the salad: Either add the remaining ingredients to the salad bowl and toss with the remaining dressing, or toss the salad greens and remaining herbs with the remaining dressing and pile onto a platter or wide salad bowl. Top with the potato-tuna-vegetable mixture and garnish with the tomatoes, olives and eggs."}], "link": "https://cooking.nytimes.com/recipes/1016460-main-dish-salad-with-tuna-and-vegetables"}