{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick Steamed Flounder With Ginger-Garlic Mustard Greens", "description": "This recipe, inspired by a Chinatown dinner, puts the bold tastes of sesame oil, ginger and soy sauce front and center. Here, a steamed piece of flounder sits on a bed of mustard greens, limp, tender and infused with garlic. The greens take the place of choy sum, a relative of bok cho, and give the dish a slightly mustardy flavor. It’s a quick, healthy weeknight dinner packed with flavor. Try it tonight.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/02/20/dining/recipes-steamedflounder/recipes-steamedflounder-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "2 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, quick", "keywords": "flounder, mustard greens, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 227}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 320, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "44 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1017 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon vegetable or peanut oil", "1 teaspoon toasted sesame oil, more for drizzling", "3 garlic cloves, minced", "1 1-inch-thick slice peeled fresh ginger root, minced", "2 small bunches mustard greens, cleaned, stemmed and torn into pieces", "1 tablespoon soy sauce, more for drizzling", "2 flounder fillets, 12 ounces each", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oils in a very large skillet. Add garlic and ginger and sauté until fragrant and translucent, about 2 minutes. Add mustard greens, soy sauce and 3 tablespoons water, and sauté until greens start to wilt, 2 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread greens out in pan. Season flounder with salt and pepper, and place on top of greens. Cover pan, reduce heat to medium, and let fish steam until just cooked through, about 6 minutes. If pan dries out before fish is cooked through, add a little more water, a teaspoon at a time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover pan and transfer fish to serving plates. If greens seem wet, turn heat to high to cook off excess moisture. Serve greens on top of fish, drizzled with a little more sesame oil and soy sauce, if desired."}]}