{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Smoked Brisket", "description": "This brisket is pretty close to Nirvana for Texas barbecue fanatics who rely on backyard equipment. No smoker is needed, no mops or mesquite — just time and fire and a reliable thermometer. The long, low smoke replicates the results of the bigger, hotter pits used in Central Texas: fork-tender, peppery meat, each bite bathed in drippings and juice. Use potato rolls or thick white bread to soak it all up.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/05/15/dining/15COOKING-SMOKEDBRISKET2/15COOKING-SMOKEDBRISKET2-articleLarge.jpg", "totalTime": "PT16H", "recipeYield": "At least 12 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, steaks and chops", "keywords": "brisket, peppercorns, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 287}, "recipeIngredient": ["1 whole beef brisket, both point and flat cuts, 10 to 14 pounds (see note)", "2/3 cup black peppercorns", "1/2 to 2/3 cup coarse salt, preferably Morton’s kosher salt", "Hardwood charcoal", "3 cups wood chips, preferably oak, soaked at least 1 hour or overnight"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove brisket from any packaging and dry with paper towels. Place fat side up (with the thicker point cut on top) and use a sharp knife to trim the fat on the top to an even sheath about 1/2-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely grind  peppercorns in a grinder or  coffee mill. Sift through a strainer to remove  fine pepper dust, leaving only pieces. You should have about 1/2 cup pepper. Combine with an equal amount of  salt and rub  over the brisket. The coating should be complete and packed on well: depending on size, you may need to make and use more pepper-salt mixture. Cook immediately, or set on a rack in a sheet pan, cover loosely, and refrigerate for at least 8 or up to 36 hours. This will develop a crustier “bark” on the finished brisket."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and clean the grates of a charcoal grill (if using a kettle grill, it should be at least 22 inches across) or smoker, preferably one with a temperature gauge. Half-fill a chimney starter with charcoal, light it and let burn down until gray with ashes. Dump the charcoal on one side of grill and close lid. When temperature settles at 225 to 250 degrees, place half the wood chips over the coals. Return grate to grill and lay brisket on it, fat side up. Cover."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook at about 225 degrees, maintaining the temperature with additional charcoal and wood chips, for 4 to 6 hours, or until the internal temperature of the meat’s thickest part reaches 170 to 180 degrees on an instant-read thermometer. At this point, you can continue cooking it on the grill, or in a 225-degree oven. In either case, remove brisket from grill and wrap in unwaxed parchment or butcher paper. Then wrap well in foil. Return to grill or place in oven. (Although the internal temperature will remain steady at about 180 degrees during this final cooking, it will take anywhere from 2 to 4 hours more for the meat, fat and collagen to soften completely. Start testing after 1 1/2 hours, prodding brisket with your finger to see how it responds: the meat should become soft and balloon-like, almost jiggly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When meat is done, set aside for at least 30 minutes to let juices settle. (In a cooler, well wrapped, the meat will stay hot for at least 4 hours.) Remove foil and paper. Separate the point from the flat cut; trim off any remaining fat and membrane, and cut into 1/2-inch-thick slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the old-fashioned way with slices of white bread, or with pinto beans, potato salad and coleslaw. For sandwiches, pile slices in soft white or potato rolls, preferably brushed with butter and toasted, and top with raw white onions and pickled cucumber and jalapeño slices."}], "link": "https://cooking.nytimes.com/recipes/1016755-slow-smoked-brisket"}