{"@context": "http://schema.org", "@type": "Recipe", "name": "Brisket in Sweet-and-Sour Sauce", "description": "Brisket is the Zelig of the kitchen. It takes on the character of whoever cooks it. In the early part of the 20th century, when ''The Settlement Cook Book'' reigned supreme in American Jewish households, recipes for savory briskets of beef with sauerkraut, cabbage or lima beans were the norm. As tastes became more exotic, cranberry or barbecue sauce, root beer, lemonade and even sake worked their way into recipes. Here, Coca-Cola is the secret ingredient, along with ginger. \n\nThe result is sublime and the dish only improves if it's cooked a day in advance of serving it. However, you can prepare and serve it the same day, if you'd like, though you may want to use a fat separator to strain the fat from the finished sauce. Several readers commented that the original cooking time and temperature on the recipe (3 hours, including 1 hour uncovered, at 350 degrees) was inaccurate. We've retested and adjusted the recipe, so the brisket now cooks for 5 to 6 hours, covered, at 325 degrees. Please also note that this recipe is not kosher for Passover.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2016/03/30/dining/30COOKING2/30COOKING2-articleLarge.jpg", "totalTime": "PT6H30M", "recipeYield": "12 servings", "recipeCuisine": "jewish", "recipeCategory": "dinner", "keywords": "brisket, garlic, ginger, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1107}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 575, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "1 gram", "proteinContent": "28 grams", "saturatedFatContent": "15 grams", "sodiumContent": "622 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 first-cut brisket, 6 to 7 pounds, rinsed and patted thoroughly dry", "1 medium onion, peeled and quartered", "1 2-inch piece fresh ginger, peeled, cut into chunks", "6 large cloves garlic", "1 cup ketchup", "1/2 cup dry red wine", "1/4 cup cider vinegar", "1/4 cup soy sauce", "1/4 cup honey", "1/4 cup Dijon mustard", "1 tablespoon coarsely ground pepper, or to taste", "1/4 teaspoon ground cloves", "1 1/2 cups Coca-Cola or ginger ale", "1/2 cup olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Let meat stand at room temperature for 30 minutes before cooking. Heat oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place everything but the soda, olive oil and brisket into a food processor, and process with steel blade until smooth. Pour the mixture into a large bowl and whisk in soda and olive oil. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place brisket, fat side up, into a heavy baking pan just large enough to hold it, and pour sauce over it. Cover tightly and bake for 3 hours. Turn brisket over, cover pan, and bake 2 to 3 hours more or until fork-tender. Cool, cover brisket and refrigerate overnight in cooking pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, transfer brisket to a cutting board, cut off fat and slice with a sharp knife against grain, to desired thickness. Set meat aside. Remove any congealed fat from sauce and bring to a boil on top of stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Taste sauce to see if it needs reducing. If so, boil it down for a few minutes or as needed. Return meat to sauce and warm in oven for 20 minutes. Serve warm."}], "link": "https://cooking.nytimes.com/recipes/1016867-brisket-in-sweet-and-sour-sauce"}