{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole-Wheat Seeded Loaves", "description": "This is a whole-wheat adaptation of Jacquy Pfeiffer’s seeded bread from “The Art of French Pastry.” The seeds and the flaked oats are soaked overnight before they’re mixed into the dough. This allows them to absorb moisture and softens them, so that the bread is wonderfully moist, and the seeds won’t be hard on your teeth when you bite. Soaking the seeds also breaks down phytic acid and protease inhibitors, which allows the nutrients   to be more readily absorbed by the body. This is a two-day recipe, as you must allow time for soaking the seeds overnight.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/06/03/science/03recipehealth/03recipehealth-articleLarge.jpg", "totalTime": "PT5H15M", "recipeYield": "", "recipeCuisine": "french", "recipeCategory": "breakfast, brunch, dinner, lunch", "keywords": "dairy-free, halal, kosher, low cholesterol, low-fat, low sugar, nut-free, vegan, vegetarian, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 59}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 266, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "6 grams", "proteinContent": "10 grams", "saturatedFatContent": "1 gram", "sodiumContent": "279 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["25 grams sunflower seeds (approximately 2 tablespoons plus 1 teaspoon)", "25 grams sesame seeds (approximately 2 1/2 tablespoons)", "25 grams flax seeds (approximately 2 1/2 tablespoons)", "25 grams rolled oats (approximately 1/4 cup)", "25 grams pumpkin seeds (approximately 2 tablespoons)", "180 grams water (approximately 3/4 cup) plus about 60 grams additional water", "170 grams bread flour or unbleached all-purpose flour (approximately 1 1/3 cups)", "170 grams lukewarm water (approximately 3/4 cup less 2 teaspoons)", "4 grams dry yeast (approximately 1 teaspoon)", "250 grams whole-wheat flour (approximately 2 cups) or   125 grams bread flour and 125 grams whole-wheat flour", "12 grams sea salt (approximately 1 1/2 teaspoons)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix seeds together with 180 grams of water in a medium mixing bowl; cover with plastic wrap and and let soak overnight in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 170 grams bread flour or all-purpose flour, 170 grams lukewarm water, and yeast in bowl of a standing mixer and mix together until well combined. Cover with plastic and leave to ferment at room temperature for two hours or until it doubles in volume. Meanwhile, remove bowl with nuts and seeds from the refrigerator, drain   and bring to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add drained seeds, 250 grams   whole-wheat flour and sea salt to the starter.   Start mixing on medium speed. The dough should come together in the first minute. If it does not and you see dry ingredients in the bottom of the bowl, add about 1/4 cup of water. Mix dough for 5 minutes on medium speed, then turn the speed up to medium-high and mix   5 to 7 minutes more, or until dough is elastic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover bowl with plastic wrap and set in a warm spot to rise for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust work surface lightly with flour and scrape out dough. Weigh dough and divide into 2 equal pieces. Shape each piece into a ball or into oblong pointed loaves. (For oblong loaves, first shape into balls, cover with a towel or lightly with plastic and let rest for 15 minutes. Then press the dough out to a rectangle about 3/4 inch thick. Take the side closest to you and fold lengthwise halfway to the center of the loaf. Lightly press down to seal. Take the top flap and bring it toward you over the first fold to the middle of the loaf and lightly press down to seal. Flip over so seam is on the bottom and roll back and forth with both hands to form an oblong loaf with pointy ends. Place on a sheet pan lined with parchment paper and repeat with the remaining dough. Cover with a towel and place in a warm spot for one hour.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees with a pizza stone on the middle rack and a small sheet pan on bottom of the oven   for 30 to 45 minutes. Have 1 cup water ready in a small cup or a glass. (If you have a large pizza stone, you can bake both loaves at once. If you have a standard home pizza stone, bake one loaf at a time and place the other loaf in the refrigerator to slow down the fermentation.) Dust a pizza peel or flat baking sheet lightly with flour, semolina or cornmeal and   place one loaf on top. Using a razor blade or a moistened bread knife, make a 1/2-inch deep horizontal cut down the middle of loaf from one end to the other, or if the loaves are round make 2 slashes across top. Slide loaf onto pizza stone and close oven door. Wait 30 seconds, then open oven door quickly and pour water onto the sheet pan on the bottom of the oven to create steam. After 5 minutes take the sheet pan out of the oven. Bake for a total of 30 to 35 minutes, until loaf is dark brown and sounds hollow when you tap the bottom. Transfer loaf to a wire rack to cool completely for 45 minutes.   Repeat with   other loaf."}], "link": "https://cooking.nytimes.com/recipes/1016472-whole-wheat-seeded-loaves"}