{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Ratatouille With Farro", "description": "Ratatouille tastes best the day after you make it, and in the summer, you can serve it chilled or at room temperature, with a vinaigrette drizzled over the top. Here, it tops a pile of farro. Top it with a poached egg, or with crumbled feta or grated Parmesan.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/08/26/science/29recipehealth/29recipehealth-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 6", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, vegetables", "keywords": "fall, summer, halal, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 215}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 522, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "13 grams", "proteinContent": "18 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1393 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds eggplant, cut into 1/2-inch cubes", "3 tablespoons extra-virgin olive oil", "Salt", "3/4 pound (2 medium) onions, thinly sliced", "3/4 pound mixed sweet peppers (red, yellow, green), cut into slices about 3/4 inch wide by 1 1/2 inches long", "4 to 6 large garlic cloves, thinly sliced", "1 1/4 pounds zucchini, sliced about 1/2 inch thick (if very thick, cut in half lengthwise first)", "1 pound tomatoes, peeled, seeded and coarsely chopped", "1 bay leaf", "1 to 2 teaspoons fresh thyme leaves or 1/2 to 1 teaspoon dried thyme", "1/2 teaspoon dried oregano", "Freshly ground pepper", "", "2 tablespoons sherry vinegar or 1 tablespoon sherry vinegar and 1 tablespoon fresh lemon juice", "Salt to taste", "1 very small garlic clove, pureéd", "1 teaspoon Dijon mustard", "6 tablespoons extra-virgin olive oil", "3 to 4 cups cooked farro or spelt", "2 to 4 tablespoons slivered or chopped fresh basil, to taste", "6 eggs, poached", "2 ounces crumbled feta or freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the ratatouille", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees. Place diced eggplant in a large, heavy, flameproof casserole. Toss with 1 tablespoon of the olive oil and salt to taste. Place in hot oven and roast uncovered for 15 to 20 minutes, stirring from time to time, until eggplant is lightly browned and fragrant. Remove the casserole from the oven, cover tightly and allow eggplant to steam in the hot casserole while you pan-cook onions, peppers, and zucchini."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat a tablespoon of the remaining oil over medium heat in a large, heavy skillet. Add onions and cook, stirring often, until just about tender, about 5 minutes. Stir in peppers and a generous pinch of salt. Cook, stirring often, until peppers have softened and smell fragrant, about 5 to 10 minutes. Stir in half the garlic and cook for another minute, then season with salt and pepper and transfer to casserole with eggplant. Heat remaining oil in the skillet and add zucchini. Cook, stirring often, until tender but still bright, about 5 to 10 minutes. Stir in remaining garlic  for a minute, until fragrant, season to taste with salt and pepper, and transfer to casserole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomatoes to the casserole with bay leaf, thyme, oregano, and more salt and pepper to taste. Toss everything together and place over medium-low heat. When vegetables begin to sizzle, cover, reduce the heat to low and simmer, stirring often, for 30 to 45 minutes, until the mix is juicy and fragrant and the vegetables are thoroughly tender. Taste and adjust seasonings.  Serve warm or cold, preferably the next day."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the big bowl", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together ingredients for the vinaigrette."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the big bowl, spoon warm or room temperature farro or spelt into each bowl (1/2 cup to 3/4 cup, to taste). Top with a generous spoonful of ratatouille. Spoon a tablespoon of vinaigrette over the ratatouille and garnish with some of the basil. Top with a poached egg if desired and sprinkle with feta or Parmesan. Garnish with more basil and serve."}]}], "link": "https://cooking.nytimes.com/recipes/1016768-summer-ratatouille-with-farro"}