{"@context": "http://schema.org", "@type": "Recipe", "name": "Long-Simmered Eggplant Stuffed with Farro or Spelt", "description": "This is a riff on imam bayildi, the long-cooking eggplant dish bathed in tomatoes and onions that is one of the great achievements of Turkish cuisine. I added cooked farro to the tomato-onion mix, making this more like a stuffed eggplant dish. The active cooking time is minimal, but the smothered eggplant must simmer for about 1 1/2 hours to achieve the intense, syrupy sauce and deep, rich flavor that make this dish such a wonder. Make it a day ahead for best results, and serve at room temperature on a hot night.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/08/26/science/26recipehealth/26recipehealth-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "Serves 6", "recipeCuisine": "mediterranean, turkish", "recipeCategory": "dinner", "keywords": "dairy-free, halal, kosher, low cholesterol, nut-free, vegan, vegetarian, main course, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 44}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 193, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "7 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "723 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds eggplant (2 to 3 medium or 6 small eggplants), cut in half lengthwise", "1/4 cup olive oil", "1 large or 2 medium onions, sliced very thin", "Salt to taste", "6 garlic cloves, finely chopped", "1 1/2 pounds (3 large or 6 medium) tomatoes, grated or peeled and chopped", "1/4 cup finely chopped fresh parsley", "2 tablespoons finely chopped fresh dill", "2 tablespoons finely chopped fresh basil", "Freshly ground pepper to taste", "1 cup cooked farro or spelt", "1/4 cup water", "2 1/2 teaspoons sugar", "2 tablespoons lemon juice", "Additional minced parsley for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees. Line a baking sheet with foil or parchment and brush with olive oil. Slit eggplants down the middle, being careful not to cut through the skin. Place on baking sheet and bake for 15 to 20 minutes, depending on the size, until outer skin begins to shrivel. Remove from oven and transfer, cut side down, to a colander set in the sink. Allow to drain for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 2 tablespoons of the olive oil over medium heat in a large, lidded skillet and add onions. Cook, stirring often, until very tender, about 8 minutes, and add a generous pinch of salt and the garlic. Cook, stirring, for 30 seconds to a minute, until fragrant. Add tomatoes, herbs, salt to taste, 1 teaspoon of the sugar and the cooked farro or spelt. Transfer to a bowl. Taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn eggplants over and place in the pan, cut side up. Season with salt. Gently pull apart at the slit and fill with the onion, tomato and farro mix. Spoon any mix that couldn’t fit inside the eggplant over the top. Mix remaining olive oil, remaining sugar, water and lemon juice. Drizzle over and around the eggplants. Cover the pan and place over low heat. Cook gently for 1 to 1 1/2 hours, basting from time to time with the liquid in the pan, and adding water to the pan if it becomes too dry (this shouldn’t happen; in my experience, the eggplant releases water as it simmers). By the end of cooking, the eggplants should have collapsed significantly and the liquid in the pan should  be syrupy or even slightly caramelized. Spoon this over the eggplant. Allow to cool in pan, sprinkle with parsley and serve at room temperature."}]}