{"@context": "http://schema.org", "@type": "Recipe", "name": "Double Strawberry Cheesecake", "description": "This creamy pink dessert breaks out of the usual strawberry cheesecake mold. Instead of two distinct layers (creamy cheesecake on the bottom, bright red berries on top), the berries and cream cheese mixture are puréed together until smooth, silky and deeply flavored. A little red wine adds complexity and intensifies the rosy color, but feel free to use water or orange juice instead. Just don’t skip the goat cheese, which tamps down the sweetness and adds a mild and pleasant earthiness to the cake without being an obvious ingredient. You can make this three days ahead; store it in the refrigerator until just before serving. It’s at its best served cold.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/06/25/dining/strawberrycake-still/strawberrycake-still-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "project", "keywords": "cream cheese, goat cheese, strawberries, dessert, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 468}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 370, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "15 grams", "sodiumContent": "251 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 tablespoons/115 grams unsalted butter (1 stick), at room temperature", "2 tablespoons/30 grams packed dark brown sugar", "2 tablespoons/30 milliliters honey", "1 cup/125 grams all-purpose flour", "1/4 cup/35 grams whole-wheat flour", "1 tablespoon/7 grams unsweetened cocoa powder", "3/4 teaspoon/3 grams kosher salt", "1/4 teaspoon/1 gram ground cinnamon", "1/2 cup/120 milliliters dry red wine", "1 envelope (2 1/4 teaspoons/7 grams) powdered gelatin", "1 pound/455 grams cream cheese, cut into small pieces, at room temperature", "2/3 cup/135 grams granulated sugar", "1 cup/8 ounces/225 grams fresh goat cheese, broken into small pieces, at room temperature", "1 pound/455 grams fresh strawberries, hulled and coarsely chopped, plus several pretty whole or sliced strawberries for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the crust: In the bowl of an electric mixer or a food processor, cream together butter and brown sugar until smooth, about 1 minute. Beat in honey."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, whisk together flours, cocoa, salt and cinnamon. With mixer running on low speed or using the pulse button on the food processor, add dry ingredients to butter mixture in two batches. Scrape dough onto a sheet of plastic wrap. Flatten into a disk and chill for at least 2 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dough round between two sheets of parchment or wax paper. Working quickly, roll out dough to a thickness of 1/8 inch. If dough becomes sticky, chill in refrigerator until firm. Transfer dough to an 8- or 9-inch springform pan. Press into bottom of pan and 2/3 up the sides (don’t worry if the sides aren’t even). Prick bottom with a fork. Refrigerate 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Place pan on a baking sheet and transfer it to oven; bake until crust is golden and dry to touch, about 25 minutes. Cool completely on a wire rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the filling: Put red wine in a small saucepan and sprinkle gelatin on top. Let rest for 5 minutes, until absorbed. Put pan over low heat and stir until gelatin dissolves. Don’t let gelatin boil, which impedes its gelling power. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor or electric mixer, combine cream cheese, granulated sugar and goat cheese; blend until smooth. Stop once or twice to scrape down sides of bowl and blend again. Add chopped berries and gelatin mixture and blend until incorporated (berries will break down to a purée, which is fine). Scrape mixture into cooled crust; cover loosely with plastic wrap and refrigerate until set, at least 6 hours or overnight. Top with sliced or whole strawberries before serving."}], "link": "https://cooking.nytimes.com/recipes/1016566-double-strawberry-cheesecake"}