{"@context": "http://schema.org", "@type": "Recipe", "name": "Soy-Ginger Chicken With Greens", "description": "I serve these spicy pan-cooked pounded chicken breasts over a mound of pungent wild arugula or other salad greens. Some of the salad dressing serves as a marinade for the chicken.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/22/science/27recipehealth/27recipehealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, quick", "keywords": "dairy-free, halal, healthy, kosher, low sugar, nut-free, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 563}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 414, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "1 gram", "proteinContent": "32 grams", "saturatedFatContent": "3 grams", "sodiumContent": "515 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon soy sauce", "1/2 teaspoon sugar", "2 tablespoons fresh lime juice", "1 tablespoon seasoned rice vinegar", "Salt to taste", "1 garlic clove, minced or puréed", "2 teaspoons minced fresh ginger", "1/4 cup plus 2 tablespoons grapeseed oil or sunflower oil", "1 tablespoon dark sesame oil", "1 to 2 serrano or Thai green chiles, minced (to taste), or 1/8 to 1/4 teaspoon cayenne", "2 boneless skinless chicken breasts (most weigh 8 to 10 ounces)", "Salt and freshly ground pepper", "2 tablespoons all-purpose flour or a gluten-free flour such as rice flour or corn flour", "2 tablespoons chopped cilantro", "4 cups wild arugula or salad mix, rinsed and spun dry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or measuring cup, whisk together the soy sauce, sugar, 1 tablespoon of the lime juice, the vinegar, salt, garlic, ginger, 1/4 cup of the grapeseed or sunflower oil and the sesame oil. Pour half of this mixture into a bowl large enough to accommodate the chicken breasts and add the remaining tablespoon of lime juice and the chiles or cayenne to the bowl. Cut each chicken breast into 2 equal pieces (3 if 12 ounces or more) and place in the bowl. Stir together and refrigerate for 15 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken from marinade and pat dry with paper towels (discard marinade). Place two sheets of plastic wrap (1 large sheet if you have extra-wide wrap) on your work surface, overlapping slightly, to make 1 wide sheet, and brush lightly with olive oil. Place a piece of chicken in the middle of plastic sheet and brush lightly with oil. Cover the chicken with another wide layer of plastic wrap. Working from the center to the outside, pound chicken breast with the flat side of a meat tenderizer until about 1/4 inch thick. (Don’t pound too hard or you’ll  tear  the meat. If that happens  it won’t be the end of the world, you’ll just have a few pieces to cook.) Repeat with the remaining chicken breast pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the pounded chicken breasts with salt and pepper on one side only. Dredge lightly in the flour (you will not use all of it) and tap breasts to remove excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn oven on low. . Heat a wide, heavy skillet over high heat and add remaining 2 tablespoons grapeseed or sunflower oil. When oil is hot, place one or two pieces of chicken in the pan – however many will fit without crowding. Cook for 1 1/2 minutes, until bottom is browned is spots. Turn over and brown on the other side, about 1 1/2 minutes. (Do not overcook or chicken will be dry.) Transfer to a platter or sheet pan and sprinkle cilantro over the top. Keep warm in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place arugula or salad mix in a bowl and toss with the remaining dressing.  Distribute among plates or arrange on a platter and serve with the chicken."}]}