{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek Beet and Beet Greens Pie", "description": "I’ve made lots of Greek vegetable pies in phyllo pastry using beet greens, but I had not  included the beets. This will now be a regular dish I make with beets in my house. This savory pie, seasoned with mint, parsley and dill, is beautiful, filling and easy to assemble. If you are gluten-free and can’t use phyllo, you can make this as a crustless gratin.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/09/23/science/24recipehealthpie/24recipehealthpie-articleLarge.jpg", "totalTime": "PT1H40M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "greek, mediterranean", "recipeCategory": "dinner", "keywords": "fall, spring, summer, winter, halal, high fiber, kosher, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 81}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 273, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "5 grams", "proteinContent": "9 grams", "saturatedFatContent": "5 grams", "sodiumContent": "491 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 medium or 4 large beets, roasted", "2 generous bunches beet greens (about 3/4 pound), stemmed and washed", "1/4 cup extra-virgin olive oil", "1 large red or yellow onion, chopped", "2 large garlic cloves, minced", "Salt and freshly ground pepper to taste", "3 eggs", "4 ounces / 1 cup feta, crumbled", "1/2 cup chopped fresh parsley", "1/4 cup chopped fresh mint or 1 to 2 tablespoons crumbled dried", "1/4 cup chopped fresh dill", "1 tablespoon butter", "12 sheets phyllo dough"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast beets as directed and allow to cool. Slip off skins and slice in rounds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil, salt generously and add beet greens. Blanch 1 minute, remove from water with a skimmer and transfer to a bowl of cold water. Drain and squeeze out excess water, taking greens up by the handful. Chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the olive oil in a large, heavy skillet over medium heat and add onion. Cook, stirring often, until tender, 5 to 8 minutes, and add garlic and a pinch of salt. Cook, stirring, until garlic is fragrant, 30 seconds to a minute, and stir in blanched greens and salt and pepper to taste. Stir until ingredients are mixed and remove from  heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk eggs in a large bowl and crumble in feta. Whisk together, then stir in greens and beets. Add chopped fresh parsley, mint and dill. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375ºF. Combine butter and remaining 2 tablespoons olive oil in a microwave-safe cup or bowl or in a small saucepan, and heat gently (50 percent power if using microwave) until butter has melted. Lightly brush a 10-inch straight-sided tart pan or cake pan, either ceramic or metal, with butter/oil mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay a sheet of phyllo in the pan, tucking it into the seam, with edges overhanging the rim. Brush phyllo lightly with butter/oil mix and turn the pan slightly, then place another sheet on top, positioning it so  the edges overlap another section of the pan’s rim. Continue to layer in 5 more sheets of phyllo, brushing each one with butter and oil and staggering them so  the overhang on the rim of the pan is evenly distributed and covers entire pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill lined pan with beet and greens mix, scraping every last bit into the pan with a spatula, then fold overhanging phyllo edges in over the filling, brushing each one lightly with butter/oil mix. Layer remaining 5 sheets of dough over filling, brushing each sheet with butter and olive oil and rotating pan slightly after each addition. Crimp edges down into the sides of the pan. Brush top with butter and oil. Pierce top of pie in several places with a sharp knife. Bake for 40 to 50 minutes, until top is golden brown. Serve warm or at room temperature. Recrisp crust in a low oven for 10 to 20 minutes if necessary before serving."}]}