{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Roasted Fish With Mustard and Dill", "description": "What if, instead of my usual hot-roasting method, I wrapped a whole fish tightly in parchment and put it in a slow oven? It was a technique I had never seen in a cookbook, and when I described it to Eric Ripert, the chef and an owner of Le Bernardin, he said it was new to him. The experiment worked beautifully. A week later, to serve with Portuguese white wines, I had the opportunity for an encore. This time it was a two-pound porgy, and again, after exactly an hour, the bone lifted easily from the perfectly cooked, moist and silken flesh. Lemon, ginger, mustard and herbs brought it into harmony with the wines.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/06/11/dining/11PAIR1/11PAIR1-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, for two, roasts", "keywords": "dill, fish, mustard, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 133}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 678, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "3 grams", "proteinContent": "93 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1434 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 lemon", "1 2-inch piece fresh ginger, peeled and chopped", "2 tablespoons minced fresh dill", "3/4 teaspoon brown mustard seeds", "Salt and ground black pepper", "1 2-pound porgy, black sea bass, ocean perch or similar fish, gutted and scaled", "2 tablespoons extra-virgin olive oil", "1 shallot, chopped", "1/2 cup dry white wine", "1 tablespoon Dijon mustard", "2 tablespoons crème fraîche"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 200 degrees. Cut lemon in half, juice half and set aside. Chop remaining half and mix in a bowl with half the ginger, half the dill and 1/2 teaspoon mustard seeds. Season with salt and pepper. Rub outside of fish with 1 tablespoon oil. Fill cavity with ginger, lemon and dill mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut 2 large sheets parchment a good 3 inches bigger, all around, than the fish. Place the fish on 1 sheet, cover with second and crimp the sheets together to enclose the fish tightly. Place package, crimped side down, on a baking sheet. Roast for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat remaining oil in a small skillet, add rest of ginger and the shallot and sauté on low until shallot is translucent. Add remaining mustard seeds. Stir in reserved lemon juice and the wine. Cook on low 2 to 3 minutes, until slightly reduced. Stir in mustard and crème fraîche and cook another few minutes until sauce has thickened a bit. Season with salt and pepper and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When fish is cooked, remove it to a large platter or cutting board, turning the package crimped side up. Remove top sheet of parchment. Use a spatula to lift off top layer of fish; place on a serving dish. Lift out bones. Place bottom layer of fish on dish. Gently reheat sauce, fold in remaining dill, spoon sauce down the center of each fillet and serve."}], "link": "https://cooking.nytimes.com/recipes/1016561-slow-roasted-fish-with-mustard-and-dill"}