{"@context": "http://schema.org", "@type": "Recipe", "name": "Berry Clafoutis", "description": "Clafoutis, as you may must know by now, are among my favorite vehicles for seasonal fruit. I love the way blueberries and blackberries bleed into the batter as this bakes. Let it cool for about a half- hour, or completely, before you serve it, and be careful when you cut into it, as the berries can splatter when they’re warm. My clafoutis are not very sweet, and I enjoy them for breakfast as well as for dessert. If you’re making this for a dinner, you can make it several hours ahead. The leftovers will keep for about 3 days in the refrigerator.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/05/20/science/23recipehealth/23recipehealth-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "breakfast, brunch, dinner", "keywords": "dessert, halal, kosher, low-sodium, vegetarian, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 267}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 192, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "78 milligrams", "sugarContent": "23 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cups/450 grams mixed blueberries and blackberries (or use just one type), rinsed and drained on paper towels", "2 tablespoons kirsch, eau de vie de myrtille or crème de cassis (optional)", "7 tablespoons/105 grams sugar, preferably organic", "About 1/3 cup/40 grams unbleached all-purpose flour", "About 1/3 cup/35 grams almond flour", "3 extra-large eggs (165 grams)", "1 vanilla bean, scraped, or 1 teaspoon vanilla extract", "Pinch of salt", "About 2/3 cup/165 grams low-fat yogurt or kefir"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss berries in a medium bowl with the kirsch, eau de vie or crème de cassis and 2 tablespoons of the sugar, and let sit for 30 minutes. Meanwhile, sift together all-purpose flour and almond flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Butter a 9- or 10-inch ceramic tart pan or clafoutis dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, beat eggs with remaining sugar, seeds from the vanilla bean or vanilla, and salt. Place a strainer over the bowl and drain berries, allowing all of the liquid from the berries to run into the egg and sugar mixture. Whisk to combine. Arrange drained berries in the buttered baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the sifted flours into the egg mixture and whisk until smooth. Add yogurt or kefir and combine well. Pour over fruit, scraping out all of the batter with a rubber spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 35 minutes, or until the top is browned and the clafoutis is firm and puffed. Press gently on the top in the middle to see if it’s firm. If it isn’t, return to the oven for 5 minutes. Remove from the oven and cool on a rack. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1016382-berry-clafoutis"}