{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick Pan-cooked Mushrooms", "description": "I serve these with chicken, fish, and pasta. I’ve made the dish with mushrooms that had seen better days and I’ve made it with nice fresh ones. The latter was prettier and the mushrooms juicier, but it’s delicious even if the mushrooms aren’t at their freshest.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/10/27/health/nutrition/27recipe.health.ready/27recipe.health.ready-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 71}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 123, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "390 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 pound white or cremini mushrooms, rinsed briefly and wiped dry", "2 tablespoons extra-virgin olive oil", "Salt and freshly ground pepper", "2 shallots, minced", "2 to 4 garlic cloves (to taste), minced", "2 teaspoons chopped fresh thyme or rosemary (or a combination), or 1/2 to 1 teaspoon dried", "1/4 cup dry white wine, such as Sauvignon blanc"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim off the ends of the mushrooms and cut in thick slices. Heat a large, heavy frying pan over medium-high heat and add 1 tablespoon of the olive oil. When the oil is hot (you can feel the heat when you hold your hand above the pan), add the mushrooms and cook, stirring or tossing in the pan, for a few minutes, until they begin to soften and sweat. Add the remaining oil, turn the heat to medium, and add the shallots, garlic, and herbs. Stir together, add 1/2 teaspoon salt and freshly ground pepper to taste, and cook, stirring often, for another 1 to 2 minutes, until the shallots and garlic have softened and the mixture is fragrant. Add the wine and cook, stirring often and scraping the bottom of the pan, until the wine has evaporated. Taste and adjust seasonings. Remove from the heat and serve."}]}