{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Fish With Pimentón Aioli", "description": "Pimentón is made from a red pepper similar to that used to make paprika, but it’s smoked before grinding. It can be hot (though not super hot) or mild (which is called “sweet,” though the flavor is more bitter than anything else). Whether you know it or not, you’ve probably eaten it: it’s the dominant spice in chorizo. It’s also among the best examples of how appealing the addition of smoke can be. Here it goes on both the fish you’re going to grill and in the aioli you’re going to use to accompany it. The combination is outstanding.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/02/20/dining/recipes-grilledswordfishpimenton/recipes-grilledswordfishpimenton-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "spanish", "recipeCategory": "dinner, quick", "keywords": "main course, pimenton, swordfish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 166}, "recipeIngredient": ["2 teaspoons minced garlic", "Salt and freshly ground black pepper", "3 teaspoons pimentón", "2 tablespoons extra-virgin olive oil", "2 swordfish or other fish steaks, about 1 1/2 pounds", "1/2 cup mayonnaise", "Lemon juice to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start a grill or preheat broiler. Mix together all but 1/2 teaspoon garlic, some salt and pepper, half the pimentón and olive oil. Brush one side of fish steaks with this mixture (if you are broiling, brush both sides). Put on grill, sauced side down, and brush other side. Grill or broil, turning once, until done, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine mayonnaise with remaining garlic and pimentón; add a little lemon juice and whisk; taste and adjust seasoning. Serve fish with a dollop of aioli."}]}