{"@context": "http://schema.org", "@type": "Recipe", "name": "Andean Bean Stew with Winter Squash and Quinoa", "description": "This savory, filling pot of beans is inspired by a Chilean bean stew. I’ve substituted quinoa for the corn that the authentic version calls for. Make it a day ahead for the best flavor.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/11/06/health/nutrition/06recipe.health.readys/06recipe.health.readys-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "Serves 6 to 8 generously", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 85}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 298, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "12 grams", "proteinContent": "15 grams", "saturatedFatContent": "1 gram", "sodiumContent": "451 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 pound dried pinto beans, rinsed and picked over, soaked in 2 quarts water overnight or for 6 hours", "Salt", "1 tablespoon extra virgin olive oil", "1 medium onion, chopped", "1 tablespoon sweet paprika", "4 large garlic cloves, minced", "1 bay leaf", "1 (14-ounce) can chopped tomatoes, with liquid", "1 pound winter squash, such as butternut, peeled and cut into 3/4-inch cubes", "1/2 cup quinoa, rinsed thoroughly", "Freshly ground pepper", "3 tablespoons chopped fresh basil or parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the beans and soaking water in a large pot. Add water if necessary to cover the beans by about 2 inches, and bring to a boil. Skim off foam, reduce the heat to low, cover and simmer gently for 60 minutes, or until the beans are tender but intact. Add salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, heavy nonstick frying pan and add the onion. Cook, stirring, until the onion is tender, about 5 minutes, and add the paprika. Stir together for about a minute, and add the garlic. Cook, stirring, for a minute or two, until the garlic and onions are very fragrant but not brown, and stir in the tomatoes and 1/2 teaspoon salt. Cook, stirring often, until the tomatoes have cooked down slightly and smell fragrant, 5 to 10 minutes. Remove from the heat and scrape the contents of the pan into the pot of beans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the beans back to a simmer, add the bay leaf and winter squash, and simmer, covered, for 30 minutes, or until the squash and beans are thoroughly tender. Add the quinoa and simmer for another 20 to 30 minutes, until the quinoa is translucent and displays an opaque thread. Taste and adjust salt. Add a generous amount of freshly ground pepper. Stir in the basil or parsley, simmer for a couple of minutes more, and serve, with cornbread or crusty country bread."}], "link": "https://cooking.nytimes.com/recipes/1016494-andean-bean-stew-with-winter-squash-and-quinoa"}