{"@context": "http://schema.org", "@type": "Recipe", "name": "Spring Rolls With Shredded Broccoli Stems, Vermicelli and Red Pepper", "description": "Lately I’ve been finding bags of shredded broccoli stems or broccoli stem slaw in supermarkets. I used just such a bag for this. You can grate the stems that come with your bunch broccoli for these, or you can save a bit of time and effort by buying the bagged product. \n\nWhichever way you go, these light, pungent spring rolls are easily assembled. The only problem you may have is if they sit for too long. If the broccoli stems have not been purged before you make the spring rolls they will continue to drain and the water can eventually dissolve the wrappers (I learned this when I made them, kept them overnight and took them the next day on a flight).", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/06/17/science/20recipehealth/20recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Makes 8 spring rolls", "recipeCuisine": "vietnamese", "recipeCategory": "dinner, lunch", "keywords": "appetizer, dairy-free, halal, kosher, low cholesterol, low-fat, low sugar, nut-free, vegan, vegetarian, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 175, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "0 grams", "sodiumContent": "382 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["2 ounces rice vermicelli (thin rice sticks)", "1/4 cup rice vinegar", "2 teaspoons soy sauce", "3 cups grated broccoli stems (it’s fine to use a packaged mix of grated broccoli stems and carrots)", "Salt to taste", "4 ounces firm tofu, cut in 1x1/2-inch dominoes", "1 tablespoon light miso", "1 tablespoon chopped chives", "2 tablespoons chopped Thai basil or tarragon", "2 tablespoons mint leaves, coarsely chopped, plus additional leaves", "1/2 cup cilantro, chopped, plus additional sprigs", "8 inner romaine lettuce leaves, chopped", "16 to 24 pieces pickled ginger (to taste)", "8 8-1/2-inch rice flour spring roll wrappers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rice noodles in a large bowl and cover with hot water. Soak for 20 minutes, or until pliable. Meanwhile, bring a large pot of water to a boil. Drain the noodles and add to the boiling water. Boil 1 minute and drain. Rinse with cold water and transfer to a bowl. Cut the noodles into 2-inch lengths with kitchen scissors. Toss with 2 teaspoons of the rice vinegar and the soy sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the shredded broccoli stems in a colander and toss with salt to taste. Let drain for 15 minutes and squeeze out excess water. (This step can be omitted if serving the spring rolls right away)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine shredded broccoli stems with chopped herbs and 2 tablespoons of the rice vinegar in a large bowl. Place lettuce in another bowl and toss with remaining vinegar and salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat tofu pieces dry with paper towels and spread a little miso on each piece."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a bowl with warm water and place a spring roll wrapper in it just until it is pliable, about 30 seconds. Remove from water and drain briefly on a kitchen towel. Place wrapper on your work surface and arrange several cilantro sprigs and whole mint leaves, vein side up, on wrapper. Leaving a 2-inch margin on the sides, place a handful of the broccoli stem mixture on the wrapper, slightly nearer to the edge closest to you. Top with a handful of lettuce, then a handful of noodles. Arrange 2 pieces of tofu and 2 or 3 slices of pickled ginger on top of the noodles. Fold in sides of wrapper, then roll up tightly. To really firm up the rolls, wrap tightly in plastic wrap. Refrigerate until ready to serve."}], "link": "https://cooking.nytimes.com/recipes/1016582-spring-rolls-with-shredded-broccoli-stems-vermicelli-and-red-pepper"}