{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Pepper Risotto", "description": "As this stunning risotto simmers, it takes on a beautiful red hue from the peppers. If you choose to use the saffron the risotto will have an added dimension of flavor and an even more beautiful color.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/09/26/health/nutrition/25recipe.health/25recipe.health-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 93}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 392, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "3 grams", "proteinContent": "14 grams", "saturatedFatContent": "3 grams", "sodiumContent": "963 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["6 to 7 cups chicken or vegetable stock", "2 tablespoons extra virgin olive oil", "1/2 cup finely chopped onion or shallot", "2 plump garlic cloves, minced", "2 large red peppers, finely diced", "Salt to taste", "1 1/2 cups arborio or carnaroli rice", "1/2 cup dry white wine", "A generous pinch of saffron threads (optional)", "Freshly ground pepper to taste", "2 tablespoons chopped fresh parsley, or a mixture of parsley and thyme", "2 ounces Parmesan cheese, grated (1/2 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a simmer in a saucepan, with a ladle nearby. Season generously with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large, wide, heavy skillet or saucepan over medium heat and add the onions or shallots. Cook gently until they begin to soften, about 3 minutes. Add the garlic, peppers, and 1/2 teaspoon salt and cook, stirring, until the peppers are limp and fragrant, about 8 to 10 minutes. Add the rice and stir over medium heat until the grains are separate and beginning to crackle, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the wine and cook over medium heat, stirring constantly. The wine should bubble, but not too quickly. You want some of the flavor to cook into the rice before it evaporates. When the wine has just about evaporated, stir in a ladleful or two of the simmering stock (about 1/2 cup), enough to just cover the rice. The stock should bubble slowly (adjust heat accordingly). Rub the saffron threads between your fingers and add to the rice. Cook, stirring often, until the stock is just about absorbed. Add another ladleful or two of the stock and continue to cook in this fashion, not too fast and not too slowly, stirring often and adding more stock when the rice is almost dry, for 25 minutes, until the rice is cooked through but still a little chewy. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the rice is cooked through, add a generous amount of freshly ground pepper, and stir in another half cup of stock, the Parmesan and the herbs. Remove from the heat. The rice should be creamy; if it isn’t, add a little more stock. Stir once, taste and adjust seasonings, and serve."}]}