{"@context": "http://schema.org", "@type": "Recipe", "name": "Tacos With Spicy Tofu, Tomatoes and Chard", "description": "In these tacos, tofu stands in for meat in a vegan picadillo, cooked in a modified salsa ranchera. I’ve never been one for meat “substitutes,” and I normally don’t advocate using tofu in anything other than Asian dishes. But I find this pretty irresistible, a sort of vegan picadillo. You can make it spicier by adding more chiles, milder by using less. The tofu is cooked in a modified salsa ranchera; being tofu, it absorbs the sweet and spicy flavors of the tomatoes and chiles. I used firm tofu and mashed it with the back of my spoon. Silken tofu is also a good choice, though then you will have something more akin to Mexican scrambled eggs.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/08/19/science/22recipehealthalt/22recipehealthalt-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 tacos, 4 servings", "recipeCuisine": "mexican", "recipeCategory": "brunch, dinner, lunch, tacos", "keywords": "appetizer, main course, gluten-free, halal, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 129}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 334, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "9 grams", "proteinContent": "21 grams", "saturatedFatContent": "2 grams", "sodiumContent": "862 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 pound tomatoes", "1/2 pound Swiss chard, stemmed, leaves washed in 2 changes of water", "Salt to taste", "1 tablespoon grapeseed oil", "1 small or 1/2 medium red onion, chopped (about 1 cup)", "2 large garlic cloves, minced", "1 teaspoon lightly toasted cumin seeds, ground", "1 teaspoon mild chili powder", "1 to 2 serrano or jalapeño chiles (to taste), seeded if desired and minced", "1 14-ounce box firm tofu, drained and cut into medium-size cubes", "1/4 cup chopped cilantro (more to taste)", "8 warm corn tortillas", "Salsa fresca (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat broiler with rack set about 4 inches from the heat. Cover a baking sheet with foil. Place tomatoes on foil and broil for 6 minutes, until blackened in spots or all over. Using tongs, flip over and broil for another 4 to 6 minutes. The tomatoes should be charred and cooked through. Remove from oven and tip, with juices, into a bowl. Allow to cool until you can handle them, then core and discard skins. Purée, along with juices in the bowl, in a blender or a food processor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a large pot of water to a boil while you stem and wash the chard. When water comes to a boil, add salt to taste and chard. Blanch for 1 minute and transfer to a bowl of cold water. Drain and take up chard by the handful to squeeze out excess water. Cut in 1/4-inch wide strips and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large, heavy skillet over medium heat and add onion. Cook, stirring, until tender and beginning to color, 5 to 8 minutes. Add a generous pinch of salt, the garlic, cumin and chili powder and cook, stirring, until garlic is fragrant, about 30 seconds. Add puréed tomatoes, which should sizzle as soon as they hit the pan. Cook, stirring often, until purée thickens and leaves a canal when you run your spoon down the middle, about 5 minutes. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add minced chiles and tofu, and mash tofu into the tomatoes using the back of your spoon. Add Swiss chard and salt to taste, and continue to cook for another 5 minutes, stirring and mashing tofu. Stir in cilantro. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat tortillas and top with tofu mix. Serve with salsa on the side if desired."}], "link": "https://cooking.nytimes.com/recipes/1016748-tacos-with-spicy-tofu-tomatoes-and-chard"}