{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Beans With Sweet Potatoes and Chipotles", "description": "I used Rancho Gordo Mexican heirloom San Franciscano beans for this richly flavored dish. The beans are dark reddish purple, not too big, with an earthy, sweet taste that fits perfectly into this slightly sweet and spicy baked bean dish. From the supermarket, use red beans or pintos.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/10/health/10recipehealth/10recipehealth-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "southwestern", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, nut-free, vegan, vegetarian, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 187}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 190, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "6 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "644 milligrams", "sugarContent": "14 grams", "transFatContent": null}, "recipeIngredient": ["1 pound red beans, San Franciscano beans, or pintos, washed, picked over for stones, and soaked in 2 quarts water for 4 hours or overnight", "1 bay leaf", "2 tablespoons extra virgin olive oil", "1 yellow or red onion, chopped", "Salt to taste", "2 to 4 garlic cloves (to taste), minced", "1/4 cup tomato paste", "2 tablespoons honey or agave nectar", "2 chipotles in adobo, seeded and minced", "2 large sweet potatoes (1 1/2 to 2 pounds), peeled and cut in large dice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place beans and soaking water in an ovenproof casserole. Add bay leaf and bring to a gentle boil over medium heat. Reduce heat to low, cover and simmer 1 hour. Check beans at regular intervals to make sure they are submerged, and add water as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat oven to 300 degrees . Heat 1 tablespoon of the oil in a heavy skillet and add onion. Cook, stirring often, until tender, about 5 minutes. Add a generous pinch of salt and the garlic and cook, stirring, until garlic is fragrant, 30 seconds to a minute. Stir onion and garlic into beans, along with salt to taste, tomato paste, honey or agave nectar, and chipotles, and stir together. Add sweet potatoes and bring back to a \nsimmer, drizzle with remaining olive oil, and place in oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 1 to 1 1/2 hours, until beans are thoroughly soft and sweet potatoes are beginning to fall apart, checking and stirring from time to time to make sure that beans are submerged. Either add liquid or push them down into the simmering broth if necessary. Remove from heat and serve hot or warm."}], "link": "https://cooking.nytimes.com/recipes/1016968-baked-beans-with-sweet-potatoes-and-chipotles"}