{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Skirt Steak With Whole Roasted Plantains", "description": "Arrachera, the cut of meat that is usually translated as \"skirt steak,\" is very popular for grilling in Latin America, and also in the United States among butchers — because they know the difference between the inside and the outside skirt. The arrachera is the outside skirt, and it's thicker, much more flavorful and usually more tender than the inside, a flatter and fibrous cut. (The names refer to which part lies deeper inside the animal.) The chef Eric Werner serves this at Hartwood, in Tulum, Mexico, where all the cooking is done over wood; if you have a grill, this steak will benefit from it. Cook it over high heat, but just for long enough to sear the outside. The plantains are absurdly simple to make but have an especially lovely texture from being roasted in their skins. Think of them together as steak and potatoes, and serve with a salad to make a fast weeknight dinner. ", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/24/dining/Spiced-Skirt-Steak/Spiced-Skirt-Steak-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, steaks and chops", "keywords": "main course, plantain, steak", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 49}, "recipeIngredient": ["2 12-ounce skirt steaks, at least 3/4-inch thick (this cut is sometimes called “outside skirt”)", "2 teaspoons coarse salt", "2 teaspoons freshly ground pimento or Tabasco, or 1 teaspoon each black pepper and allspice", "4 large plantains, very ripe (mostly black but with some yellow, and not mushy)", "Honey for drizzling, preferably raw", "1 stick cinnamon or canela, or a pinch ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim steak of any fat and membrane. Mix salt and pimiento Tabasco and rub lightly into steaks. (This can be done up to 4 hours ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a grill or place a heavy skillet over high heat. Heat oven to 450 degrees and place another large cast-iron skillet inside. When oven is hot, place plantains, skin on, in the oven skillet. Roast for 15 to 20 minutes, until the skins split at the seams and the natural sugars caramelize on the skin. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place steak on grill or in the skillet on top of the stove. Sear, turning a few times, until crisp outside and rare to medium-rare inside (8 to 10 minutes)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove steak from pan, tent with foil and let rest 3 to 4 minutes, turning a few times to allow juices to absorb evenly through the meat. To serve, cut each steak in half crosswise, then cut each half in thick slices against the grain. Divide slices between four plates and add a whole plantain to each, opening seams with a sharp knife to expose the flesh. Drizzle each plantain lightly with honey, then grate a dusting of cinnamon on top."}]}