{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggplant and Tomato Gratin", "description": "This is a delicious, low-fat version of eggplant Parmesan. Instead of the usual heavy, breaded fried eggplant, here the eggplant is roasted and sliced, then layered with a rich tomato sauce and freshly grated Parmesan, and baked in a hot oven until bubbly.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/09/02/health/nutrition/02recipehealth.ready/02recipehealth.ready-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 106}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 187, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "7 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "808 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 small or 1/2 medium onion, chopped", "2 to 4 garlic cloves (to taste)", "2 pounds fresh tomatoes, quartered if you have a food mill, peeled, seeded and chopped if you don’t, or  1 1/2 (28-ounce) cans chopped tomatoes, with juice", "Salt and freshly ground pepper", "1/8 teaspoon sugar", "2 sprigs fresh basil", "2 pounds eggplant, roasted", "Salt and freshly ground pepper", "2 tablespoons slivered fresh basil leaves", "2/3 cup freshly grated Parmesan", "1/4 cup breadcrumbs", "1 tablespoon extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the eggplant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to make the tomato sauce, heat the olive oil in a large, heavy, preferably nonstick skillet over medium heat and add the onion. Cook, stirring, until tender, about 5 to 8 minutes, and add the garlic. Cook, stirring, until fragrant, about a minute, and add the tomatoes, salt (1/2 to 1 teaspoon), pepper, sugar, and basil sprigs. Turn the heat up to medium-high and when the tomatoes are bubbling, stir well and turn the heat back to medium. Cook, stirring often, until the tomatoes have cooked down and are beginning to stick to the pan, about 25 minutes. Remove the basil sprigs, wiping any sauce that adheres to them back into the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the sauce through the fine blade of a food mill if you have not peeled the tomatoes. Otherwise pulse in a food processor fitted with the steel blade until coarsely pureed. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400ºF. Set aside 1/4 cup of the Parmesan and mix with the breadcrumbs. Oil a 2-quart gratin or baking dish with olive oil. Spread 1/2 cup tomato sauce over the bottom of the dish. Slice the roasted eggplant about 1/4 inch thick and set an even layer of the slices over the tomato sauce. Season with salt and pepper. Spoon a layer of sauce over the eggplant and sprinkle with basil and Parmesan. Repeat the layers one or two more times, depending on the shape of your dish and the size of your eggplant slices, ending with a layer of sauce topped with the Parmesan/breadcrumb mixture you set aside. Drizzle 1 tablespoon olive oil over the top. Place in the oven and bake for 30 to 35 minutes, until bubbling and browned on the top and edges. Remove from the heat and allow to sit for at least 10 minutes before serving. Serve hot, warm, or room temperature."}], "link": "https://cooking.nytimes.com/recipes/1016443-eggplant-and-tomato-gratin"}