{"@context": "http://schema.org", "@type": "Recipe", "name": "Crisp Raw Apple Pie", "description": "Instead of an oven, use a food processor to create this crisp, fresh apple pie. It was created for raw-food dieters, but it also gives home cooks a fast and refreshing dessert option that takes a fraction of the time of a traditional fruit pie.\n\nWell reader, Marie Delcioppo, who submitted this recipe, says “It’s incredibly fresh. You can really taste the flavors.”", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2014/11/18/science/17VEGGIETHNXPIE/17VEGGIETHNXPIE-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 10", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 64}, "recipeIngredient": ["1 ½ cups walnuts or pecans", "1 ½ cups shredded unsweetened coconut", "1 cup medjool dates, pitted", "1 teaspoon alcohol-free vanilla extract or ½ vanilla bean", "Pinch of sea salt", "1 teaspoon cinnamon", "½ teaspoon ground ginger", "½ teaspoon ground clove", "1 cup blueberries (or pomegranates)", "1 apple", "1 teaspoon cinnamon", "1 teaspoon alcohol-free vanilla extract or ½ vanilla bean", "2 Tablespoons chia seeds", "2 apples, sliced thin", "1 cup walnut or pecans", "3 medjool dates, pitted", "4 drops Wild Orange Essential Oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the crust, put all ingredients in food processor and process until well mixed and sticky. Line a 10-inch pie pan with extra-virgin olive oil. Pour crust into pan and pat firmly into place. Use your hands to bring the crust up the sides of the pie pan, all the way to the rim."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, put the apple in food processor and pulse until finely chopped. Combine apple and blueberries/pomegranates in large bowl and mash with fork. Add chia seeds, vanilla and cinnamon and mix well. Fill the pie crust with the filling and smooth evenly with a rubber spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finally, for the topping, use the food processor or a mandoline to slice the apples paper thin. Layer the sliced apples on top of the filling in a circular, overlapping pattern. In the food processor, combine walnuts, dates and orange essential oil and pulse until finely ground. Sprinkle the walnut, date and orange mixture on top of the sliced apples. Serve cold."}]}