{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Asparagus and Scallion Quiche", "description": "I’ve made many a spring quiche filled with asparagus and herbs, yet I’d never thought about roasting the asparagus instead of steaming it. But lately I’ve been buying thick stalks of asparagus, and all I want to do is roast it; roasting intensifies the flavor and the stalks become incredibly succulent, more so than when the asparagus is steamed. This quality isn’t lost even when the sliced stalks are hidden inside a quiche.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/21/dining/Asparagus-and-Scallion-Quiche/Asparagus-and-Scallion-Quiche-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 generous servings", "recipeCuisine": "french, mediterranean", "recipeCategory": "", "keywords": "halal, kosher, nut-free, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 279}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 346, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "3 grams", "proteinContent": "11 grams", "saturatedFatContent": "9 grams", "sodiumContent": "424 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound thick asparagus", "2 tablespoons extra virgin olive oil", "Salt and freshly ground pepper to taste", "1 bunch good-size scallions (the kind you get in the farmers market) or 1 1/2 bunches thin scallions (the kind you get in the supermarket) (about 5 ounces), trimmed, quartered lengthwise and sliced thin", "1 tablespoon chopped fresh tarragon", "2 tablespoons minced flat-leaf parsley", "2 egg yolks", "2 whole eggs", "1 (9-inch) <a href=\"https://cooking.nytimes.com/recipes/1016266-whole-wheat-pie-dough\">whole wheat pie crust,</a> fully baked and cooled", "Freshly ground pepper", "2/3 cup milk", "2 ounces Gruyère, grated (1/2 cup)", "1 ounce Parmesan, grated (1/4 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Line a baking sheet with parchment. Break off  and discard woody ends of asparagus and place asparagus on the baking sheet. Drizzle on 1 tablespoon of the oil, add salt and pepper to taste and toss together with your hands until asparagus is thoroughly coated with oil. Place in oven and roast 12 minutes, or until tender and lightly browned in spots, turning asparagus halfway through. Remove asparagus from the oven and allow to cool until you can handle it. Slice into 1/2 to 3/4-inch pieces and place in a medium bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn oven down to 350 degrees. Heat oil in a medium skillet over medium heat and add scallions. Cook, stirring, until tender, about 5 minutes. Season to taste with salt and pepper. Remove from heat. Transfer to bowl with asparagus. Add tarragon and parsley and toss together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat together egg yolks and eggs in a medium bowl. Set tart pan on a baking sheet to allow for easy handling. Using a pastry brush, lightly brush the bottom of the crust with some of the beaten egg and place in oven for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add salt (I use 1/2 teaspoon), pepper, and milk to remaining eggs and whisk together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread scallion and asparagus mixture in an even layer in the crust. Stir together cheeses and sprinkle evenly  on top. Very slowly pour in egg custard over the filling. If your tart pan has low edges, you may not need all of it to fill the shell, and you want to keep the custard from  spilling over.  Place quiche, on baking sheet, in the oven and bake for 30 to 35 minutes, until set and just beginning to color on the top. Remove from oven and allow to sit for at least 10 minutes before serving. Serve hot, warm or room temperature."}]}