{"@context": "http://schema.org", "@type": "Recipe", "name": "Radicchio With Walnut Anchovy Sauce", "description": "I am tempted to call the sauce for this seared radicchio bagna cauda because that is what they called it in the London restaurant I used to frequent that inspired the recipe  (11 Park Walk, now closed). It is really more of a walnut-thickened anchovy vinaigrette, and it is perfect with the radicchio. When you cook radicchio some sweet flavors emerge, but bitter is still the prevailing taste. The salty anchovies, pungent garlic and nutty walnuts – which also have a bitterness all their own – go together beautifully. The sauce is substantial, and will thicken as it sits, so serve the dish right away if you are spooning it over the radicchio so it doesn’t become stodgy; or serve the sauce in ramekins and dip the radicchio into it.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/10/22/health/22bittersradicchio/22bittersradicchio-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 6", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner, lunch", "keywords": "appetizer, dairy-free, gluten-free, halal, kosher, low cholesterol, low sugar, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 222, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "3 grams", "sodiumContent": "166 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["3 anchovy fillets", "7 tablespoons extra virgin olive oil", "1 tablespoon walnut oil", "2 garlic cloves green germ removed, minced", "1 tablespoon fresh lemon juice or sherry vinegar (more to taste)", "1 teaspoon Dijon mustard", "1/3 cup / 1 1/2 ounces walnuts, finely chopped", "Freshly ground pepper", "2 large or 4 to 6 smaller radicchio, cut in wedges", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse anchovies briefly and chop. Heat 2 tablespoons of olive oil over low heat in a small skillet and add anchovies and garlic. Stir until garlic is fragrant and just beginning to color and anchovies have broken down into smaller bits. Transfer to a mortar and pestle. Use pestle to grind mixture into a paste. Add lemon juice or vinegar to the still-hot pan and stir to deglaze bottom of pan, then transfer to mortar and pestle. Add mustard. Work together, then slowly add 3 tablespoons of olive oil and walnut oil, one tablespoon at a time, working each tablespoon into anchovy mixture before adding next. Work in walnuts and mash with the pestle until the sauce is thick. Season to taste with freshly ground pepper (the anchovies should provide enough salt)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a heavy cast iron pan over medium heat or prepare a medium-hot grill. Cut radicchio into wedges – about 1 1/2 to 2 inches thick at the widest point. Place in a bowl and toss with remaining olive oil. It should be lightly coated all over. Season with salt and pepper. Grill, turning often, until lightly colored, charred in places and soft, about 8 to 10 minutes (do this in batches if using a pan)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange radicchio on plates or on a platter. Either drizzle  the sauce over the radicchio or serve it in ramekins with each serving. Serve radicchio hot or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1016903-radicchio-with-walnut-anchovy-sauce"}