{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach and Bacon Tartine", "description": "In Paris’s small neighborhood cafés and bistros, kitchens are extremely small, consisting often of no more than a small wooden cutting board and a wall mounted heavy-duty toaster oven. At lunchtime a hot open-faced tartine — bubbling with fragrant cheese — is a popular menu choice. Similar to a piece of pizza, a tartine is constructed from a thick slice of rustic bread, lightly toasted. A savory topping and some good French cheese precede a few minutes of browning under the broiler. This tartine has a light smear of Dijon mustard, wilted spinach, bacon lardons and the bold-flavored cheese called Raclette, which melts in a spectacular way. If you can’t get Raclette, substitute Gruyère or Emmenthaler. Accompanied by a green salad, it makes a quick light meal, or you may cut the tartine into small wedges to serve with drinks.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/10/08/dining/08KITCH3/08KITCH3-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner, lunch, quick, sandwiches", "keywords": "bacon, bread, raclette cheese, spinach, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 261}, "recipeIngredient": ["2 teaspoons extra-virgin olive oil", "6 ounces spinach or chard, washed", "Salt and pepper", "3 ounces thick-cut bacon, cut crosswise into 1/4-inch lardons", "4 large 1/2-inch-thick slices bread from a day-old rustic loaf, such as miche or pain au levain (about 6 by 4 inches)", "Dijon mustard", "4 ounces Raclette or Gruyère cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put oil in a skillet over medium-high heat. Add spinach, season with salt and pepper, and cook, stirring for about 1 minute, until just wilted. Drain, cool and squeeze out excess water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry bacon lardons in a dry skillet over medium-high heat for about 1 minute, until barely crisped. Remove and drain on paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the bread slices on a baking sheet and toast lightly on both sides under broiler (or use a toaster and place toasted slices on baking sheet). Brush lightly with mustard. Divide greens among the four toasts and spread out to cover. Tuck the bacon here and there."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top each toast with slices of Raclette or Gruyère (about 1 ounce total on each toast). Broil for 2 to 3 minutes, not too close to the heat, until nicely browned. Alternatively, bake tartines 3 to 5 minutes on top shelf of a 450-degree oven, or individually in a countertop toaster oven. Serve hot."}]}