{"@context": "http://schema.org", "@type": "Recipe", "name": "Mediterranean Smashed Chickpeas", "description": "You smash half the chickpeas in this recipe to make a spread, sort of a warm rustic hummus enhanced with garlic cumin and hot pepper, along with a liberal drizzle of olive oil. You can use either freshly cooked dried beans or canned chickpeas (also known as garbanzo beans), though freshly cooked is always preferable. Tuck some into a pita for a vegetarian sandwich or serve as a dip to eat with bread and olives; a dollop of minty yogurt and a drizzle of tahini sauce make nice additions. ", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/02/26/dining/26KITCH1_SPAN/26KITCH1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 3 1/2 cups chickpea spread", "recipeCuisine": "greek, mediterranean, middle eastern", "recipeCategory": "quick, condiments, dips and spreads", "keywords": "appetizer, chickpea", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 269}, "recipeIngredient": ["Extra-virgin olive oil\n", "1 medium onion, diced\n", "Salt and pepper\n", "4 garlic cloves, minced\n", "1/2 teaspoon coarsely ground toasted cumin\n", "1/2 teaspoon red pepper flakes\n", "1 cup finely diced celery\n", "4 cups chickpeas (garbanzo beans), cooked or canned\n", "2 tablespoons lemon juice\n", "4 hard-cooked eggs, peeled and quartered (optional) \n", "Minted yogurt (optional), see notes \n", "Tahini sauce (optional), see notes\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 3 tablespoons olive oil in a heavy-bottomed saucepan over medium heat. Add onion, season with salt and pepper, and cook gently until softened, about 10 minutes. Raise heat to medium-high. Add garlic, cumin, red pepper flakes and celery. Stir to combine let sizzle without browning for 1 minute. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chickpeas and let them heat through. With a potato masher or wooden spoon, crush about half the beans. Stir well, taste and adjust seasoning. Add 1/2 cup water (or bean cooking liquid if you have it) and let mixture simmer briskly for a minute or two. Stir in lemon juice and 2 tablespoons olive oil. Serve warm in pita or as a dip or side dish. Garnish with quartered eggs, accompanied by minted yogurt and tahini sauce, if desired. "}], "link": "https://cooking.nytimes.com/recipes/1016072-mediterranean-smashed-chickpeas"}