{"@context": "http://schema.org", "@type": "Recipe", "name": "Ciabatta Egg Sandwich With Tomato Jam", "description": "This corner deli’s bacon-egg-and-cheese-on-a-roll makes a trifecta of promises, but Robert Newton’s version of the sandwich, encased in bread that’s both crusty and springy, actually fulfills them. Yes, “tomato jam” sounds weird, and having to make your own ketchup before your first cup of coffee, even worse. But, the jam can be prepared in advance, and the payoff of its savory tang — paired with hearty bacon, fresh eggs and deep, complex Cheddar — render the prep time a mere trifle of an inconvenience. Whether you’re trying to cure a hangover, or impress brunch guests, this recipe will always gratify.", "author": {"@type": "Person", "name": "Julie Scelfo"}, "image": "https://static01.nyt.com/images/2014/07/23/dining/23SUBGONE1/23SUBGONE1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 sandwiches", "recipeCuisine": "", "recipeCategory": "breakfast, brunch", "keywords": "ciabatta bread, coriander", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 76}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 294, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "12 grams", "saturatedFatContent": "6 grams", "sodiumContent": "450 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Olive oil", "1 large shallot, diced", "1 clove garlic, minced", "1 1/2 teaspoons ground coriander", "1 1/2 teaspoons fresh ground fennel seeds", "1 tablespoon light brown sugar", "1 anchovy fillet", "2 tablespoons lemon juice", "10 ounces canned or boxed tomato purée", "1 teaspoon dried oregano", "1 teaspoons salt", "Freshly ground black pepper", "8 eggs, preferably fresh from a local farm", "8 slices sharp Cheddar cheese", "8 slices bacon, preferably Burgers’ Smokehouse Original Country Bacon, available at Bklyn Larder", "4 ciabatta rolls"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the tomato jam:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tomato jam: In a medium saucepan, warm 3 tablespoons olive oil over low heat, then add shallots. Once they soften, add garlic. Cook for about 1 minute, or until the garlic starts to soften but not brown, then add the coriander and ground fennel. Allow the spices to toast slightly and become aromatic, adding more oil as needed so the mixture remains a thick paste and the herbs do not burn. Add the brown sugar and anchovy; use a wooden spoon to mash them into the paste. Once they are combined, deglaze the pan with lemon juice, then add the tomato purée, oregano, salt and pepper to taste. Raise heat until mixture starts to boil, then turn it down and gently simmer about 30 minutes, whisking often, until jam thickens. Remove from heat and add salt to taste. As it cools, jam will continue to thicken."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the sandwich:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 250 degrees. Place the bacon in a large, cold skillet, then cook over low to medium low heat, turning until crisp on both sides. Set aside on a plate. Remove all but 1 tablespoon fat from the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the ciabatta rolls in half and place on a baking sheet. Put 2 slices of cheese on each top half, and smear bottoms generously with tomato jam. (Refrigerate remaining jam for other uses.) Put bread in oven to warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk the eggs together with a little salt and pepper. Put the skillet on medium heat and when hot again, gently scramble eggs. Once eggs are just firm, divide them among the ciabatta bottoms. Top with 2 slices bacon, and then the ciabatta tops. Serve immediately."}]}]}