{"@context": "http://schema.org", "@type": "Recipe", "name": "Bruschetta With Smashed Beans, Sage and Kale", "description": "This is comfort food — a generous spoonful of thick beans seasoned with fresh sage on top of a substantial slice of garlic toast. To make a meal of it I top the beans with seasoned greens and a little Parmesan.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/02/11/science/13recipehealth/13recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner, lunch", "keywords": "fall, spring, summer, winter, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 95}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 227, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "5 grams", "proteinContent": "12 grams", "saturatedFatContent": "2 grams", "sodiumContent": "549 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 bunch black or curly kale, stemmed, leaves washed thoroughly in 2 rinses of water\n", "Salt to taste\n", "2 tablespoons extra virgin olive oil plus additional oil to taste for drizzling\n", "2 large garlic cloves, 1 minced, 1 cut in half for rubbing the bruschetta\n", "1 teaspoon minced fresh thyme\n", "Freshly ground pepper\n", "2 cups simmered pintos, with about 1 cup of broth from the beans\n", "2 teaspoons slivered sage leaves\n", "8 thick slices whole wheat country bread\n", "1 1/2 ounces Parmesan, grated (1/3 cup)\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil, salt generously and add kale. Blanch until tender, 3 to 4 minutes. Transfer to a bowl of cold water, then drain and squeeze out excess water. Chop medium-fine or cut in thin strips.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a heavy skillet and add minced garlic. Cook, stirring, until fragrant, about 30 seconds, and add thyme and chopped kale. Cook, stirring, until kale is nicely seasoned with garlic and oil, about 1 minute. Season to taste with salt and pepper and transfer to a bowl. Keep warm.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining oil over medium-high heat in the same skillet and add beans and broth. Stir and mash the beans with the back of a wooden spoon until the mixture is slightly thick but not dry. Be careful not to overcook as the beans can dry out quickly. 10 minutes should suffice. Add pepper to taste, stir in sage and remove from the heat.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly toast bread and as soon as you remove it from the toaster rub each slice with the cut clove of garlic and slather on a generous spoonful of beans. Top beans with kale, drizzle on more olive oil if desired, sprinkle with Parmesan and serve, or heat through for a couple of minutes in a medium oven and serve.\n"}]}