{"@context": "http://schema.org", "@type": "Recipe", "name": "Arctic Char with Spinach Butter", "description": "Darina Allen, known as the Julia Child of Ireland, has run the Ballymaloe Cooking School on an organic farm in east Cork for more than 30 years. Here’s a lovely dish from her repertoire, a whole fish wrapped in a foil package, seasoned with nothing more than salt, pepper, butter and a sprig of tarragon. The fish emerges moist and juicy, ready for a creamy butter sauce packed with chopped spinach and herbs. Ms. Allen makes it with pink trout, which are plentiful in Ireland, but this recipe calls for Arctic char, which is more widely available in the United States. But you could substitute pink trout (also called coho trout) if you can find it, or large wild trout, or even thick fillets of steelhead trout or salmon. ", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/03/12/dining/12KITCH_SPAN/12KITCH_SPAN-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "irish", "recipeCategory": "dinner", "keywords": "arctic char, spinach, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 87}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 635, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "2 grams", "proteinContent": "57 grams", "saturatedFatContent": "14 grams", "sodiumContent": "871 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["10 ounces baby spinach", "1 Arctic char, about 2 pounds, cleaned and left whole", "Salt and pepper", "1 teaspoon chopped fresh tarragon, plus a few sprigs for inside the fish", "2 tablespoons unsalted butter at room temperature, plus 6 chilled tablespoons for sauce", "1/2 cup crème fraîche", "1/2 teaspoon grated lemon zest", "1 teaspoon finely sliced chives", "1 pound boiled new potatoes, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put spinach in a mixing bowl and pour boiling water over to wilt it. Drain in a colander, rinse with cool water and squeeze completely dry. Chop the spinach as finely as you can and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Rinse fish and pat dry. Season fish inside and out with salt and pepper. Put a few tarragon springs in the belly cavity. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a roasting pan with a big piece of foil slightly longer than the fish, leaving ends hanging over. Smear middle section of foil lengthwise with 1 tablespoon soft butter and set fish on top. Smear top of fish with remaining tablespoon soft butter. Fold the sides of foil to the center and press against fish. Twist both ends of foil to make a tight package. Bake for 30 minutes. Remove pan from oven and let fish rest 5 to 10 minutes, still in the foil package, while you make the sauce. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put crème fraîche in a wide saucepan or skillet over medium high heat and bring to a simmer. Cook for a minute or so, until slightly reduced. Add cooked spinach, stirring to coat. Season with salt and pepper and turn heat to low. Quickly stir in 1 tablespoon chilled butter at a time. Each spoonful should be just melted before adding the next, to make a creamy sauce. Remove from heat. Stir in lemon zest, tarragon and chives."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer fish to a warm serving platter. Carefully remove foil. (Fish should be cooked through but moist.) Peel away and discard skin from top of fish. Pour any collected pan juices into the sauce, then spoon sauce over fish. Serve with boiled new potatoes if desired."}], "link": "https://cooking.nytimes.com/recipes/1016115-arctic-char-with-spinach-butter"}