{"@context": "http://schema.org", "@type": "Recipe", "name": "Mixed Bean Salad With Pickled Ginger", "description": "Nostalgia aside, classic three-bean salads are not much to write home about. They are traditionally composed of red kidney beans, garbanzo beans and sad soft green beans, all from cans, and heavy on vinegar and sugar. That’s fine for camping or during a power outage. Here’s a better bean salad that takes advantage of fresh beans — and fresh shelling beans — in season. Lightly dressed with a Japanese-inspired vinaigrette and sparked with pickled ginger, it’s a most delicious departure from the ordinary. You don’t have to make your own pickled ginger, but it’s an easy, fun project.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/08/27/dining/27KITCH/27KITCH-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, vegetables", "keywords": "beans, dijon mustard, lime, miso, rice wine vinegar, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 39}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 207, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "14 grams", "proteinContent": "11 grams", "saturatedFatContent": "1 gram", "sodiumContent": "981 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Juice of 2 limes (about 4 tablespoons)", "2 tablespoons white miso", "1 teaspoon Dijon mustard", "2 teaspoons rice wine vinegar", "1 teaspoon brown sugar", "2 teaspoons soy sauce", "1 teaspoon toasted sesame oil", "1/4 cup mild vegetable oil, such as safflower or peanut", "Salt and pepper, to taste", "1 1/2 cups raw fresh shelling beans, such as cranberry beans, butter beans or black-eyed peas, from about 2 pounds beans in the pod (may substitute frozen edamame or baby lima beans)", "2 pounds small green beans, yellow wax beans and Romano beans, or a single type, topped and tailed", "4 scallions, thinly sliced", "2 tablespoons julienned pickled ginger (see note)", "2 teaspoons toasted black sesame seeds, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the vinaigrette:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, put lime juice, miso, mustard, rice wine vinegar and brown sugar. Whisk together, dissolving ingredients, until mixture is creamy, a minute or so. Add soy sauce, sesame oil and vegetable oil and whisk again. Taste, adding salt and pepper as desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the shell beans and a good pinch of salt in a small saucepan with just enough water to cover. Simmer gently for 20 to 30 minutes, until tender. Let cool in cooking liquid. (If using frozen beans, just drop in salted boiling water for 1 minute, then drain.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large saucepan 3/4 full with well-salted water and bring to a boil. Add green beans, yellow wax beans and Romano beans and simmer for 2 to 3 minutes, until firm-tender. Drain and spread out on a towel to cool. (If the different kinds of beans vary greatly in size, cook in separate batches.)"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Assemble the salad:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the salad: Put green bean mixture in a large shallow salad bowl. Drain shell beans and add to bowl. Season with salt and pepper. Dress lightly with half the vinaigrette and toss gently. Leave for 10 minutes and taste for seasoning. Add more vinaigrette as necessary, but only enough to coat. (Any remaining vinaigrette makes a nice dressing for a green salad). Scatter scallions and pickled ginger strips over salad. Sprinkle with back sesame seeds."}]}]}