{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear Kuchen", "description": "Emily Elsen and Melissa Elsen, sisters who run the Four & Twenty Blackbirds bakery in Brooklyn, hail from South Dakota, where their family ran a small restaurant. Kuchen, a German cake topped with fruit that is a staple of the state’s Thanksgiving tables, is central to their childhood memories of the holiday. Their recipe, topped with pears, “looks a little different than those traditionally found in local South Dakota church and community cookbooks,” Melissa Elsen wrote in an email, “but it tastes like it does in my memory (with the addition of cardamom).” That cardamom, it turns out, is key to the dish’s success, with citrus and savory notes that are as pleasant as they are unexpected.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19SOUTHDAKOTA/19SOUTHDAKOTA-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 kuchens, 8 servings each", "recipeCuisine": "german", "recipeCategory": "cakes", "keywords": "dessert, pear", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 206}, "recipeIngredient": ["1/2 cup/118 milliliters whole milk", "1 1/8 teaspoons/3 1/2 grams active dry yeast (about half a packet)", "2 tablespoons/28 grams unsalted butter, softened", "1/4 cup/50 grams sugar", "1/2 teaspoon salt", "1 large egg yolk", "1 2/3 cups/209 grams all-purpose flour", "4 tablespoons/53 grams cream cheese, softened", "1/4 cup/50 grams sugar", "2 tablespoons/16 grams all-purpose flour", "1 large egg", "3/4 cup/177 milliliters whole milk", "1/4 teaspoon salt", "3 cardamom pods, crushed in a mortar and pestle", "1/2 teaspoon anise seed, crushed in a mortar and pestle", "1 tablespoon/14 grams unsalted butter", "1/2 teaspoon pure vanilla extract", "2 tablespoons/16 grams all-purpose flour", "1 1/2 tablespoons/21 grams sugar", "1 tablespoon/13 grams packed light brown sugar", "1/4 teaspoon ground cinnamon", "Small pinch of salt", "1 1/2 tablespoons/21 grams unsalted butter, cut into small pieces and softened", "3 ripe Bosc pears (about 1 pound)", "1/2 tablespoon/7 grams sugar", "2 1/4 teaspoons/11 milliliters apple cider vinegar or lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Warm milk to 110 degrees (or until warm to the touch), sprinkle with yeast, stir and let stand for 5 minutes until dissolved. Add butter and stir until mostly melted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter or oil a large bowl. In a second large bowl, whisk together sugar, salt and egg yolk. Add flour and stir with a wooden spoon until incorporated. Add warm milk mixture and stir until combined and dough comes together in a smooth, sticky ball, about 2 minutes. Transfer to prepared bowl, cover with plastic wrap and let rise in a warm spot until doubled in size, 2 to 3 hours. (Alternatively, dough can rise in refrigerator overnight.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the pastry cream: Place a fine-mesh sieve on the rim of a medium bowl. In a heavy-bottomed medium saucepan, blend cream cheese and sugar until smooth. Whisk in flour, egg, milk, salt, cardamom pods and anise seed. Cook over medium heat, whisking occasionally, until mixture starts to thicken, then whisk constantly until  it starts to boil. Continue cooking, whisking constantly, for 2 more minutes, then immediately pour mixture into fine-mesh sieve. Use a spatula to push it through sieve and into bowl. Let cool, stirring occasionally, for 5 minutes, then stir in butter and vanilla. Press plastic wrap directly on surface of pastry cream and refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the streusel: In a small bowl, whisk together flour, sugar, brown sugar, cinnamon and salt. Add butter pieces and toss to coat. Use fingertips to rub butter into dry ingredients until pea-size lumps form. Cover and refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out dough: Butter two 9-inch pie plates. Turn dough out onto a lightly floured work surface and with floured hands gently knead it into a log. Divide log in half and flatten into discs. With a lightly floured rolling pin, roll each disc into an 8-inch round. Transfer rounds to pie plates, pressing dough to edges of pan and just slightly up sides. Let rise for about 20 minutes while you prep fruit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a rack in the middle of the oven and heat to 350 degrees. Peel and core pears, then slice them lengthwise into 1/4-inch-thick slices and place in a medium bowl. Sprinkle with sugar and apple cider vinegar or lemon juice and toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the kuchens: Spread about 1/4 cup pastry cream on bottom of each kuchen, stopping 1/2 inch from edge of dough, then arrange pear slices in an overlapping circular pattern on top. Divide remaining pastry cream between kuchens and carefully spread it evenly over pears. Sprinkle streusel over both and bake in center of oven until dough is light golden brown, 20 to 25 minutes. (If your oven can’t accommodate both kuchens, refrigerate one while the other bakes.) Serve warm or at room temperature. Baked kuchens can be wrapped tightly in plastic wrap, then foil, and frozen up to 1 month. Rewarm before serving."}], "link": "https://cooking.nytimes.com/recipes/1016963-pear-kuchen"}