{"@context": "http://schema.org", "@type": "Recipe", "name": "Americano", "description": "The Negroni is enjoying a moment now. For bartenders and barflies, this deliciously complex mix of Campari, gin and sweet vermouth has become an easy way to fly one’s flag as a knowing cocktail classicist. But the drink’s rising profile has cast a shadow over its once-popular progenitor, the Americano. Without this refreshing Italian-born highball — Campari, sweet vermouth and club soda — there would have been no blueprint for the gin-loving Count Camillo Negroni to experiment with a century ago. (The drink’s family line actually goes back even farther; the Americano grew out of a simpler aperitif that omitted the soda, called the Milano-Torino — Milano in honor of the birthplace of Campari, Torino for the vermouth.)\n<br/><br/>\nWhile the Americano doesn’t have quite the romance that’s grown around the Negroni, it also doesn’t have nearly as much alcohol. It’s a lighter and saner choice for summertime drinking. A pitcher of Americanos enjoyed on the back patio during a hot afternoon will not leave you down for the, uh, count.", "author": {"@type": "Person", "name": "Robert Simonson"}, "image": "https://static01.nyt.com/images/2013/05/20/dining/video-summer-drinks-americano/video-summer-drinks-americano-mediumThreeByTwo440.jpg", "recipeYield": "1 drink", "recipeCuisine": "", "recipeCategory": "cocktails", "keywords": "campari, club soda, sweet vermouth, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 69}, "recipeIngredient": ["1 1/2 ounces Campari", "1 1/2 ounces sweet vermouth", "Club soda", "Orange twist, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 1 1/2 ounces Campari with 1 1/2 ounces sweet vermouth in a highball glass filled with ice. Top with club soda. Garnish with a generous orange twist."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Americano: An Italian-Born Highball", "description": "Made with Campari, sweet vermouth and soda, the Americano is a light summertime drink.", "thumbnailUrl": "https://static01.nyt.com/images/2013/05/20/dining/video-summer-drinks-americano/video-summer-drinks-americano-mediumThreeByTwo440.jpg", "uploadDate": "2013-05-20T20:30:05.000Z", "duration": "PT49S"}, "link": "https://cooking.nytimes.com/recipes/1016299-americano"}