{"@context": "http://schema.org", "@type": "Recipe", "name": "Chorizo-Stuffed Dates With Piquillo Pepper Sauce", "description": "Adapted from Perry Hendrix, the chef de cuisine at the acclaimed restaurant Avec in Chicago, these intensely flavored mouthfuls are meaty, spicy and sweet all at once. You could serve them as an appetizer, sitting in a pool of silky sauce, but they could also work as finger food, with the sauce set aside for dipping. Make sure to buy uncured, fresh chorizo sausage rather than the salami-like cured kind. Specialty stores generally carry jars of piquillo peppers, but if you can’t find them, substitute any roasted red peppers for the sauce.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/02/19/dining/19TAKEAWAY_SPAN/19TAKEAWAY_SPAN-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "5 appetizer servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, chorizo, dates", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 104}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 739, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "83 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "11 grams", "proteinContent": "22 grams", "saturatedFatContent": "13 grams", "sodiumContent": "992 milligrams", "sugarContent": "63 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon olive oil", "8 garlic cloves, thinly sliced", "8 shallots, thinly sliced", "8 ounces (about 1 cup) roasted piquillo peppers with any juices (or use any roasted red peppers)", "2 cups whole peeled canned tomatoes", "Kosher salt and black pepper, to taste", "16 Medjool dates (pitted)", "8 ounces of fresh chorizo sausage (not cured), casings removed", "8 slices bacon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a medium saucepan over medium heat. Add garlic and shallots and sauté until tender, about 5 minutes. Add peppers and tomatoes and cook on low heat for about 30 minutes to 1 hour, or until the liquid in the sauce has mostly evaporated. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let sauce cool slightly, then transfer to a blender and process until smooth. Thin with warm water to reach desired consistency if necessary. You want a thick sauce but not so thick that it mounds on the plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Stuff dates with chorizo, using about 1/2 tablespoon of chorizo per date. Cut bacon slices in half lengthwise and wrap a slice around each date."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place stuffed dates on a small baking sheet and bake 15 minutes, or until chorizo is cooked through. Turn broiler to high and broil for 2 to 4 minutes, or until bacon is dark brown and crisp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread sauce on each plate and place 3 dates on top. Serve warm."}]}