{"@context": "http://schema.org", "@type": "Recipe", "name": "Puréed Trahana and Vegetable Soup", "description": "Sweet and tart flavors marry in this thick, comforting soup made with leeks, carrots, onion and trahana. I like to blend the soup with an immersion blender, which results in a purée with a fair amount of texture. You can make a smoother, more elegant soup if you use a blender and then strain the purée. Trahana has a rustic flavor that goes well here. If you use semolina or flour trahana the mixture will be considerably thicker, so use less; half as much should be fine.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/10/21/science/23recipehealth/23recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6 to 8", "recipeCuisine": "greek, mediterranean, middle eastern", "recipeCategory": "", "keywords": "appetizer, main course, fall, spring, summer, winter, halal, high fiber, kosher, low cholesterol, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 181, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "6 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "805 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["3 tablespoons extra virgin olive oil", "1 large red or yellow onion, chopped", "Salt to taste", "2 garlic cloves, minced", "3/4 pound carrots, diced", "2 large leeks, white and light green parts only, rinsed of all sand and chopped", "<a href=\"http://cooking.nytimes.com/recipes/1016876-homemade-sour-bulgur-trahana-from-ikaria\">1 1/2 cups sour bulgur trahana</a>", "2 quarts vegetable stock, chicken stock or water", "A bouquet garni made with a bay leaf and a couple of sprigs each parsley and thyme or oregano", "Freshly ground pepper", "Additional olive oil and chopped fresh herbs such as dill, parsley or mint, for garnish", "Red pepper flakes or cayenne for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of   olive oil over medium heat in a heavy soup pot and add onion. Cook, stirring often, until  onion is soft, 5 to 8 minutes, and add a generous pinch of salt,  garlic, carrots and leeks. Continue to cook, stirring often, until   carrots and leeks are beginning to soften, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining olive oil and stir in trahana. Stir until trahana is coated with oil, about 1 minute, and add stock or water and bouquet garni. Bring to a boil, add salt to taste, reduce   heat and simmer 30 minutes, until vegetables are tender and trahana has fallen apart in the soup and is tender. Taste and adjust salt. Remove and discard bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For a coarse purée, use an immersion blender to purée the soup. For a finer purée, transfer, in batches, to a blender or a food processor. If using a blender do not put the top on tight; leave out the center of the lid and cover tightly with a towel. Purée until smooth and if desired, strain. Return to the pot, taste and adjust salt. Add freshly ground pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat gently and serve, garnishing each serving with a drizzle of olive oil and a sprinkling of herbs. If you want spice, sprinkle with red pepper flakes or a little bit of cayenne."}]}