{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork and Shrimp Won Tons", "description": "A steaming bowl of won tons is welcome in any season, and making them at home is a fairly easy process. Purchase a package of high-quality won ton skins, which are available everywhere, and then it’s just a matter of filling and folding them. Once they hit boiling water they cook for just 2 minutes. The filling — usually a simple mixture of well-seasoned minced meat — may be prepared hours ahead and chilled. This somewhat spicy pork and shrimp filling is particularly delicious, with plenty of ginger and Chinese garlic chives.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/02/19/dining/19KITCH1_SPAN/19KITCH1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 30 wontons", "recipeCuisine": "chinese", "recipeCategory": "", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 138}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 169, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "1 gram", "sodiumContent": "396 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound ground pork, not too lean", "1/2 pound fresh shrimp, peeled, deveined and roughly chopped in 1/4-inch pieces", "Salt and pepper", "1 tablespoon sweet rice wine, such as Shaoxing rice wine (or use sherry)", "1 tablespoon soy sauce", "1 tablespoon sugar", "1 tablespoon finely grated ginger", "2 cloves garlic, minced", "1 teaspoon spicy Chinese bean paste, also called chili bean sauce (or use chile paste)", "2 serrano chiles, finely chopped", "1 1/2 cups chopped Chinese garlic chives (or use 3/4 cup chopped scallions, green and white parts)", "36 wonton skins, about 3 by 3 inches, available at Asian markets and many grocery stores", "1 small egg, beaten", "Cornstarch for dusting", "8 ounces baby spinach leaves", "1/2 cup chopped cilantro", "8 cups good chicken broth, hot, salted to taste", "Red pepper oil (optional), see note"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put pork and shrimp in a chilled mixing bowl. Season with salt and pepper and mix briefly with chopsticks, wet hands or wooden spoons. Add rice wine, soy sauce, sugar, ginger, garlic, bean paste, serrano chiles and garlic chives. Mix well to incorporate. Pan-fry a small flat patty in a small amount of oil to check seasoning; taste and adjust. Transfer mixture to a small container, cover and chill at least 30 minutes, or longer if you have time, up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare wontons, remove a few wonton skins from package and lay them on dry work surface. Put 1 teaspoon filling in the center of each square skin. Paint edges of square lightly with egg. Gently fold one side over the other, pinching edges together. You should a have a folded rectangle. Now pull the lower corners in toward each other and pinch together to make the traditional curved wonton shape. Place wontons 1 inch apart on a baking sheet or platter. Dust lightly with cornstarch and refrigerate, uncovered, until ready to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to a boil. Meanwhile, put a small handful of spinach leaves and about 2 tablespoons cilantro in each person’s  deep wide soup bowl. When water is boiling, drop about 10 wontons into pot and cook for 2 minutes.  Remove with wire bamboo spider (or a large fine-meshed sieve with a handle) and divide among bowls. Repeat with remaining wontons. Pour about 11/2 cups hot broth over each serving. Drizzle with red pepper oil if desired."}]}