{"@context": "http://schema.org", "@type": "Recipe", "name": "Blood Orange, Grapefruit and Pomegranate Compote", "description": "This recipe was inspired by a blood-orange compote with caramel-citrus syrup developed by Deborah Madison, the author of “Vegetarian Cooking for Everyone.” Here, the same caramel technique is used with the added benefit of a splash of port. It’s a brightly-flavored, refreshing dessert, and it keeps well for a couple of days.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/05/19/dining/Blood-Orange/Blood-Orange-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, lunch", "keywords": "blood orange, grapefruit, pomegranate, dairy-free, gluten-free, halal, kosher, low cholesterol, low-fat, low-sodium, nut-free, vegan, vegetarian, dessert, fall, spring, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 18}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 184, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "6 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "1 milligram", "sugarContent": "37 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds blood oranges (they are small, so this is usually around 8 or 9)", "2 ruby red grapefruit", "80 grams (6 tablespoons) sugar, preferably organic", "2 tablespoons water", "1 tablespoon agave nectar", "2 tablespoons port wine", "1/2 teaspoon vanilla", "1/3 cup pomegranate seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside two oranges and a grapefruit half. Remove peel and pith from remaining oranges and grapefruit. Cut away both ends of the fruit so that it sits flat on your cutting board (it helps to use one with a canal around the edges so you can pour off the juice). Using a chef’s knife, utility knife or a paring knife, cut skin and pith completely away from the fruit, following the natural curve of the fruit from top to bottom. Slice peeled fruit into rounds. Cut the grapefruit rounds into thirds or quarters and combine with the sliced oranges in a serving bowl. Pour accumulated juice into a separate, small bowl. Squeeze the juice from the remaining two oranges and grapefruit half (you need about 3/4 cup), and add to the small bowl. Peel and slice any remaining grapefruit and add to the bowl with the fruit. Set aside fruit while you make caramel syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir vanilla and port into the citrus juice. In a medium saucepan, combine sugar, water and agave nectar. With a wet pastry brush, brush down sides of pan to dislodge any stray sugar granules. Over medium heat, bring mixture to a boil, continuing to brush down any errant sugar crystals. Cover pan, turn heat down to medium-low and set timer for 4 minutes. Uncover and cook until the caramel is golden to amber. Swirl pan if necessary to distribute the darkening caramel, but do not stir. Bubbles should be breaking on the surface. Insert a candy thermometer and as soon as the caramel reaches 310 to 325 degrees (it will be a deep golden color), remove from heat and allow bubbles to subside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully add juice-port mixture to the sugar mixture, standing away from pan to avoid splashes. Heat through over medium heat stirring with a heat-proof spatula. The caramel may seize on the spatula; just continue to stir and heat until the caramel has melted again and the juice and caramel come together. (The caramel is very hot so resist temptation to taste it.) Remove from heat and allow to cool, then pour over fruit. Toss gently. Sprinkle pomegranate seeds on top. Serve at room temperature or chilled."}]}