{"@context": "http://schema.org", "@type": "Recipe", "name": "Chard and Sweet Corn Tacos", "description": "These sweet and spicy tacos can be filled with chard of any color, or other greens like beet greens or amaranth. I used Swiss chard for these tacos, but other greens like beet greens or amaranth will work. I don’t recommend strong-tasting cruciferous greens like kale, though. You can use green chard, red chard or rainbow, and do include the stalks if they’re nice and wide. Don’t skimp on the garlic. As for the salsa, you can choose between fresh or cooked tomato salsa, or use a salsa verde made with tomatillos. They all work well. A quarter cup of filling is plenty for each taco.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/08/19/science/18recipehealthb/18recipehealthb-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "8 tacos, serving 4", "recipeCuisine": "mexican", "recipeCategory": "brunch, dinner, lunch, tacos", "keywords": "appetizer, main course, gluten-free, halal, high fiber, kosher, low cholesterol, nut-free, vegetarian, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 117}, "recipeIngredient": ["1 generous bunch Swiss chard (about 3/4 pound)", "Salt to taste", "1 medium white, red or yellow onion, sliced", "3 large garlic cloves, minced", "Kernels from 2 ears sweet corn", "Freshly ground pepper", "8 warm corn tortillas", "1/2 cup crumbled queso fresco or feta (but not too salty a feta)", "Salsa of your choice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil while you stem chard and wash leaves in 2 rinses of water. Rinse stalks and dice them if they are wide and not stringy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When water in pot comes to a boil, salt generously and add chard leaves. Blanch for a minute, then transfer to a bowl of cold water and drain. Take chard up by the handful and squeeze out excess water, then cut into 1/2-inch wide strips. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil over medium heat in a large, heavy skillet and add onion. Cook, stirring often, until onions are tender and beginning to color, about 8 minutes, and add a generous pinch of salt, the garlic, diced chard stalks and corn kernels. Continue to cook, stirring often, until corn is just tender, about 4 minutes. Stir in chard and cook, stirring, for another minute or two, until ingredients are combined nicely and chard is tender but still bright. Season to taste with salt and pepper. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat tortillas. Top with vegetables, a sprinkling of cheese and a spoonful of salsa."}], "link": "https://cooking.nytimes.com/recipes/1016744-chard-and-sweet-corn-tacos"}