{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-fried Rice With Amaranth or Red Chard and Thai Basil", "description": "This is another Thai-influenced dish, spiced with sriracha and featuring the beautiful green vegetable amaranth. Amaranth is a beautiful green with small red and green leaves that grow, bush-like, off medium-thick stems. I get it from Asian vendors at the farmers’ market, where I can also find Thai basil. I cut away the very tough ends but use the more tender parts of the stalks. A good substitute here would be red chard, whose stems can be diced and included in the stir-fry. You could also use beet greens, but I’d omit the stringy stems. I spiced this Thai-influenced stir-fry with sriracha, but that spicy chili sauce is optional.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/07/17/science/17recipehealth/17recipehealth-articleLarge.jpg", "totalTime": "PT6M", "recipeYield": "Serves 4", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "dairy-free, halal, kosher, vegetarian, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 351, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "14 grams", "saturatedFatContent": "2 grams", "sodiumContent": "626 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 to 5 cups cooked rice (white or brown, medium-grain preferred), either chilled or at room temperature", "3 eggs", "2 teaspoons plus 2 tablespoons peanut, canola, rice bran or grape seed oil", "2 to 3 teaspoons minced garlic (to taste)", "2 to 3 teaspoons minced fresh ginger (to taste)", "1 bunch amaranth, thick stem ends cut away, the rest coarsely chopped (about 4 cups), or red chard, leaves torn from stalks, stalks diced", "2/3 cup chopped Thai basil", "1 bunch scallions, sliced, white and dark green parts separated", "1 to 2 tablespoons soy sauce, to taste", "1 tablespoon sriracha sauce (optional)", "1/4 teaspoon ground pepper", "1/2 cup chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat one of the eggs in a bowl and season with a pinch of salt. Prepare remaining ingredients and place in separate bowls within arm’s reach of your burner."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or a 12-inch skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Add 3/4 easpoon of the oil to the wok or pan and swirl to coat the sides. Make sure that bottom  wok or pan is coated with oil and add beaten egg, swirling the pan so that egg forms a thin pancake. Cook 30 seconds to a minute, until set. Using a spatula, turn pancake over and cook for 5 to 10 more seconds, until thoroughly set, then transfer to a plate or cutting board. Season to taste. Allow to cool, then roll up or fold in half and cut into strips or just break up with edge of spatula . Repeat with remaining eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl remaining oil into wok or pan and add garlic and ginger. Stir-fry no more than 10 secods, and add amaranth or chard, and white parts of the scallions. Stir-fry for 2 minutes and add Thai basil; stir together for a few seconds, then add rice. Stir-fry, scooping up the rice with your spatula, then pressing it into the hot wok and scooping it up again, for about 2 minutes. The rice should sear and stick to the sides of the wok. Add soy sauce, sriracha, pepper, green part of the scallions, and eggs and cilantro, stir for about 30 seconds, scraping the rice off the sides of the wok as it sticks. Remove from the heat. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1016664-stir-fried-rice-with-amaranth-or-red-chard-and-thai-basil"}