{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Herbs and Scallion Frittata", "description": "If you want to make this for the family in one go, it’s more convenient to make this as a frittata. Not quite as elegant as the French rolled omelet, but no less delicious. This one includes a bunch of sautéed scallions.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": null, "totalTime": "PT30M", "recipeYield": "one 10-inch frittata, serving 4 to 6", "recipeCuisine": "mediterranean", "recipeCategory": "", "keywords": "low-fat, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 153, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "1 gram", "proteinContent": "10 grams", "saturatedFatContent": "3 grams", "sodiumContent": "256 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon plus 2 teaspoons extra-virgin olive oil", "1 bunch scallions, white and light green parts only, trimmed and sliced", "8 large or extra-large eggs", "6 tablespoons minced chopped herbs, such as parsley, dill, chives, tarragon, chervil, basil, mint (use no more than 3)", "1/2 teaspoon salt", "Freshly ground pepper to taste", "2 tablespoons plus 2 teaspoons milk", ""], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 teaspoons of the olive oil in a small skillet or saucepan over medium heat and add the scallions. Cook, stirring, until tender, 3 to 5 minutes, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a medium bowl. Add the herbs, salt, pepper, mint, scallions and milk and beat together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining olive oil over medium-high heat in a 10-inch heavy nonstick skillet. Hold your hand above it; it should feel hot. Drop a bit of egg into the pan and if it sizzles and cooks at once, the pan is ready. Pour in the egg mixture. Swirl the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the omelet with the spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking. Turn the heat down to low and cover the pan. Cook 8 to 10 minutes, shaking the pan every once in a while, until the frittata is just about set. Meanwhile, light the broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the frittata is not quite set on the top, place under the broiler, about 3 inches from the heat, for 1 minute, watching closely, until just beginning to color on the top. Do not allow the eggs to brown too much or they’ll taste bitter. Remove from the heat, allow to sit in the pan for 5 minutes or longer, then carefully slide out onto a platter, or cut in wedges in the pan. Serve warm, room temperature, or cold."}], "link": "https://cooking.nytimes.com/recipes/1016419-fresh-herbs-and-scallion-frittata"}