{"@context": "http://schema.org", "@type": "Recipe", "name": "Japanese Milk Bread", "description": "When panko, Japanese bread crumbs, first appeared here, American cooks leaped to embrace their spiky crunch. (The first article about it in the New York Times appeared in 1998.) But how could breadcrumbs arrive from Japan, a land without bread?  The answer is here, in the lofty, feathery white bread that is a staple at bakeries in Asia — and in Asian bakery chains like Fay Da and Paris Baguette. (Panko is often made from the heels of the loaf, called the “ears” in Japanese.)  Milk bread was developed in Japan in the 20th century, using tangzhong, a warm flour-and-water paste traditionally used in China to make buns with a soft, springy texture and tiny air bubbles. <br /><br />Surprisingly, milk bread with an incomparable crumb and buttery taste is a snap to make at home, using supermarket ingredients.  Once the tanzhong is cooked and cooled — a matter of 10 minutes at the stove — you have an easy and immensely rewarding dough.  It can be shaped into coils or round rolls, like pull-aparts, instead of loaves, or you can paint it with cinnamon sugar or dulce de leche or strawberry jam when you roll it out.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/23/dining/23WHITE2/23WHITE2-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "1 loaf", "recipeCuisine": "japanese", "recipeCategory": "project", "keywords": "appetizer, side dish, bread, milk", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 679}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 279, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "5 grams", "sodiumContent": "217 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/3 cup/45 grams bread flour", "1/2 cup/120 milliliters whole milk", "2 1/2 cups/325 grams bread flour", "1/4 cup/60 grams sugar", "2 teaspoons/7 grams active dry yeast (1 packet)", "1 teaspoon/4 grams salt", "1 egg", "1/2 cup/120 milliliters warm whole milk, plus extra for brushing on the unbaked loaf", "4 tablespoons/60 grams unsalted butter, cut into pieces and softened at room temperature, plus extra for buttering bowls and pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the starter: In a small heavy pot, whisk flour, milk and 1/2 cup water (120 milliliters) together until smooth. Bring to a simmer over medium-low heat and cook, stirring often, until thickened but still pourable, about 10 minutes (it will thicken more as it cools). When it’s ready, the spoon will leave tracks on the bottom of the pot. Scrape into a measuring cup and lightly cover the surface with plastic wrap. Set aside to cool to room temperature. (You will have about 1 cup starter; see note below.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In the bowl of a stand mixer fitted with a dough hook, combine the flour, sugar, yeast and salt and mix for a few seconds, just until evenly combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add egg, milk and 1/2 cup starter. Turn the mixer on low speed and knead 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add soft butter and knead another 10 to 12 minutes (it will take a few minutes for butter to be incorporated), until the dough is smooth and springy and just a bit tacky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly butter the inside of a bowl. Use your hands to lift dough out of mixer bowl, shape into a ball and place in prepared bowl. Cover with a kitchen towel and let rise in a warm place until doubled in size, 40 to 60 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch the dough down and use your hands to scoop it out onto a surface. Using a bench scraper or a large knife, cut dough in half. Lightly form each half into a ball, cover again and let rise 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. In the meantime, generously butter a 9-by-5-inch loaf pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a rolling pin, gently roll out one dough ball into a thick oval. (By this time, the dough should be moist and no longer sticky. You probably will not need to flour the surface, but you may want to flour the pin.) First roll away from your body, then pull in, until the oval is about 12 inches long and 6 inches across."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the top 3 inches of the oval down, then fold the bottom 3 inches of the oval up, making a rough square. Starting from the right edge of the square, roll up the dough into a fat log, pick it up and smooth the top with your hands. Place the log in the buttered pan, seam side down and crosswise, nestling it near one end of the pan. Repeat with the other dough ball, placing it near the other end of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and let rest 30 to 40 minutes more, until the risen dough is peeking over the edge of the pan and the dough logs are meeting in the center. Brush the tops with milk and bake on the bottom shelf of the oven until golden brown and puffed, 35 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool in the pan 10 minutes, then remove to a wire rack and let cool at least 1 hour, to let the crust soften and keep the crumb lofty. (If cut too soon, the air bubbles trapped in the bread will deflate.)"}], "link": "https://cooking.nytimes.com/recipes/1016275-japanese-milk-bread"}