{"@context": "http://schema.org", "@type": "Recipe", "name": "Classic Chili Con Carne", "description": "This is a classic recipe from Robb Walsh, a Texas food historian and a restaurateur: no beans. In the Texas spirit, it does, however, call for three pounds of meat — boneless chuck, buffalo or venison. There is also some bacon for good measure. This is a hearty meal, great for a cold day when the best thing to do is to stay in and watch that other Texas religion, football.", "author": {"@type": "Person", "name": "Jennifer Steinhauer"}, "image": "https://static01.nyt.com/images/2014/02/12/dining/12JPCHILI2/12JPCHILI2-articleLarge-v3.jpg", "totalTime": "PT3H", "recipeYield": "8 to 10 servings", "recipeCuisine": "southwestern", "recipeCategory": "dinner", "keywords": "beef, tomatoes, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 687}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 342, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "5 grams", "proteinContent": "36 grams", "saturatedFatContent": "6 grams", "sodiumContent": "557 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 medium dried ancho chiles, stems and seeds removed, spread flat", "1/2 teaspoon cumin seeds", "1/2 teaspoon dried Mexican oregano", "1/4 teaspoon garlic powder", "2 tablespoons cumin seeds", "8 ounces bacon", "3 pounds boneless beef chuck, buffalo or venison, cut into 1/4-inch cubes", "1 pound (2 medium) white onions, chopped", "2 teaspoons paprika", "1 teaspoon dried Mexican oregano", "1 teaspoon ground black pepper", "1/2 teaspoon dried thyme leaves", "1/2 teaspoon salt", "4 large garlic cloves, minced", "1 3/4 cups beef broth", "1 28-ounce can puréed tomatoes", "2 ancho chiles, stems and seeds removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the chile powder: Place the chiles flat in a cast-iron skillet over medium heat and cook, turning as needed, until lightly toasted. Transfer to a plate to cool. Put the cumin seeds in the hot pan and stir until fragrant. Transfer to a bowl to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using scissors, cut the chiles into small strips. Using a spice grinder or a clean coffee grinder, grind in batches into a powder. Pour into a bowl. Grind the cumin seeds into a powder and add to the bowl. Add the oregano and garlic powder. If the mixture is still coarse, grind again until fine. Reserve 3 1/2 tablespoons for the chili; save the rest in a jar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the chili: In a Dutch oven over medium heat, stir the cumin seeds until fragrant, about 1 minute. Pour onto a work surface and using a small, heavy skillet, crush them coarsely. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pot to medium-high heat, add the bacon and fry until crisp, 5 to 8 minutes. Transfer to paper towels to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat to high. Working in small batches, add the beef cubes to the pot and cook, stirring, until well browned on all sides. Using a slotted spoon, transfer the beef to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to medium, add the onions to the remaining bacon drippings and sauté until lightly browned, about 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the crushed cumin, reserved chili powder, paprika, oregano, black pepper, thyme, salt and garlic and cook, stirring often, for 1 minute. Crumble in the bacon and add the broth, tomatoes, 1 cup water, anchos and the browned beef. Increase the heat to high and bring to a boil, then decrease the heat to low, cover partly and simmer for 2 hours, until the meat is very tender. Add water as needed to maintain a good chili consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the anchos, purée them in a food processor or blender and return the purée to the pot. Stir well, simmer for a few minutes to blend the flavors and serve."}]}