{"@context": "http://schema.org", "@type": "Recipe", "name": "Laurie Colwin’s Gingerbread", "description": "The writer Laurie Colwin had an obsession with gingerbread, publishing a few different essays and recipes exploring its charms. In the essay that precedes this moist, cakelike rendition, from her book “Home Cooking,” she writes that it is “home food” — not fancy restaurant food, that is, but soothing cold-weather food that is simple to make, ideal for an afternoon spent holed up indoors. The essay is also a paean to Steen’s cane syrup, from Louisiana, which comes in cheerful yellow cans. Steen’s is easy to find online, if not at your local supermarket, but the recipe does not suffer if you use another brand of light molasses instead. Serve the cake plain with whipped cream, or with fruit and a dollop of crème fraîche, or glazed with lemon icing, as Ms. Colwin often did. (The New York Times)", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/02JPCOLWIN6/02JPCOLWIN6-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "One 9-inch cake", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, ginger, molasses, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 204}, "recipeIngredient": ["4 ounces (1 stick) unsalted butter, additional for buttering pan", "1/2 cup light or dark brown sugar", "1/2 cup light molasses", "2 large eggs", "1 1/2 cups all-purpose flour", "1/2 teaspoon baking soda", "1 1/2 tablespoons ground ginger, or to taste", "1 teaspoon cinnamon", "1/4 teaspoon ground cloves", "1/4 teaspoon ground allspice", "2 teaspoons lemon brandy or vanilla extract (see note)", "1/2 cup buttermilk (or milk with a little plain yogurt beaten into it)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Butter a 9-inch cake pan and set aside. Cream remaining 4 ounces butter with the brown sugar. Beat until fluffy, add molasses, then beat in eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add flour, baking soda, ground ginger, cinnamon, cloves and allspice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add lemon brandy or vanilla extract and buttermilk and turn batter into pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 20 to 30 minutes (check after 20 minutes). Cool on a rack."}]}