{"@context": "http://schema.org", "@type": "Recipe", "name": "A Big Pot of Simmered Pintos", "description": "This pot of beans was Step 1 for the other Recipes for Health this week. If I know that I’m going to use these beans for a Mexican dinner I season them with cilantro and, if I can find it, epazote. If I want Italian or Provençal flavors I make a bouquet garni with bay leaf, thyme, parsley, maybe sage, and most definitely a Parmesan rind. This week, since I am using my beans as a starting off point for other dishes, I season them only with onion, garlic, bay leaf and salt. The dishes that will follow throughout the week will introduce more flavors.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/02/11/science/10recipehealth/10recipehealth-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-fat, low sugar, nut-free, vegan, vegetarian, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 494}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 274, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "12 grams", "proteinContent": "17 grams", "saturatedFatContent": "0 grams", "sodiumContent": "224 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 pound (about 2 1/4 cups) pinto beans, washed and picked over for stones, soaked for at least 4 hours or overnight in 2 quarts water\n", "1 medium onion, cut in half\n", "2 to 4 large garlic cloves (to taste), minced\n", "1 bay leaf\n", "Salt to taste (I think beans need a lot, at least 1 teaspoon per quart of water used)\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place beans and soaking water in a large, heavy pot. Add halved onion and bring to a gentle boil. Skim off any foam that rises, then add garlic and bay leaf, reduce heat, cover and simmer 30 minutes.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add salt and continue to simmer another 1 to 1 1/2 hours, until beans are quite soft and broth is thick and fragrant. Taste and adjust salt. Using tongs or a slotted spoon, remove and discard onion and bay leaf. For the best flavor refrigerate overnight.\n"}]}