{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramel Pudding With Chex Streusel", "description": "Briar Handly left Vermont for the Rocky Mountains as soon as he finished high school. “I didn’t have much of a plan beyond skiing,” Mr. Handly said. But jobs cooking burgers in turn-and-burn dives led to high-end ski resorts, and then culinary school. Now he’s among a few chefs who are cracking the code of how to make Utah restaurants individual, seasonal and profitable. (Working against 100-mile-an-hour wind gusts and the state’s labyrinthine liquor laws isn’t easy.)\n\nHandle, which opened in Park City in September, is his first restaurant as chef and owner, but he knows the local palate backwards and forwards. “Pudding always sells,” he said. Pudding, like Jell-O (Utah’s official state snack) is a staple at Mormon gatherings, where sugar is a favorite indulgence. (Alcohol and nicotine are forbidden by the church.) His sneaky and delicious twist on butterscotch pudding has a breath of whiskey from the High West Distillery across the street; you may leave it out. The Chex streusel brings back every Thanksgiving Day, as he snacked endlessly on bowls of Chex Mix while watching football.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19UTAH/19UTAH-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, snack, custards and puddings", "keywords": "chex cereal, heavy cream, whiskey, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 71}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 731, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "50 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "31 grams", "sodiumContent": "529 milligrams", "sugarContent": "53 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup/220 grams brown sugar", "1/4 cup/60 milliliters corn syrup", "3 cups/720 milliliters heavy cream", "1 1/2 cups/360 milliliters whole milk", "1 vanilla bean, halved and seeds scraped", "1 large egg, plus 3 large yolks", "5 tablespoons/40 grams cornstarch", "1/2 teaspoon salt, more to taste", "5 tablespoons/70 grams butter, cubed", "2 tablespoons/30 milliliters whiskey, preferably High West Double Rye (optional)", "1/4 box/85 grams Chex cereal", "1/2 cup/110 grams brown sugar", "1/2 cup/113 grams unsalted butter, melted", "1/2 cup/63 grams all-purpose flour", "1/2 teaspoon/1 gram ground cinnamon", "1/2 teaspoon/3 milliliters vanilla extract", "Salt and freshly grated nutmeg, to taste", "1 cup/240 milliliters heavy cream", "1 cup/226 grams mascarpone cheese", "1 cup/240 milliliters maple syrup", "Sea salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the budino: Combine brown sugar, corn syrup and 2 tablespoons water in a large heavy pot. Set over medium heat and cook, stirring, until mixture is smooth and sugar begins to caramelize, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cream, milk and the vanilla bean pod and seeds and continue cooking over medium heat, stirring often, until sugar is dissolved, about 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together whole egg, egg yolks and cornstarch. Very slowly, add 1/2 cup of the hot cream mixture, whisking constantly. Pour tempered egg mixture into pot, whisking constantly to keep eggs from scrambling. Cook 6 to 8 more minutes, stirring constantly, until mixture is thick. Remove from heat and discard vanilla bean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add salt, butter and whiskey. Emulsify budino with an immersion hand blender, or transfer to a regular blender and pulse until butter is melted and incorporated. Taste and add salt, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly so a skin does not form, pour budino into 12 4-ounce ramekins or small jars. Let cool in the refrigerator until set, about 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the Chex topping: Heat oven to 350 degrees. Mix Chex, brown sugar, butter, flour, cinnamon, vanilla, salt and nutmeg in a large bowl until cereal is coated. Spread mixture on a parchment-lined baking sheet and bake 20 minutes, tossing every 5 minutes, until browned and crisp. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the whipped mascarpone: Beat cream with an electric mixer on medium-high speed until soft peaks form. Add mascarpone and maple syrup and beat on medium speed until smooth. Season with salt, then transfer to a piping bag. Pipe whipped cheese on top of set budinos. Sprinkle Chex on top."}]}