{"@context": "http://schema.org", "@type": "Recipe", "name": "Zucchini “Pasta”", "description": "If you don’t eat wheat, or you’re on a low-carbohydrate diet and miss pasta, this can stand in for fettucine. Be very careful not to overcook it; it will be al dente after just a few minutes of cooking, after which it will quickly fall apart. When cooked just right, it’s silky and wonderful. You can eat it as is, or toss it with a fresh tomato sauce. Use a vegetable peeler or a mandolin to make the thin zucchini strips. It’s easy to do with the peeler, which is what I use.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/08/22/health/nutrition/22recipe.health.ready/22recipe.health.ready-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 200}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 100, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "545 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds zucchini (or a combination of yellow and green zucchini)", "2 tablespoons extra virgin olive oil", "Kosher salt and freshly ground pepper", "3/4 cup Fresh Tomato Sauce (optional)", "1/4 cup freshly grated Parmesan, for serving (more to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a vegetable peeler, cut the zucchini into lengthwise ribbons. Peel off several ribbons from one side, then turn the zucchini and peel off more ribbons. Continue to turn and peel off ribbons until you get to the seeds at the core of the zucchini. Discard the core. You can also do this on a mandolin, adjusted to a very thin slice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the zucchini strips in 2 batches. Heat 1 tablespoon of the oil in a large nonstick skillet over medium-high heat and when it is hot, add the zucchini ribbons and 1/2 teaspoon kosher salt. Cook, tossing and stirring the zucchini, for 2 to 3 minutes only, just until softened and beginning to be translucent. Adjust salt and add freshly ground pepper to taste, and transfer to a serving dish. Repeat with the remaining olive oil and zucchini. Serve, topping with tomato sauce and freshly grated Parmesan if desired."}]}