{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Soba Noodles With Turkey and Cabbage", "description": "Turkey cutlets are a great buy at most supermarkets. These thin medallions of turkey are perfect if you want to add small amounts of meat to a stir-fry. For the best texture, velvet the turkey before stir-frying (Steps 1 and 3).\n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/02/04/science/07recipehealth/07recipehealth-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "dairy-free, halal, healthy, high fiber, kosher, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 56}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 249, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "2 grams", "proteinContent": "14 grams", "saturatedFatContent": "2 grams", "sodiumContent": "439 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon egg white, lightly beaten", "2 teaspoons cornstarch", "1 1/2 teaspoons plus 1 tablespoon rice wine or dry sherry", "Salt to taste", "1 1/2 teaspoons water", "1/2 pound turkey cutlets, cut across the grain in 1/4-inch thick slices", "1/2 cup chicken or vegetable stock", "1 tablespoon soy sauce (more to taste)", "1/2 teaspoon sugar", "1 tablespoon minced garlic", "1 tablespoon minced ginger", "1/4 to 1/2 teaspoon red pepper flakes, or 1 to 2 serrano or Thai chiles, minced", "6 ounces soba noodles (2 bundles)", "2 teaspoons sesame oil", "2 tablespoons grapeseed oil, peanut oil, sunflower oil or canola oil", "1/2 medium cabbage, shredded (about 4 cups)", "1 bunch scallions, thinly sliced, dark green parts separated", "1/2 cup coarsely chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl stir together egg white, cornstarch, 1 1/2 teaspoons of rice wine or sherry, salt to taste and 1 1/2 teaspoons water. When you can no longer see any undissolved cornstarch add turkey and stir until coated. Cover bowl and place in refrigerator for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine stock, soy sauce, remaining rice wine or sherry, salt to taste and sugar in a small bowl and stir until salt and sugar dissolve. Combine garlic, ginger, and pepper flakes or minced chile in another bowl. Have everything within reach of your wok."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the soba in a large saucepan and toss with 2 teaspoons sesame oil. Do not drain the water. Bring it back to a boil and turn the heat down so that water is at a bare simmer. Carefully add turkey to the water, stirring so that the pieces don’t clump. Cook until turkey turns opaque on the surface but is not cooked through, about 1 minute. Drain in a colander, then on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok over high heat until a drop of water evaporates within a second or two when added to the wok. Swirl in grapeseed oil, peanut oil, sunflower oil or canola oil and add garlic, ginger and chile mixture. Stir-fry no more than 10 seconds and add turkey, cabbage and the light parts of the scallions. Stir-fry 2 minutes. Add noodles and the broth mixture. Reduce heat to medium and stir-fry 1 to 2 minutes. Add cilantro and dark green part of the scallions and stir-fry another 30 seconds to a minute, until well combined. Serve, garnished with cilantro sprigs if desired. "}], "link": "https://cooking.nytimes.com/recipes/1016017-stir-fried-soba-noodles-with-turkey-and-cabbage"}