{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Wings With Guajillo Anchovy Sauce", "description": "At Ducks Eatery in the East Village, the chef, Will Horowitz, believes in the bar snack as a maximum-detonation flavor bomb. And he’ll go to great lengths to achieve that: Many of the dishes at Ducks, including the restaurant's wings, shown here, depend on labor-intensive rounds of fermenting and smoking. For our version of the recipe, though, we asked him to reel in the effort without cutting back on the flavor. Think of the result (which involves anchovy fillets, Thai fish sauce, guajillo chiles, ancho chiles and ground chamomile) as a stealth way to sneak ambitious gastronomy into your next Super Bowl party.", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2014/10/15/dining/20141015-WINGS-slide-TLPE/20141015-WINGS-slide-TLPE-articleLarge.jpg", "totalTime": "PT15H25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, snack, finger foods", "keywords": "anchovy fillets, chicken wings, guajillo chiles, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 50}, "recipeIngredient": ["1/4 cup brown sugar", "1/4 cup kosher salt", "1/4 cup lemon juice", "2 tablespoons granulated sugar", "2 tablespoons Thai fish sauce", "2 tablespoons soy sauce", "1 tablespoon smoked paprika", "3 garlic cloves, peeled", "Stems from 1 bunch fresh cilantro", "16 large whole chicken wings", "3 dried guajillo chiles", "1 dried ancho chile", "5 garlic cloves, peeled", "1 small shallot, roughly chopped", "1 1/2 teaspoons soy sauce", "1 1/2 teaspoons Thai fish sauce", "1 1/2 tablespoons freshly ground black pepper", "Rinds and pulp of 2 juiced lemons, coarsely chopped", "1/4 teaspoon smoked paprika", "6 white anchovy fillets", "1 tablespoon finely ground chamomile flowers (finely ground pure chamomile “tea” may be used)", "1/2 cup fresh lemon juice", "1 1/2 teaspoons kosher salt, or to taste", "1/4 cup melted clarified butter or ghee", "Zest of 1 whole fresh lemon, or finely diced rind of 1 brined lemon", "Coarsely chopped leaves from 1 bunch cilantro, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Brine the wings:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the brown sugar, kosher salt, lemon juice, granulated sugar, fish sauce, soy sauce and smoked paprika. Add 2 quarts of water and mix well. Add the garlic, cilantro stems and chicken wings. Mix, cover, and refrigerate for 7 to 14 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove wings from marinade, rinse and transfer to a sheet pan with a rack. Allow to sit uncovered until dry and slightly tacky to the touch, 30 to 45 minutes."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Prepare the guajillo sauce:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut stem and cap off the guajillo and ancho chiles and remove the seeds; if the chiles are very brittle, warm them briefly in a skillet to soften. Sauté in a dry skillet until the skins change color and begin to smoke heavily, 2 to 3 minutes. Transfer to a container and cover with hot water. Soak until softened, 30 to 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain chiles and place in a food processor. Add garlic, shallot, soy sauce, fish sauce, black pepper, lemons, smoked paprika, white anchovies, chamomile, lemon juice and salt. Purée until smooth."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To roast and serve:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Brush wings with butter or ghee and roast until the internal temperature reaches 160 degrees, about 20 minutes. (Alternatively, the wings could be smoked with your choice of wood at 225 degrees for 2 1/2 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Baste wings again with butter or ghee, increase oven temperature to 450 and continue to roast until the skins are brown and crispy, 10 to 15 minutes more. (Alternatively, the wings may be deep-fried at 350 degrees until golden brown and crisp, 8 to 10 minutes.) Allow wings to rest at room temperature for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, slather wings with a generous amount of guajillo sauce and top with fresh lemon zest or brined lemon peel and a generous sprinkling of cilantro."}]}], "link": "https://cooking.nytimes.com/recipes/1016874-chicken-wings-with-guajillo-anchovy-sauce"}