{"@context": "http://schema.org", "@type": "Recipe", "name": "Velvet Chicken Breast With Mustard Sauce", "description": "Cooking chicken breasts can be tricky, especially the “skinless-boneless” kind. No matter if they are pan-fried or grilled, they are apt to be dry if left to cook even a minute too long. This recipe borrows a Chinese technique called velveting that guarantees a moist chicken breast. A simple marinade made with egg white and cornstarch is the solution. Usually the chicken is cut into strips or cubes, but small chicken breasts or cutlets can be prepared the same way for Western-style dishes. Here, an assertive mustard sauce pairs nicely with the tender meat. Serve with boiled potatoes and crisp watercress, or stir-fried spinach.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/10/29/dining/29KITCHEN/29KITCHEN-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "chicken breast, crème fraîche, mustard, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 939}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 425, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "1 gram", "proteinContent": "43 grams", "saturatedFatContent": "5 grams", "sodiumContent": "732 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 small skinless-boneless chicken breasts, about 6 ounces each", "Salt and pepper", "2 egg whites (about 4 tablespoons)", "4 tablespoons cornstarch", "2 tablespoons Dijon mustard", "2 tablespoons whole-grain Dijon mustard", "1 teaspoon dried mustard", "1 tablespoon grated horseradish", "1/2 cup crème fraîche", "1 cup chicken broth", "3 tablespoons melted butter or vegetable oil", "1 teaspoon roughly chopped thyme leaves", "2 tablespoons snipped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim chicken breasts to a uniform size, shape and thickness; they should be about 1/2 inch thick. (If using larger breasts, slice them into 1/2-inch-thick cutlets.) Season generously on both sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Velvet the chicken: In a medium-size mixing bowl, whisk egg whites until frothy, then whisk in cornstarch until lump-free. Add chicken breasts and coat well with cornstarch mixture, then cover and marinate for 30 minutes. (Chicken may also be marinated several hours ahead and refrigerated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile in a small mixing bowl, stir together Dijon mustard, whole-grain mustard, dried mustard, horseradish and crème fraîche. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put butter or oil in a skillet over medium heat. Lay chicken breasts in the pan and sauté very lightly for 30 seconds a side without browning. Remove breasts and blot on paper towels. Discard remaining oil and wipe pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return skillet to stove and add mustard and crème fraîche mixture and chicken broth. Whisk together to make a thin sauce and bring to a gentle simmer. Add breasts and simmer for 1 minute, then turn breasts over, cover pan and simmer for 2 minutes. Turn off heat and leave covered for 1 or 2 minutes more, until meat is firm to the touch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer breasts to a warm platter. Bring sauce to a boil, add chopped thyme  and reduce until slightly thickened. Spoon sauce over breasts, sprinkle with chives and serve."}]}