{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Salad With Peanuts and Tofu", "description": "With a little advance preparation, this spicy salad can be made in 30 minutes. You can cook the two kinds of rices together if you soak the red rice for an hour first; the antioxidant-rich pigment from the red rice will bleed into the white rice, turning it an attractive  pale rusty color, which is nice. The marinade and the rice will keep for about 3 days in the refrigerator. The baked tofu will also keep, in the marinade, for a couple of days.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/05/15/dining/Rice-With-Peanuts/Rice-With-Peanuts-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "lunch, quick, salads and dressings, appetizer, main course", "keywords": "dairy-free, gluten-free, halal, high fiber, kosher, vegetarian, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 83}, "recipeIngredient": ["1/2 cup red rice, soaked for 1 hour and drained", "1 cup basmati or jasmine rice, rinsed", "2 1/2 cups water", "Salt to taste (I use about 3/4 teaspoon)", "1/2 cup chopped cilantro", "1/2 cup lightly toasted unsalted peanuts, chopped (about 2 ounces)", "1 cup English peas, steamed for 5 minutes if using fresh, thawed if frozen", "1 bunch green onions or, chopped, or 1/4 cup chopped chives", "1 to 2 serrano chiles or bird chiles, minced", "Romaine or leaf lettuce for the platter or plates", "1 avocado, sliced,  avocado for garnish (1 avocado)", "Black sesame seeds for garnish", "1/2 tablespoon minced ginger", "2 tablespoons soy sauce, preferably tamari", "1 14-ounce block of organic extra-firm tofu (find one that is not too dry)", "1 garlic clove, minced", "1/2 tablespoon minced shallot", "1/2 teaspoon cumin seeds, lightly toasted and ground", "1/8 teaspoon of cayenne", "1 tablespoon honey or agave nectar", "2 tablespoons plus 2 teaspoons fresh lime juice", "3 tablespoons toasted peanut oil", "3 tablespoons grapeseed grape seed oil or canola oil (use 6 tablespoons if toasted peanut oil is not available)", "Chopped cilantro (whatever is left of the bunch you use for the salad) or cilantro sprigs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the two kinds of two rices in a medium saucepan. Add water and salt to taste and bring to a boil. Reduce heat, cover and simmer 15 to 20 minutes, until rice is tender and all of the liquid in the pan has been absorbed. Remove from heat. Remove lid, place a clean dishtowel across the pan (not touching the rice) and return lid to the pan. Let sit undisturbed for 15 minutes or longer. Remove lid and towel, transfer to a bowl and allow to cool. Add cilantro, peanuts, peas, scallions or chives and chiles and toss together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While rice is cooking, preheat oven to 375 degreesºF. Line a sheet pan with parchment. Pat tofu dry with paper towels and cut laterally into 4 equal squares, then cut squares into strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, wide bowl whisk together soy sauce, ginger, garlic, shallot, cumin, cayenne, honey or agave nectar, 2 teaspoons of the lime juice, 3 tablespoons of the grape seed or canola oil, and cilantro to taste. Pat each square of tofu dry with paper towels, then dip into marinade, making sure to coat both sides. Transfer to baking sheet. Do not drain the marinade."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake tofu for 10 to 15 minutes, until the edges are just beginning to color and marinade sets on the surface. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining lime juice to the marinade and whisk in remaining oil. Add to rice mixture and toss."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a platter or wide bowl, or individual plates with lettuce leaves and top with rice mixture. Lay tofu strips on top, garnish with avocado slices, black sesame seeds if desired, and cilantro, and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1016223-rice-salad-with-peanuts-and-tofu"}