{"@context": "http://schema.org", "@type": "Recipe", "name": "Buttery Moong Dal With Garlic and Cumin", "description": "This a basic mung bean dal, meant to be a simple everyday Indian meal with rice and chapati, or a side dish as part of a larger meal. The wonderful buttery flavor is obtained from the technique called tarka, which means spices sizzled in ghee, added to the pot at the end of the cooking process. Whirl the dal in a blender for a velvet-smooth texture. You could serve it as is, with the texture of a thick vegetable purée, or thin it with a little water and serve it as a soup. Other legumes such as red lentils or yellow split peas may be used instead.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/02/28/dining/recipes-butterymoongdal/recipes-butterymoongdal-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "indian", "recipeCategory": "dinner", "keywords": "cumin, garlic, mung beans, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 148}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 55, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "121 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup moong dal (split mung beans), soaked 2 hours in cold water, drained and rinsed", "1/2 teaspoon turmeric", "1 teaspoon salt", "3 tablespoons ghee, clarified butter or vegetable oil", "1/2 teaspoon cumin", "1 green chile, slit lengthwise", "4 garlic cloves, minced", "1 large shallot, diced", "Garam masala or red chile powder (optional)", "Plain basmati rice, freshly cooked, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put dal, turmeric and salt in a large soup pot, add 7 cups water and bring to a gentle boil, stirring. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat very low and cover pot with lid slightly ajar. Check pot and stir frequently, as the dal has a tendency to boil over in the beginning. Skim off and discard any foam that rises. Cook for about 45 minutes, until quite soft. Taste and adjust salt. For a smooth, velvety consistency, purée dal in a blender, then return to pot. If you prefer some texture, just beat with a whisk for a minute or two. (If dal is very thick, thin with a little water.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tarka: Heat ghee in a small skillet over medium-high heat. Add cumin, chile and garlic and cook until cumin is fragrant and garlic is lightly colored, about 1 minute. Add shallot and continue cooking until shallot is softened, about 1 minute more. Pour contents of skillet into pot and stir into the dal. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a serving bowl or individual soup bowls. Sprinkle with a pinch of garam masala or red chile powder and/or serve with basmati rice, if desired. Dal may be made in advance, refrigerated and reheated (it will solidify when chilled and need thinning). Cool to room temperature before refrigerating. It will keep 2 to 3 days.\n\n"}]}