{"@context": "http://schema.org", "@type": "Recipe", "name": "The Ultimate Veggie Burger", "description": "You make a veggie burger because you want the hamburger experience without the meat. This one delivers. It’s got a firm, beefy texture that takes on the char and smoke of the grill, but is adaptable enough to cook inside on your stove. The enemy of a veggie burger is mushiness, which stems from a high moisture content. To combat that, the very watery ingredients – mushrooms, tofu, beans and beets – are roasted to both dehydrate them somewhat and intensify their flavors. Yes, the ingredient list here is long; you need a diverse lot to make a good veggie burger. And each one adds something in terms of flavor and/or texture. Garnish this any way you like, and don’t forget to toast the buns.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/01/02/dining/mc-veggie-burger/mc-veggie-burger-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "6 burgers", "recipeCuisine": "", "recipeCategory": "dinner, lunch, burgers", "keywords": "main course, mushroom, tofu", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1388}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 441, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "7 grams", "proteinContent": "22 grams", "saturatedFatContent": "7 grams", "sodiumContent": "629 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 ounces extra-firm tofu, drained", "Olive oil", "1/2 pound cremini mushrooms, trimmed and sliced", "3/4 teaspoon kosher salt, more as needed", "Black pepper, as needed", "1 (15-ounce) can kidney beans, drained", "1 medium beet, peeled and coarsely grated (3/4 cup)", "3/4 cup tamari almonds or cashews", "1/3 cup panko bread crumbs", "2 ounces Cotija cheese or queso blanco, crumbled or grated (about 1/2 cup)", "2 large eggs", "2 tablespoons mayonnaise", "2 scallions, sliced", "3 garlic cloves, finely chopped", "3/4 teaspoon dulce pimentón or sweet smoked paprika", "4 ounces tempeh, crumbled", "1/2 cup cooked brown rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Slice tofu into 1/4-inch-thick slabs and pat dry with paper towel. Arrange tofu on one half of a rimmed baking sheet; brush both sides with oil. Spread mushrooms on the other half of the baking sheet; toss with 2 tablespoons oil and salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a second rimmed baking sheet, toss beans and grated beet with 1 tablespoon oil and salt and pepper, then spread the mixture into one layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer both baking sheets to the oven. Roast bean-beet mixture, tossing occasionally, until beans begin to split and beets are tender and golden, about 15 minutes. Roast mushrooms and tofu until golden and most of the liquid has evaporated, about 25 minutes. Let everything cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place nuts in a food processor and pulse until coarsely ground. Add cooled bean-beet mixture, mushrooms, tofu, panko, cheese, eggs, mayonnaise, scallion, garlic, pimentón and 3/4 teaspoon salt. Pulse until ingredients are just combined. Pulse in tempeh and rice but do not overprocess. You want small chunks, not a smooth mixture. Scrape mixture into a bowl and chill at least 2 hours or up to 5 days (you can also freeze the burger mix)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to make the burgers, divide mixture into 6 equal portions and form each portion into a patty about 1 inch thick. Return to the fridge until just before grilling. They grill better when they start out cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the grill. Cook the burgers over a low fire until they are charred on both sides and firm when you press on them, 4 to 6 minutes per side. If they start to burn before they firm up, move them to the sides of the grill to finish cooking over indirect heat. Alternatively, you can cook these on a grill pan or in a skillet over low heat."}], "link": "https://cooking.nytimes.com/recipes/1016668-the-ultimate-veggie-burger"}