{"@context": "http://schema.org", "@type": "Recipe", "name": "Stewed Lentils with Cabbage", "description": "This humble and hearty combination makes a satisfying main dish, especially on a cold night. Lentils are an excellent source of folate and molybdenum, and a very good source of dietary fiber, protein, and manganese. Any type will work here.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/12/08/health/nutrition/08recipe.health.span.ready/08recipe.health.span.ready-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 188}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 243, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "9 grams", "proteinContent": "12 grams", "saturatedFatContent": "1 gram", "sodiumContent": "886 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 medium onion, half of it chopped, half sliced", "3 garlic cloves, minced", "1/2 pound lentils (brown, green, or beluga), rinsed and picked over", "3 1/2 cups water (more as needed)", "1 dried red chile", "1 bay leaf", "Salt to taste", "6 ounces waxy potatoes, scrubbed and sliced about 1/2 inch thick", "1 1/2 pounds green cabbage (1 medium head), cored and cut crosswise in 3/4-inch wide ribbons", "1 tablespoon chopped flat-leaf parsley", "Freshly grated Parmesan for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in a 3-quart saucepan or casserole over medium heat. Add the chopped half of the onion and cook, stirring often, until tender, about 5 minutes. Add 2 of the garlic cloves and cook, stirring, until fragrant, 30 seconds to a minute. Add the lentils, water, chile, and bay leaf, and bring to a simmer. Reduce the heat, cover and simmer over low heat for 15 minutes. Add 1 teaspoon salt and the potatoes and continue to simmer gently for 30 minutes, until the lentils and potatoes are tender. Add more salt and freshly ground pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the lentils are simmering, cook the cabbage with the remaining onion and garlic in a wide lidded skillet. Heat the remaining tablespoon of olive oil over medium heat and add the sliced onion. Cook, stirring often, until tender, about 5 minutes. Add 1/2 teaspoon salt and the garlic and stir together until the garlic is fragrant, about 1 minute. Add the cabbage and turn the heat to medium-high. Cook, stirring, until the cabbage begins to wilt. Add 1/4 cup water, turn the heat down to medium, cover and simmer 10 minutes, or until the cabbage is tender and sweet, stirring from time to time. Add salt and freshly ground pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the cabbage over the bottom of the pan in an even layer. Top with the lentils and potatoes. Sprinkle on the parsley, and serve in wide soup bowls. Sprinkle with Parmesan if desired."}], "link": "https://cooking.nytimes.com/recipes/1016511-stewed-lentils-with-cabbage"}