{"@context": "http://schema.org", "@type": "Recipe", "name": "Lettuce and Potato Soup", "description": "This is what the French do with the outer leaves of lettuce that are too tough for a salad. The soup is good hot or cold.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/10/24/health/nutrition/24recipe.health.soup.ready/24recipe.health.soup.ready-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 19}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 212, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "973 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 medium onion, chopped", "1 leek, white and light green parts only, sliced and rinsed well", "2 garlic cloves, minced", "1 1/4 to 1 1/2 pounds (2 large) russet or Yukon gold potatoes, peeled and diced", "6 cups chicken stock, vegetable stock, or water", "A bouquet garni made with a cleaned leek green, a bay leaf and a few sprigs each parsley and thyme, tied together", "Salt to taste", "5 ounces lettuce leaves, washed and coarsely chopped (4 cups)", "Freshly ground pepper", "2 tablespoons chopped flat-leaf parsley or chives for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large, heavy soup pot over medium heat and add the onion and leek. Cook, stirring, until tender, about 5 minutes. Add 1/2 teaspoon salt and the garlic and cook, stirring, until the garlic is fragrant, about 1 minute. Add the potatoes, stock or water, and bouquet garni, and bring to a simmer. Add salt to taste, cover and simmer over low heat for 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the lettuce leaves and continue to simmer for another 15 minutes. The potatoes should be thoroughly tender and falling apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an immersion blender, or in a blender or food processor fitted with the steel blade (working in batches and covering the blender lid or food processor with a kitchen towel to prevent the hot soup from splashing), blend the soup until smooth. If you want a smoother, silkier texture, strain the soup through a medium strainer, pushing it through the strainer with a pestle, spatula, or the bowl of a ladle. Return the soup to the heat, add lots of freshly ground pepper, taste and adjust salt. , Heat through and serve, garnishing each bowl with chopped fresh parsley or chives."}]}