{"@context": "http://schema.org", "@type": "Recipe", "name": "Candied Clementines", "description": "These intensely flavorful slices are the perfect garnish for a <a href=\"http://cooking.nytimes.com/recipes/1016184-clementine-cake\">clementine cake</a> and any other dessert that calls for a sweet dash of citrus. Though cooking down the fruit takes hours, you can start the simmer and leave it, checking in only occasionally. The sugar syrup left after the clementines are removed is worth saving for cocktails or even pouring over pancakes.", "author": {"@type": "Person", "name": "John Willoughby"}, "image": "https://static01.nyt.com/images/2014/04/21/dining/Candied-Clementines/Candied-Clementines-articleLarge-v2.jpg", "totalTime": "PT3H30M", "recipeYield": "About 18 to 24 slices", "recipeCuisine": "", "recipeCategory": "", "keywords": "clementines, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 99}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 79, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "0 grams", "proteinContent": "0 grams", "saturatedFatContent": null, "sodiumContent": "0 milligrams", "sugarContent": "20 grams", "transFatContent": null}, "recipeIngredient": ["2 cups sugar", "3 to 4 clementines, peel on, sliced as thin as possible"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan combine the sugar with 2 cups water and bring to a boil. Add the clementine slices, reduce heat to simmer, and place a piece of parchment paper over top of liquid to keep clementines submerged. Simmer 2 hours, then remove from heat and allow to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 250 degrees. Lay a Silpat mat or parchment paper on a baking sheet, place clementine slices in a single layer on top (making sure they lie flat), then cover with a second mat or layer of parchment and top that with a second baking sheet. Put in oven and bake for 1 hour, then remove from oven. (Reserve citrus-infused syrup in refrigerator for cocktails or other uses.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cool enough to handle, remove top baking sheet and carefully peel away top mat or parchment. Carefully lift and peel the candied citrus slices and set aside until ready to use."}]}