{"@context": "http://schema.org", "@type": "Recipe", "name": "Duck With Cherries and Red Wine Vinegar", "description": "Classic French duck dishes, like Caneton aux Cérises (roast duckling with cherries) are for the most part considered too formal or just old-fashioned, relics from a bygone era. An updated version, however, can have great appeal. This interpretation uses a pan-roasted large Muscovy duck breast instead of a whole bird, as easy to cook as a steak. A pungent spice rub imbues it with big flavor. The sauce maintains some classic elements, like red wine vinegar and caramelized sugar, for a sweet-sour aspect, but fresh ginger and cayenne are added for more dimension and spark. Note: Muscovy breasts are quite lean and are best cooked rare to medium-rare (rosy); otherwise the meat will be dry.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/06/04/dining/04KITCH1/04KITCH1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "cherries, duck, red wine vinegar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 150}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 230, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "1 gram", "proteinContent": "18 grams", "saturatedFatContent": "4 grams", "sodiumContent": "661 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 Muscovy duck breasts, about 1 pound each", "Kosher salt", "1 teaspoon black peppercorns", "1/2 teaspoon allspice berries", "4 cloves", "2 bay leaves", "1/2 teaspoon fennel seeds", "1/4 cup turbinado or raw sugar", "1/2 cup red wine vinegar", "1/2 cup red wine", "1 cup chicken broth", "1 tablespoon grated fresh ginger", "Pinch of cayenne", "Kosher salt", "2 tablespoons butter", "1/2 pound ripe cherries, left whole or halved and pitted", "2 teaspoons granulated sugar", "1 tablespoon kirsch or Cognac"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim excess fat from duck breasts, leaving a 1/4-inch layer covering the breast. (Save fat trimmings to render and use for another purpose.) With a sharp knife, lightly score fat cover diagonally in two directions, taking care not to cut too deeply and expose meat. Turn breasts over and remove the thin tenderloins from underside. Trim away any veiny or ragged bits. (Save meaty trimmings for making stock.) Season generously on both sides with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulverize the peppercorns, allspice berries, cloves, bay leaves and fennel seed in a mortar or electric spice mill. Sprinkle spice mixture over duck breasts; massage seasoning into meat on both sides. For more-intense flavor, do this several hours ahead or overnight and refrigerate (recommended). Bring duck to room temperature before cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Put turbinado sugar and red wine vinegar in a saucepan and simmer over medium-high heat for 2 minutes, until syrupy. Add red wine and chicken broth and simmer briskly until sauce coats spoon, about 5 minutes. Stir in ginger, cayenne and 1/2 teaspoon salt. Set aside. You should have about 1 cup sauce. (Sauce may be made a day or two in advance, if desired.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a wide cast-iron pan over medium high heat. When pan is hot, place duck breasts side by side, skin side down. Let sizzle gently for about 7 minutes, until skin is crisp and golden, turning down heat as necessary to keep from getting too dark. Turn breasts over and cook 5 to 7 minutes more. (Alternatively, finish cooking breasts in a 400-degree oven.) Check temperature frequently with an instant-read thermometer; internal temperature should be a bit less than 125 degrees. Remove breasts and let rest on a warm platter for 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish sauce, put butter in a saucepan over medium high heat. Add cherries and granulated sugar and cook for a minute or two, stirring, until cherries are heated through and beginning to get juicy. Add kirsch and cook 1 minute more, then add previously prepared sauce and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice duck breasts at an angle and arrange slices on a platter. Spoon some of the sauce and cherries over meat and pass remaining sauce at table."}]}