{"@context": "http://schema.org", "@type": "Recipe", "name": "Yellow Layer Cake With Chocolate Frosting", "description": "Craving a good old-fashioned cake, a tall, frosted showgirl, preening on a high crystal stand? This yellow cake with chocolate frosting and a macaroon crunch is just the ticket. This recipe is adapted from one made at Junior’s in Brooklyn. The cake is moist, and the frosting sweet. Quite sweet, actually. Just right.", "author": {"@type": "Person", "name": "Alex Witchel"}, "image": "https://static01.nyt.com/images/2014/03/24/dining/yellowcake/yellowcake-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "One 9-inch cake", "recipeCuisine": "", "recipeCategory": "brunch, lunch", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 128}, "recipeIngredient": ["Butter, for greasing cake pans", "1 2/3 cups sifted cake flour", "1 tablespoon baking powder", "3/4 teaspoon salt", "10 extra-large eggs, separated", "1 1/3 cups sugar", "1 tablespoon vanilla extract", "1/2 teaspoon pure lemon extract", "3/4 cup (1 1/2 sticks) unsalted butter, melted and cooled", "1/2 teaspoon cream of tartar", "1 1/2 cups finely chopped nuts (almonds, pecans and/or walnuts)", "1/2 cup sweetened coconut flakes", "8 cups (2 pounds) sifted confectioners’ sugar", "1 2/3 cups unsweetened cocoa powder", "1/2 teaspoon salt", "1 1/2 cups (3 sticks) unsalted butter, at room temperature", "1/2 cup margarine, at room temperature", "1/4 cup dark corn syrup", "2 tablespoons vanilla extract", "3/4 cup heavy cream, or as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the cake: Preheat oven to 350 degrees. Generously butter two round 9-inch cake pans, and line bottoms with parchment or wax paper. Sift cake flour, baking powder and salt together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a stand mixer, beat egg yolks on high for 5 minutes. With mixer still running, gradually add 1 cup sugar and continue beating until thick, light yellow ribbons form in bowl, about 5 minutes more, scraping bowl two or three times. Beat in the vanilla and lemon extracts. Sift flour mixture over batter and stir it in by hand until blended. Add melted butter, and stir until completely incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, clean bowl, and using the mixer’s whisk attachment, beat egg whites and cream of tartar together on high until frothy. Gradually add remaining 1/3 cup sugar, and continue beating until whites are stiff but not dry. Stir 1 cup of whites into batter, then gently fold in remaining whites until blended. Divide batter between prepared pans. Bake until golden and center springs back when lightly touched, about 25 minutes. Cool on a wire rack for 15 minutes, then remove from pans and cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For macaroon crunch: Toss nuts and coconut together, and spread on a baking sheet. Bake at 350 degrees until golden and crunchy, 10 to 15 minutes, tossing twice. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For chocolate frosting: Sift the confectioners’ sugar, cocoa and salt together. Using a stand mixer, cream together the butter and margarine on high until light yellow and slightly thickened, about 3 minutes. With mixer still running, add corn syrup and vanilla. Reduce speed to low and add sugar mixture in two batches, beating well after each. Blend in 3/4 cup cream until frosting is a spreading consistency, adding more if needed. Increase speed to high and beat until light and creamy, about 2 minutes more; there will be about 8 cups of frosting. Spoon about 1 cup into a pastry bag fitted with a medium star tip."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For assembly: Using a long serrated knife, cut each cake horizontally into two equal layers. Spread first layer with about a fifth of frosting, then place second layer on top of it and frost it, too. Repeat with third and fourth layers. Frost sides with all remaining frosting except what is in pastry bag. Pat macaroon crunch on sides of cake (not top) until covered. Using frosting in pastry bag, pipe 6 rosettes on top of cake. Serve immediately, or cover and refrigerate, allowing cake to stand at room temperature for about an hour before slicing."}], "link": "https://cooking.nytimes.com/recipes/1016162-yellow-layer-cake-with-chocolate-frosting"}