{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Schnitzel With Quick Pickles", "description": "When most people think of schnitzel, they default to veal. But pork has its merits. Pork schnitzel is not only more economical than veal, it’s also richer in flavor and easier to cook (you’ve got a bigger margin of error when it comes to timing because pork isn’t as apt to dry out). This recipe calls for panko, which are fluffy Japanese-style bread crumbs that make the coating particularly light. But any bread crumbs will work. If you don’t want to make the quick pickles, serve this with a sliced up cucumber or two and/or fennel bulb with some lime wedges on the side. And if you happen to have lingonberry jam on hand, this is a great time to use it.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/10/10/multimedia/clark-schnitzel/clark-schnitzel-mediumThreeByTwo440.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "austrian", "recipeCategory": "dinner, lunch", "keywords": "cucumber, panko, pork, scallion, shallot, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 664}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 602, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "60 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "5 grams", "proteinContent": "40 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1303 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 limes", "3 small Kirby cucumbers or 1 large cucumber, peeled if you like and thinly sliced", "1/3 cup very thinly sliced fennel bulb (save the fronds for garnish)", "1 large shallot or 1/2 small red onion, thinly sliced", "1 tablespoon light brown sugar", "1/2 teaspoon kosher salt", "1/2 cup flour", "1/8 teaspoon cayenne", "1/8 teaspoon freshly grated nutmeg", "2 eggs, beaten", "1 1/2 cups panko or other unseasoned bread crumbs", "1 1/4 pounds boneless pork cutlets, pounded to 1/8-inch thick", "Coarse kosher salt and ground black pepper", "Safflower, peanut or vegetable oil, for frying", "1 scallion, thinly sliced, including greens", "Lingonberry jam, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pickles: Grate the zest from one of the limes and juice them both. Add zest and juice to a shallow bowl along with the remaining pickle ingredients and toss well. Let sit for at least 30 minutes and up to 3 days. Chill if letting them sit for longer than 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the pork: Mix flour with cayenne and nutmeg. Place flour mixture in one shallow dish, place eggs in a second dish, and place bread crumbs in a third dish. Season pork cutlets generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1/8 inch oil in a large skillet over medium-high heat. While oil heats, dip cutlets one by one into flour (shake off any excess), then into eggs (ditto) and finally into the bread crumbs, taking care not to handle pork more than necessary (hold meat by ends)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When oil sizzles when a pinch of bread crumbs is thrown in, add as many cutlets as comfortably fit in one layer, leaving plenty of room around them. Swirl and tilt pan so oil cascades over top of cutlet in waves. When bottom is golden brown, 3 to 4 minutes, flip and brown the other side, swirling pan (swirling helps create air pockets, giving you lighter schnitzel). Transfer to a paper-towel-lined baking platter or baking tray and sprinkle with more salt. Repeat with remaining pork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve pork sprinkled with scallion and drizzled with a little of the pickle juice, accompanied by the pickles and the lingonberry jam, if you like."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Pork Schnitzel With Quick Pickles", "description": "Melissa Clark shows how to make schnitzel, a fast, simple and flavorful weeknight meal.", "thumbnailUrl": "https://static01.nyt.com/images/2014/10/10/multimedia/clark-schnitzel/clark-schnitzel-mediumThreeByTwo440.jpg", "uploadDate": "2014-10-10T21:10:35.000Z", "duration": "PT3M17S"}, "link": "https://cooking.nytimes.com/recipes/1016866-pork-schnitzel-with-quick-pickles"}