{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto with Tomatoes and Corn", "description": "This colorful risotto serves as a luxurious showcase for summer’s bounty of tomatoes and corn. This is about as colorful and summery a risotto as you can get. The tomatoes and broth team up as a rich medium for the rice. Don’t add the corn too soon, or it will develop a starchy texture like the rice. But cook it long enough to bring out its sweet flavor. Simmer the corn cobs for about 20 minutes in your broth to get a great sweet corn flavor.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/07/22/science/25recipehealth/25recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner", "keywords": "gluten-free, kosher, low cholesterol, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 145}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 320, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1110 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 good-size ears sweet corn", "7 cups well-seasoned vegetable stock or chicken stock", "2 tablespoons extra virgin olive oil", "1/2 cup minced onion", "Salt to taste", "2 garlic cloves, minced", "1 1/2 cups arborio rice", "1 pound tomatoes, grated or peeled, seeded and diced", "Pinch of sugar", "Salt and freshly ground pepper to taste", "1/2 cup dry white wine, such as pinot grigio or sauvignon blanc", "2 to 3 tablespoons slivered fresh basil, or a mix of basil, chives, and parsley", "1/4 to 1/2 cup freshly grated Parmesan cheese (1 to 2 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove corn kernels from cobs and set aside the kernels. Simmer the cobs in stock for 20 to 30 minutes. Remove from stock and discard. Make sure your stock is well seasoned. Bring back to a simmer over low heat, with a ladle nearby or in the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil over medium heat in a wide, heavy skillet or a wide, heavy saucepan. Add onion and a generous pinch of salt, and cook gently until tender, about 5 minutes. Add garlic and rice and cook, stirring, until grains of rice are separate and beginning to crackle, a minute or two. Stir in tomatoes, sugar and salt to taste and cook, stirring, until tomatoes have cooked down slightly, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wine and stir until it has evaporated and has been absorbed by the rice. Begin adding simmering stock, a couple of ladlefuls (about 1/2 cup) at a time. Stock should just cover the rice and should be bubbling, not too slowly but not too quickly. Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock and continue to cook in this fashion, adding more stock and stirring when rice is almost dry. You do not have to stir continually, but stir often and vigorously. After 10 minutes, add corn and continue for another 10 to 15 minutes. When rice is just tender all the way through but still chewy (al dente), in 20 to 25 minutes, it is done. Taste now and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another ladleful of stock to rice. Stir in basil (or basil, parsley and chives) and Parmesan and remove from heat. The mix should be creamy (add more stock if it sn’t). Serve right away in wide soup bowls or on plates, spreading the risotto in a thin layer rather than a mound."}], "link": "https://cooking.nytimes.com/recipes/1016690-risotto-with-tomatoes-and-corn"}