{"@context": "http://schema.org", "@type": "Recipe", "name": "Three Sisters Stew", "description": "Matt Mead, the governor of Wyoming, recalls being taken out by his grandfather on the family ranch to shoot his first duck for Thanksgiving at age 9, when he was so small that his grandfather had to brace him from behind to help absorb the kick from the shotgun.\n\nGame is found on many Thanksgiving tables in the state, but other traditions predate the hunt. The trinity of corn, beans and squash was central to the agriculture of the Plains Indians in what would later become Wyoming, and some cooks honor that history each Thanksgiving with a dish called Three Sisters stew. The writer Pamela Sinclair’s version is a highlight of her 2008 cookbook, “A Taste of Wyoming: Favorite Recipes From the Cowboy State.” The stew works nicely as a rich side dish for turkey, and can easily be adapted to vegetarian tastes by omitting the pork and adding a pound of cubed butternut squash instead.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19WYOMING/19WYOMING-articleLarge.jpg", "totalTime": "PT1H40M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "black beans, corn, pinto beans, pork loin, tomatoes, turkey stock, yellow squash, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1122}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 389, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "10 grams", "proteinContent": "24 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1071 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound trimmed pork loin, cut into 1-inch cubes", "1 teaspoon ground cumin", "Kosher salt, as needed", "Black pepper, as needed", "2 tablespoons neutral oil, such as canola", "1 large yellow onion, diced", "3 garlic cloves, minced", "4 cups turkey or chicken stock, preferably homemade or low-sodium", "1 medium yellow squash, diced", "1 (15-ounce) can pinto beans, drained", "1 (15-ounce) can black beans, drained", "1 (14 1/2-ounce) can chopped tomatoes", "2 cups fresh or frozen corn kernels", "1 (4-ounce) can roasted green chiles (1/2 cup)", "1/2 bunch fresh cilantro, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season pork with cumin, salt and pepper. Heat oil in a Dutch oven or large heavy-bottomed saucepan over medium-high heat until it shimmers. Add pork, in batches if necessary, and cook, turning as needed, until lightly browned on all sides, 5 to 6 minutes. Transfer pork to a bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion to pan and sauté, stirring occasionally, until translucent, 5 to 7 minutes. Add garlic and sauté, stirring occasionally, until lightly colored, 2 to 3 minutes. Return pork to pan, along with stock and squash, and bring to a boil. Reduce heat to medium-low and simmer, covered, for about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add beans, tomatoes, corn and chiles and cook, uncovered, over medium heat until stew has thickened, about 40 minutes. Add cilantro and season to taste with salt and pepper."}], "link": "https://cooking.nytimes.com/recipes/1016956-three-sisters-stew"}