{"@context": "http://schema.org", "@type": "Recipe", "name": "Cabbage and Parmesan Soup With Barley", "description": "A comforting soup with texture and bulk provided by barley. Parmesan rinds, simmered here in the same way that a ham bone might be used in France or Italy, contribute great depth of flavor to this wonderful, comforting soup. I love the added texture and bulk provided by the barley.\n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/01/29/health/29recipehealth/29recipehealth-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, soups and stews", "keywords": "appetizer, main course, barley, cabbage, parmesan, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 108}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 155, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1017 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 medium onion, chopped", "1 medium head cabbage, cored and shredded (7 to 8 cups)", "2 garlic cloves, peeled and crushed", "Salt to taste", "1 large Yukon gold or 1/2 russet potato (about 6 ounces), peeled and diced ", "6 cups water, chicken stock or vegetable stock", "2 large Parmesan rinds (2 to 3 ounces)", "Freshly ground pepper to taste", "1 cup cooked barley", "Chopped fresh dill, chives or parsley for garnish", "Freshly grated Parmesan for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil over medium heat in a large, heavy soup pot. Add onion and cook, stirring, until tender, about 5 minutes. Add shredded cabbage, garlic, and about 1/2 teaspoon salt. Cook, stirring often, until the cabbage begins to soften, about 5 minutes. Add the potato, the water or stock, the Parmesan rinds, and salt and pepper to taste. Bring to a boil, reduce the heat to low, cover and simmer over low heat for 45 minutes, until the vegetables are very soft. Remove and discard the Parmesan rinds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an immersion blender, or in batches in a regular blender coarsely purée the soup. If using a regular blender fill it only halfway and pull a dishtowel over the top rather than covering tightly with the lid.  Return to the pot and stir in the barley, or place a spoonful of barley in each bowl. Taste the soup and adjust seasonings, and heat through. Serve, garnishing each bowl with a sprinkling of minced dill, chives or parsley, and a spoonful of grated Parmesan."}]}