{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Waffles With Smoked Trout", "description": "These savory waffles were inspired by the Solomon Gundy waffles at M. Wells Steakhouse in Long Island City, Queens. It starts with a mashed potato waffle batter, which is baked in a waffle iron until very crisp around the edges. They are then opulently topped with crème fraiche (or sour cream), smoked trout and trout or salmon roe. If you can’t find smoked trout, smoked salmon makes a fine substitute. Or try them topped with scrambled or fried eggs. Potato waffles make a terrific savory brunch dish, a light supper, or appetizer before a dinner party — they are unexpected in a festive, delightful way.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/02APPE1_SPAN/02APPE1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 waffles", "recipeCuisine": "", "recipeCategory": "breakfast, dinner", "keywords": "appetizer, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 45}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 340, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "12 grams", "sodiumContent": "394 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 medium Yukon Gold potatoes (14 ounces), peeled and cut into 1-inch cubes", "Coarse salt", "1 cup whole milk", "3 grams active dry yeast (1 teaspoon)", "5 grams granulated sugar (1 teaspoon)", "250 grams all-purpose flour (2 cups)", "5 grams baking soda (1 teaspoon)", "7 grams baking powder (1 1/2 teaspoons)", "2 large eggs, separated", "1 cup sour cream ", "8 tablespoons (1 stick) unsalted butter, melted, plus more for waffle iron", "Crème fraîche or more sour cream, for serving ", "6 ounces smoked trout, for serving", "2 ounces trout or salmon roe, for serving", "Lemon wedges, for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil potatoes in a medium saucepan of salted water until tender, about 8 minutes. Drain, mash with a fork or potato masher and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat milk in a small saucepan or the microwave until warm to the touch but not hot. Sprinkle in yeast and sugar and let sit until foamy, about 5 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir together flour, baking soda, baking powder and 1 1/2 teaspoons salt. In a separate large bowl, whisk egg yolks, sour cream and butter. Whisk milk mixture into egg mixture, then add dry ingredients. Stir in mashed potatoes. Let batter sit for 30 minutes at room temperature. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In bowl of a standing mixer, beat egg whites on high speed until stiff. Fold into batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat waffle iron. Using a pastry brush or paper towel, lightly coat iron with melted butter. Cook waffles (using about 1/2 cup batter per waffle) until golden and crisp. Butter the iron in between batches as needed. Serve waffles immediately as they are ready, or keep them warm in a 200-degree oven until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve warm topped with crème fraîche, smoked trout pieces and salmon roe, with lemon wedges on the side. "}]}