{"@context": "http://schema.org", "@type": "Recipe", "name": "Tostadas With Beans, Cabbage and Avocado", "description": "Beans are traditionally fried in lard, but I use a small amount of grapeseed or sunflower oil instead, and rely on the broth from the beans for flavor. This is a great buffet dish for a Mexican dinner party. I prefer to toast the tortillas using the microwave method, but you can also deep-fry them.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/02/11/science/14recipehealth/14recipehealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 6", "recipeCuisine": "mexican", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low calorie, low-carb, low cholesterol, low-fat, low-sodium, low sugar, nut-free, vegan, vegetarian, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 63}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 346, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "10 grams", "proteinContent": "9 grams", "saturatedFatContent": "5 grams", "sodiumContent": "487 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 recipe Simmered Pintos with broth\n", "2 tablespoons grapeseed, sunflower or canola oil\n", "1 tablespoon cumin seeds, lightly toasted and ground\n", "2 teaspoons mild ground chili powder\n", "8 corn tortillas\n", "2 cups shredded cabbage\n", "2 small or 1 large, ripe avocado, diced or sliced\n", "Fresh lime juice and salt to taste\n", "1 cup bottled or fresh salsa (more to taste)\n", "1/4 cup chopped toasted almonds\n", "3/4 cup crumbled queso fresco\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain off about 1/2 cup of liquid from the beans, retaining it in a separate bowl to use later for moistening the beans, should they dry out. Heat oil over medium-high heat in a large, heavy nonstick frying pan and add ground cumin and chili.  Cook, stirring over medium heat, for about a minute, until the spices begin to sizzle and cook. Add beans and cook at a brisk simmer, stirring and mashing with the back of your spoon, a potato masher or a wooden pestle, until they thicken and begin to get crusty on the bottom. Stir up the crust each time it forms, and mix it into the beans.  Cook until beans are thick but not dry, 10 to 15 minutes.  They will continue to thicken and dry out when you remove them from the heat. Add liquid you saved from the beans if they seem too dry, but save some of the liquid for moistening the beans if you are serving them later. Taste and adjust salt (they probably won’t need any as the broth reduces when you refry them). \n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut tortillas in half. To toast in the microwave, place as many as will fit in a single layer in the microwave and microwave for 1 minute. The tortillas will be moist on the bottom. Flip them over and microwave for another minute. Flip again and zap for 30 seconds to a minute if they are still moist. Continue to zap in 30-second intervals until crisp. Alternatively, deep-fry tortillas in sunflower oil or grapeseed oil until crisp and drain on paper towels.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread a layer of refried beans (about 2 tablespoons) over each tortilla half. Top with cabbage. Spoon salsa over the cabbage and top with sliced or diced avocado, a sprinkling of chopped toasted almonds and a sprinkling of queso fresco.\n"}], "link": "https://cooking.nytimes.com/recipes/1016034-tostadas-with-beans-cabbage-and-avocado"}