{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Brown Rice With Red Chard and Carrots", "description": "A lush bunch of red Swiss chard that I got at the farmers’ market was the inspiration for this stir-fry. The stems, which stay nice and crunchy, are an important ingredient in the stir-fry, so look for chard with nice wide ribs.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/02/04/science/03recipehealth/03recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "dairy-free, halal, healthy, high fiber, kosher, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 153}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 331, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "7 grams", "proteinContent": "12 grams", "saturatedFatContent": "1 gram", "sodiumContent": "941 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 generous bunch of red chard (1 to 1 1/4 pounds), stemmed and washed well in 2 changes of water (retain the stems)", "2 to 3 teaspoons minced garlic (to taste)", "2 to 3 teaspoons minced fresh ginger (to taste)", "2 eggs", "Salt to taste", "2 teaspoons plus 2 tablespoons peanut, canola, rice bran or grape seed oil", "1 medium carrot, cut in 2-inch julienne", "1 bunch scallions, sliced, dark green parts separated", "4 cups cooked brown rice, either chilled or at room temperature", "1 to 2 tablespoons soy sauce (to taste)", "1/4 teaspoon ground pepper", "1/2 cup chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dice the thick part of the red chard stems (discard the stringier, tapering part of the stems); you should have 1 to 1 1/2 cups diced stems. Stack leaves and cut in slivers, or coarsely chop.  You should have about 8 cups (the leaves will lose a lot of volume when they wilt in the stir-fry)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine garlic and ginger in a small bowl or ramekin and place near your wok. Beat eggs in a bowl and season with a pinch of salt. Prepare the other ingredients and place in separate bowls within arm’s reach of your wok."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or a 12-inch skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in 2 teaspoons of oil by adding it to the sides of the wok and swirling the wok. Make sure that the bottom of the wok or pan is coated with oil and add eggs, swirling the wok or pan so that the eggs form a thin pancake. Cook 30 – 60 seconds, until set. Using a spatula, turn pancake over and cook for 5 to 10 more seconds, until thoroughly set, then transfer to a plate or cutting board and quickly cut into strips, using the edge of your spatula or a knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl in remaining oil and add garlic and ginger. Stir-fry no more than 10 seconds and add chard stems and carrots. Stir-fry for 2 minutes, until crisp-tender, and add light part of the scallions and chard leaves. Stir-fry until leaves wilt, 1 to 2 minutes, and add rice. Stir-fry, scooping up the rice with your spatula then pressing it into the hot wok or pan and scooping it up again, for about 2 minutes. Add soy sauce, dark green part of the scallions, eggs and cilantro, stir-fry for about 30 seconds, remove from heat and serve."}], "link": "https://cooking.nytimes.com/recipes/1016013-stir-fried-brown-rice-with-red-chard-and-carrots"}