{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheese Wafers or Straws", "description": "What do you serve when you serve drinks? The general consensus is something crisp, salty and delicious. (In France, Champagne with potato chips is considered the perfect pairing.) Cheese wafers and cheese straws are always crowd pleasers. They’re easy to prepare—basically, it’s flaky pastry dough with grated cheese mixed in—and variations are endless. Use Cheddar, Parmesan or whatever cheese suits your fancy. Add rosemary, black pepper, smoky paprika or cumin seeds. Make several kinds in different shapes. With a little extra effort, you can even make savory palmier-style hearts.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/05/21/dining/21KITCH1_SPAN/21KITCH6-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 7 dozen, depending on shape", "recipeCuisine": "", "recipeCategory": "", "keywords": "butter, cheddar, cheese, parmesan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 123}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 41, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "2 grams", "sodiumContent": "21 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups/280 grams all-purpose flour, plus more for dusting", "1/2 teaspoon/3 grams kosher salt", "1/2 pound/227 grams cold unsalted butter (2 sticks), cut in 1/4-inch pieces", "4 ounces/110 grams coarsely grated cheese (Cheddar, Gouda, Gruyère or Parmesan), plus more for sprinkling", "1/4 cup/60 milliliters cold milk", "2 egg yolks mixed with 2 tablespoons/30 milliliters cream for egg wash, or 1 whole egg beaten", "Flaky salt, for sprinkling", "Cumin seeds, black pepper, rosemary or smoked paprika, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put flour and salt in mixing bowl. With fingers, work half the butter into the flour until it resembles damp, crumbly sand. Add the remaining cold butter chunks and the cheese and stir with a fork to distribute. Stir in milk and quickly gather dough into a ball with floured hands. (There should be visible butter chunks in the dough.) Squash dough into a rough rectangle about 1 inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust dough with flour and roll to a long rectangle about 8 by 14 inches and about 1/2-inch thick, with the longer side facing you. Fold dough into thirds: first fold in right side, then left side on top of it, making a nearly square package three layers high. Dust again with flour and roll out to make same size rectangle, then fold it again. Dust and repeat once more. Wrap well in plastic film and refrigerate for at least 1 hour, or up to 1 day in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Cut dough in half. Refrigerate half the dough and roll the other piece out to a thickness of about 1/8 inch. (Do not roll too thin or pastry will not puff.) To make wafers, cut dough into 2-inch rounds with a sharp cookie cutter (or cut into diamonds with a knife). To make straws, cut dough in strips 1/2-inch by 5 inches. Twist strips 2 or 3 times and press down ends to prevent unfurling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place wafers or straws on a parchment-lined baking sheet. Paint lightly with egg wash and sprinkle with flaky salt. Add sprinklings of cumin seed, black pepper, rosemary or smoked paprika if desired, and a little more grated cheese. Bake for 8 to 9 minutes, until well browned and crisp. Let cool before serving. Repeat process with remaining half of dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Note: To make heart-shaped palmiers, cut dough in half as above. Working with one dough half (and refrigerating the other), roll dough to a rectangle about 12 by 8 inches and 1/8-inch thick, with the longer side facing you. Paint entire sheet of dough with egg wash and sprinkle with cheese. Tightly roll each of the long edges toward the center so you have a long, somewhat narrow log consisting of 2 connected side-by-side cylinders. Cut crosswise into 1/4-inch thick slices. Pinch the round side of each slice to form a heart shape. Flatten each heart-shaped slice with rolling pin and place on parchment-lined baking sheet. Dab each heart with egg wash and sprinkle with flaky salt. Bake for 9 to 10 minutes, until well browned."}]}