{"@context": "http://schema.org", "@type": "Recipe", "name": "Hasselback Potatoes With Garlic-Paprika Oil", "description": "There may never be a better book title than “Aristocrat in Burlap,” a dramatic biography of the Idaho potato, from the first seedlings cultivated by Presbyterian missionaries in the 1840s (with considerable help from Native Americans) to the brown-skinned Burbanks that built today’s $2.7 billion industry. The large size of Idaho potatoes — often 3 to 4 pounds each in the 19th century, nourished by volcanic soil and Snake River water — is the source of the mystique. \nThe Hasselback potato, named for the hotel in Stockholm where the recipe was invented in the 1950s, shows off the sheer mass of the Idaho potato like nothing else. In the original, the potato is wrapped in bacon, but you can get good smoky flavor and a gorgeous ruddy color by using smoked paprika.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19IDAHO/19IDAHO-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 to 16 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "garlic, russet potatoes, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 255}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 289, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "735 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["8 large Idaho or other large russet potatoes, about 1 pound each", "2/3 cup extra-virgin olive oil or a neutral oil like grapeseed", "4 plump garlic cloves, smashed, peeled and left whole", "1 tablespoon sweet paprika", "1 teaspoon smoked paprika (optional)", "Kosher or coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place whole unpeeled potatoes in a pot. Cover with cold water by at least 2 inches. Bring to a boil over high heat. As soon as water boils, set a timer and cook potatoes for 10 minutes. Drain, cover with cold water, and let cool to room temperature. (This can be done up to 1 day ahead. Do not refrigerate.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Combine oil, garlic and paprika in a bowl or measuring cup. Have a pastry brush ready."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a potato on a large spoon. Use a sharp knife to make 1/8-inch-thick slices in the potato, crosswise, without cutting through the bottom, so potato remains intact. The sides of the spoon will prevent the blade from going too far down. (Or, rest potato on counter and line up a chopstick on each side to block the knife.) Don’t worry if the potato skin starts to shred; it will look fine after baking. Repeat with remaining potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place potatoes on a piece of foil and brush generously with the paprika oil, using fingers to separate slices and let oil drip down. Sprinkle with salt, making sure that it gets between the slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place on a baking sheet and bake 20 minutes. Remove from oven and brush again with oil. Use oven mitts to gently squeeze potato and open up the slices. Sprinkle again with salt. Bake 10 to 20 minutes more, until potatoes are cooked through. Serve whole or half potatoes."}], "link": "https://cooking.nytimes.com/recipes/1016974-hasselback-potatoes-with-garlic-paprika-oil"}