{"@context": "http://schema.org", "@type": "Recipe", "name": "Brisket Summer Rolls With Sriracha-Barbecue Mayonnaise", "description": "With Vietnamese-American communities thriving in Texas cities, delicious mashups were inevitable, like this summer roll stuffed with glass noodles, fresh herbs and smoky barbecued beef instead of the traditional pristine shrimp. Dennis Ngo, a self-trained chef, devised it as a way to serve all the pieces of the whole briskets he smokes for Lonestar Empire, his roving barbecue business in New York City. The slick of spicy, barbecue sauce-flavored mayo is pure pleasure.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/08/20/dining/20JPBRISKET6/20JPBRISKET6-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "8 to 10 rolls", "recipeCuisine": "", "recipeCategory": "dinner, lunch, pastas", "keywords": "brisket, sriracha, vermicelli, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "recipeIngredient": ["1/2 cup mayonnaise", "1/4 cup barbecue sauce", "Lime juice, to taste", "Sriracha, to taste", "1 block (about 7 ounces) rice vermicelli", "1/4 teaspoon salt", "8 to 12 rice-paper wrappers for summer rolls, about 8 1/2 inches wide", "8 sprigs mint, leaves picked off", "8 sprigs Thai basil or basil, leaves picked off", "Pickled carrots and daikon (do chua), homemade or fresh or jarred from Vietnamese markets", "3/4 to 1 pound barbecued beef brisket, thickly sliced", "1/2 cup thinly sliced red cabbage", "16 sprigs cilantro", "Whole lettuce leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the barbecue mayonnaise:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine mayonnaise and barbecue sauce, and stir until smooth. Season to taste with lime juice and sriracha, and set aside. (Can be made 1 day ahead and refrigerated.)"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the rolls:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the rice vermicelli in a large bowl. Cover with boiling water, add the salt and let soak, swishing occasionally, until soft but still resilient, 3 to 5 minutes. Drain in a colander and rinse under cold water until the water runs clear. Let drain for at least 30 minutes, or spread on a plate and refrigerate for up to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, set out all the ingredients on a clean surface. Half-fill a bowl wide enough to fit the wrappers with lukewarm water. Place 1 wrapper in the water and pat it, gently bending to test, until pliable but not completely soft. Shake off excess water and lay the wrapper down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a straight line of mint and basil leaves across the circle, about 2 inches up from the bottom edge. Plump up that line with a small clump of vermicelli, a pinch of do chua and 1/8 of the brisket. Drizzle a scant teaspoon of barbecue mayonnaise over the meat. Finish with red cabbage and 2 cilantro sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring bottom edge of wrapper tightly up over the filling, then fold the sides in to cover. Continue to roll upward, tightly but gently, and place finished rolls on a plate, seam-side down. Repeat with remaining rolls. Cover rolls with lettuce leaves to keep them fresh. Serve as soon as possible."}]}], "link": "https://cooking.nytimes.com/recipes/1016757-brisket-summer-rolls-with-sriracha-barbecue-mayonnaise"}