{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Beet Greens with Garlic and Olive Oil", "description": "Beets are available and good year round, but their season is June through October, when they are at their most tender. Look for unblemished bulbs with sturdy, unwilted greens. Whatever type of beets you buy, always buy them with the greens attached. Then you get two vegetables for the price of one, and greens add a whole set of nutrients to the picture, most notably beta-carotene, vitamin C, iron, and calcium. You can often get beet greens for free at the farmers’ market because some people ask the vendors to chop off the tops when they buy their beets. This simple recipe (which can be used for any type of green) is great on its own as a side dish, or you can toss the greens with pasta, add them to an omelet or risotto, or use them in a gratin or a quiche.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/08/07/health/nutrition/08recipe.health.greens/08recipe.health.greens-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 2 to 4", "recipeCuisine": "mediterranean", "recipeCategory": "", "keywords": "low-fat, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 175}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 73, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "280 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 pound beet greens (2 large or 3 small bunches)", "Salt", "1 to 2 tablespoons extra virgin olive oil, to taste", "2 garlic cloves, minced", "1/4 teaspoon dried red pepper flakes (optional)", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil while you stem the greens and wash the leaves in 2 rinses of water. When the water comes to a boil, add 1 tablespoon of salt and the greens. Blanch for 2 minutes, until tender. Transfer immediately to a bowl of ice water, then drain and squeeze the water out from its leaves. Chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, heavy nonstick skillet. Add the garlic and hot red pepper flakes (if using) and cook, stirring, until the garlic is fragrant and translucent, 30 to 60 seconds. Stir in the greens. Stir for a couple of minutes, until the greens are nicely seasoned with garlic and oil. Season with salt and pepper, remove from the heat, and serve."}], "link": "https://cooking.nytimes.com/recipes/1016422-sauteed-beet-greens-with-garlic-and-olive-oil"}