{"@context": "http://schema.org", "@type": "Recipe", "name": "Jicama Salad With Lime Vinaigrette and Mint Cream", "description": "The chef Eric Werner, who moved from Brooklyn to the Yucatán Peninsula, in Mexico, in 2009, and opened Hartwood in Tulum, puts in long hours on the road every week chasing down local produce at remote markets and farms. He might not know what he'll do with it once back in the kitchen, he has the knack for turning a jumble of tropical fruits and vegetables into an American-style composed salad or a rustic but elegant side dish. Jicama is native to Central America, and readily available in the United States, but most home cooks haven't embraced it yet. This salad should change that. It's sliced into refreshing, crunchy slices, then lavished with flavors like mint and lime that are cool, tart and sweet. If you're not putting the salad together immediately, keep the sliced jicama in the refrigerator, covered with cold water and a squeeze of lemon juice. It will last for at least a day. Pat dry before using.  ", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/03/12/dining/20140312-TULUM-slide-T8C3/20140312-TULUM-slide-T8C3-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "jicama, mint", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 32}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 507, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "16 grams", "proteinContent": "9 grams", "saturatedFatContent": "7 grams", "sodiumContent": "416 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 medium-size jicama (about the size of a baking potato)", "2 large navel oranges", "1/2 cup pepitas (pumpkin seeds), lightly toasted in a skillet or oven", "1/2 cup sunflower seeds, lightly toasted in a skillet or oven", "1 cup fresh mint leaves", "1 tablespoon lime juice", "3 tablespoons extra-virgin olive oil", "1/2 teaspoon salt, more to taste", "2 teaspoons honey", "Diced watermelon, or pomegranate seeds and pomegranate molasses to garnish, optional", "3 tablespoons pepitas, lightly toasted", "1 cup mint leaves", "1/2 cup olive oil", "1 tablespoon honey", "1/2 teaspoon lime juice", "1/3 cup sour cream", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a knife or peeler, peel jicama. Cut off rounded edges to shape jicama into a solid square or rectangle. Slice 1/4 inch thick, then cut slices into 2-inch squares. Set aside in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel oranges with a knife and cut into segments, removing as much white pith as possible. Add to jicama (reserving a few segments for garnish) and refrigerate. This can be done up to 4 hours ahead."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the mint cream: In a blender, combine pepitas, mint, oil, honey and lime juice. Blend at high speed until smooth. While blending, slowly add 1/2 cup cold water and blend until emulsified. Blend in sour cream and salt. Strain to remove any solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, add pepitas, sunflower seeds and mint leaves to bowl (reserving a few leaves for garnish) with jicama and oranges. Whisk together lime juice, oil, salt and honey, then pour over salad and toss gently. Taste for salt and other seasonings, adding more as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon 2 or 3 tablespoons of mint cream on each plate or bowl and swirl to cover bottom. Gently spoon salad mixture on top. Garnish with reserved orange segments and mint leaves, plus watermelon or pomegranate seeds and molasses, if using. Serve immediately. "}], "link": "https://cooking.nytimes.com/recipes/1016118-jicama-salad-with-lime-vinaigrette-and-mint-cream"}