{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Lasagna With Bolognese Sauce and Bechamel", "description": "No doubt about it, this lasagna is a project, but if you’ve never made fresh pasta, here’s an excellent place to start. Using fresh pasta in lasagna transforms it into another dish altogether: instead of falling off the fork into a slippery mass of naked noodles and separate sauce, it holds together beautifully. The sauce cooks into and holds fast to the toothsome pasta, making it stick together like layer cake. The kale flavor in the pasta is faint (you can leave it out) but adds another breath of green to the aromatic fresh basil and crisp fried sage.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/07/16/dining/16SUPERMODEL_LASAGNE/16SUPERMODEL_LASAGNE-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "bechamel, lasagna, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 220}, "recipeIngredient": ["3 pounds ground beef", "1 cup finely diced celery", "1 cup finely diced carrots", "1 cup finely diced onions", "1 cup white wine", "1 quart whole or 2 percent milk", "1 quart (4 cups) low-salt beef stock, or a combination of beef and chicken", "8 ounces (3/4 cup) tomato paste", "Salt and black pepper", "2 dried bay leaves", "6 fresh sage leaves", "2 ounces (1/2 stick) butter", "1 ounce (1/4 cup) cake or all-purpose flour", "3 cups whole milk", "1/8 teaspoon freshly ground nutmeg", "Salt and black or white pepper", "6 ounces kale leaves (optional)", "1 pound pasta flour or all-purpose flour, plus extra for rolling", "4 eggs", "1 tablespoon salt", "1 tablespoon extra-virgin olive oil", "Olive oil, for frying", "1 cup fresh sage leaves, loosely packed", "12 to 16 ounces finely grated Parmigiano-Reggiano cheese", "1 pound fresh mozzarella cheese, thinly sliced", "2 cups fresh basil leaves, loosely packed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the meat sauce:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large heavy pot over high heat. When the pan is hot, add meat and cook, stirring to break up chunks, until any liquid has evaporated and the meat starts to fry in its own fat. Use a sturdy spoon and scrape the bottom often, to prevent burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When meat is golden and crusty, 10 to 15 minutes, add carrots, onions and celery. Keep stirring and scraping over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When vegetables have softened and meat is dark brown, reduce heat to low and pour in white wine. Scrape all the drippings up from the bottom of the pot. Add milk, stock and tomato paste, bring to a simmer, and mix the sauce until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to low and simmer for 1 hour. Add salt and pepper to taste. Add bay leaves and sage and cook until meat is very soft and sauce is thick, about 30 minutes more. Set aside, or cool and refrigerate up to 3 days. Bring to room temperature or warm before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the béchamel sauce: In a heavy saucepan, melt butter until bubbly. Sprinkle flour on the butter and cook, stirring, until it smells buttery and turns golden."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisking vigorously over medium heat, slowly pour in milk and whisk until mixture starts to thicken, about 2 minutes. Add nutmeg and salt and pepper to taste. Keep whisking and cooking for another 5 to 10 minutes: the sauce should be thick and smooth, with no floury taste. Set aside, or cool to room temperature and refrigerate for up to 1 day. Bring to room temperature or warm before using; whisk in more milk if necessary to make a texture like thin mayonnaise. Transfer to a pastry bag or thick sealable plastic bag."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the pasta:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using kale, bring a large pot of salted water to a boil. Drop in the kale and cook, stirring occasionally, until tender, 5 to 15 minutes, depending on the type, age and thickness of the kale. Using a slotted spoon, lift out kale and drain well, reserving cooking water. In a food processor, purée kale, trickling in cooking water if needed to make a smooth purée. Scrape pure into a strainer and let drain. Transfer to a clean kitchen towel and squeeze dry. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixer fitted with a dough hook, combine all ingredients and mix just until a dough forms. Immediately wrap in plastic wrap and refrigerate at least 1 hour or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to make the lasagna, unwrap the dough and place on a floured surface. It should be pliable, but not wet or sticky; if necessary, divide in two and knead in more flour. If dry, knead in water a little at a time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the dough into about 16 pieces, sprinkle each one with flour, and lay out two large baking sheets lined with parchment paper and sprinkled with flour. Using a pasta machine, roll out each piece of the dough according to the manufacturer’s instructions into sheets about 3 to 4 inches wide, until it is as thin as possible without bubbling or tearing. Place finished sheets in a single layer on the prepared pans. Keep covered with damp paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring kale cooking water back to a boil (or, if not using kale, bring a large pot of water to a boil). Cook pasta one or two sheets at a time, just until it floats to the top of the pot. Return to paper-lined pans to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the lasagna: Bring a small saucepan with about 2 inches of olive oil to a simmer and line a plate with paper towels. Working in 4 or 5 batches, add the sage leaves and fry just until crisp and golden, about 30 seconds. Use a slotted spoon to transfer sage to paper towel-lined plate. Sprinkle with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Butter a roasting pan, about 14 x 17 inches x 3 inches. There should be room to stack three or four layers of ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the bottom of the pan with sheets of pasta. Cover the pasta with a thin layer of meat sauce. Snip off a corner or open a small-size tip of the bag with the bechamel and drizzle the sauce in an abstract pattern over the meat sauce (think Jackson Pollock). Scatter a layer of both cheeses on top. Scatter basil leaves and fried sage leaves on top. Repeat with remaining ingredients, ending with cheese and herbs on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover tightly with plastic wrap, then with aluminum foil. Bake until lasagna is piping hot inside and bubbling up, 20 to 40 minutes depending on starting temperature of ingredients. (The internal temperature should be at least 140 degrees.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove plastic wrap and foil, raise temperature to 450 degrees (or turn on the broiler or convection function) and bake another few minutes, until top is golden brown, crusty with cheese and bubbling around the edges. Remove from the oven and let cool at least 30 minutes on a rack before cutting and serving. \nNote: If you can’t make your own pasta, you can find fresh white or green pasta dough at many supermarkets and pasta shops, or online. You’ll need 2 to 2 1/2 pounds fresh pasta. For online ordering, there is usually a minimum of 3 to 5 pounds, but the pasta freezes well. If using dried lasagna, try to buy rough-textured noodles from Italy, and boil just until al dente. They will cook further in the lasagna."}]}], "link": "https://cooking.nytimes.com/recipes/1016660-green-lasagna-with-bolognese-sauce-and-bechamel"}