{"@context": "http://schema.org", "@type": "Recipe", "name": "Beet Red Velvet Cake", "description": "Pamela Moxley, the pastry chef at Miller Union in Atlanta, developed this cake as part of a book project for Steven Satterfield, the co-owner and chef. She uses dutched, nonacidic cocoa powder so she punched up the acid with extra lemon juice, which helps with the bright red color. She adds goat cheese to her cream cheese frosting, to play against the subtle beet flavor. The chef liked it so much that he added it to the restaurant menu.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2014/05/14/dining/14REDVELVET1/14REDVELVET1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "10 servings", "recipeCuisine": "american", "recipeCategory": "", "keywords": "beet, cake, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 249}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 376, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "9 grams", "sodiumContent": "326 milligrams", "sugarContent": "38 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 medium beets", "3/4 cup/ 170 grams butter, plus more for greasing pan", "3/4 cup/180 milliliters buttermilk", "Juice of 1 large lemon", "2 teaspoons/10 milliliters white vinegar", "1 1/2 teaspoons/7 milliliters vanilla extract", "2 cups/200 grams cake flour (sift before measuring)", "3 tablespoons/24 grams Dutch process cocoa powder", "1 1/8 teaspoon/6 grams baking powder", "1 teaspoon/6 grams salt", "1/2 teaspoon/3 grams baking soda", "1 3/4 cup/350 grams granulated sugar", "3 eggs", "Cream cheese frosting (<a href=\"http://www.nytimes.com/recipes/1016331/cream-cheese-frosting.html\">see recipe</a>), or other fluffy white icing "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Wash beets and wrap in aluminum foil. Bake until the tip of a knife slides easily into the largest beet, about 1 hour 15 minutes. Cool until beets can be handled, then peel. (This may be done up to a day ahead.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter two 9-inch cake pans. Line the bottoms of the pans with parchment and then butter again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, chop beets to pieces about the size of finely diced onions. Measure 1 cup and set aside (remaining beets can be reserved for another purpose). Return cup of beets to the food processor. Purée with buttermilk, lemon juice, vinegar and vanilla until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together flour, cocoa, baking powder, salt and baking soda. Set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer, beat butter until soft. Slowly add sugar and beat until creamy. Beat in eggs one at a time, scraping down the sides of the bowl after each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Alternate adding flour mixture and beet mixture to butter mixture, beginning and ending with the dry ingredients, and beating for 10 seconds after each addition. Scrape down the bowl after each addition of the wet ingredients. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide batter between prepared cake pans, smoothing the tops. Bake until a cake tester inserted in the cake comes out clean, about 20 minutes. Remove pans from oven and cool completely on a wire rack. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, remove one cake from its pan and peel away parchment. Place flat side down on a serving platter. Drop about 1 cup of icing onto cake and, using a flat spatula, spread evenly over top. Remove the second cake from its pan and remove parchment. Place flat side down on top of first layer. Use remaining frosting to cover top and sides of cake."}], "link": "https://cooking.nytimes.com/recipes/1016333-beet-red-velvet-cake"}