{"@context": "http://schema.org", "@type": "Recipe", "name": "D.J. Donpasta’s Eggplant Parmesan", "description": "This dish comes from Daniele De Michele, the Italian slow-food activist and disc jockey who calls himself D.J. Donpasta. Mr. De Michele has traveled around Italy, interviewing cooks, artisans and fishermen, and collecting recipes in an effort to preserve the country’s age-old food traditions. Though this dish takes substantial prep time, it all pays off in a tender, complex entree.", "author": {"@type": "Person", "name": "Rachel Donadio"}, "image": null, "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 14}, "recipeIngredient": ["2 large Italian purple eggplants, 2 1/2 pounds total", "Kosher salt", "3/4 pound ground meat, a mix of pork and beef or all beef", "7 large eggs", "2 tablespoons chopped fresh (or dried) parsley", "2 tablespoons freshly grated pecorino Romano", "1/2 teaspoon ground black pepper", "2 tablespoons bread crumbs", "About 4 cups olive oil", "1/2 large yellow onion, thinly sliced", "4 cups high-quality jarred tomato sauce", "1 cup all-purpose flour", "1/4 to 1/2 cup freshly grated Parmigiano-Reggiano", "1 1/2 cups packed basil leaves, torn if large", "3/4 pound fresh mozzarella, cut into 1/4-inch slices", "1/4 pound mortadella, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the eggplants into rounds about 1/4-inch thick. Sprinkle them with a pinch of salt and let sit for an hour in a colander in the sink."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the meatballs: In a medium bowl, mix together the meat, 1 egg, parsley, pecorino, 1 teaspoon salt and 1/2 teaspoon pepper. In a small bowl, add 2 tablespoons water to the bread crumbs. When absorbed, add this to the meatball mixture and combine well. Shape into small (1-inch) meatballs and fry in a skillet with a little oil over medium to medium-high heat until browned all over, about 5 to 7 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, heat 1 tablespoon oil over medium-high heat. Sauté the onions until softened, about 4 minutes. Add the tomato sauce and bring to a simmer. Turn off heat and cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pan, bring 3 eggs to a boil. Turn off heat and let sit for 8 minutes. Run them under cold water until cool, peel and cut into thin slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large deep pot, heat remaining oil. Whisk remaining 3 eggs in a wide, shallow dish and place flour in another wide, shallow dish, for dredging. Pat dry eggplant rounds, briefly dip in egg, then flour, and drop into the hot oil. Fry in batches, until lightly browned. Drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the casserole, spoon about 1 cup of the tomato sauce into a 9-by-13-inch (or 3-quart) baking dish. Layer a third of the eggplant rounds like shingles. Top with a third of the Parmigiano and basil, and half of the mozzarella, sliced egg, meatballs and mortadella. Spoon 1 cup of sauce over that and repeat, layering with another third of the eggplant rounds, then another third of the Parmigiano and basil, and the remainder of the mozzarella, egg and meats. Spoon 1 cup of sauce over that. Finish with a final layer of eggplant rounds; top with remaining sauce, Parmigiano and basil. Bake at 400 degrees for about 30 minutes. Serve lukewarm."}], "link": "https://cooking.nytimes.com/recipes/1016189-dj-donpastas-eggplant-parmesan"}