{"@context": "http://schema.org", "@type": "Recipe", "name": "Dried Fruit Compote With Fresh Apple and Pear", "description": "An alcohol-free compote with a variety of dried fruit and a bright flavor. \n\nThis compote, which I like to add to my morning yogurt, does not involve wine, though you could add some red or white wine for flavor if you wanted to. The sweetness will vary with the type of fruit used. If you use dried sour cherries, don’t use too many, because they will give the compote too stronga sour cherry flavor. Sweet fruit, like dried apples, pears and raisins, will result in a compote with a brighter taste. Apricots are great too, contributing another rich taste layer. I add fresh apple and pear for their texture, which remains somewhat crunchy even after they simmer.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/05/19/dining/Dried-Fruit-Compote/Dried-Fruit-Compote-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, lunch", "keywords": "dairy-free, gluten-free, halal, kosher, low cholesterol, low-fat, low-sodium, nut-free, vegan, vegetarian, dessert, fall, spring, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 39, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "2 grams", "proteinContent": "0 grams", "saturatedFatContent": "0 grams", "sodiumContent": "4 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["2 cups mixed dried fruit, such as raisins (several types), apples, pears, peaches, cranberries, chopped apricots (about 1/2 pound)", "2 1/2 cups water", "3 tablespoons mild honey, such as clover (more to taste)", "1 cinnamon stick", "1 teaspoon vanilla extract", "2 strips orange zest", "1 strip lemon zest", "1 firm but ripe pear, peeled, cored and diced (optional)", "1 apple, preferably a slightly tart variety like Pink Lady, peeled, cored and diced (optional)", "Whipped cream or plain yogurt for serving, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut large pieces of dried fruit into smaller pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all of the ingredients in a saucepan and bring to a boil. Reduce heat, cover and simmer 5 minutes. Turn off heat and allow fruit to steep for 30 minutes or longer. Remove cinnamon stick and orange and lemon zest. Serve topped with whipped cream or yogurt if desired, or stir into your morning yogurt."}], "link": "https://cooking.nytimes.com/recipes/1016376-dried-fruit-compote-with-fresh-apple-and-pear"}