{"@context": "http://schema.org", "@type": "Recipe", "name": "Three Sheets to the Watermelon", "description": "This summer cocktail is essentially a variation on the watermelon margarita that eliminates the blender and the Curaçao and adds some fun and easy prep work. The result is thick, fresh and fruity — a drink that poses no danger of your interrupting your backyard barbecue with deep thoughts.", "author": {"@type": "Person", "name": "Robert Simonson"}, "image": "https://static01.nyt.com/images/2014/07/09/dining/09DOE_DRINK/09DOE_DRINK-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "1 drink", "recipeCuisine": "", "recipeCategory": "for one, cocktails", "keywords": "tequila, watermelon", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 68}, "recipeIngredient": ["1 10-pound watermelon, cut in half lengthwise, from stem", "1 cup plus 1 ounce tequila", "1/2 ounce fresh lime juice", "3/4 ounce simple syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take one of the watermelon halves and, using a fork or knife, score the red interior in one direction and then the other, creating a grid of squares. (Refrigerate the remaining half for other uses.) Slowly pour 1 cup of the tequila into the scored melon half, taking care to spread it around. Let melon macerate overnight, or for a few hours, in refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop out 2 heaping tablespoons of the watermelon and add to a cocktail shaker  3/4 filled with ice. Be sure to get some liquid as well as chunks of fruit. Add the remaining ounce of tequila, the lime juice and the simple syrup. Shake vigorously so the melon chunks break up into slush and the drink chills, about 30 seconds. Pour into a 10-ounce rocks glass. Add more ice if needed.\n\nNote: To make simple syrup, warm 1 cup sugar in 1 cup water in a saucepan over low heat until dissolved. Cool to room temperature before using. (There will be extra syrup; refrigerate if not using immediately.)"}], "link": "https://cooking.nytimes.com/recipes/1016603-three-sheets-to-the-watermelon"}