{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Squash Ribbons with Cherry Tomatoes and Mint/Basil Pesto", "description": "The texture of these squash ribbons can be as satisfying as pasta if the squash is cooked just until flexible, about two to three minutes. The dish is quite beautiful, and once you’ve shaved the squash – which really doesn’t take that long – it comes together in no time. The best tool to use for tossing and stirring the squash and the cherry tomatoes is tongs. Serve  as a light main dish or as a side.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/09/09/science/12recipehealthsquash/12recipehealthsquash-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "Serves 4", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner, vegetables", "keywords": "fall, summer, gluten-free, halal, kosher, low cholesterol, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 37}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 111, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "734 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds mixed yellow and green zucchini or other long summer squash", "1/2 pound cherry tomatoes, halved (about 1 1/2 cups)", "2 tablespoons extra-virgin olive oil", "1 garlic clove, minced", "Salt to taste", "Freshly ground pepper to taste", "1/4 cup pesto (both basil and basil/mint are good), diluted with 2 to 3 tablespoons warm or hot water )", "Freshly grated Parmesan cheese (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a vegetable peeler, cut squash into lengthwise ribbons. Peel off several ribbons from one side, then turn squash and peel off more ribbons. Continue to turn and peel off ribbons until you get to the seeds at the core of the squash. Discard core. You can also do this on a mandolin, adjusted to a very thin slice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook squash strips and tomatoes in 2 batches. Heat 1 tablespoon of the oil in a large skillet over medium-high heat and when it is hot, add squash ribbons, half the garlic, tomatoes, and salt to taste. Cook, using tongs to toss and stir squash and cherry tomatoes, for 2 to 3 minutes,  until squash has softened and is beginning to become translucent and tomatoes are beginning to shrivel. Adjust salt and add freshly ground pepper to taste, and transfer to a serving dish. Repeat with remaining olive oil, squash, cherry tomatoes and garlic. Return first batch to the pan, stir everything together, heat through and transfer again to the serving bowl or individual plates. Pour any juices in the pan over squash. Top each serving with a spoonful of pesto (about a tablespoon), and serve, with additional freshly grated Parmesan if desired."}]}