{"@context": "http://schema.org", "@type": "Recipe", "name": "Lucy Buffett’s Oyster Dressing", "description": "Lucy Buffett and her famous brother, Jimmy, grew up in Mobile, Ala., where seafood from the Gulf of Mexico is a key player in the culinary canon. Mr. Buffett went on to a giant career in music. His sister Lucy opened the freewheeling LuLu’s restaurant in Gulf Shores, Ala. When they were children, oyster stuffing was always on the Thanksgiving table. And it still is. “Usually, it’s all gone by the end of the day because the kids go back for thirds and fourths, just digging directly into the pan,” she said. \n\nMs. Buffett likes to use cornbread with a little sugar in it, often relying on a box mix. But any cornbread recipe will do. The best bread is an inexpensive white loaf from the grocery store that will break down into a smooth texture. The oysters don’t have to be from the Gulf of Mexico, but fat Gulf oysters are best for conjuring the brackish low tides and sunsets of the Buffett family youth.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19ALABAMA/19ALABAMA-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american, southern", "recipeCategory": "stuffing and dressing", "keywords": "cornbread, oyster, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 313}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 295, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "9 grams", "sodiumContent": "381 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["12 tablespoons/1 1/2 sticks unsalted butter, divided, plus more for baking dish", "1 (8-inch-square) baked and cooled cornbread, preferably on the sweet side", "15 slices white or wheat bread, toasted and cooled", "1/2 large white onion, finely chopped", "2 celery ribs, finely chopped", "1/2 large green bell pepper, finely chopped", "1/2 cup chicken broth, plus more as needed", "2 dozen freshly shucked or jarred oysters, preferably Gulf oysters, drained and coarsely chopped (reserve the oyster liquor)", "1/4 cup freshly squeezed lemon juice", "1 tablespoon hot sauce, preferably Crystal", "1/4 cup fresh flat-leaf parsley, finely chopped", "1 tablespoon fresh sage, finely chopped, or 1 teaspoon ground sage", "1 1/2 teaspoons truffle salt or sea salt", "1/2 teaspoon ground white pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Butter a 9-by 13-inch baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crumble cornbread into a large bowl. Tear toasted white or wheat bread into very small pieces, add to cornbread, and toss to combine"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 8 tablespoons butter in a large sauté pan over medium heat. Add onion, celery and bell pepper; sauté, stirring occasionally, for 3 minutes. Cover pan and cook, stirring occasionally, until vegetables are almost translucent, 5 to 6 minutes. Remove cover, add broth, and cook, scraping up any browned bits from the bottom of the pan, for 2 to 3 minutes. Continue to cook mixture for 1 more minute, then remove from heat, add to bread mixture, and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, stir together oysters, lemon juice, hot sauce, parsley, sage, salt and white pepper. Add to bread mixture and stir well to combine. If dressing seems too dry, add a little oyster liquor and up to 1/2 cup more chicken broth; mixture should be very moist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour dressing into greased baking dish. Cut remaining 4 tablespoons butter into small pieces and scatter over top of dressing. Bake until top and sides are browned, 40 to 45 minutes."}], "link": "https://cooking.nytimes.com/recipes/1016944-lucy-buffetts-oyster-dressing"}