{"@context": "http://schema.org", "@type": "Recipe", "name": "Celery and Potato Soup", "description": "This light puree is more celery than potato. The potato thickens the soup, a simple potage that is brought to life by the tiny amount of walnut oil that’s drizzled onto each serving.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/11/12/health/nutrition/12recipehealth.span.ready/12recipehealth.span.ready-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 170}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 159, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "739 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons olive oil", "1 small onion, chopped", "1 large or 2 medium leeks, white and light green part only, cleaned and sliced", "6 celery stalks, sliced (about 3/4 pound)", "Kosher salt", "1 medium-size russet potato, about 10 ounces, peeled and diced", "4 garlic cloves, peeled and halved, green shoots removed", "A bouquet garni made a bay leaf and a couple of sprigs each parsley and thyme, tied together", "7 cups water or chicken stock", "Freshly ground pepper", "2 teaspoons walnut oil", "1/4 cup very thinly sliced celery", "chopped chives or chervil (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium-low heat, add the onion, leek, and celery, and cook gently, stirring often, for about 10 minutes, until very tender. Add 1/2 teaspoon kosher salt after the first 5 minutes. Make sure that the vegetables do not color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the potatoes, garlic, and bouquet garni. Stir together and add the water or stock. Bring to a simmer, add salt to taste, cover and simmer 30 to 40 minutes, until the vegetables are very tender and the broth fragrant. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bouquet garni from the soup. Using an immersion blender, puree the soup (or you can put it through the fine blade of a food mill or use a regular blender, working in batches and placing a kitchen towel over the top to avoid splashing). Then strain through a medium strainer (this step is important; otherwise the soup will be stringy), using a pestle or the bottom of a ladle to push the soup through. Make sure to scrape the outside of the strainer so that all of the puree goes back into the soup. Return to the pot, stir with a whisk to even out the texture, heat through and season well with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the soup into bowls and garnish each bowl with a few thin slices of celery and about 1/4 teaspoon walnut oil. Sprinkle with minced chives or chervil if you wish, and serve."}]}