{"@context": "http://schema.org", "@type": "Recipe", "name": "Chana Dal Sundal", "description": "Sundal is an addictive South Indian snack made with chickpeas, spiced with mustard seeds, chiles and grated coconut, and sold on the beach in paper cones by roaming vendors. A bit like popcorn in nature, though with a softer texture and a lot more zing, it is meant for casual nibbling. (It makes great party food.) It is also prepared for certain Indian religious festivals throughout the year. Here you make it with a small split chickpea called chana dal, but is often made with large chickpeas or other legumes, like peanuts. Look for chana dal and (other dals) at any Indian grocery or online if you can’t find it at the market. ", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/02/28/dining/recipes-chanadalsundal/recipes-chanadalsundal-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "indian", "recipeCategory": "", "keywords": "appetizer, chickpea, chilies", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 239, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "7 grams", "proteinContent": "11 grams", "saturatedFatContent": "4 grams", "sodiumContent": "167 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["2 cups chana dal (split hulled chickpeas), chana (whole white chickpeas) or kala chana (black chickpeas), soaked in cold water overnight and drained", "Salt", "2 tablespoons coconut oil or vegetable oil", "1 teaspoon urad dal (split husked black lentils) ", "2 or 3 red chiles, fresh or dry, slit lengthwise", "1/2 teaspoon black mustard seeds", "12 curry leaves", "Pinch of asafetida (hing), optional", "3 tablespoons grated coconut, fresh or dried ", "Pinch of cayenne", "Cilantro sprigs, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer chana dal in a soup pot in abundant lightly salted water until soft but not mushy, about 15 minutes. (If using whole chickpeas, cook for 45 minutes.) Drain and spread out on a baking sheet to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large wide skillet, heat coconut oil over medium high heat. Add urad dal, chiles, mustard seeds and curry leaves. Let sizzle for a minute until seeds begin to pop, then add asafetida if using. Turn flame to low and add cooked chana dal and gently stir to coat. Add coconut and continue to stir until spices are well distributed. Check seasoning, adding salt and cayenne as desired. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to serving bowl and garnish with cilantro sprigs. Serve warm."}], "link": "https://cooking.nytimes.com/recipes/1016104-chana-dal-sundal"}