{"@context": "http://schema.org", "@type": "Recipe", "name": "New England Roast Turkey", "description": "This adaptation of an old Yankee Magazine recipe for classic New England roast turkey is solid and unfancy, the sort that has adorned tables from Portsmouth north for generations. Old-line New Englanders may be tempted to soak an old cotton button-down dress shirt in butter and drape it over the bird for the first two hours. But this is not necessary.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19NEWHAMPSHIRE/19NEWHAMPSHIRE-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "12 or more servings", "recipeCuisine": "american", "recipeCategory": "dinner, roasts", "keywords": "main course, turkey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 198}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 584, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "2 grams", "proteinContent": "76 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1261 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 12- to 14-pound turkey", "2 1/4 cups kosher salt, more as needed", "1 cup white sugar", "3 bay leaves", "1 tablespoon black peppercorns, cracked, more as needed", "3 sprigs each fresh rosemary, thyme and sage", "1 large yellow onion, peeled and quartered", "2 ribs of celery, roughly chopped", "2 carrots, peeled and roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse turkey under cold water and place on a rack in its roasting pan while you make the brine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the brine, combine salt, sugar, bay leaves, pepper and herbs with 2 1/2 gallons water in a pot or cooler large enough to hold turkey comfortably. Stir until salt and sugar dissolve. Put turkey in brine and refrigerate or ice overnight, at least 12 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, heat oven to 425 degrees. Remove bird from brine, drain well and pat very dry with paper towels. Discard brine. Set turkey, breast side up, on a roasting rack set into a large roasting pan. Season with salt and pepper, then fill the cavity with onion, celery and carrots. Fold wings under the bird and tie its legs together with butcher’s twine. Roast for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to 350 degrees and roast approximately 3 hours more, basting bird every 30 minutes with drippings and tenting it with foil if skin is turning too dark, until an instant-read thermometer inserted into the thickest part of the thigh without touching bone registers 165 degrees. Transfer to a cutting board or platter and allow to rest at least 30 minutes before carving."}]}