{"@context": "http://schema.org", "@type": "Recipe", "name": "Cabbage Minestrone with Chick Peas", "description": "Minestrone can have many ingredients or few. This one has few, and yet its flavors are no less complex than my summer minestrones that have lots of different vegetables in them. Cabbage sweetens a broth as it simmers gently (and no, it won’t smell like boiled cabbage). You can use red cabbage instead of green for this if you wish; that will add to the mix a whole family of flavonoids called anthocyanins, which are powerful antioxidants.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/12/11/health/nutrition/11recipe.health.ready/11recipe.health.ready-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 109, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1289 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 heaped cup chick peas, washed and picked over, soaked for 6 hours or overnight in 1 quart water", "2 tablespoons olive oil", "1 large onion, finely chopped", "1 carrot, peeled and finely chopped", "1 celery stalk, finely chopped", "Salt to taste", "4 garlic cloves, minced", "1 (28-ounce) can tomatoes, seeded and chopped, with juice", "1 1/2 pounds cabbage (green or red), outer leaves removed, cored and coarsely chopped (about 1 medium cabbage)", "2 1/2 quarts water", "A bouquet garni made with 1 Parmesan rind, a bay leaf, and a few sprigs each parsley and thyme", "Freshly ground pepper", "1/2 cup elbow macaroni or small shells", "Freshly grated Parmesan for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the chick peas and set aside. Heat the oil over medium heat in a heavy soup pot and add the onion, carrot, and celery. Add 1/2 teaspoon salt and cook, stirring often, until the mixture is fragrant and the vegetables tender, about 10 minutes. Stir in half the minced garlic and cook, stirring, for another minute or so, until the garlic begins to smell fragrant. Add the tomatoes and their liquid and cook, stirring occasionally, for 5 to 10 minutes, until the tomatoes have cooked down a bit. Add the cabbage, stir together for a minute, then add the drained chick peas, 2 quarts water, and the bouquet garni. Bring to a boil, reduce the heat to low, cover and simmer 1 hour, or until the beans are just about tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining garlic and salt to taste, cover and continue to simmer another 30 minutes to an hour, until the beans are thoroughly cooked and the soup very fragrant. Add a cup more water if it seems too thick. Add pepper, taste and adjust salt. Remove the bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta and cook until the pasta is cooked al dente, 5 to 10 minutes. Serve, passing the Parmesan at the table for sprinkling."}], "link": "https://cooking.nytimes.com/recipes/1016514-cabbage-minestrone-with-chick-peas"}