{"@context": "http://schema.org", "@type": "Recipe", "name": "Suvir Saran’s Mushroom and Farro Burger", "description": "When I was introduced to these burgers, a creation of the chef Suvir Saran, I was struck by the brilliant idea of using sweet potatoes as a binder. I’ve struggled to find ways to hold my burgers together, and this solution was perfect. Try to find light-fleshed sweet potatoes; they are drier, and a little less sweet than orange yams. I also love all the textures in these hearty patties. I have made some changes to Suvir’s recipe, roasting the potatoes rather than boiling them, and I use less oil.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/05/13/science/12recipehealth/12recipehealth-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "10 patties", "recipeCuisine": "american, indian", "recipeCategory": "dinner, lunch, burgers", "keywords": "fall, summer, winter, kosher, low cholesterol, low sugar, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 92}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 300, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "6 grams", "proteinContent": "11 grams", "saturatedFatContent": "3 grams", "sodiumContent": "367 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 pound pale-fleshed sweet potatoes or regular potatoes (such as Yukon gold), baked", "3/4 cup farro (see note)", "Salt to taste", "6 tablespoons extra-virgin olive oil", "1 fresh rosemary sprig", "1 fresh thyme sprig", "1 teaspoon ground black pepper", "3/4 cup finely chopped peanuts", "1 pound cremini mushroom caps, finely chopped", "3 shallots, finely chopped", "1 tablespoon dry white wine", "1/2 cup finely grated Parmesan", "1 cup panko or chickpea flour (you will not use all of it)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake potatoes in a 425-degree oven as directed. When tender, remove from the oven, allow to cool until you can handle them, peel and place in a bowl. Mash with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While potatoes are baking, cook the farro. Combine with 3 cups water in a \nmedium saucepan. Bring to a boil, add salt to taste and cover. Reduce heat and simmer 50 to 60 minutes, until grains are tender and beginning to splay. Drain well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove needles and leaves from rosemary and thyme sprigs and place in a large frying pan with 1 tablespoon of the olive oil. Add pepper and heat over medium-high heat, stirring occasionally, until the herbs begin to crackle. Add chopped peanuts and cook for 2 minutes, or until golden and fragrant, and stir in chopped mushrooms and about 3/4 teaspoon kosher salt (or to taste). Cook, stirring often, until mushrooms have released all of their liquid and there is no more liquid in the pan, about 8 minutes. Stir in wine and continue to cook, stirring, until there is again no liquid left in the pan. Remove from heat and transfer to the bowl with the potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat another tablespoon of olive oil over medium heat in the pan and add shallots. Cook until tender and beginning to brown, 2 to 3 minutes. Remove from heat and scrape shallots into bowl with mushrooms and potatoes. Add farro and Parmesan and mash everything together. Add salt and pepper, taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take up a heaped 1/3 cup of the mixture and form into a ball (you can wet your hands to reduce sticking). Roll ball in panko or chickpea flour, then gently flatten into a patty. Set on a plate and continue with remaining burger mixture. Refrigerate uncovered for 1 hour or longer (the longer the better)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to cook, place a rack over a sheet pan. Heat 2 tablespoons of oil in a 12-inch, heavy nonstick frying pan over high heat. Swirl the pan to coat with the hot oil. Lower heat to medium. Place 4 to 5 patties in the pan (do not crowd), and cook until well browned on one side, about 4 minutes. Turn and brown for about 4 more minutes. Remove to rack. Heat remaining oil in the pan and cook remaining patties. Keep patties warm in a low oven until ready to serve. Serve with a salad and your choice of toppings, such as the usual (ketchup, mustard, relish), or yogurt raita, garlic yogurt, or chutney."}], "link": "https://cooking.nytimes.com/recipes/1016338-suvir-sarans-mushroom-and-farro-burger"}