{"@context": "http://schema.org", "@type": "Recipe", "name": "Frozen Espresso Zabaglione", "description": "Zabaglione (or Zabaione) is a classic Italian dessert custard, but is basically nothing more than egg yolks whipped with sugar, usually served warm or at room temperature. It is typically flavored with sweet Marsala wine, which has a caramel-like flavor, but other wines or liqueurs may be substituted for variation. In this version, espresso coffee and Cognac are used, and the zabaglione is frozen for several hours or overnight. It’s an easy way to make gelato at home, with a light airy texture.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/06/09/dining/zabaglione/zabaglione-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "lunch", "keywords": "cognac, espresso, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 68}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 104, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": null, "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "11 milligrams", "sugarContent": "13 grams", "transFatContent": null}, "recipeIngredient": ["6 egg yolks", "6 tablespoons sugar", "3/4 cup espresso ", "2 tablespoons Cognac", "Cocoa powder and powdered sugar, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put egg yolks in a medium-size mixing bowl. Add sugar and whisk together for a minute, until frothy. Whisk in espresso and Cognac, then place bowl over double boiler. (For a makeshift double boiler, put 3 inches of water in a saucepan approximately the same size as bowl. Put the saucepan on stove, bring the water to a boil, then reduce heat to a rapid simmer.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk rapidly until egg yolk mixture is warmed through. Continue whisking as the mixture begins to thicken. After 2 minutes or so it should have doubled in volume and have the consistency of softly whipped cream. Remove from heat and whisk for a minute more. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour custard into individual demitasse cups or into a serving dish. Cover with plastic wrap and freeze for several hours or overnight. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from freezer 10 minutes before serving. Dust with cocoa powder and powdered sugar if desired."}]}