{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy ‘Ranch’ Dressing", "description": "Lisa Feldman, the director of culinary services at the schools division of the food services company Sodexo, understands that where there is ranch dressing, there are kids who will eat vegetables. Lisa is working to devise menus for schools that meet or exceed the Department of Agriculture’s Healthier US Schools Challenge requirements. With a deep understanding of the ingredients that school lunch programs have to work with, she developed a white bean and yogurt salad dressing base. The mixture will make a dressing that has much more nutritional value, considerably less sodium, and none of the additives in the long ingredient list on a bottle of commercial ranch dressing. \nLisa credits the chef and cookbook author Joyce Goldstein for the idea. This is an adaptation of the ranch that Lisa developed for schools. It can be used as a dip, but also as a salad dressing for crisp salads. Adding the ice cube to the food processor helps to break down the fiber in the bean skins so that the dressing is less grainy.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/06/10/science/09recipehealth/09recipehealth-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "1 cup, about 6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "salads and dressings", "keywords": "appetizer, fall, spring, summer, winter, gluten-free, halal, high fiber, kosher, low cholesterol, low-fat, low-sodium, low sugar, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 65, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "143 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 small garlic clove, halved, green shoot removed", "1/2 cup cooked white beans, drained and rinsed if using canned beans", "1/2 cup whole milk or 2 percent Greek yogurt or regular yogurt", "1 ice cube, if using Greek yogurt", "1 tablespoon fresh lemon juice", "Salt to taste", "1 tablespoon extra-virgin olive oil", "1 teaspoon minced chives", "1 teaspoon each minced tarragon and dill (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Process garlic in a food processor fitted with a steel blade until the minced garlic is adhering to sides. Stop processor and scrape down. Add beans, yogurt and ice cube and process until smooth. With the machine running, add lemon juice, salt, and olive oil and process until smooth. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape into a bowl and stir in chives, tarragon and dill. Serve as a dip or use with crisp salads (it’s a bit too thick for delicate lettuces like spring mixes)."}]}