{"@context": "http://schema.org", "@type": "Recipe", "name": "Celery Root, Red Cabbage and Potato Colcannon", "description": "Celery root, or celeriac, is an under-appreciated vegetable that always pleases. I love it shredded, in a creamy salad called celery remoulade, but I think cooking brings out the best in this vegetable. It develops some sweetness, as does the red cabbage, which also contributes texture to this comforting colcannon. The purée will take on a pinkish hue from the cabbage.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/06/health/06recipehealthcolcannon/06recipehealthcolcannon-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "About 5 cups, serving 6", "recipeCuisine": "irish", "recipeCategory": "dinner", "keywords": "fall, winter, gluten-free, halal, high fiber, kosher, low cholesterol, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 80}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 211, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "4 grams", "sodiumContent": "670 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 pounds potatoes, scrubbed", "1 1/4 pounds celery root (celeriac) (1 large), peeled and cut into chunks", "Salt to taste", "1 tablespoon extra virgin olive oil", "1/2 medium-size red cabbage, quartered, cored and shredded (about 4 cups shredded cabbage)", "1/2 to 1 teaspoon caraway seeds, to taste", "2 1/2 tablespoons unsalted butter", "3/4 cup warm or hot milk", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place potatoes and celeriac in a saucepan and cover by an inch with water. Bring to a boil, add salt to taste, reduce heat to medium-low and cover partially. Boil gently until tender, 25 to 30 minutes. Drain, return to the pot and cover pot tightly. Let steam in the dry pot for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat olive oil over medium heat in a heavy skillet and add cabbage. Cook, stirring often, until it begins to wilt, about 5 minutes. Add caraway and salt to taste, and stir together. Cover and cook over medium-low heat, stirring often, until cabbage is very soft and fragrant, about 10 minutes. If cabbage begins to stick to the pan, add a little bit of water. Remove from heat. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat milk and butter together until butter melts. Mash potatoes and celeriac with a potato masher or in a standing mixer fitted with the paddle, or put through a food mill. Add milk and butter and mix until smooth. Stir in cabbage and caraway and mix until well blended. Season to taste with salt and pepper. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1016940-celery-root-red-cabbage-and-potato-colcannon"}