{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Lamb With a Smoky Slather", "description": "Leg of lamb on the grill is a quintessential summer dish, but you don’t have to forsake it in colder weather. Simply sear and roast the lamb instead, massaging it with smoky Lapsang souchong tea, funky cumin, garlic and thyme. This recipe calls for a half-leg, which should fit in your skillet.  It’s good, though not necessary, to let the seasoned meat marinate for up to three hours before cooking it. The oven timing is for medium-rare meat, including a temperature rise while the meat rests. But since the meat’s thickness is uneven, some parts may be slightly more well-done. That’s just fine, as there will be a piece for every diner’s taste.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/03/19/dining/19PAIR_SPAN/19PAIR-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "lamb, potato, tea, main course, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 557, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "2 grams", "proteinContent": "38 grams", "saturatedFatContent": "14 grams", "sodiumContent": "308 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon lapsang souchong tea leaves", "1 teaspoon ground cumin", "1/2 teaspoon salt, more to taste", "1/2 teaspoon ground black pepper, more to taste", "3 cloves garlic, minced", "1 tablespoon fresh thyme leaves, plus thyme sprigs for garnish", "1/4 cup extra-virgin olive oil", "1/2 leg of lamb, boned and butterflied, excess fat trimmed", "1 pound small white turnips, about 8, trimmed and peeled", "1 pound small red potatoes, about 8, peeled", "1/2 cup dry red wine", "1 tablespoon soft unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine tea, cumin, salt, pepper, garlic, thyme leaves and olive oil, and mix well. Place lamb in a dish and rub half the tea mixture on one side. Turn it over and slather the second side. If possible, set aside at room temperature up to 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Place turnips and potatoes in a saucepan of salted water, bring to a simmer and cook until tender, 15 to 20 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As turnips and potatoes cook, place a large, heavy, ovenproof skillet, preferably cast iron, on the stove over high heat for 2 to 3 minutes. Place lamb in pan and sear until browned on the bottom, 1 1/2 to 2 minutes. Turn lamb and place pan in the oven. Roast for 12 to 15 minutes. An instant-read thermometer inserted in a thick part of the meat should register 120 degrees for medium-rare. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove lamb to a cutting board. Place skillet back on stove. Drain turnips and potatoes, place in skillet and briefly roll them in the pan drippings to pick up some color. Transfer them to a bowl, cover and keep warm; your turned-off oven comes in handy here. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wine to skillet and cook on medium, scraping the pan, until it’s somewhat reduced. Whisk in butter, season with salt and pepper and turn off heat. Slice lamb and arrange on a large platter. Spoon turnips and potatoes around it. Briefly reheat the sauce, spoon it over the meat, drop a few sprigs of thyme on top and serve. "}], "link": "https://cooking.nytimes.com/recipes/1016132-seared-lamb-with-a-smoky-slather"}