{"@context": "http://schema.org", "@type": "Recipe", "name": "Sourdough Stuffing With Kale and Dates", "description": "This stuffing from the chef Suzanne Goin, a Los Angeles native, pays tribute to California, with nods to the sourdough that you associate with fog-strewn San Francisco and to the almonds and dates of the Central Valley. Turkey sausage, kale and sliced chiles are also tossed into the mix. As Ms. Goin explained, “There is no egg and no real attempt to emulsify it like your mom’s stuffing — it’s loose, laid-back and doing its own thing, California-style.”", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19CALIFORNIA/19CALIFORNIA-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "dinner, stuffing and dressing", "keywords": "almond, dates, kale, sourdough, turkey sausage, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 213}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 634, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "7 grams", "proteinContent": "24 grams", "saturatedFatContent": "8 grams", "sodiumContent": "796 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 (1-pound) loaf sourdough bread", "10 tablespoons extra-virgin olive oil", "1 pound turkey sausage, casing removed", "2 cups diced onions", "1/2 sprig rosemary", "2 teaspoons thyme leaves", "2 sliced chile de árbol", "1 teaspoon kosher salt, plus more to taste", "Black pepper, to taste", "1 pound lacinato kale (also known as Tuscan kale or cavolo nero), about 2 large or 3 small bunches, tough rib stems removed and roughly chopped", "3 ounces deglet noor dates (about 16), cut in half lengthwise", "1 cup dry sherry", "2 cups chicken or turkey stock", "4 tablespoons unsalted butter", "3/4 cup roughly chopped toasted almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Cut the crust off the bread and tear remaining loaf into 1-inch croutons. Place torn bread on a rimmed baking sheet and drizzle with 4 tablespoons olive oil, squeezing and tossing bread with your hands to help it absorb the oil. Transfer to oven and toast, tossing once or twice, until croutons are golden brown and crispy on the outside but still a little soft and tender inside, 12 to 15 minutes. When croutons have cooled, place them in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large pot or Dutch oven over medium-high heat. Add 2 tablespoons olive oil and crumble sausage into pan. Sauté, breaking up sausage with a wooden spoon, until browned and just cooked through, 5 to 7 minutes. Transfer sausage to the bowl with the croutons using a slotted spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pot to medium heat and add 2 more tablespoons olive oil, the onions, the rosemary sprig, the thyme and the chile. Season with 1/2 teaspoon salt and a few grinds of black pepper. Continue cooking another 3 to 4 minutes, stirring often, until onion is soft and starting to color slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half the kale and the remaining 2 tablespoons olive oil to the pan. Use tongs to turn the greens to coat them in oil and help them wilt and cook down. When there is room in the pan (from the greens wilting), add the rest of the kale and season with another 1/2 teaspoon salt and a few grinds of pepper. As soon as all the kale has wilted, transfer mixture to the bowl with the croutons and sausage. Remove rosemary. Add dates and stir well to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pot to stove over high heat and carefully pour in sherry. Boil until sherry is reduced by three-quarters, then add stock. Boil until mixture is reduced by half, then swirl in butter until melted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour hot liquid over crouton-kale mixture. Add almonds and toss well to combine; using tongs or your hands, squeeze and massage the stuffing to integrate the flavors and make sure bread has really soaked in all the liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer stuffing to a ceramic baking dish or casserole. Cover and bake 15 minutes in the 400-degree oven. Uncover and bake 10 to 15 more minutes, or until top is golden and crisp."}], "link": "https://cooking.nytimes.com/recipes/1016909-sourdough-stuffing-with-kale-and-dates"}