{"@context": "http://schema.org", "@type": "Recipe", "name": "Yum Yai Salad", "description": "This recipe first came in The Times in a magazine article by Mark Bittman about the Silicon Valley executive-turned-restauranteur Pim Techamuanvivit and her restaurant, Kin Khao, a Thai home-cooking eatery in San Francisco. This \"salad\" is an adaptation of one served there: a combo of raw, steamed and fried vegetables drizzled with a <a href=\"http://cooking.nytimes.com/recipes/1016838-nam-prik-pao-chile-jam\">chile-jam dressing</a> laced with fish sauce and lime.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/09/28/magazine/28eat1/mag-28eat-t_CA0-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings.", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 15}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 400, "unsaturatedFatContent": "27 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "737 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup Nam Prik Pao (chile jam; <a href=\"http://cooking.nytimes.com/recipes/1016838-nam-prik-pao-chile-jam\">see recipe</a>)", "2 tablespoons lime juice", "2 tablespoons fish sauce", "2 teaspoons chopped palm sugar", "A pinch of chopped bird’s-eye chile (if you like it spicy)", "1 medium English cucumber, peeled", "1 large carrot, peeled", "2 cups vegetable oil for frying", "3/4 cup ice-cold water", "3/4 cup all-purpose flour", "1 egg yolk", "1 1/2 loosely packed cups small whole green leaves, like baby kale, shiso leaves, pea shoots or arugula", "3 radishes, very thinly sliced", "6 ounces blanched green beans or wax beans", "2 cups any mixed greens or torn lettuce leaves."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the Nam Prik Pao, lime juice, fish sauce, sugar and chopped chile if you’re using it; set aside. Use a vegetable peeler to slice the cucumber and carrots into long ribbons; set them aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the vegetable oil in a skillet over medium-high heat. While it heats, lightly whisk together the ice water, flour and egg yolk in a medium bowl; the batter should be lumpy and quite thin. When the oil is ready for frying, start dipping the whole leaves (one at a time) into the batter to coat, and carefully add them to the oil, making sure not to crowd the pan; fingers or chopsticks are the best tools for the job. Fry the leaves in batches, turning once, until golden brown and crisp, just a few minutes. With a slotted spoon, transfer the leaves to paper towels to drain; repeat the process until you have fried all of the leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the salad, start layering the ingredients in a large shallow bowl or onto a platter. The beans are best on the bottom because they’re the heaviest, and the tempura leaves should go mostly on top so they remain crisp; otherwise, the order is up to you. Drizzle each layer with some of the dressing as you go; serve immediately."}]}