{"@context": "http://schema.org", "@type": "Recipe", "name": "Southern Pan-Fried Chicken", "description": "In this recipe, Edna Lewis and Scott Peacock call for an overnight brine for the chicken and a further buttermilk bath that should last for 8 to 12 hours. That’s a lot of unattended prep time before you get around to frying them in a slurry of lard and butter flavored with country ham. This is a time commitment, but the result — cooked in a cast-iron pan — is food to impress, and impress deeply, a dish made of humble ingredients that would be welcome on the finest china. Even better? It’s just as good cold as it is hot.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2014/03/13/dining/chicken-still-2/chicken-still-2-articleLarge-v5.jpg", "totalTime": "P1DT1H15M", "recipeYield": "4 to 6 servings.", "recipeCuisine": "american", "recipeCategory": "", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 273}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1071, "unsaturatedFatContent": "48 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "89 grams", "fiberContent": "1 gram", "proteinContent": "40 grams", "saturatedFatContent": "35 grams", "sodiumContent": "1141 milligrams", "sugarContent": "8 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 3-pound chicken, cut into 8 pieces", "1/4 cup kosher salt", "4 cups buttermilk", "1 pound lard", "8 tablespoons unsalted butter", "1/2 cup country ham pieces or 1 thick slice country ham cut into 1/2-inch strips", "1 cup flour", "2 tablespoons cornstarch", "1/2 teaspoon salt", "1/2 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The night before serving: Place chicken in a large bowl and set aside. In a large pitcher, combine kosher salt with 6 cups of water and stir until the salt has dissolved. Pour salted water over chicken pieces until they are submerged. Cover and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the morning, drain chicken pieces and rinse chicken and bowl. Return chicken to bowl and cover with buttermilk. Cover and refrigerate for 8 to 12 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 1¼ hours before serving, combine the lard, butter and ham in a large heavy skillet. Cook over low heat, skimming as needed, until ham is lightly browned, 30 to 45 minutes. Using a slotted spoon, remove ham and brown bits from fat. Increase heat to medium high to heat the fat to 335 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a shallow bowl combine flour, cornstarch, salt and pepper; mix well. Dredge chicken pieces thoroughly in flour mixture, then pat well to remove excess flour. Working in batches (do not crowd pan), place chicken pieces skin side down in fat. Cook 8 to 10 minutes on each side, until chicken is golden brown and cooked through. Drain on crumpled paper towels. Serve hot, warm, at room temperature or cold."}], "link": "https://cooking.nytimes.com/recipes/1016127-southern-pan-fried-chicken"}