{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Tomato Soup", "description": "Roasting intensifies the flavor of tomatoes, especially when your summer harvest is sweet and delicious to begin with. This rich-tasting bread-thickened soup will please vegetarians and vegans, and meat eaters too!", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/07/25/health/nutrition/25recipehealth.ready/25recipehealth.ready-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "mediterranean", "recipeCategory": "", "keywords": "low-fat, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 100}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 166, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "7 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1428 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 pounds ripe tomatoes", "1 tablespoon extra virgin olive oil", "1 small onion, chopped", "2 plump garlic cloves, minced", "1/4 teaspoon sugar", "2 ounces country bread (1 thick slice), lightly toasted", "2 sprigs each basil, parsley, and thyme", "Salt and freshly ground pepper", "2 cups water", "For garnish (optional)", "Fleur de sel", "Garlic croutons (thin slices of country bread or baguette, toasted, rubbed with garlic, drizzled with a little bit of olive oil and broken or cut into small pieces)", "Slivered basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler. Line 1 to 2 baking sheets (as needed) with foil and place the tomatoes on the foil. One baking sheet at a time, place the tomatoes under the broiler at the highest rack setting (about 2 to 3 inches from the heat). Turn when the tomatoes have charred on one side, which could take anywhere from 2 to 6 minutes, depending on your broiler, so watch carefully. Repeat on the other side. Remove from the heat and tip the tomatoes and any juice on the baking sheet into a large bowl. When they are cool enough to handle, peel, core, and chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, heavy soup pot or Dutch oven over medium heat and add the onion. Cook, stirring, until tender, about 5 minutes, and add the garlic. Cook, stirring, for another minute, until the garlic is fragrant, and stir in the tomatoes, sugar, bread, basil, parsley, thyme, and 2 teaspoons salt. Cook, stirring often, until the tomatoes have cooked down and the mixture is thick and beginning to adhere to the bottom of the pot, about 20 minutes. Adjust salt, add pepper, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an immersion blender, or in batches in a blender or food processor (place a towel over the blender lid to prevent hot soup from splashing out), blend the soup until smooth. Put through a medium strainer into a bowl. Rinse out the blender or food processor with the water and add to the puree (or just add to the puree if you used an immersion blender)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the strained soup to the pot and bring to a simmer. Simmer, stirring often for 15 minutes, or until thick and fragrant. Taste and adjust salt. Serve, garnished, if you wish, with a sprinkling of fleur de sel and slivered basil, and a few garlic croutons."}], "link": "https://cooking.nytimes.com/recipes/1016412-roasted-tomato-soup"}