{"@context": "http://schema.org", "@type": "Recipe", "name": "Cabbage and Onion Torta", "description": "The easiest way to get everyone to love cabbage is to encase it in flaky pastry and bake until golden. This torta, filled with browned onions, silky cabbage, and plenty of creamy fontina cheese, might just be the best way you've ever eaten what is arguably a challenging vegetable. It's at its most appealing served warm, with the cheese still a little gooey. But when fully cooled it becomes picnic or lunchbox fare, sturdy enough to slice up and carry with you. The smoked ham is purely optional, but is does add a pleasing porky flavor to the mix. And if you can't find fontina, try Gruyere, Swiss or muenster instead.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/03/12/dining/12APPE1_SPAN/12APPE1_SPAN-mediumThreeByTwo440.jpg", "totalTime": "PT1H45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "breakfast, dinner, lunch", "keywords": "cabbage, cheese, onion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 186}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 672, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "69 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "6 grams", "proteinContent": "19 grams", "saturatedFatContent": "19 grams", "sodiumContent": "689 milligrams", "sugarContent": "6 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["475 grams all-purpose flour (4 cups)", "60 grams whole wheat flour (1/2 cup)", "12 grams kosher salt (about 2 1/2 teaspoons), more as needed", "12 tablespoons unsalted butter, chilled and cubed", "1/4 cup olive oil, more as needed", "1 large Spanish onion, halved and sliced (2 1/2 cups)", "1 1/2 pounds Savoy or regular cabbage (1 small head), cored and sliced", "Black pepper, as needed", "2 teaspoons cider vinegar, or to taste", "1/3 cup dry bread crumbs", "5 large garlic cloves, finely chopped", "1 1/2 tablespoons thyme leaves ", "8 ounces fontina cheese, grated (2 cups)", "2 ounces diced smoked ham such as speck (optional)", "1 large egg yolk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pastry, combine flours and 7 grams (1 1/2 teaspoons) salt in a large bowl. Using a pastry cutter or two forks, cut in butter until it forms coarse crumbs. Add 1 to 1 1/2 cups very cold water, working it in a few tablespoons at a time, until mixture just comes together. Form dough into a ball, cover with plastic, and refrigerate for at least 1 hour or overnight.\n\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons oil in a large skillet over medium-high heat. Add the onion and cook, stirring occasionally, until soft and lightly browned, about 10 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 tablespoon oil and stir in cabbage, a handful at a time, waiting for each addition to wilt slightly before adding more. Season with 5 grams (1 teaspoon) salt and some pepper. Cook until cabbage is tender and any liquid has evaporated, about 7 to 10 minutes. Stir in vinegar and cook until evaporated, scraping up any browned bits from the bottom of the skillet. Transfer mixture to a bowl. Taste and add more salt, vinegar or both, as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 1 tablespoon oil to skillet and stir in bread crumbs, garlic and thyme. Cook until bread crumbs begin to color, about 1 minute. Scrape into a bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Oil a large baking sheet. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a floured surface, roll out dough into a 17-by-12-inch rectangle. Transfer to the baking sheet. With the long side facing you, spread half the bread crumbs evenly over right half of dough, leaving a 1/2-inch border. Top with half the cheese, then cover cheese with half the cabbage mixture. Repeat layers. Sprinkle ham over the top if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dab edges of dough with water. Fold left half over filling and use the tines of a fork to seal edges. Brush crust with egg yolk. Using a knife, cut several slits in the center of the top crust. Transfer pie to oven and bake until crust is golden brown and firm, 40 to 50 minutes. Cool for at least 15 minutes before slicing and serving. Serve warm, or reheat before serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Cabbage Torta", "description": "If there’s one dish that will persuade your family to like cabbage, it’s a golden torta filled with sauteed cabbage, browned onions and creamy cheese.", "thumbnailUrl": "https://static01.nyt.com/images/2014/03/12/dining/12APPE1_SPAN/12APPE1_SPAN-mediumThreeByTwo440.jpg", "uploadDate": "2014-03-07T16:33:12.000Z", "duration": "PT3M20S"}, "link": "https://cooking.nytimes.com/recipes/1016114-cabbage-and-onion-torta"}