{"@context": "http://schema.org", "@type": "Recipe", "name": "Pisto Manchego with Eggs", "description": "Pisto is Spain’s ratatouille, a savory mixture of summer squash, onions, garlic, and tomatoes that is traditionally cooked down until the squash falls apart. The traditional Spanish dish might also include chorizo and peppers. You can serve this as a side dish, without the eggs, but it makes a great supper with them.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/08/21/health/nutrition/21recipe600.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 163, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "2 grams", "sodiumContent": "820 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil", "1 medium onion, chopped", "4 garlic cloves, minced", "2 pounds zucchini, or a combination of green and yellow summer squash, diced", "2 pounds tomatoes, peeled, seeded and chopped, or 1 (28-ounce) can, drained and chopped (see note)", "1/4 teaspoon sugar", "Salt to taste (a generous amount, at least 1 teaspoon)", "Lots of freshly ground black pepper", "6 eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, heavy, nonstick skillet over medium heat and add the onion. Cook, stirring often, until just about tender, about 5 minutes. Add the garlic and cook, stirring, for a minute or two, until fragrant. Stir in the squash and 1/2 teaspoon salt, and toss together for about 5 minutes, until the squash is coated with oil and beginning to soften. Add the tomatoes, sugar, and salt to taste (3/4 to 1 teaspoon), and turn the heat to medium-high. Cook, stirring often, for 5 to 10 minutes, until the tomatoes have cooked down slightly. Add the juice from the tomatoes plus 1/4 cup water, stir together, turn the heat back down to medium-low and cook, uncovered, for 30 to 35 minutes, until the vegetables are soft and easy to mash, stirring often and adding water as necessary, every 10 minutes or so as the mixture cooks down and begins to stick to the pan. From time to time press down on the squash with the back of your spoon so that it breaks down somewhat. Taste, adjust the salt, and add lots of pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the back of your spoon, make 6 wells in the vegetable mixture and break an egg into each well. Sprinkle with salt and pepper. Cover the pan and cook until the eggs have set, about 6 to 8 minutes (the whites should be set but the yolks should still be runny). Serve, using a spatula to dish out portions of pisto topped with an egg."}], "link": "https://cooking.nytimes.com/recipes/1016435-pisto-manchego-with-eggs"}