{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek Swiss Chard Pie", "description": "You may be familiar with Spanakopita, the Greek spinach pie, and this is very similar. I prefer sturdier greens like chard to spinach, because they retain their dark green color and fresh flavor better when cooked for a long time in the phyllo dough.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/10/07/health/nutrition/07recipe.health.ready/07recipe.health.ready-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 99}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 367, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "4 grams", "proteinContent": "12 grams", "saturatedFatContent": "6 grams", "sodiumContent": "758 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 to 2 1/2 pounds Swiss chard, stemmed and washed thoroughly", "Salt", "2 tablespoons extra virgin olive oil", "1 large onion, chopped", "2 large garlic cloves, minced or pressed", "1/4 cup chopped fresh herbs, preferably a combination of dill and parsley, or 1 teaspoon each dried thyme and oregano", "3 large eggs, beaten", "4 ounces feta cheese, crumbled", "Freshly ground pepper", "12 sheets phyllo pastry plus 1/4 cup extra-virgin olive oil or 2 tablespoons each melted butter and extra-virgin olive oil,  combined, for brushing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of generously salted water to a boil while you stem and wash the greens. Wash them in 2 changes of water, lifting them from the water so that the dirt stays behind. Fill a bowl with ice water. When the water comes to a boil, add the chard and blanch for 1 minute. Using a slotted spoon or a skimmer, transfer to the ice water. Let sit just until cool, a few minutes, then drain and squeeze out excess water by taking up bunches of the greens, making a fist around them and squeezing. Chop coarsely and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375ºF. Oil or butter a 10-inch tart or cake pan (I like to use a ceramic dish for this). Heat the olive oil in a large skillet over medium heat and add the onions. Cook, stirring often, until tender but not browned, about 5 minutes. Add the garlic and cook, stirring, for another 30 seconds to a minute, until the garlic is fragrant. Stir in the greens, herbs, and 1/2 teaspoon salt, and stir the mixture for a minute, until the greens are coated with oil. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl or the bowl of a food processor fitted with the steel blade. If you are not using phyllo dough for this, remove 2 tablespoons of the beaten eggs, for brushing the crust, and crumble or blend in the feta.  Toss with the greens, and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the pie dish with two-thirds of the dough, or with 7 pieces of phyllo, lightly brushing each piece with butter or oil and turning the dish after each addition so that the edges of the phyllo drape evenly over the pan. Fill with the greens mixture. If using phyllo, fold the draped edges in over the filling, lightly brushing the folded in sheets of phyllo ,then layer the remaining 5 pieces on top, brushing each piece with butter or olive oil. Stuff the edges into the sides of the pan. For pie dough, roll out the other piece of the dough and place over the filling. Crimp the bottom and top edges together, then pinch an attractive fluted edge all the way around the rim of the pie. Brush the top with the beaten egg you set aside, and make a few slashes in the top crust so that steam can escape as the pie bakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 40 to 50 minutes in the preheated oven, until the crust is golden. Serve hot, warm, or room temperature."}]}