{"@context": "http://schema.org", "@type": "Recipe", "name": "Brooks Headley's Ice Cream Sandwich", "description": "Wait a second. Brooks Headley, the pastry chef from Del Posto, is encouraging you to make an ice-cream sandwich with store-bought white bread and a tub of Ben & Jerry’s Cherry Garcia?\n\nIndeed. And he’ll even make the cheeky argument that this quick treat has Italian roots. “A typical Sicilian breakfast is gelato on a brioche roll,” he said. “Ice cream for breakfast! Who isn’t going to love that?” Truth be told, for a dessert at Del Posto Mr. Headley would most likely use a preserved-cherry and stracciatella gelato, but its flavor and texture are not so far off from what you get with Ben & Jerry’s. So butter the bread, crisp it up in a pan, let it cool, then coat it with ice cream and smush it all together. “I finish it with olive oil because, in the words of the great chef Paul Bertolli, olive oil is the best sauce,” Mr. Headley said. He called the result “admittedly trashy, but wildly satisfying.” How could it not be?", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2014/09/17/dining/17HEADLEYSIDE/HEADLEYSIDE-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, easy, quick, snack, ice creams and sorbets", "keywords": "bread, ice cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 109}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 121, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "3 grams", "sodiumContent": "115 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 slices white bread (preferably Pepperidge Farm)", "1 cup gelato or ice cream (of your preference, but the author suggests Ben & Jerry’s Cherry Garcia), softened but not melting", "1 teaspoon unsalted butter", "Coarse sea salt", "Extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Smear the bread with butter and sear in a cast-iron or nonstick pan until lightly caramelized and golden. Allow to cool a few minutes. Place the bread sear-side out on a work surface. Scoop the gelato onto one slice of bread and top with the other slice. Slice into 4 pieces and top with a drizzle with high quality extra-virgin olive oil and a light sprinkle of salt. Serve immediately, or hold in the freezer for up to one hour."}], "link": "https://cooking.nytimes.com/recipes/1016812-brooks-headleys-ice-cream-sandwich"}