{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Beans", "description": "Proper Boston baked beans would have salt pork instead of the bacon. James Beard cooked them with ribs. The key is to use the little white pea beans known as navy beans, and to allow time to do most of the work. (Or to cheat: Canned white beans make fantastic baked beans in about an hour. If you use them, you'll need four 15-ounce cans. Drain and then follow the directions from step 2 on to the end. Please understand that you’ll need much less water and much less time to get them where you want them to be.)  The combination of molasses and dry mustard is a taste as old as America itself, and takes well to both ham and soft brown bread.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/16/dining/16JPEASTER2/16JPEASTER2-articleLarge.jpg", "totalTime": "PT6H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "barbecue, new england", "recipeCategory": "dinner, lunch", "keywords": "bacon, molasses, navy beans, side dish, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1054}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 343, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "8 grams", "proteinContent": "16 grams", "saturatedFatContent": "4 grams", "sodiumContent": "253 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups navy beans", "Salt", "1/2 pound slab bacon, cut into cubes", "1 medium onion, peeled and chopped", "1/3 cup molasses", "2 teaspoons dry mustard", "1 teaspoon ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak beans in a large bowl of water for 6 hours or overnight. Drain beans and put them in a large oven-safe pot with a heavy bottom and a tightfitting lid. Add 1 teaspoon salt and enough cool water to cover 2 inches above the beans. Bring to a boil, then lower the heat and simmer gently, stirring occasionally, until the beans are just tender, approximately 30 to 40 minutes. Drain and remove beans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 250 degrees. Bring a kettle full of water to a boil on the stove. Return the heavy-bottomed pot to the stove and turn the heat to medium high. Cook the bacon in the bottom of the pot until it begins to brown, then turn off the heat and add the chopped onion and, on top of it, the beans. Mix together molasses, mustard and black pepper, and add the mixture to the pot. Pour in enough boiling water to cover beans, put the lid on and bake, occasionally adding more water to keep beans covered, until they are tender but not falling apart, 4 to 5 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove beans from oven, uncover, stir and season with salt. With the lid off, return pot to oven and let beans finish cooking, uncovered and without additional water, until the sauce has thickened and the top is deeply crusty, about 45 minutes more."}], "link": "https://cooking.nytimes.com/recipes/1016258-baked-beans"}