{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Corn Griddle Cakes With Spicy Salsa", "description": "Sweet tender corn is one of summer’s great joys, and adding fresh kernels turns these cornmeal griddlecakes into something quite special. Stirring a bit of chopped jalapeño and chives into the batter improves them all the more. A zippy salsa of chopped summer peppers and tomatoes makes a fine topping. Serve a colorful plateful of them as is, hot off the griddle, or to accompany grilled pork chops. For the best texture and rise, prep the wet and dry ingredients for the batter in advance, but wait to combine them until just before cooking.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/08/13/dining/13KITCH1/13KITCH1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 2 dozen 3-inch griddle cakes, 6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "bell pepper, cornmeal, jalapeño, salsa, scallion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 112}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 370, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "5 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "620 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups cornmeal", "1/2 cup all-purpose flour", "2 teaspoons baking powder", "1 teaspoon baking soda", "1 teaspoon kosher salt", "2 teaspoons sugar", "1 1/2 cups buttermilk", "2 eggs, lightly beaten", "6 tablespoons melted butter or vegetable oil, plus more for greasing griddle", "3 cups freshly shucked corn kernels, from about 4 ears", "1 small jalapeño chile, finely chopped, or to taste", "3 tablespoons finely sliced chives or scallions", "1 1/2 cups red onion, finely diced", "1 1/2 cups bell peppers, finely diced, preferably a mix of colors", "1 1/2 cups firm-ripe tomatoes, finely diced, preferably a mix of colors", "1 teaspoon kosher salt", "1 small jalapeño chile, finely chopped, or to taste", "Juice of 2 limes, more to taste", "1 cup loosely packed cilantro leaves, for garnish", "1 cup crumbled queso fresco, for garnish (may substitute mild feta)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the batter:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir together cornmeal, all-purpose flour, baking powder, baking soda, salt and sugar in a large mixing bowl. In a separate bowl, whisk together buttermilk, eggs and 6 tablespoons melted butter. Set both bowls aside until ready to cook griddle cakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the batter: Add buttermilk mixture to cornmeal mixture and mix briefly with wooden spoon or whisk to obtain a thick batter. Add corn kernels, jalapeño and chives and stir to combine."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the salsa:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a serving bowl, toss onions, peppers, tomatoes, salt and jalapeño. Add lime juice and toss again. (May prepare 1 to 2 hours ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set griddle or large cast-iron pan over medium heat. When griddle is hot, grease lightly with a dab of butter, using a folded paper towel or pastry brush. Spoon slightly less than 1/4 cup batter onto griddle. Adjust heat as necessary to keep griddle cakes from browning too quickly. Cook for about 1 1/2 minutes, then carefully flip with spatula and cook for another 1 1/2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately as soon as griddle cakes are ready or keep hot in a low oven until all batter is used. To serve, put 3 griddle cakes on a plate. Top with a generous spoonful of salsa. Garnish with a few cilantro leaves and a sprinkling of queso fresco."}]}], "link": "https://cooking.nytimes.com/recipes/1016725-fresh-corn-griddle-cakes-with-spicy-salsa"}