{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Fish With Shiitake Mushroom Ragout", "description": "Here is a main dish that can work with many kinds of skin-on fish fillets. Crisp the skin to a crackle in a pan, then finish cooking in the oven; the method can also work with meaty, skinless fillets like hake and mahi-mahi. As you cook, season little by little, tasting all the while, and feel free to adjust to your own palate. Though Chinese stir-fries are often thickened with a slurry of cornstarch, this recipe uses miso, which adds nuanced depth. A slick of sesame oil enriches the sauce and burnishes the fish. A crisp, off-dry riesling makes a fine pairing.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/09/24/dining/24STRATEGY3/24STRATEGY3-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, lunch, quick, roasts", "keywords": "fish, mushroom, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 70}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 422, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "4 grams", "proteinContent": "36 grams", "saturatedFatContent": "4 grams", "sodiumContent": "899 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["24 ounces fish fillets, preferably with skin, such as wild striped bass, sablefish or red snapper", "Salt and ground black pepper", "3 tablespoons toasted sesame oil", "2 tablespoons vegetable oil, such as grapeseed, olive or peanut oil", "2 large cloves garlic, slivered", "1 tablespoon minced fresh ginger", "1 cup sliced onion", "2 stalks celery, slant-cut in 1/2-inch slices", "1/2 pound shiitake mushrooms, stems discarded, caps quartered", "1/2 cup cooked edamame, fresh or frozen", "1/2 teaspoon Chinese 5-spice powder", "2 tablespoons soy sauce", "2 teaspoons rice vinegar", "2/3 cup beer, preferably lager", "1 tablespoon red miso", "2 tablespoons flour", "4 scallions, trimmed and slant-cut, including a couple of inches of the green", "1/4 cup cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut fish in 4 equal portions, season with salt and pepper and brush with 2 tablespoons sesame oil. Set aside. Heat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a wok or large skillet on medium-high heat and add 1 tablespoon vegetable oil. Add garlic, ginger, onion and celery and stir-fry until the vegetables soften. Add mushrooms, lower heat to medium and continue to cook about 5 minutes, until mushrooms soften. Stir in the edamame and 5-spice powder. Add soy sauce, vinegar and beer and bring to a simmer. Stir in miso and let it dissolve. Remove from heat. Add salt and pepper if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a heavy ovenproof skillet, preferably cast iron, over high heat. While pan heats, dust the skin of the fish with flour. Add remaining tablespoon of vegetable oil to the pan. Place fish, skin side down, in pan and sear about 5 minutes, until skin browns."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn fish over, place in oven and roast 8 to 10 minutes, depending on the thickness of the fillets, until just cooked through. An instant-read thermometer should register about 140 degrees. Remove from oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat mushroom ragout. Add scallions, cilantro and remaining tablespoon of sesame oil. Spoon mixture onto a platter or four dinner plates. Top with the fish, skin side up, and serve."}], "link": "https://cooking.nytimes.com/recipes/1016818-seared-fish-with-shiitake-mushroom-ragout"}