{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti With Cauliflower, Almonds, Tomatoes and Chickpeas", "description": "Pasta with cauliflower comes in many variations throughout Italy. This one is all about texture -- crunchy almonds, tender (but not mushy) cauliflower and plush chickpeas. The original version of this recipe called for quinoa spaghetti (and if you're into that, go for it!), but we've found it's just as tasty with the traditional sort as well.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/02/25/science/24recipehealth/24recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner, quick", "keywords": "fall, winter, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 414}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 489, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "84 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "10 grams", "proteinContent": "18 grams", "saturatedFatContent": "2 grams", "sodiumContent": "896 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["24 raw almonds (about 3 tablespoons), blanched, skinned* and chopped", "1 small or 1/2 large head cauliflower, broken into florets", "2 tablespoons extra virgin olive oil", "2 garlic cloves, minced", "1-14 1/2-ounce can chopped tomatoes in juice", "1/4 teaspoon sugar", "Pinch of cinnamon", "Salt to taste", "1/2 to 1 teaspoon dried oregano (to taste)", "Freshly ground pepper to taste", "1/2 cup cooked chickpeas (canned or freshly cooked)", "3/4 pound spaghetti", "Crumbled feta or freshly grated Parmesan for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pasta pot with water and bring to a boil. Add salt to taste and cauliflower. Boil 5 minutes, then using a Chinese skimmer, a strainer or a slotted spoon, transfer cauliflower to a bowl of cold water (do not drain the pot; you’ll use the water for the pasta). Drain the cauliflower and chop medium-fine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "(You can do this step while you are waiting for the water to come to a boil for the cauliflower). Heat 1 tablespoon of the olive oil over medium heat in a large, heavy skillet or a wide saucepan and add garlic. Cook, stirring, until fragrant, about 30 seconds, and stir in tomatoes with liquid, sugar, cinnamon, salt and oregano. Turn up heat to medium-high and stir often as tomatoes come to a brisk boil. Turn heat down to medium and cook, stirring often, until tomatoes have cooked down and taste very fragrant, about 10 minutes. Add pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cauliflower and almonds to the tomato sauce, along with 1/4 cup cooking water from the cauliflower, and stir together. Stir in chickpeas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring water in the pot back to a boil and add spaghetti. Cook al dente, following timing instructions on the package but checking for doneness a minute before indicated time on the package. Set aside 1/2 cup of the cooking water from the pasta, in case you want to moisten the sauce more, drain pasta and toss with the tomato and cauliflower sauce and the remaining tablespoon of olive oil. Add water from pasta only if you think the mixture seems dry. Serve, passing crumbled feta or grated Parmesan at the table for sprinkling."}]}