{"@context": "http://schema.org", "@type": "Recipe", "name": "Mediterranean Cucumber and Yogurt Salad With Red or Black Quinoa", "description": "The idea of embellishing a yogurt soup or salad with quinoa comes from Deborah Madison, who uses black quinoa in a brilliant recipe for a soup in her book “Vegetable Literacy.” I used red quinoa to add texture, color and substance to this typical Mediterranean combination – finely diced cucumber, garlic, and thick plain yogurt. Use mint or dill, or a combination, and make sure to dice the cucumber very small.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/06/24/science/27recipehealth/27recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "appetizer, main course, side dish, gluten-free, halal, kosher, low cholesterol, low-fat, low-sodium, vegetarian, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 39}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 279, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "16 grams", "saturatedFatContent": "4 grams", "sodiumContent": "535 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["2 to 2 1/2 cups finely diced cucumber (use a seedless variety such as a long hothouse cucumber, a Japanese cucumber or Persian cucumbers)", "Salt", "1 1/2 to 2 cups plain Greek yogurt  or drained yogurt (to taste)", "1 to 2 garlic cloves (to taste), cut in half, green shoots removed, and mashed to a paste in a mortar and pestle with a pinch of salt", "1 to 2 tablespoons (to taste) chopped fresh dill or mint", "Freshly ground pepper", "1 cup cooked red or black quinoa"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss cucumber with a generous amount of salt and leave in a colander in the sink to sweat for 15 minutes. Drain on paper towels (rinse first if the cucumber tastes very salty)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon yogurt into a salad bowl and mix with garlic. Stir in cucumber. Add freshly ground pepper (I like a generous amount), taste and adjust salt. Sprinkle dill or mint on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon quinoa over  salad and serve, or divide salad among 4 bowls or plates and top each serving with 1/4 cup quinoa."}], "link": "https://cooking.nytimes.com/recipes/1016602-mediterranean-cucumber-and-yogurt-salad-with-red-or-black-quinoa"}