{"@context": "http://schema.org", "@type": "Recipe", "name": "Fluke in Lemon Brodetto With Scallops and Squash", "description": "“The Babbo Cookbook,” by Mario Batali, was published in 2002. Within two years I had made every recipe in it at least once, and by 2005 or so I was adapting the dishes to the ingredients I found at the market, instead of the other way around. Take the restaurant’s black bass served in a lemony capon stock with Hubbard squash and delicate shell-on bay scallops from Taylor Shellfish Farms, in Washington State. There is no need to make the dish with black bass, Hubbard squash or Taylor bay scallops, much less capon broth. I use use fluke but any firm-fleshed white fish will do. Hubbard squash is a dream, but butternut squash works beautifully in its stead. As does chicken stock instead of the capon. And swapping out the farmed bay scallops for the deeper salinity of wild ones, or for small ocean scallops, is no crime. The most important thing is to locate thin-skinned lemons for the brodetto, since the thick ones impart a bitterness to the sauce that is not magical. If all you have is thick-skinned lemons, take a moment to cut out the white pith beneath the skin, which is the bitter culprit.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/10/26/magazine/26eat2/mag-26eat-t_CA0-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings.", "recipeCuisine": "italian", "recipeCategory": "dinner, soups and stews", "keywords": "fluke, lemon, scallops, squash, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 61}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 544, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "4 grams", "proteinContent": "25 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1151 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 thin-skinned lemons", "1 heaping teaspoon kosher salt", "1/2 teaspoon freshly ground black pepper", "3 tablespoons plus 1 teaspoon sugar", "1 tablespoon plus 1 teaspoon extra-virgin olive oil", "1 heaping teaspoon fresh oregano leaves", "1 heaping teaspoon fresh marjoram leaves", "2 cups chicken stock, preferably homemade, or low-sodium", "1 cup dry white wine", "8 medium-size scallops", "2 tablespoons extra-virgin olive oil", "1 small butternut squash, peeled and cubed, approximately 1/2 pound", "Kosher salt and freshly ground black pepper, to taste", "2 teaspoons fresh marjoram leaves", "1/4 to 1/3 cup extra-virgin olive oil, enough to flood your pan", "1 pound fluke, cut into four equal portions", "Kosher salt and freshly ground black pepper, to taste", "1 tablespoon finely milled flour, like Wondra, or all-purpose flour", "2 scallions, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the <em>brodetto</em>, cut the lemons in half and then into quarters, deseeding them as you go. Put them into the bowl of a food processor with the salt, pepper and sugar, and pulse to combine. You want them broken down but not completely puréed. Drizzle the olive oil into the mixture slowly, pulsing to emulsify the jam. Blend in the oregano and marjoram leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pot set over medium heat, combine the chicken stock and wine. When it begins to simmer, add the lemon-oregano jam, and stir to combine. Lower heat, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the butternut squash, place a large sauté pan over medium-high heat, and swirl in the olive oil. When it begins to shimmer, add the squash, salt and pepper, and toss to combine. Cook, stirring occasionally, until they are browned, crisp and tender, approximately 7 minutes. Remove from the heat, stir in the marjoram leaves and set aside in a warm place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the fluke, heat the olive oil in a large sauté pan set over high heat until it is nearly smoking. Meanwhile, season the fluke with salt and pepper, and dust one side of each fillet with flour. Cook the fillets flour-side down for approximately 4 minutes, until the skin is nicely crisp and brown and about 3/4 of the way cooked. Carefully turn the fillets with a wide spatula, and cook for an additional 2 or 3 minutes, until done. Remove from the oil, and drain quickly on paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, turn the heat under the brodetto to high, and add the scallops to the liquid to heat through, approximately 2 minutes. Divide the scallops among four warmed bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the dishes. To the scallops add 1/4 of the squash and equal amounts of <em>brodetto</em>, and top with a fluke fillet. Sprinkle with the scallions, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1016884-fluke-in-lemon-brodetto-with-scallops-and-squash"}