{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Pasta", "description": "Forget boxed macaroni and cheese — what kids really like are noodles bathed in a creamy sauce. This is a fine alternative to the packaged stuff. Instead, make the sauce by blending cottage cheese with milk in a food processor. It’s not yellow, but it has that creamy, cheesy taste. Make sure to blend the sauce well so that it won’t be chalky. This is a good sauce for penne or fusilli (though other kinds of pasta will work). You can add vegetables, like broccoli, which really catches the sauce.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": null, "totalTime": "PT30M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "brunch, dinner, easy, lunch, quick, weekday, casseroles", "keywords": "healthy, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 79}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 269, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "2 grams", "proteinContent": "11 grams", "saturatedFatContent": "2 grams", "sodiumContent": "216 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup nonfat or low-fat cottage cheese", "1/4 cup low-fat milk (more as desired)", "Salt and freshly ground pepper to taste", "1/4 cup freshly grated Parmesan, plus additional for the table", "1 tablespoon extra virgin olive oil", "3/4 pound pasta (such as penne, fusille, spaghetti, fettucine)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of generously salted water to a boil. Meanwhile, place the cottage cheese in a food processor fitted with a steel blade and blend until smooth. Scrape down the sides of the bowl. Turn on the machine, and add the milk with the machine running. Blend until the mixture is smooth and there is no sign of graininess. Blend in the olive oil and the Parmesan, taste, then add salt and pepper as desired. Scrape the cottage cheese mixture into a large pasta bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pasta water comes to a boil, add the pasta. Cook al dente, following the timing instructions on the package (about eight minutes for penne). Before draining the pasta, add two to three tablespoons of the pasta cooking water to the cottage cheese mixture and stir together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the pasta, toss immediately with the cottage cheese mixture, and serve, passing additional Parmesan at the table."}]}