{"@context": "http://schema.org", "@type": "Recipe", "name": "Pickled Peaches With Sweet Spices", "description": "I love the balance of sweet, sour and spice in this recipe. These are refrigerator pickles, meant to be kept in the refrigerator, where they will keep for up to two months; so you could pull them out for Thanksgiving, though I doubt you will be able to resist them for that long. Although this recipe calls for a lot of sugar, you will not be consuming the syrup so don’t be alarmed by it.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/10/07/science/06recipehealth/06recipehealth-articleLarge.jpg", "recipeYield": "2 to 2 1/2 pints", "recipeCuisine": "american", "recipeCategory": "", "keywords": "dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, low-fat, low-sodium, vegan, vegetarian, fall, summer, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 23}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 228, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "4 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "7 milligrams", "sugarContent": "51 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 medium-size or large ripe-but-firm peaches", "Juice of 1 large lemon", "1 tablespoon plus 16 cloves", "1 1/2 teaspoons allspice, cracked or coarsely ground in a spice mill", "1 cinnamon stick", "1 vanilla bean, cut in half", "1 cup cider vinegar", "1/2 cup water", "1 cup raw brown (turbinado) sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and drop in peaches. After 30 seconds, transfer to a bowl of ice water, then drain and skin. Place in a bowl and toss with lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tie 1 tablespoon cloves, the allspice and the cinnamon stick in a cheesecloth or muslin bag. In a pot large enough to accommodate all the peaches, combine vinegar, water, sugar, spice bag and vanilla bean and bring to a boil. Reduce heat and simmer 5 minutes. Skim off any foam that rises. Add peaches to the pot and continue to simmer 3 to 5 minutes, until a toothpick can easily penetrate down to the pit. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, carefully remove each peach from pot and transfer to a bowl. When cool enough to handle, cut in half and remove pits. Stud each half with a clove and return to pot. Cover and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day return pot to stove and flip over the peach halves. Squeeze spice bag over the pot to extract fragrant brine, and discard bag. Bring peaches back to a boil and turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pack peaches into hot, sterilized jars. Pour in syrup, leaving 1/2 inch of headspace. Cut vanilla bean into halves or thirds and put a piece into each jar. Seal jars, allow to cool and refrigerate for up to 2 months."}], "link": "https://cooking.nytimes.com/recipes/1016824-pickled-peaches-with-sweet-spices"}