{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Stuffed Acorn Squash", "description": "This makes a substantial vegetarian – or vegan if you leave out the cheese – Thanksgiving main dish. It is another riff on the native American tradition of the Three Sisters – corn, beans, and squash. I used acorn squash here, and it serves as a vessel for the sweet and pungent bean, corn and tomato filling. Acorn squash comes in various sizes; the larger ones, which are sometimes all I can find, take almost an hour to soften and cook through; the finished squash can be cut in half or even into thirds if too big for one serving. With everything that comes on the Thanksgiving sideboard, that will probably be the case. I always bake the squash for about 20 minutes before cutting it in half; they soften up a little bit, which makes it much easier to cut.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/10/health/12recipehealth/12recipehealth-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 substantial main dish servings, 12 to 16 smaller servings", "recipeCuisine": "southwestern", "recipeCategory": "dinner", "keywords": "fall, winter, halal, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 357}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 513, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "90 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "18 grams", "proteinContent": "23 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1088 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["4 large or 6 smaller acorn squash", "3 tablespoons extra virgin olive oil, plus additional for basting", "1 medium onion, finely chopped", "1 red pepper, diced", "1 28-ounce can chopped tomatoes with juice, pulsed to a coarse purée in a food processor", "2 tablespoons tomato paste", "2 tablespoons mild honey, maple syrup or pomegranate molasses", "2 tablespoons red wine vinegar, sherry vinegar or apple cider vinegar", "Salt to taste", "1/2 teaspoon cayenne", "3 cups cooked pintos, black beans or red beans, or 2 cans, drained and rinsed", "1 cup corn kernels", "2/3 cup breadcrumbs", "2 ounces / 1/2 cup Gruyère, grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Place squash on a baking sheet and bake 20 minutes, until soft enough to easily cut in half. Wait until cool enough to handle (about 15 minutes), then cut in half (stem to tip) and scoop out seeds and membranes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 2 tablespoons of olive oil over medium heat in a large skillet and add onion. Cook, stirring often, until it begins to soften, about 3 minutes. Add red pepper and a generous pinch of salt and cook, stirring, until tender, about 5 minutes. Add tomatoes and tomato paste and cook, stirring often, until tomatoes have cooked down slightly, about 5 minutes. Add honey, maple syrup or pomegranate molasses, vinegar, salt and cayenne, and bring to a simmer. Simmer 8 to 10 minutes, until thick and fragrant. Taste and adjust seasonings. Stir in beans and corn and simmer another 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil 1 or 2  baking dishes or a sheet pan that will accommodate all  the squash. Season cavities and cut sides of the squash with salt and pepper and brush with olive oil or melted butter. Fill with bean mixture. Mix together bread crumbs, Gruyère and remaining olive oil and sprinkle over the filling.  Brush exposed edges of squash with oil. Place in the baking dish or on baking sheet and cover tightly with foil. Bake large squash for 45 minutes, check smaller squash after 30 minutes. The flesh should be easy to penetrate with the tip of a knife. Uncover and return to oven for 5 to 10 minutes, or until breadcrumbs and cheese are lightly browned. Serve hot or warm."}]}