{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange-Scented Jelly Doughnuts (Sufganiyot)", "description": "Some Jewish foods take a lifetime to love. It can take years of practice to truly enjoy the baby food flavor and clammy texture of gefilte fish. And as festive desserts go, the dry honey cakes baked for the Jewish New Year are hardly alluring. This may explain why American Jews have enthusiastically embraced a Hanukkah treat popular in Israel, sufganiyot, or, as we know them, jelly doughnuts. Fragrant with sugar and jam, sufganiyot (the plural of sufganiya) have become a sweeter symbol of the holiday, especially for children.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/11/16/dining/16COOKING-JELLYDOUGHNUTS/16COOKING-JELLYDOUGHNUTS-articleLarge.jpg", "totalTime": "PT5H30M", "recipeYield": "12 doughnuts", "recipeCuisine": "jewish", "recipeCategory": "", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 191}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 140, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "62 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup lukewarm milk or water", "1 teaspoon dry yeast", "3 tablespoons sugar", "1 whole egg plus 1 egg yolk", "3 tablespoons sour cream or vegetable oil", "1/4 teaspoon salt", "1/4 teaspoon vanilla extract", "Freshly grated zest of 1/2 orange", "1 2/3 cups flour, more as needed", "1/2 cup thick raspberry or strawberry jam", "Vegetable oil for deep-frying", "Confectioners' sugar for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place milk or water in small bowl. Sprinkle yeast and 1 teaspoon sugar over milk. Set aside until frothy, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixer fitted with paddle attachment, beat remaining sugar with egg and egg yolk. Add sour cream, salt, vanilla extract, orange zest and yeast mixture, and mix well. With mixer running, gradually add flour. Mix until dough is soft, smooth and elastic, adding flour if dough seems very sticky, 3 to 5 minutes. Do not add more than an additional 3 tablespoons flour; dough will be somewhat sticky, but will firm up in refrigerator. Place in an oiled bowl, cover, and refrigerate at least 4 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a floured surface, roll out dough to 1/2-inch thickness. Use a biscuit or a cookie cutter to cut out 2-inch rounds, placing them on a parchment-lined baking sheet. Reroll scraps and cut again. Let rise in a warm place 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy pot, heat 3 inches of oil to 365 degrees; when hot enough, a small piece of dough will brown on bottom in 30 seconds. If too hot, doughnuts will brown outside before cooking through. Working in batches, fry doughnuts until golden brown, turning once. Drain on paper towels and dust with sugar while still warm. Let oil come back to 365 degrees between batches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have a pastry bag, fit with a small round tip and spoon jam into bag. When doughnuts are cool enough to handle, use tip of bag (or pointed tip of a serrated knife) to make a hole in bottom of doughnut. Squeeze or use a small spoon to nudge 1/2 teaspoon jam into hole. Repeat with remaining doughnuts and serve immediately. Dust again with powdered sugar."}], "link": "https://cooking.nytimes.com/recipes/1016210-orange-scented-jelly-doughnuts-sufganiyot"}