{"@context": "http://schema.org", "@type": "Recipe", "name": "Mission Chinese Food’s Cabbage Salad", "description": "Danny Bowien, the chef and an owner of Mission Chinese Food in San Francisco and sometimes New York, wanted to have a Chinese version of Caesar salad on his menu. The dish that he  and Angela Dimayuga, his executive chef, came up with is not Chinese in the least. Nor does it owe anything to Caesar save for a tin of anchovies. It is instead a Japanese ode to umami, the mysterious fifth flavor beyond sweet and salty, bitter and sour. Miso, tahini, soy sauce and dried seaweed provide a riot of flavors, and fried kasha and the raw vegetables provide copious crunch. Serve the dish alongside simple grilled chicken or pork, with a bowl of white rice. These don't even have to be all that good. You could serve this recipe alongside a teriyaki-glazed laptop case and receive plaudits for the meal. Don't have one of the ingredients? Omit! ‘‘If you don’t have it, leave it out,’’ Bowien said in an interview. ‘‘It still works.’’", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/07/27/magazine/27eat/27eat-articleLarge-v4.jpg", "totalTime": "PT45M", "recipeYield": "4 servings.", "recipeCuisine": "", "recipeCategory": "", "keywords": "anchovies, beet, cabbage", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 282}, "recipeIngredient": ["1/2 head red cabbage", "1 medium-size beet, ideally\ncandy-striped", "Juice of 1 lemon", "1 teaspoon dried hijiki seaweed", "1 teaspoon ume vinegar or\nred-wine vinegar", "2 tablespoons sweet white-miso paste", "3 tablespoons tahini", "1 teaspoon unseasoned rice vinegar", "1 tablespoon shiro shoyu or\nlight soy sauce", "8 anchovy fillets, coarsely chopped", "3 tablespoons neutral oil, like canola", "1/2 cup kasha", "2 tablespoons aonori seaweed, green\nseaweed or finely shredded nori", "3 tablespoons toasted white\nsesame seeds", "1 tablespoon shio kombu or salted\nkombu, optional", "Pinch of salt, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut cabbage in half, and remove core. Cut into 1-inch wedges and then into 1-inch pieces. Toss these lightly in a bowl, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Under running cold water, scrub beet with a vegetable brush or paper towel. Trim the beet top and beet root to provide a flat base for slicing on a mandoline. Set thickness to 1/8 inch, and slice beets into flat rounds. Season beets with half the lemon juice, and add them to the bowl with cabbage. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make sesame-anchovy dressing. In a small bowl, cover hijiki with warm tap water. Allow to bloom for 15 minutes, then drain well, and season with ume\nvinegar or red-wine vinegar. Add miso, tahini, rice vinegar, shiro shoyu, the\nremaining lemon juice and the anchovies, and whisk to combine. Dressing\nshould have a thick, almost mayonnaise-like consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the kasha furikake. Pour neutral oil into a sauté pan, and place over medium-high heat until it begins to shimmer. Pour kasha into the hot pan,\nand stir it quickly with a spoon to coat with oil. Allow kasha to fry in the oil,\nstirring constantly, until it has darkened by two shades of brown. Drain kasha\nthrough a fine strainer, and transfer to a plate covered by paper towel. While\nit is hot, season with the seaweed, which should adhere to the kasha. When it\nhas cooled, mix kasha in a small bowl with the toasted sesame seeds and, if\nusing, the shio kombu. Salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salad. Add 3 tablespoons of\nthe sesame-anchovy dressing to the bowl\nwith the cabbage and the beets, and\nmix well to combine. Add more dressing if\nnecessary. Transfer the salad to a serving\nbowl, and sprinkle 4 tablespoons or so of\nthe kasha furikake over the top. (Leftover\nkasha furikake may be passed at the\ntable, or saved to eat over white rice.)"}], "link": "https://cooking.nytimes.com/recipes/1016678-mission-chinese-foods-cabbage-salad"}