{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Bean Chorizo Casserole with Pickled Onions", "description": "You’ve probably made some kind of Mexican casserole layered with tortillas, beans, and plenty of melted cheese before (and if you haven’t, now is the time). But this one is bolder, brighter and more deeply flavored, thanks to pasilla chiles in the sauce, lime zest in the luscious crema topping, and chorizo in the beans. If you’d prefer a vegetarian version, leave out the chorizo. But do seek out the pasilla chiles (also called negra chiles), which add their inimitable smoky, fruity spice. This casserole reheats perfectly and will keep for at least five days in the fridge.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/03/26/dining/26CASSEROLE1/26JPCASSEROLE1-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner", "keywords": "black beans, chorizo, onion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 393}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 845, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "57 grams", "fiberContent": "11 grams", "proteinContent": "38 grams", "saturatedFatContent": "22 grams", "sodiumContent": "1333 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup Mexican crema, crème fraîche or sour cream", "Zest of 1 lime and 1/4 cup fresh lime juice", "1 red onion, halved root to tip and thinly sliced into half moons", "2 1/4 teaspoons kosher salt, more as needed", "2 1/2 teaspoons sugar", "2 ounces dried pasilla (also called negro) chiles rinsed, seeded and stemmed (6 to 8 chiles)", "6 tablespoons vegetable oil", "1 pound cured (cooked) chorizo, finely diced", "1 white onion, diced", "1 small bunch cilantro, leaves and stems separated", "2 teaspoons ground cumin", "3 cups cooked or canned black beans, rinsed and drained", "4 cups chicken stock", "8 garlic cloves, unpeeled", "12 6-inch corn tortillas", "12 ounces Monterey Jack cheese, grated (3 cups)", "1/2 cup roasted pumpkin seeds (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the lime crema: In a small bowl, whisk together sour cream and lime zest. Cover and refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pickled onions: In a separate bowl, combine red onion, lime juice, 1 teaspoon salt and 1/2 teaspoon sugar. Let the onion pickle at room temperature for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toast the chiles for the sauce: Heat a very large skillet (or use a Dutch oven) over medium-high heat until hot. Lay chiles flat in skillet and toast until fragrant and pliable and color darkens, 10 to 15 seconds a side; do not let them burn and turn bitter. Transfer chiles to a large bowl, cover with hot water and let stand 30 minutes. Wipe out skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the bean-chorizo mixture: While chiles soak, heat 2 tablespoons oil in the skillet over medium-high heat. Add chorizo and cook until golden, about 5 minutes. Transfer to a paper-towel-lined plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir white onion into skillet and cook until softened, about 7 minutes. Finely chop 1/4 cup cilantro stems and add to pan, along with cumin. Cook 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return chorizo to pan. Stir in beans, 1 cup stock and 3/4 teaspoon salt. Bring to a simmer; reduce heat to medium-low and cook gently 10 minutes. Taste and add more salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chile sauce: Heat broiler. Place garlic cloves (in skins) on a baking sheet. Broil, turning once, until very tender, 5 to 10 minutes. Peel garlic when cool enough to handle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain chiles and place in a blender or food processor. Add peeled garlic and 2 cups stock. Purée until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 4 tablespoons oil in a large skillet over medium-high heat. Add chile purée and simmer vigorously, stirring often, for 5 minutes or until sauce has thickened. Add remaining 1 cup stock, reduce heat to medium-low, and simmer gently, stirring often, until sauce reduces to 1 1/2 cups, about 25 minutes. Stir in remaining 2 teaspoons sugar and 1/2 teaspoon salt and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the casserole: Heat oven to 350 degrees. Spread a quarter of the chile sauce over bottom of a 9-by-13-inch baking dish. Place a layer of 6 overlapping tortillas on top of the sauce, followed by another layer of sauce, half the bean mixture and half the cheese. Cover with another layer of 6 tortillas, a layer of sauce, remaining bean mixture and remaining cheese. Spoon remaining sauce on top. Cover pan tightly and bake 20 minutes. Uncover and continue baking until casserole is bubbly around edges and cheese is melted, 20 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let casserole rest 10 minutes, then serve topped with dollops of lime crema, some pickled onion, pumpkin seeds and cilantro leaves."}], "link": "https://cooking.nytimes.com/recipes/1016157-black-bean-chorizo-casserole-with-pickled-onions"}