{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Carrot, Parsnip and Potato Soup", "description": "This is a creamy, comforting winter soup that is incredibly simple to make. All you need to do is blend together broth and roasted vegetables and heat through. You can make the soup with other roasted vegetables as well, but I love the sweet combination of the carrots and parsnips. If you’ve got roasted vegetables on hand, you’ll need about 4 cups.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/04/science/07recipehealth/07recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "dinner, lunch", "keywords": "appetizer, main course, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegan, vegetarian, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 421}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 243, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "7 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1066 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds carrots, peeled and cut in 3/4 inch pieces", "1/2 pound (2 large) parsnips, peeled, quartered, cored and cut in 3/4 inch pieces", "1 medium or large red onion, cut in large dice", "1 medium (about 6 ounces) Yukon gold potato, quartered", "2 garlic cloves, in the skin", "2 tablespoons extra virgin olive oil", "Salt and freshly ground pepper", "6 cups chicken or vegetable stock or broth", "Chopped fresh herbs, such as parsley, thyme, tarragon or chives, for garnish", "Crème fraîche or yogurt for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Line a sheet pan or a baking dish with parchment or foil. Toss vegetables, including garlic cloves, with olive oil and salt and pepper to taste. Spread in baking dish or on sheet pan in an even layer and place in oven. Set timer for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 20 minutes, stir vegetables and turn heat down to 400 degrees. Roast for another 20 to 30 minutes (or longer; I have found every oven I’ve used to be different, thus the range), or until very tender and caramelized on the edges, stirring every 10 minutes. Remove from the heat. You should have about 4 cups roasted vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Hold garlic cloves with a towel so that you don’t burn your fingers. Squeeze  out the pulp into a blender. Add half the vegetables and 2 cups of the stock. Cover the top of the blender with a towel pulled down tight, rather than airtight with the lid, because hot mixture will jump and push the top off if the blender is closed airtight. Blend until smooth and transfer to a soup pot. Repeat with the second half of the roasted vegetables. Transfer to the pot and whisk in remaining broth. Season to taste with salt and pepper and heat through. Serve each bowl with a sprinkle of chopped fresh herbs and if you wish, a swirl of crème fraîche or yogurt."}], "link": "https://cooking.nytimes.com/recipes/1016101-roasted-carrot-parsnip-and-potato-soup"}