{"@context": "http://schema.org", "@type": "Recipe", "name": "Crêpes With Grilled Peaches and Apricots", "description": "Heat deepens the flavor of both peaches and apricots, and grilling adds one more seared dimension. The trick here is to grill the fruit just until it colors and softens, but not to let it burn or collapse. I find that 3 minutes on one side is sufficient for peaches, and 2 minutes for apricots, with about 1 minute on the other side.  Crêpes are easy to make if you use a nonstick crêpe pan, and great to have on hand for desserts like this one. Keep the six extra that this recipe yields in the freezer, and grill some more peaches and apricots next week.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/07/08/science/09recipehealth/09recipehealth-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "dessert, halal, kosher, nut-free, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 554, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "79 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "9 grams", "proteinContent": "11 grams", "saturatedFatContent": "10 grams", "sodiumContent": "172 milligrams", "sugarContent": "49 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3/4 cup / 175 milliliters milk", "1/2 cup /125 milliliters water", "2 large eggs", "1/4 teaspoon / 2 grams salt", "1 tablespoon / 15 grams sugar", "1/3 cup plus 1 tablespoon / 55 grams whole-wheat flour, sifted", "3 tablespoons unsalted butter, melted, plus butter for the pan", "1/3 cup plus 1 tablespoon / 55 grams unbleached all-purpose flour, sifted", "2 1/2 pounds mixed peaches and apricots", "Grape seed oil (or another neutral oil like canola oil) or extra-virgin olive oil as needed, about 2 tablespoons", "1/4 cup mild honey, such as clover", "1 tablespoon butter", "Finely chopped or grated zest of 1 lemon", "Powdered sugar for dusting the crêpes (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the crêpes", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place milk, water, eggs and salt in a blender. Turn on and with motor running add flours and then the melted butter, and blend at high speed for 1 minute. Transfer to a bowl, cover and refrigerate for at least 30 minutes. Whisk again before making the crêpes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 7-inch seasoned or nonstick crêpe pan or skillet over medium-high heat and brush lightly with butter. (Pan must be hot when you add the crêpe batter.) Lift pan off the heat and pour in or ladle in a scant 1/4 cup batter per crêpe, enough to thinly coat the bottom of the pan. Tilt and swirl pan to distribute batter in an even layer. Return pan to the heat and cook crêpe for about 1 minute, until edges color and it is easy to loosen them with a thin spatula or butter knife. The bottom of the crêpe should be nicely browned and should not stick to the pan. Flip crêpe over and cook for 30 seconds on the other side, until it is speckled. Turn out onto a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat with remaining batter, whisking from time to time. If not using right away, stack crêpes between pieces of wax paper. Wrap in plastic and freeze or refrigerate. You will need only 6 of the 12 crêpes that this recipe makes."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the Fruit", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a griddle over a hot or medium-hot grill or burner, or preheat a grill pan. Cut fruit in half and remove pits. Brush lightly with oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine honey and butter and warm over low heat or in a microwave at 50\npercent power until butter melts (about 30 seconds in the microwave)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place fruit cut side down on griddle. Grill for about 3 minutes, until lightly\ncharred and browned but still intact. Brush skin side with oil, turn over and grill for another minute or two. Remove from griddle and cut the peach halves into thirds if the peaches are large, in half if small."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer fruit to a bowl and toss gently with lemon zest and 2 tablespoons of the honey-butter mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm crêpes: wrap in foil and place in a low oven (275 degrees) for about 10 minutes, or warm in the microwave for about 20 seconds. Place a warm crêpe on each plate and top with grilled fruit. Fold crêpe over, drizzle on honey and butter, and dust with powdered sugar if desired. Garnish with more of the fruit, which will quickly yield delicious juices that will combine with the honey and butter and should be spooned over the fruit and crêpes. Serve warm."}]}], "link": "https://cooking.nytimes.com/recipes/1016643-crepes-with-grilled-peaches-and-apricots"}