{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp alla Marinara", "description": "This recipe quickly turns a batch of <a href=\"http://cooking.nytimes.com/recipes/1015987-classic-marinara-sauce\">homemade marinara sauce</a> into dinner.  You can serve it right out of the pan, with crusty bread and a green vegetable. Or, remove the shrimp and toss the sauce with a pound of steaming-hot spaghetti or another long, thin pasta, then put them back together in serving bowls, placing the shrimp on top. Don't attempt to toss the sauce, shrimp, and pasta together -- the lively action needed to coat the pasta will break down the shrimp. You want them to be crisp and savory.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/01/29/dining/29JPSAUCE3/29JPSAUCE3-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "5 or 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, quick", "keywords": "appetizer, main course, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 372}, "recipeIngredient": ["8 tablespoons extra-virgin olive oil", "8 whole garlic cloves, peeled and lightly crushed", "2 1/2 pounds large shrimp (about 30), peeled and deveined", "Salt", "Marinara sauce (<a href=\"http://cooking.nytimes.com/recipes/1015987-classic-marinara-sauce\">see recipe</a>)", "8 fresh basil leaves, torn into small pieces (optional)", "2 tablespoons minced fresh Italian parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 4 tablespoons oil in a large skillet over medium heat. Add 4 garlic cloves and cook just until golden and sizzling. Add half the shrimp, placing them in one layer in the pan. (If you crowd the shrimp, they will steam instead of fry.) Sprinkle with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, turning once, just until lightly golden and pink around the edges, about 4 minutes total. With a slotted spoon, transfer the shrimp to a plate. Discard garlic cloves. Repeat with remaining oil, garlic and shrimp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the shrimp are cooked, pour the sauce into the empty skillet, and bring to a lively simmer, stirring to scrape the bottom of the pan. Taste for salt and add more if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the shrimp, basil (if using) and parsley, and cook just until the shrimp are heated through. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1016003-shrimp-alla-marinara"}