{"@context": "http://schema.org", "@type": "Recipe", "name": "Quinoa Bowl With Artichokes, Spring Onions and Peas", "description": "Lately I’ve been into “big bowls” — layered grain and vegetable meals in a bowl — in a big way. I cook up a pot of grains and let the vegetables I’m finding at the market inspire how I’m going to build the bowl. Spring onions, artichokes and peas are the focus of this seasonal bowl, and there’s a lot happening here as far as flavor goes. The onions and peas are sweet, but roasting also gives the onions a lovely bitter-edged char, as it does for the artichokes. I’m a recent convert to roasted artichokes; you coat them with olive oil after trimming them, and throw them into a hot oven, where the hearts soften while the edges of the leaves crisp and char. The flavors are intense. I hardly want to prepare them any other way. Garlicky yogurt garnishes and moistens the quinoa and vegetables, and brings more lusty flavor to the dish. You can be flexible with big bowls. If you don’t have quinoa in the pantry, use another grain: bulgur, rice, farro. Couscous would also work. If you want more protein, add a poached egg or even some shredded or sliced chicken breast. And if you want to sprinkle a little feta or Parmesan over the top, be my guest.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/05/03/science/08recipehealth/08recipehealth-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "american, mediterranean", "recipeCategory": "dinner", "keywords": "artichoke, peas, quinoa, gluten-free, halal, high fiber, kosher, low cholesterol, nut-free, vegan, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 50}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 565, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "78 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "23 grams", "proteinContent": "28 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1413 milligrams", "sugarContent": "16 grams", "transFatContent": null}, "recipeIngredient": ["1 lemon, cut in half, plus more lemon juice for drizzling", "4 medium or 2 large artichokes", "1 generous bunch spring onions", "3 tablespoons extra-virgin olive oil, plus more for drizzling", "Salt and pepper", "1 1/2 pounds peas, shelled", "1/4 cup chopped dill, mint or fennel fronds, or a combination", "1 to 2 garlic cloves (to taste)", "1 to 1 1/2 cups Greek yogurt or <a href=\"http://www.nytimes.com/2008/08/25/health/nutrition/25recipehealth.html?ref=yogurt\">drained yogurt</a>, to taste", "3 cups cooked quinoa", "Chopped preserved lemon or dukkah, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Line a sheet pan with parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a bowl with water and add the juice from one of the lemon halves. Trim the artichokes. Then, if using medium artichokes, cut into quarters; if using large ones, cut into sixths or eighths. As you work, rub the cut artichokes with remaining lemon half and place them in the water. When all artichokes are cut, drain and pat dry with paper towels. Place on sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim away the dark green part of the onion stems and the hairy root ends, and cut onions in half. Place on sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss artichokes and onions with the olive oil and salt and pepper to taste. Take care to coat all of the cut surfaces of the artichokes with olive oil. Place in oven and roast for 20 to 30 minutes (depending on the size of the pieces), turning vegetables with tongs every 10 minutes, until tender and lightly browned. The edges of the artichoke leaves will be charred. Transfer to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, steam or boil peas in salted water for 5 minutes; drain. Transfer to the bowl with onions and artichokes. Add half the chopped fresh herbs and toss together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mortar and pestle, mash garlic to a paste with a pinch of salt. Stir into yogurt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide quinoa among four bowls and top with artichokes, onions and peas. Spoon yogurt over vegetables and sprinkle with remaining herbs. Douse with a little lemon juice and drizzle on a little oil if desired. Garnish with dukkah or about 2 teaspoons preserved lemon, or both."}]}