{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Wheat Bread, Apple and Cranberry Dressing", "description": "Having grown up with Pepperidge Farm stuffing, I will always have a weakness for bread stuffing seasoned with sage and thyme, with plenty of chopped onion and celery. I prefer to use 100 percent whole wheat bread, one that isn’t at all sweet. A mixed grains bread would also work. The apple and cranberries contribute sweetness, tartness and texture to the classic dressing. I bake this in a gratin dish; you can double the recipe if you want to use it for a stuffing as well, and put half inside the bird. But, moistened with a well seasoned vegetable stock, the dressing makes a great vegetarian side dish. Just be sure to use plenty of stock to moisten, as the problem with most stuffings that are baked outside the bird is that they are dry. Tender apples like McIntosh, Gala, Macoun and Cortland work well in this dish.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/18/science/18recipehealthstuffing/18recipehealthstuffing-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "fall, winter, halal, kosher, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 207, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "329 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 to 9 ounces whole wheat bread (with crusts), cut into 3/4 to 1-inch cubes (4 to 5 cups)", "3 tablespoons extra virgin olive oil", "1 medium or large onion, finely chopped", "2 stalks celery, diced", "Salt and freshly ground pepper to taste", "1 large apple, peeled and diced", "1/4 cup chopped flat-leaf parsley", "2 teaspoons minced fresh thyme", "1 tablespoon minced fresh sage or 1 teaspoon rubbed dried sage", "1/2 cup dried cranberries", "1 egg", "1 cup chicken or vegetable stock", "1 tablespoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Oil or butter a 2-quart baking dish. Place cubed bread in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of  olive oil over medium heat in a large, heavy skillet. Add onion and celery and cook, stirring, until onion is tender, 5 to 8 minutes. Season with salt and pepper and scrape into bowl with the bread. Add remaining olive oil to bowl and all of the other ingredients except egg and stock. Season generously with salt and pepper and toss well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat egg in a small bowl and whisk in 1/2 cup of  stock. Scrape into bread mixture and mix together well. Turn into prepared baking dish. Douse mixture with remaining stock (hold back about 1/4 cup if you are going to reheat). Dot top with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover baking dish with foil and bake for 45 minutes. Uncover and bake another 15 minutes, until top is nicely browned. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1016990-whole-wheat-bread-apple-and-cranberry-dressing"}