{"@context": "http://schema.org", "@type": "Recipe", "name": "Charred Broccoli", "description": "New Nordic cuisine has spread far beyond Scandinavia in the last few years, and this dish goes a long toward explaining why. The broccoli, seared but still crunchy, is brightened by a beguilingly salty, savory and garlicky aioli, then finished with buttery seasoned panko. While the recipe requires multiple steps and some attention to make sure the bread crumbs and garlic are not overcooked, the preparation pulls together easily. This dish also lends itself well to situations where time may be limited, as both the aioli and bread crumbs can easily be prepared ahead of time. The result is a composed, umami-laden dish that is rich but balanced.", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2014/02/19/dining/20140219-NORDIC-slide-GFS0/20140219-NORDIC-slide-GFS0-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "scandinavian", "recipeCategory": "", "keywords": "broccoli, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 52}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 843, "unsaturatedFatContent": "63 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "81 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "13 grams", "sodiumContent": "676 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons salted butter", "1 cup panko", "2 tablespoons rendered chicken fat, duck fat or vegetable oil", "4 anchovies packed in salt or oil, soaked in cold water for 10 minutes, drained and chopped", "1 teaspoon minced dried shallots, or substitute 1/2 teaspoon minced fresh onion or shallot", "1/2 teaspoon salt, or to taste", "5 cloves whole garlic, peeled", "1 cup grapeseed oil", "2 large eggs", "1 tablespoon fish sauce (preferably Three Crabs brand), or more as needed", "1 1/2 teaspoons apple vinegar, preferably Bragg unfiltered", "1 1/2 teaspoons caper juice", "1/2 teaspoon lemon juice", "1 head broccoli, woody stem removed, sliced lengthwise about 1/2-inch thick, keeping as many of the florets connected to the stem as possible", "3 tablespoons grapeseed oil", "1/4 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the bread crumbs: Heat oven to 350 degrees. In a medium saucepan over low heat, melt the butter. Add the panko and mix well. Spread on a baking sheet and bake until toasted, mixing occasionally, 5 to 7 minutes. Remove from oven and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pan over medium-low heat, heat the fat or oil until shimmering. Add the anchovies and sauté until browned, about 2 minutes. Transfer anchovies to paper towels to drain. Scrape the anchovies into a bowl. Add the shallots, panko and salt and mix well; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the aioli: In a small saucepan, combine the garlic and oil. Place over very low heat and allow garlic to cook until softened but not browned, 20 to 30 minutes. Remove from heat and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer garlic to a blender, reserving the oil. Add the eggs, 1 tablespoon fish sauce, vinegar, caper juice and lemon juice. Pulse until foamy. With blender at medium speed, slowly stream in the reserved oil until mixture has the consistency of thin mayonnaise. If more saltiness is desired, add fish sauce to taste. Transfer to a covered container and refrigerate; the aioli will thicken when chilled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the broccoli: Place a heavy-bottomed pan over high heat until very hot. Add the grapeseed oil and place broccoli, cut side down, in the pan. Lightly season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sear broccoli until browned, about 1 minute, then quickly flip to sear the raw side for 30 seconds. Promptly remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, arrange broccoli on a platter or individual plates. Brush with garlic aioli, and sprinkle liberally with the seasoned panko. Serve immediately."}]}