{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Corn and Tomato Salsa", "description": "Grilling tomatoes, jalapeños and corn makes for a nice mix of flavors. The sweetness of the corn contrasts well with the charred and picante flavors of the salsa. I’ve added corn to salsa fresca before, but this time, eyeing generous ears of corn on the cob in the market, I imagined it grilled or roasted in a roasted tomato salsa. I used as a starting point the renowned chef Rick Bayless’s terrific roasted jalapeño tomato salsa with fresh cilantro, from a book he published in 1998 called “Salsas That Cook.” After I had grilled the tomatoes and jalapeño under a broiler (you could also cook them on a grill), I grilled an ear of corn, also under a broiler. The kernels take on a beautiful color, and their sweetness contrasts nicely with the charred and picante flavors that run through this salsa. The corn also contributes crunch. The salsa is great with tacos, chips, and grains, and is particularly good with chicken.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/07/29/science/28recipehealth/28recipehealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Makes a little about 2 1/2 cups", "recipeCuisine": "mexican", "recipeCategory": "breakfast, brunch, dinner, lunch, sauces and gravies", "keywords": "appetizer, side dish, dairy-free, gluten-free, halal, kosher, low calorie, low cholesterol, low-fat, low-sodium, low sugar, nut-free, vegan, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 40}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 293, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "14 grams", "proteinContent": "12 grams", "saturatedFatContent": "0 grams", "sodiumContent": "2132 milligrams", "sugarContent": "26 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds ripe tomatoes, preferably plum tomatoes", "1 or 2 jalapeños (about 1 ounce)", "1 ear of corn, shucked", "1/2 small white onion, sliced about 1/4 inch thick (about 2 ounces)", "4 garlic cloves, peeled", "Salt to taste", "1 1/2 teaspoons cider vinegar", "1/4 cup water (optional)", "1/3 to 1/2 cup chopped cilantro (to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat broiler and set rack 4 inches below. If your broiler and oven are separate, also preheat the oven to 425 degrees. Line 2 baking sheets with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place tomatoes and jalapeños on one of the baking sheets and set under broiler, about 4 inches from heat. Broil for about 6 minutes, until skins are charred and blackened in spots. Using tongs, flip over tomatoes and jalapeño and continue to broil for another 6 minutes. The tomatoes and chiles should be softened and cooked through as well as charred. Tip tomatoes and chiles, along with any juices in the pan, into a bowl and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place corn on baking sheet and set under the broiler. Broil until you hear the kernels beginning to pop, 2 to 4 minutes. Corn should be nicely browned on one side. Flip over and broil for 2 minutes, or until you hear popping, on the other side. Remove from heat, allow to cool, then cut kernels from cob and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using the same oven to roast the onions, turn heat down to 425 degrees. Break up onions into rings and place on baking sheet in a single layer. Add garlic and place in oven. Roast, stirring every 5 minutes, until onions have softened and are lightly browned and charred on edges and garlic is soft and browned in spots, about 15 minutes. If some of the smaller pieces of onion begin to char more quickly than others, remove them sooner."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stem jalapeños and place with onions and garlic in a food processor fitted with the bowl as necessary. Transfer to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When tomatoes are cool enough to handle, core and discard skins (hold over bowl to catch juices). Place in food processor with juice and pulse to a coarse purée. Add to bowl with chopped onions, garlic and jalapeño. Add the vinegar, season generously with salt (Rick Bayless recommends a generous teaspoon), and stir in the cilantro and corn. If desired, thin out with water."}], "link": "https://cooking.nytimes.com/recipes/1016680-roasted-corn-and-tomato-salsa"}