{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole-Wheat English Muffins", "description": "Yes, it is worth your while to make English muffins from scratch. Not only is the texture lighter and crisper, homemade muffins taste better, too — yeasty, wheaty, complex. You will need to sear these muffins on the stove top before baking. That’s what gives them their unique crunch on their bottoms. This recipe does not require muffin rings, but if you have them and would like to use them, go right ahead. Just add a few minutes onto the baking time to accommodate the muffins’ increased thickness. Then fork-split them, toast and serve with plenty of butter. After all, that’s what those crevices are made for.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/23/dining/23ENGLISH_SPAN/23ENGLISH-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "6 muffins", "recipeCuisine": "british", "recipeCategory": "breakfast, brunch, project", "keywords": "appetizer, side dish, flour, milk, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 468}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 253, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "6 grams", "sodiumContent": "225 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 teaspoons/7 grams active dry yeast (1 packet)", "4 tablespoons/60 grams unsalted butter", "1/2 cup/120 milliliters plain yogurt", "1/2 cup/120 milliliters warm whole milk", "1/2 tablespoon/7 milliliters honey", "1 teaspoon/5 grams fine sea salt", "1 cup/125 grams whole-wheat flour", "1 cup/125 grams all-purpose flour", "1/2 teaspoon/4 grams baking soda", "Cornmeal, preferably coarse, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl combine yeast and 1/3 cup warm water (80 milliliters) and let rest until yeast has dissolved, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 2 tablespoons butter and put it in a large bowl. Whisk in yogurt, milk, honey, salt and the yeast mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add flours and baking soda to bowl and beat thoroughly with a spoon or rubber spatula until well combined. Cover bowl and let rest in a warm spot for 1 to 1 1/2 hours, or until dough has doubled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven 350 degrees. Lightly dust a small baking sheet with cornmeal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large skillet over medium heat and melt 1 tablespoon butter. Using a large ice cream scoop or 1/2 cup measuring cup, drop batter into skillet to form round muffins about 4 inches in diameter, mounding the batter in the center. (You may need to coax the dough a little with your fingers, so be careful of the hot pan, and don’t worry if they’re not perfectly circular.) Repeat until you have 3 muffins, leaving the rest of the batter for a second batch. Reduce heat to low. Cover skillet with lid or baking sheet and cook 3 to 5 minutes, until bottoms are golden brown. (Be careful not to let them burn.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover skillet and flip muffins using a spatula. Cover again and cook 2 to 4 minutes or until the other sides are golden brown. Place muffins on prepared baking sheet. Repeat using remaining batter and another tablespoon of butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake muffins for 6 to 9 minutes, or until puffed and cooked through. Split the muffins with a fork and toast before eating."}], "link": "https://cooking.nytimes.com/recipes/1016274-whole-wheat-english-muffins"}