{"@context": "http://schema.org", "@type": "Recipe", "name": "Provençal Potato “Bouillabaisse”", "description": "This main dish soup is a “poor man’s bouillabaisse.” Saffron will add a touch of luxury to any dish, and here it infuses the broth and lends its beautiful hue to the potatoes.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/10/20/health/nutrition/20recipe.health.ready/20recipe.health.ready-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 17}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 447, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "6 grams", "proteinContent": "21 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1716 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil", "1 medium or large onion, cut in half then thinly sliced across the grain", "2 large leeks, white and light green parts only, cut in half lengthwise, sliced and rinsed well", "3 large garlic cloves (more to taste), minced or sliced", "1 pound ripe tomatoes, peeled, seeded and chopped or 1 (14-ounce) can, with liquid", "6 cups water or chicken stock", "Salt", "A bouquet garni made with 1 cleaned leek green, a bay leaf, a thin slice of orange zest and a couple of sprigs each of parsley and thyme, tied together", "1 pound waxy potatoes or Yukon golds, scrubbed and sliced", "A generous pinch of saffron threads", "Freshly ground pepper to taste", "Pinch of cayenne (optional)", "4 large eggs", "2 tablespoons chopped fresh parsley", "4 to 8 thin slices baguette or country bread, toasted and rubbed with a cut clove of garlic"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy soup pot or casserole and add the onion and leeks. Cook, stirring, until tender, about 5 minutes. Add the garlic and stir together for about a minute, until fragrant. Add the tomatoes, 1/2 teaspoon salt, and the bouquet garni and cook, stirring from time to time, for 10 minutes, until the tomatoes have cooked down and smell fragrant. Add the water or stock and the potatoes, and bring to a boil. Add 1 teaspoon salt and the saffron, reduce the heat, cover and simmer 20 to 25 minutes, or until the potatoes are tender. Taste, adjust the salt, and add cayenne and pepper. Remove the bouquet garni and stir in the parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Making sure that the soup is at a bare simmer, carefully break the eggs into a bowl and tip into the soup. Cover (you can turn off the heat at this point) and cook 5 minutes or until set. Ladle the soup into wide soup bowls, with an egg for each portion. Garnish with croutons if desired, and serve."}], "link": "https://cooking.nytimes.com/recipes/1016481-provencal-potato-bouillabaisse"}