{"@context": "http://schema.org", "@type": "Recipe", "name": "Feta-Stuffed Grilled Flatbread", "description": "Stuffing flatbread with feta and herbs adds great flavor and an herbal, creamy surprise if you don’t know what’s in them. Feel free to use this recipe as a jumping off point for your own stuffings. The honeyed, whole-wheat-flecked dough works especially well with strong flavors like olives, capers, anchovies and other cheeses. Or skip the stuffing and grill up this dough all by itself. The basil oil makes a great dipping sauce with both stuffed and unstuffed flatbreads.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/08/14/multimedia/clark-flatbread/clark-flatbread-mediumThreeByTwo440.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, sandwiches", "keywords": "basil, feta, oregano, whole wheat flour, yogurt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 176}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 498, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "69 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "8 grams", "proteinContent": "14 grams", "saturatedFatContent": "5 grams", "sodiumContent": "353 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 teaspoon/5 milliliters honey", "2 teaspoons/7 grams active dry yeast (1 packet)", "3 cups/375 grams whole-wheat flour", "2 1/2 teaspoons/13 grams fine sea salt, more as needed", "3/4 cup/180 milliliters plain yogurt", "1/2 cup/120 milliliters, plus 1 tablespoon extra-virgin olive oil, more for brushing", "2 to 3 cups/250 to 375 grams all-purpose flour, more as needed", "1 cup/50 grams fresh basil leaves", "2 garlic cloves, roughly chopped", "1/2 cup/30 grams fresh oregano leaves", "1 cup/130 grams crumbled feta cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together 2 cups warm water and the honey. Sprinkle yeast over warm water. Stir to dissolve. Gradually stir in whole-wheat flour. Stir about 1 minute. Let mixture rest, uncovered, 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle salt over mixture. Stir in yogurt and 1 tablespoon oil. Stir in 2 cups all-purpose flour, then add more a little at a time, until dough is too stiff to comfortably stir. Turn dough out onto a floured surface and knead until smooth and elastic, about 10 minutes. Sprinkle in additional flour as needed to yield a smooth and only very slightly sticky dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let dough rise at room temperature in a lightly oiled bowl, loosely covered with a dish towel, until doubled in bulk, about 2 to 3 hours. Alternatively, cover the bowl with plastic wrap and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender or food processor, purée basil leaves, 1/2 cup oil, a large pinch of salt and the garlic. Scrape mixture into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough into 8 equal portions. If you let your dough rise at room temperature, chill dough balls for at least 30 minutes and up to 4 hours. (If you refrigerated the dough overnight, you can skip this second chilling if the dough still feels cool.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll out 1 dough ball to a 6-inch circle (keep remaining balls on a baking sheet loosely covered with a dish towel). Brush top of circle with basil oil and sprinkle with 1 tablespoon oregano and 2 tablespoons feta. Fold edges of dough over the center of the filling and press together to seal, so filling is no longer visible. Use hands or a rolling pin to reroll dough to a 6-inch circle. Repeat with remaining dough balls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush both sides of dough rounds with olive oil and grill for 5 to 6 minutes, flipping halfway through, or until each side has grill marks. The bread is ready to be flipped when it begins to puff and bubble. Sprinkle with salt while hot and serve with remaining basil oil for dipping.\nNote: Measurements for dry ingredients are given by metric weight for greater accuracy. The equivalent measurements by volume are approximate."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Feta-Stuffed Grilled Flatbread", "description": "Melissa Clark shows flatbread at its best: grilled and stuffed with fresh oregano and feta cheese.", "thumbnailUrl": "https://static01.nyt.com/images/2014/08/14/multimedia/clark-flatbread/clark-flatbread-mediumThreeByTwo440.jpg", "uploadDate": "2014-08-15T16:58:30.000Z", "duration": "PT2M36S"}, "link": "https://cooking.nytimes.com/recipes/1016749-feta-stuffed-grilled-flatbread"}