{"@context": "http://schema.org", "@type": "Recipe", "name": "Wild Arugula, Celery and Apple Salad With Anchovy Dressing", "description": "The dressing in this salad is inspired by a much more robust dressing in Jennifer McLagan’s wonderful new cookbook, “Bitter.” I have reduced the anchovies significantly, not because I don’t adore anchovies, but to reduce the sodium levels, which would be too high if an entire can were used. The salad presents a delicious play of bitter, pungent, sweet and salty flavors.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/10/21/health/21bittersarugula/21bittersarugula-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 4", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, lunch", "keywords": "appetizer, dairy-free, gluten-free, halal, kosher, low cholesterol, nut-free, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 60}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 199, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "3 grams", "proteinContent": "2 grams", "saturatedFatContent": "2 grams", "sodiumContent": "172 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 anchovy fillets", "5 tablespoons extra virgin olive oil", "1 large garlic clove, green germ removed, minced", "1 tablespoon fresh lemon juice or sherry vinegar", "1 teaspoon Dijon mustard", "Freshly ground pepper", "4 cups arugula, preferably feathery wild arugula, stemmed", "2 cups thinly sliced celery, from the inner stalks of the bunch", "2 tablespoons chopped celery leaves", "1 tart apple, such as a Pink Lady or Granny Smith, thinly sliced and tossed with 2 teaspoons lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make dressing. Rinse anchovies briefly and chop. Heat 2 tablespoons of olive oil over low heat in a small skillet and add anchovies and garlic. Stir until garlic is fragrant and just beginning to color and anchovies have broken down into smaller bits. Transfer to a mortar and pestle. Use the pestle to grind mixture into a paste. Add lemon juice or vinegar to the still-hot pan and stir to deglaze bottom of pan, then transfer to mortar and pestle. Add mustard. Work together, then slowly add olive oil, one tablespoon at a time, working each tablespoon into anchovy mixture before adding the next. Season to taste with freshly ground pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a salad bowl, toss together arugula, celery and celery leaves, and apple slices. Add dressing, toss until coated, and serve."}], "link": "https://cooking.nytimes.com/recipes/1016901-wild-arugula-celery-and-apple-salad-with-anchovy-dressing"}