{"@context": "http://schema.org", "@type": "Recipe", "name": "Pureed White Bean and Winter Squash Soup", "description": "This savory pale orange potage makes a comforting winter meal. White beans (and beans in general) are one of the best sources of fiber you can find, and they’re a great source of protein as well.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/12/15/health/nutrition/15recipe.health.ready/15recipe.health.ready-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 45}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 351, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "60 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "14 grams", "proteinContent": "19 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1400 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 pound white beans (such as navy beans, small white beans, or cannelini), washed, picked over and soaked for 6 hours o overnight in 2 quarts water", "2 tablespoons extra virgin olive oil", "1 medium onion, chopped", "4 garlic cloves, minced", "2 1/2 quarts water", "A bouquet garni made with a bay leaf, a couple of sprigs each thyme and parsley, and 2 sage leaves", "Salt to taste", "2 leeks, white part only, well washed and chopped", "1 pound winter squash, peeled, seeds and membranes removed, and diced", "Freshly ground pepper to taste", "Slivered fresh sage leaves", "Garlic croutons (toast slices country bread or baguette, rub with a cut clove of garlic, and cut the toasted bread into cubes; optional)", "A light drizzle of extra virgin olive oil (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the beans. Heat 1 tablespoon of the olive oil in a large, heavy soup pot over medium heat and add the onion. Cook gently until tender, about 5 minutes, and add 2 of the garlic cloves and 1/2 teaspoon salt. Stir together for about 30 seconds, then add the drained beans and the water. Bring to a boil and skim off foam. Add the bouquet garni, reduce the heat, cover and simmer 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the remaining olive oil in a wide, heavy skillet over medium heat and add the leeks and 1/2 teaspoon salt. Cook gently, stirring, until tender, about 3 minutes, and add the remaining garlic and the squash. Cook, stirring, until the garlic is fragrant and the squash is coated with oil and just beginning to soften, about 2 minutes. Remove from the heat and stir into the beans. Add salt to taste and continue to simmer for another 30 minutes to an hour, until the beans and vegetables are thoroughly tender and falling apart. Taste and adjust salt. Remove the bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an immersion blender or a food mill fitted with the fine  or medium blade, puree the soup. Heat through, taste and adjust salt, and add pepper to taste. Serve, garnishing each bowl with slivered sage leaves, (optional) garlic croutons and an optional drizzle of olive oil."}], "link": "https://cooking.nytimes.com/recipes/1016516-pureed-white-bean-and-winter-squash-soup"}