{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoked Whitefish Salad With Crème Fraîche and Capers", "description": "Whitefish salad is a necessity at traditional Jewish \"appetizing\" stores like Barney Greengrass and Russ & Daughters, which traditionally stock smoked and pickled fish, cheese, bagels and bialys, halvah and other small luxuries. According to strict kosher law, meat and dairy cannot be made in the same kitchen: Jewish butchers and delis traditionally supplied the meat, while appetizing stores sold dairy products. Fish can be paired with either. That's why you'll never see a Reuben sandwich at a truly authentic Jewish deli. \nTheo Peck, the owner of Peck's, a cafe in Brooklyn, is a trained chef and a descendant of the family that owned Ratner's, a famous Jewish restaurant on the Lower East Side.  His version replaces mayonnaise with crème fraîche, and adds bright notes of capers and fresh herbs.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "jewish", "recipeCategory": "easy, salads and dressings", "keywords": "capers, crème fraîche, whitefish, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 56}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 92, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "0 grams", "proteinContent": "3 grams", "saturatedFatContent": "4 grams", "sodiumContent": "104 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 small whole smoked whitefish, about 1 pound, or 12 ounces smoked trout, cod or sturgeon fillets", "1 cup (8 ounces) crème fraîche", "2 tablespoons finely chopped red onion, more to taste", "1 teaspoon Dijon mustard, more to taste", "2 tablespoons drained capers", "1/4 cup finely chopped dill", "1/4 cup finely chopped parsley", "1/2 teaspoon freshly ground black pepper, more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your fingers, pick the meat off the skeleton of the fish, shredding it into a bowl. Discard bones and skin. If using fillets, use your fingers to coarsely shred the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, whisk together remaining ingredients. Gently fold fish into cream mixture until well combined. Refrigerate at least 30 minutes or up to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before serving, taste and add more onion, mustard or pepper if needed."}]}