{"@context": "http://schema.org", "@type": "Recipe", "name": "Phyllo Pastry With Fresh Figs and Ricotta", "description": "For an impressive dessert, try these flaky phyllo pastries, which are not at all difficult to make. Form little packages of phyllo leaves brushed with butter, add a smear of sweetened ricotta and top them with ripe figs cut into star shapes. Lightly sugared, baked and drizzled with honey, they are a cross-cultural pleasure, almost like a French tartlet, but with Middle Eastern undertones. Each pastry requires just one sheet of dough. Any remaining leaves can be carefully wrapped and refrozen.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/09/10/dining/10KITCHEN/10KITCHEN-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "finger foods, pastries", "keywords": "almond, figs, honey, phyllo, ricotta, appetizer, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 76}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 278, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "11 grams", "sodiumContent": "79 milligrams", "sugarContent": "13 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup ricotta", "Zest of 1 lemon", "1 tablespoon lemon juice", "1/8 teaspoon almond extract", "2 tablespoons sugar", "6 sheets phyllo dough", "1 1/2 sticks (12 tablespoons) unsalted butter, melted", "12 ripe figs", "Sugar for sprinkling", "1/4 cup raw almonds, toasted and roughly chopped", "1/4 cup warm honey for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the ricotta filling:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, combine ricotta, lemon zest and juice, almond extract and sugar. Stir well and set aside."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the pastries:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay 1 sheet phyllo dough horizontally on a flat surface. Brush lightly with butter. Fold phyllo in half, left to right, and brush the top lightly with butter. Then fold phyllo in half, top to bottom, and brush the top lightly with butter again. Fold once more, left to right. You should have a 4-by-6-inch rectangle. Brush top with butter and trim edges. Repeat with remaining 5 sheets phyllo, using 2 tablespoons butter per pastry. Lay pastry packages on a parchment-lined baking sheet and heat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread each pastry package with a generous tablespoon of ricotta filling. Snip stems from figs and open them into star shapes by cutting from stem end in quarters, nearly to the bottom of the fig. Top each pastry package with 2 figs. Sprinkle 1 teaspoon sugar over each package."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 15 minutes or until golden and crisp. Remove from oven, sprinkle with chopped almonds and drizzle lightly with honey. Serve at room temperature. If desired, cut pastries in half to make 12 small servings."}]}]}