{"@context": "http://schema.org", "@type": "Recipe", "name": "Pocket Dressing", "description": "In a lot of states, people don’t just eat food on Thanksgiving; they hunt for it. Lora Smith, a writer and farmer with roots in Kentucky, sends along a recipe handed down from her great-grandmother, for her family’s “pocket” dressing: a baked patty of dressing that slides easily into the pockets and knapsacks of rabbit and quail hunters. The Smiths also have the patties at the table, where they are passed around on a platter. \n\nTexture is key. The outside must be browned and crisp. Inside, softness comes from cornbread and biscuits, and chewiness from foraged mushrooms. A family member (traditionally, the oldest matriarch)  leaves a thumbprint indentation on each patty before baking, so that a little gravy can settle and soak in. \n\nThe hunt continued through Thanksgiving weekend. “They’d again take the leftover dressing wrapped in wax paper with them, and sometimes turkey sandwiches or turkey with fresh biscuits pulled out of the oven that morning,”  Ms. Smith said. “My father always carried a small backpack where he kept extra leftovers and cold bottles of Coke. His other job was to carry the rabbits and quail they shot in the backpack.” When the weather was especially chilly, the patties solved another problem. According to Ms. Smith, “they also served as nice hand warmers.”", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19KENTUCKY/19KENTUCKY-articleLarge.jpg", "totalTime": "PT1H25M", "recipeYield": "24 patties", "recipeCuisine": "american", "recipeCategory": "stuffing and dressing", "keywords": "biscuits, chestnut, cornbread, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 15}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 316, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "7 grams", "sodiumContent": "377 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Olive oil, for the muffin tins", "1 pound buttermilk biscuits (about 12 2 1/2-inch biscuits) or 1/2 loaf stale white bread", "1 batch cornbread from 8-inch-square pan, preferably not sweet (see note)", "12 tablespoons (1 1/2 sticks) butter", "1 large onion, chopped, (1 1/2 cups)", "5 stalks celery, chopped (2 cups)", "5 sage leaves, roughly chopped", "10 ounces roasted chestnuts (store-bought is fine), chopped", "Salt and pepper", "1 pound shiitake or cremini mushrooms (or a combination), chopped", "3 eggs, beaten", "2 to 3 cups turkey broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Lightly oil 2 12-cup muffin tins. Finely crumble biscuits and cornbread into a large bowl with your hands; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 8 tablespoons (1 stick) butter in a large skillet over medium-high heat. Add onions and cook, stirring occasionally, until starting to soften, about 5 minutes. Add celery and cook 4 more minutes. Stir in sage and chestnuts and season with salt and pepper to taste; transfer to the bowl with biscuit and cornbread crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt remaining 4 tablespoons butter in skillet over medium-high heat. Add\nmushrooms and cook, stirring occasionally, until they have released most of their liquid and are beginning to brown, about 8 minutes; remove to the bowl with onion mixture and crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add eggs and 2 cups turkey broth to bowl and stir until everything is well-combined and moist. The mixture should hold together when squeezed in your hand. Add up to 1/2 cup more broth if mixture is too dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form mixture into 3-inch balls with your hands. Flatten balls slightly between your palms, then set them in prepared muffin tins. Use your thumb or fingers to form a dimple in the top of each. Fill dimples with turkey broth. Transfer to oven and bake until the tops are browned and starting to crisp, about 40 minutes. Serve alongside turkey, drizzled with gravy if you like, or wrap the patties individually if serving as a portable snack."}], "link": "https://cooking.nytimes.com/recipes/1016927-pocket-dressing"}