{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Tomatillo-Poblano-Avocado Salsa", "description": "One of my favorite new cookbooks of this season is “A Mouthful of Stars” (Andrews McMeel),  by Kim Sunée. The book is a memoir, travelogue and cookbook all rolled into one, written by an author  who earlier  published another  compelling memoir with recipes,  “Trail of Crumbs.” Kim is a poetic world traveler who loves many cuisines. She is a big fan of taco trucks and loves salsa, the spicier the better. This salsa is based on her recipe for roasted tomatillo-poblano salsa. I love its balance of char, heat, acid and creamy. I’m  a moderate  when it comes to heat, but you can make this  hotter  by adding more chiles.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/15/science/16recipehealth/16recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 2 cups, serving 6 to 8", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, sauces and gravies", "keywords": "appetizer, side dish, dairy-free, gluten-free, halal, kosher, low calorie, low-carb, low cholesterol, low-sodium, low sugar, nut-free, vegan, vegetarian, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 108, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "4 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "256 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound tomatillos, husked and quartered", "2 poblano or Anaheim chiles, stemmed and quartered (cut in half lengthwise, pull out seeds and membranes, then cut halves in half crosswise)", "1 to 2 jalapeño or serrano chiles (to taste), stemmed and seeded if desired", "1 medium white or yellow onion, peeled and quartered", "2 garlic cloves, peeled", "2 tablespoons extra virgin olive oil", "Salt to taste", "1/2 cup chopped cilantro", "1 teaspoon ground toasted cumin", "1 large ripe avocado, halved and pitted", "Juice of 2 limes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Line a sheet pan with parchment. Place tomatillos, chiles (both types), onion, and garlic on the parchment and drizzle on olive oil. Add salt to taste and toss together with your hands. Place in oven and roast 20 minutes, stirring halfway through, until blistered and softened. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place roasted vegetables, with any juice from the pan, in a food processor fitted with the steel blade. Pulse until well blended but not puréed. Add cilantro, cumin, avocado and lime juice and pulse until blended. Taste and adjust salt. Serve at once or store in a well-sealed container in the refrigerator. Stir well before serving."}], "link": "https://cooking.nytimes.com/recipes/1016244-roasted-tomatillo-poblano-avocado-salsa"}