{"@context": "http://schema.org", "@type": "Recipe", "name": "Foolproof Tarte Tatin", "description": "Tarte Tatin isn't as American as apple pie, but it's a whole lot easier. With just four ingredients, it's all about the apples: the lovely taste and shape of the fruit are preserved by sugar and heat, with a buttery-salty crust underneath. This recipe from Gotham Bar and Grill in New York has a couple of tricks that make it easier to pull off than others: dry the apples out before baking; start by coating the pan with butter instead of making a caramel; use tall chunks of apple and hug them together in the pan to prevent overcooking.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/10/29/dining/29COOKING-TARTTAITIN1/29COOKING-TARTTAITIN1-mediumThreeByTwo440.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "dinner, lunch, pies and tarts", "keywords": "apples, puff pastry, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1335}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 242, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "4 grams", "proteinContent": "1 gram", "saturatedFatContent": "5 grams", "sodiumContent": "78 milligrams", "sugarContent": "31 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 to 8 large, firm-fleshed apples, preferably Braeburn, or use a mix of Honeycrisp and Granny Smith", "6 tablespoons/80 grams salted butter, very soft", "2/3 cup/135 grams granulated or light brown sugar", "1 sheet all-butter puff pastry, about 8 ounces (store-bought is fine)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "At least one day before you plan to cook the tart, prepare the apples: Slice off the bottom of each apple so it has a flat base. Peel and quarter the apples. Use a small sharp knife to trim the hard cores and seeds from the center of each quarter; don’t worry about being too neat. Transfer to a bowl and refrigerate, lightly covered, for at least one day or up to three days. (This key step reduces the amount of liquid in the tart. Don’t worry if the apples turn brown; they will be browned during the cooking anyway.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, heat oven to 375 degrees (or 350 if using convection). Thickly coat the bottom of a 10-inch heavy ovenproof skillet, preferably nonstick metal, with butter. Sprinkle sugar evenly on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut one piece of apple into a thick round disk and place in the center of the skillet to serve as the “button.” Arrange the remaining apple pieces, each one standing on its flat end, in concentric circles around the button. Keep the pieces close together so that they support one another, standing upright. They will look like the petals of a flower."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a floured surface, roll out the puff pastry about 1/8-inch thick. Place an upside-down bowl or pan on the pastry and use the tip of a sharp knife to cut out a circle about the same size as the top of your skillet. Lift out the circle and drape gently over the apples. Use your hands to tuck the pastry around the apple pieces, hugging them together firmly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the skillet on the stovetop over medium heat until golden-brown juice begins to bubble around the edges, 3 minutes (if the juices keep rising, spoon out as needed to remain level with pastry). If necessary, raise the heat so that the juices are at a boil. Keep cooking until the juices are turning darker brown and smell caramelized, no longer than 10 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer skillet to the oven and bake 45 to 50 minutes, until puff pastry is browned and firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool 5 minutes, then carefully turn out onto a round serving plate. (Or, if not serving immediately, let cool completely in the pan; when ready to serve, rewarm for 15 minutes in a 350-degree oven before turning out.) If any apples remain stuck in the pan, gently use your fingers or a spatula to retrieve them, and rearrange on the pastry shell. Cut in wedges and serve warm with heavy cream, crème fraîche or vanilla ice cream."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Foolproof Tarte Tatin Recipe", "description": "Julia Moskin demonstrates the art of caramelizing apples for a crisp and sweet tarte Tatin.", "thumbnailUrl": "https://static01.nyt.com/images/2015/10/29/dining/29COOKING-TARTTAITIN1/29COOKING-TARTTAITIN1-mediumThreeByTwo440.jpg", "uploadDate": "2014-10-20T16:53:21.000Z", "duration": "PT1M32S"}}