{"@context": "http://schema.org", "@type": "Recipe", "name": "Speedy No-Knead Bread", "description": "The original recipe for no-knead bread, which Mark Bittman learned from the baker Jim Lahey, was immediately and wildly popular. How many novices it attracted to bread baking is anyone’s guess. But certainly there were plenty of existing bread bakers who excitedly tried it, liked it and immediately set about trying to improve it. This is an attempt to cut the start-to-finish time down to a few hours, rather than the original 14 to 20 hours' rising time. The solution is simple: use more yeast.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/02/16/dining/16COOKING-NOKNEADBREAD3/16COOKING-NOKNEADBREAD3-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "1 big loaf", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, lunch, project", "keywords": "appetizer, side dish, bread", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 958}, "recipeIngredient": ["3 cups bread flour", "1 packet (1/4 ounce) instant yeast", "1 1/2 teaspoons salt", "Oil as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine flour, yeast and salt in a large bowl. Add 1 1/2 cups water and stir until blended; dough will be shaggy. Cover bowl with plastic wrap. Let dough rest about 4 hours at warm room temperature, about 70 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil a work surface and place dough on it; fold it over on itself once or twice. Cover loosely with plastic wrap and let rest 30 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At least a half-hour before dough is ready, heat oven to 450 degrees. Put a 6-to-8-quart heavy covered pot (cast iron, enamel, Pyrex or ceramic) in oven as it heats. When dough is ready, carefully remove pot from oven. Slide your hand under dough and put it into pot, seam side up. Shake pan once or twice if dough is unevenly distributed; it will straighten out as it bakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover with lid and bake 30 minutes, then remove lid and bake another 15 to 30 minutes, until loaf is beautifully browned. Cool on a rack."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "No-Knead Bread Revisited", "description": "Mark Bittman talks with breadmaster Jim Lahey about possible improvements to his celebrated no-knead recipe.", "thumbnailUrl": "https://static01.nyt.com/images/2017/02/16/dining/16COOKING-NOKNEADBREAD3/16COOKING-NOKNEADBREAD3-mediumThreeByTwo440.jpg", "uploadDate": "2008-10-07T04:00:00.000Z", "duration": "PT5M28S"}, "link": "https://cooking.nytimes.com/recipes/1016271-speedy-no-knead-bread"}