{"@context": "http://schema.org", "@type": "Recipe", "name": "Cabbage and Spring Onion Quiche With Caraway", "description": "Spring onions found their way into several of this week’s quiches. For this one, I cooked the onions with cabbage – even a half a head of cabbage that has been lingering in your refrigerator will work here – until both vegetables were soft, lightly colored and sweet. I added caraway seeds to the mix because I love the flavor of caraway with cabbage. I  used 1/2 teaspoon,  just enough so that people noticed; they couldn’t recognize what it was (“Cumin?” they asked) right away, but they liked it. I made the filling a day ahead and let it sit uncovered overnight in the refrigerator.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/21/dining/Cabbage-and-Spring-Onion-Quiche-With-Caraway/Cabbage-and-Spring-Onion-Quiche-With-Caraway-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 6 generously", "recipeCuisine": "french, mediterranean", "recipeCategory": "dinner, lunch", "keywords": "halal, high fiber, kosher, nut-free, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 44}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 381, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "10 grams", "sodiumContent": "474 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "1 cup chopped spring onion", "1/2 medium cabbage (1 pound), cored and shredded (about 5 cups shredded cabbage)", "Salt to taste", "1/2 teaspoon caraway seeds", "2 egg yolks", "2 whole eggs", "1 (9-inch) <a href=\"https://cooking.nytimes.com/recipes/1016266-whole-wheat-pie-dough\">whole wheat pâte brisée pie crust</a> fully baked and cooled", "1/2 teaspoon salt", "Freshly ground pepper", "2/3 cup milk", "3 ounces Gruyère, grated, or 1 ounce Parmesan and 2 ounces Gruyère, grated (3/4 cup grated cheese)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil over medium heat in a large, heavy skillet and add onions. Cook, stirring often, until tender, about 5 minutes. Add a generous pinch of salt and continue to cook  3 to 5 minutes, until beginning to color. Add cabbage and cook, stirring often, until cabbage wilts, about 5 minutes. Add another pinch of salt and caraway seeds and continue to cook for another 5 to 10 minutes, until cabbage is sweet, cooked down, lightly colored and very tender. Taste, adjust salt, and add freshly ground pepper. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat together egg yolks and eggs in a medium bowl. Set tart pan on a baking sheet to allow for easy handling. Using a pastry brush, lightly brush the bottom of the crust with some of the beaten egg and place in the oven for 5 minutes. (The egg seals the crust so that it won’t become soggy when it comes into contact with the custard.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add salt (I use 1/2 teaspoon), pepper, and milk to remaining eggs and whisk together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread cabbage and onion in an even layer in the crust. Sprinkle cheese  evenly  on top. Very slowly pour in the egg custard over the filling. If your tart pan has low edges, you may not need all of it to fill the quiche, and you want to keep the custard from  spilling over. Place quiche, on baking sheet, in oven and bake for 30 to 35 minutes, until set and just beginning to color on top. Remove from oven and allow to sit for at least 10 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1016267-cabbage-and-spring-onion-quiche-with-caraway"}