{"@context": "http://schema.org", "@type": "Recipe", "name": "Standing Rib Roast", "description": "Like many Nebraskans, the poet Erin Belieu’s family members use any large gathering as a pretext for serving prime rib. Thanksgiving is no exception. When Ms. Belieu, a fourth-generation Nebraskan, was growing up in Omaha, her family served prime rib alongside the turkey — until they realized no one really liked the bird and dispensed with it altogether. Her grandfather was a cowboy, and the whole family was steeped in the state’s ranching culture, even when they eventually moved to the city.\nIn her house, the beef was minimally seasoned and roasted in a hot oven until the exterior was crackling and browned, the inside juicy and red. A little horseradish sauce might be served on the side, but her father always disapproved. Good beef doesn’t need it. “He thought sauce was for drugstore cowboys,” she said.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19NEBRASKA/19NEBRASKA-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, roasts", "keywords": "beef, garlic, rib roast, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 612}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 730, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "0 grams", "cholesterolContent": null, "fatContent": "63 grams", "fiberContent": "0 grams", "proteinContent": "37 grams", "saturatedFatContent": "26 grams", "sodiumContent": "527 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 (4 rib) standing rib roast, 7 to 8 pounds", "1 tablespoon coarse kosher salt", "1 teaspoon ground black pepper", "1 cup minced herbs (optional)", "4 garlic cloves, mashed to a paste (optional)", "2 teaspoons smoked paprika (optional)", "Extra-virgin olive oil, as needed (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat meat all over with paper towels, then season it all over with salt and pepper. If you want to make a smoky garlic-herb paste, combine herbs, garlic, smoked paprika and just enough olive oil to make a paste. Rub all over meat. Let meat come to room temperature for 2 to 3 hours depending upon how cold it was to begin with."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Place meat bone-side down in a roasting pan or on a rimmed sheet pan. Roast for 20 minutes, then turn heat to 350 degrees and continue to roast until the meat registers 115 degrees on an instant-read thermometer for rare, 125 for medium rare (it will continue to cook after you pull it out of the oven). Timing depends on your oven, your pan and the shape of your roast, so start checking after the meat has been in the oven for an hour, but it could take 1 1/2 hours or even slightly longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let meat rest at room temperature for 20 minutes before carving."}], "link": "https://cooking.nytimes.com/recipes/1016893-standing-rib-roast"}