{"@context": "http://schema.org", "@type": "Recipe", "name": "Rhode Island Clam Chowder", "description": "Clear clam chowder originated along the southern coast of Rhode Island, where it is a local delicacy much to be preferred over the creamier version of Boston to the north and the (to them) criminally tomato-hued style served in Manhattan to the south and west. Eating it recalls the feeling of pulling into Block Island after a long day at sea, scented with salt spray, and sliding into a clean bunk to sleep.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/08/10/magazine/10eat3/10eat3-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 404}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 343, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "6 grams", "proteinContent": "11 grams", "saturatedFatContent": "4 grams", "sodiumContent": "539 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["24 medium-size quahog clams, usually rated ‘‘top neck’’\nor ‘‘cherrystone,’’ rinsed", "1 tablespoon unsalted butter", "1/4 pound slab bacon or salt pork, diced", "1 large Spanish onion, diced", "2 large ribs celery, cleaned and diced", "12 red bliss potatoes, cubed", "1/2 cup dry white wine", "3 sprigs thyme", "1 bay leaf", "Freshly ground black pepper to taste", "1/4 cup chopped parsley."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the clams in a large, heavy Dutch oven, add about 4 cups water, then set over medium-high heat. Cover, and cook until clams have opened, approximately 10 to 15 minutes. (Clams that fail to open after 15 to 20 minutes should be discarded.) Strain clam broth through a sieve lined with cheesecloth or doubled-up paper towels, and set aside. Remove clams from shells, and set those aside as well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse out the pot, and return it to the stove. Add butter, and turn heat to \nmedium-low. Add the bacon or salt pork, and cook, stirring occasionally, until the fat has rendered and the pork has started to brown, approximately 5 to 7 minutes. Use a slotted spoon to remove pork from fat, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onions and celery to the fat, and cook, stirring frequently, until they \nare soft but not brown, about 10 minutes. Stir in potatoes and wine, and \ncontinue cooking until the wine has evaporated and the potatoes have just started to soften, approximately 5 minutes. Add 4 cups of clam broth, reserving the rest for another use. Add the thyme and the bay leaf."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Partly cover the pot, and simmer gently until potatoes are tender, \napproximately 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, chop the clams into bits that are about the size of the bacon dice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the potatoes are tender, stir in the chopped clams and reserved \nbacon. Add black pepper to taste. Let the chowder come just to a simmer, \nand remove from heat. Fish out the thyme and bay leaf, and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The chowder should be allowed to sit for a while to cure. Reheat it before \nserving, then garnish with chopped parsley. Serve with oyster crackers."}], "link": "https://cooking.nytimes.com/recipes/1016718-rhode-island-clam-chowder"}