{"@context": "http://schema.org", "@type": "Recipe", "name": "Blood Orange Flan", "description": "Winter is the time for citrus fruits — tangerines, clementines, grapefruit and oranges. The most exciting orange variety may well be the blood orange. Well known in the Mediterranean, blood oranges are now grown in California and Florida as well. The ruby red juice has great visual appeal. In this flan, the burnt sugar caramel helps balance their sweet, somewhat tropical flavor.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/02/12/dining/12KITCH_SPAN/12KITCH_SPAN-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "blood orange, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 358, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "0 grams", "proteinContent": "6 grams", "saturatedFatContent": "7 grams", "sodiumContent": "70 milligrams", "sugarContent": "57 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup sugar", "2 tablespoons blood orange juice, from about 1/2 orange", "2 cups half-and-half", "1 wide strip lemon peel, removed with a peeler ", "2 wide strips blood orange peel, removed with a peeler", "1/2 teaspoon coriander seeds", "6 cardamom pods, crushed", "1/2 teaspoon fennel seeds", "1/4 cup sugar", "2 drops pure vanilla extract", "1/2 cup blood orange juice, from 2 to 3 medium oranges", "3 large eggs", "3/4 cup sugar", "1/2 cup blood orange juice, from 2 to 3 medium oranges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the caramel layer: Have ready 6 four-ounce ramekins. Put sugar and 1/2 cup water in a wide saucepan over medium-high heat. Let mixture simmer without stirring until water has evaporated and sugar begins to brown, about 5 minutes. Shake pan and continue cooking until sugar is quite brown and beginning to burn. Off heat, carefully add 2 tablespoons blood orange juice. Stir with long-handled spoon to incorporate, then pour or spoon some of the caramel into bottom of each ramekin, dividing evenly. Caramel should set. (This can be done several hours ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the custard: Warm the half-and-half over medium heat in a saucepan until hot but not boiling. Add lemon peel, orange peel, coriander seeds, cardamom pods and fennel seeds. Add sugar and vanilla extract and stir to dissolve. Turn off heat and let mixture steep for at least 15 minutes. Whisk in blood orange juice. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat eggs in a mixing bowl. Temper the eggs by slowly whisking 1 cup of warm half-and-half mixture into the mixing bowl. Pour contents of mixing bowl back into the saucepan and combine with remaining half-and-half. Strain into a wide-mouth pitcher with spout. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Pour strained custard mixture into prepared ramekins, filling each to the top. Place ramekins in a roasting pan in a single layer and add hot water to the pan to reach halfway up sides of ramekins. Cover pan with foil and bake until custards have set, 30 to 45 minutes. To test custards, insert a paring knife. It should come out clean, and custard should not be wiggly. Remove from pan and cool to room temperature. Refrigerate ramekins, covered with plastic wrap, for at least 2 hours or overnight. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the blood orange caramel sauce (if desired): Simmer sugar and 1/2 cup water in a wide saucepan over medium heat. When water has evaporated and sugar begins to brown, swirl pan until caramel is very dark, almost burned. Off heat, carefully add 1/2 cup blood orange juice and stir well to dissolve caramel. Pour sauce into a serving pitcher. Cover and leave at room temperature until you are ready to serve (or chill if you are leaving it overnight)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove ramekins from refrigerator 15 minutes before serving. To serve, run a small knife around the inside edge of each ramekin to loosen custard. Invert ramekin over a shallow soup bowl or dessert plate. Carefully remove ramekin to reveal a custard topped with a caramel layer. Serve with blood orange caramel sauce, if desired."}], "link": "https://cooking.nytimes.com/recipes/1016027-blood-orange-flan"}