{"@context": "http://schema.org", "@type": "Recipe", "name": "Tostadas With Smashed Black Beans or Vaqueros", "description": "Refried heirloom vaquero beans add a special touch to these tostadas, but black beans work, too. I have always had a weakness for black bean tostadas. These are not unlike Oaxacan tlayudas, though this recipe doesn’t call for that dish’s signature extra-large corn tortillas. I used luxurious black and white vaqueros from Rancho Gordo for these, but black beans will also work well. Cook them yourself (don’t use canned), because you’ll need the delicious broth. I don’t refry them for as long as I normally would because I like them moist, and vaqueros are starchier than black beans.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/07/01/science/03recipehealth/03recipehealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 tostadas, serving 4 to 8", "recipeCuisine": "mexican", "recipeCategory": "dinner", "keywords": "fall, spring, summer, winter, gluten-free, halal, high fiber, kosher, low cholesterol, low sugar, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 98}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 181, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "7 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "25 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon grape seed oil or canola oil", "2 teaspoons cumin seeds, ground", "4 cups simmered black beans or vaquero beans, with liquid", "8 corn tortillas", "3/4 pound ripe tomatoes, finely chopped", "1 to 2 serrano or jalapeño chiles (to taste), minced", "2 slices red or white onion, finely chopped and soaked for 5 minutes in water to cover, then drained, rinsed, and drained on paper towels", "1/4 cup chopped cilantro (more to taste)", "1 teaspoon fresh lime juice (optional)", "1 small ripe Hass avocado, cut in small dice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil over medium heat in a large, heavy pan (I use a heavy nonstick pan for this) and add cumin. When it is sizzling, add beans with their liquid and turn up heat to medium-high. Cook beans, mashing with the back of your spoon and stirring often, until they are thick but still fairly moist, about 10 to 15 minutes. Remove from heat. Every so often a layer of thick broth should begin to stick to the pan. Stir that into the beans – it \nhas a lot of flavor. The smashed beans will continue to dry even after you remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the tortillas. For really crisp tortillas, heat one at a time (2 if you have a large enough microwave to fit 2 without the tortillas overlapping) in a microwave for 1 minute on full power. Flip tortilla over and microwave for 30 seconds to a minute more on full power, until crisp. You can also toast them in a dry pan or directly over the flame, but this will not crisp the tortillas, it will just char them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine tomatoes, chiles, onion, and cilantro. Season to taste with salt. Stir in lime juice and the avocado. Let sit for 15 to 30 minutes for the best flavor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread about 1/2 cup of the refried beans over each tortilla. Top with a\ngenerous spoonful of salsa. Place a handful of shredded lettuce or cabbage on top and if desired a little more salsa on the lettuce. Sprinkle on some white cheese, and serve."}]}