{"@context": "http://schema.org", "@type": "Recipe", "name": "Vermont Cheddar Mashed Potatoes", "description": "Early American colonists may not have eaten Cheddar at the first Thanksgiving, but they certainly began to make it in the traditional English manner soon thereafter. At some point the colonies were actually exporting domestic cheese to the mother country, where it was known as Yankee Cheddar. \nTo some, Cheddar is synonymous with Vermont, even if it is produced in several other states, too. For most, mashed potatoes are an absolute essential for a proper Thanksgiving table. Combining them seems natural, whether customary or not. Using two-year-old aged Vermont Cheddar, which is deeply flavored but not too sharp, gives these creamy mashed potatoes a subtle Cheddar presence, neither overwhelmingly cheesy nor gooey. (For everything you need to know to make perfect potatoes, visit our <a href=\"http://cooking.nytimes.com/guides/how-to-make-potatoes\">potato guide.</a>)", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/11/14/dining/vermont-cheddar-mashed-potatoes/vermont-cheddar-mashed-potatoes-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "", "keywords": "cheddar, russet potatoes, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 781}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 382, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "2 grams", "proteinContent": "13 grams", "saturatedFatContent": "15 grams", "sodiumContent": "452 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["3 pounds medium russet potatoes, peeled and quartered", "3/4 pound Vermont aged white Cheddar, grated", "1/2 teaspoon baking powder", "1 teaspoon kosher salt", "Black pepper, to taste", "Small pinch cayenne", "Pinch of grated nutmeg", "6 tablespoons unsalted butter, melted", "3/4 cup heavy cream, heated", "2 eggs, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil potatoes in well-salted water until tender, about 15 minutes. Drain well in a colander and place in the bowl of a stand mixer with a wire whisk attachment. Beat at medium speed for 2 to 3 minutes to allow steam to escape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off mixer and add cheese, baking powder, salt, pepper, cayenne and nutmeg. Beat again for a minute or so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter and cream, mixing slowly, then increase speed to medium and drizzle in beaten eggs. Stop and scrape down bowl with rubber spatula to make sure ingredients are incorporated evenly. Beat at medium-high speed until mixture is smooth, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately in a heated bowl. Alternatively, transfer potatoes to a 2-quart baking dish, cover with foil and let stand at room temperature. Reheat for 30 to 40 minutes at 350 degrees, until piping hot. (If you want the top browned, remove foil halfway through baking. Otherwise give the potatoes a stir before serving.)"}], "link": "https://cooking.nytimes.com/recipes/1016914-vermont-cheddar-mashed-potatoes"}