{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Skirt Steak With Garlic and Herbs", "description": "Grilling might just be the best way to cook up a skirt steak. The intense heat gives the succulent and flavorful cut a rich char that’s smoky and crisp at the edges. The trick is to get the fire hot enough and dry off any marinade before placing the meat on the grill. This will give you the deepest sear.  Here, the meat is marinated in a garlicky herb paste flecked with pickled pepperoncini chiles. Other pickled peppers will work, too, so feel free to substitute pickled jalapeños if that’s what you’ve got. Or use a fresh jalapeño and a dash of pickle juice to get a similar hot and vinegary punch. Lastly, be sure not to overcook the meat. Rare to medium rare guarantees tender beef.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/08/05/multimedia/clark-skirt-steak/clark-skirt-steak-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weeknight, steaks and chops", "keywords": "basil, garlic, scallions, skirt steak, thyme, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 594}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 341, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "0 grams", "proteinContent": "29 grams", "saturatedFatContent": "8 grams", "sodiumContent": "376 milligrams", "sugarContent": "0 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup basil leaves, more for garnish", "3 scallions, white and green parts, thinly sliced, more for garnish", "2 tablespoons lemon thyme leaves, more for garnish", "2 fat garlic cloves, roughly chopped", "2 tablespoons coarsely chopped peperoncini (1 to 2 peppers), pickled jalapeño or other pickled peppers", "2 1/2 teaspoons kosher salt", "Finely grated zest of 1 lemon", "Juice of half a lemon", "1/4 cup extra-virgin olive oil", "2 1/2 pounds skirt steak"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender or food processor, combine basil, scallions, lemon thyme, garlic, peperoncini, salt and lemon zest and juice. Pour olive oil over mixture; blend until it turns to paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using paper towels, pat steak dry and place in a large bowl; slather paste mixture all over meat. Cover and refrigerate at least 30 minutes or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light the grill or heat the broiler with the rack as close to the heat source as possible. Use a paper towel to pat steak dry. (You can leave some of the paste, but for the best sear, the meat should be dry when it hits the grill.) Grill meat over direct heat until char lines appear, and meat is done to taste, 3 to 5 minutes per side, or broil until charred, 2 to 5 minutes per side. Let rest for 5 minutes before slicing against the grain and serving, garnished with herbs and scallions."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Grilled Skirt Steak With Herbs", "description": "Melissa Clark shows how to grill and slice skirt steak, which she first marinates in a mixture of garlic and herbs.", "thumbnailUrl": "https://static01.nyt.com/images/2014/08/05/multimedia/clark-skirt-steak/clark-skirt-steak-mediumThreeByTwo440.jpg", "uploadDate": "2014-08-11T17:12:55.000Z", "duration": "PT3M44S"}, "link": "https://cooking.nytimes.com/recipes/1016728-grilled-skirt-steak-with-garlic-and-herbs"}