{"@context": "http://schema.org", "@type": "Recipe", "name": "Pink Risotto With Beet Greens and Roasted Beets", "description": "This rich-tasting risotto is decidedly pink (maybe it will be the key to getting your picky family member to eat vegetables!). Use a full-bodied vegetable stock if you are vegetarian; otherwise use a well seasoned chicken or turkey stock.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2019/01/02/dining/mrs-pink-risotto/mrs-pink-risotto-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 5 generously as a main dish", "recipeCuisine": "mediterranean", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 70}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 469, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "69 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "17 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1205 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["3/4 pound beets (1 bunch small), roasted", "1 bunch beet greens, stemmed and washed", "6 to 7 cups chicken or vegetable stock, as needed", "2 tablespoons extra virgin olive oil", "1/2 cup finely chopped onion", "1 1/2 cups Arborio or Carnarolli rice", "2 garlic cloves, minced or pressed", "1/2 cup red, rose, or dry white wine", "Salt", "Freshly ground pepper", "1 to 2 ounces Parmesan cheese, grated (1/4 to 1/2 cup, to taste)", "2 tablespoons finely chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a simmer in a saucepan. Season well and turn the heat to low. Stack the stemmed, washed greens and cut crosswise into 1-inch wide strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large nonstick frying pan or wide, heavy  saucepan and add the onion. Cook, stirring, until the onion begins to soften, about 3 minutes, and add the rice and garlic. Cook, stirring, until the grains of rice are separate and beginning to crackle, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the wine and cook over medium heat, stirring constantly. The wine should bubble, but not too quickly. You want some of the flavor to cook into the rice before it evaporates. When the wine has just about evaporated, stir in a ladleful or two of the simmering stock (about 1/2 cup), enough to just cover the rice. The stock should bubble slowly (adjust heat accordingly). Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock and continue to cook in this fashion, not too fast and not too slowly, stirring often and adding more stock when the rice is almost dry, for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the greens and the diced beets, and continue adding more stock, enough to barely cover the rice, and stirring often, for another 10 to 15 minutes. Taste a bit of the rice. Is it cooked through? It should taste chewy but not hard in the middle. Definitely not soft like steamed rice. If it is still hard in the middle, you need to continue adding stock and stirring for another 5 minutes or so. Now is the time to ascertain if there is enough salt. Add if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the rice is cooked through, add a generous amount of freshly ground pepper, and stir in another half cup of stock, the Parmesan and the parsley. Remove from the heat. The rice should be creamy; if it isn’t, add a little more stock. Stir once, taste and adjust seasonings, and serve."}]}