{"@context": "http://schema.org", "@type": "Recipe", "name": "Oats With Amaranth, Chia Seeds and Blueberries", "description": "Fresh blueberries are not in season at the moment, so I put my frozen organic wild blueberries to good use in this hearty mix. The chia and the amaranth pump up the nutritional value of this cereal -- both are high in calcium, amaranth is high in protein, and chia seeds are a great source of healthful omega-3s. They also contribute texture. For even more great texture, top the cereal with chopped toasted hazelnuts or almonds.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/11/science/11recipehealth/11recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 1", "recipeCuisine": "", "recipeCategory": "breakfast, lunch, quick", "keywords": "dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-fat, low-sodium, nut-free, vegetarian, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 90}, "recipeIngredient": ["1/4 cup regular or quick cooking steel-cut oats", "1 tablespoon amaranth seeds", "1 teaspoon chia seeds", "Salt to taste (I use a generous pinch)", "1 heaped tablespoon fresh or frozen blueberries, or more to taste  ", "3/4 cup water", "1 teaspoon honey or maple syrup, plus more as desired for drizzling", "Optional toppings: milk, chopped toasted skinned hazelnuts, chopped toasted almonds, grated apple or pear, freeze-dried blueberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The night before, stir together steel-cut oats, amaranth seeds, chia seeds, salt and blueberries in a medium microwave-proof bowl. Bring water to a boil and pour over mixture. Add honey or maple syrup and stir, then cover bowl with a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the morning, microwave mixture for 2 minutes on 100 percent power. Remove bowl from microwave and carefully remove plate (bowl will be hot and steam will rise from cereal). Stir mixture, cover again and return to microwave. Heat for 2 minutes more, or until mixture is no longer watery."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a serving dish and sprinkle on toppings of your choice."}], "link": "https://cooking.nytimes.com/recipes/1016110-oats-with-amaranth-chia-seeds-and-blueberries"}