{"@context": "http://schema.org", "@type": "Recipe", "name": "Kichri With Massour Dal", "description": "Kichri, a traditional Indian dish, is a delightful savory combination of dal and basmati rice cooked together. Lots of other cultures serve something similar: rice and pigeon peas throughout the Caribbean, or rice and brown lentils in many Middle Eastern countries. It can be served alone, with a dollop of yogurt, for breakfast or lunch, or as a side dish with grilled or roasted meats. Some cooks add more liquid for a kichri that is more on the soupy side. Sizzling the spices in ghee makes the kichri quite aromatic.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/02/28/dining/recipes-kichrimassourdal/recipes-kichrimassourdal-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "indian", "recipeCategory": "breakfast, dinner, lunch", "keywords": "chilies, lentils, rice, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 109}, "recipeIngredient": ["1 cup massour dal (split red lentils)", "2 cups basmati rice", "2 tablespoons ghee", "3 small hot green chiles, split lengthwise", "1/2 teaspoon cumin seeds", "4 cardamom pods", "1 2-inch stick cinnamon", "6 cloves", "6 black peppercorns", "1 small onion, diced fine", "1/2 teaspoon turmeric", "1 teaspoon salt", "2 cups plain yogurt (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick over lentils, then combine with rice in a medium mixing bowl. Add cold water and rinse several times, draining with a fine sieve, until water runs clear. Cover with cold water and soak for 1 hour, then drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat ghee in a saucepan over medium heat. Add chiles, cumin, cardamom, cinnamon, cloves and peppercorns. Let sizzle briefly until cumin seeds begin to brown. Add onion, stir to coat and cook until lightly browned, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add lentil-rice mixture, turmeric, salt and 4 cups water. Bring to a boil, cover and turn heat to low. Cook for 15 minutes, then let rest, covered, for 10 minutes. Fluff mixture before serving. Accompany with plain yogurt if you wish."}], "link": "https://cooking.nytimes.com/recipes/1016105-kichri-with-massour-dal"}