{"@context": "http://schema.org", "@type": "Recipe", "name": "Asparagus and Parmesan Omelet", "description": "This is a favorite omelet of mine. I make folded French omelets for one or two, and larger frittatas for a crowd.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": null, "totalTime": "PT15M", "recipeYield": "2 rolled omelets, serving 2", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 293, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "1 gram", "proteinContent": "19 grams", "saturatedFatContent": "6 grams", "sodiumContent": "423 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 thin or medium stalks asparagus, trimmed", "4 large or extra-large eggs", "Salt and freshly ground pepper", "1 tablespoon plus 1 teaspoon low-fat milk", "1 tablespoon plus 1 teaspoon freshly grated Parmesan", "1 tablespoon chopped fresh parsley, dill, chives, tarragon, or a combination", "1 tablespoon plus 1 teaspoon extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the asparagus until tender, about 5 minutes. Refresh with cold water, and pat dry. Cut into 1/2-inch slices and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break 2 eggs into a bowl and beat with a fork or a whisk until frothy. Add salt and pepper to taste (about 1/8 teaspoon salt) and 2 teaspoons milk. Whisk 2 teaspoons of the Parmesan and half the herbs into the eggs and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat an 8-inch nonstick omelet pan over medium-high heat. Add 2 teaspoons of the olive oil. When the oil feels hot when you hold your hand above it, pour in the eggs, scraping every last bit into the pan. Swirl the pan to distribute the eggs evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the omelet with the spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking. As soon as the eggs are set on the bottom, sprinkle half the asparagus down the middle of the eggs, then jerk the pan quickly away from you then back towards you so that the omelet folds over on itself. If you don’t like your omelet runny in the middle (I do), jerk the pan again so that the omelet folds over once more. Cook for a minute or two longer. Tilt the pan and roll out onto a plate. Repeat with the remaining eggs, Parmesan herbs, and asparagus, and serve."}]}