{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Heritage Turkey and Gravy", "description": "Heritage turkeys can be tricky to roast; the flesh is firmer than that of a supermarket bird. P. Allen Smith, the Southern cooking and lifestyle expert from whom this recipe is adapted, suggests a day in a brine sweetened with apple cider and then roasting the bird on a bed of rosemary. Roasted giblets and a chopped hard-boiled egg add texture and depth to his country-style gravy. “The eggs and giblets make it a little more rustic and a little more interesting,” he said. “It’s the gravy that saves that dry turkey.”", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19ARKANSAS/19ARKANSAS-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "10 to 16 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "main course, turkey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 117}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 663, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "2 grams", "proteinContent": "79 grams", "saturatedFatContent": "10 grams", "sodiumContent": "1257 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 16- to 20-pound heritage-breed turkey", "1 quart apple cider", "1 cup kosher salt", "2 lemons, quartered", "5 bay leaves", "1 medium apple, quartered but not peeled", "1 medium yellow onion, peeled and quartered", "6 garlic cloves", "1 bunch thyme", "8 tablespoons/1 stick unsalted butter, softened", "6 sprigs rosemary", "1 tablespoon salt", "1 tablespoon pepper", "1 cup red wine", "3 cups turkey or chicken stock, plus more if needed", "4 tablespoons cornstarch", "1 hard-boiled egg, chopped (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "A day ahead of roasting, remove neck and giblets from turkey. Mix cider, salt, lemons, bay leaves and 3 quarts water together in a large bowl or stockpot; stir to dissolve salt. Submerge turkey in the bowl or pot, cover and refrigerate overnight or up to 24 hours. Alternatively, put turkey and brine in two clean, unscented plastic garbage bags (one bag inside the other), tie well and place in a cooler with ice or ice packs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to roast, heat oven to 350 degrees. Rinse turkey and pat dry. Stuff apple, onion, garlic and most of the thyme into turkey. Lift skin at neck and gently use your hand to separate skin from breast meat. Rub half the butter under skin and slip in remaining thyme and two  rosemary sprigs. Use remaining butter to rub outside of bird, then sprinkle liberally with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a rack into a roasting pan and place four rosemary sprigs on top of the rack. Place bird on top of rosemary. Add turkey neck and giblets to bottom of pan. Take two pieces of heavy foil cut to the length of the pan. Fold the two together to create a single sheet to tent the bird."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to oven and roast. Roasting time will be 3 to 3 1/2 hours for an 18-pound bird. Add 10 minutes per pound for larger birds. Subtract 10 minutes per pound for smaller birds. Midway through cooking time, remove giblets and neck and add  wine and 1 cup water. Twenty minutes before roasting time is complete, begin to test for doneness with a digital probe thermometer inserted at the deepest part of the thigh. It is done when thigh registers 160 degrees. Remove bird from oven and transfer to a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place roasting pan over low heat on the stovetop and add 2 1/2 cups stock. Scrape all the browned turkey bits from bottom of pan. Skim 2/3 of the fat from top of drippings and discard. Bring drippings to a boil; reduce to a simmer. You may wish to strain at this point to remove stray bits, but they add character to the finished gravy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely chop giblets and neck meat. Dissolve cornstarch in 1/2 cup stock. Add slurry to drippings, stirring constantly, until thickened. If gravy seems too thick, whisk in a bit more stock. Add chopped egg and giblets and neck meat. Taste and season with salt and pepper."}]}