{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Rice and Black Quinoa With Cabbage, Red Pepper and Greens", "description": "The texture, flavor and look of black quinoa make for an interesting dish. \nThis is the kind of dish you can make on a whim if you make it a habit to freeze leftover grains. I used a combination of red chard and beet greens for this, but regular chard and kale would also work. I love the texture, flavor and look of the quinoa.\n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/02/04/science/04recipehealth/04recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dairy-free, halal, healthy, high fiber, kosher, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 255, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "8 grams", "proteinContent": "13 grams", "saturatedFatContent": "1 gram", "sodiumContent": "394 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 bunch of greens, such as chard or beet greens (about 3/4 pound), stemmed, leaves washed thoroughly in 2 rinses of water (keep stems if wide)", "2 to 3 teaspoons minced garlic (to taste)", "2 to 3 teaspoons minced fresh ginger (to taste)", "2 eggs", "2 teaspoons plus 2 tablespoons peanut, canola, rice bran or grape seed oil", "6 ounces tofu, diced", "", "1 medium red bell pepper, diced", "1/2 medium or small head cabbage, cored and shredded (about 4 cups) ", "1 bunch scallions, sliced, white and dark green parts separated", "1 1/2 cups cooked brown rice, either chilled or at room temperature", "2 1/2 cups cooked black quinoa, either chilled or at room temperature", "1 to 2 tablespoons soy sauce (to taste)", "1/4 teaspoon ground pepper, preferably white pepper", "1/2 cup chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using chard and the stems are wide, dice the thick part of the stems (discard the stringier, tapering part of the stems); you should have 1 to 1 1/2 cups diced stems. Stack greens and cut in slivers, or coarsely chop. You should have 7 or 8 cups chopped greens (they will lose volume when they wilt in the stir-fry)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine chopped garlic and ginger in a small bowl or ramekin. Beat eggs in a bowl and season with a pinch of salt. Prepare the other ingredients and place in separate bowls within arm’s reach of your burner. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or a 12-inch skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in 2 teaspoons of oil by adding it to the sides of the pan and swirling the pan. Make sure that the bottom of the wok or pan is coated with oil and add eggs, swirling the wok or pan so that the eggs form a thin pancake. Cook 30 – 60 seconds, until set. Using a spatula, turn pancake over and cook for 5 to 10 more seconds, until thoroughly set, then transfer to a plate or cutting board and quickly cut into strips, using the edge of your spatula or a knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl another tablespoon of oil into wok or pan and add tofu. Stir-fry for a minute or two, until it begins to color, and remove to a plate. Swirl in remaining oil and add garlic and ginger. Stir-fry no more than 10 seconds and add chard stems and red pepper. Stir-fry for 2 minutes, until crisp-tender, and add cabbage and light part of the scallions. Stir-fry for 1 minute and add greens. Stir-fry until leaves wilt, 1 to 2 minutes, and add rice and quinoa. Stir-fry, scooping up the grains with your spatula then pressing them into the hot wok or pan and scooping them up again, for about 2 minutes. Add soy sauce, the dark green part of the scallions, tofu, eggs and cilantro, stir for about 30 seconds, remove from heat and serve."}]}