{"@context": "http://schema.org", "@type": "Recipe", "name": "Spring Vegetable Stew", "description": "This is inspired by a lush Sicilian springtime stew called fritteda that also includes peas and fava beans (and much more olive oil). This one is simpler, but equally sweet and heady because of all the fennel and the spring onions. I like to serve it with bow tie pasta and a little Parmesan as a main dish, or with grains as part of a meal in a bowl. It also makes a delicious side dish with just about anything. The stewed vegetables will keep for about 3 days in the refrigerator, but the dish is best freshly made.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/05/03/science/05recipehealth/05recipehealth-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "Serves 4", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, lunch", "keywords": "dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, low-sodium, low sugar, nut-free, vegan, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 246, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "18 grams", "proteinContent": "11 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1093 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["Juice of 1 lemon", "6 baby artichokes", "2 tablespoons olive oil", "1/2 pound spring onions, white and light green parts only, chopped (about 1 1/2 cups)", "1/2 cup chopped celery, preferably from the heart of the bunch", "1 bulb green garlic, papery shells removed, chopped", "1 large fennel bulb (1 to 1 1/4 pounds), trimmed, quartered, cored, and chopped (3 to 3 1/2 cups chopped)", "Salt and freshly ground black pepper to taste", "1/2 cup water", "2 tablespoons chopped fennel fronds or chopped fresh mint (or a combination)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a bowl with water and add lemon juice. Trim artichokes, quarter them and place in the water as you go along."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil over medium heat in a large, heavy, lidded skillet or Dutch oven and add onions and celery. Cook, stirring, until tender, about 5 minutes. Add garlic, stir for about a minute until you can smell the fragrance of the garlic, and add fennel and a generous pinch of salt. Cook, stirring often, for 5 to 8 minutes more, until the fennel has softened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain artichoke hearts and add to the pan. Cook, stirring often, for 5 minutes. Add water and salt to taste and bring to a simmer. Cover, reduce heat to low, and simmer for 10 to 15 minutes, or until all of the vegetables are very tender and fragrant. Stir in chopped fennel fronds and/or mint and simmer for a few more minutes. Taste and adjust salt and pepper. Serve hot or warm, on its own as a side, tossed with pasta or as a topping for grains."}]}