{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggs With Gigante Beans and Harissa", "description": "A combination of soft beans, harissa-imbued vegetables, crisp-edged fried eggs and salty bits of cured tuna (or prosciutto), this unusual brunch dish is substantial and interesting enough to serve for dinner. While the chef Ignacio Mattos of Estela restaurant in New York City designed the dish around the plump gigante beans, any white bean, canned or freshly cooked, will work just as well. You can make the the beans and harissa mixture a few days ahead. But don't start toasting the bread until the last minute. You need it as crisp as possible to contrast with all the other soft textures.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/05/28/dining/28BRUNCH1/28BRUNCH1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "mediterranean", "recipeCategory": "breakfast, brunch", "keywords": "beans, eggs, harissa", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 34}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 901, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "115 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "27 grams", "proteinContent": "61 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1175 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 teaspoon whole cumin seed", "1 tablespoon extra-virgin olive oil", "1/2 medium onion, sliced", "1/2 green bell pepper, sliced", "2/3 cup harissa sauce or spread", "1 cup whole canned tomatoes with juices", "1 teaspoon red wine vinegar", "1 teaspoon sugar", "Kosher salt, as needed", "3 cups cooked or canned gigante beans, or other white beans, liquid reserved", "1/2 cup extra-virgin olive oil, more for drizzling", "Kosher salt and black pepper", "8 large eggs", "1/2 cup crème fraîche", "4 slices crusty bread, toasted", "1 small bunch cilantro", "Lemon juice, as needed", "1 (4-ounce) piece mojama (salt-cured tuna) or  or 4 ounces sliced prosciutto"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: In a large, dry skillet over medium heat, toast the cumin seeds until fragrant. Transfer to a mortar and pestle and crush lightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return skillet to medium-high heat. Add 1 tablespoon oil. Stir in onion and bell pepper; cook until vegetables are translucent but not tender, about 5 minutes. Stir in harissa, tomatoes (break up with a wooden spoon), vinegar, sugar, 1/4 teaspoon salt and the toasted cumin. Simmer over medium heat for 5 minutes. Taste and adjust seasonings, if necessary. (Sauce can be made up to 5 days ahead and stored in the refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the eggs and beans: Combine beans and 1/4 cup olive oil in a medium skillet over medium-low heat. Stir in a few tablespoons of reserved bean liquid. Cook gently until warmed through. Add salt to taste. If necessary, warm harissa sauce over medium heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large nonstick skillet over low heat. Add 1/4 cup olive oil. Crack in eggs; use spatula to push the whites back into shape. Cook gently, without moving, until yolks are warm but not set, 5 to 7 minutes. Sprinkle lightly with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread 2 tablespoons crème fraîche onto the center of four serving plates, then some warm harissa sauce. Top each with a slice of toast and drizzle with olive oil, then more harissa. Spoon beans over toast. Sprinkle with cilantro leaves, small sprigs and a light squeeze of lemon juice. Place two eggs on top of each helping of beans. Shave mojama generously over each plate or top with prosciutto, sliced into ribbons."}], "link": "https://cooking.nytimes.com/recipes/1016402-eggs-with-gigante-beans-and-harissa"}