{"@context": "http://schema.org", "@type": "Recipe", "name": "Butternut Squash Polenta With Sausage and Onion", "description": "In this savory, satisfying dinner, finely ground polenta and grated butternut squash are cooked together in one pot, the squash adding sweetness to the savory cornmeal. Then browned sausages and onions seasoned with rosemary and fennel seeds are spooned on top to round out the meal. It’s a dish simple enough for a weeknight, but the butternut squash makes it interesting enough to serve to guests.<br /><br />If you can’t find finely ground polenta, you can substitute coarse; just add another cup of water and plan on cooking the mixture for an extra 10 to 15 minutes. You could also substitute coarsely ground cornmeal for the fine polenta. Try to avoid using instant (or quick-cooking) polenta, but if it's all you can find, add the squash, salt and bay leaf to the boiling water 15 minutes before stirring in the polenta, so the squash gets a chance to soften. Just do not use the prepared polenta that comes in a tube. You can grate the squash the day before and store it in a plastic bag in the fridge.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/03/05/dining/05APPE_SPAN/05APPE_SPAN-mediumThreeByTwo440.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, polenta, sausage, squash", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 738}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 773, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "55 grams", "fiberContent": "3 grams", "proteinContent": "30 grams", "saturatedFatContent": "19 grams", "sodiumContent": "1266 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 teaspoons kosher salt, more as needed", "1 bay leaf", "1 cup fine polenta (not quick cooking)", "5 ounces seeded and peeled butternut squash, coarsely grated (1 cup)", "3 tablespoons unsalted butter", "Black pepper, as needed", "1 tablespoon extra-virgin olive oil, more as needed", "1 1/2 pounds sweet or hot Italian pork sausage, sliced into 1/4-inch rounds", "2 teaspoons minced rosemary ", "1 teaspoon fennel seeds (optional)", "2 small onions, peeled, halved, and sliced into 1/4-inch half moons", "Rosemary sprigs, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot over medium-high heat, combine 4 1/2 cups water, the salt and the bay leaf. Bring to a boil. Slowly whisk in polenta. Stir in squash. Reduce heat to medium-low and simmer, stirring frequently, until polenta and squash are very tender, 20 to 30 minutes. If the mixture gets too thick while cooking, add a little more water to the pot. Stir in butter and black pepper. Taste and adjust seasoning if needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While polenta cooks, heat 1 tablespoon oil in a large skillet over medium-high heat. Add sausage, rosemary and fennel seeds if using. Cook, stirring occasionally, until the meat is golden and cooked through, 7 to 10 minutes. (Do this in batches if necessary, adding oil if the pan looks dry.) Transfer to a paper-towel-lined plate. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add more oil to the skillet if it looks dry, then add onions. Cook, stirring occasionally, until onions are tender and golden, 10 to 15 minutes. Return sausage to pan and stir to heat through. Spoon polenta into bowls and top with sausage and onion, garnished with rosemary if you like. "}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Butternut Squash With Polenta", "description": "Cooked together slowly, squash and polenta serve as a sweet and silky bed for caramelized onions and savory sausage.", "thumbnailUrl": "https://static01.nyt.com/images/2014/03/05/dining/05APPE_SPAN/05APPE_SPAN-mediumThreeByTwo440.jpg", "uploadDate": "2014-02-28T18:44:36.000Z", "duration": "PT2M38S"}, "link": "https://cooking.nytimes.com/recipes/1016103-butternut-squash-polenta-with-sausage-and-onion"}