{"@context": "http://schema.org", "@type": "Recipe", "name": "Lime Squares With Raw Sugar Shortbread", "description": "In the tropical climate of the Yucatán Peninsula, there are three different types of lime, and too many other citrus varieties to count. But really, this tart dessert was born in the United States as the ever-reliable lemon square. At Hartwood, the Mexican-modern-American restaurant in the beach town of Tulum, the crust is made with grated piloncillo, the traditional sugar there. (Raw sugar stands in nicely for home cooks elsewhere.) The crust is also scented with chamomile, which grows in huge thickets in the Yucatán. Adding half a cup of sweetened shredded coconut to the dough for the crust is also a nice touch.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/03/12/dining/20140312-TULUM-slide-QR50/20140312-TULUM-slide-QR50-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "About 12 bars", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, lime", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 92}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 303, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "5 grams", "sodiumContent": "246 milligrams", "sugarContent": "26 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 cups all-purpose flour", "1/2 cup raw sugar, preferably Sugar in the Raw brand", "1 teaspoon salt", "1 stick (4 ounces) cold unsalted butter, cubed  ", "1/3 cup all-purpose flour", "2 tablespoons dried chamomile (chamomile tea is fine), plus extra for garnish", "Freshly grated zest and juice of 4 to 5 limes (3/4 cup juice), combined", "4 large eggs", "1 cup granulated sugar", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Combine flour, sugar and salt in a bowl and toss to combine. Rub in butter until dough comes together in clumps; add a trickle of cold water if mixture seems dry. Press dough into a 9-by-13-inch baking pan. Prick all over with a fork and refrigerate for at least 30 minutes, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Bake chilled dough until golden and toasted, 15 to 20 minutes. Leave the oven on."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the topping: Sift flour and chamomile together, using the sifter to break up clumps and chamomile flowers. Repeat to eliminate any chamomile leaves or buds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the lime zest from the juice; discard zest. In a bowl, whisk eggs together. Slowly whisk in strained lime juice, sugar and salt. Add dry ingredients and mix well. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour topping over crust and bake for 20 minutes, then check to see if filling has set. If loose, bake another 5 minutes and check again. (Keep in mind that the filling will continue to thicken as it cools.) Once cooled, cut into squares or bars. Serve dusted with chamomile flowers."}], "link": "https://cooking.nytimes.com/recipes/1016119-lime-squares-with-raw-sugar-shortbread"}