{"@context": "http://schema.org", "@type": "Recipe", "name": "Barley Risotto With Greens and Seared Scallops", "description": "A great vegetarian entree for fall, this creamy risotto can be served with scallops or seared halibut fillets; you could also add more leafy greens and top it with with slivers of aged cheese. Using barley instead of rice produces a nutty chew that works with the sweetness of root vegetables. You can use less butter and cream than the recipe calls for, but the end result won’t be quite as deliciously runny and rich. The Saltry restaurant, in Halibut Cove in southern Alaska, is reachable only by boat or seaplane. Like a culinary Brigadoon, it appears every summer and evaporates each fall — and has done so since 1984, when Marian Beck, a native of the area, decided it was time for the food of Alaska’s wilderness to move beyond canned corned beef hash and smoked fish. Modern dishes like this risotto, beet salad with savory sesame brittle, and black cod with dashi and paprika oil now sit comfortably on the menu with classics like house-pickled salmon, smoked cod chowder, and oysters and mussels raised just yards offshore.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/09/10/dining/20140910-HALIBUT-slide-X9AU/20140910-HALIBUT-slide-X9AU-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "barley, halibut, risotto, rutabaga, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 52}, "recipeIngredient": ["3 tablespoons olive oil", "1 large sweet potato or baking potato, peeled and roughly diced", "1 medium rutabaga, peeled and roughly diced", "1 medium yellow onion, peeled and roughly diced", "1 large carrot, peeled and roughly diced", "2 large garlic cloves, peeled and crushed", "1 shallot, peeled and roughly sliced", "2 teaspoons salt, more to taste", "2 cups heavy cream", "1 tablespoon ground coriander", "2 bay leaves", "Freshly squeezed juice of 1 lemon, more to taste", "8 ounces (2 sticks) butter", "2 medium yellow onions, peeled and minced", "1 tablespoon salt, more to taste", "1 pound pearled barley, picked over and rinsed", "2 cups vegetable stock", "3 bay leaves", "1 (12-ounce) bunch Swiss chard", "Vegetable oil, like grapeseed or canola", "6 7-ounce skinless halibut fillets or 30 plump dry sea scallops", "1/4 cup freshly chopped parsley, basil or cilantro, plus extra for garnish", "Sliced pickled hot peppers, like jalapeño, cherry or banana (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium-size heavy pot, heat oil over medium-low heat just until shimmering. Add vegetables, including garlic and shallots, sprinkle with salt and cook over low heat, stirring, until slightly softened, 10 to 12 minutes. The vegetables should not brown; adjust the heat as needed. Add cream, then add water until vegetables are just covered with liquid. Add coriander and bay leaves. Bring to a boil, reduce to a simmer and cook, uncovered, 25 minutes or until vegetables are very soft. Turn off heat and set aside until cool enough to handle. Remove bay leaves and discard. Purée until smooth in a blender or with an immersion blender. Add lemon juice, taste, and season with salt and more lemon juice. (Can be made up to 2 days in advance and kept refrigerated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium-size heavy pot with a tight fitting lid, melt butter over medium heat until bubbling. Add onion, sprinkle with salt and cook over low heat, stirring, until translucent and softened, 10 minutes. The onions should not brown; adjust the heat as needed. Add barley and cook, stirring constantly, until butter is bubbling again and barley is completely coated. Add stock and bay leaves, reduce heat to very low, cover and let cook, undisturbed, 15 minutes. Stir well and check the liquid: if the pot seems to be drying out, add 1/4 cup water. Repeat every 10 minutes until barley is very tender but not mushy, 35 to 50 minutes. Remove bay leaves and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash chard, then rim off and discard damaged leaves and lower stems. Cut leaves across into wide ribbons. In a large pot, heat 2 tablespoons vegetable oil until shimmering. Add chard ribbons and cook, stirring, just until softened, 3 minutes. Add hot cooked barley to pot and stir. Add vegetable purée and stir. Heat through over low heat, stirring often. Add water if risotto becomes too thick; the finished texture should be soft, creamy and slightly runny. Taste and season with salt and lemon juice. (Recipe can be made up to this point several hours in advance. Set risotto aside until ready to serve.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, sprinkle halibut or scallops on both sides with salt. Heat a heavy pan (preferably cast iron) over medium-high heat and lightly coat with vegetable oil. Working in batches if necessary, place halibut or scallops in the pan and sear about 3 minutes, until lightly browned. Turn, reduce heat to medium, and cook about 4 minutes longer, turning as needed, until opaque in the center and golden brown on both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, stir parsley into hot risotto and spoon into shallow bowls. Top with halibut or scallops, more parsley, and a few slices pickled peppers (if using)."}], "link": "https://cooking.nytimes.com/recipes/1016799-barley-risotto-with-greens-and-seared-scallops"}