{"@context": "http://schema.org", "@type": "Recipe", "name": "Chunky Avocado-Papaya Salsa", "description": "This is based on a recipe in Kim Sunée’s wonderful new book, “A Mouthful of Stars” (Andrews McMeel). Her recipe is more of a salad, a fusion of Thai and Mexican flavors. I loved the idea of combining avocado and papaya, two subtle, creamy fruits, with crunchy, bright-tasting Asian pears and spicy chiles. The first time I saw the recipe I wanted to test it right away, but I didn’t have Asian pears. So I used an apple, and loved it. It’s the sweet, crunchy fruit that does the trick, and apples and Asian pears both work.  There are onions in the original  recipe but I’ve made them optional.\n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/15/science/17recipehealth/17recipehealth-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "mexican, thai", "recipeCategory": "salads and dressings", "keywords": "appetizer, dairy-free, gluten-free, halal, kosher, low-carb, low cholesterol, low-fat, low-sodium, low sugar, nut-free, vegan, vegetarian, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 105, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "5 grams", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "241 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 medium-size ripe Hass avocados, halved, pitted and cut in small dice", "1 small ripe papaya, halved, seeded, peeled and cut in small dice (about 2 cups dice)", "1 tart apple, unpeeled, or Asian pear, peeled if desired, cored and cut in small dice", "1/4 cup freshly squeezed lime juice", "1 fresh red or green serrano chile, seeded and thinly sliced or minced, or more to taste", "1/4 cup chopped cilantro", "2 tablespoons chopped fresh mint", "1/2 small red onion, diced small, soaked for 5 minutes in water to cover, drained and rinsed (optional)", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine diced avocados and papaya in a medium bowl. Add remaining ingredients and toss together. Season to taste with salt. Serve as a salad or a salsa."}], "link": "https://cooking.nytimes.com/recipes/1016245-chunky-avocado-papaya-salsa"}