{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuck-Pot Rice With Yogurt and Spices", "description": "Rice isn’t actually “ruined” when it sticks to the bottom of the pot. Indeed, in a lot of places and across the Middle East, stuck-pot rice is encouraged for its sticky, crusty deliciousness. This is a dead-easy way to cook it, before serving with yogurt and spices. It’s homey and delicious, beautiful and fragrant, all at once.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/28/dining/stuckpotrice/stuckpotrice-articleLarge.jpg", "totalTime": "PT55M", "recipeYield": "4 to 6 servings.", "recipeCuisine": "middle eastern", "recipeCategory": "brunch, dinner, lunch", "keywords": "main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 102}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 259, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "161 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["Salt", "1 1/2 cup basmati rice, well rinsed", "Freshly ground black pepper", "1/4 cup peanut oil, or neutral oil like grape seed or corn oil", "1/4 cup plain yogurt, preferably whole-milk", "1 tablespoon lime juice", "1 tablespoon good curry powder."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a medium pot with lightly salted water, and bring to boil. Stir in rice, return to boil and lower heat so water is at a lively simmer. Cook undisturbed 5 minutes; drain, and set aside. Rice will be only partly done. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl whisk together 2 tablespoons oil, the yogurt, lime juice and curry powder. Season to taste with salt and pepper, and whisk until smooth. Add rice, and toss gently to coat with yogurt mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 remaining tablespoons oil in a large heavy-bottom pot with tight-fitting lid, and turn heat to medium-high. Add rice mixture, pressing it down in pan with fork. Wrap clean kitchen towel around lid of pot so it completely covers inside of lid; gather corners on top so they do not fall anywhere near stove. Place lid on pot, sealing tightly. Mixture will sizzle immediately. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When rice and spices are fragrant - in 3 to 5 minutes - turn heat down very low. Cook undisturbed about 30 minutes; rice should smell toasty but not burned. Remove from heat, and let sit 5 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove lid and cloth, and turn pot upside down over a platter. If rice comes out in a single crust, terrific. If not, use a spatula to scrape crisp pieces out of pan and onto remaining rice. Season to taste with salt and pepper, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1016126-stuck-pot-rice-with-yogurt-and-spices"}