{"@context": "http://schema.org", "@type": "Recipe", "name": "The Sanctimonious Kid", "description": "At many bars, cocktails tend to come these days in boat-size portions. But some New York City bars, like the one at Wylie Dufresne’s Alder restaurant, offer so-called short drinks that are about the half the size of a regular serving. This one, named for an Old West bandit, is made ahead of time and dispensed from a tap at Alder. At home, you can mix it yourself — and double the measurements if you want the full-size version. Infusing your own tequila requires a little forethought but not much work, and produces enough to spice up future drinks.", "author": {"@type": "Person", "name": "Robert Simonson"}, "image": "https://static01.nyt.com/images/2014/03/05/dining/05SHORT2/05SHORT2-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "1 short drink", "recipeCuisine": "", "recipeCategory": "cocktails", "keywords": "pimm's no. 1, tequila", "aggregateRating": null, "recipeIngredient": ["6 ounces 100 percent agave blanco tequila", "4 to 6 bay leaves", "3/4 ounce Pimm’s No. 1", "3/4 ounce fresh-squeezed blood orange juice plus a twist of blood orange, for garnish", "1/4 ounce fresh-squeezed lime juice", "Club soda"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the tequila and bay leaves into a blender and blend at a high speed until you can’t see any big chunks of bay leaf. Strain into a jar and cover. Allow to settle overnight. The next day, carefully pour the clarified tequila into another jar and discard the settled bay leaves. (You will lose about 5 percent of the tequila with the leaves.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing glass three-quarters full of ice, pour 3/4 ounce of the infused tequila. (Save the remainder for future drinks.) Add the Pimm’s, orange juice and lime juice and shake until chilled, about 30 seconds. Strain into a rocks glass filled with ice. Top with club soda and the orange twist."}], "link": "https://cooking.nytimes.com/recipes/1016108-the-sanctimonious-kid"}