{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Cooked Red Chile Turkey", "description": "Anyone who has spent time in New Mexico knows that fiery red chile sauce, made with local dried chiles, finds its way into most meals there, enhancing plates of huevos rancheros or enchiladas. But just as often, it is the base for a meat stew, usually beef, pork or lamb. The dish is known as carne adovada, and it is insanely good.\nYes, there probably is a roasted turkey in most homes for Thanksgiving, and maybe a steaming pot of tamales. But the thought occurred to me that turkey thighs (the tastiest part of the bird) simmered in red chile would be a welcome substitute. It turns out I was right. Slowly braised for 2 hours, this spicy turkey is succulent and tender.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19NEWMEXICO/19NEWMEXICO-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "8 to 10 servings", "recipeCuisine": "southwestern", "recipeCategory": "dinner, lunch, roasts", "keywords": "garlic, new mexico chiles, turkey thighs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 128}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 370, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "1 gram", "proteinContent": "45 grams", "saturatedFatContent": "5 grams", "sodiumContent": "722 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 large turkey thighs, about 6 pounds", "Salt and pepper", "6 ounces dried New Mexico chiles, about 24 large pods", "2 tablespoons vegetable oil", "1 large onion, finely diced", "1/2 teaspoon coriander seeds, toasted and ground", "1/2 teaspoon cumin seeds, toasted and ground", "8 garlic cloves, minced", "1 bay leaf", "Cilantro sprigs (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season turkey generously with salt and pepper, then set aside at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Quickly rinse chiles and pat dry. Put chiles on a baking sheet in one layer and bake just until fragrant and lightly toasted, about 5 to 7 minutes, then cool. (Alternatively, toast chiles in batches in a dry cast-iron pan over medium-high heat, turning them frequently.) Split chiles lengthwise with a sharp knife. Remove and discard stems and seeds (wear gloves if you have sensitive skin)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put chiles in a saucepan, cover with 4 cups water and bring to a boil. Turn heat to low and simmer for 10 minutes, then let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chiles from cooking liquid and place in a blender jar. Add a cup or so of cooking liquid and purée to a smooth paste, adding more liquid if the mixture seems very thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large wide skillet over medium-high heat. Add oil, then add onion and a little salt. Cook, stirring occasionally, until onion is softened, 5 minutes or so. Lower heat as necessary to keep onion from browning. Add coriander, cumin, garlic and bay leaf, then add chile purée and let simmer for 8 to 10 minutes, stirring occasionally. You should have about 4 cups sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put seasoned turkey in a Dutch oven or deep roasting pan. Pour red chile sauce over, making sure meat is well coated. Cover and bake at 400 degrees for 30 minutes, then reduce heat to 350 degrees and bake for 1 1/2 hours, until turkey falls from the bone when probed with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, put turkey on a platter and cut meat into large pieces. Nap with sauce and garnish with cilantro sprigs. For more casual dining, serve directly from pot."}], "link": "https://cooking.nytimes.com/recipes/1016915-slow-cooked-red-chile-turkey"}