{"@context": "http://schema.org", "@type": "Recipe", "name": "Fettuccine With Brussels Sprouts, Lemon and Ricotta", "description": "Brussels sprouts love a whisper of lemon, which is what the zest provides in this combo. The ricotta becomes creamy when you add a small amount of cooking water from the pasta to it, but you have to serve this right away or the ricotta will stiffen up again. I used gluten free Le Veneziane fettuccine made with cornmeal, and thought the color and texture were very good. It only took 5 to 6 minutes to cook. It works equally well with standard pasta.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/02/25/science/27recipehealth/27recipehealth-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 4", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner, quick", "keywords": "fall, winter, gluten-free, halal, healthy, high fiber, kosher, low sugar, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 290}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 497, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "73 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "6 grams", "proteinContent": "20 grams", "saturatedFatContent": "5 grams", "sodiumContent": "509 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["3/4 pound Brussels sprouts (about 16)", "2 tablespoons extra virgin olive oil", "Salt and freshly ground pepper to taste", "1/2 cup ricotta", "1 garlic clove, mashed with a pinch of salt in a mortar and pestle or put through a press", "2 teaspoons finely grated or chopped lemon zest (I use a microplane for this)", "2 tablespoons minced chives or parsley, or a combination", "1 ounce Parmesan, grated (1/4 cup)", "12 ounces fettuccine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating water for pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim bottoms of Brussels sprouts and quarter lengthwise or slice. Heat oil over high heat in a large, heavy skillet and add Brussels sprouts. Sear for about a minute without stirring, then turn the heat to medium-high, add salt and pepper to taste and stir or toss in the pan until tender and the edges are seared light brown, about 5 minutes. Some of the leaves will detach and get black, but don’t worry, you can discard them. Remove from heat and transfer to a bowl or plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When water comes to a boil, salt generously and add pasta. While pasta is cooking, mix together ricotta, garlic, lemon zest and chives (or parsley and chives) in a large bowl. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When pasta is cooked al dente (see timing instructions on package but check a minute before indicated time), remove 1/4 cup of the pasta water. Mix 2 to 4 tablespoons with ricotta. It should have the consistency of cream. Add a little more water if it doesn’t. Drain the pasta and toss with Brussels sprouts, ricotta mixture and Parmesan. If pasta seems dry, toss with a little more of the cooking water or another tablespoon of olive oil. Serve at once."}], "link": "https://cooking.nytimes.com/recipes/1016076-fettuccine-with-brussels-sprouts-lemon-and-ricotta"}