{"@context": "http://schema.org", "@type": "Recipe", "name": "Warm Lentil Salad With Goat Cheese", "description": "Even people who swear they don’t abide beans find pleasure in the distinctive, profound flavor of lentils. They also cook quickly, and you want them on the al dente side for this salad. That means they’ll be ready in 25 minutes, still a long enough simmering time to yield a savory broth.\n\nGoat cheese and lentils make a particularly good pairing; the little earthy-sweet legumes love a salty-umami complement (that’s why you so often see them paired with sausage and other cured pork products), and goat cheese fits the bill. Here the combination is especially cozy, as the cheese melts into the warm lentils, bathing them in a creamy dressing.\n\nLentils and vinegar also marry well. The key here is to add the dressing while the lentils are still warm, even if you don’t plan on serving the salad warm.\n\nI spoon the mixture onto a bed of wild arugula, though regular will do if you can’t find the sharper tasting, wispy wild variety.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/10/10/science/14recipehealtharugula/14recipehealtharugula-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "arugula, garlic, goat cheese, lentils, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 269}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 427, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "9 grams", "proteinContent": "22 grams", "saturatedFatContent": "4 grams", "sodiumContent": "335 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["2 cups/14 ounces green, brown or black lentils, rinsed and picked over", "1 small or 1/2 large onion, halved", "3 garlic cloves, minced", "1 bay leaf", "Salt", "1/4 cup red wine vinegar or sherry vinegar", "1/3 cup extra-virgin olive oil", "1/4 cup broth from the lentils", "3 to 4 ounces goat cheese (to taste), crumbled", "Black pepper", "1/4 cup minced chives or parsley, or both", "2 cups wild or baby arugula"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot, combine lentils, onion, two of the garlic cloves and the bay leaf  with 6 cups water. Bring to a gentle boil over medium-high heat. Add salt to taste, cover, reduce heat to low and simmer 25 minutes, until lentils are cooked through but still have some texture (they should not be mushy). Taste and adjust salt. Using tongs, remove onion and bay leaf. (You may cook lentils up to four days ahead and store in the refrigerator. Bring back to a simmer and proceed with recipe.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or measuring cup, mix together vinegar, remaining garlic, salt to taste and olive oil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a strainer over a bowl and carefully drain lentils, reserving 1/4 cup of the broth. Return lentils to the pot. Whisk reserved broth into the dressing, then stir dressing into lentils. Add goat cheese and stir until it has melted into the lentils. Season to taste with pepper. Stir in herbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a platter, salad plates or wide bowls with arugula. Top arugula with the lentils. Serve warm."}]}