{"@context": "http://schema.org", "@type": "Recipe", "name": "Cabbage and Pepper Chakchoukah", "description": "This is a spicy Tunisian pepper stew with poached eggs, called chakchoukah. In this version, cabbage is substituted for some of the peppers in the traditional version.\n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/01/27/health/27recipehealth/27recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, lunch, weekday", "keywords": "appetizer, main course, side dish, cabbage, cumin, tomato, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 132}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 160, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "669 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 large onion, quartered lengthwise, then sliced thin across the grain", "1 large green bell pepper, quartered lengthwise, seeded and sliced thin across the grain", "1 large red bell pepper, quartered lengthwise, seeded and sliced thin across the grain\t", "Salt to taste", "1/2 medium or 1 small head cabbage, cored and shredded (about 4 cups)", "2 serrano chiles or jalapeños, seeded and minced", "4 garlic cloves, minced", "1 to 2 teaspoons harissa, to taste, or 1/4 to 1/2 teaspoon cayenne", "1 teaspoon lightly toasted coriander seeds, ground", "1 teaspoon lightly toasted cumin seeds, ground", "1/2 teaspoon caraway seeds, ground", "1 28-ounce can chopped tomatoes, with juice", "Freshly ground pepper", "1/4 cup chopped fresh parsley or cilantro, or a mix", "6 eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil over medium heat in a large heavy casserole or skillet, or in an earthenware casserole set on a flame tamer. Add the onion and cook, stirring often, until golden, about 10 minutes. If they begin to stick to the pan add a generous pinch of salt. Add another generous pinch of salt and the peppers and cook, stirring often, until they begin to soften, about 5 minutes. Add the garlic and cook, stirring, until fragrant, 30 seconds to a minute. Add the cabbage, chiles, coriander seeds, cumin and caraway and cook, stirring, until cabbage has wilted, about 5 minutes. Stir in the harissa or cayenne, salt and pepper, stir together and add the tomatoes. Bring to a simmer, cover partially, reduce heat to medium-low and cook, stirring from time to time, until tomatoes have cooked down and the mixture is thick and fragrant, about 20 to 25 minutes. Stir in all but 2 teaspoons of the parsley or cilantro, taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the back of your spoon, make 6 depressions in the vegetables. Break an egg into each depression. Cover and cook for 5 to 6 minutes, until the eggs are set. Sprinkle the eggs with salt, pepper and the remaining parsley and serve."}], "link": "https://cooking.nytimes.com/recipes/1016004-cabbage-and-pepper-chakchoukah"}