{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Baby Turnips With Spring Onions, Green Garlic and Tofu", "description": "The fresh ginger I’m finding at springtime farmers’ markets is new and juicy, like the spring garlic and onions. I’m sure this is going to be just one of many springtime stir-fries, but right now it’s a favorite. It’s inspired by an irresistible bunch of baby turnips I bought at a Sunday farmers’ market. The turnips were no bigger than a small round radish, but their greens were lush – I had about 6 cups of leaves after I’d stripped them from the stems. Sweet spring onions and green garlic contrast beautifully with the bitter flavor of the turnip greens. \n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/05/03/science/09recipehealth/09recipehealth-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 3 (4 if there are other dishes)", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "dairy-free, high fiber, kosher, low cholesterol, vegan, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 200, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "4 grams", "proteinContent": "15 grams", "saturatedFatContent": "1 gram", "sodiumContent": "498 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["7 ounces firm tofu (1/2 of a14-ounce box), drained and cut in dominoes (about 1/4-inch thick by 2 inches long) ", "1 bunch baby turnips, with greens (about 1 pound total)", "1 to 2 tablespoons soy sauce (to taste)", "1 tablespoon Chinese cooking sherry (Shaoxing rice wine) or dry sherry", "1/4 cup chicken stock, vegetable stock or water", "1 teaspoon honey or agave nectar", "2 tablespoons peanut, canola, rice bran, sunflower or grape seed oil", "Salt and freshly ground pepper to taste", "1 bulb green garlic, papery shells removed, minced", "1 tablespoon minced ginger", "1 bunch spring onions or 2 to 3 bunches scallions, sliced, white and light green parts only, sliced (about 1 1/4 cups)", "1/2 cup coarsely chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain and dry tofu slices on paper towels. In a small bowl or measuring cup combine soy sauce, rice wine or sherry, stock or water, and honey or agave nectar. Have all ingredients within arm’s length of your wok."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away greens from baby turnips. Scrub turnips and if very small, cut in half; if larger than a Ping-Pong ball, quarter. Stem greens, wash leaves in 2 changes of water and chop coarsely. Set aside near your wok."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in 1 tablespoon of the oil by adding it to the sides of the pan and swirling the pan, then add tofu and stir-fry until lightly colored, 1 to 2 minutes. Remove to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl in remaining oil, add garlic and ginger and stir-fry for no more than 10 seconds. Add onions and stir-fry for 1 minute. Add turnips and stir-fry for another minute or 2, then add salt and pepper, toss together and add soy sauce mixture.  Add greens and stir-fry for 1 to 2 minutes, until vegetables are crisp-tender. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return tofu to the wok along with the cilantro. Stir-fry for 1 minute and remove from heat. Serve with hot grains or noodles."}]}