{"@context": "http://schema.org", "@type": "Recipe", "name": "Bulgur and Chickpea Salad With Roasted Artichokes", "description": "Quartering and roasting the artichokes instead of steaming them whole intensifies flavor and cuts down on preparation time for this salad.\nMy initial idea here was to stuff the artichokes with the salad and steam them. But that took a lot of time, and diminished the flavor of the salad. So I trimmed and cut the artichokes into wedges, tossed them with olive oil and roasted them. The roasted artichokes tasted so wonderful that I’ll be inclined to cook them this way from now onhereon in. They are perfect served atop or on the side of this lemony grain, chickpea and herb salad.\n<i>The bulgur will keep for 4 or 5 days in the refrigerator, and can be frozen. The artichokes can be roasted several hours or even a day ahead but are best when freshly roasted.<i>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/05/science/08recipehealth/08recipehealth-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "serves 4", "recipeCuisine": "mediterranean", "recipeCategory": "salads and dressings", "keywords": "appetizer, main course, side dish, dairy-free, halal, high fiber, kosher, low cholesterol, nut-free, vegan, vegetarian, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 40}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 523, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "18 grams", "proteinContent": "14 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1147 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 medium-size or 2 large artichokes , trimmed", "1 lemon, cut in half", "3 tablespoons extra virgin olive oil", "Salt and freshly ground pepper", "1 cup medium (No. #2) bulgur", "Salt, preferably kosher salt, to taste", "2 cups water", "1/4 cup fresh lemon juice", "1 to 2 garlic cloves, minced", "1 teaspoon Dijon mustard", "1/3 cup extra- virgin olive oil", "1/4 cup finely chopped parsley, or  (more to taste)", "2 tablespoons chopped chives or green onions", "2 tablespoons finely chopped fresh mint", "1 15-ounce can chick peas, drained and rinsed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Trim artichokes and cut medium artichokes into quarters, cut large ones into 6ths or 8ths, rubbing cut surfaces with lemon and placing the pieces in a bowl of water acidulated with lemon juice as you work."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain artichokes and dry as thoroughly as you can with paper towels. Line a sheet pan with parchment paper and toss artichoke wedges with the olive oil and salt and pepper to taste. Take care to coat all cut surfaces with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in oven and roast for 30 to 40 minutes, turning artichokes every 10 minutes, until the hearts are tender and edges of the leaves are browned, even charred."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make bulgur salad. Place bulgur in a bowl with salt to taste (I use 1/2 to 3/4 teaspoon kosher salt) and pour on 2 cups hot or boiling water. Allow to sit for 20 to 25 minutes, until most of water is absorbed. Drain and press against strainer to remove excess water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While bulgur is soaking, make dressing. Mix together lemon juice, garlic, mustard, and salt to taste. Whisk in olive oil. Toss with bulgur in a bowl. Add remaining ingredients, toss together, taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon bulgur salad onto a platter or onto plates. Garnish with artichoke wedges, and serve."}]}