{"@context": "http://schema.org", "@type": "Recipe", "name": "Salted Caramel Ice Cream", "description": "This luxurious ice cream is the ideal balance of sweet yet salty and rich yet light. It's custard-based, which means you have to separate a lot of eggs (six), but the thick and silky results are worth a little bit of fuss. For something a little lighter, use more milk and less cream, as long as the dairy adds up to three cups. You can also cut down on egg yolks for a thinner base, but don’t go below three. Despite the rumors, making caramel is not hard, but it can be a little tricky. If this is your first time, make sure you have enough sugar for a second batch in the event your first is a bust. Also, remove the cooking caramel from the heat just before you think you need to to prevent burning.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/01/25/dining/25COOKING-SALTEDCARAMEL-ICECREAM1/25COOKING-SALTEDCARAMEL-ICECREAM1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 1 1/2 pints", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "caramel, ice cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 199}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 257, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": null, "proteinContent": "3 grams", "saturatedFatContent": "10 grams", "sodiumContent": "92 milligrams", "sugarContent": "23 grams", "transFatContent": null}, "recipeIngredient": ["1 ¼ cups granulated sugar", "2 cups heavy cream", "1 cup whole milk", "1/8 teaspoon fine sea salt", "6 large egg yolks", "1/4 teaspoon flaky sea salt (such as Maldon)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot over medium heat, melt 3/4 cup sugar with 3 tablespoons water, swirling skillet frequently, until sugar turns mahogany brown in color (it should be almost but not quite black)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add heavy cream, milk, remaining 1/2 cup sugar and the salt; simmer mixture until caramel melts and cream mixture is completely smooth. Remove pot from heat. In a separate bowl, whisk yolks. Whisking constantly, slowly whisk about a third of the hot cream into the yolks, then whisk the yolk mixture back into the pot with the cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pot to medium-low heat and gently cook until mixture is thick enough to coat the back of a spoon (about 170 degrees on an instant-read thermometer)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain through a fine-mesh sieve into a bowl. Cool mixture to room temperature. Cover and chill at least 4 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Churn in an ice cream machine according to manufacturer’s instructions. Sprinkle flaky sea salt into base during the last 2 minutes of churning. Serve directly from the machine for soft serve, or store in freezer until needed."}], "link": "https://cooking.nytimes.com/recipes/1016626-salted-caramel-ice-cream"}