{"@context": "http://schema.org", "@type": "Recipe", "name": "Double Apple Pie", "description": "This recipe is a keeper. Gently spiced with cinnamon, tinged with brown sugar and loaded with apple butter, it’s as deeply flavored as an apple pie can be, all covered with a buttery wide-lattice top crust. Although it’s at its most ethereal when baked on the same day you serve it, it’s still wonderful made a day ahead. (Don't let making your own pie crust intimidate you: our <a href=\"http://cooking.nytimes.com/guides/how-to-make-a-pie-crust \">pie guide</a> has everything you need to know.)", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/10/29/dining/29COOKING-APPLEPIE2/29COOKING-APPLEPIE2-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "apple, apple butter, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1090}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 598, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "75 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "20 grams", "sodiumContent": "133 milligrams", "sugarContent": "36 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 1/2 cups/300 grams all-purpose flour", "1/2 teaspoon/2.5 grams kosher salt", "2 1/2 sticks/20 tablespoons/285 grams unsalted butter, chilled and cubed", "4 tablespoons/60 milliliters vodka (optional)", "1/4 to 1/2 cup ice water", "3 pounds/1 1/3 kilograms apples, peeled, cored and thinly sliced crosswise (1/8-inch)", "1/2 cup/99 grams granulated sugar, more as needed", "2 tablespoons/30 grams dark brown sugar", "2 tablespoons/30 grams quick-cooking tapioca", "1 1/2 teaspoons/3 grams ground cinnamon", "1 teaspoon/3 grams ground ginger", "1/4 teaspoon grated nutmeg", "Pinch ground cloves", "1 1/2 tablespoons/22 milliliters lemon juice", "3 tablespoons/45 grams apple butter", "Heavy cream or milk, as needed", "Whipped cream, sour cream or crème fraîche, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: In a food processor, pulse together flour and 1/2 teaspoon salt. Add butter and pulse until mixture forms 3/4-inch pieces. Mix vodka with 4 tablespoons ice water (or use 1/2 cup ice water). Add half the ice water mixture to dough, pulse a few times, then continue adding liquid a tablespoon at a time until dough just comes together (you might not use all the liquid). Dough should be moist, but not wet, and hold together when pinched. If there are visible pieces of butter in the dough, all the better."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, gather dough into a ball. Remove a third of the dough and form into a disk. Form remaining dough into a disk. Cover both tightly with plastic wrap and refrigerate for at least 1 hour and up to 5 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll out larger disk to a 12-inch circle. Transfer dough to a 9-inch pie plate. Fold over any excess dough, then crimp edges. Prick crust all over with a fork, then chill crust for 30 minutes or up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While dough chills, heat oven to 400 degrees. Line chilled crust with foil or parchment paper and fill with pie weights or dried beans. Bake for 15 minutes; remove foil and weights and bake until pale golden, 5 minutes more. Cool on rack until needed. (You can bake the crust up to 24 hours in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss apples with sugars, tapioca, spices, 1/2 teaspoon salt and the lemon juice. Fold in apple butter. Transfer apples to crust and press gently to make sure fruit is tightly packed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out remaining dough disk to a 10-inch round. Use a knife to cut strips 1 3/4 inches wide. Arrange strips over the filling in a lattice pattern. Brush top of crust with heavy cream or milk. Sprinkle with granulated sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pie on a rimmed baking sheet lined with foil. Bake 15 minutes; reduce heat to 350 degrees and continue baking until crust is golden brown and juices are bubbling thickly, about 1 hour 15 minutes more. Let pie cool on a wire rack for at least 2 hours before cutting. Serve with whipped cream, sour cream or crème fraîche."}], "link": "https://cooking.nytimes.com/recipes/1016924-double-apple-pie"}