{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken or Swordfish Kebabs", "description": "I can’t think of a better destination for chicken tenders than these succulent grilled kebabs. The yogurt marinade works equally well with chicken or with swordfish. The results are unbelievably tender and juicy (as long as you don’t overcook them). Serve the kebabs with basmati rice.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/08/27/health/nutrition/27recipe.health.readyh/27recipe.health.readyh-articleLarge.jpg", "totalTime": "PT4H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 55}, "recipeIngredient": ["Salt and freshly ground pepper", "1 1/2 pounds chicken tenders,  preferably from hormone- and antibiotic-free chickens, or swordfish steaks, cut in 1-inch pieces", "1 to 2 plump garlic cloves (to taste), cut in half, green shoots removedSalt and freshly ground pepper", "1 cup plain lowfat yogurt", "1 teaspoon curry powder", "Seeds from 3 cardamom pods, crushed (optional)", "1 tablespoon canola oil", "12 cherry tomatoes", "1 large red or green pepper, cut in 1-inch squares", "1 to 2 garlic cloves (to taste), cut in half, green shoots removed", "1/4 teaspoon salt", "1/2 teaspoon toasted cumin seeds, ground (optional)", "1 cup drained yogurt", "2 tablespoons finely chopped fresh mint or dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the chicken or swordfish with salt and pepper. Mash the garlic to a paste with 1/4 teaspoon salt in a mortar and pestle. Place the yogurt in a 2-quart bowl and stir in the mashed garlic, another 1/4 teaspoon salt, the curry powder, cardamom, and canola oil. Add the chicken or fish, the tomatoes and the peppers, and toss together. Cover and refrigerate for 1 to 3 hours. Meanwhile, if using wooden skewers, soak for 30 minutes or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, in a mortar and pestle mash the garlic and salt together to a paste. Stir into the drained yogurt, along with the optional cumin seeds and the mint or dill. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a hot charcoal grill or preheat a gas grill for fifteen minutes. Thread the chicken or fish onto skewers, alternating with the peppers and tomatoes. Do not jam the pieces together tightly, but leave a little space between so that the pieces cook evenly. Place on the hot grill. Grill 5 minutes and turn over. Grill fish skewers for another 5 minutes, or until the fish is springy to the touch. Grill chicken for another 7 to 10 minutes, turning onto another side after 5 minutes, or until cooked through but not dry. Remove from the grill and serve, with the yogurt sauce and with basmati rice."}], "link": "https://cooking.nytimes.com/recipes/1016439-chicken-or-swordfish-kebabs"}