{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato and Leek Gratin with Cumin", "description": "This is a main dish gratin that will make a nice vegetarian meal with a salad and/or green vegetable served alongside. The cumin contributes a Mediterranean flavor to the dish.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/10/22/health/nutrition/22recipe.health.ready/22recipe.health.ready-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 61}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 216, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "3 grams", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "593 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 garlic clove, cut in half", "1 tablespoon extra virgin olive oil", "1 pound leeks, white and light green parts only, cut in half lengthwise, sliced and rinsed of sand", "Salt and freshly ground pepper", "1 teaspoon cumin seeds, lightly toasted and crushed in a mortar and pestle or a spice mill", "2 pounds russet potatoes or Yukon golds, peeled if using russets, scrubbed if using Yukon golds, and sliced 1/4 inch thick", "3 ounces Gruyère cheese, grated (3/4 cup, tightly packed)", "2 1/3 cups low-fat milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375ºF. Rub the inside of a 2-quart gratin or baking dish with the cut side of the garlic clove. Brush lightly with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining olive oil in a wide, heavy nonstick skillet over medium heat and add the leeks. Cook, stirring often, until tender, about 5 minutes. Add 1/2 teaspoon salt and freshly ground pepper to taste and stir in the crushed cumin seeds. Stir together for half a minute and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the potatoes in a large bowl and season generously with salt and pepper. Add the leeks mixture and half the cheese, and toss together. Arrange in the baking dish in an even layer. Pour in the milk. Place the baking dish on a baking sheet and place in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the gratin for 45 minutes, checking after 30 minutes and pressing the potatoes down into the milk with the back of a spoon. Remove from the oven and gently press the potatoes down into the liquid, using the back of a spoon. Sprinkle the remaining cheese over the top and bake for another 30 to 45 minutes, or until nicely browned. Remove from the heat and allow to sit for 10 to 15 minutes before serving."}]}