{"@context": "http://schema.org", "@type": "Recipe", "name": "Peppers Stuffed with Farro and Smoked Cheese", "description": "This dish combines smoky-flavored cheese and paprika  with the crunch of the farro and walnuts. Simmer the farro or spelt until it splays.\n\nI was inspired to make this filling by a delicious stuffed tomato dish I ate recently at Oliveto in Oakland, Calif., in which the tomatoes were stuffed with a smoky barley filling. I used a Dutch smoked gouda-like cheese that was labeled, simply “smoked cheese.” I added paprika to the mix, which contributes to the smoky flavor, and walnuts, because I love the crunchiness with the grains. The cooked farro or spelt should be soft, so make sure to simmer until the grains splay.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/08/26/science/28recipehealth/28recipehealth-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, lunch, vegetables", "keywords": "bell pepper, farro, gouda cheese, paprika, tomato, fall, summer, halal, high fiber, kosher, low cholesterol, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 152}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 245, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "6 grams", "proteinContent": "10 grams", "saturatedFatContent": "3 grams", "sodiumContent": "666 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["2 cups cooked farro or spelt", "3 ounces smoked cheese, such as smoked gouda, cut in very small dice", "1/4 cup chopped walnuts (1.5 ounces)", "1/2 pound fresh, ripe tomatoes, grated", "1 teaspoon sweet paprika, and  additional for sprinkling", "Salt and freshly ground pepper to taste", "6 medium-size or smallish bell peppers, any color (1 1/2 to 2 pounds)", "1/2 cup water", "2 tablespoons fresh lemon juice", "1 tablespoon tomato paste", "1 tablespoon extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Oil an oven-proof, lidded casserole or Dutch oven large enough to accommodate all of the peppers. In a large bowl, mix  farro, cheese, walnuts, tomatoes and paprika. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut tops away from peppers and gently remove seeds and membranes. Season the insides with a little salt, then  fill with farro mix. Sprinkle a little paprika over the top and replace tops of  peppers. Place upright in the casserole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix water, lemon juice, salt to taste, tomato paste and olive oil and pour into the casserole. Cover, place in the oven and bake 30 to 40 minutes, until peppers are tender. Remove from the heat and allow to cool slightly in the casserole. Remove tops and spoon liquid from the casserole over the filling. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1016767-peppers-stuffed-with-farro-and-smoked-cheese"}