{"@context": "http://schema.org", "@type": "Recipe", "name": "Thanksgiving Sandwich", "description": "Like many restaurant workers toiling in Las Vegas, Eric Klein, the executive chef at Spago, spends Thanksgiving Day on the line, dishing out turkey and trimmings to vacationing high rollers. Time with family and friends comes after the holiday. While the rest of the city combs shopping arcades for Black Friday deals, he’s making magic with the leftovers. \n\nOne of his favorites is this play on a French dip sandwich. Shredded turkey stands in for the usual beef, while gravy, thinned out to make it brothlike, replaces the jus for dipping. To this he adds the requisite leftover stuffing, and he folds the cranberry sauce into a fragrant and creamy aioli. He likes to crumble mild blue cheese over the top of his sandwich for extra pizazz, but feel free to leave it out if you’re feeling more traditional.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19NEVADA/19NEVADA-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 86}, "recipeIngredient": ["1/4 cup leftover cranberry sauce", "3 tablespoons mayonnaise", "2 tablespoons apple or mango chutney, coarsely chopped", "2 cups leftover shredded turkey meat", "1 1/3 cups warm gravy", "Salt, as needed", "1 cup leftover stuffing", "1 ounce mild blue cheese, crumbled (optional)", "2 hoagie rolls, split"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together cranberry sauce, mayonnaise and chutney. In a small pot, heat together turkey and 2/3 cup of the gravy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a small pot of water to a boil. Place remaining gravy in a serving dish and stir in enough boiling water to make it thin enough to use as a sandwich dip. It should be like a rich broth. Season with salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread chutney mixture over cut side of bread halves. Make sandwiches with turkey, stuffing and blue cheese, if you like. Cut sandwiches in half and dip in the warm, thin gravy as you eat them."}]}