{"@context": "http://schema.org", "@type": "Recipe", "name": "Unmeasured Crepes", "description": "Disorienting as this may seem, there is no unit of measurement for the recipe below. If I added “teacup,” I worry that it would prevent you from using an au lait bowl, a Champagne coupe or a coffee urn, when in fact they will all serve very well. (Figure that a pint glass will feed four.)", "author": {"@type": "Person", "name": "Tamar Adler"}, "image": "https://static01.nyt.com/images/2015/02/15/magazine/15eat/15mag-15eat.t_CA1-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "Number of servings vary", "recipeCuisine": "french", "recipeCategory": "breakfast, brunch, dinner, easy, for one, for two, lunch, quick, snack, weekday", "keywords": "main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 692}, "recipeIngredient": ["1 vessel whole raw eggs", "1 vessel all-purpose flour", "1 3/4 vessel whole milk", "1/4 vessel melted sweet butter", "A dash to a pinch of salt."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs. Add the rest of the ingredients, and whisk. Add a bit of salt, \nand taste. If you don’t want to taste the eggs raw, heat a pan, drizzle a bit of \nthe batter into it, then taste it cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a nonstick pan, or put a lightly oiled one over medium heat. Add a \nladleful of batter, just enough to thinly coat the bottom of the pan. Cook until the edges just begin to brown, probably about 30 seconds. Flip — this is not at all delicate, though it seems as though it should be — and cook about 10 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook as many crepes as you want, stacking them on a plate and covering them with a cloth towel until you’re ready to eat. Serve with a whole array of \nthings you might like to put in them."}]}