{"@context": "http://schema.org", "@type": "Recipe", "name": "Modern Timpano", "description": "A timpano is a highly festive, drum-shaped, baked pasta torte filled with all kinds of delectable goodies — meatballs, cheeses, sausages or ragù, hard-boiled eggs and penne, all coated in a rich Sunday-gravy-type tomato sauce. This updated version is more streamlined, nixing the eggs and meatballs in flavor of roasted squash and sautéed garlicky broccoli rabe, and using purchased fresh pasta sheets instead of homemade. It’s lighter, a little easier and a lot more colorful, without sacrificing the cheesy, meaty essence of the dish.\n\nMaking a timpano is undeniably a project, but you can do much of the work a few days ahead, including making the sauce and cooking the vegetables, which can be made up to 2 days ahead. Then set aside half an hour before baking to layer everything in the mold. Serve this at a dinner party when you’re looking to impress.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/12/10/multimedia/clark-timpano/clark-timpano-mediumThreeByTwo440.jpg", "totalTime": "PT3H", "recipeYield": "8 to 10 servings", "recipeCuisine": "italian", "recipeCategory": "pastas, project", "keywords": "broccoli rabe, butternut squash, dry red wine, Italian sausage, pasta, ricotta, salami, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 193}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 654, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "5 grams", "proteinContent": "31 grams", "saturatedFatContent": "14 grams", "sodiumContent": "985 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons extra-virgin olive oil, more for drizzling", "3/4 pound sweet or spicy Italian sausage (or a combination), sliced 1/2-inch thick  ", "4 peeled, smashed garlic cloves, plus 2 additional cloves thinly sliced", "1 onion, peeled and diced", "Pinch red chile flakes", "1 1/2 teaspoons kosher salt, more as needed", "1/3 cup dry red wine", "1 (28-ounce) can puréed tomatoes", "1/4 cup chopped basil, plus 1 large basil sprig", "1 medium butternut squash (about 1 3/4 pounds), peeled and cut into 1 1/2-inch chunks", "1 pound (about 1 bunch) broccoli rabe, thick stems discarded", "12 ounces fresh ricotta", "1 egg", "1/4 teaspoon black pepper", "1/8 teaspoon nutmeg", "12 ounces penne rigate pasta", "10 ounces buffalo mozzarella (drained weight; usually about 2 balls), torn into bite-size pieces", "4 ounces salami, cut into 1/2-inch dice, or 2 ounces prosciutto, sliced into 1/2-inch strips", "Unsalted butter, as needed", "1 pound fresh pasta sheets (usually sold for lasagna)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: In a large skillet over medium-high heat, warm 1 tablespoon of oil. Add sausage and cook until well browned, about 5 minutes. Transfer to a paper-towel-lined plate to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to heat, add another tablespoon of oil and stir in smashed garlic cloves. Sauté for 1 minute, then stir in the onion, red chile flakes and a large pinch of kosher salt. Reduce heat to medium-low and cook until garlic is browned around the edges and onion is softened, 7 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in wine and let simmer until reduced by half, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in tomato purée, basil sprig and 1 teaspoon kosher salt. Bring to a very gentle simmer and cook until thick and deeply flavored, 40 to 50 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, roast the squash: Heat oven to 425 degrees. Place squash on a rimmed baking sheet, drizzle with 2 tablespoons oil, salt and pepper, and toss well to coat. Roast until browned and tender, 35 to 40 minutes, turning the squash pieces after 20 minutes so they cook evenly. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the broccoli rabe: Roughly cut up the rabe into 1-inch pieces. In a large skillet over medium-high heat, warm remaining 2 tablespoons oil. Add sliced garlic and sauté for 1 minute. Stir in broccoli rabe and 1/2 teaspoon salt. Cook, tossing frequently, until just barely tender, 5 to 7 minutes.  If the garlic starts to get very brown before the rabe is tender, add a tablespoon of water to the pan if necessary. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the ricotta mixture: In a medium bowl, stir together ricotta, egg, 1/4 cup chopped basil, the black pepper and the nutmeg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the penne in a large pot of very well-salted water for 4 minutes (it won’t even be halfway cooked, but will finish cooking in the timpano). Drain and put penne into a large bowl. Toss with the sauce, sausage, mozzarella, and salami or prosciutto."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Generously butter bottom and sides of a 3- to 4-quart Dutch oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the timpano: Brush any clinging cornmeal or flour from the pasta sheets if necessary. Use pasta sheets to cover bottom and up the sides of the pot, patching as needed to make sure there are no gaps. Leave any overhanging dough draped over the sides to help cover the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon 1/3 of the pasta mixture into the bottom of the pot. For the best presentation when you cut this, you could try to make sure that all the penne face the same way, but it’s not essential. Top with the ricotta mixture, then another 1/3 of the pasta. Arrange squash pieces on top of pasta, and tuck broccoli rabe around and over squash. Finish with a layer of the remaining pasta mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tuck the overhanging lasagna over the filling, and fill in any gaps with more pasta dough. You want to make sure the whole top is covered. Brush top of the timpano with water to make sure that the casserole is tightly sealed. Cover the Dutch oven with its cover or with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pot to oven and bake for 1 hour. Uncover pot and continue cooking until it reaches an internal temperature of 120 degrees, about 15 to 20 minutes longer. Let it cool, uncovered, for 20 minutes. Run a butter knife along the edges of the pot to make sure the timpano isn’t sticking. Place a large platter or cutting board over the pot and flip, unmolding the timpano from the pot. Let cool 10 to 20 minutes more before slicing and serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Timpano", "description": "A streamlined dinner-party centerpiece that is just as delectable as more authentic versions, but faster, easier and a bit lighter.", "thumbnailUrl": "https://static01.nyt.com/images/2015/12/10/multimedia/clark-timpano/clark-timpano-mediumThreeByTwo440.jpg", "uploadDate": "2015-12-11T17:57:07.000Z", "duration": "PT3M13S"}, "link": "https://cooking.nytimes.com/recipes/1017886-modern-timpano"}