{"@context": "http://schema.org", "@type": "Recipe", "name": "Jerk Ribs", "description": "Harold Dieterle, the chef and an owner of two restaurants in Manhattan, Perilla and Kin Shop, cooks food that is often fiery and always immensely detailed. It resembles intricate music that is played very, very loud. This Jamaican-style jerk sauce is no exception. Its heat is towering, but it does not overwhelm the flavors that accompany the flames: thyme and allspice, along with wisps of caramelized sugar and a scent of rum. “You could serve it on chicken,” Dieterle told me. “It’s insane on ribs.” Not to mention pork tenderloin and bluefish. Jerk tofu? That’d be terrific as well.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/10/25/magazine/25eat1/25mag-25eat-t_CA0-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "4 servings", "recipeCuisine": "caribbean", "recipeCategory": "dinner, roasts", "keywords": "allspice, habañero, ribs, thyme", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 341}, "recipeIngredient": ["1 medium-size bunch of scallions, trimmed and roughly chopped", "1/2 small yellow onion, peeled and roughly chopped", "4 cloves garlic, peeled", "4 habanero peppers, stemmed and seeded", "1 serrano pepper, stemmed and seeded", "Kosher salt to taste", "2 tablespoons dried thyme", "1 tablespoon garlic powder", "2 tablespoons ground allspice", "1 teaspoon chipotle powder or habanero powder", "1 teaspoon ground black pepper", "1/2 teaspoon chile powder", "1/2 teaspoon onion powder", "1/2 teaspoon smoked Spanish paprika", "1/4 teaspoon ground cinnamon", "1 tablespoon dark brown sugar", "1/4 cup soy sauce", "1/4 cup dark rum", "2 racks baby back ribs", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300. Place the scallions, onions, garlic and peppers into a food processor with a pinch of salt, and pulse to mince."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the spices, sugar and soy sauce, and blend for 15 to 20 seconds. Add the rum, and pulse to combine. Add water to thin the marinade, approximately 1/4 cup. Refrigerate for 30 minutes or until ready to use. (Covered tightly, the marinade will keep for a few days in the refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide the handle of a wooden spoon, or the edge of a butter knife, below the membrane on the back of each rack of ribs, and then use your fingers to grab it and pull it off. Season the ribs aggressively with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place each rack of ribs on a large sheet of aluminum foil, and slather with the jerk marinade. Wrap the ribs tightly in the foil, and place on a sheet pan in the oven for 90 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the sheet pan from the oven, carefully unwrap the ribs and anoint again with the jerk marinade. Return the ribs, uncovered, to the oven, and continue roasting for an additional 90 minutes, or until the meat is crusty and has just begun to pull back from the bone. Remove ribs from oven, allow to rest 5 minutes, then slice into individual ribs and serve on a warmed platter."}], "link": "https://cooking.nytimes.com/recipes/1017762-jerk-ribs"}