{"@context": "http://schema.org", "@type": "Recipe", "name": "Winter Squash Casserole With Rosemary", "description": "A pungent bath of minced garlic and rosemary gives a squash casserole new life, and in turn, this casserole gives new life to your fall and winter tables. It comes from Sarah Leah Chase, a cook on Nantucket, Mass., whose book \"Cold-Weather Cooking\" is full of good things for the winter holidays. Flouring the squash cubes helps them form a crust, and prevents the casserole from becoming mushy; the whiff of ginger in the coating is barely detectable but adds freshness. Slow-baking the squash turns it tender and sweet.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/10/26/dining/26COOKING_SQUASHCASS1/26COOKING_SQUASHCASS1-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fall, winter, rosemary, squash, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 548}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 187, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "3 grams", "proteinContent": "2 grams", "saturatedFatContent": "2 grams", "sodiumContent": "299 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["2 medium-size winter squash (such as butternut, delicata, Hubbard or a combination) peeled, seeded and cubed (about 8 cups cubes)", "¼ cup all-purpose flour  ", "1/8 teaspoon cornstarch", "2 teaspoons ground ginger", "1 teaspoon salt, more to taste", "½ teaspoon black pepper, more to taste", "4 to 6 garlic cloves, minced", "½ cup finely chopped parsley", "2 tablespoons finely chopped fresh rosemary", "1/3 cup plus 2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Place squash cubes in a large mixing bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together flour and cornstarch, then whisk in ginger, salt and pepper. Add half the dry ingredients to the squash and toss gently but thoroughly to combine. Add remaining dry ingredients and toss again until evenly coated. Add garlic, parsley, rosemary and 1/3 cup oil. Toss gently but thoroughly to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer squash to a 9-by-13-inch baking dish and drizzle with remaining 2 tablespoons oil. Cover tightly with aluminum foil and bake for 1 to 1 1/2 hours, until tender. Uncover and bake until very soft, another 45 to 60 minutes. (The casserole can be cooled and refrigerated at this point for up to 2 days. Bring to room temperature before resuming.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish, brown the top: Turn oven to 350 degrees. (Alternatively, turn oven to 325 degrees with convection, or use the broiler.) Heat squash until sizzling on the bottom and crusty on the top, about 10 minutes. (If reheating from room temperature, it will take longer, 20 to 30 minutes.) Serve immediately."}]}