{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked and Sautéed Spaghetti Squash on a Bed of Spinach", "description": "I played around with a number of ideas for this spaghetti squash on a bed of spinach. In one recipe test I mixed some pesto into the spaghetti squash; that tasted good but it wasn’t very pretty. I was sad to lose the bright color of the squash – plus you might not have pesto on hand -- so I decided not to fiddle too much with the sautéed squash and to go for a nutty accent, drizzling walnut oil and sprinkling chopped walnuts over the finished dish. Spaghetti squash has great texture but a rather bland flavor, so feel free to try other robust seasonings.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/16/science/19recipeforhealth/19recipeforhealth-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "Serves 6", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, vegetables", "keywords": "fall, winter, halal, kosher, low cholesterol, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 152}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 206, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "712 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 spaghetti squash, about 3 pounds", "3 tablespoons extra virgin olive oil", "2 plump garlic cloves, minced", "Salt", "1 12-ounce bag (or box) baby spinach, rinsed", "2 tablespoons bread crumbs", "Lots of freshly ground pepper", "1 teaspoon sumac (optional)", "1/4 cup freshly grated Parmesan (more to taste)", "1/4 cup chopped walnuts (more to taste)", "1 tablespoon walnut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Pierce spaghetti squash in several places with a sharp knife. Cover a baking sheet with foil and place squash on top. Bake 1 to 1 1/2 hours, until squash is soft and easy to cut into with a knife. Remove from oven and allow to cool until you can handle it, then cut in half lengthwise and allow to cool some more. Scoop out seeds and discard. Scoop out flesh and place in a bowl. Run a fork through to separate the spaghetti-like strands."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon olive oil over medium-high heat in a heavy 12-inch skillet. Add half the garlic and as soon as it begins to sizzle and smell fragrant add spinach. It should wilt quickly in the liquid left on leaves after washing. Add salt to taste and toss in pan (tongs are a good tool for this) until all spinach has wilted, 2 to 3 minutes. Place a strainer or colander in the sink and drain spinach. Allow to drain while you sauté spaghetti squash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe skillet and heat again over medium-high heat. Add remaining olive oil and breadcrumbs. When breadcrumbs are crisp, after about 1 minute, stir in remaining garlic, stir for a few seconds, until fragrant, and add spaghetti squash and salt to taste. Toss together over medium-high heat until the squash is infused with oil and breadcrumbs are beginning to color, 5 to 8 minutes. Add sumac if using and lots of freshly ground pepper. Taste and adjust seasoning. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange spinach on a platter. Top with squash. Sprinkle Parmesan and walnuts over squash and drizzle on walnut oil. Serve hot."}]}