{"@context": "http://schema.org", "@type": "Recipe", "name": "Lentils With Smoked Trout Rilletes", "description": "A new take on surf and turf, with simply cooked lentils topped with smoked trout. This plate of lentils topped with quenelle-shaped spoonfuls of smoked trout rillettes is not your run of the mill surf and turf combo. It is inspired by a wonderful dish I ate at Buvette, a tiny, lively bistro in Paris. I was there in October, less than a week after I had eaten at its equally popular twin in New York, where the menu was almost identical, except this dish wasn’t offered on the New York menu when I was there (instead I enjoyed brandade). The lentils were simply cooked and came topped with a big scoop of the smoked trout rillettes, a great combo. If I were French I would make the rillettes with lots of butter, but this version has more of a Mediterranean sensibility. Use a fork, not a food processor, to mash the smoked trout, as you want the rillettes to have some texture. Any type of lentil will work here.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/09/science/08recipeforhealth/08recipeforhealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 6", "recipeCuisine": "french", "recipeCategory": "dinner, lunch, dips and spreads", "keywords": "fall, spring, summer, winter, gluten-free, halal, high fiber, high protein, kosher, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 358, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "8 grams", "proteinContent": "25 grams", "saturatedFatContent": "2 grams", "sodiumContent": "912 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups / 14 ounces lentils (green, brown, or black), rinsed and picked over", "1 1/2 quarts water", "1 onion, cut in half", "1 bay leaf", "2 garlic cloves, crushed", "Pinch of cayenne, or 1 dried cayenne pepper (optional)", "Salt", "Freshly ground pepper", "7 to 8 ounces smoked trout fillets, skin and bones removed", "2 tablespoons extra virgin olive oil", "2 tablespoons unsalted butter, at room temperature (may substitute Greek yogurt)", "4 to 6 tablespoons plain Greek yogurt (depending on whether or not you use butter)", "1 to 2 tablespoons fresh lemon juice (to taste)", "1 to 2 tablespoons minced chives (to taste)", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium size pot, combine lentils, water, onion, bay leaf, garlic and optional cayenne. Bring to a gentle boil over medium-high heat. Add salt, cover, reduce heat to low and simmer 30 to 40 minutes, until lentils are cooked through but still have some texture. They should not be mushy but they shouldn’t be crunchy either. Taste and adjust salt. Add pepper. Using tongs, remove and discard onion and bay leaf."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While lentils are simmering make rillettes. In a medium bowl, break up trout with your fingers or with a fork. In a small bowl, mix together olive oil and butter until well amalgamated. Mash trout with a fork, then work in olive oil and butter, and yogurt. Make sure to mash well and to distribute butter, olive oil and yogurt evenly through the mixture. Work in lemon juice and stir in minced chives and pepper. Refrigerate if not using right away. Remove from refrigerator 30 minutes before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon warm lentils onto plates or wide bowls. To form quenelles, dip a soup spoon into warm water and scoop up a spoonful of trout mixture. With another soup spoon, round the top of the mound, then ease off on top of the lentils. Repeat with another spoonful and serve."}]}