{"@context": "http://schema.org", "@type": "Recipe", "name": "Lavender and Orange Blossom Cookies", "description": "These buttery, shortbread-like cookies, called graybeh, have a particularly crunchy texture that comes from clarified butter. If you’ve never clarified butter, this recipe is a good place to start, and the process is extremely simple (though you do have to plan it several hours ahead). If you’re not a lavender fan, feel free to leave it out. And for a more familiar flavor, substitute vanilla extract for the orange blossom water. These cookies keep well, so you can make them up to a week in advance.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/05/27/dining/27COOKBOOK4/27COOKBOOK4-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "2 dozen cookies", "recipeCuisine": "middle eastern", "recipeCategory": "snack, cookies and bars", "keywords": "confectioners' sugar, lavender, orange blossom water, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 166}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 135, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "5 grams", "sodiumContent": "49 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["3/4 cup/180 grams clarified butter, at room temperature (see note)", "1 3/4 cups/215 grams confectioners’ sugar", "2 teaspoons/1 gram dried lavender, ground to a powder", "1/2 teaspoon/3 grams kosher salt", "1 teaspoon/ 5 milliliters orange blossom water", "1 3/4 cups/228 grams all-purpose flour, more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees with a rack in the center of the oven. Line two sheet pans (not dark metal) with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In an electric mixer, beat the butter on high for about 6 minutes, until light and fluffy. Add 3/4 cup (92 grams) confectioners’ sugar, lavender and salt and beat another 2 minutes. Scrape down the sides of the bowl, and with the mixer on low speed, add orange blossom water and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add flour to butter 1/2 cup (about 65 grams) at a time, until dough is crumbly and slightly dry but still able to hold together when squeezed, adding additional flour if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough into quarters and press each into a long narrow log about 1 inch high and 1 inch wide. With a sharp knife, cut into log diagonally to make diamond-shaped cookies 1 to 2 inches long. Use a spatula to transfer cookies to sheet pans, spaced about 2 inches apart. Bake for 15 to 20 minutes, rotating pan halfway through. Cookies should be golden brown at the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift remaining confectioners’ sugar over baked cookies while still warm. Store in an airtight container for up to 1 week."}]}