{"@context": "http://schema.org", "@type": "Recipe", "name": "Rick Easton’s Pizza With Peppers", "description": "In order to bring out all their flavor and sweetness, you must sauté bell peppers before putting them on this variation of the Pittsburgh-based baker and cook Rick Easton's pizza; but that’s hardly any work at all. (If you like, add a couple of semihot peppers to the mix.) The mozzarella is a nice touch, as is the rosemary, but almost any herb will work beautifully here. Don’t skimp on the olive oil, and don’t underbake the pie; it should be good and brown on the bottom.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/11/08/magazine/08eat1/08mag-08eat-t_CA2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "1 pizza", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "bell pepper, flour, mozzarella, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 89}, "recipeIngredient": ["3/4 teaspoon (2 grams) yeast", "1 7/8 cups lukewarm water", "3 1/2 cups or 500 grams bread flour, plus more for dusting", "3 teaspoons or 8 grams kosher or sea salt", "4 tablespoons or 40 grams extra-virgin olive oil", "5 bell peppers of varying colors", "8 ounces fresh mozzarella, torn into small pieces", "1 tablespoon chopped rosemary leaves", "2 tablespoons extra-virgin olive oil, plus more for drizzling", "1/2 teaspoon salt", "Pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a comfortably large, preferably rectangular plastic container, dissolve the yeast into 1 3/4 cups of lukewarm water. Mix in the flour with your hand, squishing it together, just until the flour is absorbed. The dough will be very wet and shaggy. Remove what stuck to your fingers, and mix into the dough. Cover with a lid or plastic wrap, and rest for 20 minutes at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dissolve the salt in remaining 1/8 cup of water, and mix with your hand into the dough. Don’t worry if it doesn’t all mix in. Cover with a lid or plastic wrap, and rest for another 20 minutes at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With wet hands, release the dough from the sides of the container. Coat the top of the dough with 1 tablespoon of oil, and make a trifold or letter fold by lifting up the dough one-third of the way through and letting the end drop and fold underneath. Repeat this action on the other side so that the seam is on the bottom. Cover with a lid or plastic wrap, and rest for 1 hour in the refrigerator. Repeat this process two more times. After the third fold, rest the dough in the refrigerator for about 24 hours. Sometime halfway through resting, repeat the trifold with oil one last time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have a pizza stone, slide it on the lowest rack or on the floor of your oven, and heat oven to 500. Heat for at least 30 minutes and preferably longer before baking. Slice the bell peppers thinly, and sauté, stirring frequently, over medium heat with 2 tablespoons of extra-virgin olive oil and salt until tender, about 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease an 18-by-13-inch jellyroll pan with olive oil. (A cookie sheet of a similar size makes a good alternative.) Wipe the pan clean with a dry paper towel; it’s important not to bake the pizza on too much oil. Flip the dough out onto a floured surface, and gently press out into a rectangle 1/2-to-3/4-inch thick, being careful not to deflate the dough too much. Place one forearm over the dough, and use the other hand to flip the dough over the forearm and then into the pan, leaving the floured side up. Rearrange the dough on the pan, again pressing only lightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the topping evenly across the dough, drizzle generously with oil and bake on the pizza stone (or directly on the bottom of the oven or lowest rack) for 5 minutes. Move the pizza to the middle rack in the oven, and continue to bake for 10 to 15 more minutes or until golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a bench scraper or metal spatula, scoop under the pizza, and scrape to release it from the pan. This may take some blind faith and a bit of elbow grease. Slide out onto a cutting board, and slice into pieces using a chef’s knife, scissors or pizza cutter. Serve immediately or at room temperature, or reheat."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Variations", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rick Easton creates new variations seasonally, and so can you. Some of his current favorites are:"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake topped only with extra-virgin olive oil, then, when warm, top with Gorgonzola cheese, sautéed onions, grilled pear, fried sage, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake with roast puréed pumpkin and fresh mozzarella, then top with walnuts and fresh arugula, olive oil, a light squeeze of lemon juice, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake with braised leeks and sautéed apples, then top with thinly sliced lonzino (cured pork loin), or other cured meats like dry coppa, bresaola or prosciutto, extra-virgin olive oil, salt and pepper."}]}], "link": "https://cooking.nytimes.com/recipes/1017793-rick-eastons-pizza-with-peppers"}