{"@context": "http://schema.org", "@type": "Recipe", "name": "Game Hens With Sumac, Pomegranate and Cardamom Rice", "description": "There’s very little difference these days between the small chickens marketed as game hens and the ones called poussins. Both names are used, and they refer to a bird that weighs about 1 pound. And both birds work here in this recipe. The hens are beautifully burnished and seasoned with sumac and pomegranate molasses, which adds a tart sweet and sour flavor. (You can find the molasses at Middle Eastern groceries.) Figure one whole bird per person, or half a bird for smaller appetites. Fragrant cardamom-spiced basmati rice makes a perfect accompaniment.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/10/28/dining/28KITCH_WEB/28KITCH_WEB-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "game hens, pomegranate molasses, sumac, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 75}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 976, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "50 grams", "fiberContent": "3 grams", "proteinContent": "58 grams", "saturatedFatContent": "15 grams", "sodiumContent": "946 milligrams", "sugarContent": "17 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 game hens or poussins, about 1 pound each", "Salt", "2 teaspoons sumac", "½ teaspoon cinnamon", "½ teaspoon black pepper", "2 tablespoons pomegranate molasses", "2 cups basmati rice, rinsed", "8 cardamom pods", "8 cloves", "2 tablespoons butter", "¼ cup currants", "½ cup golden raisins", "¼ cup pomegranate seeds", "3 tablespoons lightly toasted pine nuts", "Mint sprigs or chopped mint, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Season birds inside and out with salt, then tie legs together with butcher twine. In a small bowl, mix together the sumac, cinnamon and black pepper. Sprinkle spice mix evenly over exterior of birds and put a pinch in the cavities, too."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place seasoned birds in a roasting pan just big enough to fit and drizzle all over with pomegranate molasses. Turn birds breast-side down and add water to pan to a depth of ½ inch. Bake uncovered for 15 minutes, then reduce heat to 375 and turn birds breast-side up. Continue cooking for another 20 to 25 minutes, using a brush to baste birds with pan juices frequently, until well browned. Juices in thigh should run clear when pierced with a paring knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the rice: Put rinsed basmati rice in a saucepan with a tight-fitting lid. Add cardamom, cloves, butter, currants, raisins, 2 1/2 cups water (or broth) and 1/2 teaspoon salt. Bring to a boil over high heat, then put on lid and turn heat to very low. Cook rice for 15 minutes, then turn off heat. Leave covered for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, fluff rice and mound on a large warmed platter. Surround rice with finished birds and give birds a last dab of the pan juices. Sprinkle pomegranate seeds and pine nuts over everything and garnish with mint. Serve the pleasantly tart pan juices separately."}], "link": "https://cooking.nytimes.com/recipes/1017764-game-hens-with-sumac-pomegranate-and-cardamom-rice"}