{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Polenta Medallions", "description": "Anson Mills polenta, once it stiffens, is particularly well suited to this recipe for crispy rounds, though any polenta will work. The Anson Mills remains very creamy on the inside and crisps up beautifully on the surface. Make sure to cook these long enough in the oil – they should be a deep golden brown, and crispy. I topped the hot medallions with a dab of blue cheese, which softened and partially melted onto the crisp surface; heaven. I also love romesco with these, as well as green pipian and simple marinara sauce.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/24/science/recipehealthmedallions/recipehealthmedallions-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "Serves 8 to 12 as an hors d’oeuvre", "recipeCuisine": "american, mediterranean, mexican", "recipeCategory": "dinner, snack", "keywords": "appetizer, side dish, fall, spring, summer, winter, gluten-free, halal, kosher, low cholesterol, low sugar, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 62}, "recipeIngredient": ["1 recipe <a href=\"http://cooking.nytimes.com/recipes/1017155-simple-pencil-cob-breakfast-grits\">Soft Anson Mills Polenta</a>", "2 to 3 tablespoons olive oil, as needed", "Blue cheese or gorgonzola (about 1 ounce)", "Romesco Sauce (about 1/4 cup)", "Marinara Sauce (about 1/4 cup)", "Green Pipian (about 1/4 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover a baking sheet with plastic or lightly oil a baking dish. Make polenta and when done, pour onto plastic or into lightly oiled baking dish. Spread to a thickness of about 1/3 inch using an offset spatula. If you are using a baking dish and can’t spread the polenta that thin, you can always slice the rounds after they are cut to make thinner medallions. Cover with plastic and allow to stiffen completely, preferably in the refrigerator overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the stiff polenta into 1 1/2 to 2-inch rounds with a cookie cutter. If the rounds are thick, cut crosswise into 1/3 inch thick rounds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil over medium-high heat in a heavy nonstick or cast iron skillet. The polenta should sizzle as soon as you place the medallion in the oil. Cook the rounds in batches until nicely browned on each side, about 3 minutes per side. Turn them carefully with a spatula, and do not crowd the pan. Drain on paper towels. Transfer to a platter while warm and place a pinch – about 1/4 teaspoon – of blue cheese on each round. It should soften and melt a little bit on the hot surface of the polenta. Or top with small dollops of the other toppings of your choice. Serve warm (they are also good when they cool down)."}], "link": "https://cooking.nytimes.com/recipes/1017159-crispy-polenta-medallions"}