{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkish Flour Helva  ", "description": "Flour helva, a thick, sweet pudding that tastes of warm, toasted flour and browned butter, is both a ceremonial and everyday dish in Turkey. It’s essential at gatherings such as funerals and births, but is also often made as a staple family dessert. This version, from the Istanbul food writer Cemre Narin, was given to her by her mother-in-law, Ozden. It is much beloved for its deep brown butter and cinnamon flavor, as well as its comforting, smooth texture, with the contrasting crunchy almonds on top. It makes a filling warming dessert or snack that's especially lovely in winter.\n\nThe key here is patience. The dish takes a long time to come together, and while you don’t have to stir it constantly, you won’t be able to go far from the pot while it cooks. Make this when you're in the kitchen anyway, tending to other pans or projects. Be sure to get the flour deeply golden brown so it takes on a rich, nutty flavor, otherwise your helva may be bland. Pine nuts are often used here in place of the almonds. Feel free to use either one.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/01/20/dining/20APPE/20APPE-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 small servings", "recipeCuisine": "turkish", "recipeCategory": "custards and puddings", "keywords": "almonds, milk, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 498, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "4 grams", "proteinContent": "11 grams", "saturatedFatContent": "10 grams", "sodiumContent": "28 milligrams", "sugarContent": "29 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 stick/1/2 cup/113 grams unsalted butter  ", "1 cup/125 grams all-purpose flour ", "1 cup/200 grams sugar", "1 1/2 cups/350 milliliters whole milk", "Pinch of salt (optional)", "2 cups whole blanched almonds", "2 teaspoons cinnamon  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot over medium heat, melt the butter. Whisk in the flour, a little at a time to prevent clumping; reduce heat to very low and cook, stirring often with a heatproof rubber spatula or wooden spoon, until the flour is deep golden brown and butter separates and floats to the top, about 1 to 2 hours. The higher the flame, the quicker it will cook, but the more you will have to stir it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium pot, combine sugar, 1 1/2 cups/355 milliliters water, and milk; bring to a low simmer over medium heat. Turn off heat, cover to keep warm, and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When flour mixture is toasted and browned but not burned, slowly whisk in the warm milk mixture and a pinch of salt if you like. (It's O.K. if the milk has cooled to room temperature; it should not be cold.) Raise heat to medium-high and cook, stirring with a heatproof rubber spatula or wooden spoon, until mixture comes together in a paste-like texture and no longer sticks to sides of the pot. (Make sure to stir in the corners and bottom of pot.) Whisk the mixture occasionally, if necessary, to create a smoother texture and get rid of any lumps. Cover pot with a cloth and a lid, then let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium skillet, toast the almonds in the dry pan over medium heat. Sprinkle almonds and cinnamon over cooled helva. Spoon onto plates or into small bowls to serve."}], "link": "https://cooking.nytimes.com/recipes/1017926-turkish-flour-helva"}