{"@context": "http://schema.org", "@type": "Recipe", "name": "Linzer Trees", "description": "These are a reworking of an old “Joy of Cooking” recipe I learned from my friend in Atlanta, Allison Dykes. They are the precious stars of her holiday cookie plate. The dough can be slightly finicky but can be re-rolled and re-chilled several times so all the scraps get used. The ideal thickness is somewhere between an eighth and a fourth of an inch. They need to be thin but not so thin that the delicate cookie breaks. The roasted almonds can be ground in a food processor.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2014/12/03/dining/03COOKFIGHT1/03COOKFIGHT1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "About 30 cookies", "recipeCuisine": "", "recipeCategory": "snack, cookies and bars", "keywords": "almonds, raspberry jam, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 182}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 159, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "5 grams", "sodiumContent": "31 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 cup unsalted butter (2 1/2 sticks), softened", "2/3 cup/145 grams sugar", "2 1/3 cups/308 grams all-purpose flour", "1/2 cup/70 grams finely ground, roasted almonds", "1 teaspoon cinnamon", "1/4 teaspoon kosher salt", "1 cup/8 ounces good-quality raspberry jam, preferably seedless", "Powdered sugar for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line baking pans with parchment or silicone baking mats."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl or stand mixer, mix butter and sugar on medium speed until smooth. In a separate bowl, whisk together flour, almond meal, cinnamon and salt. Slowly add dry ingredients, a half-cup at a time, to butter mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough into 3 balls. Place each ball between parchment paper (nonstick works best) and roll into a thin circle, about 11 inches in diameter and just over 1/8-inch thick. Refrigerate flat for at least 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly with one sheet of dough, remove top layer of parchment, then flip onto a clean sheet and remove the bottom layer. Using a tree-shaped cookie cutter, cut 30 shapes for the bottoms of the cookies and place on prepared baking sheets. Reserve scraps to reuse for more cookies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake cookie bottoms for about 10 to 12 minutes, or until the edges just begin to brown. Rest for a couple of minutes on the tray, then carefully transfer to a cooking rack. Repeat the process to create the tops, using a pastry tip or a straw to cut out 5 to 7 holes on the trees to resemble ornaments. Open any holes that close during baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt jam with 1 teaspoon of powdered sugar and boil lightly for about a minute. Cool slightly. Assemble cookies by flipping the bottoms, spreading them with a scant teaspoon of jam, dusting the tops lightly with powdered sugar and then gently pressing the tops onto the bottoms. Store airtight between layers of wax paper or parchment for 3 days. Freeze for up to a month."}], "link": "https://cooking.nytimes.com/recipes/1017033-linzer-trees"}