{"@context": "http://schema.org", "@type": "Recipe", "name": "Sherry Vinegar-Glazed Onions", "description": "Traditional creamed onions and buttery glazed onions are perfectly nice, but the sparky tang of vinegar makes this version of the classic much more appealing. The sweet-and-sour flavors are a great foil for the rich, starchy dishes on a Thanksgiving table. Any leftovers can be chopped up to make a lively addition to winter stews and chunky soups.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/11/18/dining/18JULIAREX2/18JULIAREX2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "fall, winter, onion, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 56}, "recipeIngredient": ["2 tablespoons neutral oil, like canola or grapeseed", "1 pound small peeled onions, about 1 inch in diameter, red or white or a combination (frozen onions are fine)", "1/2 cup sherry vinegar or apple cider vinegar", "Salt and ground black pepper to taste", "Honey or maple syrup to taste", "Finely minced parsley, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide skillet with a lid, heat oil over medium heat until bubbling. Add onions and sauté over medium-low heat for about 10 minutes, gently rolling the onions about so they will brown as evenly as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in vinegar and 1/4 cup water. Season with salt and a few grinds of pepper. Cover and simmer very gently until onions are perfectly tender but retain their shape. Start testing with a thin sharp knife after 15 minutes; depending on size, the onions may cook in 15 to 25 minutes. (Frozen onions will cook faster.) Taste one to make sure it is completely tender all the way through; do not undercook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, transfer onions to a serving bowl. (Onions may be prepared up to this point 2 days ahead. Reserve onions and cooking liquid separately. Reheat onions in reserved liquid, adding water as needed, then transfer them to a bowl.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise heat and boil liquid to reduce it to a thick glaze. Taste and add salt, pepper and sweetener to taste. Stir in parsley and serve hot or warm."}], "link": "https://cooking.nytimes.com/recipes/1017819-sherry-vinegar-glazed-onions"}