{"@context": "http://schema.org", "@type": "Recipe", "name": "Stew Chicken", "description": "Raised as a Seventh Day Adventist and vegetarian in St. Vincent and the Grenadines, the chef Rawlston Williams rarely got to eat stew chicken growing up, he said, but he did help cook this complexly flavored meal with friends — smitten even then with its scent. Like many peasant dishes, Mr. Williams said, stew chicken was often made with leftover scraps like chicken backs, and you could do the same, though the recipe here has been adapted for bone-in chicken thighs or the more economical chicken leg quarters. At the Food Sermon, his restaurant in Brooklyn, he’ll serve it with rice and beans, but his preferred method is his own twist with chickpeas, sweet potato and the Caribbean version of paratha roti, an Indian flatbread he updates with fennel seed.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2015/10/28/dining/28JPCARIBBEAN8/28JPCARIBBEAN8-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "caribbean", "recipeCategory": "soups and stews", "keywords": "chicken thighs, culantro, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 154}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 694, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "1 gram", "proteinContent": "48 grams", "saturatedFatContent": "13 grams", "sodiumContent": "789 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 pounds bone-in chicken thighs or chicken leg quarters", "1 tablespoon plus 1 teaspoon salt", "1 teaspoon ground clove", "1 tablespoon Worcestershire sauce", "1 tablespoon tomato paste", "1 tablespoon ketchup", "4 garlic cloves, crushed", "1 1/2 teaspoons ground allspice", "1 1-inch piece fresh ginger, peeled and chopped (about 1 tablespoon, or use 2 teaspoons powdered ginger)", "1 medium onion, quartered", "4 scallions, white and green parts, roughly chopped", "1 bay leaf", "5 pieces of culantro (a Caribbean herb also known as chadon beni) or whole sprigs of cilantro, chopped", "5 sprigs fresh thyme (or use 3 teaspoons dried leaves)", "4 tablespoons white vinegar", "1/2 Scotch bonnet pepper (or use habanero)", "1 tablespoon vegetable oil", "4 tablespoons sugar", "2 tablespoons flour, more as needed, for dusting chicken"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove skin and trim fat from chicken. If using leg quarters, cut chicken into serving-size pieces. (Each chicken leg should yield about four pieces.) If using thighs, you can leave them whole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the marinade: In a food processor or blender combine salt, clove, Worcestershire sauce, tomato paste, ketchup, garlic, allspice, ginger, onion, scallions, whole bay leaf, culantro or cilantro, whole thyme sprigs, vinegar and Scotch bonnet pepper. (You should have about 2 cups marinade.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine chicken and marinade, ensuring all chicken pieces are coated. Refrigerate for a minimum of 2 hours. (For best results, marinate overnight.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees, and keep the chicken close to the stove. In an oven-safe pot large enough to hold the chicken comfortably (such as a Dutch oven), add oil and 3 tablespoons sugar and heat over medium until the sugar starts foaming and eventually changing color; this is the beginnings of your caramel. Cook until caramel is a rich, very dark brown, but not burned. (The caramel may start smoking as it darkens.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Quickly add chicken pieces to the pot, moving them around until they are fully coated with caramel. Add any remaining marinade in the bowl to the pot. Dust chicken with flour to fully coat pieces. At this point there shouldn't be much liquid in the pot; it should have a thick, pasty consistency. If any liquid remains, sprinkle more flour over the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add enough water to cover 3/4 of the chicken. (The tops of the pieces should barely peek out of the water.) Stir to incorporate all ingredients. Cover pot, transfer to oven and bake for 35 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Check chicken for doneness. Once chicken is cooked, taste and add salt if necessary. Add remaining 1 tablespoon sugar to balance flavor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let stew rest for about 30 minutes before serving, or make it ahead and store it in the fridge for the following day; stew chicken tastes even better the day after. Serve with rice (or other grain, such as quinoa) and beans."}]}