{"@context": "http://schema.org", "@type": "Recipe", "name": "Pizza Dough", "description": "This pizza dough is very easy to put together, and it's enough for four 10-inch-diameter pizzas. It is best if prepared in advance and refrigerated overnight. Refrigerated dough will keep several days. It may also be successfully frozen and thawed. Keeping preweighed individual frozen dough balls on hand makes it easy to have pizza whenever you like. (Thaw dough overnight in the refrigerator or leave at room temperature for several hours.)", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/01/20/dining/20KITCH4/20KITCH4-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 dough balls (8 ounces/225 grams each)", "recipeCuisine": "american", "recipeCategory": "easy, pizza and calzones", "keywords": "main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 812}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 253, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "0 grams", "sodiumContent": "153 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2 teaspoons/5 grams dry active yeast", "4 1/2 cups/625 grams all-purpose flour, plus extra for dusting", "2 teaspoons/5 grams kosher salt", "2 tablespoons/30 milliliters olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 1 3/4 cups/420 milliliters lukewarm water in a mixing bowl (use a stand mixer or food processor if you prefer). Sprinkle yeast over water and let dissolve, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add flour, salt and olive oil and mix well until flour is incorporated and dough forms, about 5 minutes. It may look a little rough or pockmarked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly dust a work surface with flour. Turn dough out onto surface and knead lightly until it looks smooth, 3 to 4 minutes. Cut dough into 4 equal pieces, about 8 ounces/225 grams each."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap dough pieces individually in resealable zipper bags and refrigerate for several hours or, for best results, overnight; you can also freeze it for future use. (You can skip this rise in the refrigerator and use the dough right away, but this cool, slow rise makes it easier to stretch and gives the pizza a crisper texture and more nuanced flavor.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To use dough, form each piece into a smooth, firm ball, and place on a flour-dusted or parchment-lined baking sheet. (If you froze the dough, leave it at room temperature for several hours first, or defrost overnight in the refrigerator.) Flour lightly, cover loosely with plastic wrap and top with a kitchen towel. Leave to rise in a warm spot until doubled in size, about 30 minutes. Each dough ball with make a 10-inch diameter pizza."}], "link": "https://cooking.nytimes.com/recipes/1017931-pizza-dough"}