{"@context": "http://schema.org", "@type": "Recipe", "name": "Quealy Watson’s Cabrito", "description": "Barbecued baby goat is a specialty of South Texas, where The Times traveled in 2015 to see the chef Quealy Watson cook it in mesquite smoke under a spray of dried avocado leaves, which gave the meat a faint scent of anise. You could make this dish with a single goat leg or a pork butt or even a brisket. The idea is simply to get a lot of smoke on the meat, then wrap it and allow it to steam slowly into perfection over time. Serve over brown paper on a big table with lots of tortillas and salsas: Tear away what you need for a taco, then repeat.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/11/30/magazine/quealys-watsons-cabrito/quealys-watsons-cabrito-articleLarge.jpg", "totalTime": "PT6H", "recipeYield": "15 to 20 servings", "recipeCuisine": "southwestern", "recipeCategory": "", "keywords": "goat", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 17}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 497, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "1 gram", "proteinContent": "91 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1048 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 small goat, 15 to 20 pounds", "Kosher salt and freshly ground black pepper", "1 cup dried avocado leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Light a charcoal grill or smoker, or heat oven to 250. If goat is too large for your grill, smoker or oven, cut it in half across the backbone at the top of its rear legs to create two halves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the meat aggressively with salt and pepper. If smoking, place the goat on the smoker and cover, keeping the heat around 220 to 250. If grilling, move coals to one side of the grill, and place goat on the other, away from the direct flame, then cover the grill. If oven-roasting, put goat on a sheet pan and place in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the goat for 2 hours or so, until it has taken on some color, then remove from the heat and place on a large sheet of aluminum foil. Scatter the avocado leaves across the meat, and wrap the goat in the foil, using another sheet of foil if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the covered goat on a sheet pan, and put in the oven to continue cooking for 3 or 4 more hours, until the meat is tender and pulls away from the bone. Serve with tortillas and salsas."}], "link": "https://cooking.nytimes.com/recipes/1017867-quealy-watsons-cabrito"}