{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Fried Pole Beans With Chicken Liver Crostini", "description": "Pole beans, which are also called stick beans or runner beans depending on where you’re from, are any sort of bean that climbs easily around a trellis or other support. When they are young, they are perfect cooked in a lightly oiled sauté pan without blanching. Anne Quatrano’s recipe requires only the discipline to keep the heat of the pan high enough so the beans brown well but don’t burn. If the beans are fresh, they can achieve a crisp-tender state with just a touch of char in less than 10 minutes.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2016/02/16/dining/pole-bean-crostini/pole-bean-crostini-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "dips and spreads, finger foods", "keywords": "appetizer, chicken liver, crusty bread, pole beans, port, spring onion, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 425, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "3 grams", "proteinContent": "14 grams", "saturatedFatContent": "15 grams", "sodiumContent": "462 milligrams", "sugarContent": "8 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 tablespoons olive oil", "2 shallots, diced", "2 cloves garlic, thinly sliced", "1 pound chicken livers, deveined", "1/2 cup port", "Salt and freshly ground black pepper", "Sugar", "1 pound plus 1 tablespoon well-chilled unsalted butter, cut into small cubes", "1 pinch curing salt (to help preserve color), optional", "1 tablespoon olive oil", "1 pound assorted fresh pole beans (such as Dragon’s Tongue, Romano, yellow), trimmed", "1 spring onion, thinly sliced", "1 clove garlic, thinly sliced", "Sea salt and cracked black pepper", "12 to 16 thin slices crusty bread", "Extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For chicken liver pâté: In a medium sauté pan, heat oil, and add shallots, garlic and chicken livers. Sauté until livers are medium-rare; add port, and sauté until liquid is reduced by half. Season with salt, pepper and sugar to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a food processor, and purée. With machine running, gradually add cubes of butter until they are incorporated. Add curing salt, if using. Adjust seasonings to taste, push through a fine-mesh screen or strainer and transfer to a ceramic terrine. Covered tightly, the pâté can be refrigerated for a week or a bit longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For beans: Place a large sauté pan over medium heat, and heat oil. Add beans, and sauté just until lightly browned. Add onion and garlic, and continue to sauté until onions are just wilted. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For crostini: Brush slices of bread generously on both sides with oil. Toast on both sides in a hot skillet or on a grill until golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place equal portions of beans on each of 6 or 8 plates. Season with salt and cracked pepper to taste. Place two slices of bread on each plate, and pass chicken liver pâté."}], "link": "https://cooking.nytimes.com/recipes/1017988-pan-fried-pole-beans-with-chicken-liver-crostini"}