{"@context": "http://schema.org", "@type": "Recipe", "name": "Frittata With Kasha, Leeks and Spinach", "description": "I like adding cooked grains to a frittata, but you have to choose just the right one; it should be soft, not too chewy. Rice works, and so does bulgur. But if you want to add a grain that will contribute a lot of flavor to a frittata, kasha is your grain. It is wonderfully nutty, and a cup of cooked kasha contributes just the right amount of bulk to make this frittata substantial but not at all heavy. Leeks, cooked down until sweet and tender, a small amount of baby spinach, which always partners well with kasha whether raw or cooked, lots of fresh dill and a little bit of feta are the other components. Serve this for dinner and take leftovers to work for lunch.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/02/07/science/recipehealthkashafrittata/recipehealthkashafrittata-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "mediterranean", "recipeCategory": "breakfast, brunch, dinner, lunch, vegetables", "keywords": "appetizer, main course, fall, spring, summer, winter, gluten-free, halal, kosher, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 57}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 275, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "13 grams", "saturatedFatContent": "4 grams", "sodiumContent": "372 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "2 good-size leeks, white and light green parts only, cut in half lengthwise, cleaned, and sliced thin", "Salt", "3 ounces baby spinach (1/2 bag), rinsed", "Freshly ground black pepper", "6 large or extra-large eggs", "2 tablespoons low-fat milk", "<a href=\"http://cooking.nytimes.com/recipes/1017205-kasha\">1 cup cooked kasha</a>", "1/4 cup chopped fresh dill", "1/2 teaspoon Aleppo pepper", "2 ounces feta, crumbled (1/2 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon olive oil over medium heat in a heavy 10-inch, preferably nonstick skillet. Add leeks and cook, stirring, until they begin to wilt, about 3 minutes. Add a generous pinch of salt and continue to cook, stirring often, until leeks are soft and fragrant, 4 to 5 more minutes. Stir in baby spinach a handful at a time and turn up heat so that spinach wilts in liquid left on leaves after washing. Season with salt and pepper. Transfer contents of pan to a strainer and allow liquid to drip for 20 to 30 minutes, or longer. Rinse out and dry skillet and return to stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat eggs in a large bowl. Stir in salt (I use 1/2 teaspoon), pepper, milk, kasha, leek and spinach mixture, dill, Aleppo pepper and feta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining olive oil over medium-high heat in the 10-inch skillet. Hold your hand above it; it should feel hot. Drop a bit of egg into pan and if it sizzles and cooks at once, pan is ready. Scrape in egg mixture. Swirl pan to distribute eggs and filling evenly over surface. Shake pan gently, tilting it slightly with one hand while lifting up edges of frittata with the spatula in your other hand, to let eggs run underneath and form a few layers during first few minutes of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once a few layers of egg have set, turn heat down to very low, cover (use a pizza pan if you don’t have a lid that will fit your skillet), and cook 10 minutes, shaking pan gently every once in a while. From time to time remove lid and loosen the bottom of the frittata with a spatula, tilting the pan, so that more egg runs underneath."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": ". Meanwhile, heat broiler. Uncover pan and place under the broiler, not too close to the heat, for 1 to 3 minutes, watching very carefully to make sure top doesn’t burn (at most, it should brown very slightly and puff under the broiler). Remove from heat, shake the pan to make sure the frittata isn’t sticking, and allow it to cool for at least 5 minutes and for up to 15. Loosen edges with a wooden or heat-proof rubber spatula. Carefully slide frittata from pan onto a large round platter or plate. Cut into wedges or into smaller bite-size diamonds. Serve hot, warm, room temperature, or cold."}], "link": "https://cooking.nytimes.com/recipes/1017206-frittata-with-kasha-leeks-and-spinach"}