{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Roasted Fish Fillets With Herb Butter", "description": "A blast of heat in a cast-iron pan and a basting of golden butter does wonders for plain fish fillets. This life-changing method is adopted from a former chef and current fishmonger, Mark Usewicz of Mermaid’s Garden in Brooklyn, who also teaches cooking classes in topics like “How to Cook Fish in a New York City Apartment.” The cooking time is so short that the smell — which, if your fish is fresh and not funky, should not be overpowering — will dissipate quickly. And in the meantime, you have an easy dinner of tender fish with a toothsome crust, anointed with nutty, lemony brown butter and perfumed with herbs.\n\nYou can use virtually any fish fillet, skin on or off, as long as it is not too thick. If the butter is browning too fast, reduce the heat and add a nut of cold butter to prevent scorching, or squeeze in the juice of half a lemon.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/04/15/multimedia/recipelab-fish/recipelab-fish-mediumThreeByTwo440.jpg", "totalTime": "PT20M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, quick", "keywords": "fish fillets, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1982}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 461, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "3 grams", "proteinContent": "29 grams", "saturatedFatContent": "10 grams", "sodiumContent": "471 milligrams", "sugarContent": "0 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 5- to 6-ounce fish fillets, like black bass, haddock, fluke, striped bass, tilefish, snapper or salmon, 1/2- to 1-inch thick", "Salt and ground black pepper", "3 tablespoons grapeseed or canola oil", "2 tablespoons unsalted butter", "2 sprigs fresh thyme, tarragon, chives or another herb", "1 tablespoon chopped flat-leaf parsley, optional", "Lemon wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat fillets dry with a paper towel. Season on both sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a heavy 10-inch nonstick or cast-iron skillet over high heat. When the pan is hot, add the oil. Place the fillets in the pan, skin side down (if applicable), laying them down away from your body. If fillets have skin, press down gently with a spatula for about 20 seconds to prevent curling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower heat to medium and let sizzle until fish is golden and caramelized around edges, about 2 to 3 minutes. Carefully flip fillets and add butter and thyme to pan. Tilt pan slightly to let the melted butter pool at one end. Use a spoon to baste the fish with the pooled butter. Continue basting until golden all over and cooked through, 45 to 90 seconds more, depending on the thickness of your fish. Serve immediately with chopped parsley (if using) and lemon wedges."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Recipe Lab: Pan-Roasted Fish Fillets", "description": "Julia Moskin pan-roasts fish with fresh herbs and butter.", "thumbnailUrl": "https://static01.nyt.com/images/2015/04/15/multimedia/recipelab-fish/recipelab-fish-mediumThreeByTwo440.jpg", "uploadDate": "2015-04-20T16:02:05.000Z", "duration": "PT1M2S"}, "link": "https://cooking.nytimes.com/recipes/1017360-pan-roasted-fish-fillets-with-herb-butter"}