{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggplant Walnut Ricotta Rolls With Fresh Greens and Basil Salad", "description": "If you're looking to wow your crowd this Thanksgiving, consider these festive eggplant rolls. Courtesy of reader Christine Vartanian Datian of Las Vegas, these decadent rolls of Japanese eggplant strips, ricotta and walnuts are colorful and tasty, with an added crunch.\n\nMs. Datian said the dish is influenced by her Armenian heritage. Sometimes she substitutes almonds or pecans for the walnuts and sour cream for the ricotta, depending on her guests, but her preference is the combination of walnuts and ricotta, layered on the strips of Japanese eggplant. She serves it as both an appetizer and a main course, next to a fig and basil salad and with a variety of California red and white wines. She garnishes the dish with parsley and green onions to add more color.\n\n\"It's very, very pretty,\" said Ms. Datian. \"The ricotta and the walnuts with the crunch factor -- people like it, and children like it too.\"", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2015/11/06/science/welleggplant/welleggplant-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "recipeIngredient": ["6 Japanese eggplants, sliced lengthwise in 1/2-inch slices", "Kosher salt", "1 1/2 cups ricotta cheese", "1/2 cup finely ground walnuts, (about 1 cup whole walnuts ground in a food processor)", "2 cloves garlic, finely grated or chopped", "2-3 tablespoons olive oil", "1 teaspoon dried dill", "1/2 teaspoon sea salt", "1/2 teaspoon nutmeg", "Juice and zest from 1 lemon", "Canola oil", "8-10 cups mixed salad greens", "3 tablespoons extra virgin olive oil", "1 tablespoon balsamic vinegar", "¼ cup candied walnuts", "1 handful basil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash eggplants, cut off and discard stems. On a cutting board, using a mandoline or sharp knife, slice each eggplant lengthwise in long pieces, 1/2-inch thick. Sprinkle eggplant slices with Kosher salt and place in a large colander to drain for 15 to 20 minutes. Discard liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine the ricotta cheese, walnuts, garlic, olive oil, dill, sea salt, nutmeg, lemon juice and lemon zest. Mix all ingredients until smooth in texture and set aside. (Ricotta filling should be chilled until ready to use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large deep skillet, pour ½-inch canola oil and heat over medium heat until oil is hot. Blot the pieces of eggplant with paper towel to remove any water droplets and fry eggplant slices in batches until golden brown on both sides, about 90 seconds per side. Remove from pan to drain flat on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place slices of eggplant on a tray or dish and spread a tablespoon or two of the ricotta filling across each slice; roll up pin-wheel style and repeat until all eggplant slices have been filled and rolled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, toss the salad greens with olive oil and balsamic vinegar. Arrange the mixed greens on four serving plates and serve with eggplant walnut ricotta rolls. Toss torn basil leaves over the salad. Garnish salad with candied walnuts."}], "link": "https://cooking.nytimes.com/recipes/1017803-eggplant-walnut-ricotta-rolls-with-fresh-greens-and-basil-salad"}