{"@context": "http://schema.org", "@type": "Recipe", "name": "Jamaican Beef Patties", "description": "New Yorkers love their hand-helds. The folded pizza slice, the hot dog and the crusty knish have a built-in mobility that lets hungry New Yorkers eat on the street, and enough density to carry them through to the next meal.\n\nNew immigrants have added to the on-the-go family, introducing Colombian arepas, Mexican tacos and Uzbek samsas. But the hand-held with the best shot at making the list of classic New York noshes is the Jamaican beef patty, a rectangle of flaky yellow crust filled with ground beef shot through with onion, thyme and the inimitable heat and perfume of Scotch bonnet chili peppers.\n\nThe patties are familiar to New Yorkers who order bland commercial versions sold at numerous pizzerias. But they cannot compare to the fresh, handcrafted patties found at a handful of Jamaican bakeries here. The flakiest crusts are still made with a hefty percentage of beef suet, and the most memorable fillings are unabashedly hot.\n\nThe Jamaican patty is served wrapped in coco bread, which is like an oversize, slightly sweet hamburger bun. It is called coco bread not because it contains coconut (it doesn't), but because you split it open like a coconut. Although the combination first appears dauntingly starchy, the soft sweetness of the bread nicely offsets the spicy filling and the crisp crust.", "author": {"@type": "Person", "name": "Julia Moskin And Kim Severson"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "12 patties", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "beef suet, chili pepper, ground beef, scallion, turmeric, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 64}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 313, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "11 grams", "sodiumContent": "179 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["4 cups all-purpose flour", "2 teaspoons salt", "2 teaspoons turmeric", "1 teaspoon curry powder, preferably West Indian", "1 ½ cups cold vegetable shortening or chopped beef suet (about 12 ounces)", "2 tablespoons vegetable oil", "5 scallions, finely chopped", "1 medium onion, finely chopped", "4 cloves garlic, finely chopped", "1 Scotch bonnet chili pepper, seeded and finely chopped", "½ teaspoon paprika", "¼ teaspoon ground allspice", "1 pound ground beef, about 80 percent lean", "2 teaspoons thyme leaves", "1 teaspoon salt", "1 teaspoon black pepper", "1 teaspoon sugar", "Coco bread, hamburger buns or soft potato buns, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix flour, salt, turmeric and curry powder in a large bowl. Add shortening or suet and use your fingertips to rub it together with flour. When shortening is in small pieces and covered with flour, pour in ½ cup ice water and mix with your hands. Keep adding ice water, a few tablespoons at a time, until mixture forms a dough. It may be slightly sticky. Knead dough for two minutes, form into two disks, wrap in plastic and refrigerate while you make filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a deep skillet over medium heat and add scallions, onion, garlic and half the chili pepper. Cook, stirring, until softened but not browned. Add paprika and allspice and stir to coat. Add beef and thyme and stir, breaking up any clumps. Add water just to cover meat. Mix in salt, pepper and sugar and bring to a simmer. Taste for seasonings, adding salt, pepper and chili pepper, if necessary; mixture should be quite spicy. Simmer about 30 minutes, until meat is soft and water is reduced to a sauce. Set aside to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Remove one disk of dough from refrigerator and divide it in half. Roll out one half on a lightly floured surface until large enough to cut three circles, each about 6 inches across. (Use the rim of a bowl turned upside down as a guide.) Repeat with remaining dough, setting aside the circles. Use scraps to make additional small patties, if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to fill, have ready a fork for crimping and a bowl of water. Place two tablespoons of filling on lower half of one circle. Dip a finger into water and moisten the edge of the dough. Fold the top half over, pulling dough gently over filling and making a thick edge all around. Crimp edge with a fork and transfer to an ungreased baking sheet, preferably nonstick. Repeat with remaining dough and filling. Bake about 25 minutes, until top crust is firm and golden. Serve hot as is or inside buns."}], "link": "https://cooking.nytimes.com/recipes/1017315-jamaican-beef-patties"}