{"@context": "http://schema.org", "@type": "Recipe", "name": "Leek or Spinach Soufflé Pudding", "description": "When a soufflé is cooked slowly, as this one is, in a water bath, it often has the word ‘‘pudding’’ appended to it. I like the word, so I don’t mind the practice, but this soufflé is airy and closer to its Webster’s etymology — ‘‘a murmuring or blowing sound’’ — than the appendage suggests. It has less flour than a regular soufflé. It needs less scaffolding. This soufflé is equally good with either vegetable; it can be made hours ahead and will rise again upon reheating.", "author": {"@type": "Person", "name": "Tamar Adler"}, "image": "https://static01.nyt.com/images/2015/10/11/magazine/11eat_large/11mag-11eat-t_CA1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, lunch", "keywords": "side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 54}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 372, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "14 grams", "sodiumContent": "238 milligrams", "sugarContent": "8 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["825 grams or 9-10 cups thinly sliced, white and light green parts of leeks or an equivalent amount of wilted spinach (or sautéed zucchini), completely drained in a dish towel and puréed", "125 grams butter divided into 100 grams and 25 grams", "25 grams all-purpose flour", "1 cup whole milk", "1/2 cup grated Parmesan", "6 eggs, separated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sweat the leeks in 100 grams of butter with salt until just barely beginning to brown and totally dry, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a béchamel by melting the remaining butter in a small pot, then adding the flour, stirring to combine, and then slowly adding the milk, whisking, until it boils and thickens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cook 2 to 3 minutes. Turn off burner."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender, blend the vegetables and béchamel until totally smooth. Add the Parmesan and then the yolks, one at a time, until it is all incorporated. Pour into a large mixing bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325. Place a medium- to high-sided ovenproof container into which a loaf pan or 1 1/2- or 2-quart soufflé mold can fit on a rack in the middle of the oven. Heat water in a kettle. Fill the container in the oven about halfway, keeping extra water for filling more once you’ve put the soufflé pudding in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the whites to stiff peaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly butter the pan or mold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently fold a third of the beaten whites into the vegetable, béchamel and yolk mixture to lighten it. Then fold in the rest, and add to the pan or mold. Place this into the water bath in the oven. Water should come 2/3 of the way up its sides. Lightly cover with a loose piece of buttered or oiled aluminum foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook for 1 1/2 hours, or a little more, until the soufflé has risen at least an inch above the pan or mold — remove foil when the soufflé begins to push against it — and the top cracks. Let cool for a few minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1017740-leek-or-spinach-souffle-pudding"}