{"@context": "http://schema.org", "@type": "Recipe", "name": "Garlicky Pork Burger", "description": "If you are cautious, you can cook a little meat and then taste it. Though there are virtually no reported cases of trichinosis from commercial pork in the United States, few people will sample raw pork — or lamb, with which the danger is even less. So the thing to do is season the meat, then cook up a spoonful in a skillet, taste and season as necessary.\n\nRemember that the burger is the cousin not only of the steak — which often takes no seasoning beyond salt and pepper — but also of the meatloaf and the meatball, both of which are highly seasoned. Think about adding minced garlic in small quantities, chopped onion, herbs (especially parsley), grated Parmesan, minced ginger, the old reliable Worcestershire, hot sauce, good chili powder and so on. It’s hard to go wrong here.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, quick, burgers", "keywords": "main course, pork shoulder", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 476, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "1 gram", "proteinContent": "34 grams", "saturatedFatContent": "12 grams", "sodiumContent": "468 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 to 2 pounds fatty pork shoulder, in chunks", "1 teaspoon salt, more to taste", "1 teaspoon freshly ground black pepper, more to taste", "1 teaspoon minced garlic", "1 tablespoon fennel seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start a charcoal or wood fire or preheat a gas grill. Or, on stove top, heat a large, heavy skillet over medium-high heat for 3 or 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put meat, salt, pepper, garlic and fennel in food processor, in batches if necessary, and pulse until coarsely ground: finer than chopped, but not much. Put it in a bowl and sprinkle with salt and pepper. Taste, then add more seasoning if necessary. (If desired, cook a teaspoon of meat in a pan before tasting.) Handling meat as little as possible to avoid compressing it, shape it lightly into 4 or more burgers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fire is hot enough when you can barely stand to hold your hand 3 or 4 inches over rack for a few seconds. Grill burgers about 5 minutes a side, or until medium. (Timing on stove top is the same.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve on buns, toast or hard rolls, garnished as you like."}]}