{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Wheat Sesame Rings (Simit)", "description": "These look like bagels with bigger holes, but the bread is denser and defined by the thick coating of sesame seeds that gives them their delicious flavor.  I first encountered simit in Athens, then in Egypt, where they are a popular street food, as they are in Turkey. In the past I have dipped the rings into beaten egg before coating with sesame seeds. But I’ve been looking at various recipes lately and see that many Turkish bakers dip their rings into grape or pomegranate molasses diffused with water before coating. I like this method because it enhances the browning effect during baking and leaves a slightly sweet flavor on the surface of the breads. Turkish bakers also sometimes add a ground mahlab (sour cherry kernels) to their dough for added flavor. One way to ensure that most of the sesame seeds will continue to adhere to the breads after they cool is to brush with egg white when you rotate the pans after 20 minutes of baking. The version I am giving you is made with a combination of semolina, all-purpose and (mostly) whole wheat flour, which is totally inauthentic but nevertheless, delicious. If you want a less dense bread, use half unbleached all purpose flour.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/30/science/recipehealthsesamerings/recipehealthsesamerings-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "8 to 10 rings", "recipeCuisine": "mediterranean", "recipeCategory": "breakfast, brunch, dinner, lunch, snack, breads", "keywords": "dairy-free, halal, high fiber, kosher, low sugar, nut-free, vegetarian, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 15}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 246, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "1 gram", "sodiumContent": "233 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["85 grams / about 1/2 cup semolina flour", "95 grams / about 3/4 cup unbleached all purpose flour", "330 grams / about 2 2/3 cups whole wheat flour", "1 1/4 teaspoons salt", "1 teaspoon ground mahlab (optional)", "3/4 teaspoon instant yeast", "1 1/2 cups / 355 ml lukewarm water", "1 tablespoon agave syrup, malt syrup, or honey", "1 egg, beaten or 2 tablespoons grape or pomegranate molasses dissolved in 1/4 cup water", "1 cup / 100 grams toasted sesame seeds", "Optional: 1 egg white, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine flours, salt and optional mahlab in a large bowl or the bowl of a stand mixer fitted with the paddle and stir together or mix at low speed until combined. Dissolve yeast in water. Add agave syrup or honey and stir together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At low speed, add water and yeast mixture to flour and mix for 1 minute. Remove paddle and let sit for 5 minutes. Change to dough hook and mix dough (or knead by hand) for about 5 minutes. Dough will be stiff and slightly sticky. Let sit for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil work surface and shape dough into a ball. Clean, dry and lightly oil mixing bowl and place dough in it, rounded side down first, then rounded side up. Cover bowl with plastic (plastic should not be touching dough) and let rise at room temperature for about 3 hours, until doubled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 2 baking sheets with parchment and lightly oil parchment. In a wide bowl, combine pomegranate or grape molasses and 1/4 cup water and stir together, or beat egg with 2 tablespoons water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough onto a lightly oiled work surface and shape into a ball. Divide into 8 to 10 equal pieces and shape each piece into a ball. Cover loosely with plastic and let sit for 20 minutes. Roll out each piece into a rope, approximately 12 to 14 inches long.  Holding one end of the rope, twist it a few times, then join ends together, overlapping by about an inch and pinching together so they stay connected. The hole should be about 2  to 2 1/2 inches. Dip into molasses solution or egg, coating both sides well, then dip into sesame seeds, flip over and coat other side. Place on baking sheets, allowing at least 1 inch of space between rings. Cover loosely with plastic and let rest for 20 to 30 minutes. Meanwhile heat oven to 400 degrees with the rack arranged in the middle. Place a pan on the bottom of the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully pour 1 cup of water into the tin on the floor of the oven. Bake each sheet on the middle rack of the oven for 30 to 35 minutes (you can refrigerate the second baking sheet while the first one is baking to prevent the rings from rising too much), flipping the rings over so they don’t brown too much on one side after 15 to 20 minutes, and if desired, brushing with egg white halfway through. Another way to prevent too much browning on the bottom is to slide another baking sheet under baking sheet (if you have enough of them to spare). Remove pan of water after 10 minutes. Rings should be dark brown and respond to tapping on the bottom with a hollow sound. Remove from heat and cool before eating."}], "link": "https://cooking.nytimes.com/recipes/1017093-whole-wheat-sesame-rings-simit"}