{"@context": "http://schema.org", "@type": "Recipe", "name": "Filipino Embutido", "description": "This recipe for embutido, a festive Filipino meatloaf featuring ingredients that appeared in the Philippines during the American occupation, is adapted from Emma Phojanakong. She often prepares it as a stuffing for chicken; inspired by that, this recipe features a simple citrus-and-soy-spiked chicken sauce to go alongside. Serve it with watercress and steamed white rice, but it also makes great next-day sandwiches.", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2015/01/11/magazine/11eat/11eat-articleLarge-v6.jpg", "totalTime": "PT2H", "recipeYield": "6-8 servings", "recipeCuisine": "filipino", "recipeCategory": "dinner", "keywords": "calamansi, Edam cheese, eggs, ham, peas, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 106}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 472, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "1 gram", "proteinContent": "29 grams", "saturatedFatContent": "14 grams", "sodiumContent": "975 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 large eggs", "1/4 pound Edam cheese, grated", "3/4 cup finely diced smoked ham", "3/4 cup fresh or frozen peas", "1/3 cup raisins", "1/2 medium onion, finely minced", "4 canned Vienna sausages, thoroughly mashed with a fork", "1/3 cup sweet relish", "3 tablespoons ketchup", "1 teaspoon kosher salt, or to taste", "Black pepper, to taste", "1 1/2 pounds ground pork", "4 1/2 tablespoons calamansi juice (or combine equal parts lime and orange juice with a pinch of orange zest)", "3 tablespoons soy sauce", "3 cups best-quality low-sodium chicken broth", "1 tablespoon cornstarch", "3 tablespoons butter, cut in chunks", "1 bunch watercress."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 300. Put 2 eggs in a saucepan, and cover with cold water. Bring to a boil, cover, turn off heat and let sit for 5 minutes. Remove eggs, and place in cold water to cool, then peel and cut in half lengthwise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, beat the remaining 2 eggs, and combine with the cheese, ham, peas, raisins, onion, sausages, relish, ketchup, salt and a few cracks of black pepper. Fold in the ground pork, then mix it with your hands until thoroughly combined and the mixture starts to stick together. Heat a dry frying pan over medium heat, and cook a spoonful of the mixture. Taste the mixture, and add more salt or pepper if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large baking pan with greased foil, leaving some overhang on all sides. Spread the embutido mixture into a rectangle about 12 by 17 inches. Place the boiled egg halves in a line down one of the long sides of the rectangle. Starting from that edge, lift the foil to roll the meat mixture — with the eggs — over itself, and roll all the way to the other side to form a cylinder (like a jelly roll). Pat the embutido to create a uniform shape, and wrap the foil tightly around it, crimping the ends to seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the foil-wrapped embutido in the center of the pan, and place in the oven. After 45 minutes, remove the embutido and turn on the broiler. Unwrap the foil and let embutido rest for 10 minutes, then broil until lightly browned, about 3 minutes. Let rest 3 minutes, then slice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the embutido is roasting, set a small saucepan over medium-high heat and combine 3 tablespoons calamansi juice, soy sauce and broth. Simmer until reduced by half. Thoroughly combine the cornstarch with the remaining calamansi juice and whisk into the sauce. Bring to a boil, and when it is thickened, remove from heat. When embutido is cooked, reheat sauce over medium heat until steaming, then whisk in butter, one chunk at a time, to emulsify."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve embutido on a platter with watercress and sauce, with steamed white rice on the side."}], "link": "https://cooking.nytimes.com/recipes/1017120-filipino-embutido"}