{"@context": "http://schema.org", "@type": "Recipe", "name": "La Pomme Sourde", "description": "This drink is adapted from one offered on the opening menu at Le Syndicat, a Paris cocktail bar that uses only French products in its drinks. As with most of the bar’s cocktails, it requires a little labor, but the pink peppercorn-infused cider syrup is easier to make than it looks. The bartender and owner, Sullivan Doh, called the cocktail “fresh and thirst-quenching” and “an interesting drink for hot days.” It delivers a riot of fruit flavors from the two layers of apple (the Calvados and the cider), the lemon juice and various fruit notes lurking in the French aperitif Byrrh. Think of it as the kind of julep you might drink on Bastille Day.", "author": {"@type": "Person", "name": "Robert Simonson"}, "image": "https://static01.nyt.com/images/2015/05/13/dining/13FRENCH3/13FRENCH3-articleLarge-v2.jpg", "totalTime": "PT10M", "recipeYield": "1 drink", "recipeCuisine": "french", "recipeCategory": "for one, quick", "keywords": "calvados, cucumber, hard cider, lemon juice, pink peppercorns", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "recipeIngredient": ["1 teaspoon pink peppercorns", "2/3 cup hard cider", "2/3 cup sugar", "2 slices of cucumber, about 1/8 inch", "6 to 8 mint leaves, plus a sprig for garnish", "1 1/2 ounces Calvados", "1/2 ounce Byrrh aperitif", "2/3 ounce lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the syrup:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Muddle the pink peppercorns in a pot with the hard cider. Bring to a boil. Remove from heat and let sit for 5 minutes. Strain the contents. Add the sugar and stir until dissolved. There will be leftover syrup."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the drink:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Muddle 2 cucumber slices at the bottom of a cocktail shaker. Slap the mint leaves gently across your hand, gently tear them, then drop into shaker. Add ice, 2/3 ounce of the pink peppercorn-infused cider syrup, the Calvados, Byrrh and lemon juice. Shake vigorously, about 20 seconds. Strain into a metal cup (the sort used for mint juleps) filled with a few ice cubes. Garnish with the spring of mint and a cucumber slice."}]}]}