{"@context": "http://schema.org", "@type": "Recipe", "name": "Cauliflower, Potato and Quinoa Patties", "description": "Cauliflower is a great vegetable to use in a burger, because it breaks down nicely so that it can be mashed along with potatoes to form a burger that stays together. I have always loved seasoning this vegetable with Indian spices, which is what I do here, with Aleppo pepper thrown into the mix. Black quinoa contributes texture, color and protein. Sriracha sauce is the perfect “ketchup” for this burger.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/02/07/science/recipehealthpatties/recipehealthpatties-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "9 to 12 patties, depending on size", "recipeCuisine": "american", "recipeCategory": "dinner, lunch", "keywords": "dairy-free, gluten-free, halal, kosher, low cholesterol, low-sodium, low sugar, nut-free, vegan, vegetarian, fall, spring, summer, winter, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 158}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 262, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "6 grams", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "383 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["3 cups finely minced cauliflower (about 12 ounces, or 1/2 medium cauliflower)", "salt to taste", "1 1/2 pounds potatoes, scrubbed, peeled if desired and quartered", "1/2 cup chopped cilantro", "2 teaspoons toasted cumin seeds, lightly crushed in a mortar and pestle", "2 teaspoons nigella seeds", "1 teaspoon garam masala", "1/2 teaspoon Aleppo pepper or mild chili powder", "Freshly ground black pepper to taste", "1/2 cup cooked black quinoa", "1 cup mixed black and white sesame seeds", "1/4 cup grapeseed oil", "Sriracha sauce for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam potatoes over 1 inch of boiling water until tender, 15 to 20 minutes.\nTransfer to a bowl and mash with a fork. The skins will break up in the mash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line steamer with cheesecloth and place cauliflower on cheesecloth so the\nsmall pieces don’t fall through. Steam 5 to 6 minutes, until very tender. Remove from heat and stir into potatoes. Add remaining ingredients except sesame seeds and oil. Season generously with salt, combine well, taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place sesame seeds in a wide bowl. Scoop out about 1/3 cup of cauliflower-potato mixture and roll into a ball (moisten your hands to prevent sticking). Roll in the seeds, then gently flatten into a patty shape. Place on a plate or sheet pan and continue to shape all of the patties. If you have time, refrigerate for 1 hour or longer (I have made these with no problem without refrigerating first)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to cook, place a rack over a sheet pan and cover the rack with paper towels. Heat 2 tablespoons oil in a large, heavy nonstick frying pan over high heat. When pan is hot, swirl to coat with oil. Turn heat down to medium. Place 3 to 5 patties in the pan (do not crowd), and cook until well browned on one side, 3 to 4 minutes. Turn and brown for 3 to 4 more minutes. Remove to rack. Heat remaining oil in the pan and cook remaining patties. Remove paper towels from underneath patties and keep them warm in a low oven until ready to serve. Serve topped with Sriracha, with a salad on the side."}]}