{"@context": "http://schema.org", "@type": "Recipe", "name": "Blowout Rib-Eye", "description": "A huge rib-eye, cooked slowly then quickly – whether on a grill or in the oven – will yield perfectly cooked meat. The cost of the cut may seem like a lot to pay for a piece of meat, but if it’s local and well raised, with better flavor, texture and karma than cheaper commodity beef, it’s worth it for a table of four. You might think sauce is overkill with a rib-eye like this, but playing steakhouse chef means dreaming up the accompanying sauces that you would most like to see on the table. My favorite is what I call ‘‘<a href=\"http://cooking.nytimes.com/recipes/1017619-blue-butter\">blue butter</a>,’’ a blend of blue cheese and butter.\n\nIf blue cheese isn't your thing, try <a href=\"http://cooking.nytimes.com/recipes/1017620-creamed-spinach-sauce\">creamed spinach sauce</a>, <a href=\"http://cooking.nytimes.com/recipes/1017621-chile-chimichurri\">chile chimichurri</a>, <a href=\"http://cooking.nytimes.com/recipes/1017622-tomato-nam-prik\">tomato nam prik</a> or <a href=\"http://cooking.nytimes.com/recipes/1017623-bourbon-balsamic-syrup\">bourbon balsamic syrup</a>.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/08/16/magazine/16eat1/16mag-16eat-t_CA0-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "barbecue", "recipeCategory": "dinner, steaks and chops", "keywords": "main course, steak", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 151}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 636, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "51 grams", "fiberContent": "0 grams", "proteinContent": "44 grams", "saturatedFatContent": "23 grams", "sodiumContent": "661 milligrams", "sugarContent": "0 grams", "transFatContent": "3 grams"}, "recipeIngredient": ["1 bone-in rib-eye, 2 to 3 inches thick (about 2 1/2 pounds)", "Salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a charcoal or gas grill for indirect cooking so that one section of the grate is quite hot and there is no heat under the other part. (Or put a dry cast-iron skillet in the oven and turn the heat to 325.) If the steak is floppy (and the butcher hasn’t done it already), tie a string horizontally around it to help it cook evenly. Rub the meat and bone on all sides with salt and pepper, and let it come to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the steak on the cool side of the grill (or in the hot pan) so that the bone is toward the hot side. Cover, and cook until it releases evenly from the grates or pan and has an internal temperature of about 100 degrees, 5 to 15 minutes, depending on the thickness of the cut and the heat of the grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Move the steak to the hot part of the grill, and cook, undisturbed, until it sears and releases easily, 2 to 5 minutes. (If indoors, transfer the skillet to the stove over medium-high heat.) Repeat with the other side, cooking it to one stage before your desired doneness. If you want truly rare, remove the steak when its interior measures 125 degrees, or even a little bit less; for medium-rare, 135 degrees is about right. Let the rib-eye rest on a surface that will capture any juices for at least 5 and up to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the string if you used one, and cut away the bone. Slice as thickly or thinly as you like, and serve with the meat juices and any of the sauces."}]}