{"@context": "http://schema.org", "@type": "Recipe", "name": "American 25", "description": "This drink, intended as a holiday-season quaff, is a simple riff on the French 75, a Prohibition-era Champagne cocktail that includes lemon juice, simple syrup and —depending on which scholar or bartender you consult — gin or Cognac. (Both versions taste good.) Substituting for the traditional spirit is flavorful, fruity apple brandy (make certain you get the bonded version) and peaty Scotch (either single malt or blended will do, as long as there’s plenty of smoke on it). The two are natural liquid partners. The aromatic, effervescent result is as pleasing to the nose as it is to the tongue. The name is a nod to the provenance of the primary spirit (apple brandy is as old as the republic) and the day of year it’s meant for, Christmas.", "author": {"@type": "Person", "name": "Robert Simonson"}, "image": "https://static01.nyt.com/images/2014/12/24/dining/24TOAST_RECIPE/24TOAST_RECIPE-articleLarge.jpg", "totalTime": "PT2M", "recipeYield": "1 drink", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "apple brandy, champagne, scotch, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 71}, "recipeIngredient": ["1 ounce bonded apple brandy, preferably Laird’s", "1/4 ounce smoky Scotch (Peat Monster and Laphroaig 10-year-old are good options)", "1/2 ounce fresh lemon juice", "1/2 ounce simple syrup (see note)", "3 to 4 ounces Champagne", "Lemon twist"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a cocktail shaker filled three-quarters with ice, combine the apple brandy, Scotch, lemon juice and simple syrup. Shake until chilled, about 30 seconds. Strain into a flute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top with chilled Champagne. Squeeze the lemon twist over the glass, rub it across the rim, then drop it into the drink."}], "link": "https://cooking.nytimes.com/recipes/1017086-american-25"}