{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp in Green Mole", "description": "There are only three basic steps to making green mole: Whip up a purée of toasted pumpkin seeds, tomatillos and chiles in a blender; sear the purée in oil and cook it until it thickens slightly; then add chicken stock and simmer until the mixture is creamy. Once the sauce is done, you can poach shrimp right in it; it only takes five to eight minutes to cook them in the simmering mole. Better yet, you can make the sauce up to three days ahead and keep it refrigerated until you’re ready to use it, or freeze it (whisk or blend to restore its consistency after thawing).", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2016/01/06/dining/06MARTHA/06MARTHA-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "", "keywords": "gluten-free, main course, pumpkin seeds, serrano chile, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 132}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 262, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "24 grams", "saturatedFatContent": "3 grams", "sodiumContent": "774 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup hulled untoasted pumpkin seeds", "1/2 pound tomatillos, husked, rinsed and coarsely chopped", "1 serrano chile or 1/2 jalapeño (more to taste), stemmed and roughly chopped", "3 large romaine lettuce leaves, preferably the outer leaves, torn into pieces", "1/4 cup chopped white onion, soaked for 5 minutes in cold water, drained and rinsed", "2 garlic cloves, peeled", "1/4 cup tightly packed chopped cilantro, plus cilantro leaves and sprigs for garnish", "1 1/2 cups chicken stock", "1 tablespoon canola or extra-virgin olive oil", "1/2 teaspoon cumin seeds, ground", "Kosher salt and black pepper, to taste", "1 pound medium shrimp, shelled and deveined", "Rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a heavy straight-sided skillet or a saucepan over medium heat and add pumpkin seeds. Wait until you hear one seed pop, then stir constantly until they have puffed and popped and smell toasty, about 3 to 5 minutes. Do not let them darken beyond golden or they will taste bitter. Transfer to a bowl and allow to cool. Remove 2 tablespoons to use as garnish and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place remaining cooled pumpkin seeds in a blender and add tomatillos, chile, lettuce, onion, garlic, cilantro and 1/2 cup chicken stock. Cover blender and blend mixture until smooth, stopping the blender to stir if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in the skillet or saucepan over medium-high heat. Add cumin and let it sizzle for a couple of seconds, then add puréed tomatillo mixture. Cook, stirring often, until sauce darkens and thickens, 8 to 10 minutes. It will splutter, so be careful. You can hold the lid above the pot to shield yourself and the stove, or set the lid on the pot to partly cover it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining cup of chicken stock, bring to a simmer, reduce heat to medium-low and simmer, uncovered, stirring often, until sauce is thick and creamy, 10 to 20 minutes. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season shrimp with salt and pepper. Shortly before serving, bring mole sauce to a simmer and add shrimp. Simmer 5 to 8 minutes, until the shrimp are cooked through but still moist. Serve over rice, garnishing each serving with toasted pumpkin seeds and cilantro."}], "link": "https://cooking.nytimes.com/recipes/1017911-shrimp-in-green-mole"}