{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick Pizza Dough", "description": "The trouble with most homemade pizza dough recipes is that they’re sort of a pain. You have to plan ahead. Knead the dough. Let it rise. Clean up after it. This might be the pizza dough recipe that finally persuades you it’s worth the effort — what little effort is required. With the help of two allies in the kitchen — your food processor and your freezer  —  now homemade pizza dough is nearly as simple as taking a chicken breast out of the freezer to thaw on your way out the door in the morning.", "author": {"@type": "Person", "name": "Suzanne Lenzer"}, "image": "https://static01.nyt.com/images/2015/04/08/dining/20150408PIZZA-slide-OI5A/20150408PIZZA-slide-OI5A-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 crusts (4 servings)", "recipeCuisine": "", "recipeCategory": "pizza and calzones", "keywords": "active dry yeast, bread flour, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 904}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 500, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "76 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "2 grams", "sodiumContent": "414 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2 3/4 cups/390 grams bread flour", "2 1/2 teaspoons/7 grams active dry yeast (1 packet)", "2 teaspoons sea salt", "1/4 cup extra-virgin olive oil", "1 cup warm water", "2 or 3 tablespoons medium or coarse cornmeal"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the dough:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the flour, yeast and salt in a food processor. With the machine running, pour the oil through the feed tube, then add the water in a slow, steady stream. Continue to process for 2 to 3 minutes (the dough should form a rough ball and ride around in the processor). The finished dough should be soft, slightly sticky and elastic. If too dry, add a bit more water; if too wet, a tablespoon or so more flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay a 12-inch-long piece of plastic wrap on a clean work surface. Work the dough into a rectangle on the plastic, about 8 inches long and 6 inches wide. Press your fingers into the top of the dough all over, making indentations as though it were a focaccia. Fold the left third of the dough over (as you would a letter) and repeat the indentations. Fold the right third over and make the indentations again. Cover the folded dough with plastic wrap and let rise for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the dough in half, form each piece into a neat ball, wrap tightly in plastic wrap and transfer to the freezer. The morning before you want to make pizza, transfer the dough to the refrigerator to thaw."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the pizza:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the dough to room temperature, 15 to 20 minutes. Put a pizza stone in the oven and preheat to 550 degrees. (If you don’t have a stone, oil a rimmed baking sheet and set aside.) Dust a peel or the greased baking sheet generously with cornmeal. Working with the dough in your hands (not flat on a work surface), gently begin to stretch the dough into a circular shape, pressing your fist into the center of the dough and pulling at the edges with your other hand. With both hands, stretch the dough, being careful not to tear it. Working in a circular motion, pull the thicker edges of the dough outward, letting gravity help you. Continue to stretch the dough until it’s relatively even in thickness (the edges will be thicker) and you have the size you want. Carefully lay it on the peel or baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top the pizza as desired and either slide it off the peel and onto your heated stone, or place the baking sheet into the oven. Cook the pizza for 6 to 10 minutes or until the crust is golden and the cheese is bubbling."}]}], "link": "https://cooking.nytimes.com/recipes/1017334-quick-pizza-dough"}