{"@context": "http://schema.org", "@type": "Recipe", "name": "King Cake", "description": "This Carnival cake is more like a brioche, with a bitingly sweet frosting and sugared pecans for crunch. Browse the baby shower section of a party supply store for the Mardi Gras king cake baby, where plastic babies are often sold by the dozen. A large dried bean works too. Tradition dictates that whoever finds the baby is king or queen of the party (and also has to bring the king cake to the next Carnival celebration).", "author": {"@type": "Person", "name": "Sara Bonisteel"}, "image": "https://static01.nyt.com/images/2015/02/13/dining/king-cake/king-cake-articleLarge.jpg", "totalTime": "PT3H15M", "recipeYield": "12 servings", "recipeCuisine": "cajun, creole", "recipeCategory": "snack, breads, cakes", "keywords": "bread flour, cake flour, pecans, sweetened condensed milk, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 231}, "recipeIngredient": ["2 1/4 teaspoon (1 package) active dry yeast", "1/4 cup warm milk", "1 cup plus 6 tablespoons bread flour", "1 tablespoon honey", "3/4 cup cake flour", "2 large eggs plus 1 yolk", "2 tablespoons sugar", "1/2 teaspoon ground cinnamon", "1/2 teaspoon vanilla extract", "1/4 teaspoon almond extract", "1 teaspoon kosher salt", "4 tablespoons unsalted butter at room temperature, plus more for greasing bowl", "1/4 cup unsalted butter", "1 cup pecans, chopped", "1/2 cup light brown sugar, packed", "1 large egg", "1 tablespoon milk", "1/4 cup sweetened condensed milk", "1 teaspoon fresh lemon juice, plus more if needed", "2 cups confectioners’ sugar", "Purple, green and gold dusting sugars, for decorating", "King cake baby"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the dough:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer, dissolve yeast in warm milk along with 6 tablespoons bread flour and the honey. Combine until smooth, about 30 seconds, scraping sides of bowl as needed. Cover bowl with plastic wrap and allow to rise 20 minutes or until doubled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 3/4 cup bread flour, the cake flour, the eggs, the sugar, the cinnamon, the extracts and the salt to the dough and combine with paddle attachment on low. Switch to a dough hook and knead for 2 minutes on medium speed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn speed to medium high and add the butter, 1 tablespoon at a time, to dough, allowing each pat of butter to dissolve into dough before adding the next tablespoon. Mix until dough becomes a slack, tacky ball. If dough doesn’t come together, add up to 1/4 cup more bread flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the dough is kneaded, transfer into a greased bowl and cover. Let rise 1 hour or until doubled."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the filling:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter over low heat. Add sugar, stirring until it dissolves. Remove from heat. Mix in pecans. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with parchment. Lightly flour a large work surface with remaining bread flour (if you used 1/4 cup of bread flour in step 3, use more). Roll out dough into an approximately 6-inch-by-24-inch rectangle, 1/4-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread filling along the length of the rectangle and tightly roll so you have a rope of dough about 2 feet long and 2 inches thick. Pinch seam, and transfer dough to the baking sheet, forming dough into a ring with the seam side down. With wet fingers, pinch ends of dough together. It is fine if the ring looks uneven. Cover dough with plastic wrap or damp towel and let rise about an hour. Heat oven to 375 degrees."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the egg wash:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk egg and milk with a fork until combined. Once dough has risen, use a pastry brush to spread egg wash thinly over the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake cake for 25 to 30 minutes until golden brown. Remove cake from oven and let cool for 5 to 10 minutes. While warm, carefully flip ring over. Using a pairing knife make a small x in the bottom of the cake and insert the king cake baby, if using. Flip cake upright and let cool on a rack."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the frosting:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "While cake cools to room temperature, use a stand mixer on low to whisk condensed milk, lemon juice and confectioners’ sugar until smooth. Add more lemon juice if frosting is too thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cake has cooled, frost using a pastry bag or spatula until the cake is covered. Working quickly, sprinkle iced cake with dusting sugars. Cake is best served fresh, but will keep covered in plastic for a day or two."}]}], "link": "https://cooking.nytimes.com/recipes/1017231-king-cake"}