{"@context": "http://schema.org", "@type": "Recipe", "name": "Okonomi-Latke", "description": "This hybrid of the Japanese okonomiyaki pancake and the traditional Jewish latke is from Sawako Okochi and Aaron Israel, the chefs and owners of Shalom Japan in Williamsburg, Brooklyn. It works beautifully in any setting where you might ordinarily serve latkes and is a fine base for caviars of any hue.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/12/07/magazine/07feast14/07feast14-articleLarge-v5.jpg", "totalTime": "PT30M", "recipeYield": "4 servings.", "recipeCuisine": "japanese, jewish", "recipeCategory": "", "keywords": "green cabbage, onion, potato, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 234}, "recipeIngredient": ["2 cups all-purpose flour", "1/2 cup rice flour", "1 1/2 tablespoons salt", "1 teaspoon sugar", "1/4 teaspoon baking soda", "2 1/2 cups dashi, at room temperature (see Tip)", "1 quart tightly packed, finely sliced green cabbage (about one small head)", "2 cups thinly sliced onion (about one large onion)", "1 quart (3 to 4 large) grated, blanched russet potatoes (see note)", "1 quart bean sprouts, green caps removed", "Canola or vegetable oil, for frying", "Salt and freshly ground black pepper", "Crème fraîche, for serving", "Thinly sliced scallions, for serving", "1  lemon, for squeezing", "Ikura (salmon roe) or other caviar — as much as you like."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Note: To blanch potatoes, bring 4 quarts water and 1/4 cup salt to a boil. Add potatoes immediately after grating, and boil for 2 to 3 minutes. Strain and spread on paper towels to dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the flours, salt, sugar and baking soda. Add the dashi, and whisk until smooth; do not overmix. The batter may be stored, covered and refrigerated, for up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine the cabbage, onion, blanched potatoes, bean sprouts and batter. Mix well, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a 6- or 8-inch nonstick pan or cast-iron skillet over medium-high heat. Add 2 to 3 tablespoons of oil, and heat until almost smoking. Slowly pour all the batter into the pan, and flatten it with the back of a spoon to no more than 1 inch thick. Reduce heat to medium, and cook until the underside starts to crisp and the center to bubble, 3 to 4 minutes. Flip the okonomi-latke, add another tablespoon of oil and cook for another 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the okonomi-latke is browned on the second side, transfer from the heat onto a paper towel to drain some of the oil. Season lightly on both sides with salt and pepper. Cut into quarters, and top with crème fraîche, scallions, a squeeze of lemon juice and ikura."}], "link": "https://cooking.nytimes.com/recipes/1017037-okonomi-latke"}