{"@context": "http://schema.org", "@type": "Recipe", "name": "Schmaltz and Gribenes", "description": "Schmaltz is rendered poultry fat, in this case made from chicken, while gribenes are its crispy, crackling-like byproduct that comes from bits of chicken skin. The key to this recipe is to go low and slow: You want the fat to cook gently and thoroughly so it renders completely without burning. Some would argue that the onion is mandatory and not optional, but if you plan to use the schmaltz for very delicate recipes, or sweet recipes (chilled schmaltz works wonderfully as the fat in pastry dough), feel free to leave it out. Your schmaltz won’t have as deep a flavor, but it will be more versatile. Schmaltz will last for at least a week in the refrigerator and up to six months in the freezer. If your butcher won’t sell it to you, the best way to obtain chicken skin and fat is to collect trimmings in the freezer every time you buy a whole bird. Or you can strip the skin and fat from chicken thighs and save the skinless meat to use in other recipes.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/12/10/dining/10JPSCHMALTZ2/10JPSCHMALTZ2-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "1/2 cup schmaltz, 2 cups gribenes", "recipeCuisine": "jewish", "recipeCategory": "dinner, lunch", "keywords": "chicken skin, kosher salt, onion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 87}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 249, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "0 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": null, "proteinContent": "5 grams", "saturatedFatContent": "7 grams", "sodiumContent": "132 milligrams", "sugarContent": null, "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound chicken skin and fat, diced (use scissors, or freeze then dice with a knife)", "3/4 teaspoon kosher salt", "1/2 medium onion, peeled and cut into 1/4-inch slices (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonstick skillet over medium heat, toss chicken skin and fat with salt and 1 tablespoon water and spread out in one layer. Cook over medium heat for about 15 minutes, until fat starts to render and skin begins to turn golden at the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onions and cook 45 to 60 minutes longer, tossing occasionally, until chicken skin and onions are crispy and richly browned, but not burned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain through a sieve. Reserve the schmaltz. If you want the gribenes to be crispier, return to the skillet and cook over high heat until done to taste. Drain gribenes on a paper-towel-lined plate."}], "link": "https://cooking.nytimes.com/recipes/1017054-schmaltz-and-gribenes"}