{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta Alla Gricia", "description": "The star here is guanciale, which is cured jowl. It is increasingly easy to find, but if you don't have it, use pancetta or even bacon. (It won't be authentic, but it will be really good.)", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/03/22/magazine/22eat2/22eat2-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings.", "recipeCuisine": "italian", "recipeCategory": "pastas", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 262}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 585, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "3 grams", "proteinContent": "21 grams", "saturatedFatContent": "9 grams", "sodiumContent": "499 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces guanciale (cured pig’s jowl), cut  into 1/4-inch pieces", "1/2 teaspoon finely ground black pepper, plus a pinch", "3/4 pound tonnarelli or other long pasta like linguine or spaghetti", "1/4 cup finely grated pecorino Romano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the guanciale in a large skillet over medium heat until deeply golden (adjust the heat as necessary to render the fat without burning the meat). The meaty parts should be browned and the fatty parts should be cooked but still slightly transparent. This will take 15 to 20 minutes. When it’s done, add the black pepper and turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put a pot of salted water on to boil. When the water boils, cook the pasta until it’s al dente, nearly but not quite done and still a bit chalky in the middle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the guanciale has cooled a bit, and while the pasta is cooking, add 3/4 cup of the pasta cooking water to the pan, turn the heat to high and reduce by about half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pasta is ready, use tongs to transfer it to the pan with the sauce. Stir the pasta as it finishes cooking, adding more pasta cooking water if necessary until the pasta is done and the sauce thick and creamy. Add half the cheese and a pinch of pepper, and stir vigorously to incorporate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the pasta among four dishes, and dust each with the remaining pecorino."}]}