{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Strata With Goat Cheese and Herbs", "description": "This herb-infused savory bread pudding makes an excellent brunch dish or a light dinner. It gets its hue from a copious amount of braising greens pureed into the custard — baby kale, mustard greens, chard. Use all of one or a combination. The bread cubes can soak for up to 24 hours before baking, so plan on assembling this in advance. But don’t bake it until just before serving. You want the eggs on top to still have their bright yellow, runny yolks. If you’re not a goat cheese fan, substitute dollops of fresh ricotta instead.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/05/06/dining/06APPE1/06APPE1-articleLarge-v3.jpg", "totalTime": "PT5H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, custards and puddings", "keywords": "baby kale, brioche, eggs, goat cheese, parmigiano-reggiano, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 506}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 431, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "4 grams", "proteinContent": "24 grams", "saturatedFatContent": "11 grams", "sodiumContent": "637 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups whole milk", "1/2 cup heavy cream", "5 ounces baby braising greens, such as kale, mustard greens, chard or a mix (about 5 cups)", "3/4 cup mixed soft herbs, such as parsley, cilantro, dill, mint or chives", "1/4 cup grated Parmigiano-Reggiano", "1 teaspoon kosher salt, more as needed", "Black pepper, as needed", "12 large eggs", "1 pound day-old brioche or white bread, cut into 2-inch cubes (about 6 cups)", "6 ounces cold goat cheese, sliced into 1/4-inch-thick rounds", "Aleppo or Turkish pepper, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot, bring milk and cream to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place greens, herbs, cheese, salt and pepper in a food processor fitted with the blade attachment. Once the hot milk mixture comes to a simmer, pour over greens and purée until smooth. Pour into a bowl and let cool completely. Once cool, whisk in 6 eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil a 9-by-13-inch baking pan. Scatter bread cubes over bottom of pan. Pour custard over bread and press down so the bread absorbs the custard. Cover with plastic wrap and refrigerate for at least 4 hours. If you can, stir bread cubes after an hour or so to encourage an even distribution of custard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to bake the strata, heat oven to 350 degrees. Tuck the goat cheese rounds into and on top of the strata. Transfer pan to oven and bake until top is beginning to firm up but is still slightly wet underneath, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from oven and use a spoon to make 6 evenly spaced indentations on the surface of the strata. Crack an egg into each hole and season with salt and pepper. Return pan to oven and continue to bake until strata is cooked through and eggs are just set, 20 to 25 minutes more. Sprinkle with Aleppo or Turkish pepper if desired."}], "link": "https://cooking.nytimes.com/recipes/1017384-green-strata-with-goat-cheese-and-herbs"}