{"@context": "http://schema.org", "@type": "Recipe", "name": "Ruth Reichl’s Giant Chocolate Cake", "description": "In her new book, \"My Kitchen Year: 136 Recipes That Saved My Life,\" Ruth Reichl calls this the cake that cures everything. The recipe produces a large stacked rectangular layer cake with whipped cream cheese in the frosting to add lightness and stability. The cake is very tender, based on a technique she first started using when she was a cook at the Swallow, a restaurant collective in Berkeley, Calif.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2015/09/16/dining/16JPRUTH6/16JPRUTH6-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "20 to 25 servings", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "chocolate, cocoa powder, dark brown sugar, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1117}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 453, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "4 grams", "proteinContent": "7 grams", "saturatedFatContent": "16 grams", "sodiumContent": "260 milligrams", "sugarContent": "42 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/8 cups/100 grams unsweetened cocoa powder (not Dutch process), plus more for dusting the pans", "3/4 cup/175 milliliters whole milk", "1 1/2 teaspoons/7 1/2 milliliters vanilla", "3 cups/375 grams flour", "2 teaspoons/10 grams baking soda", "Salt", "1 1/2 cups/340 grams (3 sticks) unsalted butter, softened", "1 1/2 cups/356 grams dark brown sugar", "1 1/2 cups/300 grams granulated sugar", "6 eggs", "5 ounces/143 grams unsweetened chocolate", "3/4 cups/170 grams (1 1/2 sticks) unsalted butter", "1 cup/225 grams whipped cream cheese", "1 teaspoon/5 milliliters vanilla", "2 1/2 cups/312 grams confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Butter two large rectangular baking pans (13 by 9 by 2 inches) and line them with waxed or parchment paper. Butter the paper and dust the pans with cocoa (you could use flour, but cocoa adds color and flavor)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Measure the cocoa powder into a bowl, and whisk in 1 1/2 cups of boiling water until it is smooth, dark and so glossy it reminds you of chocolate pudding. Whisk in the milk and vanilla.  In another bowl, whisk the flour with the baking soda and 3/4 teaspoon salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the butter into the bowl of a stand mixer and beat in the sugars until it is light, fluffy and the color of coffee with cream (about 5 minutes). One at a time, add the eggs, beating for about 20 seconds after each before adding the next. On low speed, beat in the flour mixture in 3 batches and the cocoa mixture in 2, alternating flour-cocoa-flour-cocoa-flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour half of the batter into each pan and smooth the tops. Bake in the middle of the oven until a tester comes out clean, 25 to 35 minutes. Let the pans rest on cooling racks for 2 minutes, then turn the cakes onto racks to cool completely before frosting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the frosting: Chop the chocolate and melt it in a double boiler. Let it cool so that you can comfortably put your finger in it. While it’s cooling, mix the butter with the whipped cream cheese. Add the chocolate, the vanilla and a dash of salt, and mix in the confectioners’ sugar until it looks like frosting, at least 5 minutes. Assemble the cake, spreading about a third of the frosting on one of the cooled layers, then putting the second layer on top and frosting the assembled cake."}]}