{"@context": "http://schema.org", "@type": "Recipe", "name": "Fig Crostata With Sweet Parmesan Cream", "description": "The dark, soft fruits of late summer bake quickly and compatibly with this pastry, and here, Parmesan cream adds depth to the sweetness of ripe figs. These are generous portions, about five inches across, for ease of handling, baking and presentation (and sorely tempting to eat in one sitting).", "author": {"@type": "Person", "name": "Kay Rentschler"}, "image": "https://static01.nyt.com/images/2015/11/19/dining/19COOKING-FIGCROSTATA/19COOKING-FIGCROSTATA-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 tarts", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "dessert, fig, flour, pastry, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 299, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "9 grams", "sodiumContent": "207 milligrams", "sugarContent": "31 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup all-purpose flour, more for dusting", "1/2 cup white pastry flour", "4 teaspoons sugar", "1/2 teaspoon fine sea salt", "6 tablespoons high-fat (European style) butter, chilled and cut into 6 pieces", "3/4 cup heavy cream", "2 tablespoons honey", "Pinch salt", "1/3 cup finely grated Parmesan", "1 egg yolk", "3 pounds small, ripe black mission figs", "2 to 3 tablespoons sugar", "Confectioners' sugar, whipped cream or chilled heavy cream for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place oven rack in lowest position, and heat oven to 450 degrees. Place large pizza stone on rack, and heat 1 hour while preparing other ingredients. Cut 6 sheets of aluminum foil, each one 8 inches square, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Combine flours, sugar and salt in food processor, and pulse to combine. Remove lid, scatter butter over surface of flour and pulse until butter pieces are no longer visible, 10 pulses of 10 seconds or so each. Turn mixture into mixing bowl, and sprinkle with 4 tablespoons ice water. Toss lightly with fingertips. Gather dough together, and squeeze a small portion with fingers. If dough feels dry, add another tablespoon water, and toss to combine. Turn dough onto work surface, press together firmly and pat into round disk. Cut into 6 wedges. Roll each wedge into a ball, flatten slightly and wrap in plastic wrap. Refrigerate at least 30 minutes, and up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Combine cream, honey and salt in small saucepan, and heat, stirring to dissolve honey; simmer until reduced to 1/2 cup. Remove from heat, add Parmesan and stir to dissolve. Place egg yolk in small bowl, drizzle with 1 tablespoon hot cream and whisk to combine. Add a second tablespoon, and whisk well to combine. Whisk egg mixture back into cream. Remove from heat. Trim stems from figs, and cut fruit into quarters. Sprinkle evenly with sugar; set aside. Spoon Parmesan cream onto pastry disks, add figs and bake according to recipe. Cream will thicken as it bakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the crostata: Working 1 piece of dough at a time, flour top and bottom lightly, and roll into thin 8-inch round. Transfer round to a square of foil. Spoon 1 1/2 to 2 tablespoons of filling in center, leaving 2-inch periphery free. Mound fruit in a circle. (Be sure to use all the filling in the 6 crostatas.) Fold dough over to support filling. Place crostata on sheet pan in refrigerator, and continue forming tarts with remaining dough pieces and fruit filling. Refrigerate all 6 crostatas at least 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide 2 or 3 crostatas onto baking stone. Bake until dough is dark golden brown, 15 to 20 minutes. Remove, and cool 10 minutes on rack. Repeat with remaining crostatas. Sprinkle with confectioners' sugar, or add a dollop of whipped cream or a few tablespoons of chilled heavy cream. Serve."}]}