{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Sea Scallops With Ginger-Lime Butter", "description": "Day-boat scallops, the kind that are dry-packed (never frozen or dosed with preservatives), are what you want for this decadent but very simple dish. The scallops are seared on cast iron, but gradually, for a crisp, well-browned surface that intensifies their natural sweetness. Ginger, lime and hot pepper enhance the rich meatiness of all fresh seafood, and here especially so. A roasted sweet potato and a pile of blanched bok choy complete this quintessentially elegant, fast-food meal.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/02/10/dining/10KITCHEN1/10KITCHEN1-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, for two", "keywords": "bok choy, sea scallop, sweet potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 369}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 362, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "7 grams", "proteinContent": "13 grams", "saturatedFatContent": "12 grams", "sodiumContent": "811 milligrams", "sugarContent": "6 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 baby sweet potatoes (or use 2 larger sweet potatoes)", "4 to 6 large dry-packed fresh sea scallops, about 12 ounces", "Salt and pepper", "3 tablespoons unsalted butter, at room temperature", "1 tablespoon grated peeled ginger", "1 fresh hot red chile pepper, finely chopped", "Zest and juice of 1 lime", "Olive oil, for searing", "8 ounces baby bok choy, washed, leaves separated and stems discarded (or use spinach or chard leaves)", "2 tablespoons roughly chopped cilantro, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Wash sweet potatoes and wrap them tightly in foil. Roast until tender, 45 minutes to 1 hour. (If you are using larger sweet potatoes, they may require 15 minutes more in the oven.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a paring knife, remove the small hard “foot” from the edge of each scallop. Pat scallops dry and season on both sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put on a medium pot of salted water to boil for the greens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the ginger butter: Combine butter, ginger, chile and lime zest and juice and stir together until well incorporated. Season with salt to taste. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take a cast-iron skillet large enough to hold the scallops without crowding and place over medium-high heat. Add a film of olive oil. When the oil is nearly smoking, add the scallops in one layer and let them sizzle. Reduce heat to medium and continue to cook for at least 5 minutes. Use a small spatula to check the scallops as they brown, allowing them to color gradually. They should be quite crisp and well caramelized. Turn off heat and flip scallops. Leave in pan until firm to the touch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the scallops are cooking, blanch the bok choy: Cook it for 1 minute in the salted boiling water, then drain and blot on a kitchen towel. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and place scallops, browned side up, onto warmed serving plates. Surround with the bok choy leaves and halved or sliced sweet potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Quickly warm the butter in the cast-iron pan and spoon over everything. Sprinkle with cilantro if desired."}]}