{"@context": "http://schema.org", "@type": "Recipe", "name": "Tuna, Cauliflower and White Bean Salad", "description": "Cauliflower is very happy in a pungent marinade, so I added it to one of my favorite stand-bys, tuna and bean salad. I liked this salad even more with the cauliflower added, as the tuna flavor infuses the cauliflower along with the vinegar and olive oil. You can use canned white beans, or cook up some delicious giant white beans and some of their broth in the dressing. The salad tastes even better if it has a few hours or a day to sit, and it keeps well.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/31/science/recipehealthtuna/recipehealthtuna-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 4 generously", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "appetizer, side dish, fall, spring, summer, winter, gluten-free, halal, high fiber, kosher, low cholesterol, low sugar, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 90}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 576, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "18 grams", "proteinContent": "33 grams", "saturatedFatContent": "3 grams", "sodiumContent": "642 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound cauliflower, broken into small florets (about 1/2 medium to large head)", "2 tablespoons sherry vinegar or red wine vinegar", "1 tablespoon fresh lemon juice", "Salt to taste", "1 garlic clove, minced or puréed", "1/2 to 1 teaspoon Dijon mustard, to taste", "2 tablespoons plain yogurt or bean broth if using dried beans", "6 tablespoons extra virgin olive oil", "1 small red onion, cut in half and sliced in half-moons (optional)", "1 5-ounce can tuna (packed in water or olive oil), drained", "1 1/2 cups cooked large white beans, or 1 can cannellinis, drained and rinsed", "2 tablespoons chopped fresh parsley or a combination of parsley and marjoram"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam cauliflower for 5 to 6 minutes, until just tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place sliced onion, if using, in a bowl and cover with cold water. Soak 5 minutes. Drain, rinse and drain again on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile in a small bowl or measuring cup, whisk together vinegar, lemon juice, salt, garlic, mustard and yogurt or bean broth. Whisk in olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cauliflower is tender remove from heat and toss with half the dressing in a large salad bowl. Drain tuna and add to bowl with cauliflower. Break up with a fork. Add cooked beans, onion and herbs. Toss together. Add remaining salad dressing and pepper, taste and adjust seasoning."}]}