{"@context": "http://schema.org", "@type": "Recipe", "name": "Cassoulet", "description": "Cooking is not always about simplicity and ease. Sometimes what you want in the kitchen is a project, a culinary jigsaw puzzle to solve. There is no greater one than cassoulet. I developed the recipe that follows at the shoulder of Phillipe Bertineau, the chef at Alain Ducasse’s Benoit bistro in New York City: rich and creamy, sticky with duck and pork, brightly spiced, with an astonishing depth of flavor. Feel free to tweak the list of ingredients to match what you can find in the market, but if you can manage the Tarbais beans and the duck fat for the confit, you really won’t be sorry. Start the preparation on the evening before you have a day off. A few hours of cooking the next day yields a dinner of remarkable heft and deliciousness, one that pairs well with red wine and good friends.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/01/24/magazine/24eat/24mag-24eat-t_CA1-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "dinner, casseroles", "keywords": "duck fat, duck leg, french four-spice powder, pork hocks, pork sausage, salt pork, Tarbais beans, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 310}, "recipeIngredient": ["2 1/4 cups Tarbais beans, approximately 3/4 pound, or substitute Great Northern beans or other large white beans, picked over to remove stones", "1 teaspoon baking soda", "3 unsmoked pork hocks, sometimes sold as ‘‘knuckles’’", "1 pound salted pork belly, sometimes sold as ‘‘salt pork,’’ skin removed and reserved, sliced into 6 portions", "2 pig ears (optional)", "3 duck legs", "1 teaspoon French four-spice powder, or substitute 1/2 teaspoon ground white pepper and a healthy pinch each of ground cloves, ground ginger and ground nutmeg", "1 pinch ground cardamom", "1 pinch ground coriander", "1 pinch ground nutmeg", "1 pinch sweet paprika", "1 pinch cayenne pepper", "2 tablespoons kosher salt", "1 tablespoon ground white pepper", "1 quart duck fat or as much as you can find, plus 1-2 pounds best available lard", "3 whole heads of garlic", "2 bay leaves", "1 sprig thyme", "1 sprig rosemary", "4 pods star anise", "1 bouquet garni (1 celery rib, 1/2 peeled carrot, 1/2 medium-size peeled onion, 1/2 head garlic, 6-8 sprigs of parsley, either wrapped together with butcher’s twine or put in a cheesecloth sachet)", "6 fresh pork garlic sausages", "3 small carrots, trimmed, peeled and diced, approximately 2 cups", "2 ribs celery, trimmed, peeled and diced, approximately 2 cups", "1 small celery root, trimmed, peeled and diced, approximately 2 cups", "1 medium-size turnip, trimmed, peeled and diced, approximately 2 cups", "1 small rutabaga, trimmed, peeled and diced, approximately 2 cups", "2 tablespoons tomato paste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Day 1:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put beans in a large bowl, and cover with cold water, then add baking soda, and allow to soak overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pork hocks, sliced pork belly, reserved pork skin and, if using, the pig ears into a stockpot, and fill with water to cover them by several inches, then set over high heat to come to a boil. Let the meats and skin blanch for 5 to 6 minutes, then remove from the water and allow to cool. Put the slices of pork belly on a plate, then dice the pork skin and, if using, julienne the pig ears, and add these to the plate. Cover, and place in the refrigerator overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Now turn to the cooled pork hocks and the duck legs. In a small bowl, combine four-spice powder with ground cardamom, ground coriander, additional nutmeg, paprika, cayenne, salt and pepper, and stir to combine. Use this spice mixture to season the duck legs and the cooled pork hocks, then put them on a platter, cover and place in the refrigerator overnight."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Day 2:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350. Melt the duck fat or duck fat and lard in a heavy, oven-safe pot deep enough to hold the duck legs, pork hocks and the three heads of garlic, then add the meats and the garlic to it, along with the bay leaves, thyme, rosemary and star anise, then place in the oven to simmer for approximately an hour and a half, or until both the duck and the pork are cooked tender and soft and the heads of garlic have almost collapsed. Remove the meats and the garlic from the fat, and allow to cool slightly. (Strain and reserve the perfumed duck fat for another use — more duck confit, say, or to cook potatoes. It will keep in the refrigerator, covered, for quite some time.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain soaked beans. Put around 5 quarts of water in a large, heavy-bottomed pot, then add the beans, along with the bouquet garni, and bring it to a boil over high heat. Lower heat to a simmer, and cook until the beans are softening but not cooked through, approximately 30 minutes. Reserve the beans and cooking liquid separately. Discard bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, return pot to medium heat, and add to it 2 tablespoons of the reserved duck fat. When it shimmers, add the garlic sausages to the pot, and sauté until lightly browned, approximately 5 minutes, then remove and reserve. Add the diced carrots, celery, celery root, turnip and rutabaga to the pot, and sweat them slowly in the fat, stirring often, until they begin to soften, approximately 10 minutes. Add the partly cooked beans to the pot, along with the reserved diced pork skin and the ears if you’re using them, then the tomato paste, and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the vegetables sweat, remove the bones from the cooled pork hocks, and squeeze the heads of garlic to release the garlic confit within. Add both to the bean pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add enough of the reserved bean-cooking water to the bean pot to just cover the beans, then nestle the duck legs, the sausages and the slices of pork belly on top of the beans. Put the pot in the oven to simmer for 30 minutes to an hour, or until the beans are cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase oven heat to 450, and cook until the beans are bubbling and crusted around the edges and the meats are deeply crisp on top (about 10-15 minutes). Let rest 10 minutes or so before serving."}]}], "link": "https://cooking.nytimes.com/recipes/1017938-cassoulet"}