{"@context": "http://schema.org", "@type": "Recipe", "name": "Shell Bean Ragout", "description": "Shell beans take less than half the time to cook than their dried counterparts. Look for varieties such as mottled pink and white cranberry beans, also known as borlotti beans; large scarlet runner beans that are mottled and purple, despite the name; and pale yellow cannellini beans.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/09/09/dining/09MARTHA/09MARTHA-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "borlotti beans, leek, pattypan squash, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 51}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 275, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "10 grams", "proteinContent": "11 grams", "saturatedFatContent": "1 gram", "sodiumContent": "821 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["1 to 1 1/4 pounds fresh shell beans, such as borlotti or scarlet runner beans, shelled (about 1 3/4 to 2 cups, shelled)", "1/2 onion", "3 plump garlic cloves; 1 crushed, 2 minced", "Bouquet garni made with a few sprigs parsley and thyme, Parmesan rind and a bay leaf, wrapped in a leek leaf and tied with twine", "Salt", "2 tablespoons extra-virgin olive oil", "2 large leeks, white and light green parts only, halved and cut in 1/2-inch slices", "1 celery stalk, chopped", "1 cup peeled, seeded and chopped tomatoes (about 3/4 pound)", "Ground black pepper", "1 good-size pattypan squash or other summer squash, quartered and sliced 1/4 inch thick (about 2 cups)", "Slivered fresh basil leaves for garnish", "Freshly grated Parmesan for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy soup pot or Dutch oven, combine the shell beans, onion, crushed garlic clove, bouquet garni and 4 cups water. Bring to a boil. Add salt to taste, reduce heat, cover and simmer 30 minutes. Remove and discard onion and garlic clove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat olive oil over medium heat in a medium skillet and add leeks and celery. Cook, stirring, until they begin to soften, about 3 minutes, and stir in minced garlic. Cook, stirring, until fragrant, 30 seconds to a minute, and add tomatoes. Season to taste with salt and pepper. Cook, stirring often, until tomatoes have cooked down slightly, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir leek and tomato mixture into beans, along with summer squash. Bring back to a simmer and cook 15 minutes, until beans are creamy-tender but intact and the vegetables are soft and fragrant. Taste and adjust seasonings. Remove bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle ragout into wide bowls. Top each serving with a generous sprinkling of slivered basil leaves and a spoonful of Parmesan."}]}