{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Egg Pasta", "description": "This adaptable pasta recipe will work with whatever flour you’ve got in the pantry. Using the “00” gives the silkiest, softest pasta while bread flour will give you more of a satisfying chew, and all-purpose lands you squarely in the middle. Because flour absorbs liquid differently depending on its age and the humidity in the air, consider these amounts as a guide and not as the law. Use your judgment. If the dough seems too wet and sticky to work with, add a bit more flour; if it seems too dry to come together into a smooth, satiny ball, add a bit more oil. The pasta is wonderful cooked right away, but you could dry it for future use instead. Let it hang in strands over the backs of your kitchen chairs or on a washing line if you have one. Or you can curl handfuls of pasta into loose nests and let them dry out on the sheet trays, uncovered.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/05/07/multimedia/clark-pasta/clark-pasta-mediumThreeByTwo440.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings, about 1 pound", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, pastas", "keywords": "all-purpose flour, egg, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 538}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 243, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "175 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/4 cups/290 grams all-purpose flour, bread flour or “00” flour, more as needed", "3/4 teaspoon/3 grams kosher salt", "2 whole large eggs", "3 egg yolks", "1 tablespoon extra-virgin olive oil, more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, pulse together flour and salt. Add eggs, yolks and oil and run the machine until the dough holds together. If dough looks dry, add another teaspoon olive oil. If dough looks wet, add a little flour until dough is tacky and elastic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dump dough onto a work surface and knead briefly until very smooth. Wrap in plastic and rest at room temperature for 1 hour or in the fridge overnight. (If pressed for time, the dough can be used after a 30-minute rest; just note that it would be slightly harder to roll out.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the dough into 4 pieces, keeping them covered with plastic wrap or a dish towel when not in use. (If you’re rolling the dough out by hand, rather than using a pasta machine, cut it into 2 pieces instead.) Using a pasta roller set to the thickest (widest) setting, roll one piece of dough out into a sheet. Fold the sheet in thirds like a letter and pass it through the machine 2 more times on the same setting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the setting, and repeat rolling and folding the dough, passing it through the machine 2 or 3 times before going to the next setting. For pappardelle and fettuccine, stop rolling when the dough is about 1 or 2 settings wider than the thinnest one on your roller. For lasagna noodles, and for ravioli and other stuffed or filled pasta, go to the thinnest setting. (To roll dough by hand, see note below.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape the pasta. For pappardelle, cut rolled pasta into 1-inch-wide strips. For fettuccine, run the rolled sheets through the fettuccine setting on your roller. Place cut pasta on a flour-dusted sheet tray and cover with a dish towel while rolling and cutting the remaining dough. Make sure to sprinkle flour over the cut pasta before you place another layer on top. If not using immediately, cover the sheet pan with a dish towel to keep the dough supple."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to a boil, add fresh pasta and boil for 1 to 3 minutes, depending on thickness of the pasta. Drain well."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Homemade Pasta", "description": "Melissa Clark makes fresh pasta with flour, salt, eggs and olive oil", "thumbnailUrl": "https://static01.nyt.com/images/2015/05/07/multimedia/clark-pasta/clark-pasta-mediumThreeByTwo440.jpg", "uploadDate": "2015-05-08T18:48:04.000Z", "duration": "PT2M12S"}}