{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Mexican Chocolate Pie", "description": "This vegan pie combines a <a href=\"https://cooking.nytimes.com/recipes/1012538-mexican-chocolate-tofu-pudding\">thick, creamy, chile- and cinnamon-laced pudding</a> from Mark Bittman with a graham cracker crust adapted from the cookbook \"Vegan Pie in the Sky.\" The pudding, which can also stand alone, is made with silken tofu, and it comes together in 10 minutes in the blender, which whips in air for a mousse-like texture. The chocolate is of the utmost importance here; its flavor will be the one that dominates, so be sure to buy the highest quality you can. Top with shaved chocolate if you'd like.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2015/10/26/dining/26COOKING-CHOCTOFUPIE1/26COOKING-CHOCTOFUPIE-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "One 9-inch pie", "recipeCuisine": "", "recipeCategory": "easy, pies and tarts", "keywords": "chocolate, cinnamon, graham cracker crumbs, tofu, dessert, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 486}, "recipeIngredient": ["10 whole graham crackers (approximately 5.5 ounces)", "3 tablespoons sugar", "4 tablespoons melted melted coconut oil", "1 tablespoon plain soy milk or almond milk", "3/4 cup sugar", "1 pound silken tofu", "8 ounces high-quality bittersweet or semisweet chocolate, melted (at least 60 percent cacao)", "1 teaspoon vanilla extract", "1 1/2 teaspoons ground cinnamon", "1/4 teaspoon chile powder, or more to taste", "1/8 teaspoon salt", "Chocolate shavings (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the crust", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees and lightly spray a 9-inch pie plate with nonstick cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the graham crackers in a food processor and process until finely ground, about 30 seconds (you should have about 1 1/4 cups of crumbs). Add the sugar and salt, drizzle over the melted coconut oil and soy or almond milk, and pulse until the mixture begins to clump together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the crumbs into the pie plate. Press crumbs into the sides of the plate first, then work your way down to the bottom. Bake for 8 to 10 minutes until firm and slightly golden. Let the crust cool while you prepare the filling."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the filling", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pot, combine sugar with 3/4 cup water; bring to a boil and cook until sugar is dissolved, stirring occasionally. Cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put all ingredients except for chocolate shavings in a food processor or blender and purée until completely smooth, stopping machine to scrape down the sides if necessary. Pour into the cooled crust, and press a piece of plastic wrap directly to the top of the pudding. Chill until firm, at least 4 hours and up to overnight. If you like, garnish with chocolate shavings before serving."}]}], "link": "https://cooking.nytimes.com/recipes/1017772-vegan-mexican-chocolate-pie"}