{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry-Peach Sangria", "description": "Part sangria, part punch, this is a refreshing and lightly alcoholic way to quench the thirst of a large group. Danielle Wecksler, a cooking instructor in South Carolina, created it for an outdoor Lowcountry boil in Charleston. It highlights local peaches and berries, and was created to counter the stifling Southern heat. “Part of the rationale is that when it is so hot, partygoers are going to suck down whatever you give them to drink,” she said. “So if you go with something that is a little lighter on the alcohol content, it keeps everyone from getting too tipsy.” This recipe easily doubles to serve a crowd. If you can’t find orange Curaçao, use a Curaçao-style liqueur, such as Grand Marnier. Triple sec, another type of orange liqueur, is slightly less sweet but would also work.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2015/07/01/dining/01SANGRIA/01SANGRIA-articleLarge-v3.jpg", "totalTime": "PT15M", "recipeYield": "About 10 cups", "recipeCuisine": "", "recipeCategory": "punches", "keywords": "blackberry, blueberry, curaçao, peach, strawberry, white wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 172}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 265, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "5 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "21 milligrams", "sugarContent": "26 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound strawberries, hulled", "6 sprigs fresh mint", "3 firm, ripe peaches, sliced", "1 large orange, halved and thinly sliced", "1/2 pint blueberries", "1/2 pint blackberries", "1 bottle dry light white wine, such as Vinho Verde, chilled", "1/2 cup orange Curaçao or other orange-flavored liqueur", "1/2 cup lemonade, chilled", "2 cups orange-flavored sparkling water, chilled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Freeze the strawberries in a zipper-lock bag at least 1 day in advance of making the sangria."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a 12-cup muffin pan to make large ice cubes. Place a sprig of fresh mint in 6 of the muffin slots, then fill those slots ¾ full of water. Freeze until firm, about 5 hours. To remove the cubes, set the bottom of the muffin pan in a sink with just a little hot water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the peaches, orange, blueberries and blackberries in a large punch bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the wine, Curaçao and lemonade over the fruit in the bowl, and stir gently to combine.  Place the punch in the refrigerator, and let sit for at least 2 hours or up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, add the sparkling water to the bowl, and stir gently again. Add the frozen strawberries and the mint ice cubes."}], "link": "https://cooking.nytimes.com/recipes/1017508-strawberry-peach-sangria"}