{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Potatoes With Black Kale and Nigella", "description": "One of the reasons we love latkes so much is because the browned crispy edges of potatoes are so delicious. Even when they are just browned and not particularly crispy, as they are here, they are irresistible. It helps to use a heavy nonstick pan for these so that you can cook the potatoes long enough and on high enough heat to get the browned edges, without losing those edges to the surface of the pan, where they will undoubtedly stick once they have absorbed the oil. I have been using a potato called simply “yellow potatoes” for this; they are slightly starchy, just a little less so than a Yukon gold or a fingerling, both of which will work just as well. Blanch the kale before you cook the potatoes, cut it into slivers, and add to the potatoes once they are tender. I season the mix with nigella seeds, one of my favorite spices; you can also add something with a kick, like cayenne or chile powder, if you want to pump up the heat.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/16/us/16recipeforhealth/16recipeforhealth-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "dinner, vegetables", "keywords": "dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, winter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 122}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 171, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "412 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 bunch black kale (about 1/2 pound), stemmed, leaves washed in 2 changes water", "Salt", "2 tablespoons plus 1 teaspoon extra virgin olive oil", "1 1/2 pounds potatoes, such as yellow potatoes or Yukon golds, cut in small dice (about 1/2 inch)", "2 shallots, minced", "1 teaspoon nigella seeds", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil while you clean kale. When water comes to a boil, salt generously and add kale. Blanch 2 to 3 minutes, until just tender. Transfer to a bowl of cold water, drain and squeeze out excess water, taking it up by the handful. Cut squeezed bunches of kale into slivers and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil over high heat in a heavy, preferably nonstick, 12-inch skillet and add potatoes. Turn heat down to medium-high and sear without stirring for 5 minutes, then shake and toss in pan for another 5 to 8 minutes, or until just tender and lightly browned. Add salt and continue to toss in pan for another minute or two, until tender. Add remaining teaspoon oil, shallots and nigella seeds and cook, stirring until shallots are tender and fragrant, about 3 minutes. Stir in kale and additional salt if desired and cook, stirring or tossing in the pan for another 3 to 5 minutes. Remove from heat, taste and adjust seasonings, and serve."}], "link": "https://cooking.nytimes.com/recipes/1017072-sauteed-potatoes-with-black-kale-and-nigella"}