{"@context": "http://schema.org", "@type": "Recipe", "name": "Christina Tosi’s Crockpot Cake", "description": "Christina Tosi, the pastry chef and an owner of Momofuku Milk Bar, sits near the beating heart of David Chang’s eclectic and innovative Momofuku restaurant empire. Off the clock, though, her cooking runs to inspired simplicity, as in this simple, tangy, slightly-caramelized at the edges slow-cooker cake, a version of which appears in her cookbook from Clarkson Potter, “Milk Bar Life.” Slow-cooker recipes invariably tell you to make something at night and enjoy them in the morning, or to make them in the morning and eat them after work. That only works if you don’t sleep much, or have a part-time job. This is a recipe for a weekend afternoon, or for cooking from the moment you get home until the very near end of a dinner party. It is a four-to-six hour affair.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/02/18/dining/18CROCKPOT2/18CROCKPOT2-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "easy, snack, cakes", "keywords": "butter, cake flour, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 806}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 546, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "0 grams", "proteinContent": "5 grams", "saturatedFatContent": "16 grams", "sodiumContent": "326 milligrams", "sugarContent": "38 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 pound/226 grams unsalted butter (2 sticks), at room temperature", "1 1/4 cups/250 grams granulated sugar", "1/4 cup/45 grams packed light brown sugar", "3 large eggs", "1 1/2 teaspoons vanilla extract", "3/4 cup/180 milliliters buttermilk", "1/3 cup/80 milliliters neutral oil, like canola or grapeseed", "1 1/2 cups/180 grams cake flour", "1 teaspoon baking powder", "1 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put all but 1 tablespoon of the butter and the sugars in the bowl of a stand mixer and cream with the paddle attachment at medium-high speed, until the mixture is smooth and pale, approximately 3 to 4 minutes. Mix in the eggs and vanilla, then continue to mix for another 3 minutes, until fluffy. Add the buttermilk and oil and mix briefly to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the mixer to a very low speed and add the cake flour, baking powder and salt, mixing for a minute or so and scraping down the sides of the bowl once or twice, until the batter has just come together, with no lumps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the remaining tablespoon of butter to grease the interior of a 4- to 6-quart slow cooker, then pour the batter into the pot. Cover and cook on low for somewhere in the neighborhood of 4 to 6 hours, until the cake has set and is cooked through at the center. To serve, run a knife around the edge of the slow cooker to loosen the cake and then carefully invert onto a platter, or simply spoon the cake out of the slow cooker."}], "link": "https://cooking.nytimes.com/recipes/1017227-christina-tosis-crockpot-cake"}