{"@context": "http://schema.org", "@type": "Recipe", "name": "Provençal Vegetable Soup With Basil", "description": "This is my version of soupe au pistou, beloved in the South of France in both homes and restaurants. It is quite similar to neighboring Italy’s minestrone al pesto. Made with flavorful ripe summer vegetables, it does not need a meat-based broth. To keep the soup green and fresh looking, some of the vegetables are cooked separately and added to the pot just before serving. A generous spoonful of garlicky basil pistou in each soup bowl gives the soup its bright sunny character.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/09/02/dining/02KITCHEN3/02KITCHEN3-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "soups and stews", "keywords": "appetizer, beans, potato, romano beans, shell beans, zucchini, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 70}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 319, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "4 grams", "sodiumContent": "489 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 cups fresh shelling beans, such as cranberry or cannellini, from about 1 pound in the pod", "1 small onion, peeled and stuck with clove", "1 thyme sprig", "1 bay leaf", "1 large garlic clove, halved", "1 teaspoon salt", "2 tablespoons extra-virgin olive oil", "2 tablespoons extra-virgin olive oil", "1 medium onion, diced, about 1 cup", "Salt and pepper", "1/2 pound yellow-fleshed potato, peeled and diced, or use baby potatoes, skin on, halved or quartered", "1/4 pound romano beans, in 1-inch pieces", "1/4 pound yellow wax beans", "1/2 pound zucchini or summer squash, chopped, about 2 cups", "2 cups basil leaves", "4 small garlic cloves", "1/2 cup extra-virgin olive oil", "2 ounces grated Parmigiano, plus extra for serving", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the beans: Put the beans and 5 cups water in a saucepan over high heat. Add onion stuck with clove, thyme, bay leaf, garlic, salt and olive oil. Reduce heat and cook at a gentle simmer until tender, about 25 to 30 minutes. Leave beans to cool in their own broth. (May be cooked several hours or up to 1 day in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the soup: Put olive oil in a heavy-bottomed soup pot over medium-high heat. Add diced onion, season generously with salt and pepper and stir to coat. Turn heat to medium and cook, stirring until softened and barely browned, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potato and 2 cups water to soup pot. Cover and cook until potatoes are soft, about 10 minutes. Add cooked shell beans and bean broth and bring to a simmer. Taste and adjust seasoning. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, working in batches in a separate pot, blanch Romano beans, wax beans and zucchini in salted water for 1 minute. Spread out to cool on a baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pistou: Put basil, garlic and olive oil in a food processor and pulse to a rough paste. (Alternatively, pound basil and garlic in a stone mortar and stir in oil and cheese.) Stir in about 1/2 cup grated cheese and season with salt and pepper. (Makes about 3/4 cup.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, add blanched vegetables to soup pot and simmer for 2 to 3 minutes. Ladle into bowls and add about 2 tablespoons pistou to the center of each bowl. Pass extra grated cheese at the table."}], "link": "https://cooking.nytimes.com/recipes/1017667-provencal-vegetable-soup-with-basil"}