{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamed Rice With English Peas and Country Ham", "description": "Steven Satterfield, the chef at Miller Union in Atlanta, published a version of this recipe for a kind of Lowcountry risotto in his cookbook, \"Root to Leaf.\" He uses Carolina Gold rice, a heritage long-grain variety, but any good long-grain rice will do. Likewise, feel free to substitute other hams for the country ham called for in the recipe. But use the very best peas you can find or, failing that, asparagus tips or tiny radishes. Not rich enough for you? Add a poached egg.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/04/01/dining/01COOKBOOK1/01COOKBOOK1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, lunch, one pot", "keywords": "country ham, english peas, long-grain rice, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 112}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 600, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "2 grams", "proteinContent": "12 grams", "saturatedFatContent": "23 grams", "sodiumContent": "734 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon unsalted butter", "1 cup Carolina Gold or other long-grain rice", "1/4 cup dry white wine", "2 cups chicken or vegetable stock, preferably homemade, or low-sodium, heated", "1 1/2 cups heavy cream, heated", "1/4 cup country ham or prosciutto, finely chopped", "1 cup shelled English peas, or thawed frozen peas, preferably organic", "2 teaspoons kosher salt, or to taste", "Parmesan, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put butter in a wide saucepan or Dutch oven set over medium heat and cook until the butter foams. Add rice and stir continuously until the grains turn opaque, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add white wine and stir until the rice absorbs the liquid. Add 1/4 of a cup water, stirring until the rice absorbs it. Repeat 3 times, until the rice has absorbed a total of 1 cup of water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly add 1/2 cup of hot stock, stirring until the rice absorbs it. Then add 1/2 cup of cream, again stirring until the rice absorbs it. Repeat until all the stock and cream is absorbed and the rice is tender and creamy, about 40 minutes. Stir in the ham and peas. Taste and salt if needed. Shower with grated Parmesan and serve hot."}], "link": "https://cooking.nytimes.com/recipes/1017322-creamed-rice-with-english-peas-and-country-ham"}