{"@context": "http://schema.org", "@type": "Recipe", "name": "Fast Vietnamese Caramel Bluefish", "description": "The first bluefish catch marks the beginning of summer in the Northeast, where the rich-tasting fish are plentiful, inexpensive and sustainable. Bluefish are best enjoyed very fresh, so make sure to get yours from a reliable source. Eaten within a day or two of catching, the flesh is sweet and flaky, with a deep ocean flavor. In this recipe, fillets are simmered in a brown sugar, ginger and soy sauce mixture that mimics the peppery flavors of a classic Vietnamese caramel fish, but without having to make caramel. The result is complex, tangy, slightly sweet and comes together in under 30 minutes. And if you can’t get bluefish, other full-flavored fillets can be substituted. And if you can’t find lemongrass, use strips of lemon or lime zest instead.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/06/10/dining/10APPE1/10APPE1-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "vietnamese", "recipeCategory": "dinner, lunch, quick, weekday", "keywords": "bluefish fillet, fish sauce, lemongrass, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 313}, "recipeIngredient": ["4 (6-ounce) skin-on bluefish fillets (or substitute mackerel, trout or thin salmon fillets)", "1 tablespoon peanut, grapeseed or safflower oil", "1 stalk lemongrass, or use lemon or lime zest (see note)", "1/3 cup light brown sugar", "2 tablespoons Asian fish sauce", "1 1/2 tablespoons soy sauce", "1 teaspoon grated ginger", "1/2 teaspoon black pepper", "Sliced scallions, as needed", "Thinly sliced jalapeño, as needed", "Fresh cilantro, as needed", "Cooked rice, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush fish all over with oil. Remove outer layer of lemongrass stalk and cut stalk into 2-inch lengths. Using the butt of a kitchen knife, pound and bruise stalks all over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place lemongrass pieces, sugar, fish sauce, soy sauce, ginger and black pepper in a large skillet. Bring to a simmer over medium-high heat, and reduce sauce for 1 to 2 minutes, until syrupy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place fish, skin side-down, in pan. Simmer, basting fish frequently with pan sauce, for 2 minutes; carefully turn fish and continue cooking until fish is just cooked through, 2 to 3 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer fish to a serving plate and garnish with scallion, jalapeño and cilantro. Drizzle with additional sauce. Serve over rice, if desired."}], "link": "https://cooking.nytimes.com/recipes/1017451-fast-vietnamese-caramel-bluefish"}