{"@context": "http://schema.org", "@type": "Recipe", "name": "Edna Lewis’s Biscuits", "description": "Edna Lewis mastered dozens of bread and biscuit recipes over the years, and in \"The Taste of Country Cooking,\" she offers two for biscuits; this is the flannel-soft version. Be sure to use homemade baking powder, which you can make easily by sifting together 2 parts cream of tartar with 1 part baking soda. It leaves no chemical or metallic taste.", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2019/01/24/dining/el-biscuits/el-biscuits-articleLarge.jpg", "recipeYield": "About 1 dozen", "recipeCuisine": "southern", "recipeCategory": "", "keywords": "buttermilk, flour, lard, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 296}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 226, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "5 grams", "sodiumContent": "218 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["3 cups sifted all-purpose flour", "1 scant teaspoon salt", "1/2 teaspoon baking soda", "4 teaspoons Royal Baking Powder, or make your own (see tip)", "2/3 cup lard", "1 cup plus 2 tablespoons buttermilk (If sweet milk is being used, omit the baking soda and the 2 tablespoons of milk; sweet milk is more liquid than sour and therefore these are not needed.)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take a large bowl, sift into it the measured flour, salt, soda and baking powder. Add the lard, and blend together with a pastry blender or your fingertips until the mixture has the texture of cornmeal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the milk all at once by scattering it over the dough. Stir vigorously with a stout wooden spoon. The dough will be very soft in the beginning but will stiffen in 2 or 3 minutes. Continue to stir a few minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the dough has stiffened, scrape from sides of bowl into a ball, and spoon onto a lightly floured surface for rolling. Dust over lightly with about a tablespoon of flour as the dough will be a bit sticky. Flatten the dough out gently with your hands into a thick, round cake, and knead for a minute by folding the outer edge of the dough into the center of the circle, giving a light knead as you fold the sides in overlapping each other."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the folded side face down and dust lightly if needed, being careful not to use too much flour and cause the dough to become too stiff. Dust the rolling pin and the rolling surface well. Roll the dough out evenly to a 1/2-inch thickness or a bit less. Pierce the surface of the dough with a table fork. (It was said piercing the dough released the air while baking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust the biscuit cutter in flour first; this will prevent the dough sticking to the cutter and ruining the shape of the biscuit. Dust the cutter as often as needed. An added feature to your light, tender biscuits will be their straight sides. This can be achieved by not wiggling the cutter. Press the cutter into the dough and lift up with a sharp quickness without a wiggle. Cut the biscuits very close together to avoid having big pieces of dough left in between each biscuit. Trying to piece together and rerolling leftover dough will change the texture of the biscuits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the biscuits 1/2 inch or more apart on a heavy cookie sheet or baking pan, preferably one with a bright surface. The biscuits brown more beautifully on a bright, shining pan than on a dull one, and a thick bottom helps to keep them from browning too much on the bottom. Set to bake in a preheated 450-degree oven for 13 minutes. Remove from the oven, and let them rest for 3 to 4 minutes. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1017786-edna-lewiss-biscuits"}