{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach Spaetzle With Bacon and Sage", "description": "Spaetzle, the delicious little German dumplings (sometimes called batter noodles), are easy to make, though it takes a bit of practice. I prefer to form them with a soup spoon, flicking tiny half-moons of batter one-by-one into the pot, or to put the batter on a board and cut off thin strips of batter with a wet knife. Many cooks use a special spaetzle-making tool that forces squiggles of the batter into a pot of boiling water. Others push the batter through the holes of a colander, but for this you need to make a slightly wetter batter. These are green spaetzle, made with spinach purée, sizzled with bacon and sage leaves. (Instead of spinach, you could add chopped herbs, but plain spaetzle are divine, too.) Spaetzle take only moments to cook and can be prepared in advance, then sautéed in butter to serve.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/10/21/dining/21KITCHEN2/21KITCHEN2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "austrian, german", "recipeCategory": "dinner, pastas", "keywords": "bacon, egg, spinach, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 123}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 476, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "3 grams", "proteinContent": "15 grams", "saturatedFatContent": "9 grams", "sodiumContent": "371 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["5 ounces baby spinach leaves or equivalent quantity of larger leaves", "4 eggs", "4 egg yolks", "Salt", "1/4 teaspoon grated nutmeg", "1/4 teaspoon black pepper", "3 1/4 cups all-purpose flour", "4 ounces bacon or pancetta, cut crosswise into thin lardons", "4 tablespoons butter", "12 fresh sage leaves", "Grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop spinach leaves into boiling water to blanch, then transfer to a bowl of ice water to cool. Drain spinach and squeeze dry. Put cooked spinach in a blender or food processor with the eggs and yolks and blitz briefly to make a green purée. (Alternatively, finely chop the spinach and stir together with beaten eggs and yolks.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put spinach in a mixing bowl or the bowl of a stand mixer. Add 1/2 teaspoon salt, the nutmeg and the pepper. Beat in flour and 3/4 cup cold water to make a wet, sticky batterlike dough. Beat for 5 minutes, until lump free. If the mixture seems too stiff, beat in a few more tablespoons cold water. (If using a spaetzle tool, thin the batter to a more runny consistency.) Leave batter to rest at room temperature, covered, for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare an ice-water bath. Bring a large wide pot of well-salted water to a boil. Stand close to the pot with the bowl of dough in one hand and a soup spoon in the other. With the edge of the spoon, grab thin slivers of dough approximately 1 inch long, dropping them one by one into the boiling water. (Cook a dozen or so at a time.) Let the spaetzle cook for 1 minute or so, until they rise to the surface. Remove with a skimmer and immediately cool in ice water. Continue until all batter is used. Drain cooked spaetzle and blot dry. (The recipe may be prepared up to this point several hours before serving.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, set a large wide skillet over medium-high heat. Add bacon and let it render without browning much, about 2 minutes. Pour off fat and leave bacon in pan. Add butter and let it foam, then add sage leaves and let sizzle for 30 seconds. Add cooked spaetzle and sauté, stirring with a wooden spoon until heated through and lightly browned. Transfer to a warm serving bowl. Serve immediately with grated Parmesan."}], "link": "https://cooking.nytimes.com/recipes/1017753-spinach-spaetzle-with-bacon-and-sage"}