{"@context": "http://schema.org", "@type": "Recipe", "name": "Boston Baked Beans", "description": "Squat, glazed ceramic bean pots lurk in cabinets all over New England. They're traditional for Boston baked beans, but enameled cast iron is faster. Beans in cast iron can be brought to a boil over a burner before the dish goes into the oven; this saves about an hour.", "author": {"@type": "Person", "name": "Pete Wells"}, "image": "https://static01.nyt.com/images/2015/08/19/dining/19JPVACATION/19JPVACATION-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "dinner, snack, one pot", "keywords": "dark molasses, navy beans, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 217}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 287, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "7 grams", "sodiumContent": "851 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["1 pound dried navy or Great Northern beans", "1/2 pound salt pork or bacon, rind removed, cut into 1/4-inch dice", "1 onion, chopped", "4 garlic cloves, peeled", "1/2 cup dark molasses or maple syrup, preferably Grade B", "1/4 cup ketchup", "3 tablespoons mustard powder", "1 tablespoon Worcestershire sauce", "1 teaspoon pepper, plus more to taste", "1 thyme branch (optional)", "1 bay leaf (optional)", "1 teaspoon salt, plus more to taste", "1 tablespoon cider vinegar, plus more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick through the beans for stones, rinse them thoroughly and soak in water overnight. (Leave soaking until ready to cook; you'll need the water.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Place a Dutch oven, 5-quart size or larger, over low heat. Add the salt pork or bacon and fry until crisp, 12 to 15 minutes. Raise heat to medium and stir in the onion. Cook until onion is translucent, stirring occasionally, 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans to the pan along with enough of the soaking liquid to cover them by 1/2 inch, adding fresh water if needed. Add the garlic cloves, molasses or maple syrup, ketchup, mustard powder, Worcestershire sauce, 1 teaspoon pepper and the thyme branch and bay leaf, if using. Stir well and bring to a boil. Cover the pot and put in oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Check the liquid level in the pot every hour or so, and add hot water as needed to barely cover the beans. Cook until beans are very soft but not falling apart, 2 to 3 hours. Remove from oven. Stir in 1 teaspoon salt and 1 tablespoon vinegar; let sit at room temperature for 30 minutes, then taste a bean and some liquid, adding more salt, pepper or vinegar, if you like. Serve, or cool completely and reheat."}]}