{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoked Bluefish Salad ", "description": "Bluefish get a bad rap — people tend to describe their flavor as fishy and overpowering — but when the fish is caught fresh and eaten within a few days, it is elegant, fatty and substantial. It particularly shines when you steam or smoke it, as these methods can stand up to the fat. Here, the smoked bluefish is layered with tomatoes and hard-boiled egg with a buttermilk dressing. But you could just as easily take the smoked fish and serve it on hearty rye toast with crème fraîche and dill.", "author": {"@type": "Person", "name": "April Bloomfield"}, "image": "https://static01.nyt.com/images/2015/07/01/dining/01FISH2/01FISH2-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, salads and dressings", "keywords": "bluefish, buttermilk, egg, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 239, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "3 grams", "proteinContent": "20 grams", "saturatedFatContent": "2 grams", "sodiumContent": "728 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["1 pound bluefish fillet,  ¾-inch to 1-inch thick (don't worry about removing bones; you can do that easily after cooking)", "2 teaspoons fine sea salt", "1 quart lump charcoal", "1 quart wood chips (such as hickory, apple or mesquite), soaked for 30 minutes then drained", "1/3 cup buttermilk", "2 tablespoons extra-virgin olive oil", "1 small garlic clove, smashed with the side of a knife into a fine paste", "1/2 teaspoon lemon zest ", "1 tablespoon lemon juice", "1 1/2 teaspoons dill, coarsely chopped", "1 teaspoon flaky sea salt, plus more to finish", "4 medium heirloom tomatoes", "1 head bibb lettuce or 4 Little Gems", "1/2 medium red onion, thinly sliced", "1/8 teaspoon caraway, toasted then crushed, plus more to taste", "3 large hard-boiled eggs (9 to 10 minutes)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the bluefish fillet with the fine sea salt, put onto a tray and refrigerate uncovered for 12 to 15 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the fish dry with a paper towel and put onto a clean, heatproof grilling tray. By this stage, the top should have developed a stickiness. (This is called pellicle, and it is good, as it will help the smoke stick.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a chimney starter to light 1 quart lump charcoal and let it burn until the coals glow red. Add ¾ of the charcoal to the grill on one side, and spread a handful of the drained wood chips over the top of the charcoal. Reserve the remaining charcoal in a metal bowl; you might use them later. Place the grate on the grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tray on the opposite side of the fire to make sure there is enough room and the tray is not near or on top of fire. Put the lid on top of the grill; it should read around 150 to 200 degrees. If the temperature is too high, take out a piece of charcoal with tongs and add it to your back-up bowl. Rotate the vents until they are three-quarters of the way closed at the bottom and the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Smoke for 30 minutes. After 30 minutes have elapsed, check the chips and internal temperature of the fish; it should be right around 120 degrees. If it's lower, that's O.K. The grill will most likely need more chips, so add the last handful and cook with the lid on for another 15 to 30 minutes. If the temperature drops below 150 degrees inside the grill, add a few of the reserved coals to bring back the heat. After 45 minutes of smoking the fish, begin checking its internal temperature; it should be 145 degrees, and the fish should be lightly smoked. If necessary, add a few remaining coals to the fire and continue cooking. (If you go over 145 degrees, don't be alarmed, as the fat content of the fish allows it to handle a little more heat.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the fish off the grill and cool to room temperature. If you’re not using the fish immediately, cover the trays in plastic wrap, then refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the salad: Flake the fish into large chunks, removing any bones or unwanted skin. In a large bowl, whisk together buttermilk, olive oil, garlic paste, lemon zest and juice and dill. Season with 1 teaspoon flaky sea salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely chop the tomatoes and add them to the bowl along with the lettuce, red onion, flaked fish and caraway, mixing gently with your hands. Cut or break egg into quarters and layer the salad in a rustic serving bowl. Finish with a little extra flaky sea salt. "}], "link": "https://cooking.nytimes.com/recipes/1017510-smoked-bluefish-salad"}