{"@context": "http://schema.org", "@type": "Recipe", "name": "Einkorn Risotto With Fresh Herbs", "description": "This risotto is fairly simple; it includes shallots, garlic (which is optional) and a generous mix of fresh marjoram, chives and parsley. It has so much depth of flavor that it’s rich and satisfying even without the Parmesan stirred in at the end, which makes this a perfect main dish or side for vegans as well as omnivores.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/06/10/dining/10MARTHA/10MARTHA-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "lunch", "keywords": "chicken broth, einkorn, marjoram, vegetable broth", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 29}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 555, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "11 grams", "proteinContent": "22 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1201 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 1/4 cups einkorn", "6 cups vegetable or chicken broth", "Salt to taste", "2 tablespoons extra-virgin olive oil", "2 shallots, minced", "2 garlic cloves, minced (optional)", "1/2 cup dry white wine, such as pinot grigio or Sauvignon blanc", "2 tablespoons chopped fresh marjoram", "1/4 cup chopped chives", "Black pepper", "1/4 cup chopped fresh parsley", "1/4 cup freshly grated Parmesan, more to taste (optional)", "Walnut oil for drizzling, if not using Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse einkorn and place in bowl. Cover with boiling water and let sit for 30 minutes, or cover with room-temperature water and leave overnight. Drain and reserve about 1/2 cup soaking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1/4 cup soaked einkorn in food processor and pulse about 10 times to crack some of the grains."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour broth and reserved soaking water into a saucepan and bring to a simmer over medium heat. It should be lightly seasoned, as it will reduce while you slowly cook the einkorn."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a wide, heavy saucepan over medium heat. Add shallots and, if using, garlic and cook gently until shallots are just tender, 3 to 5 minutes. Add  whole and cracked einkorn and stir over medium heat until grains dry out a bit and begin to crackle, a couple of minutes. Add wine and cook, stirring, until it evaporates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in enough simmering broth to just cover einkorn. The broth should bubble slowly. Cook, stirring often, until it is just about absorbed. Add another ladleful or two of broth and continue to cook in this fashion until einkorn is tender, about 25 minutes. It will still be chewy. Add marjoram, chives and pepper, and more broth if there is none visible in pan. Taste and adjust salt. Continue to simmer, stirring often, another 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another ladleful of broth to the pan and remove from heat. Stir in parsley and, if using, Parmesan. Mixture should be creamy. Serve right away in wide soup bowls, and top with walnut oil if desired."}]}