{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp Mofongo", "description": "According to Manolo Lopez, the Puerto Rican proprietor of the Smorgasburg food stand MofonGO, this mashed plantain dish is the “unofficial official dish of the islands.” Depending on the season, Mr. Lopez serves several versions — creole chicken, roast pork topped with a squiggle of pink Puerto Rican mayo-ketchup — all based on his mother’s recipe. Mr. Lopez makes the pork rinds from scratch; you don’t have to, but you should follow Mr. Lopez’ advice and eat this immediately after you make it. As mofongo cools, the mashed plantains begin to harden.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2015/10/28/dining/28JPCARIBBEAN10/28JPCARIBBEAN10-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "caribbean, latin american", "recipeCategory": "quick", "keywords": "garlic, plantain, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "recipeIngredient": ["6 to 8 cups canola oil", "2 unripe (green) plantains, peeled and sliced into 1-inch thick rounds", "2 garlic cloves, peeled", "1 tablespoon adobo seasoning", "1/4 cup pork rinds (see note)", "2 tablespoons unsalted butter, preferably cultured butter", "1 tablespoon extra-virgin olive oil", "4 garlic cloves, smashed to a paste in a mortar (about 2 tablespoons)", "3/4 pound jumbo shrimp (21 to 25) or 4 tiger shrimp, cleaned, peeled and deveined", "1/3 cup white wine", "Juice of half a lemon (about 2 tablespoons)", "Kosher salt and black pepper", "Chopped cilantro, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the mofongo: Fit a large pot with deep-fry thermometer. Pour in enough canola oil to reach 2 inches up the side of the pan. Heat over medium-high until thermometer registers 325 degrees. Add plantains and fry, turning occasionally, until golden brown, 4 to 6 minutes. Carefully transfer plantains to a paper-towel-lined rimmed baking sheet to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mortar and pestle, smash 2 garlic cloves, making sure you have a thin coating of garlic on the bottom. Transfer plantains to the mortar, add adobo seasoning and pork rinds and mash until softened and well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the shrimp: Place the butter and olive oil in a large skillet over medium heat. Once the butter has melted, add 4 smashed garlic cloves and cook until fragrant, about 1 minute, stirring frequently so the garlic doesn’t burn."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shrimp and cook until pink and opaque, 30 seconds to 1 minute on each side. Pour in wine and lemon juice and let reduce on low heat until a thick sauce forms, about 2 to 3 minutes. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Firmly pack the mofongo into a small bowl to mold and turn over onto a plate. Spoon the shrimp and sauce on top of the mofongo and garnish with cilantro. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1017776-shrimp-mofongo"}