{"@context": "http://schema.org", "@type": "Recipe", "name": "St. Lucia Buns", "description": "These saffron-hued sweet buns, called Lussebullar, are a staple of the Swedish tradition of St. Lucia's Day, a winter-solstice celebration. The recipe is from Jennifer Jansch, whose children serve their parents the buns every Dec. 13, when the holiday is observed.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/12/07/magazine/07feasts16/07feasts16-articleLarge-v3.jpg", "totalTime": "PT1H30M", "recipeYield": "30 buns.", "recipeCuisine": "scandinavian", "recipeCategory": "breads", "keywords": "flour, raisins, saffron, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 170}, "recipeIngredient": ["6 ounces butter, melted", "2 1/2 cups lukewarm milk", "3/4 teaspoon saffron", "1 cup sugar", "1.7 ounces fresh yeast", "1/2 teaspoon salt", "2 pounds wheat flour, or as needed", "Beaten egg, for brushing", "Raisins, for garnish."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the butter and milk in a medium bowl. Using a mortar and pestle, grind the saffron with a pinch of the sugar, and stir into the mixture. In a large bowl, dissolve the yeast in a little of the lukewarm butter mixture, then add the remaining butter mixture, the remaining sugar and the salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gradually add enough of the flour (almost all of it) to make a workable dough, kneading for 10 minutes by hand or 5 minutes in a mixer with a dough hook. Shape into a ball, sprinkle with a little flour and cover with a cloth. Allow to rise in a warm spot for 30 to 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dough to a floured work surface, and knead in additional flour if the dough is sticky. Shape as desired into buns, braids or lengths. Place on lined baking sheets, and allow to rise again for 30 to 45 minutes. Preheat the oven to 400."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the buns with beaten egg, and press raisins lightly into the dough. Bake until golden and risen, or until a toothpick inserted into the center of a bun comes out dry. Smaller buns may take 8 to 10 minutes; larger lengths and braids, 15 to 20 minutes. Cool the buns on a rack under a cloth."}], "link": "https://cooking.nytimes.com/recipes/1017039-st-lucia-buns"}