{"@context": "http://schema.org", "@type": "Recipe", "name": "Moroccan Herb Jam", "description": "Paula Wolfert's first and still-influential book, \"Couscous and Other Good Food From Morocco,\" published in 1973, influenced a generation of cooks yearning to expand its horizons.  This fascinating recipe for a mixture of long-cooked greens, which she learned while living in Morocco, appeared in her 2003 book, \"The Slow Mediterranean Kitchen: Recipes for the Passionate Cook\". The acclaimed chef Russell Moore of Camino restaurant in Oakland, Calif., a  great fan of Ms. Wolfert and this recipe, has now adapted it and incorporated herb jam into his menu on a daily basis. Among its virtues: It tastes wonderful and lasts for a week or more in the refrigerator; it is great when spread on toasted bread or stirred into a soup; and it uses greens, like the outer leaves of lettuce, that would otherwise be wasted.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/10/14/dining/14KITCH2_WEB/14KITCH2_WEB-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 4 cups", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 50}, "recipeIngredient": ["1½  pounds various greens and herbs (like chard, kale, broccoli rabe, dill, marjoram, parsley, cilantro, celery tops and scallions, and outer leaves of lettuce or similar greens)", "6 large cloves garlic, unpeeled", "Extra-virgin olive oil", "2 small hot red chiles (dried) or a pinch of crushed red pepper", "Salt", "1½ tablespoons cumin seeds, toasted in a dry pan until fragrant, then ground", "1/4 cup roughly chopped pitted black olives, such as Kalamata, or oil-cured", "Pinch of pimentón (Spanish smoked paprika)", "Lemon, for final seasoning", "Pita or flatbread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the greens and herbs and garlic cloves all together in a large steamer set over medium-high heat, and steam until tender, 15 to 20 minutes. (If you don’t have a steamer, use a large, deep skillet with a lid. Put 2 inches of water in bottom of pan, add greens, cover and cook at a brisk simmer.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the garlic aside. Drain greens, let cool and squeeze out moisture; pick out the tougher herb stems if necessary. Put greens and herbs on a cutting board and chop very finely with a large knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 4 tablespoons olive oil in a wide skillet over medium-high heat. Add the chiles and let them sizzle without browning (or use a pinch of crushed red pepper), then add the chopped greens, a pinch of salt and half the cumin seeds. The flavor is concentrated by cooking most of the moisture out of the greens; this will take about 10 to 15 minutes. (Stir the herb jam mixture often as the water evaporates; it will want to stick.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat off but leave the mixture in the pan. Peel the steamed garlic and mash it into the pan along with the olives. Mix everything and taste; add salt as needed, a good splash of olive oil, the pimentón and more cumin to taste. The herb jam should be highly seasoned. Add more chile if it isn’t spicy enough. Just before serving, add a squeeze of lemon. Spread on toasted pita or flatbread if desired. The herb jam can be stored in the refrigerator, tightly covered, for about 5 days."}]}