{"@context": "http://schema.org", "@type": "Recipe", "name": "Peach 'Doughnuts'", "description": "These doughnuts are pure fruit. They are inspired by a baked pistachio-encrusted Saturn peach doughnut I learned to make from the pastry chef Sherry Yard. I coat mine with a mix of ground almonds and raw brown sugar, sear them in butter and set them on a lime-inflected raspberry sauce. It’s a match made in heaven.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/07/29/dining/29MARTHA/29MARTHA-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "snack", "keywords": "creme de cassis, peach, raspberries, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 80}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 243, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "6 grams", "proteinContent": "4 grams", "saturatedFatContent": "4 grams", "sodiumContent": "2 milligrams", "sugarContent": "27 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup sugar", "1 6-ounce box raspberries", "1 tablespoon crème de cassis liqueur", "Finely grated or chopped zest of 1 lime", "6 ripe Saturn peaches", "1/2 cup almonds", "2 tablespoons raw brown sugar", "2 to 3 tablespoons butter, as needed", "Vanilla ice cream or ice milk (optional)", "Additional raspberries (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make raspberry sauce, combine 1/3 cup water and the sugar in a small saucepan and bring to a boil. Turn heat to medium low and simmer until sugar has dissolved. Stir in raspberries and cassis liqueur. Return to a simmer, cover and cook over low heat for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place lime zest in a bowl and strain hot raspberry sauce into bowl. Press raspberry pulp through strainer; discard seeds. Whisk to blend pulp and syrup, and return to saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To skin peaches, bring a medium pot of water to a boil and add peaches. Blanch for 30 seconds and transfer to a bowl of ice water; drain. Cut peaches laterally around pit and gently twist apart. If peaches do not twist apart easily, insert knife tip and cut around the pit, then gently ease it out and separate the peach halves. Remove skin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place almonds and sugar in a food processor fitted with the steel blade and process until mixture is finely ground. Transfer to a wide bowl. Gently dip each peach half into the mixture to coat both sides, and place on a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shortly before serving, heat sauce and spoon a few tablespoons onto dessert plates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy, nonstick skillet over medium-high heat. Add 2 tablespoons butter and when it has stopped foaming, add a batch of peach halves; do not crowd the pan. Sear for about 1 minute, until almond coating has browned, and flip over. Sear for another 30 seconds to a minute and remove to dessert plates, placing two halves on each plate, cut side up. Add more butter to pan if necessary and finish searing peaches. If desired, serve peaches with a scoop of vanilla ice cream and, for garnish, additional raspberries."}]}