{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoky Tea Stock", "description": "Here’s the problem with homemade stock: It’s so good that it doesn’t last long. What’s needed is something you can produce more or less on the spot. \n\nAlthough water is a suitable proxy in small quantities, when it comes to making the bubbling, chest-warming soups that we rely on in winter, water needs some help. Fortunately, there are almost certainly flavorful ingredients sitting in your fridge or pantry that can transform water into a good stock in a matter of minutes.\n\nThis recipe is meant to be fast, so by ‘‘simmer,’’ I mean as little as five minutes and no more than 15. You can season these stocks at the end with salt and pepper to taste, or wait until you’re ready to turn them into full-fledged soups. This one is a perfect broth for udon noodles.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/01/18/magazine/18eat_stockmarket-slide-WSOA/18eat_stockmarket-slide-WSOA-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "About 6 cups of stock", "recipeCuisine": "", "recipeCategory": "easy, quick, soups and stews", "keywords": "ginger, tea, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 47}, "recipeIngredient": ["Sliced ginger", "1/4 cup Lapsang souchong tea leaves (green tea is also good) or 4 tea bags", "Soy sauce", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop some sliced ginger into 6 cups water, bring to a boil, then turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let rest for a few minutes, then stir in 1/4 cup Lapsang souchong tea leaves (green tea is also good). If you can’t find loose tea leaves, use 4 tea bags."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steep for 5 or 10 minutes, then strain. Season with soy sauce if you like, and add some black pepper."}]}