{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheese Pupusas", "description": "Cheese pupusas — stuffed, griddled masa cakes — and their accompanying slaw, curtido, are quintessential Salvadoran street foods. This recipe is adapted from Janet Lainez, who has been making them for homesick Latinos every summer at the Red Hook Ball Fields for nearly 25 years. She likes to use mozzarella rather than Salvadoran cheese — preferably Polly-O, established in Brooklyn, 1899.", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2015/02/08/magazine/08eat/08eat-articleLarge-v3.jpg", "totalTime": "PT40M", "recipeYield": "9 pupusas (3 to 4 servings)", "recipeCuisine": "central american", "recipeCategory": "cakes", "keywords": "masa harina, mozzarella", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 170}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 490, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "4 grams", "proteinContent": "24 grams", "saturatedFatContent": "12 grams", "sodiumContent": "544 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 teaspoon kosher salt", "2 cups masa harina (9 ounces by weight)", "1 1/2 cups water", "12 ounces industrial mozzarella, grated (preferably Polly-O whole milk)", "Vegetable oil, as needed", "Curtido, for serving (<a href=\"http://cooking.nytimes.com/recipes/1017184-curtido\" target=\"_blank\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mix the salt well into the masa harina. With your hands, knead the water into the masa harina in a few additions; work in all the water evenly. The dough will feel like stiff mashed potatoes. Lay a 12-inch square of plastic wrap or a zip-lock on a smooth work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the cheese into 9 equal piles. Roll a 2-ounce ball of dough in your hands, about the size of a golf ball, and pat it out in your hand to form a disc a little larger than your palm. (If the dough is very sticky, lightly moisten or oil your hands.) Pat a pile of cheese onto the masa, leaving just a little space around the edges (cup your hand slightly if it helps). Carefully close your hand to bring the edges of the disc closer, and use your other hand to pat and pinch it together to enclose the cheese in a rough ball. Patch any holes with a little more masa, but don’t worry too much — cheese that leaks out will brown deliciously in the pan. Moisten or oil the plastic wrap, and pat out the pupusa on it, forming a disc about 4 inches wide. Repeat, forming a second pupusa."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large nonstick sauté pan over medium heat, and very lightly grease it with oil. When the oil appears thin, lay the pupusas in the pan, and cook until richly browned in spots, about 4 minutes. (If you can fit 3 or 4 pupusas at a time in the pan, increase heat to medium-high.) It’s O.K. if the cheese starts to bubble out. Flip the pupusas, and cook another 4 minutes, until they’re browned and cooked through. Serve finished ones immediately with <a href=\"http://cooking.nytimes.com/recipes/1017184-curtido\">curtido</a>, and repeat forming and cooking the remaining pupusas."}]}