{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Bone Broth", "description": "\"Bone broth\" has become stylish as part of the Paleo diet, which enthusiastically recommends eating meat and bones. (The idea is to eat like our Paleolithic, pre-agricultural ancestors.) But cooks have known its wonderful qualities for centuries. This robust and savory beef broth — more than a stock, less than a soup — can be the basis for innumerable soups and stews, but it also makes a satisfying and nourishing snack on its own.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/01/07/dining/07JPBROTH6/07JPBROTH6-articleLarge.jpg", "totalTime": "PT5H45M", "recipeYield": "About 3 quarts", "recipeCuisine": "", "recipeCategory": "breakfast, dinner, lunch, snack, soups and stews", "keywords": "beef knucklebones, beef short ribs, oxtail, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 386}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 117, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "1 gram", "proteinContent": "11 grams", "saturatedFatContent": "3 grams", "sodiumContent": "52 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds bone-in beef short rib", "2 1/2 pounds beef shank or oxtail", "2 pounds beef knucklebones or neck bones, or a combination of both (or add 1 more pound beef shank or oxtail)", "2 tablespoons extra-virgin olive oil", "2 tablespoons tomato paste", "1/4 cup apple cider vinegar", "3 carrots, peeled and coarsely chopped", "3 celery stalks, coarsely chopped", "2 onions, halved and peeled", "1 (14.5-ounce) can tomatoes (they can be whole, peeled or diced)", "1 head garlic, excess skins removed, top chopped off to expose the cloves", "2 bay leaves", "1 bunch fresh flat-leaf parsley", "1/2 bunch fresh thyme", "1/4 ounce dried shiitake mushrooms", "1 tablespoon black peppercorns"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Place meat and bones in a roasting pan or on a large rimmed baking sheet. Drizzle with olive oil, turning to coat, then brush all over with tomato paste. Roast until browned, 30 to 35 minutes. They don’t need to cook all the way through but to just develop some color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put roasted meat and bones in a 12-quart stockpot and add vinegar and enough cold water to cover by 3 inches (about 6 quarts). Bring to a boil, then reduce to a low simmer, uncovered, for 2 to 3 hours. While simmering, occasionally skim fat and foam from the top using a ladle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add all the remaining ingredients. Continue to simmer, uncovered, for a minimum of 3 hours. If using knucklebones, simmer overnight, 9 to 15 hours, so the knucklebones have sufficient time to break down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove meat and bones with a slotted spoon or tongs; reserve meat for another use (such as soup). Pour broth through a fine-mesh strainer into a large heatproof bowl. Once broth has cooled, store in the refrigerator in an airtight container."}], "link": "https://cooking.nytimes.com/recipes/1017117-beef-bone-broth"}