{"@context": "http://schema.org", "@type": "Recipe", "name": "Charred Shallots With Labneh and Pita", "description": "The flavor of roasted caramelized onions is a universal favorite that add sweetness and depth to countless recipes. When grilled, the onions — and in this case shallots — take on a smoky char as well. Here, they are served on top of thick labneh (strained Middle Eastern yogurt) to be eaten as a side or an unusual dip with grilled pita. This recipe calls for grilling the shallots slowly over indirect heat, giving them plenty of time to soften, brown and absorb the smoke. Or you can use the oven instead if need be, but you won't get that smoky flavor.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/09/23/multimedia/clark-grilled-shallots/clark-grilled-shallots-mediumThreeByTwo440.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dips and spreads", "keywords": "appetizer, labneh, pita, shallot, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 43}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 339, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "7 grams", "sodiumContent": "607 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["4 medium shallots", "1 medium white onion", "5 garlic cloves, peeled and left whole", "5 tablespoons extra-virgin olive oil, more as needed", "2 tablespoons chopped parsley, plus a handful of whole leaves", "1 tablespoon chopped mint, plus a handful of whole leaves", "1 tablespoon finely chopped preserved lemon", "1 teaspoon lemon juice", "Kosher salt, as needed", "Black pepper, as needed", "2 cups labneh or full-fat Greek yogurt", "Sumac, as needed", "Grilled pita, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel shallots and halve lengthwise through root end. Peel onion and cut into 2-inch chunks. Thread shallots and onion chunks onto metal or pre-soaked bamboo skewers. Thread garlic cloves onto a separate skewer. (If you're using the oven, skip skewering and see note on how to prepare the vegetables.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light or heat one side of grill. Leave the other side bare for indirect grilling. (If using a charcoal grill, mound coals to one side.) Lightly brush skewers with 1 tablespoon of the olive oil and place over bare side of the grill for indirect heat. Cover and cook, turning occasionally, until the garlic is soft, 30 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the garlic is soft, remove from grill or oven. Transfer onion and shallot to the hottest part of the grill (add more coals if necessary) and continue cooking, turning occasionally, until onions are almost tender and well charred in spots, 15 to 20 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cool enough to handle, coarsely chop onion and shallot and place in a large bowl. Mash garlic and add to bowl. Toss in remaining 4 tablespoons oil, the chopped parsley and mint, the preserved lemon, the lemon juice and the salt and pepper. Taste and add more salt, olive oil and/or lemon juice as needed. This mixture should be highly seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread labneh or yogurt on a large platter. Spoon onion mixture over surface. Drizzle with additional oil, and tear mint and parsley leaves and scatter over top. Sprinkle with sumac. Serve with grilled pita."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Charred Shallots With Labneh", "description": "Melissa Clark grills onions then chops them into a relish seasoned with preserved lemon and fresh herbs to serve with labneh.", "thumbnailUrl": "https://static01.nyt.com/images/2015/09/23/multimedia/clark-grilled-shallots/clark-grilled-shallots-mediumThreeByTwo440.jpg", "uploadDate": "2015-09-25T16:41:24.000Z", "duration": "PT2M17S"}}