{"@context": "http://schema.org", "@type": "Recipe", "name": "Edna Lewis’s Garden Strawberry Preserves", "description": "In \"The Taste of Country Cooking,\" Edna Lewis offers two recipes for strawberry preserves — one for wild and one for cultivated fruit, using different techniques to highlight their nuances. For garden berries, she gives an unusual method of heating the sugar separately, cutting down on the actual cooking time of the strawberries and preserving their delicate, fresh flavor.", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2015/11/01/magazine/01edna-lewis-southern-slide-2CZO/01edna-lewis-southern-slide-2CZO-articleLarge.jpg", "recipeYield": "5 5-ounce jars", "recipeCuisine": "southern", "recipeCategory": "", "keywords": "side dish, spring, strawberries", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "recipeIngredient": ["3 cups crushed strawberries", "2 1/2 cups sugar", "Paraffin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set 5 5-ounce sterilized jars and lids, or 3 1/2-pint jars in a pan of water over a low burner."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash berries in a bowl of cold water to make sure they are free of grit and dust. Remove berries by hand, and place them on a clean, dry towel to drain. Then remove the caps and crush berries slightly with a clean, odorless, wooden pestle or a strong coffee mug. Pour into a nonaluminum saucepan, and set over a low flame to heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the sugar either in a double boiler or in a dish in the oven, being careful not to brown it, but making sure it becomes very hot (about 10 minutes at 350). Now pour the hot sugar over the berries, turning the burner up while stirring the sugar around. The cooking should be as brisk as possible without scorching; it should take about 9 minutes in all."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as the preserves begin to boil up, a scum will rise on the surface; skim it off right away with a wooden or silver spoon. It is much better to skim while it's rapidly boiling, because that seems to cause the scum to remain in a mass, and it's easy to dip it out without getting too much of the syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 9 minutes of rapid cooking, pour the preserves into the hot jars, filling to about 1/8 inch from the top. Lift the jars out onto a dry surface to cool. When cold, carefully melt paraffin and pour into the filled jars. When paraffin is cool, put on the lids and seal."}], "link": "https://cooking.nytimes.com/recipes/1017785-edna-lewiss-garden-strawberry-preserves"}