{"@context": "http://schema.org", "@type": "Recipe", "name": "Open Blueberry Pie", "description": "This recipe for an open-faced blueberry pie came to The Times in 1961. \n\n\"At the risk of offending those Americans who insist that tradition be strictly observed, a recipe for blueberry pie is suggested here that varies considerably from the two-crust baked affair that is customarily served on the Fourth of July. For one thing, this pie has only one crust and, for another, the blueberries are not cooked. After washing, the fruit is rubbed in a towel just enough to bruise the skins. When hot, melted currant jelly is poured over the berries, just a bit of their juice ekes out to blend with the liquid. The pie is served cold, topped with whipped cream.\"\n\nIf you'd rather not use lard or shortening for the crust, butter will do just as well.", "author": {"@type": "Person", "name": "The New York Times"}, "image": null, "totalTime": "PT35M", "recipeYield": "One nine-inch pie or about six servings", "recipeCuisine": "", "recipeCategory": "snack, pies and tarts", "keywords": "blueberries, currant jelly, heavy cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 653, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "78 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "18 grams", "sodiumContent": "229 milligrams", "sugarContent": "39 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 quart fresh blueberries", "1 1/2 cups flour", "1/2 teaspoon salt", "1/2 cup lard or other shortening", "2 1/2 tablespoons water, approximately", "1 12-ounce jar currant jelly", "2 teaspoons lemon juice", "2 tablespoons butter", "1 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the berries, pick them over, discarding damaged specimens. Dry berries gently on a terry cloth towel, rubbing just enough to bruise the fruit. Refrigerate the berries until they are well chilled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together the flour and salt. Using a pastry blender or two knives, chop the shortening into the flour until the particles resemble a mixture of coarse cornmeal and peas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle water slowly over the top of the flour while tossing the mixture up from the bottom of the bowl with a fork. After about three-quarters of the water has been added, press the dampened part of the dough into a ball and set aside. Add only enough water to dampen the remaining flour mixture. Press all the dough together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the ball of dough on a floured pastry cloth or board, pat in all directions with a floured rolling pin and then roll from the center out in all directions, loosening the pastry and reflouring the cloth or board and rolling pin, if necessary. Roll into a round about one-eighth of an inch thick and two inches wider than the circumference of the top of a nine-inch pie pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the pastry into quarters, fit loosely into the nine-inch pie pan and press dough against the pan without stretching it. Trim the edge with a sharp knife, allowing the dough to extend slightly beyond the rim of the pan. Prick the bottom of the pastry with a fork in several places to prevent it from buckling while baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the pie shell in a preheated, hot oven (450 degrees) until crisp and delicately browned, about eight to ten minutes. Cool, then refrigerate the pie shell."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the currant jelly in the top of a double boiler over boiling water. Add the lemon juice and stir."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub the pastry shell with butter. Pour in the blueberries, distributing them evenly over the bottom of the pie crust. Pour the hot, melted currant jelly over the fruit and refrigerate the pie until chilled and set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, whip the cream until it is stiff and spoon it over the blueberries. Serve at once."}], "link": "https://cooking.nytimes.com/recipes/1017571-open-blueberry-pie"}