{"@context": "http://schema.org", "@type": "Recipe", "name": "Cracked Farro Risotto (Farrotto) With Parsley and Marjoram", "description": "Finally, a way to make something as comforting as an Italian rice risotto using farro. The chef Barry Maiden revealed this ingenious method to me. Soak the farro, drain and then crack the grains slightly in a food processor. This allows the thickly hulled wheat berries to release their starch, creating the creamy sauce that defines the dish. Farro has so much flavor and the resulting farrotto is much more robust than a rice risotto. It needs little more than fresh herbs as embellishment, but of course you could add any vegetable you like to use in risotto.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/17/science/recipehealthfarrorisoto/recipehealthfarrorisoto-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "Serves 4", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner", "keywords": "fall, spring, summer, winter, halal, kosher, low cholesterol, low sugar, nut-free, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 475, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "7 grams", "proteinContent": "23 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1561 milligrams", "sugarContent": "13 grams", "transFatContent": null}, "recipeIngredient": ["1 cup (7 ounces) farro", "2 cups boiling water", "7 cups chicken, vegetable or garlic stock or broth", "2 tablespoons extra virgin olive oil", "2 shallots, minced, or 1/2 cup finely chopped onion", "2 garlic cloves, minced", "1/2 cup dry white wine", "Salt to taste", "Freshly ground pepper to taste", "1/4 cup minced flat leaf parsley", "1 to 2 tablespoons chopped fresh marjoram", "1/4 to 1/2 cup freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Several hours or the day before you plan on serving the farrotto, place farro in a bowl and pour on 2 cups boiling water. Let sit for 3 hours, or refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain farro and place in a food processor fitted with steel blade. Pulse 5 to 10 times. Scrape down sides of bowl and pulse again 5 to 10 times. Some, but not all of the farro should be broken. Scrape into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put your stock or broth into a saucepan and bring it to a simmer on the stove, with a ladle nearby or in the pot. Make sure that it is well seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a wide, heavy skillet or saucepan over medium heat. Add shallots or onion and cook gently until just tender, 3 to 5 minutes. Add garlic and cook, stirring, until fragrant, about 30 seconds. Add farro and stir over medium heat until grains dry out a bit and begin to crackle. Add wine and cook, stirring, until wine is no longer visible in pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in enough of the simmering stock or broth to just cover the farro. The stock should bubble slowly. Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock and continue to cook in this fashion, not too fast and not too slowly, adding more stock when the farro is almost dry and stirring often, until mixture is creamy and farro is tender, about 25 minutes. Taste, adjust salt, and add pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another ladleful or two of stock to the pan. Stir in the parsley, marjoram and Parmesan, and remove from heat. The mixture should be creamy. Serve right away in wide soup bowls or on plates."}]}