{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised and Grilled or Broiled Pork Ribs", "description": "The barbecued ribs I like best are cooked all the way through, using moist, relatively low heat, then finished over a high flame for a final browning. And you can nicely, if imperfectly, replicate this process by braising the ribs and then finishing them over the grill or in the broiler. Of course the broiler won’t add wood flavor, but then neither will a gas grill or briquettes.\n\nWhat I did for the ribs in the recipe here was brown them, then slowly braise them in the oven (the top of the stove would work as well). When they were nearly falling off the bone I took them straight from the braising liquid and ran them under the broiler, just until they crisped up.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/09/11/dining/ribs-bittman/ribs-bittman-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 8 servings", "recipeCuisine": "barbecue", "recipeCategory": "dinner, barbecues", "keywords": "dark beer, spare ribs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 121}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 821, "unsaturatedFatContent": "37 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "67 grams", "fiberContent": "2 grams", "proteinContent": "42 grams", "saturatedFatContent": "20 grams", "sodiumContent": "792 milligrams", "sugarContent": "0 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 to 4 pounds spare ribs", "Salt and freshly ground black pepper to taste", "2 tablespoons vegetable oil", "10 allspice berries", "2 or 3 3-inch cinnamon sticks", "10 nickel-sized slices unpeeled fresh ginger or 1 tablespoon ground ginger", "5 dried red chiles or a teaspoon of cayenne", "5 cloves garlic, lightly smashed", "1 bottle dark beer, like Guinness or any porter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 300 degrees. Cut meat into two racks if necessary; season with salt and pepper. Put oil in a large, deep ovenproof skillet or casserole that can later be covered. Turn heat to medium-high and, when oil shimmers, sear meat on both sides until nicely browned, turning as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add allspice, cinnamon, ginger, chiles and garlic and stir; add beer. Bring to a boil; cover pan and adjust heat so mixture simmers steadily. Put in oven and cook until meat is tender, 1 hour or more. (You can prepare meat up to a day or two ahead; if you are not going to grill or broil immediately, put whole pan in refrigerator after it cools a bit.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light a charcoal or gas grill or heat broiler; rack should be about 4 inches away from heat source. Drain meat and sprinkle it with salt and pepper. Grill or broil on both sides until brown and crisp, just a few minutes. Meanwhile, skim cooking liquid of fat, bring to a boil, and use as sauce."}], "link": "https://cooking.nytimes.com/recipes/1017695-braised-and-grilled-or-broiled-pork-ribs"}