{"@context": "http://schema.org", "@type": "Recipe", "name": "Great South Bay Duck Ragù", "description": "This is a home cook's version of a wild-shot brant ragù cooked by Dave Pasternack of Esca in Manhattan. He served it thick and dark, a kind of tomato jam knit together with heavy shreds of meat, riding a polenta raft: poultry that looked like pork and tasted of fish, a combination to reel the mind. It was food of deep intensity and flavor, and it led to crazy, vivid dreams. Made with farmed duck amped up with anchovies, juniper, and vinegar it becomes a dish of domestic heritage, though with a feral streak, absolutely delicious.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2011/04/24/magazine/24Eat_span/24Eat_span-articleLarge-v3.jpg", "totalTime": "PT2H45M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, lunch, roasts", "keywords": "anchovy, chicken stock, duck leg, juniper berries, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 159}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1120, "unsaturatedFatContent": "58 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "95 grams", "fiberContent": "5 grams", "proteinContent": "33 grams", "saturatedFatContent": "31 grams", "sodiumContent": "1363 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["4 duck legs, trimmed", "1 tablespoon olive oil", "3 ribs celery, trimmed and cut into small dice", "2 medium-size carrots, peeled and cut into small dice", "1 medium-size red onion, peeled and cut into small dice", "4 cloves garlic, peeled and minced", "8 fillets of salted anchovy, rinsed, dried and minced", "6 juniper berries", "1 ½ cups dry red wine", "½ cup red-wine vinegar", "3 tablespoons tomato paste", "2 cups low-sodium chicken stock", "1 tablespoon minced fresh sage", "Kosher salt and freshly ground black pepper to taste", "2 cups cooked polenta, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350. Trim excess skin from duck legs and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a Dutch oven with a tightly fitting lid over medium heat. Add olive oil to the pot, and when it begins to shimmer, add the duck legs, skin side down. Cook until the skin is well browned and the fat has begun to render, approximately 8 to 10 minutes. Turn the legs over and brown the other sides, 5 to 10 minutes more. Remove to a plate to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the celery, carrots, onion and garlic to the pot, and stir to combine. Cook until the onions have softened and have just started to color, approximately 8 to 10 minutes. Clear a space in the center of the pot and add the anchovies, then swirl them in fat until they begin to dissolve. Stir to combine. Add juniper berries, wine, vinegar and duck legs, and cook until most of the liquid has evaporated, approximately 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomato paste and stir to combine, then enough chicken stock so that the combination takes on a sauce-like consistency and just covers the duck. Increase heat to high and bring to a boil. Put a lid onto the pot and place in the oven. Cook for 90 minutes, or until the legs are almost falling off the bone."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove duck from pot and allow to cool slightly. Peel off skin, dice and reserve. Shred meat off bones and return to pot. Place pot on stove top over medium heat and bring to a simmer. Add duck skin to taste, sage and salt and freshly ground black pepper to taste. Serve over polenta."}], "link": "https://cooking.nytimes.com/recipes/1017317-great-south-bay-duck-ragu"}