{"@context": "http://schema.org", "@type": "Recipe", "name": "Tunnel-of-Fudge Cake", "description": "The original tunnel-of-fudge cake won second place in the 1966 Pillsbury Bake-Off Contest for the late Ella Rita Helfrich of Houston. That version used a fudge icing mix to create a gooey chocolate center. But Pillsbury discontinued the icing mix, and the resulting clamor of home bakers led Pillsbury to release a recipe for making tunnel-of-fudge cake from scratch. In 2004, The Times presented an adaptation of that recipe with the help of Shirley Corriher, a biochemist and the author of \"Cookwise\" and \"Bakewise,\" books about how scientific principles can be applied to cooking and baking.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2015/08/14/dining/14FUDGETUNNELCAKE1/14FUDGETUNNELCAKE1-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "1 cake", "recipeCuisine": "", "recipeCategory": "snack, cakes", "keywords": "cocoa powder, flour, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 190}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 727, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "87 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "18 grams", "sodiumContent": "273 milligrams", "sugarContent": "60 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 1/2 cups walnuts or pecans, chopped", "2 tablespoons unsalted butter", "1/4 teaspoon salt", "1 1/4 cups unsalted butter, cut into tablespoon-size pieces, softened, plus more for greasing the pan", "1 cup sugar", "3/4 cup dark brown sugar, packed", "3/4 teaspoon salt", "1 teaspoon vanilla", "1/3 cup vegetable oil", "2 large egg yolks", "4 large eggs", "2 cups confectioners sugar", "2 1/4 cups bleached all-purpose flour", "3/4 cup natural cocoa powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a heavy baking sheet or pizza stone on a shelf in the lower third of the oven. Heat the oven to 350 degrees (see note)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a large baking sheet, roast nuts in the oven for 10 minutes. Keep watch that they do not burn. Pour into a bowl, and add 2 tablespoons butter and 1/4 teaspoon salt. Toss well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously butter the inside of a large 12-cup Bundt cake pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixer, beat butter to soften until it becomes fluffy. Add sugar, then the brown sugar and continue to beat until airy. While beating, if the bowl does not feel cool, place it in the freezer for five minutes, then resume beating."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat in 3/4 teaspoon salt, vanilla and vegetable oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat in two egg yolks. Crack the four whole eggs into a large mixing bowl. With a small knife, cut yolks and barely stir the eggs, minimally blending the whites and yolks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer on the lowest speed, beat the eggs into the batter in three batches. Mix in confectioners' sugar and the cocoa."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, stir flour and nuts together. Then with a spatula stir the flour-nut mixture into the batter. Pour the batter into the Bundt pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 40 minutes. You cannot use the toothpick test because the cake contains so much sugar that the center will not set but will remain a tunnel-of-fudge. You are dependent on a correct oven temperature and the 40-minute cooking time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When removed from the oven, the cake will have a runny fudge core with an air pocket above the fudge. About 30 minutes after taking the cake out of the oven, press the inside and outside edge of the cake bottom down all the way around to minimize the air pocket. Let the cake, still in the pan, cool on a rack for two to three hours. Invert the cake onto a platter and let cool completely."}], "link": "https://cooking.nytimes.com/recipes/1017578-tunnel-of-fudge-cake"}