{"@context": "http://schema.org", "@type": "Recipe", "name": "Dark Chocolate Mint Sorbet", "description": "When I dream about the decade-plus I spent living in Paris, there’s often a dessert involved. Specifically, it’s the luxurious chocolate mint sorbet that I used to order every time I splurged on one of my favorite restaurants, the Michelin-starred <a href=\"http://www.alaindutournier.com/wp/autrougascon/\">Au Trou Gascon</a>. It has the thrill and depth of any dark chocolate dessert, but with a light, refreshing quality. This is my version, and it couldn’t be simpler.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/02/11/dining/11MARTHA/11MARTHA-articleLarge.jpg", "totalTime": "PT15H45M", "recipeYield": "1 generous quart", "recipeCuisine": "french", "recipeCategory": "ice creams and sorbets", "keywords": "dairy-free, gluten-free, dark chocolate, mint tea, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 113}, "recipeIngredient": ["3 tablespoons mild honey, such as clover, or corn syrup", "1/3 cup, plus 1 1/2 tablespoons sugar", "10 ounces dark chocolate, at least 72 percent, finely chopped (about 1/4-inch pieces; no need to chop if using disks)", "1 mint herbal tea bag", "1/2 teaspoon peppermint extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 3 1/4 cups water, the honey or corn syrup and the sugar in a saucepan and bring to a boil. Stir with a rubber spatula until sugar is completely dissolved and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place chocolate and tea bag in a medium-size bowl. Pour on hot water mixture and let stand for 5 minutes. Remove tea bag. Add peppermint extract."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a hand blender, blend mixture until smooth, 1 to 2 minutes. Stir bottom of bowl with a rubber spatula to make sure mixture is well combined, and blend again if necessary. The chocolate will separate to an extent when chilled, but you will be blending it again. Cover bowl and refrigerate for at least 12 hours. Place a 1-quart container (or slightly larger) in the freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove sorbet mixture from refrigerator and blend again until smooth. The chocolate that has slightly solidified on top will be reincorporated. Freeze in an ice cream maker following manufacturer’s directions. Transfer to the chilled container. Cover and place in freezer for 2 hours or longer. Allow sorbet to soften in refrigerator for 1 hour before serving."}], "link": "https://cooking.nytimes.com/recipes/1017220-dark-chocolate-mint-sorbet"}