{"@context": "http://schema.org", "@type": "Recipe", "name": "Matzo Brei with Caramelized Apples", "description": "This recipe is adapted from the restaurant Jane in downtown New York. There, the chef Glenn Harris offers a matzo brei that is an expanded version of his mother's. Mr. Harris's mother, in Brooklyn, made sweet matzo brei with honey or jelly, or matzo meal pancakes the size of silver dollars sprinkled with sugar. His version is much more elaborate, with cubes of caramelized apples, a vanilla-honey sauce and mascarpone.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "jewish", "recipeCategory": "quick, snack, pies and tarts", "keywords": "apple, honey, mascarpone, matzo, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 18}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 750, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "100 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "4 grams", "proteinContent": "18 grams", "saturatedFatContent": "17 grams", "sodiumContent": "481 milligrams", "sugarContent": "34 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 cup honey", "1 vanilla bean", "9 tablespoons unsalted butter", "2 Granny Smith apples, peeled, cored and cut into 1/2-inch cubes", "2 tablespoons sugar", "1 1-pound box matzo", "8 large eggs", "1 teaspoon kosher salt", "4 ounces mascarpone cheese (or yogurt)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place honey in a small saucepan or microwavable bowl. Split vanilla bean lengthwise and use tip of knife to scrape seeds into honey. Add bean to honey as well. Gently warm honey over low heat or in microwave until it thins enough to easily pour, about 1 to 2 minutes. Keep warm or reheat before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a sauté pan until very hot. Add 2 tablespoons butter, the apples and sugar. Fry, stirring occasionally, until apples are soft and caramelized, 8 to 10 minutes. Transfer to a dish and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place matzos in a large bowl and cover with warm water. Soak for 1 minute, then drain, pressing to remove excess water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, lightly beat eggs with salt. Break soaked matzo into large pieces, adding them to eggs, and toss well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 6 tablespoons butter in a 10-inch nonstick pan over medium-low heat. Add matzo and eggs and cook, pressing down on top with a spatula, until crisp on bottom, about 8 minutes. Use a flexible metal spatula to loosen bottom and sides, then invert pan over a plate to flip matzo brei. Add remaining tablespoon butter to pan and swirl to coat bottom. Slide matzo brei back into pan and continue to cook until a crust has formed on bottom and it is cooked through, about 3 to 5 more minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut matzo brei into 6 pieces. Top each piece with apples and a spoonful of mascarpone, and serve drizzled with honey vanilla sauce."}]}