{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Short Ribs with Star Anise and Tangerine", "description": "Beef short ribs, cut flanken style, are the best choice for any number of braises or stews, whether it’s Yankee pot roast or French pot-au-feu. Since they have the perfect fat-to-lean ratio, they always remain juicy. Here, a fragrant Chinese-inspired marinade featuring star anise, cinnamon stick, 5-spice powder and tangerine makes them anything but ordinary. Serve these short ribs in a Western manner with mashed root vegetables, or stick with Asian accompaniments like steamed rice and daikon radish.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/12/03/dining/03KITCH1_HORIZ/03KITCH1_HORIZ-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "chinese", "recipeCategory": "", "keywords": "beef short ribs, star anise, tangerine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 146}, "recipeIngredient": ["5 pounds beef short ribs, cut flanken style, across the bone in 3-inch pieces", "Salt and pepper", "1 tablespoon five-spice powder", "1/2 teaspoon ground Sichuan pepper (optional)", "2 tablespoons grated ginger", "1 tablespoon minced garlic", "Zest of 1 large tangerine, in wide strips", "1/2 cup tangerine juice", "6 to 8 small dried Chinese chile peppers (or chiles de arbol)", "1/2 cup dark brown sugar", "2 tablespoons soy sauce", "1 teaspoon toasted sesame oil", "1 tablespoon salted black bean paste", "1 daikon radish, about 1 pound peeled (optional)", "3 pieces star anise", "1 cinnamon stick, 3-inch length", "1/4 cup Chinese rice wine or sherry", "3 cups hot chicken broth or water", "2 teaspoons cornstarch dissolved in 2 tablespoons cold water", "6 scallions, thinly sliced, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season short ribs generously on both sides with salt and pepper and place in a heavy roasting pan in one layer. In a mixing bowl, stir together five-spice powder, Sichuan pepper (if using), ginger, garlic, tangerine zest and juice, chile peppers, brown sugar, soy sauce, sesame oil and black bean paste. Smear mixture over meat and leave to marinate at least one hour at room temperature, or preferably overnight in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Cut daikon into 1/2-inch pieces and set aside. Bring meat to room temperature. Add star anise, cinnamon stick, rice wine and broth to roasting pan. Cover and bake for 1 1/2 hours, then add daikon and return to oven. Bake for 30 minutes more, until meat is quite tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove meat and daikon from pan and keep warm in a serving dish. Strain braising juices into a saucepan and degrease. You should have about 3 cups. Bring to a simmer, then whisk in cornstarch mixture and cook for 1 minute until slightly thickened. Pour sauce over meat and daikon, garnish with scallions and serve."}], "link": "https://cooking.nytimes.com/recipes/1017017-beef-short-ribs-with-star-anise-and-tangerine"}