{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Lamb on Rosemary Skewers", "description": "Lamb on rosemary skewers has to be one of the oldest recipes in the world. In ancient times, the meat could just as easily have been goat, or something wilder, and fish was no doubt also a candidate. The idea of cutting branches of rosemary and using them as skewers must certainly have occurred to humans soon after they figured out how to build fires. \n\nYou want rosemary branches with woody stalks, if possible. But if the stalks are too flimsy to poke through the lamb, run a pilot hole through with a skewer, and be sure to grill the lamb and figs separately because they'll cook at different rates. You might throw together a little basting sauce of lemon, garlic and a little more rosemary, but the skewers are just fine without it, and have been for thousands of years.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2008/07/15/dining/video-3352_1_lamb_1_p2_xml/video-3352_1_lamb_1_p2_xml-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, skewers and kebabs", "keywords": "fig, garlic, lamb shoulder, lemon juice, rosemary, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 84}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 584, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "4 grams", "proteinContent": "26 grams", "saturatedFatContent": "15 grams", "sodiumContent": "726 milligrams", "sugarContent": "21 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds boneless lamb shoulder, cut into chunks", "10 to 20 fresh figs", "Rosemary branches", "1/4 cup extra virgin olive oil, more or less", "Salt and freshly ground black pepper to taste", "1/2 cup freshly squeezed lemon juice", "2 cloves garlic, roughly chopped", "1 tablespoon minced fresh rosemary"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start a charcoal or wood fire or heat a gas grill; fire should be moderately hot. Thread lamb and figs onto rosemary branches, three or four chunks or figs per skewer. Do not mix meat and figs on same skewer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush lightly with olive oil and season with salt and pepper. Mix together the lemon juice, garlic and minced rosemary and brush a little of this mixture on lamb and figs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill, turning skewers as each side browns and taking care to avoid flare-ups; total cooking time should be from 6 to 10 minutes for medium-rare meat, and 4 or 5 minutes for the figs. Meat will become slightly more done after you remove it from grill, so take this into account."}], "link": "https://cooking.nytimes.com/recipes/1017204-grilled-lamb-on-rosemary-skewers"}