{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Thai Pork Tenderloin Salad", "description": "There are a lot of ingredients in this bright and bold-tasting pork salad recipe; they add up to a vibrant dish you can serve warm or at room temperature to a spice-loving crowd. Lean pork tenderloin is marinated with chiles, ginger root and cilantro, grilled or broiled, then combined with cabbage, fresh herbs and nuts and coconut for richness. A bit of reserved marinade serves as the dressing. The recipe makes a large batch; you can halve it or make the whole thing and enjoy the leftovers.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/07/29/dining/29APPE_web/29APPE_web-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 to 8 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "basil, cashew, napa cabbage, pork tenderloin, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 945}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 412, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "7 grams", "proteinContent": "26 grams", "saturatedFatContent": "5 grams", "sodiumContent": "981 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds boneless pork tenderloin (usually 2 tenderloins)", "2/3 cup thinly sliced shallots (about 4 shallots)", "2/3 cup chopped cilantro leaves and tender stems", "5 tablespoons light brown sugar", "6 garlic cloves, grated", "5 tablespoons soy sauce", "5 tablespoons peanut or grapeseed oil", "Juice and zest of 4 limes", "3-inch piece peeled ginger root, grated", "2 tablespoons Asian fish sauce", "1/2 teaspoon kosher salt, more to taste", "1 to 2 Thai bird, serrano or jalapeño chile peppers, seeded and minced", "8 cups Napa or regular cabbage, thinly sliced", "5 whole scallions, trimmed and thinly sliced", "2 small Kirby or Persian cucumbers, thinly sliced", "1 red bell pepper, thinly sliced", "1 1/2 cups cilantro leaves", "1 1/2 cups mint leaves", "1 cup basil leaves", "1 1/4 cups roasted cashews or peanuts, toasted and chopped", "1/4 cup unsweetened coconut chips or large flakes, toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat pork dry with paper towel. In a bowl, combine shallot, cilantro, 2 tablespoons of the sugar, garlic, soy sauce, peanut or grapeseed oil, lime zest and juice, ginger, fish sauce, salt and chile. Pour a quarter of the mixture into a blender, add remaining sugar and purée until a smooth, loose paste forms. (Save the unblended mixture to use as dressing.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place tenderloin in a large bowl and spread the paste all over pork. Marinate at room temperature for 2 hours, or cover and refrigerate up to 24 hours; turn the tenderloin occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light the grill or heat the broiler and arrange a rack at least 4 inches from the heat. Grill or broil pork, turning occasionally, until well browned and meat reaches an internal temperature of 135 degrees, 4 to 10 minutes per side depending upon the heat of your broiler or grill. Keep an eye on it so it doesn’t overcook. Let meat rest while you prepare the salad. (Or, cook the pork 1 or 2 hours  ahead and serve it at room temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the salad ingredients, reserving the herbs, cashews and coconut. Whisk the dressing and use just enough to dress the salad, tossing to combine. Let sit for a few minutes for the flavors to meld, then right before serving, add herbs and toss again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, slice the pork. Arrange salad on a platter and top with sliced pork. Scatter cashews and coconut on top, drizzle with a little more of the remaining dressing, to taste."}], "link": "https://cooking.nytimes.com/recipes/1017575-spicy-thai-pork-tenderloin-salad"}