{"@context": "http://schema.org", "@type": "Recipe", "name": "Savory Oatmeal With Greens and Yogurt", "description": "Take a break from sweetened oatmeal for breakfast and try this savory version, simple enough to prepare even on a busy weekday morning (though for that matter, it’s good any time of day). With garlicky spinach and yogurt, it is a well-rounded healthy meal. Make the toasted oat and nut topping in advance and you’ll be a step ahead; the quantities below make more than you'll need, so make it once and keep it on hand for up to two weeks. Regular oats take only about 30 minutes to cook and have more flavor than quick-cooking oats.  ", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/02/24/dining/24KITCH/24KITCH-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "1 serving", "recipeCuisine": "", "recipeCategory": "breakfast", "keywords": "almond, oats, pumpkin seeds, spinach, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 254}, "recipeIngredient": ["1/4 cup oats", "1/4 cup slivered raw almonds", "1/4 cup pumpkin seeds", "1/4 cup hemp seeds or sunflower seeds", "1/4 teaspoon salt", "1 teaspoon extra-virgin olive oil", "1/2 cup oats", "Salt and pepper", "1 tablespoon extra-virgin olive oil", "1 small clove garlic, finely diced", "Pinch of crushed red pepper", "5 ounces spinach leaves, about one large handful washed and drained", "Plain full-fat yogurt, preferably Bulgarian yogurt, for garnish  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the toasted oat and nut topping: Mix the oats, almonds, pumpkin seeds and hemp seeds together in a small bowl with salt and olive oil. Transfer to a baking sheet and bake for 10 minutes, or just until fragrant and lightly toasted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the oatmeal: In a small saucepan, bring 1 cup water to a boil, then add the oats and a pinch of salt. Reduce to a low simmer, cover, and cook for 20 minutes. Stir occasionally. Turn off the heat, cover the pot, and let steam for an additional 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the greens: Heat about 1 tablespoon of olive oil in a medium skillet over medium-high heat. Once the oil begins to shimmer, add the garlic and crushed red pepper. (The garlic should just sizzle but not brown.) Then add the greens, salt to taste, and briefly wilt for around one minute (but no longer than two); turn with tongs to evenly cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the oatmeal in the bowl, surround with greens and pan juices, and garnish with about 1 tablespoon toasted oat and nut topping. Finish with a dollop of yogurt and freshly ground pepper. Sprinkle with a little salt and a drizzle of olive oil if desired."}]}