{"@context": "http://schema.org", "@type": "Recipe", "name": "Tortilla Soup With Roasted Cauliflower 'Rice'", "description": "This is not exactly authentic, but I wanted to add a vegetable to my tortilla soup, to make it more of a dinner in a bowl, so I decided to shave cauliflower, toss the ricelike pieces with oil and chili powder, and roast it. I loved the addition of the spicy roasted cauliflower to each bowl of soup, along with the tortilla crisps that I toasted in the microwave rather than frying. You can make this soup even more substantial by adding eggs (see the variation that follows the recipe).", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/10/science/recipehealthtortilla/recipehealthtortilla-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch", "keywords": "appetizer, main course, gluten-free, halal, high fiber, kosher, low cholesterol, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 299}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 160, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "907 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 small head cauliflower", "3 tablespoons extra virgin olive oil", "Salt to taste", "1 teaspoon chipotle chili powder or medium-hot chili powder", "1/2 medium onion, finely chopped", "1 teaspoon mild or medium-hot chili powder", "2 plump garlic cloves, minced", "1 (14-ounce) can chopped tomatoes", "1 1/2 quarts chicken stock, vegetable stock or garlic broth", "6 corn tortillas, cut in strips", "1/4 cup chopped cilantro", "2 tablespoons freshly squeezed lime juice", "1/4 cup crumbled queso fresco or feta", "Lime wedges for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Line a sheet pan with parchment. Lay cauliflower on its side and, using a sharp chef’s knife, shave off thin slices of the top of the florets so that the cauliflower falls apart into ricelike bits. Shave enough to acquire 3 cups cauliflower “rice.” The volume will reduce quite a lot after roasting. Place on parchment-covered baking sheet and toss with 2 tablespoons olive oil, salt to taste, and 1 teaspoon chipotle powder or chili powder. Place in oven and roast for 15 to 20 minutes, stirring every 5 minutes, until cauliflower is thoroughly tender and some bits are lightly colored but not burnt. Remove from oven and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat remaining olive oil in a heavy soup pot over medium heat and add onion. Cook, stirring often, until tender, about 5 minutes. Add a generous pinch of salt and chili powder and stir together for a minute, then add garlic and continue to cook, stirring, for another minute, until fragrant. Add tomatoes, stir well to deglaze bottom of pot, and cook, stirring often, until tomatoes have cooked down and smell fragrant, about 10 minutes. Add salt to taste. Add stock or broth, bring to a simmer, cover and simmer over low heat for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While soup is simmering, toast tortilla strips in batches in microwave. Place in a single layer on a plate and microwave at full power for 1 minute. Turn strips over and microwave for another minute. Repeat if necessary for 30 seconds, or until crisp and light brown. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an immersion blender, blend soup until smooth. Bring back to a simmer and stir in cilantro. Simmer for 1 minute. Taste and adjust salt. Stir in lime juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Distribute toasted tortilla strips and cauliflower “rice” among soup bowls and ladle in the soup. Top with crumbled cheese and serve."}]}