{"@context": "http://schema.org", "@type": "Recipe", "name": "Simple Beans on Toast", "description": "These utterly simple beans come from Steve Sando, the owner of Rancho Gordo, which is known for its heirloom bean varieties. You can use any kind of dried bean (cannellini is pictured here); do not used canned beans. This recipe leans on great ingredients, which don't need much help, and lets them shine. That means you should use the best you've got, right down to the drizzle of olive oil that finishes the dish. If you do want to dress them up a bit, add a bay leaf at the beginning of cooking, and a sprig of thyme or rosemary during the last hour or so of cooking.", "author": {"@type": "Person", "name": "J. J. Goode"}, "image": "https://static01.nyt.com/images/2016/01/06/dining/06BEANS1/06BEANS1-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 to 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, main course, beans, bread, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 159}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 277, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "6 grams", "sodiumContent": "413 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil, plus more for finishing", "3 medium garlic cloves, finely chopped", "1 medium white or yellow onion, finely chopped", "1 medium carrot, peeled and finely chopped", "1 medium stalk celery, finely chopped", "1 pound dried heirloom beans, picked over and rinsed", "2 teaspoons kosher salt", "8 large slices crusty bread, cut 1/2-inch thick", "4 tablespoons unsalted butter, softened", "Flaky sea salt and ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil in a large pot over medium heat until it shimmers. Add the garlic, onion, carrot and celery and cook, stirring frequently, until the vegetables are soft and fragrant but not browned, about 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans and enough water to cover by about 2 inches. Increase the heat to high and bring to a boil; cook for 15 minutes. Reduce the heat to a very gentle simmer (bubbles just barely breaking the surface), partly cover and cook until the pot stops smelling like the aromatics and starts smelling like the beans, 1 hour to 1 hour 15 minutes. Add more water if necessary to keep the beans fully submerged. Gently stir in kosher salt and continue cooking until the beans are creamy in texture but not bursting, 10 to 45 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the beans, reserving the tasty cooking liquid for another purpose, such as a base for soup or a vehicle for egg poaching. You can store leftover beans in their cooking liquid in an airtight container in the fridge for up to 5 days. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the bread and then butter each piece. Spoon about 1/2 cup beans onto each piece of toast and coarsely crush with a fork. Divide the remaining whole beans among the toasts (about 1/4 cup per toast). Drizzle with olive oil and sprinkle with sea salt and pepper to taste."}], "link": "https://cooking.nytimes.com/recipes/1017874-simple-beans-on-toast"}