{"@context": "http://schema.org", "@type": "Recipe", "name": "Herb Fritters", "description": "Inspired by a recipe in Clifford A. Wright’s “The Little Foods of the Mediterranean,” these fritters are light and delicate. You can use a mix of herbs and finely chopped greens – mild ones like spinach and chard, or more robust greens like dandelion or arugula – or all herbs, or all greens. You can also use this batter as a vehicle for other finely chopped or grated vegetables, like cabbage or carrots, onions or leeks. The fritters make a great hors d’oeuvre or side dish.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/03/10/science/recipehealthherb/recipehealthherb-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "dinner, lunch, snack, vegetables", "keywords": "appetizer, side dish, dairy-free, halal, kosher, low sugar, nut-free, vegetarian, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 50}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 64, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "108 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup whole wheat flour", "1/4 cup unbleached all-purpose flour", "1/2 teaspoon baking powder", "Rounded 1/2 teaspoon salt", "1 egg, separated", "1 tablespoon extra virgin olive oil", "3/4 cup sparkling water", "1 1/2 cups finely chopped fresh herbs or a mix of herbs and greens (such as spinach or chard)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together flours, baking powder and salt in a large bowl. Make a well in the center and add egg yolk and oil. Beat egg yolk and oil together, add sparkling water and mix in flour. Whisk until smooth. Cover with plastic and let sit for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat egg white to stiff but not dry peaks and fold into batter. Fold in finely chopped herbs and greens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour oil into a wok or wide saucepan to a depth of 3 inches and heat over medium-high heat to 360 to 375 degrees. Set up a sheet pan with a rack on it next to pan. Cover rack with a few layers of paper towels. Have a spider or deep fry skimmer handy for removing fritters from oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": ". Scoop up the batter by the tablespoon and carefully drop into the hot oil. You should be able to fry about 5 at a time. After a few seconds flip the fritters over, then fry until golden brown, about 2 minutes, flipping over again halfway through. Remove from oil with a spider or deep-fry skimmer and drain on the towel-covered rack. Allow to cool slightly, and serve."}]}