{"@context": "http://schema.org", "@type": "Recipe", "name": "Fannie Farmer’s Parker House Rolls", "description": "In 1896, Fannie Farmer, then principal of the Boston Cooking School, wrote and published a cookbook that revolutionized the way home cooks thought about cooking and housekeeping (she introduced the concept of using measuring cups and spoons, among other things). The book, originally titled “The Boston Cooking-School Cook Book,” was a smash hit in the United States and became known simply as “The Fannie Farmer Cookbook.” It is still in print. This classic recipe is an adaptation of one found in a revised edition by Marion Cunningham. It takes time but very little effort, and you will be rewarded with soft, pillowy, butter-rich rolls worthy of your best breadbasket.", "author": {"@type": "Person", "name": ""}, "image": "https://static01.nyt.com/images/2015/10/26/dining/26COOKING_BISCUITS1/26COOKING_BISCUITS1-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "30 rolls", "recipeCuisine": "american", "recipeCategory": "breads", "keywords": "side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 350}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 122, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "105 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons butter, at room temperature, plus 4 tablespoons melted butter for brushing dough", "2 tablespoons sugar", "2 teaspoons salt", "2 cups warm milk", "1 package dry yeast", "6 cups white flour, approximately"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the 4 tablespoons room-temperature butter, the sugar, the salt and the warm milk in a large bowl and let cool to lukewarm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the yeast into 1/4 cup warm water and let it stand for 5 minutes to dissolve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sponge: Add 3 cups flour and the dissolved yeast to the ​milk​ mixture and beat vigorously for 2 minutes​ to form a loose batter.​ Cover and let rise in a warm place until double​d​ in bulk, about 1 hour​. ​​​"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the remaining flour 1/2 cup at a time to form a shaggy dough firm enough to knead. Turn out onto a lightly floured board, knead for a minute or two, then let rest for 10 minutes. Resume kneading until smooth​, 8 to 10 minutes​.​ (Alternatively, add the sponge and 3 cups flour to the bowl of a stand mixer fitted with the dough hook, and knead on low until the dough is smooth and pulls away from the sides of the bowl, 10 minutes.) Cover the bowl and let rise again until doubled in bulk, 45 to 60 minutes. ​"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a rolling pin, roll out dough until it is 1/3 inch thick. Cut with a 2 3/4-inch round biscuit cutter or with an oval Parker House roll cutter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the dull edge of a knife, make a crease through the center of each piece of dough, brush with melted butter, fold in half along the crease, and press edges lightly together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place rolls 1 inch apart on a buttered baking sheet (or use a silicone baking mat). Let rise again until dough has doubled in size, about 45 minutes. (It should feel spongy to the touch, and hold an indentation when pressed with a finger.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position a rack in the upper third of the oven and heat to 425 degrees. Bake rolls until golden, about 12 to 18 minutes. Brush again with melted butter. Let cool for a few minutes, then serve warm. The rolls are best when freshly baked but can be reheated in a 350-degree oven for a few minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1017773-fannie-farmers-parker-house-rolls"}