{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Miso-Glazed Tofu With Wild Mushrooms", "description": "Asian flavors suit mushrooms as well as the Mediterranean seasonings I usually work with. This Japanese-inspired miso glaze is used with both the tofu, as a glaze, and as a flavoring for the mushrooms.  I used a mixed mushroom pack from Whole Foods for this, which included varieties of enokis and maitakes, with both thin and thick stems that had a nice meaty texture but weren’t tough like shiitake stems. If salt is a concern, look for a lower-sodium miso, now available from a few companies.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/02/science/05recipehealth/05recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 190}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 319, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "6 grams", "proteinContent": "20 grams", "saturatedFatContent": "3 grams", "sodiumContent": "646 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup mirin", "1/4 cup sake, vegetable or mushroom stock, or chicken stock", "2 rounded tablespoons white or yellow miso paste", "1 teaspoon sugar", "2 teaspoons dark sesame oil, divided", "1 pound mixed wild mushrooms – recommend enoki type mushrooms and maitakes", "2 tablespoons extra virgin olive oil or grape seed oil, divided", "2 garlic cloves, minced", "Salt to taste", "1/4 cup dry white wine", "Pinch of cayenne (more to taste)", "1 teaspoon soy sauce", "1 14-ounce block firm tofu"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the miso glaze, combine mirin and sake or stock in the smallest saucepan you have and bring to a boil over high heat. Boil 20 seconds, taking care not to boil off much of the liquid, then turn the heat to low and stir in miso and sugar. Whisk over medium heat until sugar has dissolved. Remove from heat and whisk in 1 teaspoon of sesame oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If mushrooms have thick long stems, cut stems in half and then into 1/2-inch pieces. Separate all of the clumps of mushrooms into individual mushrooms. You can use the bottom of the clump. Cut into 1/2-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wok or wide heavy skillet over high heat until a drop of water evaporates in a second. Add 1 tablespoon olive or grapeseed oil and mushrooms and sear without moving for 30 seconds, then stir-fry for 1 to 2 minutes, until they begin to sweat. Turn heat to medium and add garlic. Stir-fry 30 seconds, then add salt to taste and stir-fry until mushrooms are soft, 2 to 3 minutes. Add wine and stir-fry until it is no longer visible in the pan. Add 3 tablespoons of miso glaze, stir together and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Line a sheet pan with parchment. Transfer remaining glaze to a wide bowl and whisk in remaining sesame oil, cayenne, remaining grapeseed or peanut oil and soy sauce. Cut tofu into 8 to 10 slices and pat dry with paper towels. Dip each slice into miso glaze, making sure to coat both sides. Transfer to baking sheet. Bake 15 minutes, until edges are just beginning to color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently reheat mushrooms. Place a couple of slices of tofu on each plate, top with the mushrooms and serve."}]}