{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon Rillettes", "description": "A light but rich tasting spread made with fresh and smoked salmon. This is my adaptation of David Lebovitz’s  adaptation of Susan Loomis’s salmon rillettes, a recipe that I have been wanting to make for years. A more buttery version is in Susan Loomis’s wonderful book “Cooking at Home on Rue Tatin,” and on <a href=\" http://www.davidlebovitz.com/about/\">David Lebovitz’s</a> eponymous website. David uses a mixture of steamed fresh salmon and smoked salmon, and I have followed suit, changing the proportions slightly. I used much less butter – 1 tablespoon, and a tablespoon each of olive oil and crème fraîche, as well as some Greek yogurt, and I still came up with a mixture that I can call rillettes. You can serve the spread with sliced bread or crackers, spoon onto endive leaves, cucumber rounds or squares of red and green pepper, or use as a filling for miniature bell peppers. You can also substitute these salmon rillettes for the smoked trout rillettes in the recipe for “Lentils With Smoked Trout Rillettes” from earlier this week. As always, use a fork, not a food processor, to make this.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/06/science/11recipehealth/11recipehealth-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "1 3/4 cups, serving 8 generously", "recipeCuisine": "french", "recipeCategory": "brunch, dinner, lunch, snack, dips and spreads", "keywords": "fall, spring, summer, winter, gluten-free, halal, kosher, low-carb, low cholesterol, low sugar, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 95}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 105, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "0 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "137 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 6-ounce salmon fillet, bones removed", "Salt and freshly ground pepper", "5 ounces smoked salmon, cut into thin strips, then into 1/4-inch pieces", "1 tablespoon unsalted butter, at room temperature", "1 tablespoon extra virgin olive oil", "4 tablespoons plain Greek yogurt", "1 tablespoon crème fraîche (or omit and use 5 tablespoons yogurt)", "1 1-2 to 2 tablespoons fresh lemon juice", "2 tablespoons chopped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil a steamer basket. Season salmon with salt and pepper and place in steamer basket over 1 inch of boiling water. Cover and steam 5 to 8 minutes, depending on thickness of the salmon. It should be just cooked through and easy to flake apart, but moist. Remove from heat and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a fork or a whisk, cream butter and olive oil together until mixture is smooth and emulsified."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flake salmon into a medium-size bowl and add smoked salmon. Using a fork, mash the two together until well combined and salmon has broken down like canned tuna. Add butter and olive oil, yogurt and crème fraîche and work together with a fork until well combined. Add lemon juice to taste and the chives, and mix together well. Add pepper and mix together. Chill for 1 to 2 hours. Allow to come to room temperature before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Either spoon onto endive leaves or other vegetables, or serve with toasted bread or crackers."}]}