{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared and Roasted Brussels Sprouts With Red Pepper and Mint Gremolata", "description": "Searing brussels sprouts in a hot cast iron pan was a revelation to me when I first began preparing them this way a few years ago. In this version, adapted from Momofuku’s recipe for Roasted Brussels Sprouts With Fish Sauce Vinaigrette, as featured in Food52’s upcoming book “Genius Recipes,” I achieve the sear on the cut surface of the sprouts in the pan, finish them in a hot oven, then return them to the frying pan, where in the meantime I have cooked a sweet red pepper. The combo is", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/16/science/15recipeforhealth/15recipeforhealth-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, vegetables", "keywords": "dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, low-sodium, low sugar, nut-free, vegan, vegetarian, fall, winter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 68}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 137, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "5 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "338 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds brussels sprouts, preferably small ones", "4 tablespoons extra virgin olive oil", "Salt", "1 medium red bell pepper, diced", "1 to 2 plump garlic cloves (to taste), minced", "1 tablespoon finely chopped or grated lemon zest", "1 to 2 tablespoons finely chopped mint (to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim brussels sprouts at the base, remove unattached leaves and set them aside. Cut in half and place in a large bowl. Toss with 1 tablespoon olive oil and season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Line a sheet pan with parchment. Heat 2 tablespoons olive oil over medium-high heat in a large, heavy skillet (cast iron is ideal). Add as many brussels sprout halves as will fit in a single layer, cut side down, and sear until nicely browned, 3 to 5 minutes. Transfer to baking sheet, cut side down, and repeat with remaining sprouts if you could not fit them all in during the first round. Place baking sheet in oven and roast until sprouts are tender, another 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat remaining oil in pan over medium heat and add red pepper. Cook, stirring often, until tender, about 5 minutes. Add garlic and cook, stirring, until fragrant, 30 seconds to a minute. Add roasted brussels sprouts to pan, stir together and add lemon zest, mint and freshly ground pepper. Heat through, taste and adjust seasonings. Remove from heat and serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Optional garnish: After removing roasted brussels sprouts from oven turn heat down to 350 degrees and move rack to highest setting. Toss loose leaves you set aside with a little olive oil and salt and spread on baking sheet in a single layer. Roast on top shelf of oven for 15 minutes. Move to middle rack and roast another 2 to 3 minutes, until brown and crisp. Serve as garnish."}], "link": "https://cooking.nytimes.com/recipes/1017071-seared-and-roasted-brussels-sprouts-with-red-pepper-and-mint-gremolata"}