{"@context": "http://schema.org", "@type": "Recipe", "name": "Broccoli Rabe Lasagna", "description": "Broccoli rabe (sometimes spelled raab, or known as rapini greens) is one of the most delicious members of the mustard green family. The leaves, tender stems and broccoli-like buds have a distinctive pleasant bitterness when cooked. For this vegetarian lasagna, some of the cooked greens are puréed to make a garlicky pesto and the rest is coarsely chopped and added to the layers.\n\n<a href=\"http://cooking.nytimes.com/68861692-nyt-cooking/1001747-the-greatest-lasagna-recipes\">Find more lasagna recipes.</a>", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/03/18/dining/18KITCHEN1/18KITCHEN1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, pastas", "keywords": "broccoli rabe, half and half, lasagna noodles, parmesan, ricotta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 559}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 948, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "74 grams", "cholesterolContent": null, "fatContent": "59 grams", "fiberContent": "7 grams", "proteinContent": "33 grams", "saturatedFatContent": "28 grams", "sodiumContent": "1044 milligrams", "sugarContent": "6 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 tablespoons butter", "1/4 cup all-purpose flour", "2 cups half-and-half, heated, plus a little more if necessary", "Salt and pepper", "Pinch of cayenne", "Grated nutmeg, to taste", "1 pound dry lasagna noodles", "Salt and pepper", "2 bunches broccoli rabe, about 2 pounds", "4 garlic cloves, minced", "1/2 cup extra-virgin olive oil", "1 pound ricotta cheese", "1/2 teaspoon grated lemon zest", "4 tablespoons butter", "4 ounces grated Parmesan, about 2 cups, or a combination of Parmesan and pecorino"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the béchamel: Melt butter in a small saucepan. Whisk in flour and cook for a minute over medium heat without browning. Gradually whisk in half-and-half, 1/2 cup at a time, to obtain a smooth, lightly thickened sauce. Turn heat to low. Add 1/2 teaspoon salt, some ground black pepper, the cayenne and nutmeg. Cook, whisking, for 4 to 5 minutes, then place saucepan in a hot-water bath to keep sauce warm. Thin if necessary with a little more half-and-half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to the boil. Add lasagna noodles and cook for 5 minutes. Lift noodles from water with a spider and rinse well in a bowl of cold water. Drain and lay noodles flat on a kitchen towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the same cooking water, blanch the greens for 1 minute, until just wilted. Rinse greens with cool water, squeeze dry and chop them roughly. Put 1 cup of chopped greens, the minced garlic and 1/2 cup olive oil in a food processor or blender and purée to make a pesto. Season with salt and pepper to taste and transfer to a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the ricotta and lemon zest in a small bowl and season with salt and pepper to taste. Heat oven to 375 degrees. Organize to have all ingredients within easy reach for assembling lasagna. Use 2 tablespoons butter to grease an 8-by-10-inch baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the lasagna: Put a layer of cooked noodles on the bottom of the baking dish. Spoon a quarter of the béchamel over noodles, then dot with a third of the ricotta. Complete layer with chopped greens, a drizzle of pesto and some grated cheese. Continue layering, finishing with a layer of pasta. Spread the last of the béchamel on top and sprinkle with Parmesan. (There should be 4 layers of pasta and 3 layers of filling.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dot with remaining butter and bake, covered with foil, for 20 minutes. Uncover and bake for 20 minutes more, until nicely browned and bubbling. Let lasagna rest 10 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1017294-broccoli-rabe-lasagna"}