{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Sausages, Onions and Peppers", "description": "There is no more reliable guest at a cookout than sausage, roasted over the open fire. But before you grill the meat, get some peppers and onions soft and dark and fragrant in the heat, and use these as a bed on which to serve the links. Italian sausage works beautifully here, as do hot links and bratwurst. If cooking brats, think about simmering them first in beer and onions, then finishing them on the fire.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/07/15/dining/15SAUSAGE/15SAUSAGE-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "barbecues", "keywords": "main course, sausage, sweet pepper", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 265}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 636, "unsaturatedFatContent": "34 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "2 grams", "proteinContent": "23 grams", "saturatedFatContent": "18 grams", "sodiumContent": "1110 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 pound sweet peppers (green, red and yellow, if available) seeded and cut into eighths", "2 large yellow onions, peeled and cut into large coins", "3 to 4 tablespoons extra-virgin olive oil, more to taste", "1/4 teaspoon salt, more to taste", "2 pounds sweet or hot Italian sausages, or bratwurst or other fresh sausage"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Build a fire in your grill, leaving one side free of coals. When coals are covered with gray ash and the temperature is medium (you can hold your hand 5 inches above the coals for 5 to 7 seconds), you are ready to cook. (For a gas grill, turn all burners to high, lower cover and heat for 15 minutes, then turn burners to medium.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toss peppers and onions with oil and sprinkle with salt. Lightly prick sausages all over so that they do not burst."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put peppers and onions in a grill basket or directly on the grill, turning occasionally until they are softened and dark at the edges, 10 to 12 minutes. Move them to the side of the grill without coals."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the sausages on the hot side of the grill, cover and cook, turning occasionally until they are cooked through, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the peppers and onions to a platter and top with the sausages. Drizzle with olive oil and serve."}], "link": "https://cooking.nytimes.com/recipes/1017555-grilled-sausages-onions-and-peppers"}