{"@context": "http://schema.org", "@type": "Recipe", "name": "Simple Pencil Cob Breakfast Grits", "description": "Sometimes the taste of a humble, simple food can be a life-changing event. This recipe, courtesy of Kay Rentschler, creative director of Anson Mills, is a fail-safe method for making the mill’s luxuriously flavored heirloom grits. When properly cooked – over very low heat after an overnight soak – the resulting grits are incredibly creamy and almost as sweet as fresh corn. It is important to understand why you must cook these grits over the lowest possible heat: these are coarse grits, and if they are over-hydrated or boiled after they begin to thicken they will take forever to cook. (In technical terms, thickening is the point at which the first starch takes hold, or the point after continuous gentle stirring when the grits particles remain suspended in the liquid and you no longer have to stir continuously). Moreover, as Anson Mills founder Glenn Roberts explained to me, if the heat is too high the new crop flavors of the corn will be blown out, in the same way that the flavor of fresh herbs is diminished by high heat.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/24/science/recipehealthbreakfastgrits/recipehealthbreakfastgrits-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "Serves 4", "recipeCuisine": "american", "recipeCategory": "", "keywords": "fall, spring, summer, winter, gluten-free, halal, kosher, low cholesterol, low sugar, nut-free, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 33}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 196, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "4 grams", "sodiumContent": "442 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup Anson Mills Colonial Coarse Pencil Cob Grits", "About 4 cups spring or filtered water", "Fine sea salt, to taste (1/2 to 1 teaspoon)", "2 tablespoons unsalted butter", "1/2 teaspoon freshly ground black pepper (or to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The night before you wish to serve, place grits in a heavy, medium saucepan (Ms. Rentschler recommends a type called a Windsor saucepan; I used a Le Creuset). Add 2 cups spring or filtered water and stir once. Allow grits to settle a full minute, then tilt the pan and, using a fine tea strainer or fine skimmer, skim off and discard chaff and hulls. Cover and allow the grits to soak overnight at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 cups water in a small saucepan to a bare simmer and keep hot. Set saucepan with grits over medium heat. Bring mixture to a simmer, stirring constantly with a wooden spoon, until the first starch takes hold (see above – it means that the mixture will begin to thicken and you will no longer have to stir constantly). Reduce heat to lowest possible setting. The grits should not be bubbling, they should be sighing, or breathing like somebody in a deep, comfortable sleep, rising up lazily in one big bubble, then falling as the bubble bursts. Watch carefully and each time they are thick enough to hold a spoon upright, stir in about 1/4 cup of the hot water. Stir in the salt after the first 10 minutes of gentle cooking. It should take about 25 minutes for the grits to be tender and creamy and by this time you should have added 3/4 to 1 cup water (perhaps a little more) in 3 or 4 additions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the grits are done – tender, creamy but not mushy, and able to hold their shape on a spoon – stir in the butter vigorously, add pepper, taste (carefully – don’t burn your tongue after all that care) and adjust salt. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1017155-simple-pencil-cob-breakfast-grits"}