{"@context": "http://schema.org", "@type": "Recipe", "name": "Florence Lin's Smoked Chicken", "description": "", "author": {"@type": "Person", "name": "Fred Ferretti"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "chicken, main course", "aggregateRating": null, "recipeIngredient": ["1 4-pound (approximately) roasting chicken", "4 tablespoons coarse salt", "1 tablespoon Sichuan peppercorns", "1/4 cup hickory chips (see note)", "2 tablespoons black tea leaves", "2 teaspoons sesame oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean the chicken by rinsing it with water. Drain and dry well. Brown the salt and peppercorns in a dry frying pan over moderate heat until the salt turns slightly brown and the peppercorns smell fragrant. Use a spoon to sprinkle the hot salt and pepper on the inside and outside of the chicken. With your hand rub the mixture in thoroughly and evenly. Place the chicken in a container with a cover, and store in the refrigerator overnight or for up to two days for a more concentrated flavor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a steamer or pot with a cover that is large enough to hold a deep dish that can hold the chicken. Pour water into the large pot until it is at least 1 1/2 inches deep. Place a rack or ovenproof glass above the water. Set the chicken dish on the rack. Cover tightly, bring water to a boil, and steam for 45 minutes. Take the chicken out to cool and dry completely. Save the chicken liquid for other uses, such as soup stock or gravy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the inside of a wok and its domed cover with aluminum foil. Sprinkle hickory chips and black tea over the bottom of the wok. Place an oiled rack in the wok. Lay the chicken on it. Cover the wok with the domed cover, and smoke over moderate heat for 15 minutes. Turn off the heat, and let stand for 5 minutes to allow the smoke to dissipate before removing the cover. If the hickory chips and tea leaves are not fully burned and the chicken's skin is not brown in color, continue smoking for 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken, and brush with sesame oil. Cut the chicken into small pieces. Smoked chicken can be made in advance and will keep for days in the refrigerator."}], "link": "https://cooking.nytimes.com/recipes/10178-florence-lins-smoked-chicken"}