{"@context": "http://schema.org", "@type": "Recipe", "name": "Fireplace Trout", "description": "Here is a recipe for trout like the one we ate in Maine. I now add garlic cooked in olive oil, because I have watched enigmatic Basques add it to regal white hake they cook above coals burned from oak. It goes well with the simple trout's innate subtlety and faint whiff of wood smoke, and it all ends up resolutely likable.\n\nThis takes only a few minutes, and mostly needs only the fire that's already in your fireplace. I think it prudent to cook the garlic in a separate pan on the stove, leaving the fish the only thing to attend to on the actual fire — at least until you are confident and happy before the old Egyptian monster. It is doable all in one pan, but it is quite important to not let something simple and fun and ancient begin to seem complicated.", "author": {"@type": "Person", "name": "Tamar Adler"}, "image": "https://static01.nyt.com/images/2015/01/25/magazine/25eat/25eat-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "4 servings", "recipeCuisine": "new england", "recipeCategory": "easy", "keywords": "main course, trout", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 98}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 355, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "0 grams", "proteinContent": "16 grams", "saturatedFatContent": "5 grams", "sodiumContent": "114 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup olive oil, divided equally in two", "3 big cloves garlic, halved lengthwise and sliced", "4 fillets rainbow trout", "1/8 teaspoon salt plus more for seasoning the fish", "2 sprigs thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a frying or sauté pan, heat 1/4 cup olive oil until just warm. Add the sliced garlic and 1/8 teaspoon salt. Stir once or twice, and remove from the heat the instant it begins to color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly season the fish with salt on both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a very large cast-iron pan on top of a fireplace grate with only coals underneath it. Once your hand feels warm over the pan, add 2 tablespoons olive oil and one sprig of thyme. Then add two fillets, flesh side down. Cook for 3 minutes, and using a metal spatula, turn each fillet onto the skin side and cook, 2-3 minutes, until flesh is just firm. (The fish will continue cooking even when removed from the pan, so removing it a touch undercooked is wise.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Keeping the two finished trout close to the fire, repeat with the next two. When all are cooked, place, either side up, on a large platter or directly onto plates. Warm the garlic in oil in the fire for a few seconds, then spoon evenly over all the fish."}], "link": "https://cooking.nytimes.com/recipes/1017142-fireplace-trout"}