{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Beef Pho", "description": "An elegant, comforting bowl of pho usually requires blanching beef bones and then simmering them with spices for hours. Andrea Nguyen, a cookbook author who lives in drought-plagued California, wanted the same effect but in a recipe that used less water and less energy. This broth can be put together in less than an hour. It cooks in a standard stove-top pressure cooker for 20 minutes and in an electric pressure cooker for 30. “As much as I love to simmer a stockpot of beef pho for three hours,” Ms. Nguyen says, “it’s incredibly liberating to make a pretty good version for four people in about an hour.\"", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2015/07/08/dining/08JPDRO2/08JPDRO2-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "vietnamese", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "beef knuckle, beef steak, rice stick noodles, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 677}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 453, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "73 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "0 grams", "sodiumContent": "245 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pounds beef knuckle, marrow or other soup bones", "1 pound boneless beef brisket, chuck or cross-rib roast in one piece", "4 ounces Fuji apple, about 1/2 of a medium-large apple", "1 large yellow onion", "2 ounces fresh ginger", "2 1/2 pieces star anise", "1 3-inch cinnamon or cassia stick", "3 whole cloves", "2 1/2 teaspoons fine sea salt", "1 1/2 to 2 tablespoons fish sauce", "Sugar, if desired", "6 ounces beef steak, such as top or bottom sirloin, eye of round or London broil (optional)", "12 ounces dried narrow rice sticks or pad Thai-style noodles", "1/2 small yellow or red onion", "2 slender green onions", "1/4 cup chopped cilantro leaves", "Black pepper", "Optional add-ins: thinly sliced Fresno, Thai or serrano chile; a large handful of bean sprouts, mint sprigs or Thai basil; lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the broth:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the bones and boneless beef. Peel and cut apple into chunks. Halve the large onion and cut into thick slices. Peel ginger, halve it lengthwise, cut into chunks, then smash each piece with the side of a knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the star anise, cinnamon and cloves in an 8-quart pressure cooker. Over medium heat or using the sauté function, toast for several minutes, stirring frequently, until fragrant. Add the onion and ginger. (If using a stove-top pressure cooker, raise heat to medium-high.) Stir and cook for a minute or two. A little browning is O.K. Add 9 cups water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the bones, beef, apple and salt. Lock the lid. If using a stovetop pressure cooker, raise heat to high and bring pressure to 15 p.s.i. Then reduce the heat to medium or medium-low. The pressure should be just high enough that a gentle, steady flow of steam comes out of the cooker’s valve. Cook for 20 minutes. If using an electric pressure cooker, set timer for 30 minutes. After cooking, both cookers will require time to allow pressure to decrease naturally, about 15 to 20 minutes. When that is done, carefully remove lid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer boneless meat to a bowl, cover with water and soak for 10 minutes. This cools it and keeps it from drying out. If desired, scrape any bits of tendon from the bones and add to the bowl of water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the broth into a pot through a mesh strainer lined with cheesecloth or muslin. Discard the remaining solids. (At this point, the broth and beef can be cooled and refrigerated for up to 3 days.) Skim all but about 3 tablespoons of fat from the broth. You should have about 8 cups of broth. Add fish sauce and more salt, if needed. Add a few pinches of sugar and more fish sauce so the broth has a rounded, intense finish that is slightly salty and slightly sweet."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Prepare the bowls:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Freeze the raw beef, if using, for 15 to 20 minutes, then slice very thinly across the grain. Cut cooked beef across the grain into very thin slices. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the dried noodles in hot tap water and soak for 15 to 20 minutes, or until pliable and opaque. Drain, then rinse to remove starch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice the small onion and soak in water 10 minutes. Slice green onions into thin rings and set aside with chopped cilantro. Arrange any optional add-ins on a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the broth to a simmer over medium heat. At the same time, fill a pot with water and bring to a rolling boil. Dunk the noodles into the boiling water, using a noodle strainer or a mesh sieve, for about 15 to 20 seconds. Remove from water and divide noodles among 4 bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top each bowl of noodles with cooked and raw beef, arranging the slices flat. Place a mound of onion in the center, then shower with green onion and cilantro. Finish with a sprinkle of black pepper. Give the boiling broth a final taste for seasoning. Ladle about 2 cups broth into each bowl, distributing the hot liquid evenly to warm all the ingredients."}]}], "link": "https://cooking.nytimes.com/recipes/1017521-pressure-cooker-beef-pho"}