{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Clams", "description": "This recipe for baked clams tried to bridge the gap between the glory of a clam pulled from a clambake and the unfortunate, common mediocrity of ubiquitous baked stuffed clams. It contains some of the usual suspects — onion and celery — and some unusual ones, like clam juice and vermouth. Importantly, it doesn't require clam shucking, which is a dangerous occupation, best avoided unless you are very brave.", "author": {"@type": "Person", "name": "Tamar Adler"}, "image": "https://static01.nyt.com/images/2015/12/13/magazine/13eat1/13mag-13eat-t_CA1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings (or 2 if you love clams)", "recipeCuisine": "", "recipeCategory": "", "keywords": "clams, cream", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 179, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "1 gram", "proteinContent": "12 grams", "saturatedFatContent": "5 grams", "sodiumContent": "474 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["24-30 littleneck or cherrystone clams*", "3 tablespoons clam juice", "3 tablespoons water", "2 tablespoons dry vermouth", "1 cup combined (any combination) sliced green or plain white garlic, finely sliced leek, chopped celery, fennel or fennel top", "3 tablespoons butter plus 2 tablespoons unsalted butter, separated", "2 tablespoons heavy cream", "1/4 cup chopped celery leaf", "1 tablespoon chopped fennel frond", "1 tablespoon chopped chervil (if available; if not, use more celery leaves or fennel fronds)", "3 tablespoons fresh bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the clams very well. Put them, the clam juice, water and vermouth in a big pot with a cover. Cook them over very high heat, bringing them to a boil, until they are just cooked, removing them one by one, or by the few, to a roasting pan or other flat tray, with tongs or a hand-held sieve, the instant they pop open."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once they’ve cooled, remove the clams from the shells. Divide top and bottom shells. Wash as many as you plan to serve, and leave them to dry. Add any liquid left with the clams to the liquid in the clam pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sauté the cup of garlic, leeks, celery and fennel in 3 tablespoons of butter, adding only the tiniest, barest bit of salt to help the vegetables release their liquid. Cook for 5 to 10 minutes, until leeks are tender and taste good. Through a fine strainer, add all the liquid in the clam pot. Bring to a boil, and cook down until only about 1 cup of liquid remains. Add the heavy cream. Taste for salt. Add the chopped leaves and chervil and the clams, either whole or roughly chopped."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the remaining 2 tablespoons of butter into 24 small squares. If it seems difficult, use more butter. No precision needed. Fill each half clamshell very full with the clam mixture — with either 1 clam per shell, if left whole, or a spoonful, if chopped. Top each half with a sprinkle of bread crumbs and a tiny square of butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put in a single layer, in 1 or 2 large roasting or baking pans, under the broiler at its highest setting, quite close to the broiler. Serve hot."}]}