{"@context": "http://schema.org", "@type": "Recipe", "name": "Île Flottante With Fresh Cherries", "description": "The name of this French dessert means “floating island.” It consists of soft meringue islands set afloat on a sea of the pourable vanilla custard called crème anglaise. Traditionally it is garnished with caramel sauce and praline powder. Here the dessert is flavored with cardamom and rose water instead, drizzled with cherry syrup and topped with pistachios.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/06/10/dining/10KIT1/10KIT1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "brunch, pastries, pies and tarts", "keywords": "cardamom pods, cherries, pistachio, vanilla bean, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 48}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 274, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "7 grams", "sodiumContent": "133 milligrams", "sugarContent": "30 grams", "transFatContent": null}, "recipeIngredient": ["1 pound/450 grams pitted cherries (about 2 1/2 cups)", "1 cup/180 grams grams granulated sugar", "1 teaspoon rose water", "1 1/2 cups/400 milliliters half-and-half or whole milk", "6 cardamom pods, lightly crushed", "1/2 vanilla bean (halved lengthwise)", "2 strips lemon peel", "1/4 cup/45 grams granulated sugar", "1 teaspoon cornstarch", "4 egg yolks", "2 egg whites", "1/8 teaspoon cream of tartar", "Pinch of salt", "1/2 cup/45 grams granulated sugar", "2 cups/500 milliliters whole milk", "1/4 cup/30 grams toasted pistachios, roughly chopped, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare cherries: Put cherries and sugar in a wide saucepan over medium heat, stirring to dissolve sugar. Bring to a gentle simmer and cook for 10 to 15 minutes, until cherries are soft. Remove cherries and reduce syrup over high heat until somewhat thickened, about 5 minutes. Pour syrup back over cherries. Stir in rose water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crème anglaise: Put half-and-half in a saucepan over medium heat and add cardamom, vanilla bean and lemon peel. Bring milk to just under a simmer and remove from heat. Let steep 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl whisk together sugar and cornstarch. Add egg yolks and whisk to a creamy consistency. Place mixing bowl over a pot of boiling water (making a double boiler), making sure water does not touch bottom of bowl. Slowly add the hot milk to the mixture and cook mixture, whisking continuously. When ready, after 5 minutes or so, it should coat a spoon and resemble thick cream. Remove from heat. Strain through a fine sieve, then cool over an ice bath, whisking occasionally. Refrigerate. (May be prepared up to a day in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meringues: Put egg whites in a clean mixing bowl with cream of tartar and salt. Whip whites until stiff, then add sugar and continue beating until shiny peaks form."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put milk in a wide saucepan and bring to a simmer. Spoon meringue into 6 cloud shapes and place in simmering milk. Cover pan and cook for about 5 minutes, until meringues are firm. Remove with a slotted spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, pour 1/2 cup crème anglaise into each of 6 shallow bowls. Top each with a meringue. Garnish with cherries and a drizzle of cherry syrup. Sprinkle with chopped pistachios."}], "link": "https://cooking.nytimes.com/recipes/1017447-ile-flottante-with-fresh-cherries"}