{"@context": "http://schema.org", "@type": "Recipe", "name": "Lard Pie Crust", "description": "This delicate, puffy crust uses a combination of lard and butter for the richest flavor and the largest flakes. You can substitute more lard for the butter, but you will lose some of the complexity. Make sure to seek out rendered leaf lard from a good butcher or specialty market, or try your local farmers’ market. It’s the purest and best quality pig fat to use in a crust. Avoid processed lard from the supermarket at all costs; it's been hydrogenated to increase shelf life and can sometimes have an off or mildly rancid flavor, not to mention the dangers of hydrogenated fat to your arterial health.\n\nYou can freeze this crust for up to 3 months. Defrost for 8 hours or overnight in the refrigerator.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": null, "totalTime": "PT4H15M", "recipeYield": "1 (9-inch) single pie crust", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 53}, "recipeIngredient": ["1 1/4 cup/160 grams all-purpose flour", "1/4 teaspoon/2 grams fine sea salt", "6 tablespoons/85 grams/3 ounces unsalted European-style butter, chilled and cut into 1/2-inch pieces", "4 tablespoons/57 grams/2 ounces chilled rendered leaf lard, cut into 1/2-inch pieces", "2 to 5 tablespoons/30 to 75 milliliters ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, briefly pulse together the flour and salt. Add the butter and lard and pulse until the mixture forms chickpea-size pieces (3 to 5 one-second pulses). Or, if making by hand, stir together the flour and salt. Use two knives or a pastry cutter to cut the butter and lard into the flour mixture until you get slightly smaller pieces, the size of green peas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the ice water, 1 tablespoon at a time, and pulse or mix until the mixture is just moist enough to hold together. Form the crust into a ball, wrap with plastic and flatten into a disc. Refrigerate at least 4 hours before rolling out and baking."}], "link": "https://cooking.nytimes.com/recipes/1017771-lard-pie-crust"}