{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Cavatelli", "description": "These are an easy, homey version of handmade pasta that freeze well. They are sturdier and more toothsome than gnocchi but have more character than dried cavatelli. It takes a little practice to get the flip of the indentation just right, but once you get the feel for it you can turn out enough for dinner quickly. They hold up well under a heavy tomato ragù, but also take well to a simple sauce of butter, a little pasta water and Parmesan or pecorino. This recipe is easy to double, too, which leaves plenty to freeze for another night. Spread in a single layer on a baking sheet dusted in flour, then store in a zippered plastic bag.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2015/05/05/dining/potato-cavatelli-horizontal/potato-cavatelli-horizontal-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings as a first course, 4 as a main course", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, dumplings, pastas", "keywords": "appetizer, main course, russet potatoes", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 132}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 469, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "3 grams", "sodiumContent": "366 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 large russet potatoes", "1 tablespoon butter", "1/4 cup milk", "1/4 cup neutral oil, like canola", "1 teaspoon kosher salt", "4 eggs", "3 cups flour/450 grams, plus more for rolling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil potatoes unpeeled and send through a ricer to make 2 cups. Alternately, peel and boil, then mash. Mix in butter and milk. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a sturdy bowl, using a stand mixer with a dough hook, or a wooden spoon or your hands,  mix potatoes, oil, salt and eggs until smooth. Work in 2 cups flour, gradually adding more until  dough is stiff and not sticky. (The amount of flour needed can vary greatly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pinch off a ball of dough, roll into a rope about an inch in diameter and cut into 3/4-inch dumplings. On a floured surface, press your thumb against the cut side of each dumpling and press down and away, so the dough flattens and flips up over your thumb. The result should look like a miniature hot dog bun."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In boiling salted water, cook cavatelli, stirring once or twice as soon as you put them in, for about 5 minutes or until they rise to the top. Alternately, put them in a single layer on a baking sheet, then store in the freezer in a plastic bag. Dumplings will take about 10 to 12 minutes to cook. Top with tomato sauce, pesto or butter and Parmesan."}]}