{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Cabbage and Black Rice, Greek Style", "description": "If I were making an authentic Greek version of this dish it would be named “cabbage rice” and would call for twice as much olive oil, regular long-grain rice but probably not basmati, and green cabbage. What I had on hand in my kitchen was purple cabbage, and I thought I would go all the way with those purple flavonoids and cook the purple cabbage with black rice, using the same formula the Greeks use for their comforting Lenten meals. With all of my recipes this week I will be focusing my attention on simple Greek Lenten vegetable and rice or bulgur dishes (Eastern Orthodox Lent begins Feb. 23), inspired by recipes in Diane Kochilas’s book “Ikaria: Lessons on Food, Life, and Longevity From the Greek Island Where People Forget to Die.”", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/02/24/science/recipehealthcabbage/recipehealthcabbage-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 64}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 346, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "827 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup extra virgin olive oil", "1 medium onion, chopped", "2 garlic cloves, minced", "1 pound purple cabbage (1 medium), shredded (about 5 cups)", "Salt to taste", "1 cup black rice", "2 1/2 cups water", "Freshly ground black pepper", "1/4 cup chopped fresh parsley", "1/4 cup chopped fresh dill", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons olive oil over medium heat in a deep, lidded skillet or a wide, lidded saucepan. Add onion and cook, stirring often, until tender, about 5 minutes. Add garlic and stir until fragrant, about 30 seconds. Stir in cabbage, add a generous pinch of salt, and cook, stirring, until cabbage has wilted and softened, about 8 minutes. Stir in rice and stir to coat with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add water, salt, pepper, parsley and dill and bring to a boil. Reduce heat to low, cover and simmer 35 to 40 minutes, until rice is cooked through and the liquid just about absorbed. Remove from heat, uncover and place a towel across the top of the pan. Return the lid and let sit for 10 minutes. Serve hot, with remaining olive oil drizzled over the top."}], "link": "https://cooking.nytimes.com/recipes/1017248-red-cabbage-and-black-rice-greek-style"}