{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Bone-In Rib-Eye Steaks With Blue Cheese", "description": "The usual formula for cooking an amazing slab of steak is as simple as they come: salt plus pepper plus a short stint over a hot fire. But there are times when you want an extra shot of flavor. Some good crumbled blue cheese sprinkled on the hot steak so it melts over the top does just that, especially when you spike it with hot sauce and butter. I like to use a combination of direct and indirect heat when grilling a bone-in piece of meat; it allows a crust to form but not burn while keeping the meat juicy inside. But you know your grill best, so let your instinct guide you as to where to move the steaks and when you think they are done. And if blue cheese isn’t your thing, follow the grilling directions here but leave your meat bare except for the salt and pepper. If you start with good meat, you will never go wrong.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/08/12/multimedia/clark-steak-cheese/clark-steak-cheese-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, steaks and chops", "keywords": "blue cheese, rib-eye steak, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 178}, "recipeIngredient": ["2 (1 1/2-inch-thick) bone-in rib-eye steaks, about 1 1/4 pounds each", "2 teaspoons coarse kosher salt", "Black pepper, as needed", "Extra-virgin olive oil, as needed", "2 ounces creamy blue cheese, such as Jasper Hill Bayley Hazen Blue", "1 tablespoon unsalted butter", "2 teaspoons finely chopped chives", "Hot sauce, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season steaks with salt and pepper at least 30 minutes and up to 1 hour before you plan to cook them. Cover loosely with plastic wrap and let stand at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat grill to high. If using a charcoal grill, mound coals to one side, allowing for an area of indirect heat. If using a gas grill,  turn on only a few of the burners and leave the rest off for indirect heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil steaks. Place on the hottest part of the grill. Cook, covered, until they develop a golden-brown crust, 2 to 3 minutes per side. Move steaks to indirect heat and crumble cheese over the top; cover and continue cooking 2 to 5 minutes longer, depending on desired doneness. (Pull the meat at 125 degrees for rare.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer steaks to a cutting board to rest, loosely covered with foil, for 10 minutes. While steaks rest, stir together butter, chives and hot sauce. Pour over steak before serving.  "}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Grilled Rib-Eye Steak", "description": "Melissa Clark grills rib-eye steak, and tops it off with blue cheese, butter and chives.", "thumbnailUrl": "https://static01.nyt.com/images/2015/08/12/multimedia/clark-steak-cheese/clark-steak-cheese-mediumThreeByTwo440.jpg", "uploadDate": "2015-09-11T19:26:38.000Z", "duration": "PT2M13S"}}