{"@context": "http://schema.org", "@type": "Recipe", "name": "Little Onion Tarts With Gorgonzola and Walnuts", "description": "For the holidays, cookie platters abound, but for those without a sweet tooth, these little savory tarts are just as appealing. Caramelized onions and Gorgonzola on buttery pastry rounds, topped with walnuts and sprinkled with rosemary — what’s not to love? Perfect with drinks, they reheat beautifully, too.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/12/02/dining/02KITCHEN1/02KITCHEN1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "24 small tarts", "recipeCuisine": "", "recipeCategory": "finger foods", "keywords": "appetizer, gorgonzola, onion, walnut, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 221}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 87, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "3 grams", "sodiumContent": "65 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup/150 grams all-purpose flour", "Pinch of salt", "4 ounces/113 grams unsalted butter, cold, cut in 1/4-inch cubes", "2 tablespoons/30 milliliters ice water", "1 tablespoon/15 milliliters lemon juice", "2 tablespoons olive oil", "1 pound yellow onions, sliced 1/8-inch thick (about 2 cups)", "Salt and pepper", "3 ounces Gorgonzola or other blue cheese, cut or broken into 1/2-inch chunks", "1/2 cup walnut pieces", "1 tablespoon finely chopped rosemary", "2 tablespoons finely cut chives", "Fleur de sel, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pastry: Put flour and salt in a mixing bowl. Add half the butter and work it into the flour until it resembles damp sand. Add the rest of the butter cubes, the ice water and lemon juice and mix just until the dough comes together. (There will be little chunks of butter in the dough — this makes the pastry flaky.) Form dough into a disk shape, wrap in plastic and flatten to a 1-inch thickness. Refrigerate for at least an hour, or up to a day in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the topping: Put olive oil in a cast-iron skillet over medium-high heat. Add onions and brown for about 5 minutes, stirring. Season generously with salt and pepper. Turn heat to medium and cook until onions are soft and well browned, about 10 minutes. Let cool to room temperature. Heat oven to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out pastry to about 1/8 inch thickness. Using a cookie cutter or a glass, cut out 2-inch rounds and move them to a plate. Once you've filled the plate, transfer to the refrigerator. Reroll the scraps and continue to cut rounds, chilling as you go. You should have 24 pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 2 baking pans with parchment and lay 12 pastry rounds on each. Put about 1 tablespoon of the caramelized onions on each round, followed by a piece of Gorgonzola. Top each with walnut pieces. Sprinkle with a small pinch of chopped rosemary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to oven; bake for 10 to 15 minutes, until lightly browned. Sprinkle each tart with chives, and a speck of fleur de sel, if using. Serve warm or at room temperature."}]}