{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Berry Crostata With Lemon Curd", "description": "If the classic fruit tart is a well-heeled matron, a crostata is a lusty peasant girl. Pressed into a fluted mold for form and discipline? Not likely. Roll out the dough, fill it up, crimp it over and slide it into a blazing oven. A crostata is light and unencumbered, the perfect showcase for late summer fruit.", "author": {"@type": "Person", "name": "Kay Rentschler"}, "image": "https://static01.nyt.com/images/2015/11/19/dining/19COOKING-FRUITCROSTATA/19COOKING-FRUITCROSTATA-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 tarts", "recipeCuisine": "", "recipeCategory": "", "keywords": "blueberries, lemon curd, pastry flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 23}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 333, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "8 grams", "sodiumContent": "234 milligrams", "sugarContent": "36 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup all-purpose flour, more for dusting", "1/2 cup white pastry flour", "4 teaspoons sugar", "1/2 teaspoon fine sea salt", "6 tablespoons high-fat (European style) butter, chilled and cut into 6 pieces", "1 large egg", "2 egg yolks", "1/2 cup sugar", "1/3 cup fresh lemon juice", "Finely grated zest of 1 medium lemon", "1 tablespoon cold butter, in 2 pieces", "Pinch salt", "3 tablespoons heavy cream", "3 pints blueberries, rinsed", "3 tablespoons cornstarch", "6 tablespoons sugar", "1/4 cup lemon juice", "Pinch salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place oven rack in lowest position, and heat oven to 450 degrees. Place large pizza stone on rack, and heat 1 hour while preparing other ingredients. Cut 6 sheets of aluminum foil, each one 8 inches square, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Combine flours, sugar and salt in food processor, and pulse to combine. Remove lid, scatter butter over surface of flour and pulse until butter pieces are no longer visible, 10 pulses of 10 seconds or so each. Turn mixture into mixing bowl, and sprinkle with 4 tablespoons ice water. Toss lightly with fingertips. Gather dough together, and squeeze a small portion with fingers. If dough feels dry, add another tablespoon water, and toss to combine. Turn dough onto work surface, press together firmly and pat into round disk. Cut into 6 wedges. Roll each wedge into a ball, flatten slightly and wrap in plastic wrap. Refrigerate at least 30 minutes, and up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the curd: Place small, conical stainless-steel strainer over 2-cup glass measuring cup, and set aside. In small, heavy nonreactive saucepan, whisk egg, yolks and sugar together. Add lemon juice, and whisk to combine. Add zest, butter and salt. Place pan over medium heat, and cook, stirring constantly with wooden spoon, until mixture is shiny, opaque and thick enough to coat back of spoon, about 5 minutes. Do not boil. Remove from heat, and stir in cream. Strain immediately into glass measuring cup, cover and refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the blueberry filling: Place half the blueberries in medium saucepan. Add cornstarch and sugar, and stir well. Add lemon juice and salt. Cook over medium heat, stirring constantly, until blueberries give up juices, thicken and simmer a bit. Compote will be very thick. Remove from heat, and stir in remaining blueberries. Cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the crostata: Working 1 piece of dough at a time, flour top and bottom lightly, and roll into thin 8-inch round. Transfer round to a square of foil. Spoon 1 1/2 to 2 tablespoons of desired filling in center, leaving 2-inch periphery free. Mound fruit in a circle. (Be sure to use all the filling in the 6 crostatas.) Fold dough over to support filling. Place crostata on sheet pan in refrigerator, and continue forming tarts with remaining dough pieces and fruit filling. Refrigerate all 6 crostatas at least 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide 2 or 3 crostatas onto baking stone. Bake until dough is dark golden brown, 15 to 20 minutes. Remove, and cool 10 minutes on rack. Repeat with remaining crostatas. Sprinkle with confectioners' sugar, or add a dollop of whipped cream or a few tablespoons of chilled heavy cream. Serve."}], "link": "https://cooking.nytimes.com/recipes/1017860-summer-berry-crostata-with-lemon-curd"}