{"@context": "http://schema.org", "@type": "Recipe", "name": "Minestrone With Giant White Beans and Winter Squash", "description": "The inspiration for this minestrone was a bag of Rancho Gordo Royal Corona beans that I have had in my pantry for a while. Royal Coronas are large white European runner beans that are similar to Greek gigandes but bigger, richer and sturdier. They are about twice the size of a lima bean and, unlike many other large white beans, the skin doesn’t slip off when you soak them. If you substitute limas I would not soak the beans, but if you use the Royal Coronas, do soak them to shorten the cooking time. The beans are downright meaty and the soup is a hearty one. I didn’t even feel the need to add pasta or rice to this substantial minestrone.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/10/science/recipehealthminestrone/recipehealthminestrone-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 generous servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch", "keywords": "dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, nut-free, vegan, vegetarian, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 542}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 211, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "9 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1321 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["6 ounces (1 cup) giant white beans such as Royal Coronas, gigandes (giant white beans), or large dried limas, washed, picked over and soaked for 4 hours or longer (no need to soak limas or large white beans)", "1/2 medium onion", "1 bay leaf", "2 quarts water", "Salt to taste", "2 garlic cloves, peeled and crushed", "2 tablespoons extra virgin olive oil", "1 medium onion, chopped", "1 large or 2 medium carrots, peeled and diced (1/2 inch dice or smaller if desired)", "1 celery stalk, diced", "2 tablespoons chopped fresh parsley", "1 or 2 leeks, white and light green parts only, halved, cleaned well and sliced thin", "3 or 4 garlic cloves (to taste), minced", "1 14-ounce can chopped tomatoes, with juice", "A bouquet garni made with a Parmesan rind, a bay leaf and a couple of sprigs each parsley and thyme, tied into one of the leek leaves if desired", "Salt and freshly ground pepper", "1 pound winter squash, diced", "Lots of chopped flat leaf parsley or basil (or both)", "Freshly grated Parmesan for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "First simmer beans. Drain soaked beans and place in a large saucepan with 2 quarts water, halved onion, crushed garlic and bay leaf. Bring to a gentle boil, reduce heat and simmer 45 minutes. Add salt to taste (I usually use 1 teaspoon salt per quart of water) and continue to simmer another 30 minutes. Beans should be almost tender. Remove from heat and use tongs to remove and discard onion half, garlic cloves and bay leaf."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While beans are simmering you can make tomato base. Heat olive oil over medium heat in a heavy soup pot or Dutch oven, and add onion, carrot and celery. Add a pinch of salt and cook, stirring, until vegetables are just about tender, about 5 minutes, and add parsley and leeks. Cook, stirring, until leeks are slightly wilted, about 3 minutes, and stir in garlic along with another generous pinch of salt. Cook, stirring, just until the garlic smells fragrant, 30 seconds to a minute, and stir in tomatoes with their juice and salt to taste. Bring to a simmer and cook, stirring often, for about 10 minutes, until tomatoes have cooked down somewhat and smell fragrant. Remove from heat until beans are ready."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add beans and their broth to tomato base, stir together, add bouquet garni and bring to a simmer. Cover and simmer over low heat for 30 minutes. Add winter squash and continue to simmer for another 30 to 45 minutes, until squash and beans are very tender. Taste, adjust salt, and add freshly ground pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving heat through and stir in a generous handful of chopped fresh parsley or basil, or a mix of the two. Serve, topping each bowl with freshly grated Parmesan."}]}