{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Chop Suey", "description": "Chop suey may sound like something your grandmother ate in the 1950s, but this version from China Café in L.A.'s Grand Central Market — a chicken stir-fry enlivened with plenty of bright bok choy — is honest, simple and plainly delicious.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/06/28/magazine/28eat1/28mag-28eat-t_CA0-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 servings", "recipeCuisine": "american, chinese", "recipeCategory": "dinner, easy, lunch", "keywords": "bok choy, chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 225}, "recipeIngredient": ["1 large or 2 medium chicken thighs", "1 1/2 pounds bok choy, washed and cut into eighths lengthwise, then crosswise into 3-to-4-inch ribbons", "2 tablespoons vegetable oil", "1 1/2 tablespoons oyster sauce", "1 teaspoon sugar", "1 tablespoon cornstarch mixed with 2 tablespoons water", "1 teaspoon toasted sesame oil", "Salt to taste", "White pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In two cups of boiling water, simmer the chicken for 30 minutes. Remove chicken from the water, and let cool. Reserve the stock. When the chicken is cool enough to handle, remove the meat, chop and set aside; discard the skin and bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the vegetable oil in a large, wide skillet set over high heat. When it is hot, add the bok choy, and cook for 1 minute, stirring constantly. Then add half the reserved stock to the pan, and cover; cook until the bok choy is crisp but still tender, about 2 minutes. Remove the cover, and continue cooking until the liquid evaporates and the bok choy browns a bit, 5 to 6 minutes. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining stock and the chicken to the pan set over high heat. Heat the chicken through, then add the oyster sauce, sugar, cornstarch slurry, sesame oil and reserved bok choy; season to taste. Toss to combine, and serve immediately over rice."}], "link": "https://cooking.nytimes.com/recipes/1017493-chicken-chop-suey"}