{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom Risotto With Peas", "description": "If you are ever at a loss for what to make for an impromptu dinner party, especially if there will be vegetarians at the table, consider this luxurious mushroom risotto. I added peas because I wanted to introduce some color, and also because the sweetness of the peas fits right in with the flavors of this dish. But this satisfying, elegant dish is fine without peas, too. You’ll get a vibrant dash of green from the parsley added at the end of cooking.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/02/science/04recipehealth/04recipehealth-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "6 servings", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner", "keywords": "arborio rice, mushroom, peas, white wine, fall, winter, gluten-free, low cholesterol, low sugar, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1220}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 316, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "961 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["6 to 7 cups chicken, vegetable or garlic broth or stock, as needed", "Salt and freshly ground pepper", "2 tablespoons extra-virgin olive oil", "1/2 cup finely chopped onion, or 2 shallots, minced", "3/4 to 1 pound wild mushrooms, cleaned if necessary and torn or sliced into smaller pieces if thick (small wild mushrooms should be left whole, mushrooms like maitake can just be separated into small pieces)", "2 garlic cloves, minced", "2 teaspoons fresh thyme leaves or chopped sage", "1 1/2 cups arborio or carnaroli rice", "1/2 cup dry white wine, such as pinot grigio or sauvignon blanc", "1 cup frozen peas, thawed (optional)", "2 tablespoons chopped fresh parsley", "1/2 cup grated Parmesan cheese, or a mixture of Parmesan and Pecorino Romano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring stock or broth to a simmer in a saucepan, with a ladle nearby. Make sure stock is well seasoned, and keep it simmering on the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a wide, heavy nonstick skillet or saucepan over medium heat. Add onions or shallots and cook gently until just tender, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn up heat and add mushrooms. Cook, stirring, until they begin to sweat, about 3 minutes, then add garlic and thyme or sage. Cook, stirring, until fragrant, about 30 seconds. Season mushrooms with salt and pepper and continue to cook over medium heat until they are soft. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add rice and stir until grains begin to crackle. Add wine and cook, stirring, until wine is no longer visible in pan. Stir in enough simmering stock to just cover the rice. The stock should bubble slowly. Cook, stirring often and vigorously, until stock is just about absorbed. Add another ladleful or two of stock and continue cooking, not too fast and not too slowly, stirring often and adding more stock when rice is almost dry, for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add peas, if using, and continue adding stock and stirring for another 10 minutes. Rice should be tender all the way through but still al dente. Taste now and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another ladleful or two of stock to rice. Stir in parsley and Parmesan, and remove from heat. Season with black pepper and serve right away in wide soup bowls or on plates."}], "link": "https://cooking.nytimes.com/recipes/1017022-mushroom-risotto-with-peas"}