{"@context": "http://schema.org", "@type": "Recipe", "name": "Kuri Squash, Mushroom and Kale Tart with Rosemary Crust", "description": "Swati Saha of New York uses a standard pie dish to make a savory tart of Kuri squash, mushrooms and kale, topped with grated asiago cheese to taste. Not only does it make an attractive main course that holds its own at the center of the table, the rosemary-infused crust offers a pleasing burst of flavor with every bite.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2014/11/25/us/24vegetarianthanksgivingkaletart/24vegetarianthanksgivingkaletart-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "Serves 8", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 66}, "recipeIngredient": ["1 cup all purpose flour", "1 cup + 2 tablespoons cake flour", "2 teaspoons baking powder", "1/2 teaspoon kosher salt", "3 tablespoons olive oil plus extra for greasing the tart pan", "3/4 cup water", "Extra flour for dusting", "1 teaspoon fresh rosemary leaves, finely minced", "10 oz kuri or butternut squash peeled, deseeded and cut in 1/2 inch dice", "1 small yellow onion, chopped into 1/2 inch pieces", "4 leaves of tuscan kale, ribs discarded and the leaves cut into thin strips", "1 large portobello mushroom, cut into 1/2 inch cubes", "1 teaspoon minced garlic", "3 tablespoons extra virgin olive oil", "Kosher salt", "Freshly ground black pepper", "Dried chili flakes", "3/4 cup grated asiago cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Crust", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift the flour, salt, and baking powder into a mixing bowl, then add the rosemary.\nTransfer the flour mixture to a food processor fitted with a metal blade. With the motor running, add the olive oil, then ¾ cup water. When the dough comes together in a ball, turn off the motor. Scrape the dough out of the food processor and knead very gently on a lightly floured board just until the dough is smooth. Do not over work or the dough will be tough.\nDivide the dough into two equal pieces and shape each piece into a ball. Press each ball into a disk, about 4 inches in diameter. Dust lightly with flour if the dough is sticky. Wrap the dough in plastic and let it rest for an hour or longer at room temperature.\nUse one dough ball for this recipe; the other can be frozen and reserved for later use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle a small amount of unbleached flour over your work surface. Put the piece of dough on it, and lightly dust the top with more flour. Roll the dough from the center to the far edge, in one direction only, turning the dough, until it is quite thin, with a diameter of at least 11 inches. Keep dusting lightly with flour if the dough sticks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spray a 9-inch tart pan with a removable bottom with olive oil. Gently fold the circle of dough in half and lift onto the pan, with the fold in the middle of the pan. Unfold the dough so that it covers the pan. Press gently into the pan. Using the rolling pin, roll over the tart pan to trim the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Place the tart pan on a baking sheet and bake on the middle rack in the preheated oven for 7 minutes. Remove from oven and set aside to cool before adding the filling."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Filling", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the squash and onions with 1 tablespoon extra virgin olive oil, 1/4 teaspoon kosher salt, freshly ground black pepper and a pinch of dried chili flakes. Bake on the top rack of a preheated oven for 20 minutes to 25 minutes until the squash is soft and the onions are softened but not charred."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the meantime, sauté mushrooms with a tablespoon of olive oil and minced garlic for 4 to 5 minutes over medium high heat. After 3 minutes of cooking add a pinch of salt and freshly ground black pepper. Remove to a bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, add one more tablespoon olive oil and add the chopped kale leaves with a small pinch of salt. Sauté over medium heat for 2 to 3 minutes. Add 1/4 cup water and turn the heat to medium low. Cover and cook until the leaves are completely wilted and the water has dried, about 15 minutes. Check every 5 minutes to ensure the water has not completely dried up."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Assembling the tart", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the oven temperature to 375 F, while you assemble the tart. Once the crust has cooled, spread the roasted squash and onions on the base. Use a fork to mash the squash so that it spreads out evenly. Arrange the sautéed mushrooms and kale such that they are not in clumps. Finally, sprinkle the grated cheese and place the tart in the middle shelf and bake for 25 to 30 minutes until the crust looks golden brown at the edges and the cheese has softened (aged Asiago will not melt)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool for 5 minutes - cut into wedges and serve."}]}], "link": "https://cooking.nytimes.com/recipes/1017003-kuri-squash-mushroom-and-kale-tart-with-rosemary-crust"}