{"@context": "http://schema.org", "@type": "Recipe", "name": "Dark Chocolate Flan With Pumpkinseed Praline", "description": "A light and fluffy flan seasoned with chile, cinnamon and anise, and topped with a filigree of pepita praline (just hulled pumpkinseeds mixed with caramel). This is dinner party pudding at its zenith.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/02/03/dining/dark_chocolate_flan/dark_chocolate_flan-articleLarge.jpg", "totalTime": "PT6H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "snack", "keywords": "bittersweet chocolate, chili powder, pepitas, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 21}, "recipeIngredient": ["Butter for pan", "1/4 cup pepitas (hulled toasted pumpkin seeds)", "1 1/3 cups granulated sugar", "1 cup whole milk", "1 cup heavy cream", "1 teaspoon mild New Mexican chili powder (or to taste)", "1 1-inch piece cinnamon stick", "2 whole black peppercorns", "1/2 star anise", "5 ounces bittersweet chocolate, finely chopped", "4 large eggs", "Pinch salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. On a rimmed baking sheet lined with nonstick liner, buttered parchment or waxed paper, spread pepitas close together in a single layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan over medium heat, combine 1 cup sugar and 6 tablespoons water. Bring to a simmer, stirring only until sugar is dissolved. Continue to cook, tilting pan occasionally to distribute heat evenly, until a caramel of a deep amber color forms, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly (before caramel cools and hardens), pour half the hot caramel into a 9-inch loaf pan, tilting pan to coat bottom and a bit of the sides. Pour remaining caramel over pepitas, using an offset spatula to help spread caramel if necessary. Let both pans cool completely. When pepita praline is cool, break into 2-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large saucepan, combine milk, cream, chili powder, cinnamon, peppercorns and star anise. Bring to a simmer over high heat; reduce to medium and simmer 5 minutes. Let stand, off heat, 15 minutes. Return to a simmer, turn off heat and whisk in chocolate until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, whisk eggs, remaining 1/3 cup sugar and the salt together. Whisking constantly, slowly pour hot chocolate mixture into eggs until fully combined. Pour custard through a fine sieve into caramel-coated loaf pan. Place loaf pan in a deep roasting pan. Add 2 inches hot tap water to roasting pan. Cover roasting pan tightly with foil; prick foil all over with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully transfer pan to oven. Bake until flan is lightly set but still jiggles when shaken (lifting foil to check), about 1 1/2 hours. Transfer loaf pan to a wire rack to cool to room temperature. Refrigerate flan at least 4 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, run an offset spatula along sides of pan to gently release it. Turn onto a serving platter and top with pepita praline; serve in slices."}]}