{"@context": "http://schema.org", "@type": "Recipe", "name": "April Bloomfield's Pot-Roasted Artichokes With White Wine", "description": "This beautiful recipe for pot-roasted artichokes with white wine and capers appears in the chef April Bloomfield's 2015 cookbook \"A Girl and Her Greens.\" It's tremendous. \"The fleshy artichokes get browned and crispy tops and look like strange, beautiful roses,\"  she writes. \"The acidity in the white wine cuts through the rich, dense veg and, along with the salty pops from the capers, highlights the artichokes’ unique herbaceousness.\"\n\nDon't know <a href=\"http://tmagazine.blogs.nytimes.com/2015/05/21/april-bloomfield-vegetable-prep-video/\">how to prepare artichokes</a>? April Bloomfield shows you in <a href=\"http://tmagazine.blogs.nytimes.com/2015/05/21/april-bloomfield-vegetable-prep-video/\">this video</a>.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2015/05/20/t-magazine/20beddie-bloomfield/20beddie-bloomfield-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 to 6 servings as a side", "recipeCuisine": "", "recipeCategory": "dinner, lunch, vegetables", "keywords": "baby artichokes, capers, mint leaves, white wine, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 258}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 253, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "14 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "753 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["¼ cup extra-virgin olive oil", "3 ½ pounds baby artichokes (about 18)", "2 medium garlic cloves, thinly sliced", "1 ½ teaspoons Maldon or other flaky sea salt", "1 ½ cups dry white wine, such as Sauvignon Blanc", "1 heaping tablespoon drained capers", "A five-finger pinch of mint leaves (preferably black mint), torn at the last minute (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a heavy pot (wide enough to hold the artichokes with room to spare) over medium-high heat until it just begins to smoke."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stand the artichokes cut sides down in the oil, wait a minute, then reduce the heat to medium-low, sprinkle in the garlic and salt, and cook, without stirring, just until the garlic turns golden and smells toasty, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in the wine, cover the pot and cook, without stirring, at a vigorous simmer until you can insert a sharp knife into the thick artichoke bottoms with barely any resistance, about 25 minutes. Five minutes or so before they’re fully tender, scatter on the capers and cover again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover, raise the heat to medium-high, and bring the liquid to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook until all the wine has evaporated (the bubbling sound will become a sizzle), about 3 minutes. Add the mint and keep cooking the artichokes in the oil (it’s OK if a few of them tip over), until the cut sides of the artichokes are deep golden brown, 3 to 5 minutes. Lower the heat if necessary to prevent the artichokes from getting too dark."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the artichokes prettily on a plate, and scoop the capers, oil and slightly crispy mint over top. Serve straightaway or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1017431-april-bloomfields-pot-roasted-artichokes-with-white-wine"}