{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Green Beans and Baby Broccoli Tempura", "description": "Deep-frying is not something I do often, but after I’ve eaten well-executed tempura at a restaurant and can’t shake the memory of delicious batter-fried vegetables, I get out my wok. I turn on the hood fan, open the window and start heating up oil.\n\nI like to play around with different batters and coatings. This spicy, delicate batter is somewhere between a puffy beignet-type coating and a simpler egg, flour and bread-crumb dusting. It’s mostly cornstarch, with a small amount of cornmeal and whole wheat flour — just enough to hold the batter together. I add dukkah, cilantro and cumin for flavor and texture. Ice-cold sparkling water helps keep the batter light; it fries up crispy rather than bready because there’s very little gluten to toughen it.\n\nYou can use this batter with all sorts of vegetables, but I particularly love green beans and baby broccoli. The batter wraps itself nicely around the smooth beans and nestles in among the spindly flowers at the end of a baby broccoli stem, resulting in lacy, extra-crispy tempura.\n\nA wok is ideal for deep-frying. It can accommodate a lot of vegetables at one time without crowding, and it holds heat well. The oil should hover between 350 and 375 degrees so that the vegetables cook quickly and crisp up without absorbing too much oil. Be sure to let the oil come back up to temperature between batches, and use a thermometer. You will be amazed to find a green bean tender and hot inside its crispy coating in two minutes or less.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/03/11/dining/11MARTHA/11MARTHA-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, snack, vegetables", "keywords": "appetizer, side dish, baby broccoli, green beans, dairy-free, halal, kosher, low cholesterol, low-sodium, low sugar, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 205, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "88 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup plus 1 tablespoon cornstarch", "2 tablespoons fine polenta or cornmeal", "3 tablespoons whole wheat flour", "1/4 teaspoon salt, plus more to taste", "1/2 teaspoon ground cumin", "2/3 cup cold sparkling water", "1/4 cup finely chopped cilantro", "2 tablespoons dukkah (<a href=\"http://cooking.nytimes.com/recipes/1014696-peanut-dukkah\">see recipe</a>)", "1/2 pound green beans", "1/2 pound baby broccoli", "Canola oil or grapeseed oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the batter: In a medium bowl, whisk together cornstarch, polenta or cornmeal, whole wheat flour, salt and cumin. Whisk in sparkling water. Stir in cilantro and dukkah."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top and tail beans. Cut long stems off broccoli; cut broccoli tops into smaller florets or leave intact."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour oil to a depth of 3 inches into a wok or wide saucepan and heat over medium-high heat to 350 to 375 degrees. Set up a sheet pan with a rack on it next to pan and cover rack with layers of paper towels. Have a deep-fry skimmer handy for removing vegetables from the oil onto the rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, dip vegetables into the batter a few at a time, making sure to coat thoroughly. Transfer to hot oil and fry until golden brown, 1 to 2 minutes. Flip over with skimmer to make sure coating is evenly fried. Do not crowd pan. Let oil come back up to temperature between batches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using skimmer, remove vegetables from oil, allowing excess oil to drip back into pan, and drain on towel-covered rack. Sprinkle with salt right away if desired. Cool slightly and serve."}], "link": "https://cooking.nytimes.com/recipes/1017280-spiced-green-beans-and-baby-broccoli-tempura"}