{"@context": "http://schema.org", "@type": "Recipe", "name": "Corviches", "description": "Many cuisines have some version of a starchy vegetable stuffed, then fried, but the corviches of Ecuador speak to tropical and African influences in a delicious way; the plantains give them great crunch and a mild sweetness, while the peanuts offer an intriguing toasted, buttery taste. Stuffed here with quickly stewed tuna, they're great as appetizers or as a light meal when paired with a salad.", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2015/11/22/magazine/22eat1/22eat2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 12, plus some extra filling", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 221, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "422 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup roasted peanuts", "2 pounds green plantains (3 large plantains)", "Kosher salt", "2 1⁄2 teaspoons achiote (annatto) paste", "3 sprigs cilantro, chopped", "2 cloves garlic", "1 medium red onion (9 ounces), diced large", "1 medium green pepper, stemmed, seeded and diced large", "1 pound plum tomatoes, peeled and diced large", "Vegetable oil, for pan frying", "1⁄2 pound fresh tuna (or sea bass), cut into 1⁄2-inch dice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender or food processor, pulse the peanuts until they are crushed and just starting to clump together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut off the ends of the plantains, and slit open the skins with a sharp knife. Peel and cut plantains into 1 1⁄2-inch pieces. Place 2⁄3 of the cut plantains in a pot with enough water to cover by 1 inch, and bring to a boil over high heat. Salt the water until it tastes pleasant. Boil the plantains until they are cooked through, pierceable with a fork but not soft, about 30 minutes. Drain, and let cool to warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the large-holed grating blade of a food processor (or box grater), grate the raw plantain, and then grate the cooked. Transfer the plantains to a mixing bowl, and stir in the peanuts, 1 1⁄2 teaspoons achiote, cilantro and 2 teaspoons kosher salt, or to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, mince the garlic, onion and green pepper, then add the tomatoes and process until puréed. Chill a mixing bowl in the freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of oil in a large sauté pan over medium high heat with remaining 1 teaspoon achiote, and when the oil is hot, add the tomato mixture and 1 teaspoon kosher salt. Stir occasionally, making sure the bottom of the pan doesn’t scorch. Cook at a boil until there is no juice left in the pan, but the mixture is still very moist, about 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season fish with salt. Lower heat to low, add the fish to the sauce and cook, stirring occasionally, until it just flakes when you press it, about 3 minutes. Chop the mixture up in the pan with a spoon or spatula, and salt to taste. Remove the filling to the cold bowl, and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly dampen your hands. Take about 1⁄4 cup of the plantain mixture, and flatten it in your hand to 1⁄2-inch thick. Press a long divot in the center of the plantain. Add 2 teaspoons of the filling to the center, and gently fold the plantain around the filling to encase it in a little football shape. Repeat until you’ve used all the plantain; extra filling is delicious for snacking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour a scant 1⁄2-inch depth of oil into a large, wide sauté pan, and heat over medium-high heat until the oil is shimmering (350 degrees). Carefully place about half the corviches into the oil, making sure to leave a little room between each one. Fry for about 2 minutes per side, until deep golden brown. Turn them twice to fry on 3 sides. Remove them to a paper-towel-lined platter. Repeat with remaining corviches. Serve hot or at room temperature with the ají Cuencano (recipe <a href=\"http://cooking.nytimes.com/recipes/1017829-aji-cuencano\">here</a>)."}]}