{"@context": "http://schema.org", "@type": "Recipe", "name": "Loaded Nachos", "description": "Nachos are among the most ubiquitous of America’s pastime foods. At ballgames, carnivals or bowling alleys you can expect a pile of limp tortilla chips, drowned in warm yellow cheese product. But nachos should, and can, be better than this. \n\nTry them showered in good shredded cheese and accompanied by a fragrant meat sauce, the fire of jalapeños, the chill and silkiness of sour cream, the tart excellence of a good tomato, with shredded lettuce and thin-sliced radishes. Here is avocado; there, the awesome funk of chopped cilantro.\n\nWant some bacon on there as well, or a slash of hot sauce? Go to! Some will add beans. Others black olives, chopped raw onion. Please do.\n\nBut take care to layer well. Layering is the key to loaded nacho perfection.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/02/03/dining/03SUPERREEFER/03SUPERREEFER-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "finger foods", "keywords": "appetizer, ground beef, pickled jalapeños, tortilla chips", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 687}, "recipeIngredient": ["1/4 pound slab or thick-cut bacon, diced", "1 medium yellow onion, peeled and diced", "1 1/2 pounds ground beef, like chuck or sirloin", "3 cloves garlic, peeled and minced", "2 tablespoons ancho chile powder", "1 tablespoon ground cumin", "2 teaspoons kosher salt", "2 teaspoons smoked paprika, hot or mild", "1 1/2 teaspoons black pepper", "1 teaspoon light brown sugar", "1 teaspoon cornstarch", "1/2 teaspoon red pepper flakes", "1/2 to 2/3 cup chicken stock, homemade or low-sodium, or water", "1 12- to-16-ounce bag corn tortilla chips", "1/2 head iceberg or romaine lettuce, shredded", "1/2 cup pickled jalapeños", "2 avocados, pitted and sliced", "2 cups shredded Monterey Jack cheese", "1 1/2 cups shredded sharp Cheddar cheese", "1/2 cup crumbled Cotija cheese", "3 radishes, cleaned and thinly sliced", "2 cups cherry tomatoes, sliced into quarters", "1/2 cup sour cream", "1/2 cup roughly chopped cilantro leaves", "2 limes, cut into eighths, for garnish", "Hot sauce, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Put a large sauté pan with high sides over medium-high heat and add the bacon. Cook, stirring occasionally, until the fat has rendered and the pieces are crisp, about 5 to 7 minutes, then remove the bacon and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onions to the bacon fat and sauté, stirring occasionally, until they have softened and started to go brown around the edges, about 3 to 5 minutes. Add the ground beef and garlic and cook, breaking up the meat with a spoon, until browned, about 5 minutes. Add the chile powder, cumin, salt, paprika, black pepper, sugar, cornstarch and red pepper flakes and stir to combine and toast the spices. Add enough chicken stock or water to loosen the mixture, and allow it to simmer, uncovered, until the sauce is slightly thickened, about 5 to 6 minutes. (Add a little more stock or water if mixture is too thick.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the nachos on a half sheet pan: Put a layer of tortilla chips on the pan and cover with about 1/3 of the meat sauce, then add about 1/3 of the lettuce, 1/3 of the jalapeños, some avocado slices and a handful of the Monterey Jack and Cheddar cheeses. Top with more tortilla chips, more meat sauce, more lettuce, jalapeños, avocado and cheese, then make a final layer of chips, meat, bacon, jalapeños, avocado and cheese. Top with crumbled Cotija cheese and slide the sheet pan into the oven to bake until the cheeses have melted through, about 10 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top cooked nachos with the sliced radishes and tomatoes, and dot the tray with teaspoons of sour cream. Scatter the cilantro over the top and serve, accompanied by limes and hot sauce."}], "link": "https://cooking.nytimes.com/recipes/1017955-loaded-nachos"}