{"@context": "http://schema.org", "@type": "Recipe", "name": "Farro and Bean Soup", "description": "This is a thick, hearty Tuscan-inspired potage with farro and beans. Red, kidney, pinto or borlotti beans (or a blend) most resemble the beans used in Tuscany. The farro and beans are soaked together, then cooked with aromatics, tomatoes and pancetta. The pancetta can be left out for a perfectly delicious vegetarian version.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/12/23/dining/23MARTHA/23MARTHA-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "soups and stews", "keywords": "beans, farro, leek, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 750}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 320, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "17 grams", "proteinContent": "16 grams", "saturatedFatContent": "1 gram", "sodiumContent": "494 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 cups red beans, kidney beans, pintos or borlottis, rinsed and picked over for stones", "3/4 cup farro, rinsed", "2 tablespoons extra-virgin olive oil, plus more for drizzling", "1/4 cup diced pancetta (optional)", "1 large onion, chopped", "3 large garlic cloves, minced (more to taste)", "1 bouquet garni with a few sprigs each of parsley and thyme, a bay leaf and a Parmesan rind", "1 small carrot, peeled and diced", "1 small stalk celery, diced", "2 leeks, white and light green parts only, cut in half lengthwise, cleaned and sliced thin", "Salt", "6 sage leaves, chopped, plus more for serving", "1 14-ounce can chopped tomatoes, with juice", "1 tablespoon tomato paste", "Freshly ground pepper", "2 tablespoons chopped flat-leaf parsley", "Freshly grated Parmesan for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine beans and farro in a bowl and cover with 1 1/2 quarts water. Soak for 4 to 6 hours, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in a large, heavy soup pot or casserole over medium heat and add half the pancetta, if using, and half the onions. Cook, stirring often, until tender, about 5 minutes, and stir in half the garlic. Cook, stirring, until garlic is fragrant, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add beans and farro, along with the soaking water. Add another 1 1/2 quarts water and bouquet garni and bring to a gentle boil. Skim foam, reduce heat, cover and simmer 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the remaining olive oil in a heavy skillet and add pancetta. (If not using pancetta, add the remaining onion and the carrot, celery and leeks now.) Cook, stirring often, until pancetta releases some of its fat. Add the remaining onion, and carrot, celery and leeks. Add a generous pinch of salt and cook, stirring often, until vegetables are tender, 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the remaining garlic and the sage. Cook until garlic is fragrant, about 30 seconds to 1 minute, add the tomatoes and juice, and salt to taste. Cook, stirring, until tomatoes have cooked down slightly and the mixture is very fragrant, about 10 minutes. Stir into the beans and farro and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomato paste and salt to taste. (You will need a generous amount.) Continue to simmer 30 to 45 minutes, or until beans and farro are very tender and the soup thick, almost creamy. Add pepper, taste and adjust salt. Remove bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the parsley and additional chopped sage if desired. Serve with a drizzle of olive oil and a sprinkling of Parmesan over each bowl."}]}