{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange-Scented Winter Squash and Carrot Soup", "description": "I was looking around for new approaches to winter squash and found a wonderful looking recipe in “Plenty More,” the latest collection from Yotam Ottolenghi, for roasted butternut squash with buckwheat polenta. The squash was seasoned with allspice, cardamom, and orange peel, among other things, and I was inspired to try these seasonings in a soup. I tied the spices, herbs and orange peel into a cheesecloth bag and simmered them in the soup to great effect. The essence of orange is especially appealing.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/10/science/recipehealthcarrot/recipehealthcarrot-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "appetizer, main course, dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, low-sodium, vegan, vegetarian, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 69}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 197, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "6 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1191 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 allspice berries", "4 green cardamom pods, lightly crushed", "2 bay leaves", "2 thyme sprigs", "10 peppercorns", "Strips of zest from 1 orange", "2 tablespoons extra virgin olive oil", "1 medium onion, chopped", "1/2 pound carrots, diced", "2 pounds peeled winter squash, such as butternut or kabocha", "2 garlic cloves, minced", "6 cups water, chicken stock or vegetable stock", "1 medium potato (about 5 ounces)", "Salt and freshly ground pepper", "1/2 cup fresh orange juice or additional stock or water", "Cayenne to taste", "1/4 cup cooked black quinoa", "1 tablespoon toasted pistachio oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut a square piece of cheesecloth to make a bag for spices, herbs and orange peel. Place allspice berries, cardamom cloves, bay leaves, thyme sprigs and strips of orange zest on cheesecloth. Fold two ends over, then roll up the cheesecloth like a burrito and tie tightly with kitchen string."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil over medium heat in a large, heavy soup pot or Dutch oven and add onion and carrots. Cook, stirring, until tender, about 5 minutes. Add winter squash and garlic and cook, stirring, until the mixture smells fragrant, about 1 minute. Add water or stock, potato, spice bag, and salt to taste and bring to a boil. Reduce heat, cover and simmer 45 minutes to 1 hour, until squash is very tender. Remove spice bag but first press it against side of the pot to extract liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a hand blender, or in batches in a regular blender, purée the soup. If using a regular blender cover the top of the jar with a towel pulled down tight, rather than airtight with the lid. Return to pot and whisk in the orange juice (or additional stock or water). Taste, adjust seasonings, and heat through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss quinoa with 1 teaspoon of the pistachio oil. Ladle the soup into bowls and top with some of the quinoa. Drizzle a little more oil over each bowl and serve."}], "link": "https://cooking.nytimes.com/recipes/1017115-orange-scented-winter-squash-and-carrot-soup"}