{"@context": "http://schema.org", "@type": "Recipe", "name": "Teff  Polenta Croutons or Cakes", "description": "One of the things I like most about teff is the texture of the tiny grains. This is particularly nice when you cut up stiff teff polenta into rounds or squares and fry them in oil. The surface browns beautifully and the little round grains on the surface become toasty and crunchy while the centers remain soft. I serve thin slices with salads, or in place of a cracker, topped with something.  The thicker cakes can be used the same way you would use the softer teff polenta, drizzled with oil, topped with a sauce or a vegetable dish, or sprinkled with Parmesan, feta or blue cheese. They can serve as a side dish or at the center of the plate or bowl.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/17/science/recipehealthcrouton/recipehealthcrouton-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner, lunch, snack", "keywords": "appetizer, side dish, dairy-free, gluten-free, halal, kosher, low cholesterol, low sugar, vegan, vegetarian, fall, spring, summer, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 288, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "60 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "0 grams", "sodiumContent": "5 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 batch teff polenta", "Olive oil as needed (or use a more neutral oil like grapeseed or peanut oil)", "Topping of your choice (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make teff polenta as directed. Line a sheet pan, bread pan or baking dish with plastic wrap and spoon polenta on top. Press out to desired thickness and cover with plastic. Allow to stiffen completely, in the refrigerator if not using within the hour. You can also spread the polenta into a thin layer on the plastic on your work surface, cover with another sheet of plastic and gently roll over it with a rolling pin. Allow to cool and stiffen."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a cookie cutter to cut rounds of polenta, or just cut into squares. Heat a heavy well-seasoned or nonstick frying pan over medium-high heat and add enough oil to coat well. Brown polenta pieces on both sides in oil. This doesn’t take more than about a minute on each side. Each side should be crisp and brown. If the pieces are thicker cakes, turn down temperature a little so that they can heat through without burning. Remove to rack to drain. Serve hot or warm, or allow to cool and crumble into salads. They reheat nicely: place on a baking sheet in the oven at  325 degrees for 20 minutes."}], "link": "https://cooking.nytimes.com/recipes/1017124-teff-polenta-croutons-or-cakes"}