{"@context": "http://schema.org", "@type": "Recipe", "name": "Hot Rum Punch", "description": "Nothing warms a cold body up like a quaff of hot rum punch. This version, spiked with cognac and infused with citrus and nutmeg, is exactly what you want to serve at a party once the temperature drops outside. If you’re feeling flamboyant, you can flambé it, to the great amusement of your guests. Just make sure to use a fireproof bowl; silver or another metal is ideal, wood or even tempered glass is not. But even if you don’t set it on fire, it’s a rich, soothing and powerful libation. Serve it in small cups for the most civilized gathering.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/12/08/dining/Clark-new-hot-rum-punch/Clark-new-hot-rum-punch-mediumThreeByTwo440.jpg", "totalTime": "PT3H20M", "recipeYield": "12 to 16 servings", "recipeCuisine": "", "recipeCategory": "punches", "keywords": "cognac, demerara sugar, lemon, rum, tangerine, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 38}, "recipeIngredient": ["4 to 5 lemons", "1 tangerine, tangelo or other thick-skinned, small citrus fruit", "3/4 cup Demerara sugar", "1 1/4 cups amber or aged rum", "1 1/4 cups Jamaican rum (preferably 100-proof)", "1 cup cognac", "Freshly grated nutmeg, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a vegetable peeler, remove the zest of 2 lemons and the tangerine in strips. Drop into a large heatproof bowl (or use a fireproof bowl if you plan to set the punch on fire) and combine with sugar. Muddle together with a muddler, pestle or the back of a wooden spoon. Let mixture sit for at least 3 hours to infuse (or infuse overnight)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve the tangerine and squeeze juice into a measuring cup. Halve lemons and squeeze lemon juice into the measuring cup to make 3/4 cup juice in total. (Save any unsqueezed lemon halves for another purpose.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, bring 1 quart water to a boil. Pour rum and cognac into the bowl with the sugar and peels. If you want to flame the punch, do so now; see note below."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add reserved citrus juice and boiling water and stir well. Grate nutmeg over top of punch and ladle into glasses."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Hot Rum Punch", "description": "Melissa Clark combines aged rum and Jamaican rum with citrus, sugar, cognac and nutmeg to make this crowd-pleasing punch.", "thumbnailUrl": "https://static01.nyt.com/images/2014/12/08/dining/Clark-new-hot-rum-punch/Clark-new-hot-rum-punch-mediumThreeByTwo440.jpg", "uploadDate": "2014-12-05T17:20:06.000Z", "duration": "PT2M36S"}, "link": "https://cooking.nytimes.com/recipes/1017048-hot-rum-punch"}