{"@context": "http://schema.org", "@type": "Recipe", "name": "Paola di Mauro’s Roman Lamb", "description": "This recipe came to The Times in 1994 via Paola di Mauro, an Italian grandmother who lived, cooked and made wine in Marina, a small suburban town some 12 miles southeast of Rome. She was one of a band of cooks, mostly women, stretching back over generations, who have formed Italian cuisine, maintained its traditions and made it one of the world's most beloved and sought-after cooking styles. Italians sometimes call it \"cucina casalinga,\" roughly translated as \"housewives' cooking.\" But with its intense concern for the quality of primary ingredients and its care to combine them in a judicious balance of flavors, it is much more than that. Use the best ingredients you can find. Then let the simplicity of the preparations work its magic.", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": "https://static01.nyt.com/images/2015/04/29/dining/roman-lamb/roman-lamb-articleLarge.jpg", "totalTime": "PT1H35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, roasts, times classics", "keywords": "anchovy fillets, dry white wine, lamb, wine vinegar, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 104}, "recipeIngredient": ["2 1/4 pounds young lamb, the leg or shoulder, bone in, cut into eight chunks", "2 tablespoons extra-virgin olive oil", "4 cloves garlic", "Salt and freshly ground black pepper to taste", "1 tablespoon instant flour, like Wondra", "3/4 cup dry white wine", "1 tablespoon coarsely chopped fresh rosemary leaves", "4 oil-packed anchovy filets, coarsely chopped", "3 tablespoons wine vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the lamb chunks under cold running water, and pat dry with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a casserole or roasting pan large enough to hold all pieces of lamb, heat olive oil over medium-high to high heat. When oil is almost smoking, add lamb chunks and brown quickly, turning frequently, for about 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely chop 2 of the garlic cloves; add to lamb as it browns. When all the lamb is browned, add salt and abundant pepper. Sprinkle flour over lamb pieces, and turn them to mix in seasoning and salt. Add wine; as soon as it starts to bubble, cover pan and place in oven to roast, covered, for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While lamb is roasting, coarsely chop remaining garlic, and using a mortar and pestle, pound it with chopped rosemary into a coarse paste. Add chopped anchovies, and continue pounding to make a fairly smooth paste. A tablespoon at a time, mix in wine vinegar to make a smooth emulsion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When lamb has roasted for 30 minutes, remove from oven, and pour vinegar emulsion over lamb pieces. Turn them to coat well with sauce. Return to oven, uncovered, to roast an additional 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When lamb is done, with no trace of red in the meat, remove from oven, set aside for 5 minutes, then put lamb on a heated serving platter. Bring pan juices to a boil and cook rapidly for about 45 seconds, or just long enough to reduce juices and thicken them slightly. Add salt and pepper to taste. Pour juices over lamb chunks; serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1017149-paola-di-mauros-roman-lamb"}