{"@context": "http://schema.org", "@type": "Recipe", "name": "Linguine with Crab Meat", "description": "At All’onda in Greenwich Village, the chef Chris Jaeckle channels Venice by way of Japan. This pasta dish, which I enjoyed in his restaurant a few weeks ago, sums it up. Fresh pasta with crab meat and a smidgen of tomato is brightened with yuzu, lemon’s racy Japanese cousin. I remembered the dish as I savored the food-friendly, energetic white Bordeaux. The good acidity and citric notes of these wines welcome seafood. Though Mr. Jaeckle’s version calls for peekytoe crab, it is all but impossible to find in most retail fish markets, so he allowed for regular lump crab meat. As for the yuzu juice, it’s sold in Japanese markets. Look for a refrigerated brand that has no preservatives. You’ll have plenty left over, enough to test your cocktail-making chops before dinner.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/12/17/dining/17PAIRING/17PAIRING-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, pastas", "keywords": "button mushrooms, crab meat, linguine, yuzu juice, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 188}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 586, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "2 grams", "proteinContent": "23 grams", "saturatedFatContent": "8 grams", "sodiumContent": "884 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 jalapeño, cored, seeded, very finely minced", "Zest of 1 lemon", "1 tablespoon yuzu juice (sold in Japanese markets) or lemon juice", "4 tablespoons extra virgin olive oil", "1 medium onion, sliced", "4 ounces button mushrooms, sliced", "1/2 cup chopped peeled and seeded tomato, fresh or canned", "Salt", "Japanese togarashi pepper or cayenne, to taste", "2 cloves garlic, thinly sliced", "1 cup dry white wine", "1 cup seafood stock", "1/2 pound crab meat, preferably peekytoe", "12 ounces fresh linguine", "3 tablespoons unsalted butter", "1 tablespoon chopped tarragon leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine jalapeño, lemon zest and yuzu juice in a small dish and set aside. Heat half the oil in a large sauté pan. Add the onion and cook on medium-high until it starts to caramelize. Remove it. Add the mushrooms to the pan and cook until they start to brown. Return the onions to the pan, add the tomatoes and cook until they start to dry out. Pulse the mixture in a food processor until very finely chopped. Add the jalapeño mixture and season to taste with salt and togarashi. The mixture should have a touch of heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of salted water to a boil for the pasta. Heat the remaining oil in the sauté pan on low. Add the garlic, cook until it softens, then add the wine. Increase heat to medium high and reduce until the wine films the pan. Add the stock and the tomato mixture. Stir, then add the crab."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the pasta until it is al dente, about 3 minutes. Drain and add it to the sauté pan. Add the butter. Use tongs to toss all the ingredients together. Divide among 4 warm plates, scatter tarragon on each and serve."}]}