{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Devil’s Food Cupcakes", "description": "“Punk taught me to question everything,” the vegan chef Isa Chandra Moskowitz told Julia Moskin in 2007. “Of course, in my case that means questioning how to make a Hostess cupcake without eggs, butter or cream.” Ms. Moskowitz's vegan cupcake calls for cider vinegar instead of buttermilk. Nonhydrogenated margarine and shortening and soy milk are used in place of eggs and butter.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/01/27/dining/devils-food-cupcakes/devils-food-cupcakes-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "12 cupcakes", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "black cocoa powder, chocolate, nonhydrogenated margarine, dessert, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "recipeIngredient": ["Nonstick cooking spray", "1 cup all-purpose flour", "1/4 cup Dutch-process cocoa powder", "3 tablespoons black cocoa powder (see note) or more Dutch-process cocoa powder", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/4 teaspoon salt", "1 cup plain soy milk", "1/4 cup canola oil", "1/2 cup pure maple syrup", "1/4 cup sugar", "1 teaspoon apple cider vinegar", "1 teaspoon vanilla extract", "1/3 cup nonhydrogenated margarine, such as Earthbalance", "1/3 cup nonhydrogenated shortening", "2 1/2 to 3 cups confectioners’ sugar", "2 teaspoons vanilla extract", "1/3 cup plain soy milk", "4 ounces bittersweet or semisweet chocolate, chopped", "2 tablespoons pure maple syrup or confectioners’ sugar", "2 cups confectioners’ sugar", "1 to 2 tablespoons plain soy milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the cupcakes:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line a 12-muffin pan with paper liners, and spray lightly with nonstick spray. In a mixing bowl, stir together the flour, cocoa powder, baking powder, baking soda and salt. In a mixer, combine the soy milk, oil, syrup, sugar, vinegar and vanilla. Mix at medium speed for 2 minutes. Add half the dry ingredients and mix to blend. Add remaining dry ingredients and mix for 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a standard ice cream scoop to fill cupcake liners 3/4 full. Bake until a toothpick inserted in center comes out clean, 25 to 30 minutes. Turn out onto a cooling rack and allow to cool completely."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the filling:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixer, beat margarine and shortening until combined. Add 21/2 cups confectioners’ sugar and beat until very fluffy, about 10 minutes. Taste for sweetness and add remaining 1/2 cup sugar if desired. Add vanilla and beat for 1 minute more."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the chocolate icing:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet, bring soy milk to a simmer. Reduce heat to very low and stir in the chocolate and maple syrup, stirring until just melted. Turn off heat."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the royal icing:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer or by hand, sift sugar into a bowl and add 1 tablespoon soy milk. Mix, adding up to 1 more tablespoon soy milk until consistency is like stiff toothpaste."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To assemble:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare two pastry bags, one fitted with a large plain tip, and one with a small writing tip. Fill large-tipped bag with filling, and the small-tipped bag with royal icing. (Instead of pastry bags, thick resealable plastic bags may be used. For filling, cut off one corner of bag so the opening measures a scant 1/2 inch across. For icing, opening should be just large enough to pipe a thin line.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your pinkie, poke a hole in center of each cupcake top about an inch deep. Push tip of pastry bag with filling into each hole, firmly squeezing in filling and slowly drawing tip up and out. When all cakes have been filled, wipe off any excess that sticks out from holes; tops of cupcakes should be flat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cupcakes on a baking sheet or tray that fits in refrigerator. Rewarm pan of chocolate icing over low heat if necessary, stirring constantly. Dip top of each cupcake into icing, swirling to coat completely. When all cupcakes are dipped, refrigerate 10 to 15 minutes to set. When set, use royal icing to make squiggles across center of each cupcake. Keep refrigerated until ready to serve, up to 1 day."}]}]}