{"@context": "http://schema.org", "@type": "Recipe", "name": "Cauliflower and Tomato Frittata With Feta", "description": "Cauliflower, tomatoes and feta are always a good combination. This being a winter frittata, I used canned tomatoes for the sauce, but in summer the same dish can be made with fresh tomatoes. Make sure to cook the sauce down until it is quite pasty. If it is too watery it will dilute the eggs and the texture of the frittata will be a bit watery. Even better, make the tomato sauce a day ahead and keep uncovered in the refrigerator.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/31/science/recipehealthfrittata/recipehealthfrittata-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6 to 8", "recipeCuisine": "mediterranean", "recipeCategory": "breakfast, brunch, dinner, lunch, vegetables", "keywords": "fall, spring, summer, winter, halal, kosher, low sugar, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 288}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 155, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "4 grams", "sodiumContent": "370 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 to 2 garlic cloves (to taste), minced", "1 14.5-ounce can chopped tomatoes, with juice", "Pinch of sugar", "Salt to taste", "1 sprig basil or 1/2 to 1 teaspoon fresh thyme leaves", "1/2 medium head cauliflower, cored and cut or broken into small florets (about 3 cups florets)", "2 ounces feta, crumbled (about 1/2 cup)", "1/4 cup imported black olives, pitted and halved or coarsely chopped (optional)", "8 large or extra-large eggs", "Freshly ground pepper", "1 to 2 tablespoons chopped flat leaf parsley or a combination of parsley and mint or marjoram"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon olive oil over medium heat in a heavy 10-inch skillet,\npreferably nonstick. Add garlic and cook, stirring, until it begins to smell fragrant, about 30 seconds. Add tomatoes with liquid, sugar, salt and basil sprig or thyme. Simmer over medium heat, stirring often, until tomatoes have cooked down to a fragrant, dry sauce, about 20 minutes. Remove basil sprig. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While sauce is simmering, steam cauliflower 5 to 8 minutes, until tender. Remove from heat and drain on paper towels. Add to tomato sauce and break up into small pieces with the back of your spoon. If possible, refrigerate uncovered overnight or \nfor a few hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat eggs in a large bowl. Stir in salt (about 1/2 teaspoon), pepper, tomato sauce with cauliflower, feta, optional olives and herbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and dry skillet and return to heat. Heat remaining olive oil over medium-high heat in the skillet. Hold your hand above it; it should feel hot. Drop a bit of egg into the pan and if it sizzles and cooks at once, pan is ready. Pour in the egg mixture. Swirl pan to distribute eggs and filling evenly over the surface. Shake pan gently, tilting it slightly with one hand while lifting up edges of frittata with the spatula in your other hand, to let eggs run underneath during first few minutes of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once a few layers of egg have set, turn heat down to very low, cover (use a\npizza pan if you don’t have a lid that will fit your skillet), and cook 10 to 15 minutes, shaking pan gently every once in a while and lifting up the frittata and tilting the pan to \nlet egg run underneath. Frittata should be just about set, except for the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat broiler. Uncover pan and place under broiler, not too closeto heat, for 1 to 3 minutes, watching very carefully to make sure top doesn’t burn (at most, it should brown in spots and puff under the broiler). Remove from heat, shake pan to make sure the frittata isn’t sticking and allow it to cool for at least 5 minutes and for up to 15. Loosen edges with a wooden or plastic spatula. Carefully slide from pan onto a large round platter. Cut into wedges or into smaller bite-size diamonds. Serve hot, warm, at room temperature, or cold."}], "link": "https://cooking.nytimes.com/recipes/1017165-cauliflower-and-tomato-frittata-with-feta"}