{"@context": "http://schema.org", "@type": "Recipe", "name": "Palm Sugar Pecan Pie", "description": "The chef Quealy Watson brought a version of this recipe to The Times in 2015. It is for a classic South Texas pecan pie, at least if you collect the nuts from a San Antonio driveway and the rest of the ingredients from the local Vietnamese market. Palm sugar gives the pie a slightly rounder and more earthy flavor than you’d get from white or even brown sugar.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/11/30/magazine/palm-sugar-pecan-pie/palm-sugar-pecan-pie-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "Serves 6-8", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 30}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 865, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "90 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "13 grams", "proteinContent": "24 grams", "saturatedFatContent": "20 grams", "sodiumContent": "351 milligrams", "sugarContent": "27 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 cups all-purpose flour, or 256 grams", "1 tablespoon granulated sugar", "1 1/2 sticks unsalted butter, cut into 1/2-inch dice, or 170 grams", "1 teaspoon kosher salt", "1/4 cup plus 1 tablespoon ice-cold water", "2 to 3 cups pie weights, dried beans or uncooked rice and parchment for blind baking", "2 cups pecan halves, or 225 grams", "1 1/4 cups palm sugar, chopped in a food processor, about 275 grams", "1/2 stick butter, about 113 grams, melted and cooled", "6 1/2 tablespoons heavy cream", "1 tablespoon nonfat powdered milk", "1/4 teaspoon kosher salt", "4 eggs", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pie dough: Using your fingertips or the pulse function of a food processor, blend together the flour, sugar, butter and salt until the mixture resembles a coarse meal. There should be pebbles of butter throughout the mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle 1/4 cup ice water over the dough, and gently stir or pulse to combine. Gather a golf-ball-size bit of dough, and squeeze to combine. If it does not hold together, add remaining tablespoon of water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out onto a lightly floured surface, and gather together into a rough ball. Divide the ball in half with a knife or a pastry scraper, then divide each portion in half again to create 4 portions. Using the heel of your hand, flatten each portion of dough once or twice to expand the pebbles of butter, then gather the dough together again in one ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flatten ball into a 5- or 6-inch disc. Wrap the disc in plastic wrap, and place in the refrigerator for at least 60 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350. To blind bake the crust, roll out the pastry on a lightly floured surface to a thickness of about 1⁄8 inch. Fit dough into a 9 1/2-inch deep-dish pie pan. Crimp edges, and pierce the bottom crust with the tines of a fork 8 times. Line dough with a large sheet of parchment paper, and spread evenly with pie weights so they reach up the sides of the crust. Bake 30 minutes until edges are set. Remove parchment and weights, and bake until pale golden brown all over, about 15 minutes longer. Cool completely on a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make filling. Toast pecans in a 350-degree oven until just fragrant, 8 to 10 minutes. Allow to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together palm sugar, butter, cream, powdered milk and salt in a medium bowl until smooth. Add eggs and vanilla, whisking again until smooth. Place cooled nuts in crust, and pour the filling over the pie crust. (Pecans will float to top of pie while baking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pie on a sheet pan, and bake in center of oven until filling is set with a slight jiggle and filling is pale golden around nuts, about 30 to 40 minutes."}], "link": "https://cooking.nytimes.com/recipes/1017869-palm-sugar-pecan-pie"}