{"@context": "http://schema.org", "@type": "Recipe", "name": "Crunchy Calamari With Ancho Chile Glaze", "description": "My introduction to manzanilla decades ago was alongside a plate of fried prawns at El Faro in Cádiz, near Sanlúcar de Barrameda, in southern Spain. Nothing could provide a better partner for the sweet, briny shrimp than the pale, intensely floral, somewhat saline wine. Yet after our tasting of deliciously intense manzanillas, I was determined to show how well the wine could pair alongside food that was not Spanish: with dim sum, for example, or fried Ipswich clams. That was until I tasted Jean-Georges Vongerichten’s crunchy calamari at the Matador Room, his restaurant in Miami Beach. Delicately crisp, impossibly tender and fueled with a piquant glaze, they were perfection with a glass of manzanilla. Back at home with his recipe, plenty of oil, the hottest possible temperature and a messy stove got me close.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2015/04/29/dining/29PAIR/29PAIR-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "ancho chile, calamari, chipotle powder, club soda, red wine, appetizer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 48}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 444, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "2 grams", "proteinContent": "22 grams", "saturatedFatContent": "1 gram", "sodiumContent": "907 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/3 cup sugar", "1 teaspoon minced garlic", "1 teaspoon crushed ancho chile", "1/4 teaspoon chipotle powder", "2 cups dry red wine", "1 tablespoon red wine vinegar", "Salt", "1 pound cleaned calamari, the smaller the better", "1 cup flour", "12 ounces club soda", "Vegetable oil for deep-frying", "1 lime, zested, then cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Moisten sugar with 1 tablespoon water in a shallow saucepan. Cook on medium-high until sugar caramelizes to light amber. Add garlic and cook until it starts to color. Add ancho and chipotle, cook 30 seconds, then stir in wine, taking care because it may sputter. Cook on high heat, stirring occasionally, until the caramel dissolves in the wine and the mixture reduces to 1/2 cup, about 15 minutes. Remove from heat, season with vinegar and salt and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice calamari into thin rings. Toss with 1/2 cup flour, place in a large strainer and shake off excess flour. Season with salt. Pour club soda into a large bowl. Whisk in remaining flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat about 2 cups oil to very hot, about 400 degrees, in a deep-fryer, sauté pan or wok. Place floured calamari in the batter. Using tongs, transfer about 1/4 of it to the oil and fry until golden. Stand back because the calamari may spatter furiously. Remove to several layers of paper towels. Repeat with remaining calamari."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pile calamari on a platter, dust with lime zest and serve with lime wedges and ancho glaze."}], "link": "https://cooking.nytimes.com/recipes/1017368-crunchy-calamari-with-ancho-chile-glaze"}