{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Chestnut Chicken", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 5}, "recipeIngredient": ["1/2 cup (about 1/2 ounce) dried shiitake mushrooms", "Peanut oil or neutral oil like grapeseed or corn oil, as needed", "12 to 16 large chestnuts", "4 scallions, trimmed and chopped", "1 2-inch piece fresh ginger, peeled and minced", "2 to 3 pounds bone-in chicken thighs and drumsticks", "1/4 cup soy sauce", "White rice for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put mushrooms in a bowl, and cover with boiling water. Pour 1/16 inch of oil in a large deep skillet or casserole, preferably nonstick, and place over medium heat. Cut an \"X\" in flat side of each chestnut, and add them to oil. Cook, shaking pan occasionally, until skins loosen, 5 to 10 minutes. Remove with a slotted spoon to a plate lined with paper towels; when cool, peel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While chestnuts cool, drain all but about 2 tablespoons oil from skillet. With heat on medium, add scallions and ginger and cook, stirring once or twice, for about 30 seconds. Reserve about 1/2 cup of mushroom soaking liquid, then drain mushrooms and add to pan. Cook, stirring occasionally, until lightly brown, about 2 minutes. Remove mixture with a slotted spoon, and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put chicken pieces in skillet skin-side down. Brown well on all sides, then add mushroom mixture to pan, along with soy sauce, mushroom-soaking liquid and chestnuts. Stir well, cover, and turn heat to low. Simmer for 20 to 30 minutes, adding water if mixture dries out; dish is done when chicken and chestnuts are tender and sauce is thickened slightly. Serve hot, with rice."}], "link": "https://cooking.nytimes.com/recipes/1017921-braised-chestnut-chicken"}