{"@context": "http://schema.org", "@type": "Recipe", "name": "Teff Polenta With Toasted Hazelnut Oil", "description": "Teff is a challenging grain to work with. The flavor is strong, the grains tiny, and the mixture stiffens up very quickly once the grains are cooked. The chef Jason Bond makes a comforting teff polenta at his Bondir restaurants in Cambridge and Concord, Mass. He cooks the teff on top of the stove, in milk, and adds a finely chopped chipotle chile to the mix, which contributes a nice smoky/hot flavor. I liked the idea of teff polenta, and tried a few different methods for it. Teff will cook up in about 20 minutes on top of the stove, but if you use the oven-baked method outlined here, modeled on the method I often use for cornmeal polenta, you will get a creamier result. The oven method takes much longer, but the time is unsupervised – no frequent stirring as you must do on the top of the stove. This method doesn’t work so well if you use milk, however, because the milk forms too much skin in the oven, which forms curds when you stir the mixture (though I do like the flavor of the teff cooked in milk a lot). I tested the recipe using both stock and water, and liked both results equally. The chipotle adds a nice smoky/spicy flavor to the teff, but you can leave it out and just focus on the nutty flavor of the teff alone, with the hazelnut oil. I love the toasted hazelnut oil finish; it harmonizes with the nutty/earthy flavor of this grain. Serve the teff as a side dish or top with roasted vegetables or a vegetable or bean stew. You can also allow the teff to stiffen, then cut into squares and fry in the squares oil or grill them. You will get best results if you soak the teff for a few hours or overnight.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/17/science/recipehealthteff/recipehealthteff-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, halal, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian, fall, spring, summer, winter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 12}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 158, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "0 grams", "sodiumContent": "398 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 cup teff", "4 cups water or stock (chicken, vegetable or garlic)", "1 teaspoon salt (more or less to taste)", "1 chipotle chile, seeded and finely chopped, or 1/2  to 3/4 teaspoon chipotle chilipowder (optional)", "2 tablespoons toasted hazelnut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a heavy, medium size wide-bottomed saucepan over medium-high heat and add teff. Shake pan and allow teff to toast until it begins to pop and smell toasty, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately pour in water and remove from heat. Soak at room temperature for 3 to 4 hours, or refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Place a 2-quart baking dish on your stovetop. Return saucepan with teff to stove and bring to a boil, stirring often with a whisk so that the seeds don’t clump. When mixture comes to a boil add salt and chipotle, stir once and pour into baking dish. Use a rubber spatula to scrape out any teff that adheres to the saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place baking dish in oven (set on a cookie sheet if you wish, for easier handling). Bake 50 minutes, stirring with a whisk every 15 to 20 minutes. After 50 minutes whisk in 1 tablespoon of the hazelnut oil and return to oven for another 10 minutes, unless mixture is already stiff. Once teff is smooth, with no more liquid visible in the pan, serve at once, drizzling a small amount of the remaining oil over each serving."}]}