{"@context": "http://schema.org", "@type": "Recipe", "name": "Short-Grained Rice", "description": "Japanese short-grained rice, sometimes labeled as \"sushi rice,\" needs a good rinsing before you cook it in a ratio of one cup of water for every cup of rice. The result is smooth and pearly rice that holds together well without being gummy, and tastes of the grain. You can make it on the stovetop. But once you start using an electric rice cooker, it is hard to go back. Serve it with <a href=\"http://cooking.nytimes.com/recipes/1017850-soy-sauce-pickled-eggs\">soy-sauce-pickled eggs</a>.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/11/29/magazine/29eat1/29eat1-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "Serves 4-6", "recipeCuisine": "japanese", "recipeCategory": "", "keywords": "short grain rice", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 22}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 234, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": null, "proteinContent": "4 grams", "saturatedFatContent": "0 grams", "sodiumContent": "1 milligram", "sugarContent": null, "transFatContent": null}, "recipeIngredient": ["2 cups short-grained white rice (often labeled ‘‘sushi rice’’)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the rice into a bowl, and cover it with an inch or so of water. Using a spoon or your fingers, swirl the rice around in the water to help it release any dust or starch, then carefully pour off the clouded water. Repeat until the rinsing water runs clear."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rice into a rice cooker or, if cooking on a stovetop, into a medium-size pot with a tightfitting lid. Add 2 cups water to the rice, put the lid on the rice cooker or pot, then either start the rice cooker or, if cooking on a stovetop, bring the water to a boil over medium-high heat. If cooking on the stovetop, reduce the heat under the pot to low, and cook, covered, until the rice has absorbed all the water, approximately 18 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the top from the pot or rice cooker, and using a wooden spoon or rice paddle, fluff the rice around a little, then loosely replace the top and allow the rice to sit for an additional 10 or 15 minutes before serving."}]}