{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin Ravioli with Sage Walnut Pumpkin Butter", "description": "These homemade ravioli are simple to make but add a wow factor to the holiday table. And they can be made ahead and frozen, and cooked up in minutes on the day. Two (15-ounce) cans of pure pumpkin purée may be substituted for the fresh pumpkin if desired.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2018/10/19/dining/mrs-pumpkin-ravioli/mrs-pumpkin-ravioli-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "48 2 ½-inch ravioli (about 8 servings)", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "appetizer, main course, fall, winter, pasta, pumpkin, sage, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 62}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 707, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "108 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "2 grams", "proteinContent": "23 grams", "saturatedFatContent": "9 grams", "sodiumContent": "891 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 small (about 2 ½ to 3 pounds) cinderella or sugar pumpkin, halved and seeded", "2 tablespoons olive oil", "1 tablespoon light brown sugar", "Salt and black pepper", "1 egg", "1/2 teaspoon freshly grated nutmeg, plus more for sauce", "Semolina flour", "About 3 pounds fresh pasta sheets", "8 tablespoons unsalted butter", "12 fresh sage leaves, finely chopped", "3 tablespoons crushed walnuts", "Balsamic vinegar, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees and line a rimmed baking sheet with parchment paper. Place pumpkin on pan, cut sides up, drizzle with olive oil and generously season with brown sugar, salt and pepper. Roast for 35 to 45 minutes, or until soft. Allow to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop out the flesh of the pumpkin into the bowl of a food processor. Add egg and nutmeg, and purée until smooth. You should have about 3 cups (1 ½ pounds) purée total. Set aside 1/3 cup pumpkin purée for the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust a work surface with semolina flour. Lay out a sheet of pasta, then place 2 teaspoons of filling every few inches. Brush around the filling with water, then place a second pasta sheet over the top. Press the top sheet of pasta down around the mounds of filling. Cut 2 ½-inch square ravioli with a large ravioli stamp or sharp knife, trimming as needed, and crimp around the edges with a fork to seal individual raviolis."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to boil and season generously with salt. Drop in ravioli a few at a time and cook for 5 to 7 minutes, until soft but still al dente. Set aside ¼ cup pasta cooking water, then use a large slotted spoon to remove the cooked ravioli to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Heat the butter, sage and walnuts in a medium skillet over medium-high heat, stirring occasionally, until the butter browns, about 5 minutes. Add the reserved 1/3 cup pumpkin filling, a few grinds of nutmeg and a pinch of salt. Stir to combine and sizzling, then add 2 tablespoons reserved pasta cooking water, stirring until sauce is glossy and smooth; thin with additional pasta water if desired. Spoon sauce onto plates and top with ravioli and a drizzle of balsamic vinegar."}], "link": "https://cooking.nytimes.com/recipes/1017824-pumpkin-ravioli-with-sage-walnut-pumpkin-butter"}