{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear Crumb Cake", "description": "When it comes to crumb cake, the cake itself is often an afterthought, with all the attention going to the moist brown-sugar crumbles on top. Not so here. This recipe, based on a sour cream pound cake, has a velvety texture and buttery flavor that’s good enough to stand on its own. Of course, the thick pile of large crumbs only sweetens the deal, as does the juicy layer of honey and lemon-spiked pears in between the cake and crumbs.  You can bake this cake a day or two ahead; keep it loosely wrapped at room temperature (the refrigerator will make the crumbs soggy). And if you don’t like pears, feel free to substitute about a cup of any gently cooked fruit you do like – apples, fuyu persimmon, pineapple, blueberries, grapes, even leftover cranberry sauce – will all work nicely.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/11/26/dining/26BRING/26SUPERREEF-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "breakfast, snack, cakes", "keywords": "dessert, pear", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 352}, "recipeIngredient": ["1 tablespoon/14 grams unsalted butter", "1 tablespoon/15 milliliters honey", "2 small or 1 1/2 large pears, cored and sliced 1/4-inch thick", "1 teaspoon/5 milliliters fresh lemon juice", "1/2 teaspoon freshly grated nutmeg", "1/2 teaspoon grated lemon zest", "Pinch of salt", "1 1/3 cups/165 grams all-purpose flour", "1/3 cup/65 grams dark brown sugar, lightly packed", "1/3 cup/65 grams light brown sugar, lightly packed", "1 teaspoon/8 grams ground cinnamon", "1/4 teaspoon/2 grams ground allspice", "1/4 teaspoon/1 gram fine sea salt", "1 stick/113 grams unsalted butter, melted", "1/2 cup plus 1 tablespoon/133 milliliters sour cream", "3 large eggs", "1 tablespoon/15 milliliters vanilla extract", "1 1/2 cups/185 grams all-purpose flour", "3/4 cup/150 grams granulated sugar", "3/4 teaspoon/3 grams baking soda", "3/4 teaspoon/2 grams baking powder", "1/2 teaspoon/3 grams fine sea salt", "1 stick/113 grams softened unsalted butter, cut into pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Butter a 9-inch cake pan; line with parchment paper and butter the paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet, melt butter and honey. Add pears, lemons juice, nutmeg, zest and salt and sauté until the pears are just tender, 5 to 7 minutes. Cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the topping, whisk together flour, sugars, spices and salt in a bowl. Pour in the melted butter and stir until crumbs form."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together sour cream, eggs and vanilla. In the bowl of a standing mixer fitted with the paddle attachment, mix flour, sugar, baking soda, baking powder and salt. Add softened butter and beat for 10 seconds to combine. Beat in egg mixture, continuing to beat until very smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour batter into pan and top with the pear slices, spreading them out evenly (if there is liquid in the pan with the pears, don’t add it). Use your fingers to squeeze together large crumbs from the topping and scatter evenly on top of pears."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 50 to 65 minutes, until the cake is set and the center springs back when very gently pressed with a finger. A cake tester may come out with crumbs attached, but it shouldn’t be wet. Transfer cake to a wire rack and cool completely, at least 2 hours before serving. Cake can be made a day ahead."}]}