{"@context": "http://schema.org", "@type": "Recipe", "name": "Chile Garlic Paste", "description": "If you’re looking for more heat without the characteristic smokiness of the chipotle, just add a few ordinary dried red chiles. \n\nFor Mexican-style chile paste, add a bit of cumin, and some oregano or epazote. With good curry powder or garam masala you’d produce the kind of paste you see in northern India. You can make a blend similar to harissa, the classic paste from North Africa, by adding coriander and cumin. If you use fresh herbs or aromatics (including garlic), refrigerate the finished paste and use it within a day or so for maximum freshness and oomph. If all your seasonings are dried, the paste will last a couple of weeks at least.\n\nRemember this, though: Chiles can burn. If you have rubber gloves, use them. If not, every time you touch a chile, wash your hands with warm soapy water several times and be careful not to touch your eyes. The heat belongs on the table.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/12/30/dining/bittman-chili-paste/bittman-chili-paste-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 1/2 cup", "recipeCuisine": "", "recipeCategory": "easy, quick, condiments, project", "keywords": "chile", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 120, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "0 grams", "sodiumContent": "675 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 to 15 dried whole chiles, preferably a mixture of mild and hot, about 2 to 3 ounces", "2 tablespoons neutral oil, like grapeseed or corn", "Salt", "2 cloves peeled garlic, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put chiles in a bowl and cover with boiling water and a small plate to keep them submerged. Soak for about 30 minutes, or until soft. Reserve a bit of the soaking water. Clean each chile: remove stem, then pull or slit open; do this over sink, as they will contain a lot of water. Scrape out seeds, retaining some if you want a hotter paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put chiles, any seeds you might be using, the oil, a large pinch of salt and the garlic, if you are using it, in a blender or food processor. Purée until smooth, adding a spoonful of soaking water at a time, until consistency is a thick paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use immediately or cool, cover tightly, and refrigerate for up to two days. Just before serving, taste and adjust seasoning if necessary."}], "link": "https://cooking.nytimes.com/recipes/1017103-chile-garlic-paste"}