{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Sardines and Fennel", "description": "This traditional Sicilian dish makes a festive main course, especially when served from a giant platter. Sweet and savory flavors mingle beautifully here, with currants, raisins, saffron and pine nuts. Aromatic wild fennel fronds and fresh sardines are preferred, but even if made with cultivated fennel and canned sardines, this is a magnificent dish.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/12/23/dining/23KITCHEN1/23KITCHEN1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "pastas", "keywords": "anchovies, bucatini, fennel, sardines, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 278}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 674, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "101 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "8 grams", "proteinContent": "32 grams", "saturatedFatContent": "3 grams", "sodiumContent": "846 milligrams", "sugarContent": "24 grams", "transFatContent": null}, "recipeIngredient": ["1 cup coarse dry bread crumbs", "Extra-virgin olive oil", "Salt and pepper", "Pinch of sugar", "2 ounces fresh bushy fennel fronds, wild or cultivated, about 1 large handful", "1/2 cup golden raisins", "1/2 cup currants", "1/2 cup white wine", "1/2 teaspoon crumbled saffron", "1 large onion, diced (about 2 cups)", "2 small fennel bulbs, diced", "4 anchovy fillets, roughly chopped", "1/2 teaspoon fennel seeds, ground", "1/2 teaspoon coriander seeds, ground", "2 garlic cloves, minced", "1/2 teaspoon crushed red pepper flakes", "6 very fresh sardines (about 1 pound), cleaned and filleted (you will have about 6 ounces fillets; see note), or substitute large best-quality canned sardines, drained", "1 pound bucatini or thick spaghetti", "1/4 cup lightly toasted pine nuts", "2 tablespoons chopped parsley", "Lemon wedges, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet, toast bread crumbs in 2 tablespoons olive oil until golden. Season with salt and pepper and a pinch of sugar. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer the fennel fronds in a large pot of salted water until tender, about 10 minutes. Remove and spread out on a platter to cool. Do not discard cooking water. When fronds are cool, chop finely with a large knife (or pulse in a food processor with a little of the cooking water)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put raisins and currants in a bowl and cover with the white wine and 1/2 cup hot fennel-cooking water. Add crumbled saffron and let ingredients steep together for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, stew the onions and diced fennel in 6 tablespoons olive oil over medium heat until softened, about 10 minutes. Season generously with salt and pepper. Add anchovies, ground fennel and coriander seeds, garlic and red pepper flakes and cook for 2 minutes more. Stir in reserved fennel fronds. Add the raisin mixture and its liquid and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the fresh sardine fillets with salt and pepper and lay them on top of the onion mixture. Put a lid on the pan and turn off the heat for about 5 minutes, so sardines cook through and are just done. Stir to distribute chunks of fish throughout mixture. (If using canned sardines, skip this step and simply stir them in.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil the bucatini in the fennel cooking water (add more water to the pot if necessary). Cook until noodles are on the firm side of al dente, then drain, reserving 1 cup of pasta water. Add pasta to pan with onion-sardine mixture, sprinkle pasta lightly with salt and gently toss together, adding a little pasta water to keep everything well moistened. Taste and correct seasoning; it should be well seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a large platter or wide pasta bowl. Sprinkle with bread crumbs, pine nuts and parsley. Garnish with lemon wedges. Add a drizzle of olive oil, if desired."}], "link": "https://cooking.nytimes.com/recipes/1017893-pasta-with-sardines-and-fennel"}