{"@context": "http://schema.org", "@type": "Recipe", "name": "Polpettone With Spinach and Provolone", "description": "Polpette are Italian meatballs; polpettine are meatballs, too, but more diminutive. It follows, then, that polpettone is Italian for meatloaf (or a substantial meatball large enough to share). But polpettone is much more interesting than the somewhat bland everyday meatloaf known in the United States. Made from a mixture of meats and stuffed with spinach, herbs, cheese and mortadella, this moist, savory version is almost like a pâté or terrine, but easier to execute. It is delectable hot or cold.\n\nLearn how to assemble the polpettone with <a href=\"http://www.nytimes.com/interactive/2015/02/13/dining/how-to-make-polpettone.html\">this step-by-step tutorial.</a>\n\nYou can find more of our meatloaf recipes <a href=\"http://cooking.nytimes.com/68861692-nyt-cooking/869706-meatloaf-thats-better-than-moms\">here</a>.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/02/18/dining/18KITCHEN5/18KITCHEN5-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "bread crumbs, eggs, ground beef, ground pork, ground veal, mortadella, spinach", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 200}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 583, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "2 grams", "proteinContent": "36 grams", "saturatedFatContent": "19 grams", "sodiumContent": "599 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup cubed day-old bread, crusts removed", "1 cup heavy cream", "1 pound ground beef", "1 pound ground pork", "1 pound ground veal or turkey", "1 tablespoon kosher salt", "1/2 teaspoon coarsely ground black pepper", "Pinch of cayenne", "1/4 teaspoon grated nutmeg", "1 teaspoon chopped rosemary", "1 teaspoon chopped thyme", "2 teaspoons chopped sage", "1 tablespoon chopped parsley", "3 ounces grated Parmesan, about 1/2 cup", "2 eggs, lightly beaten, plus 3 (8-minute) hard-boiled eggs, peeled, for filling", "1/4 pound thinly sliced mortadella or prosciutto", "1 pound spinach, briefly blanched, roughly chopped and squeezed dry", "3 ounces provolone or caciocavallo, sliced 1/8-inch thick", "1 cup fine dry bread crumbs, preferably homemade"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put bread cubes in a small bowl, cover with cream and set aside to soak until softened, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put beef, pork and veal in a mixing bowl. Season with salt, pepper, cayenne, nutmeg, rosemary, thyme, sage and parsley. Add Parmesan and, using hands, knead seasoning into meat. Combine soaked bread (and any remaining cream) with beaten eggs, then pour mixture over seasoned meat and knead until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line a 12-by-18-inch baking sheet with parchment or foil. Press ground meat mixture evenly over parchment to make a flat rectangle slightly smaller than the baking sheet. Top with slices of mortadella. Scatter cooked spinach evenly over mortadella. Break provolone slices into rough pieces and distribute over surface. Finish with hard-cooked egg chopped into chunks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using parchment to help, roll the meat into a long cylinder with filling on the inside. With the long side facing you, first lift parchment and use it to roll meat to the center, pressing down to keep it in place. Then lift parchment on the opposite long side, bringing meat just past the center to overlap itself slightly. Pinch the “seam” of the meat together to keep filling in place. Sprinkle with half the dry crumbs. You will now have a cylinder approximately 15 inches long. Twist ends of parchment to firm the mixture, then transfer to a deep-sided baking dish or roasting pan, and place it seam-side down. Carefully remove and discard parchment. With hands, press firmly to form cylinder into a long loaf with rounded ends. Dust top and sides with remaining bread crumbs. (The polpettone may be prepared to this point several hours, or up to 24 hours, in advance; keep refrigerated and bring to room temperature before baking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 40 to 45 minutes, until internal temperature is 140 degrees. Let rest for 10 minutes and cut into 1-inch-thick slices and serve. (Alternatively, cool to room temperature and refrigerate for up to 3 days. If serving cold, cut thinner slices.)"}], "link": "https://cooking.nytimes.com/recipes/1017229-polpettone-with-spinach-and-provolone"}