{"@context": "http://schema.org", "@type": "Recipe", "name": "Coconut Layer Cake", "description": "This impressive and wonderfully moist layer cake is less sweet than the usual coconut affair, thanks to a tangy cream cheese frosting on top and dose of orange juice in the batter. This is a great dessert to make in advance. You can bake the cake layers up to 3 days ahead and store them, well-wrapped in plastic, in the refrigerator. The frosted cake will keep for 2 days in the fridge as well, either under a cake dome or overturned bowl, or loosely tented with foil. Just make sure to bring the cake to room temperature before serving.\n\nHere are <a href=\"http://cooking.nytimes.com/68861692/996375-lovely-layer-cakes\">more layer cake recipes</a>.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/03/04/dining/04APPE1/04APPE1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 12 servings", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "confectioners' sugar, cream of coconut, shredded unsweetened coconut, unsweetened coconut milk, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 847}, "recipeIngredient": ["2 sticks/226 grams unsalted butter, softened, plus more for pans", "2 cups/265 grams all-purpose flour, plus more for pans", "1/2 teaspoon/3 grams fine sea salt", "2 teaspoons/10 grams baking powder", "3/4 cup/140 grams granulated sugar", "3 eggs, separated, plus 3 whites", "1 1/2 cups/355 milliliters sweetened cream of coconut, such as Coco Lopez", "1 1/4 cups/295 milliliters unsweetened coconut milk", "2 tablespoons/30 milliliters coconut or dark rum", "7 tablespoons/104 milliliters freshly squeezed orange juice", "3 cups/370 grams unsweetened shredded coconut", "2 sticks/226 grams unsalted butter, softened", "2 cups/454 grams cream cheese, at room temperature", "2 teaspoons/10 milliliters vanilla extract", "7 1/4 cups/2 pounds/907 grams confectioners’ sugar", "2 3/4 cups/340 grams unsweetened shredded or flaked coconut, toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the cake:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease 3 8-inch cake pans and dust with flour. Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together flour, salt and baking powder in a bowl and reserve. Place butter and sugar in the bowl of a standing mixer fitted with paddle attachment and beat until fluffy, about 2 to 3 minutes. Add 3 egg yolks, 1 at a time, beating after each addition and scraping down sides of bowl with spatula. Lower speed and gradually add flour mixture. Batter will be thick and pasty."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together cream of coconut, coconut milk, rum and orange juice. Alternately add shredded coconut and the orange juice mixture to the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the clean bowl of a standing mixer fitted with the whisk attachment, whip 6 egg whites until soft peaks form. Gently fold into batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide batter evenly among prepared pans. Bake for 45 to 60 minutes. Cool in pans on wire rack. Unmold cakes once cool."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the frosting:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, cream the butter and cream cheese. Add vanilla extract. Gradually add confectioners’ sugar, scraping down sides of the bowl with a rubber spatula. Mix until combined and fluffy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread 1/4-inch-thick layer of frosting on top of the first layer of cake. Sprinkle with toasted coconut. Place next cake layer on top and repeat with frosting and coconut. Repeat with the third layer, spreading frosting on top and around sides of cake. Hold cake steadily in one hand and use other hand to pat remaining coconut onto edges of cake."}]}], "link": "https://cooking.nytimes.com/recipes/1017257-coconut-layer-cake"}