{"@context": "http://schema.org", "@type": "Recipe", "name": "Boiled Potatoes With Butter and Mint", "description": "The chef April Bloomfield cooks from a place of profound hunger for good food: specifically, Birmingham in the Midlands of England, where she grew up in the 1970s and 1980s just as English food reached a low point. The childhood food she remembers most fondly: the hot buttered potatoes served in her school cafeteria. Her homage to that dish is this basic but stunningly good recipe for freshly boiled potatoes thickly glazed in butter and brightened with lemon, garlic, cracked black pepper and what she calls a \"five-fingered pinch\" of fresh mint leaves, \"as much as you can grab with just the tips of all five fingers.\"", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/04/29/dining/29COOKBOOK2/29COOKBOOK2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "3 to 4 servings", "recipeCuisine": "british", "recipeCategory": "quick, vegetables", "keywords": "mint leaves, potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 225}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 193, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "7 grams", "sodiumContent": "316 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound small potatoes, like fingerlings or creamers, all about the same size", "1 tablespoon flaky salt, like Maldon, or kosher salt", "4 tablespoons/2 ounces cold unsalted butter, cut into 8 pieces", "1 small garlic clove, finely grated or shaved", "A 5-finger pinch of whole mint leaves, preferably black mint (see note)", "1/2 lemon", "Coarsely ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot, combine potatoes and salt. Add enough cold water to cover the potatoes by a generous 1/2 inch and set the pot over high heat. Bring to a boil, then reduce to a vigorous simmer. Cook potatoes just until tender and creamy inside, 10 to 25 minutes depending on size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserving 1/4 cup cooking liquid, gently drain the potatoes and return them to the stove. Add butter, garlic and reserved cooking liquid to the pot and set over medium heat. Bring to a simmer and cook, swirling the pan and basting as needed so that the liquid coats the potatoes until they are well glazed, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tear the mint leaves into small pieces, stir them very gently into the potatoes, and take the pot off the heat. Squeeze on just enough lemon to add brightness, not sourness; taste as you go. Add salt and pepper to taste and serve immediately."}]}