{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Lamb", "description": "If you haven't cooked a whole leg of lamb before, here is the place to start. This is not a revolutionary recipe, but slathering on butter and (take our word for it) anchovies makes this version truly essential. It is excellent for the Easter feast — lamb has ancient associations with springtime, and it pairs well with sharp spring vegetables like asparagus, dandelion greens and artichokes. Lamb is also popular for Passover, but the leg is not considered kosher unless the sciatic nerve is removed. Some kosher butchers offer that, but we also give options for other cuts like shoulder and double loin. The butter can be replaced by duck or goose fat, or olive oil, but the gravy (made from pan drippings) will need to be adjusted. For roasting, meaty American lamb is preferable to cuts from Australia and New Zealand. Most American lambs are fed both grass and grain, yielding meat that is fine-grained, earthy and mild.\n\n<a href=\"http://cooking.nytimes.com/68861692/939264-easter-lamb\">More Easter lamb recipes</a> and <a href=\"http://www.nytimes.com/video/magazine/100000000773719/carving-lamb.html\">how to carve a leg of lamb.</a>", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/03/18/multimedia/recipe-lab-lamb/recipe-lab-lamb-mediumThreeByTwo440.jpg", "totalTime": "PT3H", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "anchovies, lamb, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1145}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1047, "unsaturatedFatContent": "47 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "107 grams", "fiberContent": "0 grams", "proteinContent": "11 grams", "saturatedFatContent": "56 grams", "sodiumContent": "258 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 large lamb roast with a cap of fat, 4 to 6 pounds: bone-in leg (these can be as large as 8 pounds), semiboneless leg, bone-in shoulder, boneless butterflied leg or double loin", "2 ounces (1 can) anchovies packed in olive oil, drained, or 3 tablespoons Dijon mustard", "Leaves from 6 fresh rosemary sprigs (2 heaping tablespoons leaves), plus extra sprigs and branches for garnish", "6 garlic cloves, smashed and peeled", "4 ounces unsalted butter, softened at room temperature", "Black pepper", "1 lemon, cut in half", "1 3/4 cups white wine, plus extra for gravy"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Use a small sharp knife to make about a dozen incisions, each  about 2 inches deep, through the fat that covers the top of the meat. Using a mortar and pestle or a blender, blend 2/3 of the anchovies (or 2/3 of the mustard if using), the rosemary leaves and the garlic cloves into a chunky paste. Using your fingers, press paste deeply into incisions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix remaining anchovies (or mustard) and the butter into a paste. Smear this mixture all over the surface of the roast. Season liberally with black pepper. (Do not add salt; the anchovies are salty enough, and so is the mustard.) Place the lamb on a rack in a roasting pan, fat side up, and squeeze the lemon halves over. Pour the wine around the roast into the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast 15 minutes, then reduce heat to 350 degrees and roast until internal temperature reaches 130 to 135 degrees (for medium-rare or medium meat), about another 60 to 90 minutes. Baste every 20 minutes or so with the wine and drippings in the pan, adding more wine as needed to keep the liquid from scorching. If possible, for the last 15 minutes of cooking, use convection or a broiler to crisp the fat on the roast."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from the oven, remove rack from the pan, and let the roast rest on the rack for at least 15 to 20 minutes in a warm place, tented with foil. The internal temperature will rise to about 140 to 145 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make sauce from the pan drippings, remove a few tablespoons of fat by tipping the pan and spooning off the top layer. Put the pan over medium heat until the liquid simmers. Taste the simmering liquid and whisk in more wine, 1/4 cup at a time, until the consistency and flavor are right. Do not let the mixture become syrupy; it should be a sharp jus, not a thick gravy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<a href=\"http://www.nytimes.com/video/magazine/100000000773719/carving-lamb.html\">Carve lamb </a> into 1/2-inch-thick slices and arrange on a heated platter, decorated with rosemary sprigs. Serve with piping hot gravy."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Recipe Lab: Roast Lamb", "description": "Julia Moskin roasts lamb slathered in a mixture of butter, anchovies, rosemary and garlic.", "thumbnailUrl": "https://static01.nyt.com/images/2015/03/18/multimedia/recipe-lab-lamb/recipe-lab-lamb-mediumThreeByTwo440.jpg", "uploadDate": "2015-03-19T18:28:08.000Z", "duration": "PT1M18S"}, "link": "https://cooking.nytimes.com/recipes/1017303-roast-lamb"}