{"@context": "http://schema.org", "@type": "Recipe", "name": "Mexican Street-Corn Paleta  (Corn, Sour Cream and Lime Popsicle)", "description": "Fany Gerson makes her paletas, Mexican fruit ice-pops, the traditional way: with real fruit for intense flavors. Although this flavor isn't traditional, it was inspired by esquites, a favorite Mexican street food of corn dressed with sour cream, lime and chile. To make it, infuse milk with fresh sweet corn and chile, and then blend it into a smooth base. Fold in some lime and sautéed corn for texture, and freeze for a rich, sweet-savory treat.", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2015/07/26/magazine/26eatalt/26mag-26eat-t_CA0-articleLarge.jpg", "totalTime": "PT9H45M", "recipeYield": "About 20 3-ounce pops", "recipeCuisine": "mexican", "recipeCategory": "snack, ice creams and sorbets", "keywords": "corn, serrano chili, sour cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 65}, "recipeIngredient": ["4 cups whole milk", "4 cups corn kernels (from 4 medium ears of corn; reserve the cobs)", "1 serrano chile, halved", "Kosher salt", "1/2 cup plus 3 tablespoons sugar", "1 cup sour cream", "1/2 lime, zested and juiced", "2 teaspoons butter", "Chile powder (optional)", "Popsicle molds or small glasses and Popsicle sticks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the milk, 2 1/2 cups corn kernels, cobs, serrano chile, 1 teaspoon kosher salt and sugar in a stockpot. (If your corn is very sweet, reduce the sugar slightly.) Place over medium heat, stirring the bottom with a spatula. Bring to a simmer, and reduce the heat to maintain it; do not boil. Cook, stirring occasionally, until the corn is mostly tender, about 15 minutes from when it comes to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool for 10 minutes, and remove the corn cobs and serrano chile and reserve. Working in batches if necessary, blend the milk mixture in a blender until smooth. Blend in sour cream, lime zest, lime juice and more salt or sugar to taste. Transfer milk mixture to a bowl, add the corn cobs (and serrano, if you like) and chill at least four hours, preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat butter in a large sauté pan over medium-high heat until foamy. Add the remaining corn and a few pinches of salt. Sauté until the corn is nicely browned, 3 to 5 minutes. If the bottom of the pan is browning, stir in some water until it fully evaporates. \nTransfer to a bowl, chill and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cobs and serrano again and discard. Divide the sautéed corn among your Popsicle molds (about 1 tablespoon each if using 3-ounce molds). Divide the milk mixture into the molds. Give each a gentle stir to distribute the corn. Freeze for 50 minutes, or until just hard enough to stand the Popsicle sticks up, insert sticks and freeze until firm, at least 4 hours more. To unmold, dip the molds for a moment in hot water, and remove the paletas. Sprinkle with chile powder, if desired."}], "link": "https://cooking.nytimes.com/recipes/1017572-mexican-street-corn-paleta-corn-sour-cream-and-lime-popsicle"}