{"@context": "http://schema.org", "@type": "Recipe", "name": "Sephardic Challah With Whole Spices", "description": "Challah is tremendously popular in the United States, among Jews and non-Jews alike.  But it doesn’t say anywhere in Jewish scripture that challah is a braided, sweet, eggy, deliciously squishy bread of the kind familiar to most Americans; that loaf is Ashkenazi, from Eastern European Jews. The Sephardic and Mizrahi Jews from North Africa and the Middle East, have their own distinct traditional loaves. Here, use the raisins, eggs and full amount of honey to make a richer, festive Sephardic loaf that is delicious by itself; leave them out for a lean, savory Mizrahi bread that goes beautifully with Moroccan tagines and Middle Eastern mezes, salads and dips.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/12/02/dining/02CHALLAH1/02CHALLAH1-articleLarge-v2.jpg", "totalTime": "PT5H", "recipeYield": "2 round loaves", "recipeCuisine": "jewish", "recipeCategory": "breads", "keywords": "anise, caraway seeds, sesame seeds, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 111}, "recipeIngredient": ["1/2 cup/75 grams raisins, dark or golden or a combination (optional)", "4 tablespoons/40 grams sesame seeds", "1 tablespoon/10 grams caraway or coriander seeds", "1 tablespoon/10 grams anise, cumin or poppy seeds", "1 envelope/7 grams active dry yeast", "5 cups/600 grams bread flour, more for dusting work surface", "2 1/2 tablespoons/30milliliters/30 grams extra-virgin olive oil, more for oiling bowl and pans", "2 to 4 tablespoons/30 to 60 grams honey (depending on how sweet you like your challah)", "2 eggs, at room temperature (optional)", "1 tablespoon/16 grams kosher salt", "Cornmeal, for dusting", "2 egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using, cover raisins in 2 cups/500 milliliters warm water and let plump for 30 minutes. Drain well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet, toast 1 tablespoon sesame, the caraway and the anise or other seeds over moderate heat until fragrant, 2 minutes. Transfer to a plate and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine yeast with 2 tablespoons warm water (you can use the soaking water from the raisins if handy). Let stand until thoroughly moistened, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a standing electric mixer fitted with the dough hook, combine flour with olive oil, honey, eggs (if using) and warm water (3/4 cup/180 milliliters if using eggs; 1 1/2 cups/360 milliliters if not)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix at low speed until a very soft dough forms. If it is stiff, add warm water a tablespoon at a time. Add salt, yeast mixture and toasted seeds and mix at medium-low speed until the dough is supple and smooth, 10 minutes. Mix in raisins. Using oiled hands, transfer the dough to a large oiled bowl. Cover the bowl with plastic wrap and let stand in a draft-free spot until the dough is doubled in size, 1 1/2 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil 2 small cookie sheets and dust them with cornmeal. Turn the dough out onto a lightly floured work surface and press to deflate. Cut the dough in half and let rest for 5 minutes. Roll each piece into an 18-inch-long rope and let rest for 5 minutes longer, then roll each rope into a 32-inch rope. Take 1 of the ropes and, starting from 1 end, form the dough into a coil; tuck the ends under the completed coil. Repeat with the remaining rope."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer each coil to a baking sheet and cover each loaf with a large inverted bowl. Let stand for 1 hour, until the loaves have nearly doubled in bulk. (The risen loaves can be frozen, wrapped, for up to 2 weeks; top and bake just before serving.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. In a bowl, whisk egg yolks with 1 tablespoon water. Brush the egg wash over the loaves and let stand uncovered for 30 minutes. Brush with the egg wash once more and sprinkle with the reserved sesame seeds. Bake the loaves side-by-side in the center of the oven for 30 minutes, until they're golden and sound hollow when tapped on the bottom. Transfer the loaves to racks and let cool before serving or slicing."}], "link": "https://cooking.nytimes.com/recipes/1017858-sephardic-challah-with-whole-spices"}