{"@context": "http://schema.org", "@type": "Recipe", "name": "Three-Greens Gratin", "description": "This is a Provençal style gratin, or tian, dense with greens and bound with rice and egg. You can play around with the mix of greens; switch out beet greens for spinach, or some of the chard for kale (kale will require a minute or two more of blanching). I have kept the seasonings to a minimum as you have plenty to prep, but a Provençal cook would probably add chopped parsley and perhaps savory or rosemary. You won’t be using the chard ribs here, but keep them to use in other dishes.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/25/science/25recipehealth/25recipehealth-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 6 generously", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner, pastas", "keywords": "fall, spring, summer, winter, halal, high fiber, kosher, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 234}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 302, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "9 grams", "proteinContent": "16 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1049 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 generous bunches Swiss chard (about 2 to 2 1/4 pounds), stemmed and washed in 2 changes of water", "Salt", "1 pound beet greens or spinach, stemmed and washed in 2 changes of water", "3 tablespoons extra virgin olive oil, plus additional for oiling baking dish", "1 onion, chopped", "1/2 pound leeks (1 large or 2 smaller), white and light green parts only, cleaned and chopped", "3 garlic cloves, minced", "1 teaspoon chopped fresh thyme leaves", "1 pound cabbage (1/2 medium), cored and chopped", "4 eggs", "1 cup cooked rice or farro", "Nutmeg", "Freshly ground pepper", "2 ounces Gruyère, grated (1/2 cup)", "1 ounce Parmesan, grated (1/4 cup)", "1/4 cup breadcrumbs (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil while you stem and wash the greens. When the water comes to a boil salt generously and add chard. Blanch for 1 minute, until just wilted, and using a skimmer or a slotted spoon, transfer to a bowl of cold water. Drain and squeeze out excess water, taking the chard up by the handful. Chop medium-fine and set aside. You should have about 2 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water back to a boil and blanch beet greens for 1 minute; if using spinach, blanch for 20 seconds only. Transfer to a bowl of cold water, drain and squeeze out excess water. Chop medium-fine. You should have about 1 cup (less for spinach)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Oil a 2-quart baking dish with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil over medium heat in a large, heavy skillet and add onion. Cook, stirring often, until tender, about 5 minutes, and add leeks. Cook, stirring, until leeks begin to soften, 2 to 3 minutes, and add garlic and a generous pinch of salt. Cook, stirring, until garlic is fragrant, 30 seconds to a minute, and add cabbage and thyme. Cook, stirring often, until cabbage collapses in pan, about 5 minutes, and add another generous pinch of salt. Continue to cook the mixture until the cabbage is tender, sweet, and beginning to color, about 10 minutes. Stir in chopped blanched greens and season to taste with salt and pepper. Stir together for about a minute and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat eggs in a large bowl and add a pinch of nutmeg and salt and pepper to taste. Stir in rice or farro, vegetable mixture and cheeses. Scrape into prepared baking dish. If using breadcrumbs, toss with remaining tablespoon olive oil and sprinkle over the top. If not using breadcrumbs drizzle remaining oil over the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 40 to 45 minutes, until top is lightly browned. Remove from heat and allow to sit for at least 10 minutes before serving. Serve hot, warm or room temperature."}], "link": "https://cooking.nytimes.com/recipes/1017080-three-greens-gratin"}