{"@context": "http://schema.org", "@type": "Recipe", "name": "Gâteau Breton", "description": "With its soft, buttery crumb, this classic French cake is similar to a giant shortbread, though moister and more tender. Its hidden prune filling is traditional, although you can use other dried fruit, such as apricot, instead. In France you sometimes even see bakers sandwiching melted chocolate or caramel between the layers. This keeps well if you want to bake it 1 or 2 days ahead. Store it well wrapped at room temperature.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/12/02/dining/02COOKBOOKS-slide-68RF/02COOKBOOKS-slide-68RF-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "12 servings", "recipeCuisine": "french", "recipeCategory": "cakes", "keywords": "apricot, prune, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 236}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 442, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "11 grams", "sodiumContent": "21 milligrams", "sugarContent": "20 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3/4 cup/100 grams pitted prunes or dried apricots (about 16)", "2 tablespoons/30 milliliters rum", "2 1/4 cups plus 2 1/2 tablespoons/300 grams all-purpose flour", "1 cup/200 grams superfine sugar", "Large pinch flaky sea salt", "8 1/2 ounces/240 grams unsalted butter (2 sticks plus 1 tablespoon), diced, more for greasing pan", "6 extra-large egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pot over medium-high heat, combine prunes, rum and 2 tablespoons water. (Use 1 cup/240 milliliters water if using dried apricots.) Cook until most of the liquid has been absorbed (about 5 minutes for prunes, 10 to 15 for apricots). Use a fork to mash into a thick purée. Cover and chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, pulse to combine flour, sugar and salt. Add butter and pulse until mixture resembles bread crumbs. Add 5 egg yolks and pulse until mixture comes together as a dough. Divide in half, form into disks, and wrap in plastic wrap. Chill at least 2 hours or until firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Grease and line an 8-inch round cake pan with parchment paper. Between two sheets of parchment paper or plastic wrap, roll one of the dough halves into an 8-inch circle. Transfer dough to prepared cake pan, pressing into edges. Spread prune or apricot purée across dough, leaving 3/4 inch border around outside edge. Roll second piece of dough into an 8-inch circle, transfer to cake pan, press around outside edge to stick the pieces together and seal in fruit purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine remaining egg yolk with 1 teaspoon water and beat lightly. Brush over top of cake, then use a fork to score a crisscross pattern into the dough. Bake until golden brown, about 50 minutes (cover with foil if cake is browning too quickly). Cool in pan 15 minutes. Flip onto a plate, then invert onto a wire rack and let cool completely."}], "link": "https://cooking.nytimes.com/recipes/1017854-gateau-breton"}