{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate-Mint Thins With Candy Cane Crunch", "description": "This cookie is a handmade homage to the Girl Scouts’ classic combination of dark chocolate and mint. A bright, festive decoration of crushed candy canes adds color and crunch. If store-bought dark chocolate cookies are available, you can use them instead of making your own. And if you temper the coating chocolate instead of simply melting it, your chocolate shell will have a bit more snap and durability.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/12/03/dining/03COOKFIGHT2/03COOKFIGHT2-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "About 5 dozen", "recipeCuisine": "", "recipeCategory": "snack, candies", "keywords": "bittersweet chocolate, candy canes, peppermint extract, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 414}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 111, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "4 grams", "sodiumContent": "22 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup plus 2 tablespoons/230 grams granulated sugar", "12 tablespoons/170 grams/1 1/2 sticks unsalted butter, softened at room temperature", "1/2 teaspoon/3 grams kosher salt", "1 egg", "1 teaspoon peppermint extract", "1 1/2 cups/187 grams all-purpose flour", "3/4 cup/63 grams unsweetened cocoa, preferably Dutch-process", "8 to 12 candy canes", "About 16 ounces/500 grams semisweet or bittersweet chocolate", "1/4 to 1/2 teaspoon peppermint extract", "1/4 teaspoon vanilla extract", "2 tablespoons coconut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "To make the cookies:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a mixer, cream sugar and butter together until very fluffy, at least 3 minutes. Add salt, egg, peppermint extract and 1 tablespoon water, and mix until smooth. Mix or sift flour and cocoa together, then add to bowl and mix until combined. The dough will be very stiff (it can be made 1 or 2 days ahead and kept refrigerated)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Using your hands, break off pieces of dough the size of walnuts (about 2 teaspoons) and roll into balls. Place 3 inches apart on baking sheets lined with parchment paper or nonstick liners. Use the bottom of a glass to flatten each ball into a round, 1/8-inch thick. (Dust the bottom of the glass with cocoa if it sticks to the dough.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake about 15 minutes, until cookies are flattened, firm and beginning to crisp. Remove from cookie sheets and let cool on wire racks."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To make the coating:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place half the candy canes in a thick, sealed plastic bag and use a heavy skillet or rolling pin to pulverize them into a mix of pink candy-cane dust and striped red-and-white bits. Transfer to a bowl and repeat with remaining candy canes. Set aside in a cool place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To coat the cookies, melt chocolate in a metal bowl set over barely simmering water. When smooth, stir in 1/4 teaspoon of each extract and the coconut oil. Taste and add more peppermint extract if needed. Keep chocolate warm and fluid, over hot water. (Or temper chocolate, adding the extracts after tempering.)"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To coat the cookies:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Working 1 cookie at a time, use a spatula or shallow slotted spoon to submerge the cookie in chocolate, gently pressing it down to the bottom of the bowl. Slowly lift it out, letting chocolate drip evenly off the sides to make a smooth, thin coating on top. Gently shake off excess chocolate and place cookies on a rack to cool. After about 15 minutes, start checking to see if the chocolate has set. Touch the center with a finger; when chocolate is firm, almost cool, and only a faint mark remains, sprinkle tops evenly with candy cane dust and bits. (If you do it too soon, the candy cane bits will begin to melt.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Store in the refrigerator in airtight containers, in layers separated by parchment paper."}]}], "link": "https://cooking.nytimes.com/recipes/1017031-chocolate-mint-thins-with-candy-cane-crunch"}