{"@context": "http://schema.org", "@type": "Recipe", "name": "Cod With Chanterelles and Parsley Sauce", "description": "Chanterelles are extremely costly, but they are very light, so you get a lot of volume for your dollar. You only need an ounce or two per serving here. This is inspired by a delicious main dish I had at a wonderful fish bistro in Paris, L’Ecailler du Bistrot. There the dish was made with brill, a flat white fish with thick, delicate fillets. Brill is not a fish we find easily in the United States (it is a North Atlantic fish but it lives on the European side). I substituted Alaskan cod, which is not nearly as fine a fish, but the dish is still a winner. Halibut and sea bass will also work.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/02/science/02recipehealth/02recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "french, mediterranean", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, kosher, low-carb, low sugar, nut-free, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 95}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "6 to 8 ounces chanterelles, cleaned and coarsely chopped", "1 to 2 garlic cloves (to taste), minced", "Salt", "Freshly ground pepper", "1/4 cup dry white wine", "1/2 teaspoon finely chopped or grated lemon zest", "1 1/2 pounds Alaskan cod, halibut or sea bass fillets", "Salt and freshly ground pepper", "1 tablespoon extra virgin olive oil", "1/4 cup dry white wine", "Lemon juice, to taste", "1 1/3 cups, tightly packed, flat-leaf parsley leaves", "1/4 cup extra virgin olive oil", "Salt", "Freshly ground pepper", "Juices from cooked fish, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the parsley sauce. Bring a small pot of water to a boil, salt generously and add parsley leaves. Blanch for 20 seconds only and transfer to a bowl of cold water. Drain and press leaves against strainer to squeeze out water, then squeeze by the handful. Transfer to a small food processor fitted with the steel blade or a mini-chop and turn on the machine. When chopped leaves adhere to the sides of the machine, stop and scrape down sides with a spatula. Turn on again and add oil with the machine running. Purée until smooth. Transfer to a mortar and pestle and continue to work until smooth. Season to taste with salt and pepper, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Oil a baking dish that can accommodate all of the fish. Season fish with salt and pepper. Place in baking dish. Drizzle oil over fish, add wine and a squeeze of lemon to pan and cover tightly. Bake 10 to 15 minutes (depending on the thickness of the fillets), until fish is opaque and pulls apart when a fork is inserted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While fish is baking, cook mushrooms. Heat a medium-size or large skillet over high heat and add olive oil. Add mushrooms and let them sit and sear for several seconds, then stir and toss in the pan for about 1 minute, until they begin to sweat. Turn heat to medium and add garlic and salt and pepper to taste. Toss or stir in the pan for another minute or two, just until the mushrooms have softened. Add wine and cook, stirring and scraping up any residue from the bottom of the pan, until wine has evaporated. Stir in lemon zest. Taste and adjust seasoning. Turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When fish is done, tip or spoon some of the liquid from baking dish into parsley purée and stir together with pestle until sauce is smooth and has a creamy consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a piece of fish on each of 4 plates. Spoon parsley sauce onto plate, next to fish. Place mushrooms on parsley sauce and serve."}], "link": "https://cooking.nytimes.com/recipes/1017020-cod-with-chanterelles-and-parsley-sauce"}