{"@context": "http://schema.org", "@type": "Recipe", "name": "Liège Waffles", "description": "These rich Belgian yeast waffles take a bit of planning (an overnight rise), but one bite and you'll forgive the extra time they take and the giant mess they leave on your waffle iron. With their buttery brioche consistency and pockets of sweet sticky sugar throughout, they're decidedly more dessert than breakfast. Don’t worry if you can’t find pearl sugar. Granulated sugar and water are all you need for a D.I.Y. version that yields excellent results.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2015/08/26/dining/26CLOSE3/26CLOSE3-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "16 waffles", "recipeCuisine": "belgian", "recipeCategory": "breakfast, brunch", "keywords": "main course, nonfat milk, pearl sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 160}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 219, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "3 grams", "sodiumContent": "150 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup (120 milliliters) nonfat milk", "2 tablespoons (25 grams) brown sugar", "2 1/4 teaspoons (7 grams) active dry yeast", "2 large eggs", "1 tablespoon (15 milliliters) vanilla extract", "3 2/3 cups (460 grams) all-purpose flour, divided", "1 teaspoon (6 grams) coarse or kosher salt", "7 tablespoons (100 grams) butter, softened", "1 cup pearl sugar, or make your own (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the milk and 1/4 cup (60 milliliters) water in a small saucepan and heat until lukewarm, 110 to 116 degrees on an instant-read thermometer. Transfer milk mixture to the bowl of a stand mixer. Add brown sugar and yeast and stir to combine; set aside 5 minutes. (The yeast should look foamy. If it doesn’t foam, discard and try again with different yeast.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in the eggs and vanilla. Using the dough hook attachment on your mixer, stir in all but 1 cup of the flour. Mix in salt. Add the butter, 1 tablespoon at a time, thoroughly mixing after each addition and scraping down the bowl before adding the next. Add the remaining 1 cup flour and mix on low speed, stopping once or twice to pull the dough off the hook, about 5 minutes, or until the dough is glossy, pulls away from the side of the bowl and has gathered in a ball on the hook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the bowl with plastic wrap and leave at room temperature for 2 hours. The dough will double in size. Stir the puffed dough with a spoon to deflate, then re-cover the bowl with plastic wrap and refrigerate overnight or up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove dough from refrigerator and turn out onto a lightly floured surface. Knead in the pearl sugar (or your homemade version) a little at a time. The dough will be stiff but will become more pliable as it warms. Cut dough into 16 equal pieces with a bench scraper or chef’s knife and return to the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your waffle iron according to the manufacturer’s instructions. Working with 1 or 2 balls of dough at a time (leave the rest in the refrigerator), arrange on the waffle iron and cook until golden brown all over, 2 to 5 minutes depending on your iron. Use tongs to transfer waffles to a baking sheet or cooling rack. Some of the sugar will melt out of the waffles and collect in your iron, adding an extra layer of glossy molten sugar to each waffle as you continue. Serve waffles warm."}]}