{"@context": "http://schema.org", "@type": "Recipe", "name": "Make-Ahead Fried Chicken", "description": "Fried chicken is one of the few fried foods that tastes just as good served at room temperature as it does when it's served hot enough to burn your fingers. This recipe has been specially engineered to be made in advance. It’s seasoned assertively, so the flavors won’t dull as it cools. But the real key is double-dipping the chicken in the flour mixture before you fry it, making for an extra-crunchy crust that holds up all afternoon. And it lets you serve fried chicken to your guests and still have enough time to clean the kitchen and take a shower before they arrive.\n\nAlthough the recipe calls for all drumsticks, which won’t dry out as they sit, feel free to substitute other chicken parts.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/07/02/multimedia/clark-fried-chicken/clark-fried-chicken-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "american, southern", "recipeCategory": "dinner, lunch", "keywords": "buttermilk, chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 324}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 852, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "80 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "4 grams", "proteinContent": "54 grams", "saturatedFatContent": "10 grams", "sodiumContent": "1131 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 quart buttermilk ", "2 torn bay leaves", "2 thinly sliced shallots", "2 garlic cloves, minced", "2 tablespoons Tabasco sauce", "1 tablespoon Old Bay Seasoning", "1 teaspoon dry mustard powder", "2 tablespoons kosher salt", "2 teaspoons cracked black pepper", "1 tablespoon honey ", "12 drumsticks, about 2½ to 3 pounds chicken  ", "4 cups all-purpose flour", "1 teaspoon cayenne ", "2 teaspoons kosher salt ", "1 teaspoon good chile power such as chipotle powder ", "Corn, grapeseed or vegetable oil, for frying "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the marinade: Whisk together all the marinade ingredients, except the chicken, and place in a large bowl or plastic bag. Submerge the chicken in the marinade, cover bowl or seal bag, and let rest in the refrigerator for at least 4 hours or, better, overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the coating: In a bowl, whisk together the flour, cayenne, salt and chile powder. Place a paper bag inside another paper bag (to prevent seepage, use large bags or several small ones) and transfer the flour mixture into it. This is so you can shake the chicken pieces. (You can also just mix flour in a bowl and dredge the chicken parts in it, or use a heavy-duty plastic zipper bag for shaking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take a piece of chicken out of the marinade and place it in the bag with the flour mixture. Close the bag and shake it so the chicken is fully coated. (Or, if you are using a bowl, dredge the chicken in the flour mixture.) Remove and place on a plate or sheet pan. Repeat with remaining chicken pieces, one by one. Let chicken rest for 30 minutes so it can come to room temperature. Reserve the coating mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven or heavy skillet with a lid, heat the oil until it reaches 350 degrees. Just before frying, shake the chicken pieces in the coating mixture once again, one by one."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry the chicken for 6 minutes, covered, then uncover the pot and flip the chicken with tongs. Continue frying for about another 6 minutes, or until the coating is dark golden brown and the juices run clear when the meat is pricked with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken on a wire rack set over a paper-towel-lined baking sheet to drain and cool. Serve within 8 hours, but it's best to serve within 4 hours and leave the chicken at room temperature, rather than chilling it."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Make-Ahead Fried Chicken", "description": "Melissa Clark makes crispy fried chicken that is best eaten cold.", "thumbnailUrl": "https://static01.nyt.com/images/2015/07/02/multimedia/clark-fried-chicken/clark-fried-chicken-mediumThreeByTwo440.jpg", "uploadDate": "2015-07-02T19:54:25.000Z", "duration": "PT1M44S"}, "link": "https://cooking.nytimes.com/recipes/1017514-make-ahead-fried-chicken"}