{"@context": "http://schema.org", "@type": "Recipe", "name": "Salt Cod, Potato and Chickpea Stew", "description": "This hearty, brothy stew features popular ingredients from the Iberian Peninsula — salt cod, garlic, saffron, potatoes. Spanish and Portuguese cooks adore salt cod and use it in all kinds of ways; these same ingredients may also be reconfigured into salads or casseroles. You’ll need to soak the fish overnight to remove the salt. The chickpea broth adds great flavor.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/04/30/dining/29KITCHEN1/29KITCHEN1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "portuguese, spanish", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "chickpea, littleneck clam, pimenton, saffron, salt cod fillet, yukon gold potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 90}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 618, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "76 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "13 grams", "proteinContent": "43 grams", "saturatedFatContent": "2 grams", "sodiumContent": "946 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound boneless salt cod fillets", "1 pound dried chickpeas", "1 small onion, halved and stuck with 2 cloves", "1 bay leaf", "Salt and pepper", "4 tablespoons olive oil", "1 large onion, diced", "2 teaspoons chopped garlic", "Pinch of crumbled saffron", "2 teaspoons pimentón (smoked paprika)", "2 tablespoons tomato paste", "1/2 cup dry white wine", "1 1/2 pounds yellow-fleshed potatoes, such as Yukon Gold, peeled and cut in thick wedges", "12 littleneck clams, about 1 pound", "2 cups roughly chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse salt cod, then place in a bowl of cold water and soak for 8 hours or overnight. Change water every 2 hours if possible. (If desired, fully soaked cod may be refrigerated, drained and wrapped in plastic for up to 2 days.) Also put chickpeas in a bowl and cover with cold water by 2 inches. Leave to soak 8 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, drain cod, chop it into 1-inch chunks, put it in a bowl and set aside. Put chickpeas and soaking water in a large pot over high heat. Add clove-stuck onion and bay leaf and bring to a boil. Skim foam, turn down heat and simmer for about 45 minutes, until tender. Halfway through cooking, add 2 teaspoons salt. Turn off heat and leave chickpeas in their broth until ready to use. (Chickpeas may be cooked several hours ahead or even a day in advance if desired.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the stew: In a heavy soup pot, warm olive oil over high heat. Add diced onion and let sizzle, then reduce heat and cook until softened, stirring, about 10 minutes. Stir in garlic, saffron, pimentón and tomato paste and cook for 2 minutes. Season mixture with salt and pepper. Add wine and bring to a brisk simmer. Drain chickpeas, reserving 6 cups of the broth. Add the broth and potatoes to the pot, cover and cook until potatoes are tender, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle about 2 cups of the stew’s liquid over the salt cod pieces and let steep for 10 minutes (the fish will cook while steeping), then pour this mixture into the pot. Add the clams and reserved chickpeas to the pot and simmer, covered, until clams open, 5 to 7 minutes. To serve, stir in the cilantro and ladle the stew into big bowls."}], "link": "https://cooking.nytimes.com/recipes/1017371-salt-cod-potato-and-chickpea-stew"}