{"@context": "http://schema.org", "@type": "Recipe", "name": "Cod Cakes", "description": "Cod cakes are terrific with cod, but can be made with any white-fleshed fish. Poach the fillets in bay-leaf-scented water, then flake the cooled meat into a New Englandish mirepoix of sautéed onions and celery. Eggs and cracker crumbs will help bind everything together below a drift of spice. Make sure to leave some time to chill the resulting patties in the refrigerator – the cold will help them set up so they don’t fall apart in the sauté pan. A light smear of mayonnaise on the exterior of the cakes before you fry them will encourage the most glorious crust. Serve with a thatch of green salad, a bowl of chowder or a neat pile of slaw.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/08/09/dining/09COOKING-PADTHAI7/09COOKING-PADTHAI7-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings as a main course, 6 to 8 servings as an appetizer", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "appetizer, main course, cod, Old Bay seasoning, saltine crackers", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1601}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 361, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "3 grams", "proteinContent": "21 grams", "saturatedFatContent": "4 grams", "sodiumContent": "443 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 peppercorns", "1 bay leaf", "1 lemon, cut into eighths", "1 pound cod fillets, or other white flaky fish", "2 tablespoons unsalted butter", "2 ribs celery, trimmed, peeled and diced", "1 medium-size yellow onion, peeled and diced", "2 cloves garlic, peeled and minced", "1 heaping tablespoon mayonnaise, homemade or store-bought", "2 teaspoons Dijon mustard", "2 eggs", "1 1/2 teaspoons kosher salt", "1/2 teaspoon freshly ground black pepper", "2 teaspoons Old Bay seasoning, Lawry’s Seasoned Salt or 1 teaspoon paprika and 1 teaspoon red-pepper flakes, or to taste", "1 ‘‘sleeve’’ unsalted saltine crackers, crushed, or 1 heaping cup panko bread crumbs", "1/2 bunch parsley, roughly chopped", "1/4 cup neutral oil, like canola"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a shallow, wide pan with high sides with about an inch of water, and set it over high heat. Add the peppercorns, bay leaf and 1 section of the lemon to the water, and allow it to come to a bare simmer. Place the fish into this poaching liquid, and cook, barely simmering, until the flesh has just begun to whiten all the way through, approximately 6 to 8 minutes. Using a wide spatula, carefully remove the fish from the water, and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Empty the pan, and return it to the stove, over medium-high heat. Add the butter, and allow it to melt, swirling it around the pan. When the butter foams, add the celery, onions and garlic, and sauté, stirring often, until the vegetables soften and the onions turn translucent, then transfer them to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix together the mayonnaise, mustard, eggs, salt, pepper and seasoning salt (or paprika and hot-pepper flakes), then add this mixture to the bowl with the sautéed vegetables, pour the crushed saltines or bread crumbs over them and stir to combine. Add the parsley, and stir again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flake the cooked fish into the binding sauce carefully, keeping the flakes as whole as you can manage, then gather them into small balls, and form them into patties, 4-6 for a main course, 6-8 for an appetizer. Place them on a sheet pan or platter, cover loosely with plastic wrap and transfer them to the refrigerator for at least 30 minutes to set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large sauté pan over high heat, and add to it the neutral oil. When the oil is shimmering, remove the fish cakes from the refrigerator, and carefully sauté the patties until they are golden brown, approximately 4 to 5 minutes a side. Work in batches if necessary. (A small smear of mayonnaise on the exterior of the patties will give them a crisp crust.) Serve them alone, or with greens dressed in a lemony vinaigrette, with the remaining wedges of lemon."}]}