{"@context": "http://schema.org", "@type": "Recipe", "name": "Freekeh, Chickpea and Herb Salad", "description": "There is a lot to love about freekeh, an earthy grain that I’d like to see catch on in more kitchens. It cooks up in about 25 minutes, and it’s light, like coarse bulgur, which it resembles, except that the color is darker and greener.\n\nBut freekeh has a more complex flavor than bulgur. What stands out is its smokiness, a result of the production process, in which durum wheat — the type used for many pastas — is harvested while still green and soft, and carefully roasted in the husk over open fires. The wheat is beaten to remove the chaff, and in the Middle East it is sold whole or cracked.\n\nThe cracked version is what you’re more likely to find here in the United States, and happily it’s become easy to do so. Look on the shelves of Middle Eastern markets, at whole-food markets or online. Cracked freekeh is tastier and easier to work with than whole freekeh. Add it to soups or stews, or use in the same way you would use rice or bulgur.\n\nThe cracked wheat has a grassy, herbal quality that also makes it great for use in lemony salads like this one, in which the freekeh is tossed with chickpeas, scallions and a welcome dash of bright green in the form of fresh mint and parsley.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/21/dining/21MARTHA/21MARTHA-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "mediterranean, middle eastern", "recipeCategory": "dinner, lunch, salads and dressings, vegetables", "keywords": "appetizer, main course, side dish, chickpea, freekeh, dairy-free, halal, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 286}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 313, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "9 grams", "proteinContent": "9 grams", "saturatedFatContent": "2 grams", "sodiumContent": "387 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 cup freekeh", "1/2 teaspoon salt, more to taste", "1/2 cup chopped fresh flat-leaf parsley", "1/4 cup chopped fresh mint", "1 cup thinly sliced celery, plus 3 tablespoons chopped leaves", "1 bunch scallions, finely chopped", "1 can chickpeas, drained and rinsed", "1/4 cup fresh lemon juice, more to taste", "1/2 teaspoon lightly toasted cumin seeds, ground, more to taste", "1 garlic clove, minced or puréed (optional)", "6 tablespoons extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a medium-size heavy saucepan over medium-high heat and add freekeh. Toast in the dry pan, shaking pan or stirring, until freekeh becomes fragrant, 2 to 3 minutes. Add 2 cups water and salt and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to low, cover and simmer 20 to 25 minutes or until water has been absorbed. Turn off heat and uncover. Place a clean dish towel over the pot and return lid. Let sit at least 10 minutes. Uncover and allow freekeh to cool another 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine freekeh, chopped herbs, celery, scallions and chickpeas and toss together. In a small bowl, whisk together lemon juice, cumin, garlic, salt and olive oil; toss with salad. Taste and add more lemon juice if desired. Serve right away or let sit for up to 1 hour before serving."}]}