{"@context": "http://schema.org", "@type": "Recipe", "name": "Sole With Fennel and Blood Oranges", "description": "I like to serve this with baby potatoes or fingerlings, which I cook in salted boiling water before I begin the fish, then drain and keep warm in the covered pot.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2016/02/03/dining/03MARTHA-web/03MARTHA-web-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "blood orange, fennel, sole, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 87}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 387, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "4 grams", "proteinContent": "24 grams", "saturatedFatContent": "6 grams", "sodiumContent": "810 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 blood orange, or a Cara Cara navel orange or a half-grapefruit", "3/4 pound fillet of sole", "Salt and ground black pepper", "3 tablespoons corn flour (very fine cornmeal) or all-purpose flour", "2 tablespoons extra-virgin olive oil", "2 small fennel bulbs, trimmed, cored and thinly sliced, about 1 1/2 cups", "1 tablespoon unsalted butter", "1/4 cup fresh lemon juice", "Chopped fennel fronds for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away the ends of the orange, stand it on end and cut away the skin and pith by slicing down the sides, following the curvature of the fruit. Hold orange above a bowl to catch juice and cut the sections out from between membranes. Cut sections in half crosswise and set aside with the juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season fish with salt and pepper. Lightly dredge in flour and tap to remove excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon olive oil over medium-high heat in wide, heavy skillet, preferably nonstick, that can accommodate fish fillets in a single layer. Add fennel and cook, stirring often, until crisp-tender, about 5 minutes. Transfer to a bowl and return the pan to the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining olive oil and the butter to the pan. When butter has begun to foam, add fish fillets, rounded side down. Cook 2 to 3 minutes, until the fillets release easily from the surface of the pan and are lightly colored. If the fillets are thin, check after 1 minute. Cook on the other side for 2 to 3 minutes, until fish is opaque all the way through. Do not overcook, or fish will fall apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully transfer to individual plates or to a platter. Add lemon juice and orange sections and juice to the pan and stir constantly with a wooden spoon to deglaze. Juice should quickly reduce by half or more. Spoon juice and orange sections over the fish. Sprinkle chopped fennel fronds over top and serve with sautéed fennel on the side."}]}