{"@context": "http://schema.org", "@type": "Recipe", "name": "Julia Child’s Aunt Helen’s Fluffy Pumpkin Pie", "description": "This recipe was published in Parade in November 1982, when Julia Child was writing a recipe column for the magazine. As all cooks (and writers) know, Thanksgiving is an adventure and a challenge: how to come up with fresh ideas that keep the dish on the right side of tradition? In this pie, Mrs. Child’s addition of molasses, extra spices and especially bourbon breathe new life into the filling. If you like your desserts on the spicy side, add an extra tablespoon of molasses and a pinch of black pepper.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/11/18/dining/19JULIAREX3/19JULIAREX3-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "Two 9-inch pies, 16 to 20 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "dessert, heavy cream, pumpkin purée", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 521}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 285, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "6 grams", "sodiumContent": "303 milligrams", "sugarContent": "25 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 eggs", "2 15-ounce cans (3 1/2 cups) pumpkin purée", "1 cup light brown sugar", "1 cup plus 2 tablespoons granulated sugar", "Kosher salt", "3 tablespoons molasses", "3 tablespoons bourbon or dark rum (optional)", "3 teaspoons cinnamon", "3 teaspoons ginger", "1/4 teaspoon nutmeg", "1/4 teaspoon cloves", "1 cup heavy cream", "3/4 cup milk, more as needed", "2 unbaked 9-inch pie shells, or one 11-inch pie shell (<a href=\"http://cooking.nytimes.com/recipes/448-all-butter-pie-crust\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees and place rack in center of oven. Separate eggs and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mixer, blender or large bowl, blend pumpkin, the 2 cups of the sugars, 1 teaspoon salt, molasses, bourbon or rum (if using), cinnamon, ginger, nutmeg, cloves, egg yolks, cream and milk until smooth. Add more milk, a tablespoon at a time, if the mixture is stiff: it should be a soft purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a clean bowl, whip egg whites until foaming. Whip in a pinch of salt, then gradually whip in remaining 2 tablespoons sugar until shiny white peaks form. Beat 1/4 of the whites thoroughly into pumpkin mixture; gently fold in the rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately ladle filling into the shells, filling to just below the rim of the pan. Place in oven and bake just until rim of crust begins to turn gold, 10 to 15 minutes. Reduce heat to 375 and bake another 25 to 30 minutes, until a tester inserted into the filling 2 inches from the rim comes out clean. (The center should still be a bit wet; it will cook more as it cools.) If the rim of the crust starts to get too brown, cover it with aluminum foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately turn oven off, leave door ajar (stick in a wooden spoon to hold it open if necessary) and let sit 20 to 30 minutes more as the oven cools; this will prevent the filling from turning watery. Serve warm, or let cool, wrap tightly and refrigerate for up to 2 days. Let pie come to room temperature before serving."}], "link": "https://cooking.nytimes.com/recipes/1017820-julia-childs-aunt-helens-fluffy-pumpkin-pie"}