{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom Soup Gratinée", "description": "This hearty soup takes its cue from the classic soupe à l’oignon gratinée. I swapped out the onions for mushrooms and served the hearty soup paved with a layer of toast and cheese as a cold-weather first course. For an informal supper, it could be the main event, especially with additions like potatoes or other root vegetables, shredded cabbage, cooked lentils, buckwheat pasta or even chunks of duck confit, sausage or  boneless short ribs or veal shank. As for the finishing glaze of cheese, I suggest Gruyère, though the Bitto of the region, a firm cow’s milk cheese made with a funky touch of goat milk, would be lovely if you can find it.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/02/10/dining/10PAIRING/10PAIRING-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings ", "recipeCuisine": "french", "recipeCategory": "dinner, lunch, weekday, soups and stews", "keywords": "mushroom", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 128}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 669, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "89 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "8 grams", "proteinContent": "29 grams", "saturatedFatContent": "7 grams", "sodiumContent": "1424 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "1 pound cremini mushrooms, very finely minced, as for duxelles", "1 large red onion, sliced thin", "4 cloves garlic, sliced", "1 1/2 pounds shiitake mushrooms, stems discarded, sliced thin", "Salt", "5 cups mushroom or vegetable stock", "1 cup dry red wine", "2 tablespoons red miso", "Ground black pepper to taste", "1/2 teaspoon ground cloves", "1/2 teaspoon ground ginger", "6 slices sourdough bread, about 3 inches in diameter", "6 ounces Gruyère, shaved thin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large sauté pan. Add minced mushrooms and sauté on low until they glisten with moisture, about 5 minutes. Remove 1/3 cup and set aside. Add onion and garlic to pan and cook, stirring, until the onion wilts. Add shiitakes and a dusting of salt, increase heat to medium and sauté, stirring, until mushrooms have softened, 5 minutes or so. Stir in stock and wine, bring to a simmer and cook 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place miso in a dish and dissolve in a few tablespoons of the cooking liquid, then stir back into the pan. Add pepper to taste, cloves and ginger. Simmer, partly covered, about 30 minutes. Check consistency, adding a little water if needed. Adjust salt and pepper. Soup can be finished and served at once, or set aside, then reheated and finished."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, heat broiler. Transfer soup to a 3-quart ovenproof dish or casserole. Toast bread. Spread reserved minced mushrooms on each slice and cover with cheese. Float slices on top of soup. Place dish under the broiler long enough to melt and lightly brown the cheese, then bring to the table and serve into bowls. Alternatively, the soup can be divided into individual oven-proof bowls, each topped with toast, mushrooms and cheese, and broiled."}], "link": "https://cooking.nytimes.com/recipes/1017975-mushroom-soup-gratinee"}