{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Cake", "description": "Although black cake is descended from the British plum pudding, for Caribbean-born New Yorkers and their children, who number more than half a million, it evokes nostalgia for the islands, where the baking was a solemnly observed annual ritual. The cake is baked just before Christmas and eaten at Christmas dinner and afterward, in thin slices, for as long as it lasts.\n\nBecause of the soaking of the fruit and the use of brown sugar and a bittersweet caramel called browning, black cake is to American fruitcake as dark chocolate is to milk chocolate: darker, deeper and altogether more absorbing.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/12/18/dining/18COOKING-BLACK-CAKE/18COOKING-BLACK-CAKE-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "3 or 4 cakes, about 4 dozen servings", "recipeCuisine": "caribbean", "recipeCategory": "cakes", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 235}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 353, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "60 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "5 grams", "sodiumContent": "53 milligrams", "sugarContent": "37 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound prunes", "1 pound dark raisins", "1/2 pound golden raisins", "1 pound currants", "1 1/2 pounds dried cherries, or 1 pound dried cherries plus 1/2 pound glacé cherries", "1/4 pound mixed candied citrus peel", "2 cups dark rum; more for brushing cake", "1 1/2 cups cherry brandy or Manischewitz Concord grape wine; more for grinding fruit", "1/4 pound blanched almonds", "1 cup white or light brown sugar for burning, or 1/4 cup dark molasses or cane syrup; more molasses for coloring batter", "4 sticks (1 pound) butter; more for buttering pans", "1 pound (about 2 1/2 cups) light or dark brown sugar", "10 eggs", "Zest of 2 limes", "2 teaspoons vanilla extract", "1/2 teaspoon Angostura bitters", "4 cups (1 pound) all-purpose flour", "4 teaspoons baking powder", "2 teaspoons cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "At least 2 days before baking, combine prunes, raisins, currants, cherries, candied peel, rum and brandy in a glass jar or sturdy plastic container. Cover tightly; shake or stir occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, put soaked fruit and almonds in a blender or food processor; work in batches that the machine can handle. Grind to a rough paste, leaving some chunks of fruit intact. Add a little brandy or wine if needed to loosen mixture in the machine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If burning sugar, place a deep, heavy-bottomed pot over high heat. Add 1 cup white or light brown sugar, and melt, stirring with a wooden spoon. Stir, letting sugar darken. (It will smoke.) When sugar is almost black, stir in 1/4 cup boiling water. (It will splatter.) Turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 250 degrees. Butter three 9-inch or four 8-inch cake pans; line bottoms with a double layer of parchment or wax paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixer, cream butter and 1 pound light or dark brown sugar until smooth and fluffy. Mix in eggs one at a time, then lime zest, vanilla and bitters. Transfer mixture to a very large bowl. In a separate bowl, combine flour, baking powder and cinnamon. Fold dry ingredients into butter mixture. Stir in fruit paste and 1/4 cup burnt sugar or molasses. Batter should be a medium-dark brown; if too light, add a tablespoon or two of burnt sugar or molasses."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide among prepared pans; cakes will not rise much, so fill pans almost to top. Bake 1 hour, and reduce heat to 225 degrees; bake 2 to 3 hours longer, until a tester inserted in center comes out clean. Remove to a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While cakes are hot, brush tops with rum and let soak in. Repeat while cakes cool; they will absorb about 4 tablespoons total. When cakes are completely cool, they can be turned out and served. To keep longer, wrap cakes tightly in wax or parchment paper, then in foil. Store in a cool, dry place for up to 1 month."}], "link": "https://cooking.nytimes.com/recipes/1017882-black-cake"}