{"@context": "http://schema.org", "@type": "Recipe", "name": "Coconut Cream Pie", "description": "Coconut cream pie can assume all kinds of variations, with coconut extracts or coconut cream added to enhance the flavor. My mother’s version, which I grew up eating, is a more subtle, custardy version, with a balance of coconut and vanilla. It uses an old-fashioned technique called scalding, popular in the days before milk was pasteurized. Here it is used to change the texture of the milk and enhance its flavor. You can use the same sweetened, untoasted coconut to top the pie that you use in the filling, but the unsweetened, toasted coconut lends some nutty depth.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2015/05/05/dining/coconut-cream-pie-horizontal/coconut-cream-pie-horizontal-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "snack, pies and tarts", "keywords": "dessert, flaked coconut, pie shell, unsweetened coconut", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 126}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 378, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "12 grams", "sodiumContent": "313 milligrams", "sugarContent": "26 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 Prepared 9-inch pie shell", "2 cups milk", "3 egg yolks", "1/2 cup/100 grams sugar", "1/2 teaspoon salt", "2 1/2 tablespoons/20 grams cornstarch", "1 tablespoon butter, melted", "1/2 teaspoon vanilla", "1 cup/98 grams sweetened, flaked coconut", "1/2 cup/49 grams unsweetened coconut", "3 egg whites", "1/4 teaspoon cream of tartar", "6 tablespoons/75 grams sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Partially blind-bake the pie shell: Heat oven to 425 degrees. Roll out chilled pie dough and place in a 9-inch pie pan. (Glass is best.) Trim and flute or crimp the edges, pierce the bottom crust with  a fork 6 or 8 times, then cover with a large square of parchment or foil. It should hang over the edges. Carefully pour 2 or 3 cups of dried beans or pie weights onto the foil or parchment, and spread evenly so they reach up the sides of the pie. Bake 12 to 16 minutes or until  crust is lightly browned. If crust edges are browning too quickly, make a little collar from foil and cover for remaining baking time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Scald milk by placing it in a saucepan over medium heat. Stir frequently until it just begins to foam and bubble around the edges. Set aside to let cool slightly. In the top of a double boiler, or in another saucepan that will fit over a pot of boiling water, beat together egg yolks, sugar, salt and cornstarch. Stir in melted butter, then add the milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the saucepan over the boiling water and whisk until the mixture thickens. This will take 2 to 5 minutes. Remove from heat, stir in vanilla and sweetened coconut until well distributed. Pour into the pie shell."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meringue: Toast the unsweetened coconut lightly in a small sauté pan on the stove over medium heat, stirring frequently to prevent burning. Set aside. In a stand mixer or with a bowl and whisk, mix egg whites and cream of tartar until the mixture is foamy. If using a stand mixer, keep speed on medium. Then, turn mixer to high and gradually pour in sugar, a tablespoon at a time. If whisking, make sure sugar is dissolved before each new addition of sugar. Keep beating until the meringue is glossy and forms soft peaks. Be careful not to whip into stiff peaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the meringue over the pie filling. Using a spatula (an offset version works well), scoot the meringue to the edge of the crust so it forms a seal. Swirl the spatula through the rest of the meringue, distributing it evenly and dipping the edge of the spatula across the top of the meringue to make little peaks. Sprinkle evenly with the unsweetened coconut."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 15 to 20 minutes, or until meringue is golden brown. Cool on a wire rack. Refrigerate for at least 3 hours before serving."}], "link": "https://cooking.nytimes.com/recipes/1017386-coconut-cream-pie"}