{"@context": "http://schema.org", "@type": "Recipe", "name": "Taralli", "description": "Taralli are delicious ring shaped rusk-like Italian snacks from Apulia and Campania. Now that I know how easy they are to make I could be in big trouble, as whenever I’ve bought them from one of my favorite Italian delis I have a hard time resisting them. It’s the olive oil, I now know, that makes them special and different from other twice-baked breads. They are crisp but not hard, and this whole wheat version is as good as any traditional taralli I’ve tasted. I particularly like the version with black pepper. But I like them plain, without any embellishment, as well. The olive oil gives them so much flavor on its own. This recipe is based on a recipe in Carol Field’s “Italy In Small Bites.”", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/30/science/recipehealthtarali/recipehealthtarali-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "36 taralli", "recipeCuisine": "italian", "recipeCategory": "lunch, snack, breads", "keywords": "dairy-free, kosher, low cholesterol, low-fat, low-sodium, low sugar, vegan, vegetarian, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 55}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 79, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "56 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup / 118 milliliters dry white wine, warmed to lukewarm (95 to 115 degrees)", "1/2 cup / 118 milliliters lukewarm water", "1/2 cup / 118 milliliters extra virgin olive oil", "2 teaspoons instant yeast", "180 grams / 1 1/2 cups unbleached all purpose flour", "320 grams /  2 1/2 cups plus 1 tablespoon whole wheat flour", "1 teaspoon fine sea salt", "1 1/2 teaspoons fennel seeds or 2 teaspoons cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine wine and water in a small bowl or measuring cup and add yeast. Stir until dissolved. Add olive oil and stir together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a standing mixer fitted with the paddle, or in a large bowl if mixing by hand, combine flours, salt and fennel or pepper. Mix for about half a minute at low speed, then add liquids and beat at low speed until mixture comes together, about 1 minute. Remove paddle and let sit for 5 minutes. Change to dough hook and beat on low speed for 3 to 5 minutes (5 to 7 minutes if kneading by hand), until dough is smooth. Remove from bowl, knead a few times on a lightly oiled surface, and shape into a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and oil bowl and place dough in it, rounded side down first, then rounded side up. Cover bowl with plastic and place in a warm spot to proof for 1 to 1 1/4 hours. Dough should be puffed but not doubled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 1 or 2 baking sheets with parchment and lightly oil parchment. Divide dough into 12 equal pieces and roll each piece into an 18-inch long rope. Cover each rope loosely with plastic or a towel as you roll the rest. Once all pieces are shaped into ropes, cut each rope into 3 equal pieces (6 inches long) and join their ends to form rings about 2 inches in diameters. Pinch ends together firmly (dough will bounce back). Place on prepared baking sheets. Cover loosely with plastic or a towel and let proof for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat oven to 350 degrees. Bring a large or medium pot of water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a dish towel or paper towels next to your pan of boiling water. After rings have risen for 1 hour, carefully remove 4 or 5 at a time from baking sheet and drop into boiling water. As soon as they float to surface – in a matter or seconds -- remove from water with a slotted spoon or skimmer and drain on towel. It should not take more than a few minutes to blanch all of the rounds. Return to baking sheet. Bake on middle rack for 30 minutes. Flip rings over and lower heat to 225 degrees. Return to oven and leave for 1 hour. Taralli should be crisp all the way through. Allow to cool, and store in tins."}]}