{"@context": "http://schema.org", "@type": "Recipe", "name": "Spring Antipasto Platter", "description": "The antipasto table in old-fashioned Italian restaurants is a sort of precursor to the modern-day salad bar, though usually far better. The idea is to let customers serve themselves (or be served by the maître d’) a few spoonsful of room temperature vegetable preparations—grilled eggplant, roasted peppers, marinated mushrooms—along with a little cheese and salumi. It’s an easy concept to adopt at home for a dinner party. Serve it buffet style, on a platter, or on individual plates as a first course. Change the vegetables seasonally; for spring use asparagus, fennel, snap peas and young onions. Choose the very freshest mozzarella, burrata or ricotta, and thinly sliced prosciutto, salame, mortadella or lardo.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/05/06/dining/06KITCHEN1/06KITCHEN1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, quick, salads and dressings, vegetables", "keywords": "asparagus, fennel, fior di latte, prosciutto, sugar snap peas, main course, side dish, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 106}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 378, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "5 grams", "proteinContent": "23 grams", "saturatedFatContent": "12 grams", "sodiumContent": "757 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["2 bunches small spring onions or scallions", "Salt", "1 bunch asparagus, about 1 pound, tough ends removed", "1/2 pound sugar snap peas", "2 medium fennel bulbs, trimmed and sliced crosswise into 1/8-inch-thick rings", "4 ounces thinly sliced prosciutto, salame, mortadella or lardo", "Flaky sea salt or fleur de sel", "Black pepper", "Extra-virgin olive oil", "Basil or mint leaves", "1 pound fior di latte, bufala mozzarella, burrata or fresh ricotta, at cool room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler. Put a large pot of water on to boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim tops, roots and outer layer of spring onions, then arrange in one layer on a broiler pan. Broil until they are lightly charred on one side, 2 to 3 minutes, then turn and broil the other side until onions have softened a bit, about 3 minutes more. (It’s fine if they become blackened in spots.) Remove pan and let cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When water boils, salt well and submerge asparagus. Cook briefly, about 2 minutes for medium spears. Lift asparagus from water and spread in 1 layer on a kitchen towel and let cool to room temperature. Repeat process with the sugar snap peas and spread them on a separate kitchen towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange spring onions, asparagus, snap peas and fennel on a large platter. Drape prosciutto around the edge. Season vegetables lightly with sea salt and pepper and drizzle with olive oil. Garnish platter with basil or mint leaves. Put cheese on a small cutting board and pass separately. (Alternatively, compose individual plates with all components.)"}], "link": "https://cooking.nytimes.com/recipes/1017381-spring-antipasto-platter"}