{"@context": "http://schema.org", "@type": "Recipe", "name": "Tuna Mushroom Burgers", "description": "I have always had a weakness for tuna burgers, and I like these even more than the classic all-fish burger because the mushrooms assure a moist texture. They are inspired by a recipe by Clifford Pleau, which was presented at the 2015 Worlds of Healthy Flavors conference. If you use sushi-grade tuna for these burgers you might want to just sear them on each side to get a rare, sushi-like interior. If you use ahi tuna, you could still cook them rare, or cook them for about 2 minutes on each side. This will produce a burger that is more well done but still nice and moist. The burgers are delicious either way. Don’t use a food processor to chop the tuna; finely chop with a knife or a cleaver. The texture will be too pasty if you use a food processor. I found that the punch of the wasabi paste dissipated when the burgers were cooked, so add more if desired.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/03/04/science/recipehealthburger/recipehealthburger-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, burgers, vegetables", "keywords": "dairy-free, gluten-free, halal, kosher, low sugar, nut-free, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 54}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 122, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "1 gram", "proteinContent": "20 grams", "saturatedFatContent": "0 grams", "sodiumContent": "371 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 ounces sushi grade or ahi tuna, trimmed of blood lines", "10 ounces <a href=\"http://cooking.nytimes.com/recipes/1017259-roasted-mushroom-base\">roasted mushroom mix</a>", "1 to 2 teaspoons wasabi paste (more to taste)", "2 tablespoons capers, coarsely chopped if desired", "Salt to taste", "black pepper to taste", "1 small shallot, finely minced", "Oil for the pan (no more than 1 tablespoon)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop tuna very fine. I find a cleaver works well for this. It should be like ground beef and it is best to do this by hand because a food processor will make the fish pasty."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl mix together all of the ingredients except the oil, and season to taste. Combine well. Shape 4 patties with moistened hands, or shape by setting a 2-1/2- or 3-inch ring on a plate and filling the ring with the mixture. Carefully remove the ring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy nonstick skillet over medium-high heat and brush lightly with olive oil or add a small amount to the pan and swirl the pan. Carefully add burgers to pan, taking care not to crowd them. Turn heat to medium and either sear for only 30 seconds to a minute on each side, or cook 2 minutes on each side if desired. Remove to a plate and serve, on buns if desired. Chef Pleau serves these with “avocado crema,” a blend of avocado, yogurt, lime juice, cilantro and wasabi powder."}], "link": "https://cooking.nytimes.com/recipes/1017260-tuna-mushroom-burgers"}