{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted or Grilled Whole Fish With Tomato Vinaigrette", "description": "There are a number of good reasons to roast or grill a whole fish. Fish tastes better cooked on the bone. It’s just as easy as roasting meat or fowl, and is done in half the time. And a whole fish is apt to be fresher than many of the other choices at the fishmonger. A two-pound fish will serve two.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/07/29/dining/29KITCH_web/29KITCH_web-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "branzino, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 112}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 684, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "4 grams", "proteinContent": "82 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1463 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["2 whole fish, such as branzino, blackfish or striped bass, about 2 pounds each, gutted and scaled", "Salt and pepper", "A few thyme sprigs", "A few rosemary sprigs", "A few parsley sprigs", "A few fennel fronds", "A few basil leaves", "1 small lemon, thinly sliced", "Extra-virgin olive oil", "1 shallot, finely diced", "3 tablespoons red wine vinegar", "Salt and pepper", "2 cups diced tomatoes, or use halved cherry tomatoes instead", "1/4 cup olive oil", "2 tablespoons roughly chopped basil or parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse fish with cool water and pat dry. Season generously on both sides with salt and pepper. Season the cavity with salt and pepper. Tuck thyme, rosemary and parsley sprigs in cavity of each fish. Add fennel fronds, basil leaves and lemon slices. Drizzle olive oil on both sides of fish, then place on a parchment-lined rimmed baking sheet. Leave at room temperature. (May season and refrigerate fish up to 2 hours in advance. Bring to room temperature before cooking.) Heat oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the vinaigrette: Put shallot in a small serving bowl. Add vinegar and a good pinch of salt. Leave to steep 5 minutes, then whisk in olive oil. Season tomatoes with salt and pepper and spoon them into the olive oil mixture. Add basil and stir gently. Leave at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place fish on top shelf of oven and roast, uncovered, for 15 to 20 minutes, until fish is firm when probed and flakes at the thickest part. Take from oven and let rest 5 minutes. To serve, use a small knife, soup spoon and spatula to remove top fillets. Pull spine away to reveal bottom fillets. Transfer fillets to a platter or individual plates. Spoon a little tomato vinaigrette over each portion and pass the rest at the table."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Alternatively, if you are grilling the fish, prepare a bed of hot coals. Make sure the grill is cleaned with a wire brush and lightly oiled. Lay the fish directly on the grill and cook for 7 to 8 minutes. Do not attempt to turn fish until the skin has browned and crisped or it will stick. Carefully turn fish and cook for another 7 to 8 minutes, until fish is firm when probed and flakes at the thickest part. To serve, proceed as in Step 3."}]}