{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange Butter Cookies", "description": "The most common mistakes made by home bakers, professionals say, have to do with the care and handling of one ingredient: butter. Creaming butter correctly, keeping butter doughs cold, and starting with fresh, good-tasting butter are vital details that professionals take for granted, and home bakers often miss.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/04/08/dining/orange-cookies/orange-cookies-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 4 dozen cookies", "recipeCuisine": "", "recipeCategory": "snack, cookies and bars", "keywords": "all-purpose flour, baking soda, cake flour, confectioners' sugar, orange zest, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 379}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 108, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "61 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 3/4 cups unbleached all-purpose flour", "1 2/3 cups cake flour or more all-purpose flour (cake flour gives a finer texture)", "1/2 teaspoon baking soda", "1 teaspoon kosher salt", "1 1/4 cups granulated sugar", "1 cup (2 sticks) cold unsalted butter", "2 packed teaspoons freshly grated orange zest", "1 large egg plus 2 large egg yolks, at room temperature", "1 orange", "1 1/2 cups confectioners’ sugar", "2 to 4 tablespoons whole milk", "2 drops almond or vanilla extract", "Pinch fine salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Position two oven racks in top and bottom third of oven. Preheat oven to 350 degrees. Line two cookie sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, whisk flours, baking soda and salt together. In a mixer, cream together the sugar, butter and orange zest at medium speed until light and smooth, about 3 minutes. Scrape down the sides of bowl frequently. Add egg and mix. Add one egg yolk and mix. Add remaining egg yolk and mix. Stir in dry ingredients just until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop tablespoons of dough onto parchment, leaving more than 1 inch between cookies. Press each one down lightly with 2 fingers to flatten to a thickness of 1/2 inch. Leave any ridges and valleys on top of cookie intact, but smooth the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake about 15 minutes, rotating cookie sheets halfway through. Cookies should be pale but baked all the way through. Cool on sheets 5 minutes, then transfer to a rack and cool before storing in airtight containers up to 1 week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, make icing: Bring a small pot of water to a boil. Peel orange, being careful to remove only outer orange zest, and cut into thin strips. Blanch in boiling water 1 minute; drain. Sift confectioners’ sugar into a bowl. Whisk in 2 tablespoons milk. Whisk in more milk if needed to make mixture thin enough to spread. Add extract, salt and zest, and whisk to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cookies on a rack and drizzle icing over each one (make sure there is some orange zest in each spoonful). Icing will settle into cookie crevices; let harden."}], "link": "https://cooking.nytimes.com/recipes/1017342-orange-butter-cookies"}