{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom Mille-Feuille With Tomato Coulis", "description": "Rich Torrisi developed this intense and terrific recipe for the menu at Dirty French, one of a number of chic restaurants in downtown Manhattan that he runs with Mario Carbone. It is on one hand a simple dish: thin-sliced mushrooms layered with butter and salt, then pressed and chilled until they resemble the French dessert known as mille-feuille, or \"thousand leaves.\" Sautéing a slice of the resulting loaf in a hot pan, and then pairing it with a lovely coulis of fresh tomatoes and herbs? That elevates it to the divine.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/09/20/magazine/20eat/20mag-20eat-t_CA0-articleLarge.jpg", "totalTime": "PT13H", "recipeYield": "12 to 14 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 108}, "recipeIngredient": ["3 pounds king trumpet mushrooms", "3 sticks unsalted butter (1 1/2 cups, or 3/4 pound), melted", "1 pound good yellow tomatoes", "1 1/4 cups extra-virgin olive oil, plus more for searing", "Champagne vinegar to taste", "Sugar to taste", "Assorted herbs like parsley, oregano, marjoram, basil, sage and savory"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350. Slice mushrooms on a mandoline lengthwise, as thinly as is practical. Brush the inside of a 4 1/2-inch-by-8 1/2-inch nonstick loaf pan with some melted butter; line with parchment paper cut to fit the bottom of the pan. Layer the mushrooms in the pan, salting and spooning on a tablespoon or 2 of butter on each layer. Stack mushroom slices to about an inch above the pan’s top. Brush the inside of a piece of aluminum foil with melted butter, and wrap the mushrooms and the pan tightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the loaf pan on a larger baking dish or rimmed sheet pan to catch any liquid that may bubble over. Place the pan in the preheated oven, and bake for 45 minutes to 1 hour, or until a skewer inserted in the mushrooms meets almost no resistance. Remove the aluminum foil, and continue to bake for 15 minutes, or until the top is browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the oven, and unwrap; pour off excess liquid. Place a piece of parchment paper and a second loaf pan on top, weighing it with cans of beans or bricks, at least 10 pounds of weight. Keep the outer baking dish underneath to collect overflow. Cool for 30 minutes, then refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, remove the loaf from the refrigerator, and take off the weights. Invert the loaf onto a rack lined with paper towels. You may have to break the butter seal with a knife so the mille-feuille releases, or even rub the bottom of the pan with a hot, wet cloth. Drain on the paper towels until ready to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Cut the tomatoes into 2-to-3-inch wedges, and place in a blender. Blend on high speed until smooth; turn the blender to low, and slowly pour in the olive oil. Add salt, vinegar and sugar as needed. Do not strain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the loaf to a cutting board, and carefully slice 3/4-inch pieces with a serrated knife. Sear each piece in olive oil over medium heat in a heavy-bottomed sauté pan. Cook until browned, about 2 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon some of the sauce onto each plate, and top with a slice of mushroom mille-feuille. Garnish with the herbs (if using sage or savory, fry it in olive oil). Sprinkle with salt, then serve."}]}