{"@context": "http://schema.org", "@type": "Recipe", "name": "Ruth Reichl’s Chicken Diavolo", "description": "Ruth Reichl developed this crispy, spicy chicken after eating pollo alla diavola at Lupa restaurant in New York. The actual cooking time is short, but the recipe does require making the chile oil in advance and marinating the chicken. She suggests buying hot chile oil if you are in a hurry. Be careful; the chicken can produce a lot of smoke in cooking.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2015/09/18/dining/18CHICKENDIAVOLO/18CHICKENDIAVOLO-articleLarge.jpg", "totalTime": "P2DT45M", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 346}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 922, "unsaturatedFatContent": "58 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "79 grams", "fiberContent": "3 grams", "proteinContent": "48 grams", "saturatedFatContent": "16 grams", "sodiumContent": "798 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 large jalapeño chiles", "2 serrano chiles", "3/4 cup olive oil, plus more for sautéing", "2 tablespoons hot paprika (or equal parts cayenne and sweet paprika)", "Ground black pepper", "2 1/2 lemons", "Salt", "1 small chicken, quartered and backbone removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chile oil: Chop jalapeño and serrano chiles and put them in a small saucepan with 3/4 cup olive oil. Add hot paprika and grind in a fair amount of black pepper. Steep over medium heat for about 15 minutes. Let sit overnight, or all day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain chile oil into a large bowl. Slice 2 lemons and add them to the bowl. Season with salt. Coat chicken with the oil, put in a zip-top bag and let it sit in the refrigerator for at least 4 hours or up to a day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 500. Heat a cast-iron skillet until it’s quite hot (about 5 minutes). Meanwhile, remove the chicken from the chile oil and pat it dry. Sprinkle it with salt and shower it with pepper; you need a lot. Slick the bottom of the pan with olive oil and put the chicken, skin-side down, in the hot skillet. Cook until the skin is crisp and golden, 8 to 10 minutes. Turn the chicken skin-side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the skillet in the oven and roast about 20 minutes, or until a thermometer registers 170 degrees in the thickest part of the thigh. Sprinkle with juice from half a lemon, shower with more pepper and allow to rest 10 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1017689-ruth-reichls-chicken-diavolo"}