{"@context": "http://schema.org", "@type": "Recipe", "name": "Frogmore Stew", "description": "Frogmore Stew, often called a Lowcountry boil, is open to great variation. The essentials are the freshest shrimp you can find, preferably from the southeastern Atlantic coast or the Gulf of Mexico. You will also need kielbasa or similar sausage, and corn on the cob. Ben Moïse, a South Carolinian who has been making it the same way more than 30 years, insists on only those three ingredients, and employs frozen three-inch cobs from the supermarket. Fresh corn works as well, and you can add new potatoes, onions or other vegetables for “gilding the lily,” as he says. Serve the stew with beer, coleslaw and a ketchup-based cocktail sauce heavy with horseradish and lemon. This recipe can easily be adjusted for more or fewer people.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2015/07/01/dining/01BOIL1/01BOIL1-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 173}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 777, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "2 grams", "proteinContent": "55 grams", "saturatedFatContent": "14 grams", "sodiumContent": "2223 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 ears fresh corn on the cob, or 12 3-inch frozen cobettes", "1 1/2 cups Old Bay or other commercial shrimp boil seasoning", "2 pounds kielbasa or similar sausage (about 5 ounces per person)", "2 1/2 pounds fresh 36- to 40-count shrimp in the shell, heads removed (about 6 ounces per person)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using fresh corn, shuck and remove silks. Trim ends and break into halves. If using cobettes, keep frozen until cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a pot with water; it should be large enough to hold twice the volume of water as of  ingredients. Add 1 cup of the seasoning and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sausage and corn, stir and bring back to a boil. Cook for 8 minutes. Add the shrimp and cook for 2 1/2 minutes, whether the water is boiling or not. Drain and then pour the shrimp, corn and sausage into a large bowl or onto an outdoor table covered with newspaper, sprinkling evenly with the remaining seasoning."}], "link": "https://cooking.nytimes.com/recipes/1017498-frogmore-stew"}