{"@context": "http://schema.org", "@type": "Recipe", "name": "Tamales Verdes", "description": "These chicken tamales, drenched in tomatillo salsa, are a staple of the Christmas tamale season of Argelia Vergara, a Staten Island resident who makes them to celebrate the Feast of Our Lady of Guadalupe. The recipe is labor-intensive, so enlist helpers in the kitchen to wrap the tamales in corn husks. The result is well worth the effort.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/12/07/magazine/07feasts13/07feasts13-articleLarge-v3.jpg", "totalTime": "PT1H45M", "recipeYield": "About 50 tamales.", "recipeCuisine": "mexican", "recipeCategory": "dinner", "keywords": "chicken breast, corn husk, tomatillo, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 46}, "recipeIngredient": ["50 to 60  dried corn husks, or as needed", "1 pound tomatillos, husks removed", "5 to 6  jalapeño peppers", "1 quart chicken broth", "1 teaspoon teaspoon salt", "2 clove garlic", "1/4  onion, sliced", "1/2 teaspoon whole cumin seeds", "2 tablespoons lard", "1 pound boneless, skinless cooked chicken breasts, shredded", "1  4.4-pound bag Maseca tamale mix", "4 cup lard, approximately 1 1/2 pounds, melted", "1 teaspoon baking powder", "1 tablespoon salt", "2 quarts chicken broth."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the filling, place husks in a large bowl. Add water to cover, and set aside to soften."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan, combine the tomatillos, jalapeño peppers and chicken broth. Bring to a boil, and cook until tender, about 5 minutes. Transfer to a blender, and add salt, garlic, onion and cumin. Blend until puréed. Return the mixture to the pot, and place over medium heat. Add the lard, cook for 5 to 7 minutes until fully melted, then remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the masa, combine the masa mix with the melted lard, baking powder, salt and chicken broth in a large bowl. Knead dough until soft, 10 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish and steam: Fill the bottom of a steamer with about 2 inches of water. Line the bottom of the insert with a layer of corn husks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a corn husk, place about a handful of masa. Spread with 3 tablespoons of the sauce and some shredded chicken. Fold in the sides of each husk, and fold the pointed side up, leaving one end open. Repeat with remaining ingredients. Stand the filled husks in the steamer with the open ends up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the tops with a layer of additional corn husks, and cover the pot tightly with foil and a lid. Steam until the tamales release easily from the husks, 45 minutes to 1 hour; add water to the bottom of the pan as necessary so it doesn’t run dry, and be careful not to overcook."}], "link": "https://cooking.nytimes.com/recipes/1017036-tamales-verdes"}