{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Wild Mushrooms", "description": "When I was in Paris recently, wild mushrooms – cèpes (porchinis) in particular – seemed to be on every restaurant menu. It was the season. Inspired, I went to the market and bought a small amount of wild mushrooms – some girolles, oyster mushrooms and others (but not cèpes, which were out of my price range). In fact they were all pretty much out of my price range, as they often are here. But I didn’t need too many to make enough pan-seared mushrooms for a few unforgettable bruschetta. You can also serve them over a bowl of quinoa or other grains, with strips of egg pancake scattered over the top. The pan-seared mushrooms take only about 10 minutes to cook; make sure the pan is nice and hot when you add them so that they sear right away. Once they have begun to sweat you can turn down the heat a bit and add the other ingredients.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/02/science/01recipehealthmushroom/01recipehealthmushroom-articleLarge.jpg", "totalTime": "PT12M", "recipeYield": "4 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, lunch, snack", "keywords": "fall, kosher, nut-free, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 395, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "8 grams", "proteinContent": "16 grams", "saturatedFatContent": "5 grams", "sodiumContent": "589 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons plus 2 teaspoons extra virgin olive oil", "1 pound wild mushrooms, torn into smaller pieces if large, cleaned if necessary", "1/2 cup chopped onion or 2 shallots, minced", "2 garlic cloves, minced, plus 1/2 garlic clove, intact", "1 teaspoon minced fresh thyme leaves, chopped", "1 teaspoon minced fresh rosemary or sage", "Salt and freshly ground pepper", "1/4 cup dry white wine", "8 thick slices country bread or 2 to 3 cups cooked quinoa", "2 ounces Parmesan, crumbled or grated", "2 eggs", "Chopped flat-leaf parsley for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon olive oil in a wide, heavy nonstick skillet or a wok over high heat. Add mushrooms. Let sear without moving for about 30 seconds, then toss and stir in the pan until they begin to sweat, 2 to 3 minutes. Turn heat to medium, add another tablespoon oil and onion or shallots and cook, stirring, until just tender, 3 to 5 minutes. Add minced garlic, thyme and rosemary or sage. Season with salt and pepper and continue to cook over medium heat until mushrooms are soft, about 5 more minutes. Add wine and cook, stirring, until it is no longer visible in the pan. Taste and adjust seasoning. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat 1 of the eggs in a small bowl and season with salt and pepper. Heat an 8-inch nonstick omelet pan over medium-high heat until hot. Add 1 teaspoon olive oil, swirl pan, then add egg and swirl pan to coat evenly. Shake and tilt the pan and lift the edges of the egg pancake with a rubber spatula to allow egg to run underneath itself. When just about set flip over to briefly cook any runny egg on top, then transfer to a plate. Repeat with remaining egg. Cut egg pancakes into strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For bruschette, lightly toast bread and brush with olive oil. If desired, rub with a cut clove of garlic. Top with mushrooms. Sprinkle on Parmesan and egg strips, garnish with chopped parsley, and serve. For quinoa bowls, spoon quinoa into wide bowls and top with mushrooms. Sprinkle on Parmesan and egg strips. Garnish with chopped parsley, and serve."}], "link": "https://cooking.nytimes.com/recipes/1017019-seared-wild-mushrooms"}