{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Pepper Rice, Bulgur or Freekeh With Saffron and Chile", "description": "This mildly spicy Lenten vegetable rice is prettiest when made with rice, because the saffron will have more of an impact on the color. But I also love it with bulgur, and especially with freekeh, which is very compatible with the peppers, chile and paprika. If you make it with rice, remember that in the traditional Greek dish the rice is very soft, as it is here. If you don’t want the dish to be spicy leave out the chile pepper.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/02/25/science/recipehealthsaffron/recipehealthsaffron-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6", "recipeCuisine": "greek", "recipeCategory": "dinner, vegetables", "keywords": "dairy-free, gluten-free, halal, low-carb, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, spring, winter, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 39}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 234, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "639 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["Generous pinch saffron", "1/4 cup extra virgin olive oil", "1 medium onion, chopped", "2 garlic cloves, minced", "2 large red bell peppers (3/4 to 1 pound), seeded and cut in very small dice", "Salt to taste", "1 small dried red chile, minced or crushed, or 1/2 teaspoon red pepper flakes", "1 teaspoon sweet paprika", "Freshly ground black pepper to taste", "1 14-ounce can chopped tomatoes, drained", "1 cup coarse basmati rice or long grain rice, rinsed several times, or 1 cup coarse bulgur or freekeh", "2 cups water", "1/4 cup chopped fresh parsley", "2 tablespoons chopped fresh marjoram (more to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub saffron between your fingers and place in a small ramekin. Cover with 1 tablespoon hot water. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons olive oil over medium heat in a deep, lidded skillet or a wide, lidded saucepan. Add onion and cook, stirring often, until tender, about 5 minutes. Add garlic and cook and stir until fragrant, about 30 seconds. Add peppers and a generous pinch of salt and cook, stirring often, until tender, about 5 minutes. Add chile, paprika, tomatoes and salt and pepper to taste and cook, stirring often, for about 5 minutes, until tomatoes have cooked down and softened a bit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add rice, bulgur or freekeh and stir to coat with tomato mixture. Add saffron with its soaking water, water, more salt to taste, parsley and marjoram, and bring to a boil. Cover, reduce heat to low and simmer 20 minutes, or until water has been absorbed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat, uncover and place a towel across the top of the pan. Return lid and let sit for 10 minutes. Serve hot, with remaining olive oil drizzled over the top."}]}