{"@context": "http://schema.org", "@type": "Recipe", "name": "Fesenjan", "description": "This rich, tangy Iranian chicken stew from Azita Houshiar is a highlight of the Persian holiday Shab-e Yalda, a winter-solstice tradition that predates Islam by thousands of years. The chicken is drenched in pomegranate molasses and cooked with a copious amount of ground walnuts, which results in a gravy that is sweet, tart and thick with flavor.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/12/07/magazine/07feasts19/07feasts19-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings.", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, soups and stews", "keywords": "chicken breast, pomegranate molasses, walnut, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 285}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1073, "unsaturatedFatContent": "48 grams", "carbohydrateContent": "79 grams", "cholesterolContent": null, "fatContent": "63 grams", "fiberContent": "5 grams", "proteinContent": "54 grams", "saturatedFatContent": "10 grams", "sodiumContent": "1031 milligrams", "sugarContent": "69 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds (6 to 8 pieces) skinless, boneless chicken breast halves and thighs", "Salt and freshly ground black pepper", "2 tablespoons olive oil", "4 cups shelled walnuts (about 1 pound)", "1 medium onion, finely diced", "2 cups pomegranate molasses, or as needed", "1/2 cup grated butternut squash", "1/4 teaspoon cinnamon", "1/4 teaspoon saffron, dissolved in 2 tablespoons hot water", "1 to 2 cups chicken broth or water", "2 tablespoons sugar, or to taste", "Persian steamed white rice, for serving."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350. Lightly season chicken with salt and pepper, and sauté in olive oil until lightly golden. Remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread walnuts on a baking sheet, and bake until toasted, about 5 minutes. Once cool to the touch, rub walnut pieces between your palms to shed excess skin. Pulse in a food processor until finely chopped but not pasty. Transfer to a Dutch oven, and add onion and 2 cups water. Place over medium-low heat and simmer, partly covered, stirring it occasionally, for 20 minutes. Add 2 cups pomegranate molasses, sautéed chicken, squash, cinnamon, saffron mixture and 1 cup chicken broth or water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust flavor with sugar, salt and pomegranate molasses, so it is tangy but also a bit sweet. Simmer gently, covered, until the sauce is a dark walnut color with a layer of oil on the surface, 35 to 40 minutes. If the pan looks dry, add additional broth or water as needed. Adjust flavors again, and stir so the walnut oil is well mixed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the mixture to another gentle boil with the lid ajar, then continue to simmer on low heat until the sauce has thickened and the chicken is cooked through, 10 to 20 minutes. Make a final taste test, and adjust flavors to your liking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, stir so that the walnut oil is evenly absorbed. Serve hot with Persian steamed white rice."}], "link": "https://cooking.nytimes.com/recipes/1017040-fesenjan"}