{"@context": "http://schema.org", "@type": "Recipe", "name": "Brisket With Horseradish Gremolata", "description": "This tender, deeply flavored brisket gets its character from two distinct sources. Searing the meat until dark brown gives the sauce a caramelized, intensely brawny taste, while a bracing garnish of fresh horseradish gremolata spiked with parsley and lemon zest adds brightness and a sinus-clearing bite. Make the meat a few days ahead, it only gets better as it rests. But to get the most out of the gremolata, don’t grate the horseradish until an hour or two before serving. If you can’t find fresh horseradish, use 4 cloves minced garlic instead.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/03/18/multimedia/clark-brisket/clark-brisket-mediumThreeByTwo440.jpg", "totalTime": "PT4H", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "brisket, horseradish, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 625}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 648, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "2 grams", "proteinContent": "37 grams", "saturatedFatContent": "19 grams", "sodiumContent": "730 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 (4- to 5-pound) brisket, preferably second cut", "1 tablespoon kosher salt", "1 1/2 teaspoons black pepper", "4 garlic cloves, chopped", "6 sprigs fresh thyme", "2 tablespoons extra-virgin olive oil", "2 large onions, thinly sliced", "2 large carrots, sliced into thin rounds", "2 large celery stalks, diced", "1 1/2 cups dry red wine", "2 whole bay leaves", "1 1/2 cups parsley, coarsely chopped", "Grated zest of 1 small lemon", "3 tablespoons fresh, coarsely grated horseradish", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season brisket all over with salt and pepper. Place brisket in a large container and spread garlic and thyme sprigs all over top and bottom of meat. Cover and refrigerate overnight or for at least 4 hours. Let meat stand at room temperature for 30 minutes before cooking. Wipe off the garlic and thyme. Heat oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a very large Dutch oven over high heat. Add oil and let heat. Add brisket and sear, without moving, until golden brown, about 4 to 5 minutes per side. (Cut meat into 2 chunks and sear in batches if it doesn’t fit in the pot in a single layer.) Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onions, carrots and celery to pot and reduce heat to medium-high. Cook vegetables, tossing occasionally, until onions are golden brown around the edges and very tender, about 15 minutes. Pour in wine and scrape up any browned bits from the bottom of the pot. Stir in bay leaves and bring liquid to a simmer; let simmer for 5 minutes to reduce slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place meat in pot, then cover pot and transfer to oven. Cook, turning every 30 minutes, until meat is completely fork tender, 3 to 4 hours. After 2 1/2 hours, uncover pot so some of the liquid can evaporate and the sauce can thicken. If the brisket starts to get too brown and the sauce too reduced before the meat is tender, cover pot again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon fat from the top before serving. (If you have time, let brisket cool completely first, then refrigerate overnight in the pot; this makes it easier to remove the white fat from the top. Reheat the meat, covered, in a 350-degree oven for 30 to 45 minutes.) If sauce seems thin, remove meat from pot and bring liquid to a simmer. Let cook until reduced to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, toss together parsley, lemon zest and horseradish to make gremolata. Slice meat against the grain and serve with the sauce, garnished with horseradish gremolata and sea salt."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Braised Brisket", "description": "Melissa Clark braises brisket and pairs it with a bright horseradish gremolata.", "thumbnailUrl": "https://static01.nyt.com/images/2015/03/18/multimedia/clark-brisket/clark-brisket-mediumThreeByTwo440.jpg", "uploadDate": "2015-03-24T18:58:41.000Z", "duration": "PT2M28S"}, "link": "https://cooking.nytimes.com/recipes/1017312-brisket-with-horseradish-gremolata"}