{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Chip Hamantaschen", "description": "This tricorner pastry is as closely linked to Purim, a Jewish holiday which celebrates the Jews’ deliverance from a plot to kill them by Haman, as matzos are to Passover. Fillings of poppy seeds, nuts and dried fruits used to be as exciting as these Eastern European sweets got. But these days, unconventional fillings like marzipan, sour apple, dates with sweet red wine and cinnamon, and halvah are not uncommon. Here, a version for chocolate lovers.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2016/02/17/dining/17COOKING-HAMANTASCHEN3/17COOKING-HAMANTASCHEN3-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "About 30 cookies", "recipeCuisine": "jewish", "recipeCategory": "cookies and bars", "keywords": "chocolate chips, purim, dessert, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 214}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 147, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "5 grams", "sodiumContent": "13 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup confectioners’ sugar", "2 large egg yolks", "8 ounces unsalted butter at room temperature, in small pieces", "Grated zest of 1 lemon", "2 1/4 cups all-purpose unbleached flour", "Dash of salt", "1 large egg, beaten, for the glaze", "3 egg yolks", "1/4 cup sugar", "1 1/4 tablespoons cornstarch", "2 teaspoons unsweetened cocoa powder", "3/4 cup milk", "1/2 vanilla bean, split lengthwise", "2 ounces bittersweet chocolate, roughly chopped", "2 1/2 ounces semisweet chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the confectioners’ sugar and the egg yolks in a food processor and blend. Add butter and lemon zest and process to blend. Gradually add the flour and the salt, pulsing until it forms a ball. Divide the dough in half, flatten each into a disk, wrap tightly in plastic wrap. Chill until firm, at least 1 hour or up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the filling: In a bowl, beat the egg yolks, sugar, cornstarch and cocoa powder until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the milk into a small saucepan with the vanilla bean. Over medium heat, bring to a simmer, then remove from heat and remove the vanilla bean. Scrape the inside of the bean and add to the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While whisking vigorously, pour 1/3 of the milk into the yolk mixture, then pour back into the saucepan. Continue to whisk constantly while simmering over low heat until the mixture bubbles and thickens into a creamy pudding consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat, add the bittersweet chocolate and whisk until the chocolate has melted and the cream is smooth. Pour into a clean bowl and cover with plastic wrap, placed directly on the cream. Refrigerate until cool, at least 30 minutes. Fold in the chocolate chips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Line 2 pastry sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unwrap one of the chilled dough disks and place on a piece of parchment paper that has been dusted lightly with flour. Lightly dust the top of the dough with flour. Cover with a second piece of parchment paper. Let stand at room temperature until malleable, about 5 minutes. Use a rolling pin to press and roll out the dough into a 1/4-inch- thick round between the sheets of parchment, flipping the dough occasionally. Use a plain biscuit or cookie cutter or glass to cut 3-inch circles, placing the circles on the prepared baking sheet spaced 1 inch apart. Place the baking sheet in the refrigerator to chill until firm while you repeat the rolling/cutting process with the second round of dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the first pan of dough rounds from the refrigerator. Place a heaping teaspoon of the filling in the center of each, and press up the sides to form triangles, pinching the ends closed. Top the filled cookies with a few extra chocolate chips. If the dough is too firm, let stand a minute or two to soften; returning the baking sheet to the refrigerator if the dough becomes too soft. Repeat with the remaining dough rounds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the tops with beaten egg. Bake until golden and dough is delicately firm all the way through, about 13-18 minutes, rotating the racks front to back and top to bottom after about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place trays on wire racks for 10 minutes before transferring cookies on parchment to racks to cool completely."}], "link": "https://cooking.nytimes.com/recipes/1017996-chocolate-chip-hamantaschen"}