{"@context": "http://schema.org", "@type": "Recipe", "name": "Lost-and-Found Lemon Poundcake", "description": "The South has about as many poundcake recipes as there are grandmothers. This one produces a higher, lighter cake than many recipes. It came from Dora Charles’s aunt Laura Daniels, who got it from a nursing-home patient she was working with in the 1970s. The patient,  Mary Martin, mailed it to her long after she left the nursing home, but because of a stroke, her handwriting was shaky. Ms. Charles found the recipe and deciphered it. You can use lemon juice and zest instead of lemon flavoring, which the original recipe called for, or increase the vanilla by a teaspoon if you are leaving out the lemon altogether. The cake, which is a perfect base for peaches and whipped cream or another fruit topping, gets better after a couple of days and will be good for a week if you keep it well wrapped. It freezes well, too.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2015/09/02/dining/02DORAWEB6/02DORAWEB6-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "16 to 20 servings", "recipeCuisine": "southern", "recipeCategory": "cakes", "keywords": "cake flour, sour cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 302}, "recipeIngredient": ["Baking spray", "1 pound/454 grams good-quality butter", "1 pound/4 cups/460 grams confectioners' sugar", "1 cup sour cream", "2 tablespoons vanilla extract", "1 tablespoon lemon extract, or 1 tablespoon lemon juice plus the finely grated zest of one lemon", "3 cups/360 grams Swans Down or other cake flour", "1/2 teaspoon/4 grams baking soda", "8 large eggs, separated while cold, then brought to room temperature", "Confectioners’ sugar, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees. Generously spray a heavy 10-inch Bundt or straight-sided angel food cake pan with baking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the large bowl of an electric mixer, cream butter on medium speed until light and fluffy. Slowly add confectioners’ sugar and beat for several minutes, until the mixture is satiny. Add sour cream, vanilla and lemon flavoring and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift the flour and baking soda. Add 1 cup of the flour mixture to the butter mixture and mix well. Mix in half the egg yolks, followed by another cup of flour, then the remaining yolks and finally the rest of the flour. Do not overmix or the cake will be tough. Scrape down the sides of the bowl and the beaters and do the final mixing by hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat the egg whites to stiff peaks. Gently add the whites to the batter, folding them in with a wooden spoon or a rubber spatula and barely mixing everything together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the batter evenly into the pan, rotating it as you go and twisting it to level the batter. Rap the pan sharply on the countertop about 30 times, rotating the pan slightly each time, to eliminate any air pockets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 30 minutes. If the cake is getting too brown on top, turn the oven down to 300 degrees, then test again in 15 minutes. The cake is done when the top springs back when lightly touched and a toothpick inserted into the center comes out clean, about 45 minutes to 1 hour in all. Be careful to not underbake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool on a rack until the pan is easily handled. Run a knife around the rim and center tube and invert the cake onto the rack to cool completely. Transfer the cake to a serving plate or a cake stand. Dust with confectioners' sugar."}], "link": "https://cooking.nytimes.com/recipes/1017641-lost-and-found-lemon-poundcake"}