{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon in Fig Leaves", "description": "While this salmon dish evokes pure summer in California, it’s easily done almost anywhere. The salmon is king salmon, and its season is summer, which coincides perfectly with the ripening of figs in all but the northernmost parts of the country. There is nothing better than a good fig, but for this recipe, incorporate the underused leaves, which make a perfect package for the fish, contributing a kind of nutty flavor to it.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/07/19/magazine/19eat1/19mag-19eat-t_CA0-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "american, french", "recipeCategory": "dinner, easy, lunch, quick", "keywords": "dairy-free, gluten-free, halal, high protein, low sugar, paleo, king salmon, fig leaves, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 94}, "recipeIngredient": ["1 2-pound king-salmon fillet, skinned", "Olive oil", "Salt and pepper", "8 large fig leaves", "Fennel fronds, preferably wild"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350. Cut the salmon into 6 equal portions. Coat lightly with olive oil, and season with salt and freshly ground pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the fig leaves, and leave them moistened. Place 4 on a baking sheet, and lay the salmon pieces on top. Scatter small \npieces of fennel frond on top of the fish, and cover with the remaining fig leaves. Bake in the upper part of the oven until the fish is just cooked through, 10 to 12 minutes, then transfer the salmon to a serving platter immediately. Serve with blanched new potatoes and green beans, tomatoes, cucumber, hard-cooked eggs and aioli."}], "link": "https://cooking.nytimes.com/recipes/1017549-salmon-in-fig-leaves"}