{"@context": "http://schema.org", "@type": "Recipe", "name": "Moussaka With Roasted Mushrooms", "description": "In this Balkan style Moussaka I have substituted the <a href=\"http://cooking.nytimes.com/recipes/1017259-roasted-mushroom-base\">roasted mushroom mix</a> for half the meat. But you can also make a vegetarian version with no meat at all. It is delicious either way, with a complex, slightly sweet Eastern Mediterranean sauce spiced with a little cinnamon, a pinch of allspice and a few cloves. Greek moussaka is topped with béchamel, which can be heavy, even gummy. But this one has a light, fluffy topping made with yogurt and eggs. There are a few steps involved here and the sauce is a long-cooking one, but you can get that started while the eggplant is roasting in the oven to speed things along or make the sauce the day before.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/03/04/science/recipehealthmoussaka/recipehealthmoussaka-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "Serves 8 generously", "recipeCuisine": "greek", "recipeCategory": "dinner, vegetables", "keywords": "fall, spring, summer, gluten-free, halal, high fiber, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 300}, "recipeIngredient": ["2 to 2 1/2 pounds (3 medium or 2 large) eggplant", "Salt", "2 tablespoons extra virgin olive oil", "1/2 pound minced or ground lamb or lean beef", "2 tablespoons extra virgin olive oil", "2 medium onions, finely chopped", "2 to 4 large garlic cloves, minced (to taste)", "1/2 pound <a href=\"http://cooking.nytimes.com/recipes/1017259-roasted-mushroom-base\">roasted mushroom mix</a>, or for a vegetarian version 1 pound", "2 pounds tomatoes, peeled and chopped, with juice, or 1 28-ounce can, pulsed in a food processor with juice", "1/2 teaspoon sweet paprika", "1/4 rounded teaspoon ground cinnamon", "3 cloves, ground", "Pinch of allspice (2 or 3 berries), ground", "1/2 teaspoon sugar", "1 bay leaf", "1/2 to 1 cup hot water", "Salt to taste", "freshly ground pepper to taste", "1/2 cup chopped flat-leaf parsley", "1 egg, beaten", "4 eggs, beaten", "1 1/4 cups plain Greek yogurt", "pinch of  Salt", "pinch of  pepper", "pinch of paprika", "1/2 cup freshly grated Parmesan, kefalotyri or kashkaval cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees with racks positioned in the middle and lower third. Slice eggplants lengthwise, about 1/3 inch thick. Line 2 baking sheets with foil and brush foil with olive oil. Place slices on the foil, season to taste with salt, and brush with olive oil. Place in oven and roast until soft and browned in spots, about 20 minutes, switching the pans top to bottom after 10 minutes. When done slices will look dry on the surface but when you pierce them with a knife you should be able to see that the flesh is soft.  Remove from oven and carefully fold foil up over eggplant to make a foil packet, taking care not to burn yourself. It doesn’t matter if the eggplant slices pile onto each other. Crimp edges of foil so that eggplant is sealed in the packet and leave to steam inside foil for 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile make the meat and tomato filling. In a large, deep skillet or casserole heat olive oil over medium heat and add onions. Cook, stirring often, until tender, about 5 minutes, and add garlic. Cook, stirring, until fragrant, about 30 seconds, and raise heat to medium-high. Stir in ground beef or lamb and brown for about 3 minutes. Stir in roasted mushroom mix, tomatoes, paprika, cinnamon, allspice, cloves, sugar, bay leaf, salt and enough water to barely cover meat. Bring to a simmer, reduce heat to low, cover and simmer 45 minutes to an hour, stirring occasionally. The mixture should be thick and very fragrant. Cook uncovered for another 5 to 10 minutes, until liquid in pan is just about gone. Remove bay leaf, taste and add salt and pepper, and remove from heat. Allow mixture to cooled slightly, then stir in 1 beaten egg and parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Oil a 3-quart baking dish or gratin dish. Make an even layer of half the eggplant slices over the bottom, and spread all of meat sauce on top in one layer. Top with remaining eggplant. Bake for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, beat together eggs and yogurt, season with salt (about 1/2 teaspoon) and stir in pepper and paprika. Pour over top of moussaka, scraping out every last drop with a rubber spatula. Sprinkle grated cheese evenly over the top. Return to oven and bake for another 25 to 30 minutes, until puffed and golden. Serve warm."}]}