{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Homemade Yogurt", "description": "Homemade yogurt is a snap to make. All you really need is good quality milk, a few spoonfuls of your favorite plain yogurt to use as a starter culture, and some time to let it sit. You can substitute low-fat milk here if you’d rather; 2 percent works a lot better than 1 percent. Skim milk will give you a thinner yogurt, though if you add some dry milk powder to the milk as it heats (about 1/2 cup), that will help thicken it. Creamline (non-homogenized milk) will give you a cream top on your yogurt. Homogenized milk is smooth throughout.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/07/18/dining/18YOGURT1/18YOGURT1-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "1 3/4 quarts", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, easy, snack, project", "keywords": "cream, milk, whole milk yogurt, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 697}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 61, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": null, "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "43 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["2 quarts whole milk, the fresher the better", "1/4 cup heavy cream (optional)", "3 to 4 tablespoons plain whole milk yogurt with live and active cultures"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub an ice cube over the inside bottom of a heavy pot to prevent scorching (or rinse the inside of the pot with cold water). Add milk and cream, if using, and bring to a bare simmer, until bubbles form around the edges, 180 to 200 degrees. Stir the milk occasionally as it heats."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pot from heat and let cool until it feels pleasantly warm when you stick your pinkie in the milk for 10 seconds, 110 to 120 degrees. (If you think you’ll need to use the pot for something else, transfer the milk to a glass or ceramic bowl, or else you can let it sit in the pot.) If you’re in a hurry, you can fill your sink with ice water and let the pot of milk cool in the ice bath, stirring the milk frequently so it cools evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer 1/2 cup of warm milk to a small bowl and whisk in yogurt until smooth. Stir yogurt-milk mixture back into remaining pot of warm milk. Cover pot with a large lid. Keep pot warm by wrapping it in a large towel, or setting it on a heating pad, or moving to a warm place, such as your oven with the oven light turned on. Or just set it on top of your refrigerator, which tends to be both warm and out of the way."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let yogurt sit for 6 to 12 hours, until the yogurt is thick and tangy; the longer it sits, the thicker and tangier it will become. (I usually let it sit for the full 12 hours.) Transfer the pot to the refrigerator and chill for at least another 4 hours; it will continue to thicken as it chills."}]}