{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef in Parchment With Olive Sauce", "description": "I’m not complaining about drinking Brunello di Montalcino, but it’s not ideal for a warm summer evening. To dress it in flip-flops, I thought of pairing it with meat served barely warm, rather than grilled. French poached boeuf à la ficelle came to mind, but who wants to simmer a vessel of stock in July? I decided to roast the meat wrapped in parchment to capture all the juices for a sauce, then serve the dish at room temperature. I had never seen a chunk of fillet cooked like that, and I worried I might sacrifice $60. Sous vide would have been an option, but it was more complicated and would take longer. My method was successful, and my sauce, made with sweet, slightly briny little olives and fresh rosemary, nicely balanced the fruity, earthy, yet still tannic wines.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2015/07/29/dining/29PAIR_web/29PAIR-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "beef fillet, niçoise olives, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 48}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 571, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "1 gram", "proteinContent": "38 grams", "saturatedFatContent": "15 grams", "sodiumContent": "572 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 pounds center-cut fillet of beef in one piece", "3 tablespoons extra-virgin olive oil", "Salt and ground black pepper", "1/2 cup minced shallots", "3/4 cup pitted niçoise olives", "1 large sprig rosemary, plus more for garnish", "1/2 cup dry red wine", "1 tablespoon Dijon mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Rub meat with 1 tablespoon oil and season with salt and pepper. Wrap securely in a large sheet of parchment paper and tie like a package with butcher’s cord so it can be opened from the top. Place in a baking dish and roast 30 minutes for medium-rare. Test at 25 minutes by inserting an instant-read thermometer into the middle of the meat, right through the paper; it should register 120 degrees; at 125 degrees it will be done. Remove from the oven and transfer meat, still wrapped, to a cutting board to rest for 30 minutes to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While meat is roasting, heat remaining oil in a skillet. Add shallots and sauté on medium-low until soft and barely starting to color. Finely chop half the olives and add them, along with the rosemary. Stir. Add wine and cook a few minutes on medium, until starting to reduce. Stir in mustard, then add whole olives. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After meat has rested at least 30 minutes, remove string from the package and carefully open the parchment so as not to lose any of the juices inside. Lift the meat out with tongs, then pour all the juices from the parchment into the skillet with the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer the sauce mixture about 5 minutes, until slightly thickened. Remove rosemary. Season with salt and pepper. Slice meat about 1/2-inch thick and arrange on a platter. Garnish with rosemary sprigs and serve sauce, just warm, alongside."}]}