{"@context": "http://schema.org", "@type": "Recipe", "name": "Next-Day Fried Greens", "description": "A good Southern kitchen relies on thrift and layers of flavor, and this dish is an example of both. Dora Charles, who put this recipe in her book, “A Real Southern Cook: In Her Savannah Kitchen,” says a lot of people she feeds won’t eat greens the first time around but love them in this dish, which uses the leftovers. You can add extra meat on the second cooking to make the dish more satisfying. Ms. Charles uses converted, or parboiled rice, but you can substitute any rice you have, including leftover Chinese takeout. Serve the greens with pepper vinegar or red pepper flakes and red wine vinegar to season at the table.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2015/09/02/dining/02DORAWEB8/02DORAWEB8-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, lunch", "keywords": "collard greens, pork neck bones, vidalia onion, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 357, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "1 gram", "proteinContent": "9 grams", "saturatedFatContent": "12 grams", "sodiumContent": "34 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound smoked pork neck bones and fresh pigs’ tails, or smoked turkey wings, or a pork chop or ham hock", "1 tablespoon Dora’s Savannah seasoning (see note)", "1 teaspoon crushed red pepper", "2 tablespoons bacon grease", "5 tablespoons unsalted butter", "1 large bunch collards, about 1 pound", "1/4 Vidalia onion, cut into half moons", "2 cups cooked white rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, bring 3 quarts of water to a boil. Add neck bones and pigs’ tails, or smoked turkey wings or pork chop or ham hock, plus Savannah seasoning, red pepper, bacon grease and 4 tablespoons of butter. Reduce the heat to medium and simmer, uncovered, for 1 hour or until the meat is tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, remove the collard stems by holding each leaf in one hand and stripping the leaf down with the thumb and index finger of the other hand. Discard the stems."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stack 7 or 8 leaves on top of one another, roll them up tight like a cigar and slice into 1/2-inch-wide strands. Repeat until you have cut all the leaves. Then wash the collards twice, shake them and drain in a large colander."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the collards to the stock, cover and simmer until they are tender. In the summer, they will cook in 45 minutes to an hour, but in winter, they will take only 30 to 45 minutes because the first frost will have tenderized them. Keep a close eye on them; you will know they are done when they are tender but not mushy. Near the end of the cooking, check the amount of liquid left in the pot. If there is too much, more than 1 cup, uncover the pot to cook down the liquid a bit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the meat from the bones and discard the bones. Return the meat to the greens and transfer to the refrigerator overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, melt the remaining 1 tablespoon butter in a skillet set over medium heat and add the onion. Cook for a few minutes until it just starts to soften, then add the greens, meat and cooked rice. There should be more greens than rice. Sauté over medium-high heat until the dish is heated through."}], "link": "https://cooking.nytimes.com/recipes/1017679-next-day-fried-greens"}