{"@context": "http://schema.org", "@type": "Recipe", "name": "Thin and Crispy Cornbread", "description": "The thick, golden wedges of cornbread served directly from a skillet that you see in glossy food magazines look nothing like the thin and crispy cornbread April McGreger’s Mississippi grandmother used to make. The ratio of crunch to tender middle here errs on the side of crunch, which makes it perfect for soaking up the delicious broth called potlikker, which comes from simmering smoked meat and greens, sometimes cooked with Southern field peas. This cornbread bakes up best in a well-seasoned 12-inch cast-iron skillet, though you can divide the batter between two smaller skillets or even cake pans. A scattering of dry coarse cornmeal in the hot skillet before you pour in the batter makes the cornbread extra crunchy. Flipping it onto a plate or rack also helps the crust stay crisp. Or you could make it thicker and cook it ahead of time, then split the slices and toast them before serving.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2015/12/30/dining/1230jpPEAS3/1230jpPEAS3-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "8 pieces", "recipeCuisine": "southern", "recipeCategory": "breads", "keywords": "bacon fat, buttermilk, cornmeal, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 72}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 233, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "3 grams", "sodiumContent": "229 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup bacon drippings or vegetable oil", "2 cups coarse cornmeal, preferably white, plus about 2 tablespoons extra for the skillet", "1 1/4 teaspoon kosher salt", "1/2 teaspoon baking soda", "1 large egg", "1 1/4 cups buttermilk, preferably whole", "1/4 cup hot tap water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 500 degrees. Add bacon drippings to a 12-inch skillet and place in the oven to warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium mixing bowl, use a whisk or fork to combine the cornmeal, salt and baking soda. Add the egg, buttermilk and water and stir well to combine. When the skillet is very hot and the bacon grease is sizzling, carefully remove from the oven and pour half the hot fat into the cornbread batter. Whisk well to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, sprinkle the hot skillet with the remaining coarse cornmeal. It should smell like popcorn. Pour the batter into the hot pan and return to the oven. Check after 20 minutes, baking until the cornbread is deep golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the hot pan from the oven and immediately flip out onto a plate. Cut into wedges."}], "link": "https://cooking.nytimes.com/recipes/1017903-thin-and-crispy-cornbread"}