{"@context": "http://schema.org", "@type": "Recipe", "name": "Lobster Butter", "description": "This is a Yankee take on the classic French recipe for beurre de homard, which incorporates cooked lobster meat into a compound butter. It is thriftier, using the shells to bring flavor instead of the lobster meat, but is no less delicious for that. The process is akin to making a lobster stock, with butter in place of water. Use the lobster butter as a melted dip for <a href=\"http://cooking.nytimes.com/recipes/1017422-chilled-shrimp-with-lobster-butter\">shrimp</a> or yet more lobster, or as a topping for sautéed scallops or fish.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/05/20/dining/20LOBSTERBUTTER/20FISHBUTTER-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "1/2 cup", "recipeCuisine": "", "recipeCategory": "dinner, lunch, dips and spreads", "keywords": "lobster, unsalted butter, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 61}, "recipeIngredient": ["Shells of cooked lobsters, crushed into small pieces", "8 tablespoons (1 stick) unsalted butter per lobster"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Put lobster shells on the largest sheet pan you can fit in the oven, and allow them to dry and roast, about 15 to 20 minutes. Remove and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt 1 stick butter per lobster in a large bowl or double boiler set over simmering water, making sure bowl does not touch the surface of water. Add lobster shells to the melted butter and simmer gently, without boiling, for about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the melted butter through a cheesecloth-lined sieve into another bowl, then set that bowl into ice to chill. Cover bowl and refrigerate to set, then skim off the top and discard any liquids. Use within a few days, or freeze for up to a few weeks."}]}