{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Pasta With Zucchini, Ricotta and Basil", "description": "A summer pasta should be simple and fresh, ideally made with vegetables straight from the garden or market. Look for the best artisanal ricotta; top-quality ingredients make all the difference here.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/06/17/dining/17KITCH1/17KITCH1-articleLarge-v3.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, quick, weeknight, pastas", "keywords": "main course, parmesan, ricotta, ziti, zucchini, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 4245}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 457, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "5 grams", "proteinContent": "19 grams", "saturatedFatContent": "6 grams", "sodiumContent": "712 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["Extra-virgin olive oil", "1 small onion, finely diced", "2 pounds zucchini, sliced into 1/4-inch-thick pieces (for larger zucchini, cut in half lengthwise before slicing)", "Salt and pepper", "2 garlic cloves, minced, or 2 tablespoons chopped green garlic", "1 ounce basil, about 2 cups loose leaves", "1 pound ziti or other dry pasta", "8 ounces ricotta, about 1 cup (<a href=\"http://cooking.nytimes.com/recipes/1015560-fresh-ricotta\">see recipe</a>)", "Pinch of crushed red pepper", "Zest of 1 lemon", "2 ounces grated Parmesan, pecorino or a mixture, about 1 cup, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a pot of water on to boil. In a large skillet over medium-high heat, cook the onions in 3 tablespoons olive oil until softened, 5 to 8 minutes. Reduce heat as necessary to keep onions from browning. Add zucchini, season generously with salt and pepper, and continue cooking, stirring occasionally until rather soft, about 10 minutes. Turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, use a mortar and pestle to pound garlic, basil and a little salt into a rough paste (or use a mini food processor). Stir in 3 tablespoons olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Salt the pasta water well and put in the pasta, stirring. Boil per package instructions but make sure to keep pasta quite al dente. Drain pasta, reserving 1 cup of cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cooked pasta to zucchini in skillet and turn heat to medium-high. Add 1/2 cup cooking water, then the ricotta, crushed red pepper and lemon zest, stirring to distribute. Check seasoning and adjust. Cook for 1 minute more. Mixture should look creamy. Add a little more pasta water if necessary. Add the basil paste and half the grated cheese and quickly stir to incorporate. Spoon pasta into warm soup plates and sprinkle with additional cheese. Serve immediately."}]}