{"@context": "http://schema.org", "@type": "Recipe", "name": "English Peas With Grilled Little Gems, Green Garlic and Mint", "description": "A dish from the restaurant Camino in Oakland is the inspiration of this recipe. Experiment with a little chicken stock and pasta added to the pea stew, if you like.\n\n<a href=\"http://cooking.nytimes.com/68861692/996744-spring-recipes\">More spring recipes.</a>", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/03/18/dining/18SPRING1/18SPRING1-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "for two, quick, salads and dressings, vegetables", "keywords": "english peas, green garlic, lettuce, mint leaves, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 32}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 93, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "0 grams", "sodiumContent": "315 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 to 3 stalks green garlic (or use 2 cloves garlic)", "2 heads Little Gem lettuce", "Olive oil", "Salt and black pepper", "1 1/2 cups shelled English peas", "Handful of spearmint or Persian mint leaves, torn or roughly chopped into large pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a wood or charcoal grill for direct-heat grilling, or use a grill pan on top of the stove. Trim the tops of the green garlic where the leaves begin to branch out. Peel an outside layer of the stalks and slice thinly on the bias. Or very thinly slice the garlic cloves. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the lettuce in quarters lengthwise and brush all over with olive oil; season with salt and pepper. Place the lettuce cut-side down on the grill and cook until it has darkish grill marks, 2 to 3 minutes. Flip lettuce quarters to  the other cut side and grill for another couple of minutes, then grill on the leafy side briefly. Remove from grill when done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 cup water, a splash of olive oil and a pinch of salt in a large skillet over high heat. When the liquid is at a roaring boil, add the peas and garlic and cook, tasting often for seasoning and adding more water as needed, 3 to 8 minutes, or until the peas are just tender. Add the mint leaves and cook 1 minute. The goal is to have just enough water at the end of the cooking time to emulsify with the oil and thicken slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spread the lettuce on a platter and pour  the peas and their minty, garlicky juices over it. Serve with grilled chicken, roast duck or by itself."}], "link": "https://cooking.nytimes.com/recipes/1017300-english-peas-with-grilled-little-gems-green-garlic-and-mint"}