{"@context": "http://schema.org", "@type": "Recipe", "name": "Haitian Pork Griot", "description": "Pork griot (pronounced gree-oh) is one of Haiti’s most loved dishes, and it’s easy to see why. Big chunks of pork shoulder are marinated in citrus and Scotch bonnet chiles, then simmered until very tender before being fried crisp and brown. This recipe departs from the traditional in that instead of frying the meat, it’s broiled. The pork still gets charred edges and bronzed surface, but broiling is easier and less messy to do. However feel free to fry if the skillet calls out to you. And do make the traditional cabbage, carrot and chile pepper pickle called <a href=\"http://cooking.nytimes.com/recipes/1017277-pikliz\">pikliz</a> (pick-lees) for serving, which gives the rich meat just the right spicy-vinegar punch.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/02/28/dining/28APPE-HAITIANPORK/28APPE-HAITIANPORK-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "cane vinegar, pork shoulder, scotch bonnet, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 564}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 615, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "46 grams", "fiberContent": "2 grams", "proteinContent": "40 grams", "saturatedFatContent": "18 grams", "sodiumContent": "782 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 small Scotch bonnet or habanero chile", "1 medium onion, diced", "1 small green bell pepper, diced", "1 small red bell pepper, diced", "1/4 cup fresh chopped Italian parsley, more for serving", "1 tablespoon kosher salt, more to taste", "1 tablespoon coarsely ground black pepper", "6 sprigs fresh thyme, plus more thyme leaves for serving", "2 garlic cloves, finely chopped", "1/4 cup cane vinegar or cider vinegar", "Juice of 1 orange", "Juice of 1 lemon", "Juice of 1/2 lime", "1 tablespoon Worcestershire sauce", "3 pounds pork shoulder, not too lean, cut into 1 1/2-inch chunks", "2 tablespoons coconut oil (melted) or olive oil, more as needed", "Cooked rice, for serving", "Pikliz, for serving (<a href=\"http://cooking.nytimes.com/recipes/1017277-pikliz\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Quarter the chile and remove the seeds and membranes. Finely chop one quarter; leave the rest in whole pieces. Handle pieces carefully, preferably while wearing gloves; they are extremely hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer quartered and chopped chiles to a large Dutch oven or heavy pot with a lid. Add onion, bell peppers, parsley, salt, pepper, thyme and garlic. Stir in vinegar, orange juice, lemon juice, lime juice and Worcestershire sauce. Mix in pork. Cover pot and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, remove from refrigerator at least 1 hour and no more than 3 hours before cooking. Heat oven to 325 degrees. Place pot over high heat and bring liquid to a simmer; cover and put pot in oven. Cook, stirring occasionally, until meat is very tender, about 1 1/2 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, remove meat from pot, allowing all excess liquid to drip back into the pot and picking  any bits of vegetables or herbs off the meat. Transfer meat to a rimmed baking sheet. Drizzle meat with 2 tablespoons oil and salt to taste, and toss gently to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain braising liquid, discarding any solids. Return sauce to pot and simmer over high heat until reduced by about half, about 25 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the broiler. Broil meat, tossing occasionally, until meat is evenly browned, about 5 to 10 minutes. You want it nicely browned in spots but not so brown that it dries out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, drizzle meat with additional oil and top with sauce, parsley and thyme leaves. Serve on a bed of rice with pikliz on the side."}], "link": "https://cooking.nytimes.com/recipes/1017276-haitian-pork-griot"}