{"@context": "http://schema.org", "@type": "Recipe", "name": "Béarnaise Sauce", "description": "Béarnaise sauce is a piquant child of hollandaise, one of the so-called mother sauces of French cuisine. It is simply an emulsification — egg yolks and butter cut through with vinegar flavored with tarragon and shallots, with a bite of black pepper. Think of it as a loose mayonnaise, requiring only plenty of whisking and a careful hand with the heat to master. You don’t need the clarified butter many recipes call for — a good unsalted butter, melted, works just fine. Apply the sauce to steaks or burgers, asparagus or salmon. The sauce’s richness improves virtually everything it touches.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/05/10/magazine/10eat/10mag-10eat-t_CA0-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "sauces and gravies", "keywords": "egg yolks, shallot, white wine vinegar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 325}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 340, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "23 grams", "sodiumContent": "175 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["1/4 cup white-wine vinegar", "1 small shallot, peeled and minced", "1/2 teaspoon freshly cracked black pepper", "1 tablespoon plus 1 teaspoon chopped tarragon leaves", "2 egg yolks", "12 tablespoons unsalted butter, melted", "Kosher salt, to taste", "Splash of lemon juice, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the vinegar, shallots, black pepper and 1 tablespoon of tarragon leaves into a small saucepan, and set over a medium flame. Bring just to a boil, and then reduce heat to a simmer until there are only a few tablespoons of liquid left, approximately 5 minutes. Remove from heat, and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a small saucepan with an inch or two of water, and set over medium-high heat to boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the cooled shallot-and-tarragon mixture into a metal mixing bowl along with a tablespoon of water and the egg yolks, then whisk to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat under the saucepan of water down to its lowest setting, and put the bowl on top of the pan, making sure that it does not touch the water directly. Continue to whisk the yolks until they thicken, approximately 5 to 7 minutes. You should just about double the volume of the yolks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly beat in the butter, a tablespoon or two at a time, whisking slowly to combine and emulsify. Remove the bowl from the pan occasionally, so as not to overcook the eggs, and taste the sauce. Season with salt. If the flavor is not sharp enough, add a splash of lemon juice. If the sauce is too thick, stir in a splash of hot water. Add the remaining teaspoon of tarragon leaves, and serve."}], "link": "https://cooking.nytimes.com/recipes/1017389-bearnaise-sauce"}