{"@context": "http://schema.org", "@type": "Recipe", "name": "Walnut Tart", "description": "If you seek inspiration for a better pie, you need look no further than a traditional French walnut tart. It is only marginally different, but vive that difference. The reason is butter: butter in the crust and butter in the filling. Oh, and cream in the filling, too. If they had pecans in France I’m sure they would use them, as you could in this recipe.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/08/19/dining/walnut-tart/walnut-tart-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "8 to 12 servings", "recipeCuisine": "french", "recipeCategory": "pies and tarts", "keywords": "dessert, pie crust, walnut", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 114}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 494, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "11 grams", "sodiumContent": "225 milligrams", "sugarContent": "31 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 stick butter, more for smearing foil", "1 unbaked pastry shell in a 9-inch pie pan", "1 1/2 cups sugar", "1/2 cup cream", "2 1/2 cups roughly chopped walnuts (there should be large chunks)", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Tear off a piece of foil twice as large as crust. Fold it in half and smear it with butter; lay buttered side onto crust. Weight foil with a pile of dried beans or rice (these can be reused for this purpose), pie weights, or a tight-fitting ovenproof skillet or saucepan — anything that will sit flat on the surface. Bake 12 minutes, then remove foil and continue to bake at 350 degrees, until crust is a beautiful shade of brown, another few minutes. Remove and let cool on a rack while you prepare filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put sugar in a heavy 6- or 8-inch saucepan or deep skillet with a tablespoon of water and turn heat to medium. Cook, gently shaking pan occasionally, until sugar melts; then cook, stirring occasionally and scraping sides with a heat-proof flexible spatula, until mixture turns golden."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat to low, then carefully add butter and cream. Cook, stirring constantly, until butter melts and mixture is uniform. Stir in walnuts and a large pinch of salt if you like, then spread on crust. Refrigerate for about an hour, then sprinkle with a little more salt and serve."}]}