{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Smashed Cucumbers With Lime, Honey and Croutons", "description": "Smashing cucumbers instead of slicing them gives the flesh an appealing rough surface, the better to bond with any dressings you dream up. In this salad, from the Manhattan restaurant Superiority Burger, the cold crunchy cucumbers are bound in a creamy lime-spiked yogurt that the chef who invented it, Julia Goldberg, calls “fiercely acidic.” It’s a great combination, and the sweet heat of chile honey and crunch of breadsticks make each mouthful interesting. At Superiority Burger, nutty brown rice is added to the salad for yet another dimension of flavor and texture; the effect is like a rich chicken salad or egg salad, but this is vegetarian and more nutritious over all.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/08/18/dining/18CUKE/18CUKE-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "cucumber, lime, sesame breadstick, yogurt, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 137}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 90, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "485 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["About 2 pounds thin-skinned cucumbers like English or Persian (8 to 10 mini cucumbers, 4 medium-size or 2 large greenhouse)", "Kosher salt", "Raw or granulated sugar", "1/2 cup Greek-style plain yogurt", "Freshly grated zest and juice of 1 lime", "1 tablespoon rice wine vinegar", "2 tablespoons extra-virgin olive oil, more for drizzling", "1/4 teaspoon black pepper, more to taste", "4 scallions, minced", "1/2 teaspoon hot sauce", "1 tablespoon honey", "2/3 cup lightly crushed sesame breadsticks (crush breadsticks in a sealed plastic bag to the size of small croutons)", "Olive oil, for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse cucumbers and pat dry. Cut crosswise into pieces about 4 inches long.  Cut each piece in half lengthwise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a work surface, place a piece of cucumber (or several) cut side down. Lay the blade of a large knife flat on top the cucumber and smash down lightly with your other hand. The skin will begin to crack, the flesh will break down and the seeds will separate. Repeat until the whole piece is smashed. Break or slice diagonally into bite-size pieces, leaving the seeds behind."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cucumber pieces in a strainer and toss with a big pinch of salt and a big pinch of sugar. Place a plastic bag filled with ice on top of the cucumbers to serve as a weight and place the strainer over a bowl. Let drain 15 to 30 minutes on the counter, or in the refrigerator until ready to serve, up to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: In a bowl, mix yogurt, lime zest and juice, vinegar, oil, 1/2 teaspoon salt and the pepper. This mixture should taste fiercely acidic and quite salty; add salt and vinegar as needed. Keep refrigerated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If making the spicy honey, combine hot sauce and honey in a small bowl and stir well until smooth. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If making the croutons, toast the breadstick pieces in a toaster oven or skillet. Drizzle with olive oil and stir occasionally, until golden and crunchy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, shake cucumbers well to drain off any remaining liquid and transfer to a bowl. Drizzle lightly with olive oil and toss. Add scallions and half of the dressing and toss gently. Keep adding dressing until cucumbers are well coated but not drowned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately. For each serving, scoop a large spoonful of cucumbers into a bowl, drizzle with spicy honey and sprinkle with a handful of croutons."}], "link": "https://cooking.nytimes.com/recipes/1017630-spicy-smashed-cucumbers-with-lime-honey-and-croutons"}