{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoked Salmon Tart for a Crowd", "description": "This is an easy but elegant cocktail snack to serve year round, but it’s especially nice during the holiday season as a reward for bearing up with frigid winter weather. Essentially, it’s a large buttery cracker, garnished with smoked salmon and cut up like a pizza. The pastry rounds may be baked ahead and left at room temperature. Assembling one tart at a time is the best way to keep everything looking and tasting freshly made. The recipe makes four 8-inch tarts; if you need less, consider making a half batch or freezing some of the dough for future use.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/12/10/dining/10KITCHEN1/10KITCHEN1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 tarts, each serving 2 to 4 people", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, crème fraîche, smoked salmon, trout roe", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 351}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 693, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "69 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "4 grams", "proteinContent": "17 grams", "saturatedFatContent": "22 grams", "sodiumContent": "675 milligrams", "sugarContent": "6 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 cups/310 grams all-purpose flour", "1/2 teaspoon baking powder", "Kosher salt", "4 ounces/1 stick/120 grams unsalted butter, cold and cut in half-inch chunks", "2 egg yolks, beaten with enough ice water to make 1/2 cup", "8 ounces/1 cup/240 milliliters crème fraîche", "3 tablespoons freshly grated horseradish, or more to taste", "1 teaspoon Dijon mustard", "Zest of 1 lemon", "Coarsely ground black pepper", "1 small sweet onion, very thinly sliced", "1 teaspoon olive oil", "1/4 pound/4 ounces/125 grams sliced smoked salmon", "2 ounces/60 grams trout roe or wild salmon caviar (optional)", "1 tablespoon snipped chives", "1 teaspoon roughly chopped tarragon, or torn leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pastry: Put flour, baking powder and 1/2 teaspoon salt in the bowl of a food processor. Pulse briefly, then add butter all at once and whir until mixture resembles wet sand. Add egg and continue just until dough comes together. (Alternatively, cut butter into dry ingredients in a mixing bowl and mix by hand.) Knead dough lightly on counter-top, then divide into four pieces and form each into a ball. Wrap with plastic film and flatten to 1-inch-thick disks. Refrigerate for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the horseradish cream: Mix together crème fraîche, horseradish, mustard and lemon zest. Season generously with salt and pepper, then keep cool. (If cream firms upon standing, beat with a fork.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Put onion in a small bowl and season with salt and pepper. Add olive oil and mix to coat. Roll out each piece of dough to an 8-inch-diameter circle. Place the pastry disks on parchment-lined baking sheets. Sprinkle onion slices over each round."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake tart rounds for 6 to 7 minutes, until pastry is lightly browned and puffed, and onions are starting to brown. (Turn pans halfway through for even browning.) Let cool for a minute or two."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put pastry on a cutting board. Cut into 6 or 8 wedges. Spoon some horseradish cream onto each wedge. Tear salmon slices into wide ribbons and lay them over the cream. (Use 1 ounce salmon per tart.) Top each wedge with a tiny spoonful of roe, if using, and sprinkle with chives and tarragon. Serve directly from the board."}]}