{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Roasted Fish With Sweet Peppers", "description": "Quick to make and very pretty to behold, this easy weeknight dish has more verve than most. The roasted bell peppers turn sweet and golden, while olives add a salty note that goes nicely with the mild, flaky fish and a garlicky parsley dressing. If you can’t find hake, cod or flounder make fine substitutes, though you may have to adjust the roasting time. The thicker the fillets, the longer they will take to cook.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/02/10/dining/mc-fish/merlin_167226222_1dc4a41a-84b9-4ea4-80f2-deaaf2d8977b-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "bell pepper, hake, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 859}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 208, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "4 grams", "proteinContent": "32 grams", "saturatedFatContent": "0 grams", "sodiumContent": "508 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 small bunch lemon thyme or regular thyme", "1 1/2 pounds hake fillets", "Fine sea salt and black pepper", "3 large bell peppers, preferably 1 red, 1 orange and 1 yellow, thinly sliced", "4 1/2 tablespoons extra-virgin olive oil, plus more for drizzling", "1/4 cup pitted, sliced black or green olives, or a combination", "1 teaspoon sherry vinegar, plus more to taste", "1 garlic clove, grated", "1 cup loosely packed Italian parsley leaves, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Pull 1 tablespoon thyme leaves off the bunch and finely chop."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season fish all over with a large pinch or two of salt and pepper and rub with chopped thyme leaves. Let rest at room temperature while you prepare peppers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread peppers on a rimmed sheet pan, and toss with 1 1/2 tablespoons oil, 1/2 teaspoon salt and the black pepper to taste. Top peppers with the remaining thyme sprigs. Roast, tossing occasionally, until peppers are softened and golden at the edges, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase oven temperature to 500 degrees. Push peppers to the edges of the pan, clearing a space in the center. Lay fish out on that empty space and drizzle with oil. Scatter olives over the top of fish and peppers. Roast until fish turns opaque and is just cooked through, 6 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make a vinaigrette by combining vinegar, garlic and a pinch of salt in a bowl. Whisk in remaining 3 tablespoons olive oil, then whisk in parsley. Taste and add more salt or vinegar, or both, if needed. Serve fish and peppers drizzled with vinaigrette."}], "link": "https://cooking.nytimes.com/recipes/1017725-sheet-pan-roasted-fish-with-sweet-peppers"}