{"@context": "http://schema.org", "@type": "Recipe", "name": "Schmaltz Latkes", "description": "Frying latkes in <a href=\"http://cooking.nytimes.com/recipes/1017054-schmaltz-and-gribenes\" target=\"_blank\">schmaltz</a> — rendered poultry fat — is the traditional Ashkenazi method, what Central and Eastern European Jews typically did before assimilating in America. It makes for an exceptional latke:  crisp-edged and deeply flavored, with a nutty, rich flavor that’s much more complex than if you fry them in flavorless vegetable oil. For the best results, make the batter for these just before frying and serve immediately. Also keep in mind that serving these with the optional sour cream or yogurt makes them unsuitable to anyone keeping kosher. If you’re making schmaltz from scratch for this recipe, do use the onion; it adds a lovely caramelized sweetness to the mix. The gribenes, which are the crispy bits of chicken skin that fry in the rendered fat, make an excellent garnish. (They are usually strained out of store-bought schmaltz; if you don’t have them, just omit them here.)", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/12/10/dining/10JPSCHMALTZ1/10JP-SCHMALTZ1-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "8 to 9 latkes (3 to 4 servings)", "recipeCuisine": "jewish", "recipeCategory": "dinner, lunch", "keywords": "russet potatoes, schmaltz, shallot, sour cream, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 88}, "recipeIngredient": ["1 large russet potato (about 10 ounces), peeled and quartered lengthwise", "1 shallot, peeled and halved lengthwise", "1/4 cup all-purpose flour", "1 large egg", "3/4 teaspoon kosher salt", "1/2 teaspoon baking powder", "1/4 teaspoon black pepper", "Schmaltz, for frying (<a href=\"http://cooking.nytimes.com/recipes/1017054-schmaltz-and-gribenes\" target=\"_blank\">see recipe</a>)", "Sour cream or Greek yogurt, for serving (optional)", "Applesauce, for serving (optional)", "Gribenes, for garnish (optional, <a href=\"http://cooking.nytimes.com/recipes/1017054-schmaltz-and-gribenes\" target=\"_blank\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a food processor with a coarse grating disc, grate potato and shallot. Transfer mixture to a clean dish towel and squeeze out as much liquid as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, transfer mixture to a large bowl. Toss in flour, egg, salt, baking powder and pepper until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a medium skillet over medium-high, then pour in about 1/4 inch of schmaltz. Once schmaltz is hot, drop heaping 1/4 cup measures of batter into pan. Use a spatula to flatten the drops into discs. When edges of latkes are crispy, in 5 to 7 minutes, flip them. Cook until second side is golden brown, about 5 to 7 minutes more. If latkes get too brown before they are cooked through, lower the heat. Transfer to a paper-towel-lined plate to drain. Repeat with remaining batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve latkes topped with sour cream and applesauce, if you like. Garnish with gribenes if you have them."}], "link": "https://cooking.nytimes.com/recipes/1017055-schmaltz-latkes"}