{"@context": "http://schema.org", "@type": "Recipe", "name": "Houseman's Roasted-Squash Salad", "description": "At Houseman, the restaurant Ned Baldwin and Adam Baumgart opened in the Hudson Square neighborhood of Manhattan in 2014, you’ll find this astonishing salad made with red kabocha squash. But the more easily found green kabocha works beautifully in the recipe, as does buttercup squash and sugar pumpkin. For the dressing, some confidence is required. What seems an enormous amount of dried spices — ground fennel, sumac and coriander — is combined with chopped parsley and cilantro. The result looks dry and grainy, as if something is wrong. But olive oil, lime juice and white-wine vinegar (best available, please!) begin to smooth things out, and the cheese, pistachios and vinegar-plumped currants finish the job. The combination makes a fine vegetarian main-course lunch or dinner, particularly paired with braised greens and good bread.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/12/20/magazine/20eat1/20mag-20eat-t_CA1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "middle eastern", "recipeCategory": "", "keywords": "currants, squash", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 313}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 399, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "6 grams", "sodiumContent": "390 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["5 tablespoons dried currants", "1/4 cup plus 2 tablespoons white-wine vinegar", "1 kabocha squash, approximately 3 to 4 pounds", "Approximately 3/4 cup extra-virgin olive oil", "1/2 tablespoon kosher salt", "1 tablespoon plus 3/4 teaspoon ground fennel seed", "1 tablespoon plus 3/4 teaspoon ground sumac", "1 tablespoon plus 3/4 teaspoon ground coriander", "1/2 cup chopped parsley, packed", "1/2 cup chopped cilantro, packed", "1/4 cup plus 2 tablespoons freshly squeezed lime juice, approximately 3 to 4 limes", "1/2 cup pistachios, toasted and chopped", "1/2 cup firm feta cheese, diced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the currants in a small bowl, and pour the white-wine vinegar over them. Allow them to macerate for several hours or overnight, though in a pinch you can allow them to plump up while you prepare the squash. Heat oven to 450."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the squash in half, scoop out the seeds, peel both halves (if you like: the skin of the kabocha squash is edible) and slice the squash into 1/4-inch half moons. Dress the squash lightly with 1 to 2 tablespoons of the olive oil, and season with the salt. Place the squash on a parchment-lined sheet pan, and roast until soft and caramelized, approximately 15 to 20 minutes, turning the pieces once or twice during the process. Remove the squash from the oven, and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium-size bowl, combine the fennel seed, sumac and coriander, then add the parsley and cilantro, and stir to combine. Add 1/3 cup olive oil, and stir to combine. You want a wet mixture and may need to add a couple of extra tablespoons of oil to get it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the currants, reserving the vinegar, and add them to the green sauce. Add the lime juice, pistachios, cheese, 6 tablespoons olive oil and 5 teaspoons vinegar from the pickled currants to the green sauce. Taste, and add more lime juice or vinegar if you like, along with a spray of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place squash on a warm platter, and spoon the dressing over the top."}]}