{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple and Swiss Chard Pie", "description": "This is a version of a classic French tourte aux blettes, a Swiss chard pie made with abundant chard, raisins, pine nuts, Parmesan or Gruyère, sugar and apples. But here, the usual olive-oil crust has been swapped for a flaky butter-based pâte brisée.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/11/04/dining/04MARTHA/04MARTHA-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "10 to 12 servings", "recipeCuisine": "french", "recipeCategory": "dinner, lunch, pies and tarts", "keywords": "apple, Gruyère, Swiss chard, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 41}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 408, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "7 grams", "proteinContent": "7 grams", "saturatedFatContent": "11 grams", "sodiumContent": "296 milligrams", "sugarContent": "18 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["222 grams/8 ounces French-style unsalted butter, at room temperature", "5 grams/3/4 teaspoon fine sea salt", "30 grams/2 tablespoons sugar", "370 grams/3 cups whole-wheat pastry flour or unbleached all-purpose flour, or a mix, sifted", "1 tablespoon cold vodka", "1/2 cup golden raisins", "1/2 cup rum", "8 cups Swiss chard leaves, coarsely chopped (from 1 generous bunch)", "2 pounds (4 large) tart apples, such as Pink Lady or Braeburn, peeled, cored and cut in thin (1/4-inch thick) slices", "2 tablespoons raw brown sugar", "3 eggs", "Pinch of salt", "1/4 cup lightly toasted pine nuts", "1/4 cup powdered sugar, plus extra for dusting, sifted", "2 ounces Gruyère, Comté or manchego, grated (1/2 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Place butter, salt and sugar in the bowl of a stand mixer. Mix at the slowest speed for 30 seconds. Add flour and mix at the slowest speed until well combined. Add vodka and 3 tablespoons water and mix only until dough comes together; add more water as needed. Do not overmix. The dough should be completely homogenized and will feel slightly tacky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape mixture out onto a work surface. Weigh and divide into two uneven pieces, one 2/3 of the total weight and the other 1/3 of the total weight. Flatten to about 1/2-inch thick, wrap tightly in plastic and refrigerate for several hours, preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly butter a 9- to 9 1/2-inch tart pan or pie dish. Roll out the larger piece of the pastry on a lightly floured surface. Transfer dough to pan, allowing edges of dough to hang over sides. Refrigerate, uncovered, for at least one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the filling: Place raisins in a bowl and cover with rum. Leave for 20 minutes or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Adjust oven rack so it is in the lower third of the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the greens. Heat a large skillet over high heat and add the still-wet chard a handful at a time. Stir until greens collapse, then add another handful. Add a generous pinch of salt and continue until all greens have wilted. Transfer to a colander and rinse with cold water. Take up handfuls of chard and squeeze out excess water. Chop coarsely and set aside. You should have 1 generous cup chopped chard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place sliced apples in a large bowl and toss with brown sugar. Drain raisins and discard rum."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another large bowl, beat eggs. Remove 2 tablespoons for brushing the crust and set aside in a small bowl or ramekin. Add a pinch of salt to the eggs in the large bowl, and stir in chard, apples, raisins, pine nuts, powdered sugar and cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove lined pan and remaining dough from refrigerator. Allow to sit for 5 minutes, until the edges of the dough in the pan are pliable. Pierce the bottom all over with a fork, leaving about an inch between the rows. Brush lightly with beaten egg. Scrape in chard and apple filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out remaining dough and place on top of filling. Join the edges of the top and bottom pastry and pinch together to form an attractive lip. Make a few slits in top of dough and place pan on a baking sheet. Brush the top generously with reserved egg. If there are any spare pieces of dough, shape into little balls to decorate the top crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 10 minutes at 425 degrees, then reduce heat to 375 degrees and bake another 40 to 45 minutes, until nicely browned. (If edges are browning too quickly, cover loosely with foil after 30 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow to cool completely, which will take a couple of hours. The pie can be made a day ahead and refrigerated. Dust with powdered sugar, if desired, before serving."}]}