{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Mexican Cacao Brownies", "description": "These vegan and gluten-free brownies, as conjured up by Julie Piatt of “The Plantpower Way,” a cookbook and vegan lifestyle guide, will enthrall even the most die-hard of butter devotees. Digging into them can feel like making contact with a semi-solidified form of chocolate syrup. The flavor runs deep, zingy with an undercurrent of cinnamon and chile, and the texture manages to remain simultaneously dense and moist.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2015/10/20/dining/20VEGANREX/20VEGANREX-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "16 brownies", "recipeCuisine": "", "recipeCategory": "snack, cookies and bars", "keywords": "almond milk, cacao powder, garbanzo flour, tapioca flour, vegan butter, vegan chocolate, dessert, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 86}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 531, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "35 grams", "sodiumContent": "121 milligrams", "sugarContent": "23 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons/14 grams ground flaxseed", "Coconut oil, for greasing pan", "3/4 cup/85 grams garbanzo flour", "1/2 cup/35 grams natural cacao powder", "1/4 cup/28 grams tapioca flour", "1 teaspoon cinnamon", "3/4 teaspoon xanthan gum ", "1/2 teaspoon fine sea salt", "1/4 teaspoon baking soda ", "1 cup/112 grams almond meal", "1 (3 1/2-ounce/100-gram) bar high-quality chile-infused vegan dark chocolate, coarsely chopped", "1 1/4 cups/245 grams cane sugar", "1 cup plus 2 tablespoons/252 grams vegan butter (preferably Earth Balance)", "1/2 cup/118 milliliters unsweetened almond milk, more as needed", "1 teaspoon pure vanilla extract", "1 (9-ounce/255-gram) bag vegan chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the ground flaxseed and 6 tablespoons (89 milliliters) water until mixture has an egg-like consistency. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Lightly oil the bottom and sides of a 9-inch-square pan with coconut oil. Line the bottom of the pan with parchment paper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, sift together garbanzo flour, cacao powder, tapioca flour, cinnamon, xanthan gum, sea salt and baking soda. Add almond meal and stir until fully incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a clean, dry metal bowl set over a pan of barely simmering water, melt chile-infused dark chocolate, stirring until smooth. Remove from heat and set aside to cool. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the flaxseed “egg” again, then place in the bowl of a stand mixer fitted with the paddle attachment. Add sugar, vegan butter, almond milk and vanilla and stir on low. Gradually increase speed to medium-high and continue beating until mixture is fully combined and mostly smooth, 5 to 7 minutes. Add the melted chocolate and beat for 15 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wet ingredients to the dry ingredients and fold with a rubber spatula until fully combined and streak-free. The batter should be thick and gooey, but if it’s too dry, add additional almond milk, 1 tablespoon at a time, to loosen. Fold about 3/4 of the chocolate chips into the batter, then spread it evenly in the prepared pan. Sprinkle the top with the remaining chocolate chips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until a fork inserted in the center of the brownies comes out mostly clean, about 30 minutes; do not overcook. Transfer the pan to a rack and cool to room temperature."}], "link": "https://cooking.nytimes.com/recipes/1017723-vegan-mexican-cacao-brownies"}