{"@context": "http://schema.org", "@type": "Recipe", "name": "Sampita", "description": "This traditional Montenegrin dessert, adapted from Jasmina Bojic, is a kind of open-faced marshmallow sandwich. The syrup from the meringue seeps into the cake as it rests, befitting Montenegro's position between layer-cake-loving Central Europe and the syrup-soaked pastry traditions of the Mediterranean. Serve with strong coffee to balance the sampita's rich sweetness.", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2015/03/29/magazine/29eat/29mag-29eat.t_CA0-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "20 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 30}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 214, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "0 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "80 milligrams", "sugarContent": "39 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 large egg yolks", "1/2 cup plus 2 tablespoons sugar", "1 teaspoon vanilla extract", "5 tablespoons milk", "2 tablespoons vegetable oil", "1/2 cup all-purpose flour", "1 1/2 teaspoons baking powder", "Pinch of salt", "3 1/4 cups sugar", "3/4 cup water", "8 egg whites", "1 teaspoon vanilla extract", "Pinch of salt", "1/2 ounce chocolate, grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325. In a 5-quart stand-mixer bowl, combine the yolks, sugar and vanilla, and beat with the whisk attachment on medium-high speed until the mixture is very pale and fluffy, about 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce mixer speed to low, combine the milk and oil in a cup and add to the yolk mixture in a steady stream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix flour, baking powder and salt together in a bowl, and gently fold into yolks just until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a greased 9-by-13-by-2-inch baking pan with greased parchment (or dust with a little flour). Pour in the batter, and bake until a toothpick comes out clean, about 20 minutes. Cool cake in the pan until just warm, run the tip of a knife around the edge, then remove cake to a platter or baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meringue: Thoroughly clean and dry the mixer bowl and whisk attachment, and set up the mixer. Place the sugar in a heavy, large saucepan, then gently pour in the water. Set over high heat, and bring to a boil without stirring. If sugar splashes on the sides of the pan, clean it off with a wet pastry brush. Boil syrup to soft-ball stage (235 degrees) until it becomes visibly thicker, with slower, bigger bubbles, 5 to 7 minutes after it comes to a full boil. Remove the pan from heat, and let cool for 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the syrup cooks, add the egg whites, vanilla and salt to the mixer bowl and beat on low speed for 2 minutes, and then medium for another 4 to 5, or until the egg whites hold fluffy, stiff peaks. (Adjust the heat under the syrup or turn off the mixer longer than the other.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer running on medium-high, slowly pour the hot syrup into the egg whites, avoiding the whisk. The meringue will come almost to the very top of a 5-quart bowl. Continue beating the meringue after all the syrup is incorporated until it cools to just warm (test by touching the mixer bowl), 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread meringue evenly over and around the sides of the cake, and top with chocolate shavings. Let rest, refrigerated, for at least 3 hours. It will be rich and gooey, but sliceable. After an overnight rest, the sampita will be fluffier and less gooey and will slice more cleanly. Serve with Turkish or other strong coffee."}], "link": "https://cooking.nytimes.com/recipes/1017314-sampita"}