{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Red Pepper Filled With Tuna", "description": "This recipe is an adaptation of a classic Provençal dish. A roasted red pepper filled with a flavorful combination of canned tuna, capers, anchovy and lemon juice makes a satisfying and healthy meal for one.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/03/19/science/18recipehealth_600/18recipehealth_600-articleLarge-v3.jpg", "totalTime": "PT15M", "recipeYield": "1 generous serving", "recipeCuisine": "french", "recipeCategory": "easy, for one, quick, roasts", "keywords": "anchovy fillets, canned tuna, capers, red bell pepper, yogurt, high protein, low-carb", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 122}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 322, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "4 grams", "proteinContent": "32 grams", "saturatedFatContent": "2 grams", "sodiumContent": "844 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 medium size or large red bell pepper", "1 garlic clove", "Pinch of salt", "1 anchovy fillet, soaked in water to cover for 10 to 15 minutes, then drained, rinsed and patted dry (optional but recommended)", "1 teaspoon capers, rinsed", "1 5-oz. can water-packed tuna or olive oil-packed tuna, to taste", "1 tablespoon fresh lemon juice", "1 tablespoon extra virgin olive oil (omit if using olive oil-packed tuna)", "1 tablespoon plain low-fat yogurt (more to taste)", "Freshly ground black pepper", "1 tablespoon chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the pepper directly over a gas burner or under the broiler, turning often until uniformly charred. Remove from the heat, and place in a bowl. Cover tightly, and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While you’re waiting for the pepper to cool, make the tuna filling. Combine the garlic and a generous pinch of salt in a mortar and pestle, and mash to a paste. Add the anchovy, if using, and mash with the garlic. Add the capers, and mash together. In a bowl, break up the tuna with a fork, then stir in the garlic mixture, the lemon juice, olive oil and the yogurt. Add more yogurt or olive oil if the mixture seems dry. Season to taste with pepper (it should not need salt), and stir in the parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pepper is cool enough to handle, peel and discard the blackened skin, rinse briefly and pat dry. Cut away the top, then cut or pull apart the pepper into thirds. Remove seeds and membranes, holding the pepper over a bowl so that you can catch any juice. Lay the pepper pieces on a plate. Season with a little salt and pepper if desired, and fill with the tuna mixture. Serve."}]}