{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Spicy Carrots With Black Quinoa", "description": "This is inspired by a classic Moroccan spiced cooked carrot salad (Ommok Houriya is one variation of the transliteration). Carrots and cumin have long been a favorite combination of mine; added to this mix is fresh green chile and crushed coriander. I finish this off with a sprinkling of black quinoa and fresh mint (cilantro would also be good). If on the off-chance you can find a selection of multicolored carrots – yellow, purple, and orange – the dish will be all the more beautiful, but it is pretty enough with regular orange carrots. Cook them long enough to bring out the sweetness, which means longer than crisp-tender. They should be soft, but not mushy.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/16/science/17recipeforhealth/17recipeforhealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, vegetables", "keywords": "dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, winter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 66}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 93, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "4 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "302 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "2 garlic cloves, minced", "1 to 2 serrano or jalapeño chiles, minced", "2 teaspoons coriander seeds, lightly toasted and coarsely ground or crushed", "2 teaspoons cumin seeds, lightly toasted and coarsely ground or crushed", "2 pounds carrots, peeled and sliced on the diagonal, about 1/4 inch thick", "1 1/2 teaspoons sugar", "Salt", "1 tablespoon unsalted butter (optional)", "1/4 to 1/3 cup cooked black quinoa", "2 tablespoons chopped fresh mint or cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in a large, heavy skillet over medium-high heat and add garlic and chile. Stir for about 10 seconds and add ground coriander and cumin. Stir for about 10 seconds, until mixture is very fragrant, and add carrots, sugar and salt to taste. Sauté, stirring often or tossing in the pan, for 5 minutes and turn heat down to medium. Continue to cook, stirring often or tossing in the pan, for another 10 minutes, until carrots are tender and lightly colored."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter, quinoa and mint or cilantro and stir or toss in the pan for another minute or two, until quinoa is warmed through and butter has melted. Taste and adjust seasonings. Serve hot or warm."}]}