{"@context": "http://schema.org", "@type": "Recipe", "name": "Fennel and Orange-Scented Challah", "description": "My challah varies according to the weather and my whim. The basic formula has changed through the years; I use less sugar and oil now and fewer eggs. The key is knowing that you can always add more flour to your dough if it is too sticky, but it is hard to make a soft dough if you start off with too much flour. I take mine out of the mixer when it is tacky and work the extra flour in with my hands.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2014/12/10/dining/10CHALLAH2/10CHALLAH2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 loaves", "recipeCuisine": "jewish", "recipeCategory": "breads", "keywords": "fennel seeds, poppy seed, sesame seeds", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 320}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 308, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "1 gram", "sodiumContent": "241 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 tablespoons (2 packages) active dry yeast", "1 tablespoon plus 1/3 cup sugar", "Grated zest from 2 large oranges plus 1/2 cup of the juice, strained", "1/3 cup vegetable or canola oil", "3 large eggs, plus 1 egg yolk", "1 tablespoon salt", "7 1/2 cups unbleached all-purpose flour, plus more as needed", "1 tablespoon fennel seeds", "2 teaspoons poppy seeds", "2 teaspoons roasted sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a standing mixer, dissolve yeast and 1 tablespoon sugar in 1 cup of lukewarm water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the paddle attachment, stir orange zest, juice and oil into yeast mixture, then add 2 eggs, 1 at a time, and remaining sugar and salt. Switch to the dough hook and gradually add 6 cups of flour, kneading for about 5 minutes and adding more flour as needed to make a slightly sticky, smooth and elastic dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a large bowl, turn dough into it  and then turn the dough over to grease the top. Cover with greased plastic wrap and let rise in a warm place for 1 hour, or refrigerate for a few hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the dough has almost doubled, punch it down, remove it to a lightly floured counter, knead it briefly until smooth and divide it in half. Roll each piece into a cylinder about 27 inches long, making sure there are no seams in the dough. Bring one end of the dough up to the other and twist to form a spiral. Push both ends together to make a squat 12-inch loaf. Repeat with other piece of dough and arrange loaves on a parchment-lined baking sheet at least 2 inches apart. You can also twist the long spirals into a circle if you like; the dough is very malleable."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat remaining egg and egg yolk and brush about half the mixture on the loaves, reserving the rest. Let the dough rise uncovered another half-hour or overnight in refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If dough was refrigerated, bring to room temperature. Heat oven to 350 degrees and in a small bowl, combine fennel, poppy and sesame seeds. Brush the loaves with egg again and sprinkle with seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 35 to 40 minutes or until golden and firm when tapped with a spatula. Cool on a rack."}], "link": "https://cooking.nytimes.com/recipes/1017052-fennel-and-orange-scented-challah"}