{"@context": "http://schema.org", "@type": "Recipe", "name": "Gingerbread Bûche de Noël", "description": "In this festive recipe, Dorie Greenspan reinterprets the classic French bûche de Noël, a Christmas cake fashioned to look like a Yule log. Instead of the usual chocolate cake filled with ganache, she bakes a fragrant lightly spiced sponge cake and fills it with pecan cream cheese filling, while billowing marshmallow frosting evokes a snowdrift. It’s a project to make and can take the better part of a day. Or split it up and make the components over a few days. Either way it’s time well spent. There’s no holiday dessert more spectacular than this.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/12/01/multimedia/clark-buche-de-noel/clark-buche-de-noel-mediumThreeByTwo440.jpg", "totalTime": "PT4H", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "cream cheese, pecans, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 277}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 468, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "13 grams", "sodiumContent": "184 milligrams", "sugarContent": "38 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup/120 grams pecan halves or pieces", "1/3 cup/70 grams granulated sugar", "4 tablespoons/60 grams unsalted butter, melted and cooled, more for buttering parchment", "3/4 cup/100 grams all-purpose flour", "1/4 cup/30 grams cornstarch, sifted", "3/4 teaspoon/4 grams ground cinnamon", "3/4 teaspoon/4 grams ground ginger", "1/4 teaspoon/1 gram fine sea salt", "1/4 teaspoon/1 gram black pepper", "6 large eggs", "3/4 cup/150 grams packed light brown sugar", "Confectioners’ sugar, for dusting and rolling", "8 ounces/225 grams cream cheese, at room temperature", "8 tablespoons/115 grams unsalted butter, at room temperature", "Pinch of fine sea salt", "1/2 teaspoon/3 grams ground cinnamon", "2 teaspoons/10 milliliters vanilla extract", "1/2 cup/120 milliliters egg whites (from about 4 large eggs)", "1 cup/200 grams granulated sugar", "3/4 teaspoon/3 grams cream of tartar", "1 tablespoon/15 milliliters vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the praline:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and place a rack in center. Line a baking sheet with parchment or a silicone baking mat. Spread pecans on sheet and bake for 5 minutes. Stir and set aside in a warm spot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine sugar and 1/4 cup/60 milliliters water. Place over medium-high heat. Cook sugar, washing down sides of pan if needed with a pastry brush dipped in cold water, until sugar turns a medium amber color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from heat and add nuts. Stir with heatproof spatula or wooden spoon to coat nuts with syrup. Spread nuts on baking sheet and cool completely. (Praline can be made up to a day ahead; store in an airtight container in a cool, dry place.) Finely chop 1/2 cup praline; coarsely chop the remainder."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the cake:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line a 12- by 17-inch rimmed baking sheet with parchment. Butter the paper, dust with flour and tap out excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together flour, cornstarch, cinnamon, ginger, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Have a wide skillet about 1/3 full of simmering water on the stove. Using a stand mixer, whisk together eggs and brown sugar. Set the mixer bowl in the pan of simmering water. Whisk nonstop until mixture is very warm to the touch, about 2 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the mixer, beat sugared eggs until they have more than doubled in volume and have reached room temperature, 7 to 10 minutes. Switch to a spatula and fold in flour mixture in two additions. Pour melted butter into a small bowl, scoop a big spoonful of batter over it and stir. Pour butter mixture into batter in bowl and fold it in. Scrape batter out onto prepared baking sheet and spread evenly with an offset spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until cake is golden brown, lightly springy to touch and starting to pull away from sides of baking sheet, about 15 minutes. Transfer pan to cooling rack for no more than 5 minutes; you want to roll the cake while it’s hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay a cotton or linen kitchen towel (not terry cloth or microfiber) on counter and dust generously with confectioners’ sugar. Run a table knife around sides of cake and invert onto towel. Carefully peel away parchment. Lightly dust cake with confectioners’ sugar. Put parchment back on cake, with the clean side against the cake. Starting at a short end, roll cake into a log; don’t worry about cracks. Return rolled up cake (still in towel) to rack and let cool, seam side down."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the filling:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put cream cheese, butter and salt in bowl and, using electric mixer, beat until smooth. Beat in cinnamon and vanilla. If using immediately, stir in 1/2 cup finely chopped praline. If not, leave praline out, transfer filling to a bowl, cover and refrigerate for up to 2 days. (Whisk chilled filling to return it to spreadable consistency, then add praline.)"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Fill the log:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Unroll log and carefully remove parchment; leave cake on kitchen towel. Beginning with a short end, gently roll up cake, peeling away towel as you go. Unroll cake onto the towel or a clean piece of parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread filling across surface of the cake, leaving a scant 1-inch border uncovered on the long sides. Starting from short side, roll up cake, trying to get as a tight a roll as you can. Place cake on a parchment-lined cutting board, cover and chill for 30 minutes."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the frosting:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put egg whites in clean, dry bowl of  electric mixer with whisk attachment. In a small saucepan, combine sugar, cream of tartar and 1 cup/240 milliliters water. Bring to a boil over medium-high heat, cover and boil for about 3 minutes. Uncover and attach a candy thermometer to pan and cook until it reads 242 degrees. When sugar reaches 235 degrees, begin beating whites on medium speed. If you get to the point where the whites look as if they are about to form stiff peaks and syrup is not at 242 degrees yet, lower mixer speed and keep mixing until sugar is ready."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At 242 degrees, with mixer on medium speed, stand back and carefully and steadily pour hot syrup into bowl. Try to get syrup between side of bowl and the whisk. Add vanilla and keep beating until frosting cools to room temperature, about 5 minutes. You will have a shiny marshmallow frosting, which you should spread immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove cake from refrigerator. Frost on the cutting board and then transfer to a serving platter, or put it on platter now. To keep the platter clean during frosting, tuck strips of parchment under the log, putting just a sliver of the parchment under the cake and leaving the lion’s share to protect your platter.If ends of log look ragged, trim them. Using an offset spatula, table knife or the back of a spoon, swirl frosting all over cake in a thick layer. Refrigerate at least 1 hour to set frosting and firm up filling. Sprinkle cake with coarsely chopped praline before serving."}]}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Bûche de Noël", "description": "Melissa Clark and Dorie Greenspan make bûche de Noël with gingerbread spices.", "thumbnailUrl": "https://static01.nyt.com/images/2014/12/01/multimedia/clark-buche-de-noel/clark-buche-de-noel-mediumThreeByTwo440.jpg", "uploadDate": "2014-12-01T19:00:54.000Z", "duration": "PT4M18S"}, "link": "https://cooking.nytimes.com/recipes/1017027-gingerbread-buche-de-noel"}