{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheater’s Pickles", "description": "This recipe was developed by accident when Dora Charles was working on her book, “A Real Southern Cook: In Her Savannah Kitchen.” The pickles come together fast, with a shock from ice cubes and a touch of sugar helping them move from raw to something between a pickle and a refreshing salad in just about a half-hour. Fresh herbs other than dill, like basil or a bit of mint or chive, can be used. A few slivers of sweet onion are nice, too.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2015/09/02/dining/02DORAWEB7/02DORAWEB7-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, lunch, pickles", "keywords": "champagne vinegar, dill, rice vinegar, vidalia onion, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 116}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 25, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "0 grams", "proteinContent": "0 grams", "saturatedFatContent": "0 grams", "sodiumContent": "184 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 English cucumbers", "2 tablespoons sugar", "Handful of ice cubes", "1/4 cup rice vinegar, Champagne vinegar, apple cider vinegar or distilled white vinegar", "Several pinches of flaky salt, such as Maldon", "Several grinds of black pepper, optional", "2 tablespoons snipped fresh dill, mint or chives, or a mixture, optional", "1/2 Vidalia onion, sliced into thin half-moons, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut off the ends of the cucumbers and use the tines of a fork to draw long stripes down their lengths. Slice the cucumbers like bread-and-butter pickles, about 1/8-inch thick, and pile them into a large shallow bowl. Sprinkle the sugar over the cucumbers and stir in well. Scatter the ice cubes over the slices and cover the bowl loosely with plastic wrap. Chill in the freezer for 1/2 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the cucumbers in a colander and pat dry with a clean kitchen towel. Put the cucumbers back in the bowl, sprinkle the vinegar over them evenly, and stir well. Add the salt and pepper, if using, and stir well to combine. Toss in the herbs and the onions, if using. Refrigerate until ready to serve. They will still be good the next day, though not quite as crisp."}], "link": "https://cooking.nytimes.com/recipes/1017680-cheaters-pickles"}