{"@context": "http://schema.org", "@type": "Recipe", "name": "Deep-Fried Cauliflower With Crispy Dukkah Coating", "description": "Deep-fried cauliflower is a Middle Eastern specialty, so why not make it even more Middle Eastern and use a batter made with dukkah, the complex Middle Eastern condiment made with a mixture of nuts, seeds, spices and, in this version, chickpea flour. The batter is thin (you have the option of adding a bit more chickpea flour) but the cauliflower gets just enough of a coating to come out of the oil with a perfect thin crispy shell. Serve it with garlic-laced yogurt or with tahini sauce. In this recipe you have the option of using olive oil, which is traditional; but use a work-horse oil, not the expensive oil you reserve for drizzling and dressing salads.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/03/10/science/recipehealthcauliflower/recipehealthcauliflower-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 8", "recipeCuisine": "", "recipeCategory": "dinner, lunch, snack, vegetables", "keywords": "appetizer, side dish, dairy-free, gluten-free, halal, kosher, low cholesterol, low sugar, vegan, vegetarian, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 253, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "194 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup spicy Egyptian dukkah", "1/2 cup plus 1 tablespoon cornstarch, rice flour or flour (more as desired)", "1/2 teaspoon baking powder", "1/2 teaspoon salt", "2/3 cup sparkling water", "3 to 6 tablespoons chickpea flour, as desired (optional)", "1 cauliflower, cut into small florets", "Canola oil, grapeseed oil or olive oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together dukkah, cornstarch (or flour), baking powder and salt. Whisk in sparkling water. Depending on the consistency of your dukkah, the batter may seem thin, but try deep-frying a few pieces of cauliflower first to see if you want to thicken it with a little more cornstarch or flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour oil into a wok or wide saucepan to a depth of 3 inches and heat over medium-high heat to 360 to 375 degrees. Set up a sheet pan with a rack on it next to pan. Cover rack with a few layers of paper towels. Have a spider or deep fry skimmer handy for removing cauliflower from oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a few pieces of cauliflower in batter and, using tongs, turn them over several times to coat thoroughly. Transfer to hot oil and fry until golden brown, which should not take more than a couple of minutes. Flip over with spider to make sure coating is evenly fried. It is important not to crowd pan and to let oil come back up to temperature between batches. After first batch you can decide if you want to add a little more flour to batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the spider, remove cauliflower from oil, allowing excess oil to drip back into pan, and drain on the towel-covered rack. Sprinkle with salt right away if desired. Allow to cool slightly and serve."}], "link": "https://cooking.nytimes.com/recipes/1017281-deep-fried-cauliflower-with-crispy-dukkah-coating"}