{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetable Fried Rice", "description": "The great thing about making fried rice is that it can be easy. The downside is that it can be bland. Amanda Cohen, the chef at Dirt Candy in Manhattan, loves the easy part. “If you’re a chef, the idea of cooking at home on your one night off is like some kind of terrible nightmare,” she said. “Takeout becomes your best friend. but before long half your fridge is taken up by those little white cartons of rice.” At home, she digs into those cartons to make fast batches of vegetable fried rice, and she combats the threat of blandness by stocking her freezer in advance with her <a href=\"http://cooking.nytimes.com/recipes/1017249-amanda-cohens-secret-weapon-stir-fry-sauce\">Secret-Weapon Stir-Fry Sauce</a>: small, dark green ice blocks of puréed garlic, ginger, cilantro, parsley and other ingredients, which she freezes in ice-cube trays (they can be slipped directly into the hot pan). She uses brussels sprouts, fennel, chard and mushrooms, but this dish is the definition of flexibility. “As long as you maintain the proportions, this recipe can take any vegetable you throw at it,” she said. “Think of it as a chance to clean out your crisper drawer.”", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2015/02/25/dining/25DIRTJP3/25DIRTJP3-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "2 main course servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, quick", "keywords": "brussels sprouts, chard, cremini, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 153}, "recipeIngredient": ["1 tablespoon sesame oil", "4 tablespoons canola oil", "1 cup of trimmed and quartered brussels sprouts", "1 cup diced fennel", "2 cups chopped chard", "1 cup chopped cremini mushrooms", "4 loosely packed cups of leftover rice (about 1 large, quart-size carton, or 2 small pint-size cartons)", "Rice wine vinegar, to taste", "4 frozen cubes (or 4 tablespoons fresh) Secret Weapon Stir-Fry Sauce (<a href=\"http://cooking.nytimes.com/recipes/1017249-amanda-cohens-secret-weapon-stir-fry-sauce\">see recipe</a>)", "Soy sauce, to taste", "Fish sauce, to taste", "Hot sauce, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat sesame oil and canola oil in a large pan or a wok over medium-high heat until the oil shimmers. Add the vegetables and stir constantly until they have started to soften and brown, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss in the rice, and use a wooden spoon or spatula to break up the clumps. Some of the rice will stick to the pan, but don’t panic. The older and drier the rice, the longer this takes. If it starts sticking a lot, add a dash of rice wine vinegar or water. Keep stirring until the rice softens and becomes slightly translucent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the frozen Stir-Fry Sauce cubes, and keep stirring as they melt and coat the rice. Transfer the rice into a bowl and season to taste with soy sauce, rice wine vinegar, fish sauce  or hot sauce, or all four."}]}