{"@context": "http://schema.org", "@type": "Recipe", "name": "Mississippi Roast", "description": "An Internet darling of a recipe, a favorite of mom bloggers and <a href=\"https://www.pinterest.com/nytfood/\">Pinterest</a>, Mississippi Roast is traditionally made by placing a chuck roast in a <a href=\"http://thesweethome.com/reviews/best-slow-cooker/\">slow cooker</a> and simmering it beneath a stick of butter, a package of ranch dressing mix, another of “au jus” gravy mix and a handful of pepperoncini. And you can certainly cook it that way. The raves are justified. But replacing the packaged mixes is no real chore, and it results in a luscious tangle of deliciously tangy beef that goes beautifully with mashed or roasted potatoes or egg noodles, or as a hot-sandwich filling. Cooking time will vary depending on the size of your roast and the effectiveness of your slow cooker. But six to eight hours generally does the trick. (If you're in the market for a slow-cooker, our colleagues at The Sweethome have spent a great deal of time testing them. Check out <a href=\"http://thesweethome.com/reviews/best-slow-cooker/\">their guide to the best on the market</a>.)", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/01/27/dining/27ROAST1/27ROAST1-articleLarge.jpg", "totalTime": "PT8H", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "dinner, roasts", "keywords": "chuck roast, pepperoncini, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5299}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 589, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "0 grams", "proteinContent": "48 grams", "saturatedFatContent": "15 grams", "sodiumContent": "600 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 boneless chuck roast or top or bottom round roast, 3 to 4 pounds", "2 teaspoons kosher salt, plus more to taste", "1 1/2 teaspoons freshly ground black pepper, plus more to taste", "1/4 cup all-purpose flour", "3 tablespoons neutral oil, like canola", "4 tablespoons unsalted butter", "8 to 12 pepperoncini", "2 tablespoons mayonnaise", "2 teaspoons apple cider vinegar", "1/2 teaspoon dried dill", "1/4 teaspoon sweet paprika", "1 teaspoon buttermilk, optional", "Chopped parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place roast on a cutting board and rub the salt and pepper all over it. Sprinkle the flour all over the seasoned meat and massage it into the flesh."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large sauté pan set over high heat until it is shimmering and about to smoke. Place the roast in the pan and brown on all sides, 4 to 5 minutes a side, to create a crust. Remove roast from pan and place it in the bowl of a slow cooker. Add the butter and the pepperoncini to the meat. Put the lid on the slow cooker, and set the machine to low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the roast heats, make a ranch dressing. Combine the mayonnaise, vinegar, dill and paprika in a small bowl and whisk to emulsify. Add the buttermilk if using, then whisk again. Remove the lid from the slow cooker and add the dressing. Replace the top and allow to continue cooking, undisturbed, for 6 to 8 hours, or until you can shred the meat easily using 2 forks. Mix the meat with the gravy surrounding it. Garnish with parsley, and serve with egg noodles or roast potatoes, or pile on sandwich rolls, however you like."}], "link": "https://cooking.nytimes.com/recipes/1017937-mississippi-roast"}