{"@context": "http://schema.org", "@type": "Recipe", "name": "Gingerbread House", "description": "Here is all you need to know to build a gingerbread house: a delicious recipe, instructions for assembly, and a <a href=\"https://static01.nyt.com/packages/dining/GINGERBREAD_TEMPLATES-updated2.pdf\">printable template</a> provided by Nina Cooke John, a Manhattan architect. The recipe came to us from Genevieve Meli, the pastry chef at Il Buco Alimentari in Manhattan, and it works just as well for cookies as it does for a gingerbread house. This recipe makes one small house, so you may consider doubling the recipe for a larger structure, but note: only one recipe at a time will fit in the bowl of a standard stand mixer, so plan ahead. (Ms. Cooke John and Ms. Meli also built a gingerbread structure for us, and you can watch that <a href=\"http://www.nytimes.com/video/dining/100000004089384/gingerbread-dream-team.html\">here.</a>)", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2015/12/10/dining/10COOKING-GINGERBREADHOUSE/10COOKING-GINGERBREADHOUSE-articleLarge.jpg", "totalTime": "PT2H20M", "recipeYield": "1 small gingerbread house", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 100}, "recipeIngredient": ["1/2 cup/120 milliliters dark corn syrup", "1/2 cup/120 milliliters molasses", "3/4 cup/160 grams dark brown sugar", "10 tablespoons/142 grams margarine or shortening", "4 1/2 cups/540 grams all-purpose flour, plus more for rolling out the dough", "1/2 teaspoon salt", "4 teaspoons ground cinnamon", "2 1/4 teaspoons ground cloves", "1 1/2 teaspoons ground ginger", "1 teaspoon ground star anise, from 2 to 3 stars (optional)", "Royal icing, <a href=\"http://cooking.nytimes.com/recipes/1017887-royal-icing\">see recipe</a>", "Candy, such as gumdrops, licorice and candy canes, for decorating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the gingerbread: Combine the syrup, molasses, brown sugar and margarine in a saucepan over medium heat. Cook, stirring often, until the margarine is melted and the sugar has dissolved; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the flour, salt, cinnamon, cloves, ginger and star anise (if using) in the bowl of a stand mixer fitted with the paddle attachment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the machine running on medium-low speed, slowly stream in the sugar mixture and beat until incorporated. Wrap the dough in plastic and refrigerate until firm, at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. (If using a convection oven, heat to 350 degrees.) With a floured rolling pin, roll out the dough to about 1/4-inch thickness on a large sheet of parchment paper. Cut out your desired shapes with a chef’s knife or pizza cutter and pull away scraps (if making the gingerbread house from the templates provided, you'll need to cut out two sides and two roofs). To minimize distortion, gently slide the parchment onto a baking sheet. Reroll the scraps and repeat as needed to cut out all of the necessary shapes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 10 to 12 minutes, or until the edges are lightly browned. If using the template, be sure to bake the door piece. Remove from the oven and let cool completely on the baking sheets. The cookies will harden as they cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the house: Using a pastry bag fitted with small plain round tip, draw windows with royal icing on the pieces as they lie flat. Let the icing set, about two minutes. Then, using icing as glue, attach the 4 walls of the house to each other and support the walls with jars or cans to allow the icing to set. Attach the two roof pieces with icing, and let the icing dry. Attach the door with icing, and then decorate with icing and assorted candies."}], "link": "https://cooking.nytimes.com/recipes/1017890-gingerbread-house"}