{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom and Beet Borscht", "description": "This lighter, vegetarian version of hot borscht has the depth of flavor that a meaty backdrop provides, without overpowering the winelike, heady flavor of the beets.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/09/16/dining/16MARTHA/16MARTHA-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "eastern european", "recipeCategory": "soups and stews", "keywords": "appetizer, beets, mushroom, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 134}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 113, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "463 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 ounce dried mushrooms (about 1 cup), such as porcinis or shiitakes", "1 bunch beets (4 medium or 3 large), with greens, the beets peeled and quartered, the greens stemmed, washed and coarsely chopped", "3 garlic cloves, 2 thinly sliced and 1 minced", "Salt", "1 to 2 teaspoons sugar, to taste", "2 tablespoons extra-virgin olive oil", "1 large onion, chopped", "2 medium carrots, peeled and sliced (about 1 1/2 cups)", "2 celery stalks, sliced", "1/2 pound white or cremini mushrooms, trimmed and sliced", "A bouquet garni made with 10 parsley stems, 2 bay leaves, 6 black peppercorns, 2 sprigs thyme and 3 allspice berries, tied in a cheesecloth bag", "1 tablespoon cider vinegar", "1/4 cup chopped fresh parsley", "1 cup plain Greek yogurt for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dried mushrooms in a bowl and pour on 3 cups boiling water. Let sit 30 minutes, then strain through a cheesecloth-lined strainer set over a bowl. Squeeze mushrooms over the strainer to extract any remaining flavorful liquid. Rinse mushrooms in several changes of water, and chop."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While mushrooms are soaking, combine beets, sliced garlic and 1 quart of water in a saucepan and bring to a boil. Add 1 teaspoon salt and the sugar, reduce heat and simmer uncovered for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove beets from water using a slotted spoon or skimmer and transfer to a bowl; allow to cool until you can handle them. Cut into small dice or into julienne (about 1/4-inch wide by 1 inch long). Add enough of the broth from the beets to the mushroom broth to make 6 cups combined broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil over medium heat in a large, heavy soup pot or Dutch oven and add onion, carrots and celery. Cook, stirring, until just tender, about 5 minutes, and add a generous pinch of salt and the minced garlic. Cook, stirring, until fragrant, 30 seconds to a minute, and add white mushrooms. Cook, stirring often, until mushrooms begin to sweat. Add chopped dried mushrooms, the 6 cups combined mushroom and beet broth, the simmered beets and the bouquet garni. Bring to a boil, add salt to taste, reduce heat, cover and simmer 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chopped beet greens and simmer another 5 minutes. Stir in vinegar. Taste and adjust seasonings. Remove bouquet garni, stir in chopped parsley and serve, garnishing each bowl with a generous dollop of yogurt if desired."}], "link": "https://cooking.nytimes.com/recipes/1017682-mushroom-and-beet-borscht"}