{"@context": "http://schema.org", "@type": "Recipe", "name": "Salty-Sweet Peanut Butter Sandies", "description": "This modern classic is reverse-engineered from a cult cookie at City Bakery in Manhattan. They are saltier, richer and tangier than the usual crisscross rounds, thanks to updated ingredients like sea salt, cultured butter and brown sugar. And like any good “sandy” cookie, they have a soft, crumbly texture that melts away on first bite.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/12/03/dining/03COOKFIGHT3/03COOKFIGHT3-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "3 to 4 dozen", "recipeCuisine": "", "recipeCategory": "snack, cookies and bars", "keywords": "dessert, peanut butter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1304}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 167, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "4 grams", "sodiumContent": "78 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup/228 grams/2 sticks unsalted butter, preferably cultured, softened at room temperature", "3/4 cup/150 grams granulated sugar", "3/4 cup (packed)/170 grams light brown sugar", "1 heaping teaspoon/6 grams kosher salt", "2 cups/510 grams unsweetened peanut butter, creamy or chunky", "2 eggs, at room temperature", "2 cups/250 grams all-purpose flour", "Flaky sea salt and coarse sugar for sprinkling (or use kosher salt and granulated sugar)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and line 2 baking sheets with parchment paper or nonstick liners. In a mixer fitted with a paddle attachment, cream the butter and sugars until smooth and fluffy, at least 3 minutes. Add the peanut butter and eggs, and mix. Add the flour and salt and mix just until well combined, with no white flour showing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a small cookie scoop (about 2 teaspoons capacity), scoop dough onto prepared pans. The tops will be rounded but craggy. The cookies will not spread much or change shape when they bake, so they can be placed quite close together, but leave room for air circulation so they can brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix 2 tablespoons sugar with 1 tablespoon salt. Sprinkle each cookie lightly with sugar-salt mixture, getting it into the crags and crannies. Bake 12 to 15 minutes, until cookies are set and golden-brown. Carefully lift or slide off baking sheets and cool on racks. Store in layers separated by parchment paper, in airtight containers."}], "link": "https://cooking.nytimes.com/recipes/1017030-salty-sweet-peanut-butter-sandies"}