{"@context": "http://schema.org", "@type": "Recipe", "name": "Aylenish Rugelach With Orange, Walnuts and Cinnamon", "description": "Once upon a time, good Jewish housewives (known as balaboostas in Yiddish) all knew how to make pastries like strudel, rugelach and schnecken from scratch, using a cream-cheese-enriched dough supposedly stretched thin enough that you could read the newspaper through it. This was a day’s work, but with the arrival of good-quality puff pastry on the market, modern bakers can quickly (“aylenish” in Yiddish) produce this close cousin: a sweet, fragrant filling of nuts, spices and dried fruit wrapped in rich dough. Orange marmalade gives a tart undertone (and the faintest suggestion of a Christmas fruitcake), but apricot or raspberry jam are also considered classic.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/12/03/dining/03COOKFIGHT6/03COOKFIGHT6-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "About 4 dozen", "recipeCuisine": "jewish", "recipeCategory": "cookies and bars", "keywords": "dessert, golden raisins, orange marmalade, puff pastry", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 89, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "49 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup plus 2 tablespoons/55 grams golden raisins", "1/4 cup/60 milliliters rum (optional)", "2 tablespoons/25 grams granulated sugar, plus more for sprinkling", "2 tablespoons/30 grams dark brown sugar", "1/4 teaspoon ground cinnamon", "1/8 teaspoon ground nutmeg, preferably fresh", "1/2 cup/60 grams chopped toasted walnuts", "Salt", "1 cup/340 grams orange marmalade", "About 1 pound/500 grams puff pastry", "1 egg yolk, whisked with a splash of milk or water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak raisins in rum and 1/2 cup very hot water. In a medium bowl, combine both sugars, cinnamon, nutmeg, walnuts and a pinch of salt. Drain raisins (discard soaking liquid) and mix them into sugar mixture. In a saucepan, melt marmalade until runny. Remove any large chunks orange peel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut about a 4-ounce piece of puff pastry and roll out on a floured board into a rectangle, about 17 inches by 7 1/2 inches. The pastry should be thin and supple enough to drape, but not so thin that holes start to appear when rolling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush a 2 1/2-inch-wide stripe of marmalade down the long center of the rectangle. Sprinkle marmalade with filling and fold top edge down over filling. Brush the top of filled section with marmalade and sprinkle marmalade with filling. Fold bottom edge up over the filling to make a kind of flattened roll; do not press. Cut in half crosswise and refrigerate rolls for 20 to 30 minutes, or freeze for 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees; use the convection setting if you have it. Cut rolls across into 1/2-inch-wide slices. Place slices, seam side down, on baking sheet lined with parchment paper or nonstick liners. Brush tops with egg yolk and sprinkle with sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 20 to 25 minutes, until golden brown and puffed. Let cool slightly before removing to a cooling rack. Meanwhile, repeat with remaining pastry and filling. Store at room temperature in layers separated by parchment paper, in airtight containers."}]}