{"@context": "http://schema.org", "@type": "Recipe", "name": "Noodle Bowl With Soba, Enoki Mushrooms, Sugar Snap Peas and Tofu", "description": "Fresh enoki mushrooms are small thin-stemmed mushrooms with a small cap. They are widely available now in supermarkets and very nice in a noodle bowl. A noodle bowl makes for a comforting, filling winter meal and is easily put together. The broth only requires 20 minutes; make it your go-to vegetarian broth because it freezes well. I have found sliced dried shiitake mushrooms in specialty stores, and dried shiitakes in the Asian foods aisle of my local supermarket.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/10/science/recipehealthnoodle/recipehealthnoodle-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "japanese", "recipeCategory": "dinner, lunch", "keywords": "appetizer, main course, dairy-free, halal, high fiber, kosher, low cholesterol, low-fat, vegan, vegetarian, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 95}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 499, "unsaturatedFatContent": "36 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "7 grams", "sodiumContent": "61 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["6 to 8 dried shiitake mushrooms (or 1 ounce sliced dried shiitakes) or a small handful of dried porcinis or other dried mushrooms, rinsed", "1 bunch scallions, sliced, or 1 leek, white and light green part only, cleaned and sliced", "2 kombu strips", "1 medium carrot, sliced thin", "2 quarts water", "6 ounces Japanese soba noodles, cooked and tossed with 2 teaspoons sesame oil or grapeseed oil", "1/2 pound enoki mushrooms", "6 to 8 ounces tofu, either soft or firm, to taste, marinated tofu or commercial seasoned tofu, diced", "1/2 pound sugar snap peas, trimmed, strings removed", "1 bunch scallions, thinly sliced, light and dark green parts kept separate", "1/4 cup chopped cilantro, plus sprigs for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the broth, combine dried mushrooms, scallions or leek, kombu, carrots, and water in a saucepan or soup pot and bring to a simmer. Reduce heat to low, cover and simmer 20 minutes. Place a strainer over a bowl and line with cheesecloth. Drain broth and return to pot. Season to taste with soy sauce, salt or both."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring broth to a simmer. Add enoki mushrooms, tofu and sugar snap peas and simmer 2 to 3 minutes. If noodles have been refrigerated, warm by placing them in a strainer and dipping strainer into the simmering broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Distribute noodles among 4 deep or wide soup bowls. Add the white and light green parts of the scallions and chopped cilantro, cover and turn off heat. Allow to sit for 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle soup into bowls, taking care to distribute tofu, sugar snap peas, enokis and scallions evenly. Sprinkle dark green parts of the scallions over each serving, garnish with cilantro sprigs, and serve."}]}