{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Roasted Banana Ice Cream", "description": "A combination of coconut milk, homemade cashew milk and cocoa butter gives this dairy-free ice cream its particularly luscious, creamy texture. Ripe bananas, roasted with brown sugar and coconut oil until caramelized and golden, add a deep butterscotch-like note. You’ll need to start this at least one day before you plan to serve it. Or make it up to a week ahead. Chopped bittersweet chocolate makes a fine substitute for the walnuts, or use 1/3 cup of each.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/07/22/dining/22COOKBOOK1/22COOKBOOK1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "About 1 1/2 quarts", "recipeCuisine": "american", "recipeCategory": "ice creams and sorbets", "keywords": "banana, cashew, cocoa butter, coconut milk, coconut oil, dairy-free, gluten-free, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 147}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 334, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "19 grams", "sodiumContent": "135 milligrams", "sugarContent": "15 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 cups/200 grams raw, unsalted cashews", "4 medium bananas, preferably somewhat speckled but not brown, peeled and cut into 1/4-inch slices", "6 tablespoons plus 2 teaspoons/90 grams extra-virgin coconut oil", "2 tablespoons/28 grams dark brown sugar", "1 teaspoon/5 grams plus a pinch kosher salt", "3/4 cup/150 grams granulated sugar", "1/2 cup/80 grams cocoa butter, available at baking supply stores and online", "1 cup plus 2 tablespoons/266 milliliters coconut milk", "1/2 cup/65 grams chopped walnuts, toasted (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cashew milk, place the cashews in a large bowl and add water to cover by a couple of inches. Soak cashews overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the morning, drain the cashews and place them in a blender with about 1 3/4 cups (375 grams) fresh water. Blend until smooth. If you use a Vitamix, there will be no need to strain – the milk will be perfectly smooth; for other blenders, check the consistency and, if necessary, strain the cashew milk through a fine-mesh strainer. Cashew milk will keep well, covered and refrigerated, for up to 4 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To roast the bananas, heat the oven to 400 degrees with a rack in the middle. Line a rimmed baking sheet with parchment paper. In a large bowl, toss the bananas, 2 tablespoons/27 grams coconut oil, brown sugar and pinch of salt. Spread on prepared baking sheet and bake until caramelized, about 15 to 25 minutes. Transfer to a cooling rack and let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 1/4 cup water into a small saucepan over medium to low heat. Add sugar and cook, stirring frequently, until sugar has dissolved. Add cocoa butter, remaining 4 tablespoons plus 2 teaspoons/63 grams coconut oil and remaining salt. Stir until melted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the sugar mixture into in a food processor (or use a tall 2-quart container and an immersion blender), and add the coconut milk and 1 cup/212 grams cashew milk. Blend until smooth. Add roasted bananas and blend again to combine until very smooth. Cover and refrigerate the ice cream base until chilled, 1 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Freeze in an ice cream maker according to the manufacturer’s instructions. In the last minute of churning, add toasted walnuts, if desired, and churn until incorporated. Transfer the ice cream to a storage container and freeze up to 7 days. Alternatively, you can serve it immediately. It will be the consistency of soft-serve."}]}