{"@context": "http://schema.org", "@type": "Recipe", "name": "Butternut Squash Rice Paper Rolls", "description": "Sweet butternut squash stands in perfectly for the sweet shrimp in an otherwise traditional Vietnamese spring roll.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/01/27/dining/squash-rolls/squash-rolls-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "12 rolls", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, butternut squash, pumpkin seeds, rice paper wrappers, vermicelli rice noodles, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 43}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 147, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "153 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound butternut squash, peeled and cut into 1/2-inch cubes", "1 tablespoon olive oil", "4 ounces vermicelli rice noodles or rice sticks", "12 8-inch round rice paper wrappers", "1/3 cup roasted salted pumpkin seeds or peanuts, coarsely chopped", "1 cup cilantro leaves and thin stems, torn into bite-size pieces", "1 to 2 tablespoons soy sauce", "2 tablespoons rice vinegar", "2 teaspoons sugar", "2 tablespoons Asian hot chile oil", "2 teaspoons sesame oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Place squash on a baking sheet, drizzle with oil and spread in a single layer. Roast 15 minutes, toss gently and return to oven until tender and caramelized, about 10 more minutes. Transfer to a plate to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepares noodles: Bring a large pot of water to a boil. Turn off heat, add noodles, and allow to sit for 10 minutes, stirring occasionally. Drain in a colander and rinse with cold water; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble rolls: Fill a large pie plate or shallow bowl with very warm tap water. Lay a clean, damp kitchen towel on counter to use as a work surface; this will prevent wrappers from sliding. Submerge two paper wrappers in the water to soften, about 1 minute. Gently transfer one wrapper to towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In lower third of circle, place a small handful of noodles, leaving about an inch and a half of empty wrapper on either side. Place two or three pieces of squash on top of noodles, and sprinkle with pumpkin seeds and cilantro. To roll, fold left and right sides of wrapper snugly over the filling. Lift the bottom of the wrapper over the filling, tucking it underneath, then roll up firmly but gently. Place seam side down on a plate, and continue with remaining wrappers and filling. Cut in half when ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For dipping sauce: In a small bowl, stir together 1 tablespoon soy sauce, the vinegar and sugar. Add chile oil and sesame oil, and taste. If desired, add additional soy sauce."}]}