{"@context": "http://schema.org", "@type": "Recipe", "name": "Collard Greens Stuffed With Quinoa and Turkey", "description": "It takes some time, but I love filling collard greens. Bigger than grape leaves (so you don’t have to make as many), the large flat leaves are great stuffers. I used a combination of quinoa and leftover turkey for this slightly sweet Middle Eastern filling spiced with cinnamon and allspice; rice would work just as well.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/25/science/25recipehealth/25recipehealth-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "About 1 dozen stuffed leaves", "recipeCuisine": "greek, mediterranean", "recipeCategory": "dinner, lunch, snack", "keywords": "appetizer, main course, side dish, dairy-free, gluten-free, halal, kosher, low cholesterol, low-sodium, nut-free, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 28}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 110, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "348 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 large collard greens", "Salt", "1/4 cup extra virgin olive oil", "1 onion, finely chopped", "2 to 3 garlic cloves (to taste), minced", "1 (14-ounce) can chopped tomatoes", "1 teaspoon sugar", "2 tablespoons to 1/4 cup currants (optional)", "1/2 teaspoon cinnamon", "1/4 teaspoon freshly ground allspice berries", "1 1/2 cups cooked quinoa", "1/2 to 3/4 cup shredded turkey", "1/4 cup chopped fresh parsley", "3 tablespoons chopped fresh mint", "Freshly ground pepper", "1/2 to 1 cup water (as needed)", "Juice of 1 large lemon", "1 tablespoon tomato paste", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a bowl with cold water. Bring a large pot of water to a boil while you carefully remove the thick, tough stems from collard greens, trying to keep leaves intact. Break them off about 1 to 2 inches into the leaf, where they become less ropey. When water in pot comes to a boil, salt generously and add collard leaves, in batches. Blanch 2 minutes and transfer to cold water. Drain, gently squeeze out excess water and set aside on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of oil over medium heat in a large lidded skillet and add onion. Cook, stirring, until tender, about 5 minutes. Add garlic and a generous pinch of salt and cook, stirring, until garlic is fragrant, 30 seconds to a minute. Add tomatoes with juice, sugar, currants, cinnamon, allspice, and salt to taste. Cook, stirring often, until tomatoes have cooked down and mixture is fragrant, 10 to 15 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl combine quinoa, turkey, mint and parsley. Add tomato mixture and stir together. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a wide, deep, lidded sauté pan or saucepan with olive oil. To fill leaves, place one on your work surface, vein side up with stem end nearest to you. The leaf may have a big space in the middle where you stemmed it; if it does, pull the two sides of the leaf in toward each other and overlap them slightly.  Place 2 level tablespoons of filling on bottom center of each leaf, leaving a margin of about 3/4 inch below. Fold bottom up and over, fold sides over, then roll up tightly, tucking in the sides as you go. Place seam side down in pan, crowding the pan with snug layers. Drizzle on remaining 2 tablespoons of olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together 1/2 cup water, tomato paste and lemon juice. Season with salt if desired. Pour over stuffed collard greens. The rolls should be just submerged. Add more water if necessary. Cover stuffed leaves with a round of parchment or wax paper, and place a plate or small lid over the paper to weight them during cooking. Bring to a simmer, cover and simmer over low heat for 30 to 45 minutes. Leaves should be just tender. Remove from heat and carefully remove rolls from pot with a slotted spoon or tongs. Serve warm or cold, with juice from pan spooned over if desired."}], "link": "https://cooking.nytimes.com/recipes/1017005-collard-greens-stuffed-with-quinoa-and-turkey"}