{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange-Cranberry Glazed Cake", "description": "This orange cranberry cake is a gift to the holiday baker. It can be made ahead. It travels well. And it can be brought out any time of day — with coffee or tea in the morning or afternoon, or with Cognac or plum brandy after dinner. Dried cranberries add a jaunty burst of color that is especially nice for the most festive time of year. Don’t worry if all the glaze doesn’t stick; that is the charm of this cake.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2016/11/02/dining/02CAKE1/02CAKE1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "dessert, dried cranberries, navel orange, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 392}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 472, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "96 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "6 grams", "sodiumContent": "243 milligrams", "sugarContent": "67 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup/226 grams unsalted butter (2 sticks), at room temperature (or use 1 cup/236 milliliters coconut oil)", "3 cups/360 grams all-purpose flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "1/2 teaspoon kosher salt", "1 1/2 cups/297 grams granulated sugar", "4 large eggs (3 whole and 1 separated)", "2 medium to large navel oranges", "1 1/4 cups/160 grams dried cranberries", "1/4 cup lemon juice (from 1 lemon)", "3 to 3 1/2 cups/340 to 397 grams confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Grease a Bundt pan or ring mold with a little of the butter and flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together flour, baking powder, baking soda and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a stand mixer, beat together butter and sugar until well blended. Add the 3 whole eggs, the yolk and half the egg white. (Reserve the rest of the white for the glaze.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Zest the oranges, then juice them, adding both the zest and 3/4 cup/177 milliliters juice to the batter and mix to incorporate. (Reserve remaining juice for the glaze.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add flour mixture to the mixer and beat until well combined. Stir in 1 cup/128 grams dried cranberries. Pour batter into the cake pan, shaking the pan so the batter firmly settles and there are no air bubbles. Bake for 45 minutes or until a toothpick inserted comes out clean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake is baking, prepare the glaze: Mix the remaining half an egg white with lemon juice and 1/4 cup/59 milliliters orange juice. Gradually beat in 3 cups/340 grams confectioners’ sugar, mixing until all the lumps have disappeared and the glaze is thick and smooth, adding more sugar if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cake cool in the pan for 15 minutes. Insert a knife between the cake and the pan to loosen it, put a rack on top of the pan, and flip the cake onto the rack. Set the rack on top of a plate, then spoon on the glaze when the cake is still warm, scooping up any glaze that drips onto the plate and using it to reglaze the cake. Transfer to a serving plate and decorate with remaining cranberries before the glaze sets."}], "link": "https://cooking.nytimes.com/recipes/1018381-orange-cranberry-glazed-cake"}