{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Pavlova With Chocolate Mousse", "description": "Most pavlovas are white and fluffy nests filled with whipped cream and fruit. This is a dark and fudgy reinterpretation, with cocoa powder in the meringue and bittersweet chocolate in the mousse on top. What was once billowing and light becomes rich and intense. Because the cocoa powder has a small amount of fat in it, the meringue here will not hold its shape as well as a regular pavlova. So there’s no need to pipe out any fancy designs, which will melt in the oven. Instead, decorate the top with fresh berries or chocolate shavings to create a showstopper of a dessert. You can make the meringue and mousse a day ahead, but don’t assemble the dessert until just before serving.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/03/14/multimedia/clark-pavlova/clark-pavlova-mediumThreeByTwo440-v2.jpg", "totalTime": "PT4H", "recipeYield": "8 servings", "recipeCuisine": "australian", "recipeCategory": "project", "keywords": "bittersweet chocolate, cocoa powder, eggs, sugar, dessert, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 223}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 802, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "79 grams", "cholesterolContent": null, "fatContent": "55 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "33 grams", "sodiumContent": "163 milligrams", "sugarContent": "73 grams", "transFatContent": null}, "recipeIngredient": ["6 egg whites, at room temperature (save the yolks for the mousse)", "1 1/2 cups/300 grams granulated sugar", "1/8 teaspoon cream of tartar", "Pinch of fine sea salt", "1/4 cup/28 grams unsweetened cocoa powder, sifted", "3 cups/710 milliliters heavy cream", "6 egg yolks", "6 tablespoons/70 grams granulated sugar", "Pinch of fine sea salt", "12 ounces/340 grams bittersweet chocolate, chopped, melted and cooled", "1 teaspoon vanilla extract", "1 tablespoon rum", "1 cup crème fraîche, lightly whipped", "Fresh berries or chocolate shavings (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pavlova: Heat oven to 250 degrees. Line a baking sheet with parchment paper and draw an 8-inch circle in the middle, then flip the paper upside down. You should still be able to see the outline."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix egg whites, sugar, cream of tartar and salt in a mixing bowl set over a pan of simmering water. Whisk constantly until sugar dissolves and mixture is warm, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and, using an electric mixer, beat with the whisk attachment on medium-high speed until stiff peaks form, about 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently sift cocoa powder over the egg whites, then use a rubber spatula to fold the cocoa into the whites until just combined. A few cocoa streaks are O.K. and in fact better than overmixing, which can deflate the meringue."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon half the meringue mixture onto the circle on the parchment paper to form a round, spreading it all the way to the edges. Dollop remaining meringue around the outer edges on top of the circle, creating a nest to hold the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 2 hours, or until dry and firm to the touch. Turn off the oven and allow the pavlova to cool in the oven 1 hour. Remove from oven and, if necessary, continue to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the mousse: In a medium saucepan, whisk together 1 1/4 cups/295 milliliters cream, the yolks, 3 tablespoons/35 grams sugar and the salt. Cook over medium-low heat, stirring constantly, until mixture coats the back of a spoon, 3 to 4 minutes. Remove from heat and pass through a fine-mesh strainer into a large bowl. Whisk in melted chocolate, vanilla and rum. Chill until cold, at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer, whisk together the remaining 1 3/4 cups/415 milliliters cream with remaining 3 tablespoons/35 grams sugar until firm peaks form. Stir 1/3 of the whipped cream into the chocolate mixture to lighten it, then gently fold in the remaining cream. Refrigerate, covered, at least 30 minutes or up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, spoon mousse into the center of the cooled pavlova, then top with crème fraîche. Top with fresh berries or chocolate shavings if desired."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Chocolate Pavlova with Chocolate Mousse", "description": "A traditionally white and fluffy dessert gets a dark chocolate makeover.", "thumbnailUrl": "https://static01.nyt.com/images/2016/03/14/multimedia/clark-pavlova/clark-pavlova-mediumThreeByTwo440-v2.jpg", "uploadDate": "2016-03-15T17:02:43.000Z", "duration": "PT3M2S"}}