{"@context": "http://schema.org", "@type": "Recipe", "name": "Ginger-Molasses Cookies", "description": "Think of these cookies as a cross between a gingerbread man and a chewy molasses cookie. Adding molasses gives them a softer texture with a decidedly adult, almost caramel flavor. Instead of rolling or slicing these cookies, this rich, soft dough is perfect for rolling into balls and coating in coarse sugar before baking. The dough can even be made up to 5 days ahead and refrigerated, or baked 2 days ahead and stored at room temperature.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/12/18/dining/AR-ginger-molasses-cookies/merlin_148112727_965e0f17-e62d-4fcc-a76b-50a818c3ad53-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 2 dozen cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 360}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 249, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "7 grams", "sodiumContent": "105 milligrams", "sugarContent": "19 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cups/435 grams all-purpose flour", "1 tablespoon ground ginger", "2 teaspoons ground cinnamon", "1 teaspoon baking powder", "1 teaspoon kosher salt", "1/2 teaspoon ground allspice", "1 1/2 cups/341 grams (3 sticks) unsalted butter, at room temperature", "3/4 cup/177 milliliters molasses", "1/2 cup/100 grams granulated sugar", "2 large eggs", "1 teaspoon vanilla extract", "About 3/4 cup/165 grams pearl, Demerara or coarse sugar, for rolling", "Do ahead: Cookie dough can be made 5 days ahead, refrigerated. Bring dough to room temperature before rolling. Cookies can be baked 2 days ahead, wrapped tightly and stored at room temperature."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together flour, ginger, cinnamon, baking powder, salt and allspice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another bowl, using an electric mixer, beat together butter, molasses and sugar on medium-high until the mixture is superlight, fluffy and pale, about 5 minutes. Scrape down the sides of the bowl and add in eggs, 1 at a time, beating well after each addition. Add vanilla extract, and beat until everything is well combined, again stopping to scrape down bowl as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add dry ingredients all at once, and mix on low speed until just incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill dough in refrigerator for 30 to 45 minutes, until firm enough to roll."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands, roll heaping tablespoons of dough into balls, then roll them in coarse sugar. (Sanding sugar is festive, but turbinado or coarse sugar will do the trick as well.) If dough becomes too soft to roll, put back in the refrigerator for 10 to 15 minutes. Place balls on a parchment-lined baking tray 2 inches apart and bake until the cookies are puffed, golden brown around the edges and baked through and the tops spring back slightly when touched, 12 to 15 minutes."}]}