{"@context": "http://schema.org", "@type": "Recipe", "name": "Julia Child’s Eggplant-Walnut Dip", "description": "This recipe from the second volume of \"Mastering the Art of French Cooking\" is nontraditional but very Julia Child, with her famous love of cocktail snacks. Caviar d'aubergines, fluffy eggplant caviar, is popular in the South of France, but this one contains raw ginger and hot sauce, two of the least-French ingredients imaginable. Feel free to tinker with the spices (cumin and coriander are also good) and the heat level. This dip ripens very well over a few days in the refrigerator. Taste and re-season before serving.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/09/21/dining/21JULIAREX3/21JULIAREX3-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 4 cups", "recipeCuisine": "", "recipeCategory": "dips and spreads", "keywords": "allspice, eggplant, ginger, hot sauce, walnut, appetizer, gluten-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 236}, "recipeIngredient": ["2 firm, shiny eggplants (about 2 pounds total)", "1 cup finely chopped toasted walnuts", "1 to 3 garlic cloves, smashed, peeled and minced or put through a press", "1 teaspoon freshly grated ginger", "1/4 teaspoon ground allspice (or another warm spice or spice blend, like cinnamon, coriander or garam masala)", "Salt and freshly ground black pepper", "Hot sauce, such as Tabasco", "5 to 8 tablespoons extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Cut green caps off eggplants and place them whole in a baking dish. Bake until very soft and collapsing, 30 to 35 minutes. When cool enough to handle, scrape flesh into the bowl of a mixer (or use a hand mixer)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat at high speed for about two minutes, until smooth and fluffy. Add walnuts, garlic, ginger, allspice, two big pinches of salt and one of pepper. Shake in a few dashes of hot sauce. Mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer running, gradually drizzle in oil, as if making mayonnaise, just until mixture is emulsified and creamy. Stop, taste and adjust the seasonings with salt, pepper and hot sauce. If desired, beat in remaining olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately, or cover and refrigerate for up to one week."}]}