{"@context": "http://schema.org", "@type": "Recipe", "name": "Sicilian-Style Citrus Salad", "description": "Winter is the season when many kinds of citrus fruits suddenly appear. For this savory fruit salad, a mixture of navel, blood and Cara Cara oranges and a small grapefruit make a colorful display. It’s fine to use just one kind of orange, blood oranges being the classic example. Thinly sliced fennel, celery and red onion add a tasty bit of crunch. The salad is dressed assertively with oil and vinegar, and scattered with olives and flaky sea salt.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/02/01/dining/01KITCH/01KITCH-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "brunch, dinner, easy, lunch, salads and dressings", "keywords": "appetizer, side dish, blood orange, cara cara orange, fennel, grapefruit, navel orange, raw, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 251}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 186, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "6 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "653 milligrams", "sugarContent": "20 grams", "transFatContent": null}, "recipeIngredient": ["3 to 4 tablespoons olive oil", "2 tablespoons sherry vinegar or red wine vinegar", "Salt and pepper", "2 navel oranges", "4 blood oranges", "2 Cara Cara oranges", "1 small grapefruit", "1 small red onion, very thinly sliced", "1 small fennel bulb, very thinly sliced, enough to make 1 cup", "2 or 3 tender inside celery stalks, thinly sliced at an angle", "Handful of olives, black oil cured type or green Castelvetrano type, pitted", "Winter salad leaves, such as radicchio or escarole, optional", "Large pinch of flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the vinaigrette: Whisk together olive oil and vinegar in a small bowl. Season with salt and pepper and set aside. It should be tart but not over-vinegary. Taste and add a little more olive oil if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To peel the citrus fruit, use a small serrated knife. First, cut off a thin slice of peel from the top and bottom of the orange, so it can sit flat and securely on the cutting board. Use a sawing motion to take off the peel, cutting from top to bottom, following the curve of the fruit. Remove only the peel and white pith, not the flesh of the orange. It should now be perfectly spherical and naked. Peel remaining oranges and grapefruit in this fashion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully slice peeled citrus crosswise. Arrange slices on a large serving platter in a random pattern, letting them overlap a bit here and there. Scatter onion, fennel and celery over top. Dot the surface with olives. Surround with salad leaves, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk vinaigrette, and spoon evenly over the salad. Sprinkle lightly with flaky salt and serve."}], "link": "https://cooking.nytimes.com/recipes/1018551-sicilian-style-citrus-salad"}