{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Chicken Tenders", "description": "Chicken tenders may be known as a kid favorite, but it's hard to find an adult who doesn't enjoy them just as much. And there's a lot to love when a crisp, golden brown coating meets juicy, tender chicken strips. This weeknight version strays slightly from the traditional deep-fried recipe: It can be pan-fried (see tip below), but it shines when baked in the oven. Proper chicken tenders, or the smaller muscle underneath the breast, can be hard to find, but boneless, skinless breasts — from chicken, or even turkey — sliced into thin strips are an excellent stand-in. For a little punch, feel free to add cayenne, crushed red-pepper flakes or fennel seed, or ground cumin to the flour mixture. Lastly, this version is paired with an herbed yogurt dip, but it can also be served with ketchup.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2017/12/31/dining/28COOKING-CHICKENTENDERS2/28COOKING-CHICKENTENDERS2-mediumThreeByTwo440.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, finger foods, poultry", "keywords": "bread crumbs, chicken breast, chives, dill, paprika, parsley, yogurt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1641}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 765, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "70 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "5 grams", "proteinContent": "60 grams", "saturatedFatContent": "7 grams", "sodiumContent": "972 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups full-fat Greek yogurt, labneh or sour cream", "1/4 cup finely chopped chives", "1/4 cup finely chopped parsley", "2 tablespoons finely chopped dill", "2 tablespoons fresh lemon juice", "1 small garlic clove, finely grated or chopped", "Kosher salt and freshly ground pepper", "1 1/2 pounds boneless, skinless chicken breasts", "Kosher salt and freshly ground pepper", "1 cup all-purpose flour", "2 teaspoons smoked paprika", "2 large eggs, beaten to blend", "2 cups bread crumbs (preferably panko or other coarse bread crumbs)", "3 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dip: Mix yogurt, chives, parsley, dill, lemon juice and garlic in a small bowl; season with salt and plenty of pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chicken: Heat oven to 450 degrees. Cut chicken breasts lengthwise into about 1 1/4-inch-wide strips. Season with salt and pepper, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together flour and paprika in a medium bowl, and season with salt and pepper. Place eggs in a large bowl and whisk with 1 teaspoon water. Season with salt and pepper. Put bread crumbs in a large bowl or shallow baking dish, and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with few pieces at a time, toss the chicken in the flour mixture, making sure it’s evenly coated. Shake off excess flour, and dip into egg wash. Shake off any excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip chicken into bread crumb mixture a few pieces at a time, pressing to adhere as many bread crumbs as possible. Shake off any excess, and set chicken aside on a large plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place breaded chicken strips on a foil- or parchment-lined rimmed baking sheet. Drizzle with olive oil, and bake until one side is beginning to brown, 6 to 8 minutes. Using tongs or a spatula, flip chicken and continue to cook until the other side is golden brown and crisp, another 6 to 8 minutes. Serve with herbed yogurt dip."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Baked Chicken Tenders", "description": "Yes, you can make these kid- (and adult-) pleasers at home.", "thumbnailUrl": "https://static01.nyt.com/images/2017/12/31/dining/28COOKING-CHICKENTENDERS2/28COOKING-CHICKENTENDERS2-mediumThreeByTwo440.jpg", "uploadDate": "2017-09-09T14:13:26.000Z", "duration": "PT1M33S"}, "link": "https://cooking.nytimes.com/recipes/1018615-baked-chicken-tenders"}