{"@context": "http://schema.org", "@type": "Recipe", "name": "Pistachio and Raspberry Tart", "description": "Green pistachio filling and tangy raspberries make a great flavor combination in this delicious tart. Consider serving it with a scoop of vanilla ice cream or a spoonful of crème fraîche.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2017/07/05/dining/05BAKING2/05BAKING2-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "dessert, pistachio, raspberries", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 151}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 505, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "5 grams", "proteinContent": "12 grams", "saturatedFatContent": "10 grams", "sodiumContent": "112 milligrams", "sugarContent": "22 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup plus 1 tablespoon/150 grams all-purpose flour (plain flour), more as needed", "1 tablespoon plus 1 teaspoon/20 grams granulated or superfine sugar (caster sugar)", "1/4 teaspoon salt", "1 teaspoon finely grated lemon zest", "5 1/2 tablespoons/80 grams cold unsalted butter, cut into 3/4-inch/2-centimeter pieces", "1/4 teaspoon white wine vinegar", "2 to 3 tablespoons ice water", "2 1/2 cups/350 grams raw, shelled pistachios", "4 tablespoons/60 grams unsalted butter, melted", "1 teaspoon lemon zest, plus 1 tablespoon lemon juice", "1 teaspoon vanilla extract (vanilla essence)", "1/8 teaspoon almond extract (almond essence)", "1/8 teaspoon salt", "3 large eggs", "2/3 cup/150 grams granulated or superfine sugar (caster sugar)", "1 tablespoon/15 grams all-purpose flour (plain flour)", "1 heaping cup/150 grams fresh raspberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pastry: Place flour, sugar, salt, lemon zest and butter in a food processor and blitz for about 15 seconds, until it reaches the consistency of fine bread crumbs. With the machine running, add vinegar and then add water slowly, 1 tablespoon at a time, until mixture comes together (you may not need all the water). Form dough into a ball, wrap with plastic wrap and refrigerate for at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured work surface, roll out dough to form a circle about 13 inches/33 centimeters wide and 1/8 inch/2 millimeters thick. Carefully transfer the dough (wrap it around a rolling pin, if that helps you) to a 9-inch/26-centimeter round fluted tart pan with 1-inch/3-centimeter-high sides. Press the dough securely into the corners of the pan and trim the crust 1/4 inch/1/2 centimeter above the rim of the pan, then refrigerate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees Fahrenheit/200 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the dough with a large piece of baking parchment and fill the tart with dried beans or pie weights. Bake for 25 minutes, or until pastry is golden brown around the edges. Remove beans and paper and continue to bake the pastry for 8 minutes until the base is golden brown. Remove from oven and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower oven temperature to 350 degrees Fahrenheit/170 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Spread pistachios out on a baking sheet and roast for 8 minutes, until they are hot but haven't taken on any color. Remove from oven and carefully transfer 3/4 cup/100 grams nuts to a cutting board and set aside. Immediately blitz remaining nuts in a food processor while they are still hot. Keep the machine going for 6 to 8 minutes, scraping down the sides of the bowl a few times when the nuts stop moving, until you get a thick smooth paste and the nuts begin to ball up in the bowl. Add melted butter, lemon zest, juice, vanilla extract, almond extract and salt and pulse a few times until combined. Roughly chop the reserved pistachios."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place eggs in the bowl of a stand mixer fitted with the whisk attachment. Whisk on high speed for 3 to 4 minutes, until soft peaks form. Reduce speed to medium and slowly add the sugar until incorporated. Add flour, pistachio paste and chopped pistachios and mix on low until combined. (You may need to scrape the pistachio paste off the bottom of the bowl.) Pour the mixture into the tart shell, spreading it out evenly. Sprinkle raspberries over the filling and bake for about 35 minutes, until golden-brown around the edges, pale golden in the center and set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and let cool completely in the pan. Once cool, the tart can be lifted out of the pan and transferred to a platter to slice and serve. The filling should be soft, but still hold its shape when sliced."}]}