{"@context": "http://schema.org", "@type": "Recipe", "name": "Olive Oil Challah", "description": "Made with extra-virgin olive oil, this challah is especially rich and complex tasting. A little bit of grated citrus zest, if you choose to use it, adds a welcome brightness to the soft, slightly sweet loaf, which is also flavored with orange juice. (Don't use store-bought orange juice with preservatives; it can inhibit yeast growth. It’s best to squeeze the oranges yourself.) If you’d prefer a more classic challah, substitute a neutral oil such as safflower or grapeseed for the olive oil and leave out the zest.\nThis recipe makes one large loaf (about 1 pound). Feel free to double it if you’re feeding a crowd or if you’d like to toss one loaf into the freezer, where it will keep well for up to 3 months.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/12/21/dining/21APPE-CHALLAH/21APPE-CHALLAH-mediumThreeByTwo440.jpg", "totalTime": "PT3H40M", "recipeYield": "1 loaf", "recipeCuisine": "jewish", "recipeCategory": "breads", "keywords": "bread flour, orange juice, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 730}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 252, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "177 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup/118 milliliters fresh orange juice at room temperature (from about 2 medium oranges; see tip)", "2 1/4 teaspoons/1/4 ounce/7 grams active dry yeast (1 packet)", "1/3 cup/78 milliliters olive oil", "3 large eggs, at room temperature", "1 large egg yolk, at room temperature", "3 tablespoons/37 grams sugar", "1 teaspoon kosher salt", "1/4 to 1/2 teaspoon grated orange or lemon zest, to taste (optional)", "3 to 3 1/2 cups/360 to 420 grams bread flour, plus more for kneading dough"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer, combine orange juice and 1 tablespoon water. Sprinkle yeast over top and let sit until frothy, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add oil, 2 eggs, 1 yolk, the sugar, the salt and the zest, if using, and beat with a dough hook until just combined. Add in flour, 1 cup/125 grams at a time, until dough comes together into a sticky mass. You may or may not use all of the flour, so at the end, add it gradually. The dough should come away from the sides of the bowl but not be at all stiff. You’re looking for a slightly sticky, soft dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to floured work surface and knead until smooth, about 5 minutes. Transfer to an oiled bowl and turn the dough over. Cover bowl with a clean dish towel and let rise in a draft-free place until doubled, about 1 1/2 to 3 hours, depending on the temperature in your kitchen. (It may take longer in colder kitchens.) Press down dough to expel all the air, cover bowl, and let rise for another 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, make egg wash by combining the remaining 1 egg with 1 teaspoon water. To make a classic braided challah, cut dough into three equal pieces and roll them each into ropes 12 inches long. Or, to make a braided round loaf, cut dough into six equal pieces and roll them each into thinner ropes 12 inches long."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Braid the challah: If you are making a classic challah with three ropes, just braid them into a loaf, tucking the edges under. To braid it into a round loaf, first lay three ropes parallel to one another on the work surface, leaving 1 inch between them. Take one of the remaining ropes and hold it perpendicular to the three ropes, across the center. Weave that rope through the three ropes, as if you were creating a lattice for a pie; leave the edges free. Repeat with remaining two ropes. The resulting shape should look somewhat like a pound or number sign, but with a woven center. Then, starting from the ends of the three ropes closest to you, braid the loose edges of the ropes and pinch the ends together. Repeat with the remaining ends of the ropes; you should end up with a lattice in the middle with 4 braids radiating out from it. Tuck the braids underneath the lattice to create a round loaf, place on a small rimmed baking sheet, then brush with egg wash. Let rise uncovered for 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat oven to 375 degrees with a rack in the middle. Gently brush a second coat of egg wash on the dough, then bake for 25 to 35 minutes, until challah is a deep rich brown and the bottom sounds hollow when tapped. (When it starts smelling like freshly baked bread, start checking.) Cool on a wire rack before serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Challah", "description": "Challah bread is delicious fresh out of the oven, but it gets even better with the addition of orange juice and olive oil.", "thumbnailUrl": "https://static01.nyt.com/images/2016/12/21/dining/21APPE-CHALLAH/21APPE-CHALLAH-mediumThreeByTwo440.jpg", "uploadDate": "2016-12-16T19:56:31.000Z", "duration": "PT3M56S"}, "link": "https://cooking.nytimes.com/recipes/1018481-olive-oil-challah"}