{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Pesto Sauce", "description": "The key to making creamy pesto is to add the ingredients to the food processor in the right order to ensure that the nuts break down to a fine paste before the greens have a chance to turn brown. Use basic basil pesto as a pasta sauce, or thin it out with a little olive oil to drizzle it over steak, chicken, fish, pizza or tomato salad. The mint-pistachio variation is inspired by the chef Travis Lett, of Gjelina in Venice, Calif.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2016/08/03/dining/03SauceSUB3/03SauceSUB3-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "1 2/3 cups", "recipeCuisine": "italian", "recipeCategory": "quick, sauces and gravies", "keywords": "basil, parmesan, pine nuts, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 340}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 168, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "0 grams", "proteinContent": "3 grams", "saturatedFatContent": "3 grams", "sodiumContent": "88 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup pine nuts, lightly toasted", "3/4 cup extra-virgin olive oil", "2 garlic cloves", "2 cups packed basil leaves (2 1/2 ounces/75 grams, from 1 big bunch or 2 small bunches)", "1 cup finely grated Parmesan cheese (3 ounces/85 grams)", "1/2 teaspoon kosher salt, more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulse pine nuts in a food processor until they're completely broken down. Stop to scrape down the sides of the bowl with a spatula from time to time. Add olive oil and garlic and pulse until garlic is finely chopped."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop basil very roughly — just run a knife through it once or twice to cut most of the leaves into halves or thirds — then add to food processor. Pulse, stopping every 15 seconds to push the leaves down with a rubber spatula, until basil is entirely worked into the oil. Pulse for another few seconds, and then stop to prevent turning the basil brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour pesto base into a bowl and add grated cheese and salt. Stir to combine, then taste and adjust seasoning as needed. Leave the sauce thick to toss with cooked pasta and a little pasta cooking water. To use the pesto as a garnish for grilled or roasted meats, fish and vegetables, thin it out with 2 to 3 more tablespoons olive oil until it’s the consistency of a loose paste. To store leftovers, pour a little more olive oil over the pesto to cover. Refrigerate in an airtight container for up to three days."}], "link": "https://cooking.nytimes.com/recipes/1018235-basic-pesto-sauce"}