{"@context": "http://schema.org", "@type": "Recipe", "name": "A Very Updated Vegetable Chartreuse", "description": "This is the rare recipe for which I think it important to look at the picture — this updated one, not an intimidating old one — before beginning. A single glance confirms that the dish is not technically difficult to make, though it is a bit laborious. The leaves hold all the fillings, and the whole thing retains an odd calm beauty, the way a tree in bloom does.", "author": {"@type": "Person", "name": "Tamar Adler"}, "image": "https://static01.nyt.com/images/2016/03/27/magazine/27eat/27eat-articleLarge-v4.jpg", "recipeYield": "Serves 6-8", "recipeCuisine": "", "recipeCategory": "", "keywords": "cabbage, celery, crème fraîche, mushroom, parmesan, sherry, spinach, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 75}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 293, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "6 grams", "proteinContent": "12 grams", "saturatedFatContent": "12 grams", "sodiumContent": "742 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 head savoy cabbage, about 2 pounds", "1 1/2 cups combined julienne celery and celery leaves, plus 1 1/2 cups finely diced celery", "4 teaspoons sea salt, separated, plus more for blanching", "9 tablespoons butter, separated", "2 tablespoons olive oil, separated", "1/4 cup finely diced white onion or shallot", "1 clove garlic, finely chopped", "3-4 tablespoons mixed chopped sage, rosemary and thyme", "9-10 cups finely diced mushrooms — any combination white-button, cremini, wild", "1/4 cup good dry white wine", "1/4 cup chopped parsley leaves, or mixed parsley and celery leaves", "1 1/2 tablespoons crème fraîche", "2 pounds or 4 large bunches spinach", "1 large grate of nutmeg", "1 tablespoon plus 1 teaspoon sherry", "1 cup grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the cabbage core/stem end. Separate off 12-13 leaves (several will be extra), choosing the biggest, most beautiful. Boil a pot of water, and salt until it tastes like pleasant seawater. Cook separated leaves in two batches, 3-4 minutes each, removing when they are pliable with a sieve or tongs to a baking tray lined with cloths or a large colander. Let them drain until very dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "From the remaining cabbage, very finely slice two cups of leaves, leaving the thick central stem behind (save/freeze for vegetable soup). Add the 1 1/2 cups julienne celery and leaves and 1 teaspoon salt. Mix well, and leave sitting at room temperature for at least an hour and up to 2 hours, mixing occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 3 tablespoons butter and 1 of olive oil in a very large pan. Once butter is melted, add chopped onion, garlic, remaining celery and combined sage, rosemary and thyme, and mix well. Cook over medium heat, stirring regularly, until onion is just translucent. If it starts to brown or stick, add a few drops of water. Add all diced mushrooms, and stir occasionally, cooking 15-25 minutes until the mushrooms’ liquid has all emerged and evaporated. Add 2 teaspoons salt. Mix through, add white wine and cook for another minute. Turn off heat. Add parsley/celery leaves and crème fraîche, and mix through. Remove to a bowl, and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse spinach in a large colander. Put a large pan over medium-high heat. Cook spinach in batches with only the water clinging to the leaves until they are completely wilted. Remove to a colander to cool. Put the spinach in a strong clean kitchen cloth, and squeeze well, until completely dry. Put leaves through a food processor until very well chopped (or chop finely by hand). In a small pan, heat 5 tablespoons butter in 1 tablespoon olive oil until butter has just begun to brown. Add chopped spinach and nutmeg. Add 1 teaspoon sea salt, then sherry. Cook a few moments, until sherry is absorbed. Turn off heat. Add Parmesan and mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350. Lightly butter a 6- or 7-inch springform pan. Make sure the cabbage leaves are very dry. Put the prettiest cabbage leaf in the bottom of the pan, spreading it into a single layer. Trim any stem/central vein that overhangs. Use 5-7 more leaves to line the sides, pressing some of each leaf carefully into the bottom of the pan and the rest up the pan’s side. There should be some leaf remaining overhanging the top. Continue, lightly overlapping the leaves, until sides are covered. Put a third of the mushroom mixture into the food processor, and blend to semi-smooth. Mix back into the rest of the mushrooms. Spread half the mushroom mixture evenly into the bottom of the pan, over the cabbage. Cover with an even layer of half the spinach. Drain the cabbage-celery slaw very well, pressing all the liquid. Spread the very dry slaw over the cabbage. Repeat with the remaining spinach, and then the remaining mushrooms. Cover the mushrooms with 1-3 more cabbage leaves, in a very thin layer, trimming to fit if necessary. Fold overhanging leaves to cover the bottom. Dot with remaining butter, divided. Put into the middle of the oven. Bake 30 minutes. Remove from oven, and let sit to cool for 5-10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large plate over the cake pan. Invert the pan, and release the springform sides. Carefully remove the sides and top. Let the finished dish cool a few minutes more, then cut with a very sharp knife. Serve immediately, alone, or with a dollop of crème fraîche or ricotta on each serving."}], "link": "https://cooking.nytimes.com/recipes/1018041-a-very-updated-vegetable-chartreuse"}