{"@context": "http://schema.org", "@type": "Recipe", "name": "Moroccan Semolina and Almond Cookies", "description": "Semolina flour gives these rather plain-looking but delicious cookies, adapted from \"Dorie's Cookies\" by Dorie Greenspan, a delightfully sandy texture. Almond flour makes them moist and rich, adding a gentle flavor and scent. If you don’t have almond flour, make your own by pulsing blanched almond slices in a food processor until they're finely ground. Just don’t over-process, or you’ll wind up with almond butter. And if you’re not a fan of orange blossom water, you can leave it out, or substitute rose water.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/12/07/dining/07JPCOOKBOOKS9/07JPCOOKBOOKS9-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 3 dozen cookies", "recipeCuisine": "moroccan", "recipeCategory": "cookies and bars", "keywords": "almond flour, orange blossom water, semolina flour, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 185}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 127, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "0 grams", "sodiumContent": "36 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 3/4 cup plus 2 tablespoons/294 grams semolina flour", "2 cups/200 grams almond flour", "1 1/2 teaspoons baking powder", "1/4 teaspoon fine sea salt", "3/4 cup/150 grams granulated sugar", "1 lemon", "2 large eggs, at room temperature", "1/4 cup/60 milliliters flavorless oil, such as canola", "1 teaspoon pure vanilla extract", "1 teaspoon orange blossom water (optional)", "Confectioners’ sugar, for dredging"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Position racks to divide the oven into thirds, and heat it to 350 degrees. Line two baking sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, whisk together semolina, almond flour, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put sugar in bowl of a stand mixer fit with a paddle attachment, or in a large bowl in which you can use a hand mixer. Finely grate lemon zest over sugar, then rub them together with your fingertips until sugar is moist and fragrant. Add eggs and beat on medium speed for 3 minutes. With mixer running, pour oil down side of the bowl and beat for another 3 minutes. Beat in vanilla and orange blossom water, if using. Turn off mixer, add half the dry ingredients and mix them in on low speed, then add the rest, mixing only until dry ingredients disappear into the dough, which will be thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift some confectioners’ sugar into a small bowl. For each cookie, spoon out a level tablespoon of dough, roll it between your palms to form a ball and dredge in sugar. Place balls 2 inches apart on the lined baking sheets, then use your thumb to push down the center of each cookie, pressing firmly enough to make an indentation and to cause the edges to crack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 14 to 16 minutes, rotating pans top to bottom and front to back after 8 minutes, or until cookies are ever so lightly colored: They will be golden on the bottom, puffed, dramatically cracked and just firm to the touch. Carefully lift the cookies off sheets and onto racks. Cookies will keep for about 4 days in a covered container at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1018451-moroccan-semolina-and-almond-cookies"}