{"@context": "http://schema.org", "@type": "Recipe", "name": "Mississippi Mud Pie", "description": "Mississippi mud pies come in all shapes and sizes: No two are exactly alike. They can have one layer, or five, and include ice cream or meringue, a flourless cake, nuts, fudge sauce and even brownie. This version, inspired by the towering beauty made by Matt Lewis and Renato Poliafito of Baked in Brooklyn and written about in their book, \"Baked Explorations,\" features a graham cracker base, a dense brownie, chocolate custard and whipped cream. Needless to say, a little goes a long way. Share it with 16 to 32 of your closest friends. And a tip for serving: To ensure a clean release, give the underside and sides of the cake pan a 10-second blast with a hairdryer.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2017/04/11/dining/11COOKING-MISSISSIPPI-MUD-PIE2/11COOKING-MISSISSIPPI-MUD-PIE2-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "16 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "bittersweet chocolate, cocoa powder, graham cracker, dessert, nut-free, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 274}, "recipeIngredient": ["About 15 whole graham crackers", "1/4 cup/50 grams granulated sugar", "1/2 teaspoon kosher salt", "8 tablespoons/114 grams (1 stick) unsalted butter, melted", "8 tablespoons/114 grams (1 stick) unsalted butter, cut into pieces", "6 ounces/170 grams bittersweet chocolate, chopped", "1/3 cup/67 grams dark brown sugar", "1/3 cup/33 grams Dutch-processed cocoa powder, plus more for dusting", "1 teaspoon pure vanilla extract", "3/4 teaspoon kosher salt", "3 large eggs, separated", "1/2 cup/100 grams granulated sugar", "1/4 cup/32 grams all-purpose flour", "4 ounces/113 grams bittersweet chocolate, chopped", "2 tablespoons/29 grams unsalted butter, cut into pieces", "1/2 cup/100 grams granulated sugar", "1/4 teaspoon kosher salt", "1/4 cup/25 grams Dutch-processed cocoa powder", "1/4 cup/28 grams cornstarch", "2 cups/480 milliliters whole milk", "4 large egg yolks", "1 1/2 cups/360 milliliters cold heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees. In a food processor, grind the graham crackers to fine crumbs — you should have about 2 1/4 cups crumbs — and tip into a bowl. Add sugar, salt and butter, and toss until evenly moistened. Tip the crumb mixture into a 9-inch springform pan. Use your fingers to press the crumbs into a thin, even layer on the bottom of the pan and at least 2 1/4 inches up its sides. Bake the crust until just set, about 10 minutes. (The crust will continue to cook in the next step.) Increase heat to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake: In a bowl set over a pot of barely simmering water but not touching it, melt together the butter and chocolate. (Alternatively, do this in short bursts in the microwave but be careful not to scorch the chocolate.) Remove the bowl from the heat and whisk in the dark brown sugar, cocoa powder, vanilla extract and salt. Let cool slightly, then whisk in the 3 large egg yolks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In large bowl, beat the remaining 3 large egg whites with an electric mixer on medium until foamy, about 30 seconds. While mixing, gradually add the granulated sugar in a steady stream. Increase the mixer speed to high and continue to beat until you have stiff peaks, about 3 minutes. Using a large rubber spatula, fold the egg-white mixture evenly into the chocolate mixture. Sift the flour evenly over the chocolate mixture and fold it in. Transfer the batter to the prepared crust and smooth the top. Bake until a crust has formed over the top, the center is just set and a toothpick inserted 1 inch from the edges comes out with moist crumbs attached, 30 to 35 minutes. The center of the cake, under the crust, should still be very moist and fudgy. (Peek under the crust if necessary.) Do not overbake. The cake will sink slightly as it cools. Let the cake cool completely, at least 90 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the custard: Set the chocolate and butter in a medium bowl. Place a fine-mesh sieve over the bowl and set it aside. In a medium saucepan, whisk together the sugar, salt, cocoa powder, and cornstarch. Add the milk, little by little, while whisking to incorporate it fully. Whisk in the egg yolks. Heat the mixture over medium heat, stirring constantly, until it has thickened and just come to a low boil. Continue to cook the custard, whisking, for another minute, then immediately pour it into the sieve, pushing it through with a small spatula. Let the custard stand for 1 minute, then whisk it together with the butter and chocolate until smooth. Pour the custard over the cooled cake. Cover the custard with plastic wrap or wax paper, making sure to press it gently into the surface of the custard. Chill until the custard has set completely, at least 4 hours and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, remove the ring from springform pan base and transfer pie to a serving plate. Whip the cream to soft peaks and spoon high dollops over the top of the pie, leaving about a 1-inch border. Dust with cocoa powder."}]}