{"@context": "http://schema.org", "@type": "Recipe", "name": "Black-Eyed Pea Fritters", "description": "The chef Pierre Thiam puts a twist on these traditional Senegalese accara, or black-eyed pea fritters. They are sold on street corners throughout West Africa, usually on fresh baguettes as a sandwich. But Mr. Thiam treats them a bit like falafel and stuffs them into fresh pita bread instead. The spicy pickled carrots he uses as a condiment are based on a recipe from his Vietnamese godfather. Accara are deliciously light and fairly addictive, and they make a great snack with drinks.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/03/09/dining/09FRITTER1/09FRITTER1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "african", "recipeCategory": "finger foods, project", "keywords": "appetizer, main course, baguette, black-eyed peas, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 70}, "recipeIngredient": ["1 cup dried black-eyed peas", "2 tablespoons chopped white onion, plus sliced onion for garnish", "1/2 teaspoon baking soda", "1 teaspoon kosher salt", "1/2 teaspoon coarsely ground black pepper (optional)", "Pinch of crushed red pepper (optional)", "Vegetable oil, for frying", "Fresh baguette or <a href=\"http://cooking.nytimes.com/recipes/1016071-homemade-pita-bread\">pita breads</a>", "Spicy pickled carrots, for serving (<a href=\"http://cooking.nytimes.com/recipes/1018006-spicy-pickled-carrots\">see recipe</a>)", "Lettuce leaves, for garnish", "Sliced tomatoes, for garnish", "Cilantro sprigs, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the black-eyed peas in a large bowl with enough hot water to cover. Soak for at least 15 minutes (longer, even overnight, is fine), until the skins easily peel off when rubbed between the palms of your hands. Rub the skins off the peas, letting the skins float to the top. Slowly pour out the water and the skins with it, leaving the peas in the bowl. Repeat until all the peas are cleaned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the peas and place in a food processor along with the onion, baking soda, salt, a splash of water and the black and red pepper, if using. Process until a smooth batter forms, adding a little more water if necessary. The batter should be smoothly blended, similar to the consistency of light hummus."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour oil into a large cast-iron skillet or other heavy, straight-sided pan to a depth of 1 inch. Heat oil to 365 degrees over medium-high heat. Reduce the heat to medium and, using a spoon, carefully drop 1 tablespoon of batter into the oil. Repeat until there are several dollops in the pan, being careful not to overcrowd. Fry until golden brown, about 2 minutes, turning the fritters once. Remove with a slotted spoon, drain on paper towel and keep warm. Repeat until all batter is used."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, split 1/4 baguette or a pita bread and fill with 3 or 4 fritters, a generous spoonful of pickled carrots, and some lettuce, tomato, onion and cilantro. (Alternatively, arrange accara, without the bread, on a platter and serve with drinks.) Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1018005-black-eyed-pea-fritters"}