{"@context": "http://schema.org", "@type": "Recipe", "name": "Oyster and Blue Cheese Pie", "description": "Fredrik Berselius, the chef and owner of the Nordic restaurant Aska in Williamsburg, Brooklyn, taught me this unusual preparation for oysters. He serves them barely cooked in a broth tarted up with pickled gooseberries and a cream sauce. The oysters are poached in their shells at 140 degrees for 4 to 5 minutes, enough time, he said, to avoid any potential problems with raw oysters. It’s a genius method that can be used for any cooked oyster recipe. The bivalves are a snap to open and do not taste cooked. All you need is a candy thermometer to monitor the temperature.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2017/03/15/dining/15PAIRING/15PAIRING-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts, seafood", "keywords": "blue cheese, fennel, oysters", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 601, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "2 grams", "proteinContent": "27 grams", "saturatedFatContent": "22 grams", "sodiumContent": "686 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup all-purpose flour, plus more for rolling", "Salt", "8 tablespoons unsalted butter", "1 large egg, separated", "1/2 cup finely chopped leeks", "1/2 cup finely chopped fennel bulb", "1/2 cup finely chopped, peeled green apple", "1/2 teaspoon ground black pepper", "12 oysters, preferably Fishers Island or Beausoleil (East Coast), or Hood Canal (West), scrubbed", "5 ounces blue cheese, preferably Cashel Blue", "1 tablespoon minced fennel fronds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pastry dough: Heat oven to 400 degrees. Whisk flour with 1/2 teaspoon salt. Using fingers, pastry cutter or food processor, add 6 tablespoons butter in bits and combine until the mixture's crumbs are the size of peas. Beat egg yolk with 3 tablespoons cold water, add to flour mixture and toss with a fork or pulse by machine until the mixture starts to come together to form a dough. You may need to add another tablespoon or so of water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gather dough on a floured surface, form in a disk and roll in a 12-inch circle. Fit into an 8-inch pie pan. Crimp edge. Line with foil, add pastry weights and bake 15 minutes. Remove foil and weights and bake until golden, another 10 minutes or so. Remove from oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: While pie shell bakes, melt 1 tablespoon butter in a 10- to 12-inch skillet, add leeks, fennel and apple, and sauté on low until tender and translucent. Season with a pinch of salt and pepper and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place oysters in a 3-quart saucepan with just enough water to cover. Heat pan on medium high until water reaches 141 degrees, measuring with a candy thermometer. Shut off heat and let sit on burner for 5 minutes. Remove oysters from water and allow to cool briefly. Holding oysters flat side up, use an oyster or clam knife to open shells (they will have gaped enough to make this easy) and remove oysters, doing so over a bowl to catch the juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, mash cheese, adding 3 tablespoons reserved oyster juice. Beat egg white until softly peaked and fold into cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread leek mixture in pie shell. Spread cheese mixture on top. Place in oven and bake 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt remaining tablespoon of butter and allow to turn nut-brown. Mix with oysters. Remove pie from oven and arrange buttered oysters on top. Bake 2 minutes more. Strew with fennel fronds. Let pie set about 10 minutes, then cut in portions and serve."}], "link": "https://cooking.nytimes.com/recipes/1018652-oyster-and-blue-cheese-pie"}