{"@context": "http://schema.org", "@type": "Recipe", "name": "Oat and Tahini Cookies", "description": "The oats, hazelnuts and tahini (called tahini paste in Britain) make these cookies seem quite healthy, but don’t be fooled. They are as naughty and delicious as any cookie. Toasting the hazelnuts and sesame seeds really helps with the nutty flavor, so don’t skip that bit. These cookies will keep for up to a week in a sealed container.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2017/06/07/dining/07BAKING4/07BAKING4-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "20 cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "dessert, halvah, hazelnut, oats, sesame seeds, tahini", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 179}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 168, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "3 grams", "sodiumContent": "47 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 1/2 tablespoons/80 grams softened unsalted butter, cut into 3/4-inch/2-centimeter cubes", "1/4 cup/50 grams packed dark-brown sugar (soft sugar)", "1/2 cup/110 grams granulated or superfine sugar (caster sugar)", "1 large egg", "1/2 teaspoon vanilla extract", "1/4 cup/60 grams tahini", "1/3 cup/50 grams all-purpose flour (plain flour)", "1/2 teaspoon baking powder", "1/4 teaspoon salt", "1 1/2 cups/140 grams old-fashioned rolled oats (jumbo oats), pulsed a few times in a food processor to roughly chop", "1 teaspoon finely grated orange zest (from half a small orange)", "1 scant cup/100 grams raw hazelnuts, toasted, peeled and chopped into 1/4-inch/.5-centimeter pieces (see note; or use blanched and peeled nuts, if available, and toast them for flavor before chopping)", "1 tablespoon toasted white sesame seeds", "3 1/2 ounces/100 grams plain halvah, broken into about 20 pieces roughly 3/4 inch/2 centimeters wide", "2 ounces/60 grams dark chocolate, roughly chopped (about 1/3 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees Fahrenheit/200 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place butter and both sugars in the bowl of a stand mixer fitted with a paddle attachment (or use a hand-held electric mixer). Mix on medium speed for 2 to 3 minutes, or until light and fluffy. Add egg, vanilla and 1 1/2 tablespoons water and continue mixing until combined, then blend in the tahini. (You may need to stop the machine and scrape down the sides of the bowl with a spatula a few times to help it combine.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together flour, baking powder, salt, oats, orange zest, hazelnuts and sesame seeds. Add the dry ingredients to the stand mixer bowl and mix on low speed until well blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two baking sheets with parchment paper. Form 20 rough balls of dough (they should be about 1 1/2 to 2 inches/4 to 5 centimeters wide) and arrange on the pans, spaced about 1 1/2 inches/4 centimeters apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 8 minutes, rotating the pans halfway through, and then remove from the oven while the cookies are not quite cooked. Place a piece of halvah in the middle of each cookie and return to the oven for another 5 minutes, or until cookies are golden-brown around the edges and the halvah has started to melt. Remove from oven and set aside to cool for 5 minutes, then transfer to a wire rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chocolate in a medium heatproof bowl and place over a pot of simmering water, taking care that the base of the bowl is not touching the water. Cook the chocolate, stirring occasionally, until melted. Remove from the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cookies back to one of the baking sheets so they fit snugly together. Using a teaspoon, drizzle the melted chocolate over the cookies to create thin stripes (or zigzags) all in the same direction. Don’t worry about being exact with this as the cookies should look rustic. Set aside for the chocolate to harden, then serve."}], "link": "https://cooking.nytimes.com/recipes/1018780-oat-and-tahini-cookies"}