{"@context": "http://schema.org", "@type": "Recipe", "name": "Cinnamon Rolls", "description": "What these cinnamon rolls lack in bells and whistles, they make up for in butter and brown sugar. As classic as can be, they are also the ultimate make-ahead breakfast treat, because they can be assembled the night before baking. The success of these rolls depends on the yeast to provide proper lift and rise, so make sure yours is still fresh and alive before diving in. Also be sure to budget a few hours for letting the dough rest and rise. This recipe calls for a 9-by-13 baking pan, but if you have a 9-inch round pan, feel free to use that instead; the rolls will be more tightly huddled together, beckoning to be pulled apart.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/01/08/dining/ar-cinnamon-rolls/merlin_147610815_a671c63a-47a9-44a0-88fa-79a8ee282494-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "9 rolls", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, pastries", "keywords": "brown sugar, cinnamon, yeast, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1662}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 684, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "120 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "12 grams", "sodiumContent": "410 milligrams", "sugarContent": "74 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup whole milk", "4 tablespoons sugar", "2 1/4 teaspoons/7 grams active dry yeast (1/4-ounce envelope)", "4 cups/510 grams all-purpose flour, plus more for dusting", "1 1/2 teaspoons baking powder", "1 1/4 teaspoons kosher salt", "1 large egg, lightly beaten", "6 tablespoons/85 grams unsalted butter, melted", "Nonstick spray or vegetable oil, for the bowl", "1 1/4 cups/250 grams light brown sugar", "2 tablespoons ground cinnamon", "1/4 teaspoon kosher salt", "1/2 cup/114 grams unsalted butter (1 stick), melted", "3 cups/362 grams confectioners' sugar", "5 to 6 tablespoons whole milk or heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Warm milk in a small pot over medium heat until it’s warm to the touch but not yet simmering (110 degrees). Add 2 tablespoons sugar and the yeast, whisking to dissolve and break up any clumps. Let sit until it’s slightly foamy and starting to bubble, about 2 to 5 minutes. (If this doesn’t happen after about 5 minutes, check the expiration date on the yeast; it might be dead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine flour, the remaining 2 tablespoons sugar, the baking powder and the salt in a large bowl or in the bowl of a stand mixer fitted with the paddle attachment. Mix briefly to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add milk mixture, followed by the egg and, with a wooden spoon or the mixer on low, stir to combine, just to eliminate any obviously dry or wet spots. If using the mixer, you may need to scrape the dough off the paddle. Add melted butter and continue to stir until a shaggy lump of dough forms, again scraping down the paddle and helping things along with your hands if necessary to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough out onto a lightly floured work surface, or keep in the mixing bowl and change to the dough hook attachment. Knead dough until it’s smooth, shiny and elastic, about 4 or 5 minutes. (You shouldn't have to add any more flour at this point, but if the dough seems especially sticky, give it a light dusting.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease a large bowl with nonstick spray or vegetable oil and place dough in the bowl. Cover tightly with plastic wrap and place in a warm, draft-free area. (If it’s cold outside, on top of the stove is generally a good bet, as long as the burners and oven aren't on.) Let sit until the dough has about doubled in size, 1 1/2 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch dough down to release any air that has built up. Cover tightly with plastic wrap, place in the refrigerator and chill the dough for at least an hour (and as long as overnight)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the dough and shape the rolls: Once dough is chilled (it should feel firm and no longer flimsy), turn it out onto a lightly floured work surface and roll to a 16 x 10-inch rectangle. The rolled dough will be about 1/4- to 1/3-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine brown sugar, cinnamon and salt in a small bowl. Brush surface of the dough with half of the melted butter and sprinkle brown sugar mixture in an even layer, patting to make sure it’s sticking. Drizzle with remaining butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Starting at the end closest to you (the long side of the dough), roll dough up into a tight coil, pressing lightly as you roll to make sure there are no gaps between the dough and the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut log into nine even pieces, about 1 3/4-inch thick. Lightly spray a 9 x 13-inch baking dish with nonstick spray and arrange dough in three rows of three pieces each, with the spiral facing upward and with space in between each piece. (At this point, the rolls can be covered tightly with plastic wrap and refrigerated overnight, if you'd like.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover rolls lightly with plastic wrap and place in a warm, draft-free area until the rolls have puffed (they won't quite double, but they will be noticeably fluffier and closer to touching) and spring back slightly when pressed with your finger, about 1 hour. (If you refrigerated the rolls overnight, this may take 1 1/2 to 2 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Place rolls in oven and bake until they are golden brown and fluffy and the sugar has started to bubble up around the edges, caramelizing on the sides of the buns, about 32 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the glaze: combine confectioners' sugar and milk and whisk until it is thick but can still be drizzled, like a thinner frosting. (If the glaze is still too thick, thin with more milk by the teaspoonful to get desired consistency.) Keep in mind the glaze is to be applied while buns are warm, and it will thin out upon contact, so it’s best to err on the thicker side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once rolls are out of the oven, drizzle with the powdered sugar glaze and let cool slightly in the pan before digging in."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Cinnamon Rolls", "description": "What these cinnamon rolls lack in bells and whistles, they make up for in butter and brown sugar.", "thumbnailUrl": "https://static01.nyt.com/images/2019/01/08/dining/ar-cinnamon-rolls/merlin_147610815_a671c63a-47a9-44a0-88fa-79a8ee282494-mediumThreeByTwo440.jpg", "uploadDate": "2018-03-28T20:24:34.000Z", "duration": "PT1M47S"}}