{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato Hummingbird Cake", "description": "This magnificent version of the popular banana-pineapple-pecan cake developed by Southern Living magazine in 1978 is adapted from the chef Ashley Christensen's cookbook, \"Poole's: Recipes from a Modern Diner.\" It is a Thanksgiving-worthy dessert for the pie averse: a supremely moist, dense cake crowded with sweet potato, roasted bananas, pineapple, currants and green peanuts (if you live north of the Mason-Dixon line, the plain, roasted variety work just fine). A lightly sweet, butter-cream cheese frosting finishes it off. Set aside a solid afternoon for this project cake, as you have to roast the bananas and grate the sweet potato, and the assembly takes some patience and agility — but it is well worth the toil. This recipe is for a towering three-layer version (get out your biggest mixing bowls), but you could just make a more modest, but still generously sized, two-layer cake instead. To do so, cut all of the ingredients in half (use just 2 eggs); divide the batter between two 8-inch round cake pans; and bake at the same time and temperature.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2016/09/28/dining/hummingbirdcake/hummingbirdcake-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "One 9-inch, 3-layer cake", "recipeCuisine": "southern", "recipeCategory": "cakes", "keywords": "cream cheese, currants, peanut, pineapple, sweet potato, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 335}, "recipeIngredient": ["8 large bananas", "Nonstick cooking spray", "4 1/2 cups/563 grams all-purpose flour", "1 1/2 teaspoons baking soda", "1 1/2 teaspoons fine sea salt", "2 cups/400 grams sugar", "3/4 teaspoon ground cinnamon", "5 large eggs", "2 cups/473 milliliters neutral vegetable oil", "28 ounces/794 grams canned pineapple chunks, drained and chopped (3 cups)", "1 tablespoon pure vanilla extract", "1 cup/160 grams dried black currants", "2 cups/300 grams green peanuts (or use roasted, unsalted peanuts)", "2 pounds/907 grams sweet potatoes, peeled (about 3 medium)", "2 (8-ounce/227 gram) packages cream cheese, at room temperature", "4 sticks/452 grams unsalted butter, at room temperature", "3 3/4 cups/454 grams confectioners’ sugar (one 1-pound box)", "1 teaspoon fine sea salt", "1 teaspoon pure vanilla extract", "2 cups/300 grams roasted, salted peanuts (such as cocktail peanuts), roughly chopped, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees (or 400 degrees convection). Arrange bananas (in their peels) on a parchment-lined baking sheet and bake in the oven until they are soft and black, about 25 minutes. Let bananas cool to room temperature. Remove and discard peels, and transfer banana flesh and any juices that collected on the pan to a food processor. Process until smooth. Measure 2 cups of the purée and set aside (reserve any extra purée for another use)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce oven temperature to 350 degrees (325 degrees convection). Spray three 9-inch cake pans with nonstick cooking spray and line with parchment. In an extra-large bowl, mix together flour, baking soda, salt, sugar and cinnamon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate large bowl, whisk together eggs, oil and banana purée until well combined. Fold in pineapple, vanilla, currants and peanuts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate sweet potatoes on the large holes of a box grater or with the grater attachment of a food processor. Fold grated potatoes into the wet mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the wet ingredients into the bowl with the flour mixture and stir with a rubber spatula until just incorporated. Divide batter equally among the three pans and bake until firm and golden brown, about 40 minutes. Let cakes cool for 10 minutes in the pans on wire racks, then turn out onto the racks, peel off parchment, and let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the icing: In the bowl of a stand mixer fitted with the paddle attachment, beat cream cheese until smooth. Add butter and mix on low speed, stopping occasionally to scrape down the sides of the bowl. With the mixer running on low speed, add sugar by the 1/2 cup until it’s fully incorporated. Add salt and vanilla and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the cake, use a serrated knife to trim the top of each layer to make sure it’s flat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a cake layer on a platter or cake stand. Using an offset spatula, spread 1 1/2 cups icing over the first layer. Top with a second layer and repeat with 1 1/2 cups icing. Top with the third layer and use remaining icing to frost the top and sides of the cake. Press roasted peanuts on the sides of the cake for garnish. The cake, once assembled, can be stored, covered, in the refrigerator for 2 to 3 days, but it’s best the day it’s made. Serve at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1018328-sweet-potato-hummingbird-cake"}