{"@context": "http://schema.org", "@type": "Recipe", "name": "Tuna Sashimi With Hearts of Palm", "description": "At Nobu Downtown in New York's financial district, the menu is divided into classics, like black cod with miso, and the rock shrimp tempura, alongside a list of new dishes called \"Nobu Now.\" Among the newcomers is tuna sashimi with a verdant jalapeño dressing garnished with fresh hearts of palm. This dish, at once delicate, bold and handsomely textured, clearly illustrates the chef Nobu Matsuhisa’s cross-cultural approach to food. For him, Japan and South America are not an ocean apart. Another way to serve this sashimi is to dice the tuna into small pieces as you would for tartare, and fold in finely chopped hearts of palm or daikon and some of the dressing, mounding each portion on a plate with a few sprigs of microgreens on top.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2017/06/14/dining/14PAIRING/14PAIRING-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "seafood", "keywords": "appetizer, grapeseed oil, hearts of palm, microgreens, tuna", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 267, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "0 grams", "proteinContent": "21 grams", "saturatedFatContent": "2 grams", "sodiumContent": "78 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 medium-size jalapeño chiles, chopped, but not seeded or cored", "1 teaspoon grated garlic", "1/2 teaspoon sea salt, plus more for seasoning", "1/2 cup/120 milliliters grapeseed oil", "3 tablespoons/45 milliliters rice vinegar", "1 1/2 pounds/680 grams sushi-grade tuna (bluefin, yellowfin or bigeye)", "3 tablespoons/45 milliliters extra-virgin olive oil", "3 fresh hearts of palm, cut in 2-inch/5-centimeter pieces and finely slivered, or about 3/4 cup/73 grams raw daikon, finely slivered or sliced", "Microgreens, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chiles, garlic and salt in a food processor and process until very finely minced. Scrape down sides of container. With the machine running, slowly add the oil through the feed tube and process until thickened. Add vinegar and process about a minute, until fairly smooth. Transfer to a bowl and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tuna into 2-inch/5-centimeter cubes, then slice as thinly as possible. You will need 7 slices per serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For each dish, spread a couple of tablespoons of the sauce on a salad plate. Fan the tuna slices in a circle on the sauce, leaving an opening in the center of the plate. Drizzle tuna with a little olive oil and dust with a few grains of salt. Pile a thatch of hearts of palm slivers in the center of the plate, top with a few sprigs of microgreens and serve."}]}