{"@context": "http://schema.org", "@type": "Recipe", "name": "Ice-Cold Schav", "description": "Nothing revives and refreshes in a heat wave like this ice-cold schav, made with the exceptionally tart herb sorrel. The soup is seasoned at each stage: You salt the sweating shallots, the cooking potatoes, again when you add the sorrel and finally again when all is combined, which seems like a lot of salt. But once the mixture is chilled, the flavors are masked and dulled so it will taste just right. Using the stems of herbs is a habit I've formed in general, but in the case of sorrel I wish it were an herb all on its own — that you could just buy sorrel stems. I've seen Instagrammable versions of the soup with the egg cut into pristine wedges and bright green watercress substituted for drab muddy sorrel, but I think the way to go here is without vanity: Scatter well-chopped hard-boiled egg liberally over the drab soup, and follow with the minced stems, also liberally. ", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2017/06/18/magazine/18eat/18mag-18eat-t_CA0-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "eastern european", "recipeCategory": "soups and stews", "keywords": "egg, potato, sorrel", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 273, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "9 grams", "sodiumContent": "921 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons butter", "1 medium shallot, peeled and finely minced", "1 large russet potato, peeled and trimmed into the shape of a rectangular box, then small-diced. Mince the scraps from boxing as fine as the shallots", "Kosher salt", "3 cups water", "1/2 pound sorrel, stems removed but saved, leaves washed and cut into 1-inch ribbons", "4 hard-boiled eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in nonreactive soup pot. Sweat shallot and minced potato scraps in the butter slowly, stirring gently. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put diced potatoes in the water, season with salt and bring to a boil. Simmer potatoes until perfectly cooked, a couple of minutes only. Taste one cube to determine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add sorrel to sweating shallot-potato mixture, and season with salt. Stir and wilt the sorrel, which will happen almost instantly, turning drab immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cooked potatoes and their salty water to the pot of sorrel. Season with salt, if needed, keeping in mind that when chilled, the flavors are dulled significantly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill immediately and thoroughly — overnight even."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the hard-boiled eggs, and scatter in the cold soup. Mince half the reserved stems from the sorrel as you would chives, and sprinkle over soup."}], "link": "https://cooking.nytimes.com/recipes/1018801-ice-cold-schav"}