{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Cooker Bibimbap with Salmon and Spinach", "description": "Hui Leng Tay, a food blogger in Singapore, is unusually committed to her rice cooker. She developed this recipe for bibimbap, and she sees herself as seeking the elusive grail of cooks everywhere: the make-ahead, not-too-unhealthy, tasty meal. \"I try to figure out which ingredients get better when kept over low heat for a long time, like cabbage and onions, and which ones get droopy,\" she said.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/02/28/dining/bibimbap/bibimbap-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "3 to 4 servings", "recipeCuisine": "korean", "recipeCategory": "grains and rice", "keywords": "egg, kimchi, rice, salmon fillet, spinach, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "recipeIngredient": ["10 ounces leaf spinach, fresh or frozen", "Roasted sesame oil", "Rice vinegar", "Salt and freshly ground black pepper", "8 ounces salmon fillet, sliced 1/4 inch thick across the grain", "1 cup rice, preferably medium- or short-grain, rinsed", "1 long hot green pepper, thinly sliced", "3 tablespoons kimchi, finely chopped", "2 eggs", "Gochujang or another Asian chile paste such as sambal or chile bean paste", "Sesame seeds and finely chopped scallions, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using steamer function, steam spinach in rice cooker until tender, about 8 minutes. Remove to a kitchen towel, wring dry and thinly slice into a bowl. Season to taste with sesame oil, rice vinegar and salt. Sprinkle salmon with salt and pepper and steam until just cooked through, about 15 minutes. Break into large flakes. (See Note.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean out cooker and cook rice according to instructions. When done (or when cooker switches to \"warm\" function), quickly stir in sliced pepper and kimchi, making sure to scrape and scoop up bottom layer of rice. Smooth top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle 2 teaspoons sesame oil over rice and gently break eggs on top, placing one on each side of cooker. Cover and put cooker on ''cook'' function for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Switch cooker to ''warm,'' arrange salmon and spinach next to eggs, cover and let steam just until egg whites are opaque (yolks should be runny). Place a teaspoon of chile paste in center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At table, stir dish together. (A toasty crust may have formed on bottom of rice cooker: scrape this up and mix into dish.) Scoop into serving bowls, sprinkling each with sesame seeds and scallions. Pass sesame oil, rice vinegar and chile paste for seasoning."}]}