{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey Gravy From Scratch", "description": "The stock can be made weeks ahead; so can the gravy itself. The golden turkey fat from the roasting pan is reserved and forms the base for a rich roux. The finished gravy freezes beautifully and only needs to be whisked in a hot pan and tasted for salt and pepper before serving.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2008/11/19/dining/turkey-gravy-from-scratch/turkey-gravy-from-scratch-articleLarge.jpg", "totalTime": "PT9H", "recipeYield": "3 quarts, about 20 servings", "recipeCuisine": "american", "recipeCategory": "sauces and gravies", "keywords": "carrot, celery, turkey legs, white wine, fall, winter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 101}, "recipeIngredient": ["4 tablespoons butter, more if necessary for gravy, and for seasoning (optional)", "6 turkey legs or other dark meat turkey parts (thighs, wings, etc.), to make about 6 pounds", "Salt and black pepper", "1 medium onion, peeled and stuck with 3 cloves", "3 large carrots, peeled and cut into large chunks", "3 stalks celery with leaves, trimmed and cut into large chunks", "2 bay leaves", "12 black peppercorns", "1 cup white wine, Madeira, vermouth, dry sherry or water", "12 tablespoons (3/4 cup) all-purpose flour", "Salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the stock:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Melt 4 tablespoons butter. Sprinkle turkey parts lightly with salt and pepper, place in roasting pan and brush with melted butter. Roast 2 hours, basting with butter every 20 minutes or so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer roasted turkey to a stockpot and set roasting pan aside. Add onion, carrots, celery, bay leaves and peppercorns to stockpot. Add cold water just to cover, bring to a simmer and cook, slightly uncovered, about 6 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place roasting pan on top of stove and bring juices to a simmer over low heat. Pour in wine (or water), stirring and scraping to bring up browned bits. (If using wine, simmer at least 5 minutes.) Pour all liquid into a bowl and refrigerate. When deglazing liquid is cool, lift off top layer of fat; reserve fat. Add deglazing liquid to stockpot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When stock is golden and flavorful, strain into a large container and refrigerate. When cool, lift off fat and mix it with reserved fat from deglazing liquid. Reserve 3 quarts stock for gravy and refrigerate or freeze the rest for another use."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the gravy:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a deep skillet or large heavy pot, melt 12 tablespoons (3/4 cup) reserved turkey fat over medium heat. If you do not have enough turkey fat, use additional butter to make 3/4 cup. Gradually whisk in the flour. Cook, whisking, until golden brown and toasty-smelling, 3 to 5 minutes or longer for darker gravy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in a small amount of stock (this prevents lumps), then add remainder more quickly and whisk until smooth. Simmer, continually whisking, until thickened. If too thick, thin with more stock or a little wine and simmer briefly. Season with salt and pepper. If desired, whisk in a few tablespoons cold butter to smooth and enrich gravy."}]}]}