{"@context": "http://schema.org", "@type": "Recipe", "name": "Blancmange", "description": "A good blancmange will have a slight wobble but not be so firm that it feels (as Amanda Hesser once wrote) like “eating a rubber ball.” I like the amount of gelatin here; if you don’t, decrease it by ¼ teaspoon and say a prayer, which will probably be answered. Your chosen mold doesn’t matter: I have used tart pans and spring-form pans and old blancmange molds, which are easy to find (or at least fun to seek).", "author": {"@type": "Person", "name": "Tamar Adler"}, "image": "https://static01.nyt.com/images/2016/05/29/magazine/29eat/29mag-29eat-t_CA0-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "Serves 6", "recipeCuisine": "french, middle eastern, turkish", "recipeCategory": "custards and puddings", "keywords": "amarena cherry, cardamom, hazelnut, milk", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 386, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "15 grams", "sodiumContent": "67 milligrams", "sugarContent": "21 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup hazelnuts or almonds", "1 cup whole milk, divided", "2 strips lemon peel, peeled off with a peeler", "2 cardamom pods, lightly smashed once", "1 1/2 cups heavy cream, divided", "1 (1/4-ounce) package unflavored gelatin", "1/2 cup granulated sugar", "Tiny pinch of salt", "A few drops vanilla", "Flavorless vegetable oil", "Amarena cherries marinated in syrup, or other candied fruit (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grind the nuts in a food processor to medium fine. Combine them with 2/3 cup of milk, lemon peel, cardamom and 1/2 cup of the cream in a small saucepan, and bring to just below a simmer, over medium heat. Turn off heat. Let steep 15 minutes. Sprinkle gelatin over remaining milk in a wide shallow bowl or gratin dish. Let bloom 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain nut-milk-cream through a chinois or a sieve lined with a double layer of cheesecloth into a bowl. Firmly press the liquid through the cloth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the liquid to a clean saucepan, add the sugar and salt and heat over low, stirring until dissolved. Add the bloomed gelatin and stir well until thoroughly dissolved. Don’t let the mixture come to a simmer. Stir in the vanilla. Set pan into a bowl of ice and cold water, and stir occasionally until cooler than your finger and the consistency of egg whites. If it sets too much, remove from cold water and whisk well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the remaining cup of cream to just past soft peaks. Add a little of the whipped cream to the jelling nut-milk mixture to loosen, then add to the remaining whipped cream, folding thoroughly but gently. Brush a 6-to-7-inch cake pan or mold completely with vegetable oil. Add blancmange to oiled mold. Cover the surface directly with plastic, and chill, at least 6 hours or overnight. To serve, remove the plastic wrap, and lightly run a sharp knife around the blancmange’s edge. If you’ve used an old, pretty mold, you may have to dunk it briefly in hot water to get it to release. Put an inverted plate over its top, and flip. Top with cherries or candied fruit or nothing at all."}], "link": "https://cooking.nytimes.com/recipes/1018142-blancmange"}