{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramelized Beets With Orange-Saffron Yogurt", "description": "This astonishingly pretty platter is equally delicious, a signature of the British chef Yotam Ottolenghi, who provided the recipe: soft, sweet beets against the tart astringency of the orange-tinctured yogurt, its coolness threaded with saffron. It is also an ace make-ahead dish: You can prepare the yogurt and the beets the night before serving, or in the morning. Look for a good variety of beets if you can, for reasons of color and taste alike: golden ones to offset the red, say, with a mixture of candy canes between the two.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/05/20/dining/beets-yotam/beets-yotam-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 6-8", "recipeCuisine": "", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "appetizer, main course, side dish, beets", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 233}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 481, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "12 grams", "sodiumContent": "572 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 ½ pounds small beets, ideally of varying colors, skin-on, scrubbed and trimmed", "1 head of garlic", "1 cup plus 1 tablespoon extra-virgin olive oil", "7 tablespoons unsalted butter, melted", "Kosher salt to taste", "1 ¼ cups Greek yogurt", "1 pinch saffron threads soaked in 1 tablespoon boiling water", "2 teaspoons lemon juice", "Zest of ½ medium-size orange, approximately ½ teaspoon, plus 1 tablespoon orange juice", "1/3 cup slivered almonds", "¼ teaspoon red pepper flakes", "2 tablespoons basil leaves, shredded"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400. Put the beets into a high-sided baking pan, so that they fit together relatively snugly. Cut off the top of the head of garlic and place it, cut side up, in one corner of the pan. Mix together 1 cup oil and the butter and drizzle it over the beets and garlic. Cover the tray tightly with aluminum foil and roast for approximately 1 hour, or until the beets are soft when pierced with a knife and the garlic is soft and caramelized."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the beets and garlic from the oven and allow to sit until the beets are cool enough to handle, approximately 10 to 15 minutes. Lift them out of the oil, peel and discard the skin and place them in a medium bowl with a pinch of salt and 1 tablespoon of the cooking oil from the baking pan. Mix well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze the garlic cloves out of their skin and into a small bowl. Roughly mash with the back of a fork before adding the yogurt, saffron threads and water, the lemon juice, orange zest and a pinch of salt. Stir well and place in the refrigerator until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a medium-size sauté pan over medium heat with the remaining 1 tablespoon of olive oil. When it shimmers, add the almonds and sauté for 1 to 2 minutes, stirring and tossing frequently, until they begin to turn golden. Add the red pepper flakes and the orange juice and continue to cook until the liquid has evaporated, approximately 30 seconds. Spoon the nuts onto a wide plate and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to serve, spoon the yogurt onto a large serving plate and spread it out slightly. Top with the beets, making sure that you can still see yogurt at the edges. Sprinkle the almonds over the top, then the basil, and serve."}], "link": "https://cooking.nytimes.com/recipes/1018135-caramelized-beets-with-orange-saffron-yogurt"}