{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Roasted Citrus Salmon With Herb Salad", "description": "This is truly the best way to cook salmon. Slowly roasting an already fatty fish in an even more luxurious fat (here, olive oil) makes it nearly impossible to overcook. Plus, you can flavor that oil with whatever you fancy — spices, herbs, citrus, chiles — which, in turn, will flavor the fish. It's a very simple method for cooking any large piece of fish (cod or halibut work well here, too). This makes it the ideal dinner party trick, sitting perfectly in the center of a Venn diagram where “looks impressive” and “not a ton of work” overlap. It also doubles beautifully. Store any leftover salmon in the remaining oil, which will keep it from drying out, and use it to elevate a salad or a bagel with cream cheese.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2020/03/13/dining/ar-slow-roasted-salmon/ar-slow-roasted-salmon-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "weekday, weeknight, seafood", "keywords": "main course, salmon", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2474}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 768, "unsaturatedFatContent": "54 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "70 grams", "fiberContent": "2 grams", "proteinContent": "27 grams", "saturatedFatContent": "11 grams", "sodiumContent": "510 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 (1 1/2-pound) piece skinless salmon fillet (or halibut or cod)", "Kosher salt and black pepper", "2 lemons, Meyer or regular, thinly sliced, plus 1 tablespoon fresh lemon juice", "1 blood orange, mandarin orange or regular orange, thinly sliced", "6 sprigs thyme, rosemary, oregano or marjoram (optional)", "1 1/2 cups olive oil", "2 cups herbs, such as parsley, cilantro, dill and tarragon, roughly picked from the stem", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Season salmon with salt and pepper on both sides. Place in a large baking dish with sliced lemons, orange and thyme (or rosemary, oregano or marjoram), if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle everything with olive oil and bake until salmon is just turning opaque at the edges and is nearly cooked through, 25 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss fresh herbs with 1 tablespoon lemon juice and flaky salt. Serve alongside salmon."}], "link": "https://cooking.nytimes.com/recipes/1018972-slow-roasted-citrus-salmon-with-herb-salad"}