{"@context": "http://schema.org", "@type": "Recipe", "name": "Japchae (Korean Glass Noodles)", "description": "Dangmyeon, or Korean glass noodles, made with sweet potato starch, have a wonderful chewy, slippery texture. Combined with an abundance of stir-fried vegetables and beef, then tossed with soy sauce, sesame oil and abundant black pepper, Japchae teems with multiple savory flavors and contrasting textures. Delicious warm, at room temperature or cold, it's an ideal dish for potlucks and project-focused dinner parties alike.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2017/10/26/dining/26cooking-japchae/26cooking-japchae-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "korean", "recipeCategory": "noodles", "keywords": "beef, egg, garlic, glass noodles, nori, sesame oil, soy sauce, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 33}, "recipeIngredient": ["1/2 pound stew beef", "1/2 teaspoon sugar", "1 tablespoon soy sauce", "1/4 teaspoon toasted sesame oil", "1 clove garlic, smashed", "1 1 1/2-inch-thick slice peeled ginger, smashed", "Freshly ground black pepper", "1 pound lotus root, trimmed and peeled", "1 cup water", "6 tablespoons soy sauce", "3 tablespoons rice vinegar", "3 tablespoons sugar", "1 package (about 1 pound) Korean sweet-potato noodles (also called dangmyeon or Korean glass noodles)", "Fine sea salt", "1 bunch spinach, stemmed (or 5 ounces baby spinach)", "Grapeseed, canola or other neutral-tasting oil", "1 bunch scallions, trimmed, halved lengthwise, and cut into 1 1/2-inch strips (about 2 cups)", "2 medium carrots, julienned into 1 1/2-inch strips (about 2 cups)", "2 medium red bell peppers, seeded and very thinly sliced (about 2 cups)", "4 ounces shiitake mushrooms, stemmed and cut into 1/2-inch strips", "3 cloves garlic, minced", "1 medium yellow onion, root removed and thinly sliced (about 2 cups)", "6 tablespoons soy sauce, divided", "3/4 teaspoon toasted sesame oil", "2 eggs, beaten", "1 sheet nori, halved and julienned"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line three baking sheets with parchment paper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the beef into 1/2-inch strips. Place in a medium bowl, and add sugar, soy sauce, toasted sesame oil, smashed garlic, ginger and black pepper. Toss well to combine. Set aside for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If making pickled lotus root, slice roots into 1/8-inch-thick discs, and place in a medium bowl filled with cold water. Set aside. Place a colander in the sink. Bring 4 quarts of water to a boil in a medium sauce pot. Blanch lotus-root slices for 1 minute, then drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine 1 cup water, 6 tablespoons soy sauce, 3 tablespoons rice vinegar and 3 tablespoons sugar. Set over medium heat, and bring to a boil, stirring occasionally to ensure sugar dissolves. Cool to room temperature, then pour over cooled lotus root. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place noodles in a large bowl. Cover with warm tap water, and set aside to soak for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a medium pot with 3 quarts water, and bring to a boil. Season with 1 tablespoon salt. Add spinach, and blanch for 10 seconds, then use a spider or tongs to remove to a parchment-lined tray. Spread out into a single layer, and allow to cool, then squeeze out any excess water and chop roughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot with 6 quarts of water, cover, and set over high heat to come to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large sauté pan over high heat. Add 1 tablespoon oil. When it shimmers, add scallions and a pinch of salt. Sauté for 2 minutes until they are tender but not completely soft. Transfer to a baking sheet, and spread into a shallow pile to cool quickly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to high heat. Add 1 tablespoon oil. When it shimmers, add carrots and a pinch of salt. Sauté for about 6 minutes until tender but not completely soft. Transfer to sheet with scallions, and spread into another shallow pile to cool quickly. Repeat with bell peppers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to high heat. Add 1 tablespoon oil. When it shimmers, add shiitakes, and cook until lightly caramelized, about 3 minutes. Move mushrooms to the edges of the pan, add 1 teaspoon oil to the center of the pan and add garlic. Turn off heat and allow garlic to gently sizzle for about 10 seconds, then stir garlic into mushrooms to prevent it from taking on any color. Transfer to second parchment-lined baking sheet and allow to cool, then squeeze out any extra water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to high heat. Add 1 tablespoon oil. When it shimmers, add onions and a pinch of salt. Sauté for about 8 minutes until lightly caramelized and translucent, but still a little crunchy within. Transfer to sheet with mushrooms and spread into another shallow pile to cool quickly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to high heat. Add 1 tablespoon oil. When it shimmers, add beef and sauté for about 3 minutes, until meat is tender and barely cooked through and just starting to caramelize. Transfer to sheet with onions, and spread out to cool quickly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a colander in the sink. Add 3 tablespoons soy sauce to large pot of boiling water. Add noodles and cook for 4 minutes until tender, then drain into colander, rinsing with cold water. When noodles are warm but not hot, drain and transfer to a large bowl. If noodles are unmanageably long, use kitchen shears to shorten them. Add 3 tablespoons soy sauce, ¾ teaspoon toasted sesame oil, ¼ teaspoon salt and freshly ground black pepper. Toss to coat evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add all the vegetables and beef to the noodles. Toss thoroughly with hands to ensure everything is evenly distributed. Taste and adjust seasoning with soy sauce, sesame oil and salt as needed. Transfer to serving dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large nonstick pan over medium heat, and add 1 teaspoon oil. Add eggs and reduce heat to low. Cook into a thin omelet, flipping before it takes on any color. Turn omelet out onto a cutting board, and julienne into thin strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish noodles with egg and nori strips and lotus root, if using. Serve at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1018990-japchae-korean-glass-noodles"}