{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Chicken With Artichokes and Olives", "description": "Imbued with the classic Mediterranean flavors of artichokes, garlic, mint and olives, this braised chicken is complex and highly satisfying, with a white wine sauce brightened with lemon. Fresh artichokes have the most pronounced character and meatiest texture, but if you can’t get them or don’t want to go to the trouble of cleaning them, you can substitute frozen artichoke hearts (you'll need a 9- or 10-once package). Serve this with crusty bread for sauce-mopping.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/04/21/multimedia/clark-chicken-artichokes/clark-chicken-artichokes-mediumThreeByTwo440-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "mediterranean", "recipeCategory": "one pot", "keywords": "artichoke, cherry tomatoes, chicken, olives, white wine, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 765}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1047, "unsaturatedFatContent": "45 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "71 grams", "fiberContent": "6 grams", "proteinContent": "77 grams", "saturatedFatContent": "20 grams", "sodiumContent": "1364 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 lemons", "3 medium artichokes, about 1 1/2 pounds", "3 1/2 pounds bone-in chicken pieces", "2 teaspoons kosher salt", "2 teaspoons black pepper", "2 tablespoons extra-virgin olive oil, more as needed", "4 garlic cloves, smashed and peeled", "1 1/2 cups cherry tomatoes, halved", "Pinch red pepper flakes", "3/4 cup dry white wine", "1/3 cup pitted olives, halved (use black, green or a mix)", "2 large rosemary branches", "1 tablespoon unsalted butter", "Grated Parmigiano-Reggiano, as needed", "Chives or mint leaves, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze the juice of 1 lemon into a large bowl of water. Discard the outer leaves of each artichoke. As you do so, and as you continue cleaning the artichokes, dip them into the lemon water to stop the cut sides from browning. Use a paring knife to peel the base and stems. Slice off the top third of each artichoke. Slice the artichokes in half lengthwise. Using a teaspoon or grapefruit spoon, scoop out the hairy chokes inside, pulling out any prickly purple leaves as well. Slice each half into three pieces. Put trimmed artichoke pieces in lemon water until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Pat the chicken dry with paper towel and season with salt and pepper. In a large (12-inch) ovenproof skillet with a lid, heat oil over medium-high heat. Add chicken pieces and sear in batches until well browned, 5 to 7 minutes per side. Transfer chicken to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add artichokes and garlic to pan, adding more oil if needed, and cook, turning occasionally, until golden brown, about 5 minutes. Stir in tomatoes and red pepper flakes; cook 1 minute more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in wine and stir in olives, rosemary branches and grated zest of 1/2 lemon. (Do not discard after zesting.) Return chicken to pan. Bring liquid to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover pan and transfer to oven. Cook until chicken is tender, 30 to 35 minutes. (Check white meat after 25 minutes and remove from oven if done.) Transfer chicken to a plate and place skillet over medium-high heat. Simmer until pan juices thicken and become saucelike, about 3 to 5 minutes. Whisk in butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return chicken to pan and sprinkle with cheese. Adjust oven heat to broil and place pan in the oven until cheese is melted and golden, 2 to 3 minutes. (Watch carefully to see that it does not burn.) Squeeze juice of remaining lemon half over pan and serve garnished with chives or mint if you like."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Chicken and Artichokes", "description": "Mediterranean flavors and spring artichokes combine to make a savory and impressive skillet chicken.", "thumbnailUrl": "https://static01.nyt.com/images/2016/04/21/multimedia/clark-chicken-artichokes/clark-chicken-artichokes-mediumThreeByTwo440-v2.jpg", "uploadDate": "2016-04-22T15:50:04.000Z", "duration": "PT2M33S"}}