{"@context": "http://schema.org", "@type": "Recipe", "name": "Peanut Butter Balls", "description": "Depending on where you live, these chocolate and peanut-butter confections are known as either peanut butter balls or buckeyes. In the Midwest, they are known as buckeyes because they look like the nut of a buckeye tree, thanks to an exposed circle of peanut butter that's left after they're dipped in chocolate. Be sure to start with a good-quality peanut butter, and don’t skimp on the salt. Those small touches carry a lot of impact.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2017/03/08/dining/08COOKING-BUCKEYES1/08COOKING-BUCKEYES1-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "About 30 pieces", "recipeCuisine": "american", "recipeCategory": "candies, cookies and bars", "keywords": "dessert, peanut butter, semisweet chocolate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 329}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 122, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "3 grams", "sodiumContent": "49 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups/242 grams confectioners’ sugar", "1 cup/270 grams sweetened, smooth peanut butter", "4 tablespoons/57 grams unsalted butter, melted", "1 teaspoon vanilla extract", "3/4 teaspoon kosher salt", "5 ounces/142 grams semisweet chocolate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a rimmed baking sheet with parchment paper. In a large bowl, with an electric mixer on medium, beat the confectioners’ sugar, peanut butter, butter, vanilla and salt until smooth and uniform, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Portion the mixture into 1 tablespoon balls. Roll the balls into neat circles between your palms. Transfer to the prepared baking sheet, cover with plastic wrap and chill in the freezer until firm, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "A few minutes before the balls are done chilling, prepare the chocolate. In a small microwave-safe bowl, melt the chocolate in short bursts, stirring often. If chocolate becomes too thick during the dipping process, it can be liquified again in the microwave."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a toothpick to skewer one ball at a time, and dip it into the melted chocolate, leaving a small circle of the peanut butter mixture exposed at the top and allowing any excess chocolate to drip back into the bowl. Transfer buckeyes to the prepared baking sheet and remove the toothpick. Repeat with the remaining balls, returning them to the freezer for a few minutes if they become too soft to work with. Smooth over the holes left by the toothpick with a small offset spatula or your finger. Chill in the refrigerator until the chocolate is firm, about 30 minutes."}], "link": "https://cooking.nytimes.com/recipes/1018639-peanut-butter-balls"}