{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Flounder", "description": "A Montauk fishing guide named Bryan Goulart was the first person I saw brine thin fillets of porgy and sea bass, and the Brooklyn chef Josh Cohen taught me how to do it with flounder, though the recipe would work on any flat fish. A mere 10 minutes in the bath will tighten the flesh nicely, and then three or four minutes of cooking the fish need follow, over a medium flame. Cook only that one side, then flip the fish onto a serving platter or plate, and top with a little bit of butter, chopped parsley and a spray of lemon.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/06/14/dining/24GRILLS7/14GRILLS7-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday, seafood", "keywords": "flounder, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 144}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 180, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "178 milligrams", "sugarContent": "25 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup kosher salt", "1/2 cup granulated sugar", "4 flounder fillets, approximately 1 1/2 pounds, or any thin, low-fat white fish", "Kosher salt and ground black pepper, to taste", "Neutral oil, like canola or grapeseed", "4 small pats unsalted butter, approximately 1 teaspoon each", "Chopped parsley", "1 lemon, quartered"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the brine: Put salt and sugar in a large bowl or pot, and add around a half-gallon of water, stirring to combine and dissolve the salt and sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the burners on a gas grill to medium. When it is hot, scrape grates to make sure they are very clean. (If using a charcoal grill, build a fire in your grill. When coals are covered with gray ash and you can hold your hand 5 inches above the coals for 5 to 7 seconds, you are ready to cook.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While grill heats, slide the flounder fillets into the brine and allow them to sit for approximately 10 minutes, then remove from the brine and pat very dry with paper towel. Season fillets with salt and pepper, then apply just a little oil to one side of each fillet, lightly spreading it with your fingers to cover the flesh."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Apply some more oil to a paper towel and, using tongs to protect your hands, use the towel to oil the grill grates. They will smoke furiously. Gently lay the fish fillets, oiled-side down, onto the grates. Cook until the fish has started to turn translucent at its edges, approximately 3 to 4 minutes, then remove from grill and place, grilled-side up, on a warmed platter. The fish will continue to cook as it rests."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top each fillet with a small pat of butter, some chopped parsley and a squeeze of lemon, then serve."}]}