{"@context": "http://schema.org", "@type": "Recipe", "name": "Sesame, Date and Banana Cake", "description": "Even though this cake is packed full of dates, bananas and tahini (also known as tahini paste in Britain), it’s surprisingly soft and light. You can serve it warm, if you like, with the tahini cream cheese and bananas alongside, although it’s worth the wait, if you can, for it to cool so that it can be assembled as a cake. A note on tahini: We always use tahini from one of the Arabic brands, which tend to be creamy and nutty (as opposed to a Greek or Cypriot tahini, which can be bitter and sticky). But it's also worth seeking out local or artisanal brands closer to home. Always be sure your tahini is well stirred before measuring.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2017/06/07/dining/07BAKING1/07BAKING1-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "banana, cream cheese, dates, mascarpone, tahini, toasted sesame seeds, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 356}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 564, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "17 grams", "sodiumContent": "329 milligrams", "sugarContent": "38 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons/50 grams tahini", "1/3 cup/75 milliliters orange juice (from 1 large orange)", "5 ounces/140 grams medjool dates, pitted and quartered (about 8 dates)", "2 to 3 very ripe peeled bananas (8 ounces/240 grams), thinly sliced", "2 tablespoons toasted sesame seeds", "1/2 cup/113 grams unsalted butter (1 stick), at room temperature and cut into 3/4-inch/2-centimeter pieces, plus extra butter for the pan", "3/4 cup/150 grams granulated or superfine sugar (caster sugar)", "2 large eggs, beaten", "1 2/3 cup/200 grams all-purpose flour (plain flour), sifted", "2 1/2 teaspoons baking powder", "1/8 teaspoon salt", "1/2 cup plus 1 tablespoon/130 grams cream cheese, preferably at room temperature", "1/2 cup plus 1 tablespoon/130 grams mascarpone cheese, preferably at room temperature", "3 tablespoons/35 grams lightly packed light brown sugar (soft sugar)", "3 1/2 tablespoons/55 grams tahini", "1 ripe peeled banana, cut into 1/2-inch/1-centimeter-thick slices", "1 tablespoon Demerara sugar", "1 1/2 teaspoons date syrup, for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees Fahrenheit/200 degrees Celsius. Grease an 8-inch/20-centimeter aluminum springform cake pan with butter, and line the base and sides with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: In a medium bowl, whisk together tahini and orange juice, and then stir in dates, bananas and sesame seeds, separating the date and banana pieces as you add them to the bowl so they don't clump together. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put butter and sugar in the bowl of a stand mixer fitted with the paddle attachment, and mix on medium-high speed for 2 to 3 minutes, until light and fluffy. Add the eggs, in two additions, until combined, scraping the bowl down as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together flour, baking powder and salt, then add to the stand mixer bowl and mix on low speed for about 30 seconds, just to combine. Add tahini-date mixture with the speed still on low and mix until blended, then spoon the batter into the cake pan and smooth the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer cake to oven and bake for 30 minutes, until golden brown. Without removing it from the oven, carefully cover the cake loosely with aluminum foil. Continue to bake for an additional 25 to 30 minutes, or until cake is cooked through and a skewer inserted in the middle comes out clean. Remove from oven and set aside to cool in the pan on a wire rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake is baking, make the icing: Place all the ingredients in the bowl of a stand mixer fitted with the whisk attachment. Whisk for 1 to 2 minutes, on medium speed, until combined and airy, scraping down the sides of the bowl as needed to mix thoroughly. Set aside until cake has cooled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the caramelized bananas: Heat broiler on its highest setting, with a rack placed about 4 inches/10 centimeters beneath the heat source. Arrange banana slices closely together on a small baking pan and sprinkle generously with sugar. Broil bananas for 2 to 3 minutes, until sugar has melted and caramelized. Remove from oven and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, remove the cake from the pan and transfer to a plate. Spread icing generously over the top of the cake. Arrange the caramelized bananas on top, then drizzle with date syrup."}]}