{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Lamb Chops With Ramps, Anchovy, Capers and Olives", "description": "Wild spring ramps are an earthy aromatic twist to this otherwise traditional approach to lamb chops. But you can just as easily use minced garlic or young green garlic shoots from the farmers' market. Any of these pungent alliums harmonize with the other bold ingredients. The anchovy mellows, melting into the chunky sauce, and the flavorful, meaty olives, briny capers and crushed red pepper keep everything lively, along with a squeeze of lemon.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/05/10/dining/10KITCHEN1/10KITCHEN1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, steaks and chops", "keywords": "anchovies, capers, chicken broth, lamb chops, olives, ramps, shallots, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 155}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 768, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "66 grams", "fiberContent": "2 grams", "proteinContent": "28 grams", "saturatedFatContent": "26 grams", "sodiumContent": "907 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["8 lamb chops (about 2 pounds), trimmed", "Salt and black pepper", "2 teaspoons roughly chopped rosemary", "2 tablespoons extra-virgin olive oil, plus more as necessary", "1 large shallot, diced", "4 anchovy fillets, rinsed and patted dry", "6 wild ramps, white part finely chopped and green tops reserved, or 2 teaspoons minced garlic", "1 tablespoon small capers or roughly chopped larger capers", "1/4 cup coarsely chopped pitted olives, a mixture of black and green", "1/2 teaspoon crushed red pepper, or less to taste", "1/2 cup white wine", "1 cup hot chicken broth", "2 tablespoons lemon juice", "1/2 teaspoon lemon zest", "2 tablespoons roughly chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chops on both sides with salt and pepper, sprinkle with rosemary, and set aside for 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large sauté pan or skillet over medium-high heat. Add olive oil and swirl to coat bottom of pan. When oil is hot, add chops in one layer, without crowding. (If necessary, use two pans or work in batches.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook chops until nicely browned on first side, about 4 to 5 minutes. (Maintain brisk heat, but adjust if they seem to be browning too quickly.) Flip chops and cook to medium-rare, until red juices rise on surface, 2 to 3 minutes more. Remove chops to a serving platter and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to stovetop over medium-high heat. Add a little olive oil if pan looks dry, then add shallot and cook until lightly browned, about 2 to 3 minutes. Add anchovies, mashing them with the back of a spoon, to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chopped ramps (or garlic, if using), capers, olives and red pepper and stir to incorporate shallot mixture. Raise heat to high and add white wine. Cook rapidly until reduced by half. Add chicken broth and simmer until slightly thickened, about 5 minutes. Stir in lemon juice and zest and turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, roughly chop reserved green ramp tops, if using, and mix with chopped parsley. Stir parsley mixture into sauce. Spoon sauce generously over lamb chops and serve."}], "link": "https://cooking.nytimes.com/recipes/1018752-sauteed-lamb-chops-with-ramps-anchovy-capers-and-olives"}