{"@context": "http://schema.org", "@type": "Recipe", "name": "Rhubarb Oat Shortcakes", "description": "Roasting rhubarb with Demarara sugar until the stalks caramelize and soften enough to collapse gives you a heady and intense jamlike compote with a molasses edge. Here, it’s paired with tender, biscuitlike shortcakes made with a little oat flour for complexity and plenty of whipped cream. It’s important to let the rhubarb juices truly caramelize at the edges of the pan; they should turn deep mahogany brown before you pull it from the oven. Then mix those syrupy juices with the rest of the rhubarb for the deepest flavor. You can make the biscuits and rhubarb up to eight hours in advance. Store them at room temperature until ready to serve.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/05/25/multimedia/clark-rhubarb-shortcakes/clark-rhubarb-shortcakes-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "6 shortcakes", "recipeCuisine": "american", "recipeCategory": "", "keywords": "crème fraîche, heavy cream, oats, rhubarb, vanilla bean, dessert, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 156}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 805, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "100 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "6 grams", "proteinContent": "10 grams", "saturatedFatContent": "26 grams", "sodiumContent": "520 milligrams", "sugarContent": "51 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 cups/180 grams all-purpose flour, more as needed", "1 cup plus 1 tablespoon/95 grams old-fashioned oats", "1/3 cup/80 grams light brown sugar", "1 tablespoon/15 grams baking powder", "1/2 teaspoon finely grated orange or lemon zest", "1/2 teaspoon fine sea salt", "8 tablespoons/115 grams cold unsalted butter (1 stick), cubed", "2/3 cup/160 milliliters heavy cream, more for brushing shortcakes", "Demerara sugar, for garnish", "2 pounds/907 grams rhubarb, trimmed and diced into 1-inch pieces (7 cups)", "1 cup/210 grams Demerara sugar", "2 tablespoons unsalted butter, melted", "1 vanilla bean, split and scraped", "1/4 teaspoon kosher salt", "1/2 cup/118 milliliters heavy cream", "1/2 cup/120 grams crème fraîche", "1 tablespoon confectioners' sugar or honey (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Line a rimmed baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the shortcakes: In the bowl of a food processor, pulse together flour, 1 cup/90 grams oats, the brown sugar, the baking powder, the zest and the sea salt. Drop in butter and pulse until mixture forms lima-bean-size crumbs. Add cream and pulse until dough is just combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, pat dough into a rectangle 3/4 inch/2 centimeters thick. Brush generously with heavy cream and, lifting up a short side, fold dough in half as if you are closing a book. Cut dough into 6 squares. Transfer biscuits to prepared pan. Brush lightly with more cream and sprinkle with remaining 1 tablespoon oats and the Demerara sugar. Chill until ready to bake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the roasted rhubarb: In a large bowl, toss together rhubarb, Demerara sugar, melted butter, vanilla bean seeds and salt. Spread onto a large rimmed baking sheet. Transfer rhubarb to the oven. Bake 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pan of biscuits to the oven with rhubarb. Continue to bake, tossing rhubarb occasionally and scraping the darkening pieces at the edges of the baking sheet into the center, until biscuits are golden and rhubarb is very tender and the juices are bubbling thickly and have caramelized at the edges of the pan, about 20 minutes longer. If biscuits are ready before rhubarb, remove from oven while rhubarb finishes cooking. Let biscuits and rhubarb cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: In a small bowl, whisk together cream, crème fraîche and confectioners' sugar or honey, if using, until mixture forms soft peaks. Split biscuits crosswise and spoon rhubarb and whipped cream over biscuit bottoms. Cover with biscuit tops."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Rhubarb Oat Shortcakes", "description": "Rhubarb stars in this reinvention of a classic strawberry shortcake.", "thumbnailUrl": "https://static01.nyt.com/images/2016/05/25/multimedia/clark-rhubarb-shortcakes/clark-rhubarb-shortcakes-mediumThreeByTwo440.jpg", "uploadDate": "2016-05-27T15:56:39.000Z", "duration": "PT2M32S"}}