{"@context": "http://schema.org", "@type": "Recipe", "name": "Plum Almond Tart", "description": "This beautiful plum tart, adapted from the pastry chef Alex Levin of Osteria Morini in Washington, brings together a sablé butter crust flavored with vanilla bean; colorful, juicy plum slices; and an almond cream filling with a lovely flavor that complements the fruit. Using confectioners' sugar in the crust gives you a texture that is finer and smoother than if you use  granulated sugar. And the sugar in the crust and filling removes the need to sweeten the plums (which in turn means the fruit juices won't leach into the dough) — though you'll want to sprinkle a little turbinado sugar over the top for added crunch.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2016/09/21/dining/21ROSH2/21ROSH2-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "french", "recipeCategory": "pies and tarts", "keywords": "almond, plum, vanilla bean, dessert, fall, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 126}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 441, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "13 grams", "sodiumContent": "79 milligrams", "sugarContent": "28 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 cup/113 grams unsalted butter (1 stick) or 1/2 cup solid coconut oil, at room temperature", "3/4 cup/94 grams confectioners’ sugar", "Pinch of fine sea salt", "1 vanilla bean, seeds scraped", "1 large egg", "1 1/2 cups/187 grams all-purpose flour", "3/4 cup/120 grams blanched almonds", "2 tablespoons all-purpose flour", "1/2 cup/113 grams unsalted butter (1 stick) or coconut oil at room temperature", "1 cup/120 grams confectioners’ sugar", "Pinch of fine sea salt", "1 large egg plus 1 egg yolk", "About 1 1/2 pounds/680 grams Italian plums or other flavorful, colorful plums", "A few pinches of turbinado or other textured raw sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Combine butter or oil, confectioners’ sugar, salt and vanilla bean seeds in a stand mixer on low speed for 1 minute. Increase speed to medium and beat for 1 minute more. Scrape down sides of bowl, add the egg and then the flour, and continue mixing until smooth. Remove dough from the bowl, wrap in plastic and refrigerate, about 1 hour, or until firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the almond filling: Grind together the blanched almonds and flour in a food processor until they form a textured almond flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine butter or oil, confectioners’ sugar and salt in a stand mixer on low speed for 1 minute. Increase speed to medium and beat for 1 minute more. Scrape down sides of bowl, add egg and egg yolk, and continue mixing until mixture comes together and is homogeneous, about 2 minutes. Add almond mixture all at once, and mix until batter just comes together. Cover with plastic wrap and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove dough from refrigerator and set aside for 10 minutes. Knead dough to loosen it, then pat together into a ball again. On a well-floured surface, roll out the dough into a 12- to 13-inch round using a floured rolling pin. Quickly transfer dough to an 11-inch pie plate or tart shell, trimming the edges as needed. Place the lined shell in the freezer until frozen."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Remove shell from the freezer, line with parchment paper, and fill with pie weights or dried beans. Bake crust for 12 to 15 minutes, or until the edges are just starting to color. Remove the weights and bake 5 minutes longer. Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the crust cools, cut plums into 1/4-inch wedges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an offset spatula, spread cooled tart shell with the almond cream. Starting at the outside of the pan, arrange plums in a circle on top so all the pieces overlap. Turn plums the opposite way for the second circle. Fill the center with the remaining plums or another fruit if you wish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle a few pinches of turbinado sugar over plums and bake for 30 to 40 minutes or until almond cream is puffed and golden brown and the plums are softened."}], "link": "https://cooking.nytimes.com/recipes/1018300-plum-almond-tart"}