{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Potato Hash", "description": "I had one of the great breakfasts of my life on San Juan Island, north of Seattle, in a dockside coffee shop The grated hash brown potatoes there were cooked in thin sheets and run under the broiler beneath a handful of grated cheese to create crisp pancakes that could be used as a platter on which to serve fried eggs, or as a hat to top them, depending on your mood. When I got home to New York I started making them for dinner, which was labor-intensive and eventually annoying because one of my children wanted them for dinner all the time. Together we worked out a hack. It is this recipe, and you can easily double, and serve with just about anything, especially fried eggs. Omit the bacon if it's not your game, and replace with a couple of tablespoons of butter. Omit the red peppers if you like. Add a drizzle of chipotle mayonnaise on top, if you don’t like sour cream, or swap out the chipotle for nothing if you don’t like spice. Make the recipe your own. The point is simply to aim for a thick, caramelized crust of potatoes. The interiors will be soft and sweet.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/08/07/magazine/07eat/07mag-07eat-t_CA0-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american, mexican", "recipeCategory": "breakfast, brunch, lunch", "keywords": "side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 379}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 366, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "5 grams", "proteinContent": "13 grams", "saturatedFatContent": "11 grams", "sodiumContent": "632 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 slices bacon, ideally double-smoked or slab", "1 tablespoon unsalted butter", "2 pounds medium-size Yukon Gold potatoes, approximately 5 potatoes, scrubbed and diced", "1 medium-size yellow onion, peeled and diced", "1 medium-size red bell pepper, seeded and diced", "1/2 cup sour cream", "1 lime, juiced", "1 to 2 tablespoons chipotles en adobo, minced, to taste", "Kosher salt and freshly ground black pepper", "1 1/2 cups shredded Cheddar cheese", "2 scallions, sliced thin, green parts only"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the bacon on a large rimmed baking sheet, place in the oven and heat to 400. Cook the bacon through — until it is chewy and going to crisp — approximately 15 minutes. Remove the bacon from the pan, and set aside. There should be a couple of tablespoons of bacon fat in the pan. If there is more, discard it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter to the bacon fat, then put the potatoes, onions and red peppers onto the pan, and stir to coat. Spread the potatoes, onions and red peppers out evenly across the pan, and return it to the oven for 20 minutes or so, then take it out again, and use a spatula to turn everything over. Cook for another 20 minutes or so, or until the potatoes are beginning to crisp, then turn them once more and cook for an additional 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, whisk together the sour cream, lime juice and minced chipotles en adobo, to taste. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the potatoes are well crisped, take the pan out of the oven, and season with salt and pepper. Dice the reserved bacon, and scatter it on top of the potatoes, then top with the shredded cheese. Stir to combine, and return the pan to the oven until the cheese has melted, approximately 3 to 5 minutes. Tip into a mound on a warmed serving tray, drizzle with chipotle sour cream, garnish with the scallions and serve."}], "link": "https://cooking.nytimes.com/recipes/1018240-roasted-potato-hash"}