{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Breasts With Fennel and Lemon ", "description": "Lemon is chicken’s best friend — stuffed whole inside a roasting bird with a sprig of rosemary; wrapped in foil, baked soft and puréed for a sauce, à la Jean-Georges Vongerichten; or tossed with fennel and egg yolk for a rich, tangy sauce as in this recipe from the food writer Marlena Spieler. It is a simple, rich and wonderfully elegant way to prepare the humble chicken breast. First, lightly brown the chicken and remove it from the pan. Add the fennel, wine, lemon zest, broth and a pinch of cinnamon (trust us) to the pan and bring it all to a boil, reducing until it thickens. Return the chicken to the pan and let it simmer while you beat a couple of egg yolks and some lemon juice together. Incorporate a bit of the pan sauce into the egg yolk mixture, then add it all to the pan. Cook a bit more until the sauce is creamy and your mouth waters with anticipation.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2017/03/21/dining/21CHICBREAST-LEMONFENNEL/21CHICBREAST-LEMONFENNEL-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 229}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 407, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "42 grams", "saturatedFatContent": "3 grams", "sodiumContent": "975 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 lemon", "1 1/2 pounds boneless, skinless chicken breasts", "Salt to taste", "2 tablespoons extra virgin olive oil", "1 medium large fennel bulb, sliced lengthwise and cut in strips", "1 1/2 cups dry white wine such as pinot grigio", "1 cup chicken broth", "1 pinch cinnamon (about 1/8 teaspoon)", "2 egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Zest lemon and slice zest into matchsticks. Juice lemon, strain and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly sprinkle chicken with salt. Put deep frying pan over medium-high heat, pour in oil and gently sauté chicken breasts, about two minutes per side, until they are about half-cooked. Remove from pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off oil and discard, then add fennel, wine and lemon zest to pan. Bring to boil over high heat and cook until wine is reduced by about half and fennel is tender. Add broth and cinnamon, bring to boil and cook about 5 minutes to reduce sauce a bit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chicken with its juices and cook for 2 or 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, beat egg yolks with half the lemon juice (about 1 tablespoon), then ladle in about 1/4 cup of sauce. Mix well, then add to pan, mixing well. Cook over medium heat, stirring a bit, until sauce appears creamy. Taste and add more lemon juice, if you like."}], "link": "https://cooking.nytimes.com/recipes/1018676-chicken-breasts-with-fennel-and-lemon"}