{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Rice With Chicken and Mushrooms", "description": "This warming, savory, hearty baked rice casserole was originally meant to be an Indian-style biriyani, but my larder was stocked with Gallic ingredients: mushrooms, thyme, garlic, parsley. I switched gears, heading in a French direction. It’s a great dish for feeding a crowd and also reheats beautifully, so it’s worth making the entire batch. Serve with a crisp green salad, juicy wilted spinach or mustard greens, or all-season frozen peas.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/01/25/dining/25KITCHEN1/25KITCHEN1-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, grains and rice", "keywords": "chicken thighs, mushroom, rice, white wine, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2041}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 579, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "2 grams", "proteinContent": "27 grams", "saturatedFatContent": "9 grams", "sodiumContent": "898 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds skinless boneless chicken thighs, cut into 2-inch chunks", "Salt and pepper", "2 tablespoons olive oil", "1 large onion, diced (about 1 1/2 cups)", "1 large sprig thyme, plus 1 teaspoon freshly chopped leaves", "1 bay leaf", "1 cup white wine", "2 cups basmati rice, soaked for 20 minutes, rinsed and drained", "8 ounces king trumpet mushrooms, or a mixture of mushrooms, sliced 1/4-inch thick", "4 cups hot chicken broth", "3 tablespoons unsalted butter", "1 cup frozen peas, cooked for 2 minutes in salted water (optional)", "2 small garlic cloves, smashed to a paste with a little salt", "3 tablespoons roughly chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put chicken pieces on a baking sheet and season generously with salt and pepper. Set aside. Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour olive oil into a 4-quart enamelware Dutch oven or similar heavy pot and set over medium-high heat. Add onions and cook, stirring, until nicely browned, 8 to 10 minutes, then season with salt. Add chicken, thyme sprig and bay leaf, and continue to cook, stirring, for 2 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wine and simmer briskly until reduced by half, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add rice and a large handful of mushrooms and stir to combine. (Reserve most of the mushrooms for garnish.) Add broth and bring to a simmer. Check broth for seasoning and adjust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover pot and cook for 10 minutes over medium heat. Transfer pot to oven and bake for 20 minutes. Finally, remove from oven and let rest for 10 minutes off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While rice is baking, sauté remaining mushrooms: Melt butter in a large skillet over high heat. Add mushrooms, season with salt and pepper and cook, rapidly stirring, until they have softened and browned, 5 to 7 minutes. Add peas, if using, and heat through. Turn off heat, then add reserved chopped thyme, the garlic and the parsley. Toss to coat well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fluff rice, then top with sautéed mushrooms and serve."}], "link": "https://cooking.nytimes.com/recipes/1018545-baked-rice-with-chicken-and-mushrooms"}