{"@context": "http://schema.org", "@type": "Recipe", "name": "Utica Greens", "description": "This dish was popularized by Joe Morelle in the late 1980s at the Chesterfield Restaurant in Utica, N.Y., where it is on the menu as greens Morelle. More widely known as Utica greens, it has become commonplace, in modified versions, in Italian restaurants throughout central New York, and even migrated to New York City, Las Vegas and Florida. This version of the dish is fairly spicy. Use fewer cherry peppers if you prefer it less hot. You will have leftover oreganato, the topping of bread crumbs and cheese; use it for another greens dish or add it to baked chicken or shrimp. Typically served in restaurants as an appetizer, Utica greens makes a great main course at home with some crusty bread and a glass of red wine.", "author": {"@type": "Person", "name": "Jim Shahin"}, "image": "https://static01.nyt.com/images/2017/03/01/dining/01UTICA2/01UTICA2-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "american, italian", "recipeCategory": "dinner, vegetables", "keywords": "appetizer, main course, bread crumbs, cherry peppers, escarole, parmigiano-reggiano", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 478}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 512, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "3 grams", "proteinContent": "14 grams", "saturatedFatContent": "8 grams", "sodiumContent": "787 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup extra-virgin olive oil", "1 cup bread crumbs", "1/2 cup Parmigiano-Reggiano, grated", "1 head escarole, about 1 1/4 pound, bottom removed, leaves separated and washed thoroughly to remove grit", "2 tablespoons extra-virgin olive oil", "4 slices prosciutto (about 2 ounces), sliced thin and cut into roughly 1-inch squares", "4 to 6 hot cherry peppers (pickled will do if you can't find fresh), tops and seeds removed, broken by hand or chopped into 4 or 5 chunks", "2 cloves garlic, minced", "1/2 teaspoon kosher salt", "1/4 teaspoon freshly ground black pepper", "1/2 cup Parmigiano-Reggiano, grated, plus 2 or more tablespoons for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to boil over high heat. Prepare an ice bath in a large bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium bowl, prepare the oreganato: Mix the oil, bread crumbs and cheese until well blended. It should have the texture of moist beach sand. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water is boiling, blanch the greens until they are nearly limp but still a little firm, about 1 to 2 minutes. Plunge them into the ice bath to stop the cooking. Remove and drain them well in a colander or salad spinner, allowing them to remain moist but not dripping wet. Squeeze just a little of the moisture from them, then chop them into 2-inch pieces. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler. Coat a large pan with the olive oil. Over medium heat, sauté the prosciutto, cherry peppers and garlic until the prosciutto is browned and slightly crisp, about 5 minutes. (Lower heat slightly if garlic begins to brown too quickly.) Add the chopped greens to the pan, season with salt and pepper and stir to mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/2 cup Parmigiano-Reggiano and 1/2 cup of the oreganato. Cook 3 to 4 minutes, stirring frequently to blend, scraping the bottom of the pan to keep the oreganato from burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle another 1/4 cup oreganato atop the greens. (Save leftover oreganato for use in another greens dish, or add it to baked chicken or shrimp.) Place the pan under the broiler and broil until the top browns, about 2 minutes. Remove from the broiler and sprinkle a bit more cheese on the dish. Serve immediately."}]}