{"@context": "http://schema.org", "@type": "Recipe", "name": "Mango Cheesecake", "description": "Now, I love cheesecake and I love mangoes, the mangoes best eaten in their natural state, and preferably in the bath. But the two together make a dessert that manages to be both comforting and elegant. The scented flesh of the fruit does more than add to the taste of the cheesecake: it transforms the texture, too. This mango cheesecake reminds me of those light French fruit-mousse tarts, with their glassy, mirrored tops. And the color! The radiant, golden yellow is instant sunshine in the kitchen, just as the taste is summer on the tongue.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2017/06/14/dining/14COOKING_CHEESECAKE2/14COOKING_CHEESECAKE2-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 160}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 600, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "20 grams", "sodiumContent": "398 milligrams", "sugarContent": "44 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces (about 15 2 1/2-by-5-inch) graham crackers", "3 tablespoons dark brown sugar", "1 stick butter, softened and cut into pieces", "4 small mangoes (to make approximately 2 cups purée)", "1 1/2 pounds cream cheese", "1 cup superfine sugar", "6 large eggs", "Juice of half a lime"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare cheesecake base: Place graham crackers in the bowl of a food processor. Process until they are almost fine crumbs. Add dark brown sugar and butter. Process until mixture clumps together like damp sand. Press mixture evenly into bottom of a 9-inch springform pan and refrigerate while preparing filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare filling: Heat oven to 325 degrees. Bring a kettle of water to boil. Peel and cut flesh from mangoes and purée in food processor until smooth. Add cream cheese and process until smooth. Add superfine sugar, and with motor running, add eggs one at a time through the processor's feed tube. Add lime juice, and process until blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place springform pan on a double layer of strong foil. Crimp edges up around pan to make a waterproof nest. Place foil-covered pan in a deep roasting pan. Scrape filling into pan and pour boiling water into roasting pan to come about halfway up sides of cake pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until filling is set and wobbles slightly in the center (it will continue to cook as it cools), about 1 hour and 45 minutes. Remove springform pan from water bath. Discard foil and place pan on a cooling rack. When cool, refrigerate overnight. To serve, remove from pan and place on a serving platter before slicing."}], "link": "https://cooking.nytimes.com/recipes/1018799-mango-cheesecake"}