{"@context": "http://schema.org", "@type": "Recipe", "name": "Sambhar Masala", "description": "Raghavan Iyer, the author of \"The Turmeric Trail\" and teacher who was born in Mumbai and came to the United States as a young man, says there as many sambhar masalas as there are kitchens in south India. The spice mix is used to flavor sambhar, the ubiquitous thin stew of Southern India. If you can’t find the curry leaves, you can leave them out, but it’s worth it to search out a South Asian or international grocery or order some online. Use it in curries, stir-fries or simple dishes of roasted or grilled vegetables. It can be rubbed onto meat before grilling or stirred into mashed potatoes enriched with melted butter. The recipe can easily be doubled and keeps well. Do not refrigerate as it will cake.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2016/03/29/dining/sambhar-masala/sambhar-masala-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "About 3/4 cup", "recipeCuisine": "indian", "recipeCategory": "condiments", "keywords": "black mustard seeds, coriander seeds, curry leaves, fenugreek, Thai chile, white poppy seeds", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 32}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 152, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "9 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "14 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup firmly packed medium to large curry leaves", "1/4 cup dried Thai or cayenne chiles, stems removed", "2 tablespoons dried yellow split peas, picked over for stones", "2 tablespoons coriander seeds", "1 tablespoon cumin seeds", "1 1/2 teaspoons fenugreek seeds", "1 1/2 teaspoons black or yellow mustard seeds", "1 1/2 teaspoons white or black poppy seeds", "1 cinnamon stick, about 3 inches long, broken into three pieces", "1 1/2 teaspoon sesame oil or vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine leaves, chiles, peas and spices in a bowl and drizzle with sesame oil, tossing to coat evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat medium-sized skillet over medium-high heat. When the pan is hot, add coated spices and toast, stirring constantly, 2 to 4 minutes, until the leaves appear dry and brittle, the chiles begin to blacken slightly, the split peas turn dark brown and the mustard seeds begin to pop. Watch carefully, so the mixture does not burn. Remove to a plate to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When spices are cool to the touch, pour half into a spice grinder. (A clean coffee grinder will do.) Grind until spices are the texture of finely ground pepper. Transfer mixture to a bowl and repeat with remaining spices. The mixture will keep at room temperature for up to 2 months in a tightly sealed container."}]}