{"@context": "http://schema.org", "@type": "Recipe", "name": "Duck Prosciutto", "description": "Consider using this cured duck, adapted from \"Charcuterie: The Craft of Salting, Smoking, and Curing,\" by Michael Ruhlman and Brian Polcyn, as a garnish for salad; as a canapé, on a bit of toasted bread spread with Dijon mustard; or sautéed like pancetta.", "author": {"@type": "Person", "name": "Ian Fisher"}, "image": "https://static01.nyt.com/images/2016/05/18/dining/18CURE4-WEB/18CURE4-WEB-articleLarge.jpg", "totalTime": "P7DT10M", "recipeYield": "About 48 canapé servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "duck breast, salt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 113}, "recipeIngredient": ["1 whole boneless Moulard duck magret or Pekin duck breast, about 1 pound, skin on, split", "2 to 3 cups kosher salt, more as needed", "1/2 teaspoon ground white pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Weigh breasts individually so you can check their progress toward curing. With a sharp knife, score skin of each breast in a crisscross pattern. Put about 1 cup salt (a half-inch layer) in a nonreactive baking dish that will just hold the breasts without touching. Nestle breasts on top of salt, skin side up. Pour more salt over breasts so that they are completely covered. Wrap in plastic and refrigerate 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove duck from salt, rinse thoroughly and pat dry with paper towels. The flesh should feel dense and its color will have deepened. Dust breasts with pepper on both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap each breast in cheesecloth and tie with string. Hang for about 7 days in a cool (50 to 60 degrees is optimal), humid place, like a garage, a basement or in an unlit fireplace. After curing, the flesh should be stiff but not hard throughout; the color will be a deep rich red. If they still feel raw in the center, hang for a day or two longer. Generally, dry-cured products are ready when they have lost 30 percent of their original weight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove cheesecloth, wrap duck in plastic and refrigerate until ready to use. It will keep several weeks or more."}], "link": "https://cooking.nytimes.com/recipes/1018117-duck-prosciutto"}