{"@context": "http://schema.org", "@type": "Recipe", "name": "Cabbage and Potato Gratin", "description": "Like slow-cooked onions, slow-cooked cabbage takes on color, becoming meltingly tender and sweet. Because of the bulk of the potatoes, this gratin makes a satisfying vegetarian main dish, though it certainly works just as well as a side.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2016/03/02/dining/02MARTHA/02MARTHA-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "casseroles, vegetables", "keywords": "cabbage, Gruyère, Parmesan, potato, gluten-free, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 795}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 279, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "5 grams", "proteinContent": "14 grams", "saturatedFatContent": "8 grams", "sodiumContent": "822 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["Salt", "1 large savoy or green cabbage (about 2 pounds), quartered", "1 pound baking potatoes, such as russets, peeled and sliced", "2 garlic cloves, peeled", "2 cups milk", "1/2 cup crème fraîche", "Ground black pepper", "4 ounces Gruyère, grated (1 cup, tightly packed)", "1 ounce Parmesan, grated (1/4 cup)", "2 teaspoons finely chopped or slivered fresh sage"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil, salt generously and add quartered cabbage and potato slices. Reduce heat to medium-high and boil gently for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain and use tongs to transfer cabbage quarters to a colander set over a bowl or in the sink. Allow cabbage to cool in colander until you can handle the wedges. Core the wedges, then cut them in half lengthwise. Finally, slice crosswise into 1/2-inch-wide ribbons. Return to colander and drain for another 5 minutes. Place in a large bowl with the potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Butter a 3-quart baking dish or gratin. Cut one of the garlic cloves in half and rub the dish with the cut surface. Then slice up all the garlic and toss with cabbage and potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, whisk together milk, crème fraîche, about 1 teaspoon salt and the pepper. Pour into bowl with cabbage and potatoes, add cheeses and sage, and gently toss together. Scrape into baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 1 hour 15 minutes to 1 hour 30 minutes, until top is golden brown. During the first 45 minutes, press the vegetables down into the liquid in the baking dish every 10 to 15 minutes, using the back of a large spoon. The gratin will still be bubbling when you remove it from the oven, and you will see liquid in the baking dish. Wait 10 to 15 minutes before serving, until liquid is reabsorbed. If liquid remains in dish, serve with a slotted spoon."}], "link": "https://cooking.nytimes.com/recipes/1018004-cabbage-and-potato-gratin"}