{"@context": "http://schema.org", "@type": "Recipe", "name": "Polish Hunter’s Choucroute (Bigos)", "description": "Alex Witchel brought this recipe to The Times in 2008. Bigos is the sauerkraut stew that many consider the national dish of Poland. The author Louis Begley calls it Polish choucroute. With a pot of coarse grain mustard on the side and boiled potatoes topped with dill, the overall effect is a grown-up’s version of a child’s dinner party.", "author": {"@type": "Person", "name": "Alex Witchel"}, "image": "https://static01.nyt.com/images/2008/02/27/dining/bigos/bigos-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "6 generous servings", "recipeCuisine": "eastern european", "recipeCategory": "one pot, sausages", "keywords": "frankfurters, kielbasa, red wine, sauerkraut, smoked bacon, smoked ham, vodka, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "recipeIngredient": ["2 large sweet onions, chopped", "1/2 teaspoon salt", "8 ounces thick-cut smoked bacon, cut into 1/2-inch squares", "3 pounds sauerkraut, preferably fresh", "2 potatoes, peeled and cut into eighths", "4 cloves garlic, peeled", "15 black peppercorns", "2 pounds any combination of smoked ham, smoked pigs’ knuckles, ham hocks, smoked goose or smoked duck", "2 apples", "1 or 2 cans beef consommé", "1 1/2 cups (about 1/2 bottle) sturdy red wine (Cahors, Rioja or Sicilian), or as needed", "Whole small or large frankfurters or other German-style sausages, as many as you like", "8 ounces kielbasa cut in 1/2-inch chunks", "1/2 cup to 1 cup vodka"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place onions in a bowl and mix with salt; set aside. Place a large skillet over medium heat; sauté bacon until brown and crisp. Remove from pan and set aside. Add onions to pan; sauté over medium heat until golden, about 10 minutes. Remove pan from heat; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place sauerkraut in a heavy casserole without rinsing it unless you find the taste too strong. If you do, rinse in cold water and press water out in a colander. Add to sauerkraut the onions, potatoes, garlic, peppercorns and all meats except frankfurters, sausages and kielbasa. Peel and core apples, cut into quarters, and add to casserole. Mix well. Add enough consommé and wine to barely reach surface of sauerkraut. Cover and cook over low heat for 2 1/2 hours, stirring occasionally and scraping bottom of casserole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow casserole to cool. Throw out bones and outer skin of knuckles. If not serving dish the same day, cover and refrigerate. If serving the same day, add sausages and kielbasa, and cook over low heat for 1 hour before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fifteen minutes before serving, pour vodka over mixture. Place on a platter with raised edges (to prevent liquid from spilling), arranging sausages on top. If desired, serve with coarse grain mustard and lightly buttered boiled potatoes sprinkled with chopped dill."}], "link": "https://cooking.nytimes.com/recipes/1018614-polish-hunters-choucroute-bigos"}