{"@context": "http://schema.org", "@type": "Recipe", "name": "Crunchy Eggplant Parmesan", "description": "In most eggplant Parmesan recipes, crusty slices of fried eggplant go into a casserole with sauce and cheese -- where they quickly turn to sludge. This recipe holds on to the crunch by transforming each whole eggplant into a crisp cutlet. You can make one eggplant per person to serve this as an appetizer, or add a bed of pasta to make it more substantial. There's no Parmesan cheese in this recipe, but that's not a mistake: in Italian the phrase \"alla Parmigiana\" refers to a style of dish.  It doesn't refer to Parmigiano-Reggiano cheese.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/09/22/dining/22Eggplant1/22Eggplant1-mediumThreeByTwo440.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 5 entree servings", "recipeCuisine": "italian", "recipeCategory": "vegetables", "keywords": "eggplant, parmesan, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 547}, "recipeIngredient": ["8 to 10 small eggplants", "Salt", "2 cups all-purpose flour", "3 large egg yolks", "2 cups dry bread crumbs or panko, seasoned with 1 teaspoon each salt, black pepper, garlic powder and dried oregano", "Vegetable oil, for frying", "3 cups tomato sauce, <a href=\"https://cooking.nytimes.com/recipes/1015987-classic-marinara-sauce\">preferably homemade</a>", "4 to 6 ounces packaged mozzarella, shredded or diced", "Freshly minced basil or parsley, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees. Set a large ovenproof wire rack over a large rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a small, sharp knife, starting just below the stem, cut each eggplant lengthwise into 1/4-inch-thick slices, keeping them attached at the stem. Place them on paper towels and press down on the eggplants to fan the slices out. Sprinkle with salt on both sides and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Measure out 2 cups ice water. In a medium bowl, whisk the flour with the egg yolks and half the water until almost smooth, then whisk in the remaining water. Add a little more water if the batter seems too thick; it should be runny, like glue."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the bread crumbs and seasonings in a medium bowl and lightly mix and crush together with your hands."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, deep skillet, heat a generous 1/2 inch of vegetable oil until shimmering (about 350 degrees)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches, dip eggplants in the batter, dredge in bread crumbs and add to the skillet. Fry until nicely browned on the bottom, about 3 minutes. Reduce the heat if the eggplants are browning too quickly. Turn and cook until browned on the second side, about 3 minutes longer. Transfer to the rack set over the baking sheet and season with salt; transfer the baking sheet with the rack to the oven to keep warm while you fry the remaining eggplant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide skillet, heat the marinara sauce over low heat until bubbling. Divide the mozzarella into 8 to 10 piles (one for each eggplant). Pick up and place the piles of cheese in the sauce, spacing the piles out so they melt separately. You may need to do this in 2 batches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide eggplants on plates. Place a spoonful of sauce next to or on top of each eggplant. Top sauce with melted mozzarella, lifting it out with a slotted spoon. Sprinkle with fresh herbs, and serve immediately."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Eggplant Parmesan", "description": "A better way to make this Italian, end-of-summer classic.", "thumbnailUrl": "https://static01.nyt.com/images/2017/09/22/dining/22Eggplant1/22Eggplant1-mediumThreeByTwo440.jpg", "uploadDate": "2017-09-22T15:04:53.000Z", "duration": "PT1M6S"}, "link": "https://cooking.nytimes.com/recipes/1018942-crunchy-eggplant-parmesan"}