{"@context": "http://schema.org", "@type": "Recipe", "name": "Thin Pan-Seared Pork Chops", "description": "Double-thick pork chops always look appetizing, but unless they are cooked perfectly, they tend to be dry, regardless of whether you grill or bake them. That's especially true if they are lean loin chops. But skinny chops cooked over high heat on the stovetop are far more apt to come out juicy. Giving them an hour in quickly made brine adds even more flavor and tenderness. Ask your butcher to cut thin chops that weigh 4 to 5 ounces.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/02/22/dining/22KITCH1/22KITCH1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, steaks and chops", "keywords": "arugula, pecorino, pork chops, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 297}, "recipeIngredient": ["1/2 cup kosher salt", "1/4 cup granulated or brown sugar", "2 bay leaves", "1 teaspoon coriander seeds", "12 black peppercorns, lightly crushed", "6 allspice berries, lightly crushed", "8 thin, bone-in pork chops, also known as breakfast chops, 4 to 5 ounces each (about 2 1/2 pounds total)", "Extra-virgin olive oil", "2 tablespoons lemon juice", "1/2 teaspoon grated lemon zest", "3 tablespoons extra-virgin olive oil", "Salt and black pepper", "5 ounces baby arugula (about 4 cups), or a mixture of arugula, tender parsley leaves and mint leaves", "Pecorino cheese, for shaving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the brine: In a nonreactive large bowl or large deep baking dish, combine salt, sugar, bay leaves, coriander, peppercorns and allspice. Stir in 8 cups cold water to dissolve salt and sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pork chops to brine, making sure they are well submerged, and refrigerate. Leave chops in brine for 1 to 2 hours. Remove from brine, pat dry and bring to room temperature. Discard brine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing for the herb salad: Whisk together lemon juice, zest and olive oil. Season with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 large cast-iron skillets over medium-high heat and film each pan lightly with oil. (Alternatively, use a large cast-iron griddle or ridged stovetop grill.) When oil is hot, add chops in one layer without crowding."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook for about 4 minutes, until chops are nicely browned, then turn and cook for about 3 minutes more, until firm to the touch. Transfer to a warm platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put herb salad leaves in a shallow bowl and season lightly with salt. Toss leaves with half the dressing, just to coat. Place dressed salad on top of pork chops. Drizzle remaining dressing over the top, add shavings of pecorino cheese (if using), and serve."}]}