{"@context": "http://schema.org", "@type": "Recipe", "name": "Fennel Gratin", "description": "This rich, elegant gratin, adapted from the chef Naomi Pomeroy's book \"Taste and Technique,\" brings together braised fennel, Gruyère sauce and crisp bread crumbs, with outrageously delicious results. As with many recipes in this highly instructive book, this gratin is more labor intensive than what you may expect — coarse bread crumbs are toasted and shattered just so — but every component is key to the final dish. A lot happens simultaneously, so breathe deep, and be sure to prep your ingredients before beginning, and carefully read through the recipe to the end (a good practice always). If you'd like to get a head start, the bread crumbs may be toasted and stored at room temperature; the fennel and cheese sauce can be made up to 1 day in advance and refrigerated, separately, until you are ready to assemble, bake and serve. It's ideal for entertaining.", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2016/09/28/dining/28TECHNIQUE2-WEB/28TECHNIQUE2-WEB-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "bread crumbs, fennel, gruyère, parmigiano-reggiano, white wine, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 57}, "recipeIngredient": ["1/4 large loaf artisanal bread (about 5 ounces)", "2 tablespoons unsalted butter", "1 teaspoon garlic paste (see note)", "1/2 teaspoon fennel pollen", "1/4 teaspoon black pepper", "3 tablespoons roughly chopped fennel fronds (optional)", "4 or 5 large fennel bulbs (3 to 4 inches), or 6 to 8 small bulbs (2 to 3 inches), with some fronds attached", "1 tablespoon kosher salt", "1 teaspoon black pepper", "2 tablespoons extra-virgin olive oil", "4 tablespoons unsalted butter", "3/4 cup chicken stock, preferably homemade", "1/4 cup good white wine", "3 tablespoons unsalted butter", "3 tablespoons all-purpose flour", "2 teaspoons garlic paste (see note)", "2 1/2 cups whole milk", "3 ounces cave-aged Gruyère cheese, grated", "1/2 teaspoon kosher salt", "1/4 teaspoon black pepper", "2 ounces cave-aged Gruyère cheese, grated", "2 ounces Parmigiano-Reggiano cheese, ground (see note) or finely chopped by hand"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the bread crumbs: Heat oven to 250 degrees. Remove crust from bread and slice 1/4 inch thick, then tear slices into 1/2 inch pieces. Spread on a baking sheet and bake for 40 to 45 minutes, until completely dry and brittle, but without any color. Let cool, then break into roughly pebble-size pieces and place between 2 sheets of parchment paper or in a plastic bag. Gently roll a rolling pin across the surface several times until crumbs have a rustic texture — larger than a grain or rice but smaller than a pea. Measure 3/4 cup crumbs and set aside. (Reserve leftover crumbs for another purpose.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the fennel: Chop 3 tablespoons fronds and set aside. If you’re using large bulbs, cut lengthwise into quarters; if you’re using small bulbs, cut lengthwise in half. Leave base fully attached in both instances. Turn fennel pieces cut side up and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your largest sauté pan over medium-high heat. Add oil and butter. Then, working in batches to avoid overcrowding, add fennel cut side down and sear until deep chestnut brown, 2 to 3 minutes. If fennel is quartered, flip pieces to sear the other cut surface for 2 to 3 minutes more. Transfer fennel to a large Dutch oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add stock and wine to Dutch oven, place over low heat, cover and simmer until fennel is fork-tender but not mushy, 20 to 25 minutes. Using tongs or a slotted spoon, place fennel neatly in a 9 by 13-inch broiler-proof baking dish and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the bread crumb topping: In a medium saucepan over medium-low heat, melt butter. Add bread crumbs, garlic paste, fennel pollen and pepper and cook, stirring often, until crumbs are pale gold, 2 to 3 minutes. Don’t let them take on too much color. Remove pan from heat and stir in chopped fennel fronds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cheese sauce: In a saucepan over medium heat, melt butter and whisk in flour. Whisk for about 1 minute, then add garlic paste. Whisk until flour begins to take on a pale gold color, 2 to 3 minutes; you want a shade between off-white and not quite beige."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gradually whisk in milk. Once all of the milk has been added, whisk vigorously until sauce is completely smooth; turn down heat to medium-low and simmer, whisking periodically to avoid scorching, until sauce fully thickens, 10 to 12 minutes. Turn off heat, whisk in Gruyère, and season with salt and pepper. The sauce should be very thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble: Place a rack in the upper third of the oven and heat to 350 degrees. Pour cheese sauce over fennel (very gently reheat sauce if cold), and sprinkle with Gruyère and Parmigiano-Reggiano. Bake until bubbling and beginning to brown, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove gratin from oven and scatter bread crumb topping in an even layer across the top. Continue to bake until gratin takes on a deep golden hue, about 5 minutes. If it needs more color, place dish under the broiler for 1 minute, watching it very carefully to ensure nothing burns. Serve immediately."}]}