{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Soup From Scratch", "description": "Chicken soup is one of the most painless and pleasing recipes a home cook can master. This soup has all the classic flavors (celery, carrot, parsley) but has been updated for today's cooks, who can't easily buy the stewing hen and packet of soup vegetables that old-fashioned recipes used to call for. A whole bird provides the right combination of fat, salt and flavor. Don't be tempted to use all white meat, as the flavor won't be as round. Because making soup involves the bones and deep tissues of the bird, it is particularly reassuring here to use the highest-quality poultry you can find. This method produces a fragrant, golden, savory soup you want to eat all winter long; it's a perfect backdrop for noodles, rice or matzo balls.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/11/29/dining/recipelab-chick-noodle-still/recipelab-chick-noodle-still-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "appetizer, main course, carrot, celery, chicken, egg noodles, leek, onions, parsnip, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2308}, "recipeIngredient": ["1 chicken, 3 to 3 1/2 pounds, with skin, cut up", "3 stalks celery, with leaves, cut into chunks", "2 large carrots, cut into chunks", "2 yellow onions, peeled and halved", "1 parsnip or parsley root (optional)", "About 1 dozen large sprigs parsley", "About 1 dozen black peppercorns", "2 bay leaves", "2 teaspoons kosher salt, more to taste", "3 tablespoons reserved chicken fat, more if needed", "3 leeks, trimmed, halved lengthwise, rinsed and sliced crosswise into thin half-moons", "3 large carrots, peeled and cut into small dice", "Kosher salt and ground black or white pepper", "Egg noodles (fresh or dried), such as packaged wide noodles, spaetzle, fettuccine or pappardelle cut into short lengths (see note)", "Finely chopped herbs, such as parsley, scallions, dill or a combination"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken, celery, carrots, onions, parsnip (if using), parsley, peppercorns, bay leaves and salt in a large soup pot and cover with cold water by 1 inch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a boil over high heat, then immediately reduce the heat to very low. Adjust the heat until the soup is “smiling”: barely moving on the surface, with an occasional bubble breaking through. Cook uncovered, until the chicken is very tender and falling off the bone, 1 to 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cool enough to handle, use tongs to transfer chicken from the pot to a container. Taste the broth and continue to simmer it until it is concentrated and tasty. Strain broth through a fine sieve (or a colander lined with cheesecloth) into a separate container. Discard all the solids from the strainer (or reserve the vegetables, chill and serve with vinaigrette, if you wish)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate chicken pieces and broth separately for at least 8 hours (or up to 3 days), until a thick layer of yellow fat has risen to the top of the broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to finish the soup, use your fingers to separate chicken breast meat from bones and skin. Discard bones and skin. Use two forks to pull the breast meat apart into soft chunks, or use a knife and cut into bite-size pieces. (Reserve dark meat for another use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skim chicken fat from top of broth and set aside. Place 3 tablespoons of the fat in a soup pot with a lid. Add leeks, stir to coat, and heat over medium heat until leeks begin to fry. Then reduce the heat to a gentle sizzle and cook, stirring often, until slightly softened, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add carrots, sprinkle with salt, stir, and cover the pot. Cook until vegetables are just tender, about 5 minutes more. (Keep in mind that vegetables will continue to cook in the soup.) Do not brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour broth into pot with vegetables and heat to a simmer. Add noodles and simmer until heated through, soft and plumped with chicken broth. Add the breast meat, then taste broth and add salt and pepper to taste. For best flavor, soup should have some golden droplets of fat on top; if needed, add more chicken fat one teaspoon at a time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately, in a tureen or from the pot, sprinkling each serving with herbs."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Chicken Noodle Soup", "description": "Warm and comforting, this soup is a classic to master.", "thumbnailUrl": "https://static01.nyt.com/images/2016/11/29/dining/recipelab-chick-noodle-still/recipelab-chick-noodle-still-mediumThreeByTwo440.jpg", "uploadDate": "2016-11-29T21:05:09.000Z", "duration": "PT1M22S"}, "link": "https://cooking.nytimes.com/recipes/1018442-chicken-soup-from-scratch"}