{"@context": "http://schema.org", "@type": "Recipe", "name": "Blondies With a Strawberry-Balsamic Swirl", "description": "Most blond brownie recipes rely on copious amounts of brown sugar for flavor, without calling for any chocolate. These, from \"Marbled, Swirled and Layered\" by Irvin Lin, are an excellent exception. Using white chocolate that has been roasted and caramelized, they have a rich, buttery character with a peppery undertone from a bit of extra-virgin olive oil whisked into the batter. A swirl of homemade balsamic strawberry compote gives them a vein of jammy fruit amid all the sweet, gooey cake. Stored in an airtight container at room temperature, they keep for up to 3 days.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/12/07/dining/07JPCOOKBOOKS12/07JPCOOKBOOKS12-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "24 blondies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "balsamic vinegar, strawberries, white chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 153}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 268, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "7 grams", "sodiumContent": "82 milligrams", "sugarContent": "21 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 2/3 cups/285 grams white chocolate, in 1/4-inch chunks", "3/4 cup/170 grams (1 1/2 sticks) unsalted butter, at room temperature, more for pan", "3/4 cup/150 grams granulated sugar", "3/4 cup/165 grams packed dark brown sugar", "2 teaspoons vanilla extract", "3/4 teaspoon kosher salt", "3 large eggs", "1/2 cup/120 milliliters extra-virgin olive oil", "2 1/4 cups/315 grams all-purpose flour", "1 cup/160 grams cubed strawberries (1/2-inch chunks)", "1 tablespoon/12 grams granulated sugar", "1 teaspoon cornstarch", "2 teaspoons balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast white chocolate: Heat oven to 300 degrees. Spread white chocolate on a rimmed baking sheet and bake for about 10 minutes. Remove from oven and stir with a spatula until browned chocolate at edges is evenly mixed with uncooked chocolate in center. Once stirred, chocolate should be the color of dark peanut butter. If it isn’t, continue to bake in 5-minute increments to darken. Watch closely: White chocolate can easily burn. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make blondie batter: Lightly coat a 9x13-inch metal baking pan with butter. Line it with parchment paper so there is a 2-inch overhang on the pan's long sides. Place a clean, empty baking sheet in the oven, and increase the temperature to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place butter and both sugars in the bowl of a stand mixer fitted with the paddle attachment. Beat together on medium speed until light and creamy, about 2 minutes. Add vanilla and salt and beat to incorporate. Add eggs one at a time, beating after each addition to incorporate completely and scraping down the sides of the bowl. Add oil and beat. Scrape roasted white chocolate into bowl (it may have hardened and gotten a little grainy: This is O.K.) and mix it in. Add flour and mix on low speed until absorbed. Scrape batter into the prepared pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make strawberry-balsamic swirl: Place strawberries and sugar in a small saucepan over medium heat. Cook, stirring frequently with a wooden spoon and smashing the berries, until they release their juices and fall apart, 10 to 12 minutes. Separately, stir cornstarch and a tablespoon of water and drizzle it onto strawberries, continuing to stir for a minute or two until mixture has thickened into jam. Continue cooking for 2 more minutes, stirring constantly, then remove from heat. Stir in balsamic vinegar. Drop generous tablespoons of strawberry mixture over batter and use a butter knife to swirl them together, but don’t overmix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pan on baking sheet in oven. Bake until blondies are golden brown and a toothpick inserted into the center comes out clean, 25 to 35 minutes. They will firm up as they cool, so pull them out 2 or 3 minutes before your desired consistency. Place pan on a wire rack and, once room temperature, remove blondies from pan by pulling on parchment paper. Transfer to a cutting board, cut into squares, and serve."}], "link": "https://cooking.nytimes.com/recipes/1018454-blondies-with-a-strawberry-balsamic-swirl"}