{"@context": "http://schema.org", "@type": "Recipe", "name": "Provoleta (Grilled Provolone Cheese)", "description": "In Argentina, a thick slice of provoleta, a provolone-type cheese, is cooked over coals until browned and bubbling, then served as a mouthwatering appetizer with bread. It’s a bit like fondue or queso fundido but not quite as molten and melty. Typically, a large meal, or asado, of grilled sweetbreads, sausages and various cuts of beef follows, but provoleta makes a great snack with drinks, regardless of what you serve afterward. For ease of preparation, provoleta can be cooked in a cast-iron pan, under the broiler or baked in a hot oven. If you want success at cooking provoleta the traditional way, directly on the grill, leave the cheese uncovered at room temperature for several hours or overnight to dry the exterior a bit. A dab of chimichurri salsa is usually served alongside.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/08/23/dining/23kitchen4/23kitchen4-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, weekday", "keywords": "appetizer, garlic, parsley, provolone, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 105}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 439, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "2 grams", "proteinContent": "16 grams", "saturatedFatContent": "9 grams", "sodiumContent": "637 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup finely chopped parsley", "1 tablespoon finely chopped fresh oregano or 1 teaspoon dried", "2 or 3 garlic cloves, minced", "1/2 cup extra-virgin olive oil", "Salt and pepper, to taste", "Large pinch of crushed red pepper", "1 tablespoon red wine vinegar", "2 tablespoons cold water", "8 ounces provolone cheese, sliced at least 1 inch thick", "1 tablespoon roughly chopped fresh oregano or 1 teaspoon dried", "1/2 teaspoon crushed red pepper", "1 baguette, sliced in 1/2-inch rounds, toasted, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chimichurri: In a small bowl, stir together the parsley, oregano, garlic, olive oil, salt and pepper, crushed red pepper, vinegar and water. Thin with a little more water, if necessary, to make a pourable sauce. Set aside to let flavors meld. Sauce may be prepared up to 1 hour in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a small cast-iron pan over medium-high heat (or over hot coals). When pan is hot, put in the cheese. Sprinkle with half the oregano and crushed red pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook for about 2 minutes, until the bottom begins to brown. Carefully flip the cheese with a spatula and cook for 2 to 3 minutes more, until the second side is browned and the cheese is beginning to ooze. Transfer cheese to a plate and sprinkle with remaining oregano and crushed red pepper. Serve immediately, accompanied with bread and chimichurri. (Alternatively, finish the cheese by putting it under the broiler or in a hot oven.)"}], "link": "https://cooking.nytimes.com/recipes/1018896-provoleta-grilled-provolone-cheese"}