{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin Bundt Cake With Maple Brown-Butter Glaze", "description": "Bundt cakes are classic showstoppers — big, lofty and usually dressed in elegant drizzles and drips of glaze. Here, a dense, moist cake full of warm fall spices and pumpkin purée is encased in a layer of rich, nutty brown-butter maple glaze. Feel free to make it a day before you plan to serve it: This cake keeps well at room temperature, and you might think it's even better on the second day. Just make sure to keep it covered  and resist the urge to shave off a slice every time you walk by. If you can find it, use organic confectioners' sugar for the glaze. It's made from raw sugar and uses tapioca rather than cornstarch as its anticaking agent. It will give the glaze a richer taste and smoother texture than conventional confectioners’ sugar — a tip picked up from Stella Parks.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2017/10/28/dining/28COOKING-PUMPKINBUNDTCAKE2/28COOKING-PUMPKINBUNDTCAKE2-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "allspice, cardamom, cinnamon, pumpkin purée, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 972}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 516, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "77 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "9 grams", "sodiumContent": "372 milligrams", "sugarContent": "49 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cups/384 grams all-purpose flour", "2 teaspoons baking powder", "1 teaspoon baking soda", "1 1/4 teaspoons kosher salt", "2 teaspoons ground cinnamon", "1 1/2 teaspoons ground cardamom", "1/4 teaspoon ground allspice", "1/4 teaspoon ground black pepper", "2 cups/440 grams light brown sugar, packed", "1/2 cup/114 grams unsalted butter, soft but cool", "1/2 cup extra-virgin olive oil", "2 large eggs, at room temperature", "1 (15-ounce) can/425 grams pumpkin purée", "1/2 cup sour cream", "2 tablespoons unsalted butter", "1 cup/102 grams confectioners’ sugar (preferably organic), sifted", "1/4 cup maple syrup", "Pinch of salt", "1 to 2 tablespoons lightly toasted pepitas (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees, and butter and flour a 12-cup (or larger) capacity bundt pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the flour, baking powder, baking soda, salt, cinnamon, cardamom, allspice and black pepper until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, combine brown sugar, butter and olive oil. Beat on medium-high until light and fluffy, about 3 minutes. Add the eggs one at a time, mixing for about 20 seconds in between each egg. Add the pumpkin purée and sour cream, and mix until well combined, scraping the bottom and sides of the bowl as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bowl from the mixer, and use a rubber spatula to fold in the dry ingredients until well combined. Make sure to scrape the bottom and sides of the bowl to ensure an evenly mixed batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan, smooth the top and firmly tap the pan on the countertop a few times to release any large air bubbles. Bake the cake until golden and puffed, and a tester inserted into the center comes out clean, 55 to 65 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the cake, still in its pan, on a rack to cool for 20 minutes, then use the tip of a knife to loosen the edges and invert the cake onto the rack to cool completely before glazing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the glaze: Once the cake is cool, melt the butter in a saucepan over medium heat. Cook the butter, occasionally scraping the bottom and sides of the pan with a rubber spatula until it turns a deep golden brown and smells nutty. Don’t walk away from the pan during this process. The butter can go from brown and nutty to acrid and burnt in mere moments."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer butter and all the brown bits from the pan to a heat-safe bowl, and let it cool slightly. Whisk in the confectioners’ sugar, maple syrup and salt until smooth. The glaze should be thick but pourable. If it’s too thin, add a bit more confectioners’ sugar. If it’s too thick, add a few drops of water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cake to a serving platter and pour the glaze evenly over the top. Sprinkle with pepitas if desired. Let the glaze set for a few minutes before slicing."}], "link": "https://cooking.nytimes.com/recipes/1018933-pumpkin-bundt-cake-with-maple-brown-butter-glaze"}