{"@context": "http://schema.org", "@type": "Recipe", "name": "Celery Toasts", "description": "This was the first recipe that the chef and writer Gabrielle Hamilton brought to The Times as an Eat columnist for the Sunday magazine in 2016, a snack-tray-sandwich version of a celery-and-fennel salad served at her restaurant, Prune, in the East Village. It calls for thick, white toasted Pullman bread spread wall to wall with unsalted butter, with slices of blue cheese neatly laid on top, below a mound of shaved celery and thinly sliced scallions dressed in garlic, olive oil, lemon juice and salt, and the whole shebang dusted in ground black pepper before being cut in halves or quarters. \"The ingredients come from the grocery store,\" she wrote in her column. \"These toasts are not expensive or intimidating, but they are outstanding.\"", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2016/10/23/magazine/23eat/23mag-23eat-t_CA1-articleLarge.jpg", "totalTime": "PT12M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "finger foods", "keywords": "appetizer, blue cheese, celery", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 325}, "recipeIngredient": ["2 slices country white Pullman bread, 1/2-inch thick", "Sweet butter", "4 ounces Cambozola triple-cream blue cheese, sliced, divided evenly between two toasts", "1 cup shaved celery, from the inner head, toughest outer stalks removed, thinly sliced on the bias", "2 scallions, thinly sliced on bias all the way up from the white through the green", "1 large clove garlic", "Extra-virgin olive oil", "Lemon juice", "Kosher salt", "Several grinds black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the bread to golden. Butter generously, “wall to wall.” Lay cheese slices on top of buttered toast, neatly, evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together the celery and the scallions. Microplane the garlic into the celery mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dress with olive oil, lemon juice and salt, and stir very well, until completely dressed, almost wet with dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mound the shaved celery salad evenly on top of the blue-cheese toasts, and grind black pepper over them very generously. Cut each in half or quarters."}], "link": "https://cooking.nytimes.com/recipes/1018356-celery-toasts"}