{"@context": "http://schema.org", "@type": "Recipe", "name": "Katsu Curry", "description": "It is Japan’s chili, its bacon cheeseburger, its meatloaf and gravy all in one, a hangover-killing man meal found in bars and restaurants up and down the country narrow, never as good as Mom’s. It is katsu curry: a thick, fragrant, porky roux glopped across delicate short-grain rice and topped — gilded, really — with a deep-fried pork cutlet, served beside a tangle of shredded cabbage. It’s great.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "asian", "recipeCategory": "", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 64}, "recipeIngredient": ["3 tablespoons butter", "1 pound ground pork", "Salt and freshly ground black pepper", "3 tablespoons flour", "3 tablespoons curry powder, preferably S&B (see note)", "1 onion, peeled and quartered", "3 garlic cloves, peeled", "1 green apple, peeled, cored and quartered", "1 mango, peeled, cored and quartered", "1 2-inch piece ginger, peeled and cut into coins", "1 large carrot, peeled and cut into coins", "2 tablespoons tomato paste", "1 tablespoon Worcestershire sauce", "1 cup low-sodium chicken broth, plus more as needed", "Peanut or canola oil", "3 eggs, beaten", "1 cup panko bread crumbs", "6 thin, center-cut boneless pork chops, lightly pounded", "Salt and freshly ground black pepper", "Cooked short-grain Japanese rice", "Raw cabbage, thinly sliced", "Tonkatsu sauce (optional, see note)."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Melt the butter in a large saucepan over medium-high heat. Add the ground pork and season generously with salt and pepper. Cook, stirring occasionally, until the meat has browned and the moisture has evaporated. Mix in the flour and curry powder, turn the heat to low and cook for 5 minutes, stirring occasionally, to make a porky roux."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a food processor, pulse together the onion, garlic, apple, mango, ginger, carrot, tomato paste and Worcestershire sauce until a grainy purée forms. Transfer the purée to the pork and mix until combined. The sauce should be very thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the chicken broth and cook, partly covered, over low heat for about an hour, stirring occasionally. If needed, add a bit more stock to loosen the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pork: Heat 1 inch of oil in a frying pan and set a candy thermometer in the oil. Place the eggs in a wide shallow bowl and the panko in another. When the oil temperature reaches 320 degrees, season the pork chops all over with salt and pepper. Cover them, one by one, in the egg and then in the panko, and fry in batches in the hot oil until browned, for about 4 minutes per side. Transfer to a paper-towel-lined plate and let drain for 5 minutes. Slice the pork chops against the grain. Serve the curry sauce over cooked Japanese rice. Top with the sliced pork and serve with a small handful of sliced cabbage. If you choose, drizzle the cutlet with a little tonkatsu sauce."}]}