{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Beans and Tofu Skins With Rice Sticks", "description": "This light-on-the-noodles, heavy-on-the-vegetables dish comes together in under a half hour. Lots of fresh ginger and dried Thai chiles provide plenty of liveliness, a perfect counterpoint to the warm earthiness of the dark sesame oil. \n\nNever heard of tofu skins? They are the sheets that form on the surface of warmed soy milk, and you can find them in Asian specialty markets. They're tender and egg-y, and like tofu, absorb the flavors of the dish they're in.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/04/05/dining/05COOKING-GREENBEANSTOFU/05COOKING-GREENBEANSTOFU-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "pastas", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 19}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 346, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "5 grams", "proteinContent": "20 grams", "saturatedFatContent": "1 gram", "sodiumContent": "501 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 ounces dried rice stick noodles (fettuccine-thickness type), available in Asian markets", "4 ounces dried tofu skins, or 6 ounces fresh, available in Asian markets", "2 tablespoons peanut or neutral oil, like grapeseed or corn", "2 tablespoons dark sesame oil", "2 tablespoons minced peeled fresh ginger", "Whole dried Thai chiles, to taste (optional)", "Salt and freshly ground black pepper", "1 pound green or wax beans, trimmed and cut into 1-inch segments", "2 tablespoons soy sauce, more to taste."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put rice noodles in a large bowl and cover with boiling water. If you are using dried tofu, put in a large bowl and cover with warm water. Soak skins until pliable, about 10 minutes, then drain well and cut into long, wide ribbons. (If using fresh, simply cut them.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put peanut oil and half the sesame oil in a deep skillet or wok and turn heat to medium-high. Add ginger and a couple of chiles if you like, and sprinkle with salt and pepper. Cook, stirring frequently, until ginger is soft, just a minute. Add beans and 1/4 cup water and cook, stirring frequently, until softened a bit but still crisp, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tofu skins and another spoonful or two of water. Cook, stirring frequently, until skins are heated through and beans are done, a couple of minutes. Drain noodles, toss them in, and continue to cook, until noodles are heated through and mixed well with remaining ingredients; add a little more water if necessary to keep mixture moist. Drizzle with soy sauce and remaining sesame oil, taste and adjust seasoning, and serve."}], "link": "https://cooking.nytimes.com/recipes/1018686-green-beans-and-tofu-skins-with-rice-sticks"}