{"@context": "http://schema.org", "@type": "Recipe", "name": "Kerala Roadside Chicken", "description": "In the south Indian state of Kerala, a street stall selling food is called a thattukada, and one of the most well-known dishes served is something called chicken fry, or thattu chicken. The chef Asha Gomez, who grew up in the Kerala port city of Trivandrum and now lives in Atlanta, took that street chicken and adapted it into a quick-cooking recipe that relies on coconut oil for crispness, and curry leaves, ginger and garlic for flavor. It gets its heat and color from Kashmiri chile powder, a fruity pepper used in many Indian dishes. It’s worth seeking out the pepper online, or at a market that caters to Indian shoppers, where you can also find the fresh curry leaves that are key to this dish. Ms. Gomez serves it with the flaky paratha that’s unique to Kerala, but any flatbread, or even rice, works well. It’s also a great dish to set out as a nibble with drinks, as they do in the toddy shops of southern India.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2017/06/07/dining/07INDIAjp7/07INDIAjp7-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, poultry", "keywords": "chicken, coconut oil, curry leaves, garam masala, ground fennel, turmeric, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 895}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1198, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "122 grams", "fiberContent": "2 grams", "proteinContent": "27 grams", "saturatedFatContent": "103 grams", "sodiumContent": "397 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 cloves garlic, peeled", "1/2-inch-piece ginger, peeled", "1 1/2 pounds boneless, skinless chicken breast, cut into 1-inch pieces", "2 teaspoons Kashmiri chile powder (or substitute hot paprika)", "2 teaspoons ground fennel seeds", "2 teaspoons garam masala", "1 teaspoon turmeric powder", "1 teaspoon kosher salt", "3 cups coconut oil", "1/4 cup coconut oil", "2 large shallots, thinly sliced", "3 whole small dried red chiles (such as Japones or arbol), broken into 3 pieces each", "12 to 15 curry leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chicken: Smash and chop the garlic and ginger. Then, using a mortar and pestle, blend them together into a paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine chicken, garlic-ginger paste, spices and salt. Mix well so the spices are evenly distributed. Set chicken aside, covered, in the refrigerator for an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 12-inch cast-iron skillet, heat the coconut oil on medium heat until a small piece of chicken sizzles vigorously when you add it. Add half the chicken (or however much fits comfortably in a single layer) and deep-fry for 5 to 6 minutes, turning any pieces poking out of the oil halfway through if necessary, until every piece is cooked through. Set the fried chicken aside to drain on a paper-towel-lined plate, and repeat with the remaining chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the garnish: Heat coconut oil in a medium sauté pan over high heat. When a small piece of shallot sizzles vigorously in the oil, add the shallots, dried chiles and curry leaves. Cook, stirring often, until shallots are golden brown, 6 to 8 minutes. Add the garnish to the fried chicken and serve with warm paratha or another flatbread. "}], "link": "https://cooking.nytimes.com/recipes/1018782-kerala-roadside-chicken"}