{"@context": "http://schema.org", "@type": "Recipe", "name": "Lime, Mint and Rum Tarts", "description": "These small tarts, inspired by a mojito, are the perfect celebratory end to a meal: refreshing, light and boozy. If you don’t have a spice grinder, finely chop the mint for the final step of the curd and then crush it in a pestle and mortar with the rum before adding to the curd. The aim is for the mixture to be as fine as possible, almost like a paste or like pesto, so that it’s fine enough to turn the curd slightly greener, rather than just fleck it with mint. A touch of parsley makes the green even more vibrant. If you want to work ahead, you can make the pastry dough a day in advance. The curd will keep in the fridge for up to a week; the vibrancy of the mint will fade a little, but it will still be fine. Bake the pastry on the day you are serving, though, and serve as soon as possible after the rum is poured over the tart.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2017/03/08/dining/08BAKING4/08BAKING4-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "12 tarts", "recipeCuisine": "", "recipeCategory": "pastries, pies and tarts", "keywords": "dessert, lime, mint, rum", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 130}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 736, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "75 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "2 grams", "proteinContent": "11 grams", "saturatedFatContent": "26 grams", "sodiumContent": "199 milligrams", "sugarContent": "42 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup/150 grams all-purpose flour (plain flour), more for rolling out dough", "6 tablespoons/80 grams cold unsalted butter, diced", "1 tablespoon plus 1 teaspoon/20 grams granulated or superfine sugar (caster sugar)", "1/4 teaspoon salt", "1/4 teaspoon white wine vinegar", "2 tablespoons ice water", "1/2 cup/120 milliliters lime juice (from about 5 to 6 limes), plus the zest of 2 limes, cut in wide strips, avoiding bitter white pith", "2/3 cup/120 grams granulated or superfine sugar (caster sugar)", "1 packed cup/25 grams mint leaves, plus 12 small mint leaves (or regular leaves, shredded just before using) for garnish", "2 tablespoons dark rum, plus 1 tablespoon for serving", "6 parsley leaves", "2 large eggs plus 5 large egg yolks", "2 teaspoons cornstarch (corn flour)", "7 tablespoons/100 grams cold unsalted butter, diced", "1 tablespoon Demerara sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pastry: Place flour, butter, sugar and salt in the bowl of a food processor. Pulse a few times, until mixture is the consistency of fine bread crumbs, then, with the machine on, slowly add vinegar and ice water. Process for a few seconds, until pastry starts to come together, then dump the dough onto a clean surface. (It will be very sandy.) Gather and pat the dough into a disc that is roughly 1 inch/3 centimeters thick. Wrap in plastic wrap and refrigerate for 1 hour, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pastry chills, make the curd. First, make the lime syrup: Bring lime juice and granulated or superfine sugar to a boil in a medium saucepan over high heat. Cook for 1 to 2 minutes, swirling frequently, until sugar has melted, and then boil for another minute. Remove from heat, add lime zest, along with a generous 1/3 cup/10 grams mint leaves, and set aside for 10 minutes to infuse."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the syrup cools, make the herb paste: Pour 2 tablespoons rum into a spice grinder with the parsley and remaining scant 2/3 cup/15 grams of the mint. Pulse for about 10 seconds, until a paste forms, scraping down the sides of the work bowl and pulsing and/or shaking the machine again, if necessary. Set aside. (Alternately, you can whirl the herbs in a small food processor until chopped and then reduce the mixture to a paste in a mortar and pestle. Or, finely chop the herbs on a cutting board and, adding a small amount of rum at a time, work the mixture into a paste with the edge of a large knife.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain lime syrup into a large heatproof bowl; squeeze the leaves and zest to extract as much flavor as possible and then discard. In a separate large bowl, whisk together 2 whole eggs, 5 yolks and the cornstarch until no lumps remain, and then stir into the cooled lime syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add scant 1 inch/2 centimeters water to a medium saucepan, bring to a simmer over high heat and reduce the heat to medium. Place the bowl of eggs and syrup over the pan of gently simmering water and whisk continuously for 6 to 8 minutes, or until you have a thick, mousselike curd. Add butter and stir for an additional minute, or just until butter has melted, then remove from heat and set the curd aside to cool for about 10 minutes. Stir reserved herb paste into the curd, cover the surface directly with plastic wrap and refrigerate for at least 1 hour, until completely cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured work surface, tap the chilled pastry all over with a rolling pin to soften slightly before rolling out until 1/16 inch/1 to 2 millimeters thick, using additional flour sparingly to prevent the dough from sticking. (The dough should be about 1 foot/30 centimeters in diameter.) Using a 3 1/2- to 4-inch/9- or 10-centimeter round cookie cutter, cut out 8 circles and gently ease these into the cups of a muffin tin. (If you use a 4-inch cookie cutter, you'll need to roll the dough very thin.) Press down to fill the cups and press the sides so that the pastry rises to the rim of the cup; doing this will help you fill the tarts generously. Re-roll the remaining pastry to form 4 more circles and transfer to the muffin tin. Chill for at least 1 hour or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees Fahrenheit/180 degrees Celsius. Blind-bake the pastry: Line the pastry shells with either paper muffin liners or squares of parchment paper. Fill with pie weights, rice or dried beans and then bake for 18 minutes, or until the pastry shells are a light golden brown around the edges and inside. Remove the parchment paper liners and weights and return the pastry to the oven for another 6 to 7 minutes, until dark golden brown. Quickly and carefully remove the shells from the muffin tin and set aside to cool completely on a wire rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve the tarts: Spoon 2 to 3 tablespoons (about 40 grams) of the curd into each tart shell, or enough curd to fill the shell up to the rim. Smooth the surface of the curd with the back of a knife. Sprinkle the center of each tart with a pinch of Demerara sugar and then arrange the small mint leaves or shredded mint on top. Finally, drizzle each tart with few drops of the remaining tablespoon of rum."}], "link": "https://cooking.nytimes.com/recipes/1018650-lime-mint-and-rum-tarts"}