{"@context": "http://schema.org", "@type": "Recipe", "name": "Mashed Fava Bean Toasts", "description": "Fresh fava beans are a great addition to a spring vegetable stew or a pasta primavera. But savored on their own, mashed and smeared on toast for crostini, they are sensational. It is a fussy job, though — each bean must be peeled by hand. Try to get a friend to help; the work goes faster with more hands. You will need about 5 pounds of fava beans in the pod to yield 2 cups of mashed favas, but this labor of love is worth it.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/05/11/dining/11KITCH5/11KITCH5-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "2 cups, about 36 small toasts", "recipeCuisine": "", "recipeCategory": "finger foods", "keywords": "appetizer, baguette, fava beans, spring, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 79}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 263, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "15 grams", "proteinContent": "18 grams", "saturatedFatContent": "1 gram", "sodiumContent": "508 milligrams", "sugarContent": "19 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 pounds fava beans in the pod", "Extra-virgin olive oil", "Salt and pepper", "4 cloves garlic, minced", "Pinch of crushed red pepper", "1/2 teaspoon freshly chopped rosemary", "1 baguette, thinly sliced", "Coarse sea salt, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Shuck the beans from their pods, discarding the pods. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch the beans: Drop shucked favas in boiling water for 1 minute, then plunge into ice water. When cool, drain in a colander, then pierce outer skin from each bean with thumbnail and squeeze to slip off skins. Discard skins and set peeled favas aside. (May be prepared up to 24 hours ahead of time.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 tablespoons olive oil in a skillet over medium-high heat. Add peeled favas and season generously with salt and pepper. Stir to coat with oil, add garlic, and let sizzle for a few minutes without browning. Add 1/2 cup water, cover and let simmer until beans have softened and most of the liquid is gone, about 10 minutes. Turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a potato masher or wooden spoon, mash favas roughly. (If favas are larger and starchier, they may have begun to fall apart already, which is fine.) Put pan back on stove and turn heat to medium. Stir in crushed red pepper and rosemary (and a little water if the mash is too thick), adjust seasoning, and transfer fava beans to a warm bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly toast baguette slices. Smear each toast with a tablespoon or so of mashed fava. Drizzle with more olive oil and sprinkle with coarse sea salt if desired."}]}