{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Chops With Brandied Cherries", "description": "Pork and fruit is a classic combination, and for good reason: The sweetness and tang of the fruit softens the gamy richness of the meat. Here, a pan sauce of ripe summer cherries seasoned with a little brandy and fresh thyme adds verve and complexity to seared pork chops, while garam masala and allspice add heady, aromatic notes. You can use either sour or sweet cherries, as long as you balance the flavors at the end. Sweet ones will need a touch of vinegar for acidity, while sour cherries may need a drizzle of honey. Do take the time to get a good, dark sear on the meat before making the sauce. Those browned bits on the bottom of the pan are the flavor backbone of the sauce. The darker the color, the deeper the sauce.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/07/06/dining/06APPE-WEB1/06APPE-WEB1-mediumThreeByTwo440.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "brandy, cherries, garam masala, pork chops, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 370}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 402, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "2 grams", "proteinContent": "36 grams", "saturatedFatContent": "7 grams", "sodiumContent": "744 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 3/4 teaspoons kosher salt, more to taste", "1 1/2 teaspoon garam masala", "1/2 teaspoon black pepper", "1/4 teaspoon ground allspice", "2 bone-in pork chops, 1 1/2 inches thick, about 1 pound each", "1 tablespoon olive oil", "1 garlic clove, smashed and peeled", "2 tablespoons brandy", "2 cups fresh sweet or sour cherries, pitted and halved", "4 sprigs thyme, plus thyme leaves for garnish", "1 tablespoon unsalted butter", "1/2 teaspoon sherry vinegar or honey, or more to taste (use the vinegar with the sweet cherries, the honey with the sour cherries)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine salt, garam masala, pepper and allspice in a small bowl. Rub mixture all over pork chops, covering their entire surface. Let chops rest for 15 to 30 minutes at room temperature, or up to 24 hours, covered, in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 10-inch skillet at medium-high. Add oil. Sear pork chops until brown, about 2 to 3 minutes per side. Add garlic to pan, then sear the fatty edges of the chops, using tongs to hold them up, for about 30 seconds to 1 minute each. (Flip the garlic after it browns on one side.) If the pan starts to smoke at any point, lower the heat. Transfer the pork to a plate, and spoon off all but a thin layer of fat from pan. (Leave garlic in the pan.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add brandy to pan, let it simmer until the alcohol burns off (about 30 seconds), then add cherries, thyme and 2 tablespoons water. Let simmer for 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Move cherries to the sides of the pan and return pork chops to the center so they can make contact with the metal. Cover pan and cook over low heat for about 7 minutes, until meat reaches 130 to 135 degrees on an instant-read thermometer. (Its temperature will rise as it rests.) Transfer the pork to a cutting board and let rest for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add butter and vinegar or honey to the pan, stirring until butter melts and coats the cherries. Taste and add more honey or vinegar, and salt as needed. Serve pork with cherries and more thyme on top."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Pork Chops With Brandied Cherries", "description": "Cooking cherries in brandy adds sweetness to this meaty summer dish.", "thumbnailUrl": "https://static01.nyt.com/images/2016/07/06/dining/06APPE-WEB1/06APPE-WEB1-mediumThreeByTwo440.jpg", "uploadDate": "2016-07-01T16:21:38.000Z", "duration": "PT2M29S"}, "link": "https://cooking.nytimes.com/recipes/1018200-pork-chops-with-brandied-cherries"}