{"@context": "http://schema.org", "@type": "Recipe", "name": "Steak Tartare", "description": "The curative powers of raw meat are often cited and frequently lampooned — I’m thinking of the guy slumped back in his chair, after the brawl, with a fat raw steak on his mangled black eye. I can’t speak to that, but a hand-chopped mound of cold raw beef, seasoned perfectly, at around 3 o’clock in the afternoon on New Year’s Day, with a cold glass of the hair of the Champagne dog that bit you the night before, will make a new man out of you. The strong-flavored pumpernickel bread is a family nostalgia that has become a beloved preference. The butter and the Vegemite are personal eccentricities I happen to find exceptionally delicious.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2017/01/01/magazine/01steak-tartare/01steak-tartare-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "beef tenderloin, capers, egg, pumpernickel, vegemite, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 133}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 559, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "4 grams", "proteinContent": "34 grams", "saturatedFatContent": "18 grams", "sodiumContent": "901 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8-10 ounces highest-quality beef tenderloin, trimmed of all silver skin, fat flap, gristle — leaving nothing but dark red beef", "2 slices dense, unleavened black pumpernickel bread", "2 tablespoons unsalted Irish butter, tempered to cool and spreadable", "4 teaspoons Dijon mustard", "2-4 teaspoons Vegemite, per your taste", "1 small, firm, shiny red onion, peeled and thinly sliced in rings", "Coarse kosher salt", "2 tablespoons capers, in brine", "Watercress leaves from one bunch, stems saved for another use", "Celery leaves from one bunch", "6 sprigs parsley, roughly chopped — just 3 or 4 cuts with a chef knife", "Freshly ground black pepper", "2 tablespoons Worcestershire sauce", "2 egg yolks, raw, or 1 if cooked"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the trimmed beef in the freezer for 20 minutes while you prep the rest of the ingredients. Meanwhile, butter the bread, wall to wall, then slather the mustard evenly among the two buttered slices. Finish each slice with a healthy schmear of the Vegemite."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, toss the red onion slices with a healthy pinch of salt, allowing the rings to separate, and soften a bit from the salting. Add the capers with a bit of their brine and the cress, celery leaves and parsley, and toss well, making a little salad."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, remove the meat from freezer. It will now be firm and easy to cut. Slice into 1/8-inch-thin slices. (We often wear doubled-up latex gloves to help keep the heat from our hands from transferring to the beef. The warmer the meat, the more difficult to cut beautifully. Also, this is the occasion for your sharpest knife.) Shingle the meat slices ever so slightly, and slice into 1/8-inch matchsticks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn your cutting board 180 degrees, and cut the matchsticks into 1/8-inch tiny dice, resembling the cut called brunoise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer your elegantly hand-chopped meat to a glass, stainless or ceramic bowl, and season with the Worcestershire sauce, a couple pinches of coarse kosher salt and a few good grinds of black pepper, and toss together distributing the seasoning, using a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Distribute the seasoned beef evenly between the two slices of buttered, seasoned bread, and form into a patty, more or less, still using the fork. Arrange the salad over the beef artfully, distributing evenly between the two portions. Give the whole enterprise a healthy finishing grind of black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Nestle each yolk, still in its half shell if using raw, into the mound, and let each guest turn the yolk out onto the tartare before eating. If using cooked yolk, microplane the yolk over the tartare to finish."}], "link": "https://cooking.nytimes.com/recipes/1018517-steak-tartare"}