{"@context": "http://schema.org", "@type": "Recipe", "name": "Chinese Wheat Wrappers", "description": "These Chinese flour tortillas are popular in northern China, where they are paired with anything stir-fried in small shreds, such as <a href=\"http://cooking.nytimes.com/recipes/1018333-moo-shu-pork\">moo shu pork</a>. The author Carolyn Phillips is a proponent of using Korean flour, which is lower in gluten than American all-purpose flour. Adding a layer of oil between the dough before rolling it into a circle is a trick that allows the layers to be peeled apart after cooking for a thinner wrapper. But even unpeeled, these wrappers are fairly thin.", "author": {"@type": "Person", "name": "Sara Bonisteel"}, "image": "https://static01.nyt.com/images/2016/09/27/dining/27CHINESE-REX2/27CGINES-REX2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "8 (5-inch) pancakes", "recipeCuisine": "chinese", "recipeCategory": "snack, breads", "keywords": "Korean flour, peanut oil, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 47}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 77, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "1 milligram", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup/136 grams Korean all-purpose flour, more as needed ", "6 to 7 tablespoons boiling water", "1 tablespoon peanut or vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place flour in a medium bowl and stir in just enough boiling water so the flour is shaggy and all of the water is absorbed into a soft dough. Empty dough onto a smooth work surface and knead it until smooth, adding more flour as necessary to keep it from sticking. When it is as soft as an earlobe, cover the dough with plastic wrap and let rest for about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough into 16 even pieces and roll each piece into a ball before flattening each ball with the palm of your hand. Use a pastry brush to lightly coat the surface of half of the circles with oil, and place the other half of the circles on top of the oiled ones to create 8 dough sandwiches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll each sandwich into an even circle. Roll the circles out into flat tortillas about 5 inches wide. Keep the dough covered when not working with it and sandwich the uncooked pancakes between plastic wrap to keep them from drying out. The wrappers can be prepared ahead of time up to this point and frozen in plastic wrap. Be sure to separate each wrapper with plastic wrap to keep any two from sticking and then pack them in a resealable freezer bag."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a seasoned yet unoiled cast-iron frying pan over medium heat. When the bottom is hot, add 1 wrapper and slowly cook it on one side until the bottom is spotted brown and the top starts to puff up, about 1 minute. Turn the wrapper over and briefly cook it on the other side, then transfer it to a clean tea towel and cover it so that it steams lightly. Repeat with the rest of the wrappers until all are cooked and you have a stack of warm tortillas in your towel. At this point, you will be able to peel them apart, if you wish, for very thin wrappers, or keep them as is for thicker ones."}], "link": "https://cooking.nytimes.com/recipes/1018334-chinese-wheat-wrappers"}