{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Calamari With Fregola", "description": "In Sardinia, rustic saucy fish stews are commonly served with fregola, simmered golden nuggets of toasted semolina, hearty and satisfying. A relative of couscous, fregola arrived by ship from nearby Tunisia, became popular and melded into the local cuisine long ago. The little round pellets are the size of a peppercorn, or a bit larger. When cooked, they have a pleasant, slightly chewy texture. Traditionally, fregola is used in vegetable soups as a way to add substance; prepared like a juicy risotto with the concentrated flavor of clams or other shellfish; or served as part of a room-temperature salad. Most Italian stores in the United States carry it, but you may substitute Israeli-style pearl couscous, which has a similar flavor.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/03/08/dining/08KITCH1/08KITCH1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, grains and rice, seafood, soups and stews", "keywords": "anchovy, basil, calamari, fregola, oregano, tomato, white wine, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 205}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 348, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "3 grams", "proteinContent": "30 grams", "saturatedFatContent": "1 gram", "sodiumContent": "766 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds small to medium calamari, tubes and tentacles cleaned, cut into 1/2-inch pieces", "Salt and pepper", "Extra-virgin olive oil", "1/2 teaspoon crushed red pepper", "4 anchovy fillets, roughly chopped", "4 small garlic cloves, minced", "1 large onion, diced (about 1 1/2 cups)", "1/8 teaspoon crumbled saffron", "1/2 cup dry white wine", "1 cup diced canned tomato", "3/4 cup chicken broth or water", "1 cup fregola sarda (add 1/2 cup for heartier appetites)", "12 basil leaves", "Pinch of dried oregano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the calamari on a baking sheet and pat dry as best you can with paper towels. Season generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 tablespoons olive oil in a large, wide skillet over high heat. Add calamari and quickly stir-fry, cooking for only 1 minute, until puffed. Remove from pan with slotted spoon and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to stove, reduce heat to medium-high and add 1 tablespoon olive oil. Add crushed red pepper, anchovy and garlic and let sizzle, then add onions and stir well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season onions generously and cook, stirring, for 2 to 3 minutes, until softened and faintly colored. Add saffron and wine and simmer for 1 minute, then add tomato and broth. Adjust heat so sauce simmers gently for about 10 minutes, until flavors are well mingled. Taste for salt and hot pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring 4 cups salted water to a boil. Add fregola and cook until al dente, 8 to 10 minutes. Drain and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add par-cooked calamari to the sauce over high heat. Add basil leaves and stir well until everything is heated through and calamari are completely cooked, about 2 minutes. Transfer to a warm serving bowl and fold in cooked fregola. Sprinkle with oregano, add a drizzle of olive oil, if desired, and serve."}]}