{"@context": "http://schema.org", "@type": "Recipe", "name": "Sourdough No-Knead Bread", "description": "So you’ve brought a <a href=\"http://cooking.nytimes.com/recipes/1013152-sourdough-starter\">sourdough starter</a> to life, or received one as a gift, or purchased one somewhere. You’ve fed it and watched it become bubbly and fragrant, with a light yeasty-boozy scent. Now it’s time to bake bread. An easy way to start is with this adaptation of the baker Jim Lahey’s storied recipe for <a href=\"http://cooking.nytimes.com/recipes/11376-no-knead-bread\">no-knead bread</a>, replacing commercial yeast with a little less than three-quarters of a cup of healthy, well-fed sourdough starter. Give the resulting dough a long, long rise and then plop it into a hot, enameled cast-iron pot with a lid. You’ll have an incredible loaf within the hour, and may well find yourself addicted to the smell, the taste and the process alike.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/03/23/dining/23SOURDOUGH2/23SOURDOUGH2-articleLarge.jpg", "totalTime": "P1D", "recipeYield": "1 loaf", "recipeCuisine": "", "recipeCategory": "breads", "keywords": "bread flour, sesame seeds, sourdough starter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 847}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 259, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "0 grams", "sodiumContent": "178 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["3 1/2 cups/425 grams bread flour", "1 teaspoon/6 grams kosher salt", "3/4 cup/180 grams <a href=\"http://cooking.nytimes.com/recipes/1013152-sourdough-starter\">sourdough starter</a>, “fed”", "2 tablespoons/9 grams sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine the flour and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small mixing bowl, stir together 300 grams (about 1 1/4 cups) lukewarm tap water with the sourdough starter, then pour the mixture into the bowl with the flour mixture. Mix until just combined. Cover the bowl with plastic wrap and a tea towel and leave it to rise overnight, about 10 to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, dust a clean kitchen surface with flour. Scoop out the dough and place it on the surface, then dust with more flour. Gently fold the edges of the dough from the outside in, to form a round loaf. Dust a clean towel with yet more flour and place the dough on it, the seam side down, then cover and allow to double in size, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat oven to between 450 and 550 degrees. Place a covered enamel Dutch oven or heavy pot with a lid into the oven and allow it to heat for 30 minutes or so. Remove the pot from the oven, take off its top, and carefully invert the risen dough into it, so that the seam side is now facing up. Sprinkle with the sesame seeds, then put the top back on the pot and return it to the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for about 25 to 30 minutes, then take the top off the pot and allow it to continue to cook until it is brown and crusty all over, an additional 20 minutes or so. Put the loaf on a rack to cool for at least 30 minutes before serving."}]}