{"@context": "http://schema.org", "@type": "Recipe", "name": "Seafood Choucroute", "description": "Bold, bracing sour beers like gueuze, kriek and lambic will slice right through a meal from aperitif to cheese, stymied only at dessert. They’ll stand up to fat, juicy pork and will welcome all sorts of seafood, like clams and oysters, smoked salmon, grilled bass, and skate in a saline caper butter. You also cannot go wrong with the Alsatian sauerkraut classic, choucroute garnie. But consider making that dish a clever showcase for fresh and smoked fish, with the typical pork at a minimum. Years ago, I loved the fish choucroute at Au Crocodile in Strasbourg, France, with a dry riesling. Back then, who knew from sour beer?", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2011/11/23/dining/23PAIR_SPAN/23PAIR_SPAN-articleLarge-v3.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "seafood", "keywords": "main course, side dish, mussels, sauerkraut, sea scallop, smoke trout, sour beer, trout", "aggregateRating": null, "recipeIngredient": ["2 ounces slab bacon, diced", "8 sea scallops, patted dry", "1 cup chopped white ends of leeks", "4 cloves garlic, sliced", "1 Granny Smith apple, peeled, cored and cut in 1-inch dice", "1 smoked trout, skinned and boned", "1 cup gueuze, kriek or other sour beer, preferably blond", "1 1/2 pounds sauerkraut, drained and squeezed dry", "Salt and pepper", "12 small (2-inch) white potatoes, peeled", "12 mussels, scrubbed", "2 fresh trout fillets, about 6 ounces each, skinned", "Juice of 1/2 lemon", "1 tablespoon chopped tarragon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place bacon over medium heat in a 4-quart stovetop casserole that can go to the table. When lightly brown, remove and reserve, leaving fat. Raise the heat to high, add scallops and sear briefly on both sides. Remove. Reduce heat to low, return bacon to the pan, add leeks and garlic, and cook until softened. Stir in the apple, cook about a minute, then add the smoked trout, broken into chunks. Add beer, bring to a simmer, stir in sauerkraut and season with salt and pepper. Tuck scallops into sauerkraut. Cover and simmer 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a pot of salted water to a boil for potatoes. Simmer until tender, 15 to 20 minutes. Drain and return to the pot. Cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tuck the mussels into the sauerkraut around the edges of pot. Cut the fresh trout in 2-inch pieces and place on top of sauerkraut. Sprinkle with lemon juice. Cover and cook about 6 minutes, until mussels have opened and fresh trout is opaque. Scatter with tarragon and serve from casserole with potatoes on the side."}], "link": "https://cooking.nytimes.com/recipes/1018264-seafood-choucroute"}