{"@context": "http://schema.org", "@type": "Recipe", "name": "Neck Bones (Pork Neck and Noodles)", "description": "This simple dish features pork neck bones simmered in seasoned water that slowly cooks into a broth. Elbow-shaped pasta is then added into the water to absorb all the meaty flavors. Erika Council, a software engineer who is also a professional cook and a food writer, shared the recipe, which she learned from her maternal grandmother, Geraldine Gavin Dortch. It shows up amid the more elegant dishes on the family Thanksgiving table as a subtle reminder of the food their enslaved ancestors cooked from the parts of the pig they had access to. It's a surprisingly rich, comforting and delicious dish coaxed from only a few ingredients.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2016/11/11/dining/COOKING-PORK2/COOKING-AFRICAN2-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "6 servings", "recipeCuisine": "southern", "recipeCategory": "dinner", "keywords": "main course, pasta, pork neck bones", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 41}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 671, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "1 gram", "proteinContent": "56 grams", "saturatedFatContent": "12 grams", "sodiumContent": "736 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons olive oil", "3 to 4 pounds pork neck bones", "2 teaspoons kosher salt", "1 teaspoon ground black pepper", "1 teaspoon red pepper flakes", "1 onion, diced", "1 1/2 cups elbow-shaped pasta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in a Dutch oven or large pot over medium-high heat. Season neck bones all over with salt, black pepper and red pepper flakes. Add neck bones to pot and sear for 4 to 5 minutes, then flip and brown the other side, 4 to 5 minutes more. Add onions and 3 cups water. It's O.K. if the water doesn't cover all the neck bones; they will cook down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to low, cover and slowly simmer, stirring occasionally, 2 1/2 to 3 hours, or until the meat is very tender and falling off the bone."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cooked neck bones to a separate bowl. Bring liquid to a boil, then add pasta and more salt and pepper to taste, if desired. Stir constantly for the first 2 to 3 minutes to keep pasta from sticking. Reduce heat to low; cover and cook, stirring occasionally, 8 to 10 minutes, or until pasta is al dente."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, if you'd like, remove the meat from the bones using your fingers or a fork. Discard bones and any cartilage. When pasta is done, stir the cooked meat back into the pot. Serve hot alongside a heaping of greens (collard or mustard) and a hunk of cornbread."}], "link": "https://cooking.nytimes.com/recipes/1018399-neck-bones-pork-neck-and-noodles"}