{"@context": "http://schema.org", "@type": "Recipe", "name": "Spring Ramen Bowl With Snap Peas and Asparagus", "description": "This lighter take on ramen, with snap peas and shaved asparagus, comes from the vegetarian cookbook author Lukas Volger. The flavors are perked up with pounded or grated ginger and lemon zest. You can skip the frizzled scallion garnish, but it does add nice texture to the finished bowl.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2016/03/09/dining/09MARTHA1/09MARTHA1-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, noodles, soups and stews", "keywords": "asparagus, eggs, kombu, miso paste, nori, shiitake, sugar snap peas, main course, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 290}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 344, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "5 grams", "proteinContent": "10 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1410 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces asparagus, preferably thick stalks", "4 dried shiitake mushrooms", "2 plump garlic cloves, smashed", "4 2-inch squares kombu, or 2 longer sticks", "2 tablespoons white or yellow miso paste", "1 teaspoon fine sea salt, more to taste", "4 ounces sugar snap peas", "8 ounces dried or 12 ounces fresh ramen noodles", "2 2-inch squares toasted nori", "4 large hard-boiled eggs, semi-firm or firm yolks (optional)", "Zest of 1/2 to 1 lemon, to taste", "Freshly grated ginger, to taste", "Toasted sesame oil, for garnish", "Neutral oil, such as canola or grapeseed", "1/2 bunch scallions, trimmed and cut into 3-inch matchsticks", "Fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Snap off the tough ends of the asparagus and set the top parts aside. Combine the tough asparagus ends, mushrooms, garlic and 9 cups water in a stockpot or saucepan and bring to a boil. Reduce heat and simmer for 20 minutes. Add kombu, remove from the heat, and let stand for 30 minutes. Strain out and discard the solids and return the broth to the stockpot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the broth is simmering, prepare the frizzled scallions, if using: Heat 1/2 inch of oil in a small skillet or saucepan over medium heat. Test temperature by adding a piece of scallion; it should sizzle on contact. Add scallions and cook, stirring frequently, until brown all over but not burned. Use a spider or slotted spoon to transfer to a paper-towel-lined plate. Sprinkle with salt and allow to cool. (Use within a few hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a tall glass or measuring cup, combine miso and a ladleful of hot broth. Purée thoroughly with an immersion blender until smooth. (Alternately, carefully purée in a blender.) Pour mixture back into the stockpot and bring to a bare simmer. Add salt and taste, adding more if necessary. Keep covered over low heat until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a vegetable peeler to shave the asparagus spears into ribbons. (It’s easiest to do this by laying them flat on a cutting board, and using a Y peeler.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring another saucepan of salted water to boil and prepare an ice bath. Remove the fibrous strings from the snap peas. (To do so, pinch one end and pull along the straight edge of the pea as if it’s a zipper.) Once the water comes to a boil, add snap peas and blanch for 90 seconds. Use a slotted spoon to transfer peas to the ice bath. Reserve the boiling water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add noodles to the boiling water, in a strainer or the pasta insert that comes with a stockpot, and cook until tender, usually 4 to 7 minutes for dried or 60 to 90 seconds for fresh. Lift out the noodles, reserving the cooking water, and rinse the noodles thoroughly under cold running water. Quickly dunk them back into the hot water to reheat. Divide among four bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, wave the nori squares over the flame of a gas burner a few times, until the corners curl and they turn crisp, or roast under a broiler, flipping periodically. Slice into thin strips with a chef’s knife or crumble with your fingers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange asparagus, snap peas and egg halves, if using, over the noodles in each bowl. Add a pinch of lemon zest and a few gratings of ginger to each bowl, then cover with the piping hot broth. Divide frizzled scallions on top, if using, then garnish each serving with a few drops of sesame oil and the nori. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1018013-spring-ramen-bowl-with-snap-peas-and-asparagus"}