{"@context": "http://schema.org", "@type": "Recipe", "name": "Gazpacho", "description": "All gazpacho is good, but starting with the sweetest, most flavorful tomatoes you can find will make this one great. As you blend and strain the soup, taste it constantly, adjusting the salt and vinegar incrementally. Inch by inch, push the flavors to the edge: the soup should taste seasoned but not salty, tangy but not sour. While it chills, make the croutons and basil oil, which will give the smooth soup delightful contrasts in both texture and color.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2017/07/02/magazine/02eat1/02mag-02eat.t_CA0-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "cherry tomatoes, jalapeño, persian cucumbers", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 331}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 575, "unsaturatedFatContent": "42 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "8 grams", "sodiumContent": "846 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 small red onion", "3 Persian cucumbers, peeled", "1 large red bell pepper, seeded, ribs removed", "1/2 jalapeño pepper, seeded, ribs removed", "2 1/2 pounds Sungold (or other orange) cherry tomatoes (about 3 to 4 pint baskets or 8 1/2 cups), stemmed", "1 clove garlic", "1/2 cup extra-virgin olive oil", "Kosher or fine sea salt", "1-2 teaspoons sherry vinegar or red-wine vinegar", "16 basil leaves", "1/4 cup extra-virgin olive oil", "5 ounces Sweet 100 (or other red) cherry tomatoes (about 1/3 pint basket or 1 cup), stemmed and halved", "Kosher or sea salt", "1/2 cup extra-virgin olive oil", "4 slices white bread (crusts removed), diced into 1/2-inch cubes", "Kosher or sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut half the onion, 2 of the cucumbers, 3/4 of the bell pepper and the jalapeño into 1-inch pieces. Place in the bowl of a food processor or blender jar. Add Sungold tomatoes, garlic, olive oil and 2 teaspoons kosher salt or 1 teaspoon fine sea salt. Blend at high speed until completely smooth. (If necessary, blend in batches, then stir together.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a fine-mesh sieve over a large bowl, and strain soup, using a spatula to help press the liquid through; discard the solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely dice remaining onion, cucumber and pepper, and add to soup; stir in vinegar. If desired, add water 1 tablespoon at a time to thin out the soup. Taste, and adjust salt and vinegar as needed. Cover, and chill soup for 45 minutes. (Chill 6 soup bowls now too.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the basil oil: Finely chop the basil leaves. Place in a small bowl, and cover with the olive oil. Add the halved cherry tomatoes and a generous pinch of salt. Toss to combine, then taste and adjust salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the croutons: Line a plate with paper towels. Set a 10-inch cast-iron pan over medium heat. When the pan is hot, add the olive oil and 1 bread cube. When the cube starts to sizzle, add the remaining cubes, and stir gently to coat evenly in oil. Reduce heat to medium low, and cook for 12 to 15 minutes, stirring regularly, until croutons are golden-brown and crisp. Use a slotted spoon to remove croutons to the plate to drain, and season lightly with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, ladle soup into chilled bowls. Garnish with basil oil and croutons. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1018825-gazpacho"}