{"@context": "http://schema.org", "@type": "Recipe", "name": "Halibut Niçoise", "description": "What if salade niçoise wasn't a salad at all, but a warmer, heftier dish with a beautiful piece of butter-browned halibut right at its center? Erin French, the chef at the Lost Kitchen in Freedom, Me., does just that with her Maine halibut niçoise, in which the main components of a classic niçoise are accounted for, but totally reconfigured. Beans and new potatoes are in a simple shallot dressing; eggs are poached so the yolks are still soft and runny; garlic and anchovies season a quick tapenade. If your cast-iron pan fits only two fillets comfortably, cook the fish in two batches to avoid overcrowding.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/08/02/dining/02ERINREX1/02ERIN2-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, salads and dressings, seafood", "keywords": "egg, halibut, lettuce, olives, potato, tomato, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 146}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 594, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "6 grams", "proteinContent": "53 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1361 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt, as needed", "1/2 pound green beans, trimmed", "1 pound baby or new potatoes", "1/2 cup mixed kalamata and green olives, pitted and finely chopped", "1 anchovy fillet, finely chopped", "1 garlic clove, finely chopped", "2 tablespoons finely chopped shallots", "2 tablespoons rice wine vinegar", "4 tablespoons olive oil", "Ground black pepper, as needed", "1 large ripe heirloom tomato, cut into 8 wedges", "4 eggs", "4 halibut fillets (about 1/2 pound each)", "2 tablespoons unsalted butter", "1 head bibb lettuce, leaves separated, washed and torn into bite-size pieces", "1 lemon, halved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot with water, season generously with salt, and bring to a boil. In the sink, prepare a bowl full of cold water and ice. Add green beans to the pot and cook for 45 seconds to 1 minute, then scoop out with a slotted spoon and transfer to ice water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potatoes to the pot of hot water and simmer for 20 to 25 minutes, or until they are fork tender. Drain and set aside until cool enough to handle. Leave the smaller potatoes whole, and halve or quarter any larger ones so they’re bite-size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, mix olives, anchovy and garlic, and set aside. In a large bowl, mix shallots and rice wine vinegar, and let stand for 20 minutes. Add 2 tablespoons olive oil and a few turns of ground black pepper. Drain and add green beans, along with potatoes and tomato wedges, and toss gently to coat. Season with salt and pepper, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a 12-inch skillet with 2 inches of water and bring to a boil. Crack each egg into a small bowl and fish out any pieces of shell. Slide eggs into the water and poach until white is set and yolk is still soft, about 3 minutes. Remove eggs with a slotted spoon to a bowl of warm water until ready to plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Heat a large ovenproof skillet, ideally cast iron, over high heat. Add remaining 2 tablespoons olive oil and swirl to coat the pan. Pat the halibut dry with a paper towel and season all over with salt and pepper. Add fillets to hot pan, skin-side down, leaving at least 2 inches between each. (Cook fish in 2 pans or in 2 batches if needed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let fish cook until it releases easily from the pan, about 2 to 3 minutes. Flip fillets, add butter to pan and transfer to the oven. After 2 minutes, baste fish with melted butter, then return to oven until it’s just cooked through, slightly firm and golden brown, 2 to 3 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide lettuce among four plates, and top with dressed beans, potatoes and tomato. Add fish and top each fillet with a poached egg. Drizzle over any extra pan juice from the fish, along with a spoonful of the olive-anchovy mixture. Squeeze lemon juice over each plate and eat immediately."}], "link": "https://cooking.nytimes.com/recipes/1018874-halibut-nicoise"}