{"@context": "http://schema.org", "@type": "Recipe", "name": "Country Fried Chesapeake Catfish With Jalapeño-Mint Aioli", "description": "At his Succotash restaurants, Edward Lee serves this dish with pickled scuppernongs, a Southern variety of grape. You can serve it as is or add <a href=\"https://cooking.nytimes.com/recipes/2664-pickled-seedless-grapes\">pickled red grapes</a> or fresh, halved grapes for a punch of sweetness.", "author": {"@type": "Person", "name": "Jane Black"}, "image": "https://static01.nyt.com/images/2017/10/18/dining/18chef3/18chef3-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "asian, southern", "recipeCategory": "dinner, seafood", "keywords": "buttermilk, catfish, mayonnaise, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "recipeIngredient": ["1 tablespoon unsalted butter", "1 teaspoon olive oil", "4 jalapeños, seeded and roughly chopped", "5 cloves garlic, roughly chopped", "2 teaspoons lemon juice", "2 cups mayonnaise (Duke’s, if available)", "1/2 cup fresh chopped mint leaves", "Kosher salt, to taste", "Freshly ground black pepper, to taste", "1 1/2 cups all-purpose flour", "1 1/2 cups fine cornmeal", "1 tablespoon smoked paprika", "1 tablespoon onion powder", "1 tablespoon kosher salt", "1 teaspoon freshly ground black pepper", "2 cups buttermilk", "4 blue catfish fillets, skinless (about 6 to 8 ounces each)", "2 cups vegetable oil", "2 lemons, cut in half"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the aioli: Heat a small sauté pan over high heat. Add the butter and olive oil to the pan and immediately add the jalapeños and 4 of the garlic cloves. Cook for about 3 to 5 minutes or until the jalapeños are nicely charred. Let cool to room temperature. Transfer to a food processor and add the remaining garlic clove, lemon juice and mayonnaise. Pulse until combined. (Don’t worry if it isn’t smooth.) Scrape down the sides of the food processor bowl, add the mint and season with salt and pepper. Pulse until well combined and chill. You can use it right away, but it will get better after a few hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the catfish: In a shallow casserole dish, mix the flour, cornmeal, smoked paprika, onion powder, salt and pepper. Pour the buttermilk into a separate casserole dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat catfish fillets dry, and using a very sharp chef’s knife, slice them horizontally into 2 thinner fillets, about 1/2-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the oil into a 12- to 14-inch skillet, preferably cast iron, and heat over medium heat until the oil is hot but not smoking. While it is heating, dip the catfish into the buttermilk, then lift out and shake off the excess liquid. Transfer the catfish sheets onto the dredge and press firmly on both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To test the oil, add a small piece of fish to the pan; if it bubbles immediately, the oil is ready. After dredging each fillet, add it to the pan, cooking as many as will comfortable fit into the pan at one time. Cook for about 4 minutes until the edges are golden brown, then flip and cook for another 2 minutes or until cooked through. Immediately transfer to a paper towel lined plate. Repeat with remaining catfish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer 2 catfish pieces to each plate and top each piece with the jalapeño-mint aioli. Serve immediately with lemon on the side."}], "link": "https://cooking.nytimes.com/recipes/1018951-country-fried-chesapeake-catfish-with-jalapeno-mint-aioli"}