{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoking Bishop", "description": "‘‘I’ll raise your salary, and endeavour to assist your struggling family,’’ Scrooge tells Bob Cratchit near the end of A Christmas Carol, ‘‘and we will discuss your affairs this very afternoon, over a Christmas bowl of smoking bishop!’’ This recipe, adapted from the book Drinking With Dickens, by Charles Dickens’s great-grandson, Cedric, reflects Scrooge’s new disposition and largesse perfectly: it’s warm and sweet and meant for sharing. (To Cedric Dickens’s recipe, I’ve added some fragrant cardamom pods, because years of drinking <a href=\"http://www.nytimes.com/2011/12/11/magazine/glogg-before-nog.html\">glogg</a> have shown me how well they play with orange and wine, but you may omit them). \n\nIf you’re unable to find Seville oranges—marked by a pleasant, pronounced bitterness — substitute five navel oranges, and add the juice of one lemon when you add the port to the pan (do not stud the lemon with cloves or roast the lemon with the oranges).", "author": {"@type": "Person", "name": "Rosie Schaap"}, "image": "https://static01.nyt.com/images/2016/12/11/magazine/11drink2/11drink2-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "cocktails", "keywords": "cardamom pods, cloves, red wine, ruby port, seville orange, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 30}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 416, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "3 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "22 milligrams", "sugarContent": "34 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 Seville oranges", "1/2 cup Demerara sugar", "1 bottle red wine (not too dry nor too sweet)", "1 bottle Ruby port", "30 cloves", "5 dried green cardamom pods", "Orange peel for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. Prepare oranges for roasting: wash and dry them well, and stud each fruit equally with cloves. Roast the clove-studded fruits in the oven for an hour, then transfer them to a large glass or ceramic bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sugar and the red wine (do not add the port yet) to the bowl. Cover the bowl and leave it in a warm spot in the kitchen for at least 12 hours, and up to 24."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the citrus-sugar-wine mixture has rested, cut the fruits in half and juice them through a strainer into the wine and sugar mixture. Discard fruits after they have been juiced. Strain the mixture again, this time into a heavy saucepan. Discard solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the port, the cinnamon stick, and the cardamom pods to the saucepan, and heat very slowly—until it “smokes” (the vapors rise), hence the name; do not allow it to boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the Bishop is as hot as you like, turn off the heat. Remove the cinnamon stick and cardamom pods. Serve in warmed, heatproof glasses, garnished with orange peel."}]}