{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Pork With Citrus and Mint", "description": "In this recipe for a Thai-inspired salad, made for a 6- to 8-quart electric pressure cooker, crispy pork, flavored with fish sauce and lime, is paired with sweet and juicy pomelo (or use grapefruit) and heady fried garlic chips. If you’d rather make this in a slow cooker, you can; it'll take 5 to 7 hours on high. (You can also make it in a stovetop pressure cooker, by trimming a few minutes off the cooking time. The stovetop versions tend to operate at a slightly higher pressure, cooking food more quickly.)", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/02/01/dining/01APPE2/01APPE2-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "10 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "cucumber, fish sauce, grapefruit, jalapeño, lime, mint, pork shoulder, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 418}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 480, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "1 gram", "proteinContent": "32 grams", "saturatedFatContent": "12 grams", "sodiumContent": "665 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["5 garlic cloves", "2 tablespoons honey", "Finely grated zest of 2 limes", "2 1/2 teaspoons kosher salt, more to taste", "1 teaspoon freshly ground black pepper", "4 pounds boneless pork shoulder, cut into 2 or 3 pieces", "1 tablespoon peanut oil, more as needed", "1 bunch of cilantro, leaves and stems separated", "3 tablespoons Asian fish sauce", "1 tablespoon rice wine vinegar", "1 small red or green chile, sliced", "1 pomelo or 3 grapefruits", "1 1/2 teaspoons fresh lime juice", "1/4 teaspoon honey", "6 Persian cucumbers, thinly sliced (about 4 cups)", "Leaves from 1 bunch of cilantro", "Leaves from 1 bunch of mint", "1 to 2 jalapeños, thinly sliced, seeds removed or not, to taste", "Fine sea salt, to taste", "Cooked rice or rice noodles, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate 1 garlic clove into a small bowl, then stir in honey, lime zest, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut 1-inch deep slits all over pork. Rub marinade all over, and into slits, and let sit for at least 30 minutes at room temperature, or even better, cover and refrigerate for up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice remaining 4 garlic cloves. Set electric pressure cooker to sauté (or use a large skillet), and add oil. Once it’s hot, add half the garlic and cook until golden brown, about 5 minutes. Transfer with slotted spoon to plate lined with a paper towel and sprinkle liberally with salt. Repeat with remaining garlic, adding more oil if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pork to pot and sear until browned all over, about 2 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cilantro stems to pot with pork (reserve leaves for salad). Add 3/4 cup water, fish sauce, vinegar and chile to pot. Set to cook for 90 minutes on high pressure. Manually release steam. Let pork cool until you can handle it, then shred it into bite-size pieces while still warm. Pork can be made up until this point up to 3 days ahead (store it in the refrigerator)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pork cools, strain liquid from bottom of pot. Pour off fat, or chill liquid and scoop off fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, heat the broiler. Transfer pork to a rimmed baking sheet, and toss with a tablespoon or two of the reserved cooking liquid (just enough to coat it without making it soggy). Broil until crisped on top, 2 to 3 minutes; it will char in some places, and that’s fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut top and bottom off pomelo or grapefruit. Stand fruit up on cutting board on a flat end, then slice off the peel and pith, letting your knife follow curve of fruit. Working over a large bowl to catch the juices, slice the segments away from the membranes, letting fruit fall into the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together 1/3 cup reserved pork cooking liquid, lime juice and honey. Add mixture to bowl with pomelo or grapefruit and toss in cucumbers, cilantro leaves from the two bunches, mint and sliced jalapeño. Season with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss shredded pork with more cooking liquid to taste. Serve pork with salad topped with garlic chips, with rice or rice noodles if you like."}]}