{"@context": "http://schema.org", "@type": "Recipe", "name": "Hainanese Chicken With Rice", "description": "While this is the most basic version of Hainanese chicken, the best one is the provenance of devotees, who save the stock they don’t need for the rice, freeze it, and use it as a starting point for the next time they cook chicken this way. If you do this repeatedly, the stock will become stronger and stronger, as will the flavors of both chicken and rice. If you do this hundreds of times, the way restaurants do, the flavors will be quite intense. But even if you do it once, the dish is a total winner.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2008/09/12/dining/hainanese-chicken/hainanese-chicken-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 8 servings", "recipeCuisine": "chinese", "recipeCategory": "", "keywords": "chicken, garlic, rice, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 248}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 661, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "4 grams", "proteinContent": "36 grams", "saturatedFatContent": "7 grams", "sodiumContent": "978 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt and freshly ground pepper", "1 whole (3- to 4-pound) chicken, trimmed of excess fat", "Several cloves smashed garlic, plus 1 teaspoon minced garlic", "Several slices fresh ginger, plus 1 tablespoon minced ginger", "1/2 cup peanut oil, or neutral oil, like corn or canola", "3 shallots, roughly chopped, or a small onion", "2 cups long-grain rice", "1/2 cup minced scallions", "2 cucumbers, peeled and sliced", "2 tomatoes, sliced", "Chopped fresh cilantro leaves", "2 tablespoons sesame oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and salt it. Add chicken to pot along with smashed garlic and sliced ginger. Bird should be completely submerged, but only just. Cover, reduce heat to medium, and cook for 10 minutes. Turn off heat and let bird remain in water for 45 minutes to an hour, covered, or until it is cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken from pot, reserve stock, and let bird cool to room temperature. Put half the peanut oil in a skillet over medium heat; you may add trimmed chicken fat to this also. When oil is hot, add remaining garlic, along with shallots; cook, stirring occasionally, until lightly browned, about 5 minutes. Add rice and cook, stirring, until glossy. Add 4 cups reserved chicken stock and bring to a boil, then reduce heat to low and cover; cook for about 20 minutes, until rice has absorbed all liquid. Stir in salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a dipping sauce of remaining oil, ginger, half the scallions and a large pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shred or chop chicken, discarding skin. Put rice on a large platter and mound chicken on top of it; decorate platter with cucumbers, tomatoes, remaining scallions and cilantro. Sprinkle sesame oil over all and serve with dipping sauce."}], "link": "https://cooking.nytimes.com/recipes/1018094-hainanese-chicken-with-rice"}