{"@context": "http://schema.org", "@type": "Recipe", "name": "Wild Mushroom and Butter Bean Pasta", "description": "This is a great pasta for autumn, hearty and deeply flavorful. Wild golden chanterelle mushrooms are especially nice and often available in the fall; choose small, firm, unblemished ones. Otherwise use a mixture of pale oyster mushrooms, including royal trumpets. End-of-summer fresh shelling beans work well here, or any dried white bean, such as cannellini. The simple complementary flavors of olive oil, pancetta, garlic and rosemary are just right, mingling with lightly browned mushrooms and creamy beans. Make sure to keep the pasta firmly al dente. To get the best rosemary flavor, chop it at the last moment, and toss a rosemary sprig into the pot while the pasta is cooking.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/10/05/dining/05KITCH-WEB1/05KITCH-WEB1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "pastas", "keywords": "butter beans, chanterelle mushrooms, pasta, rosemary, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 225}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 409, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "6 grams", "proteinContent": "14 grams", "saturatedFatContent": "3 grams", "sodiumContent": "478 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups fresh butter beans or other shelling beans (from about 2 pounds in the pod), or 1 cup dried cannellini or other white bean, cleaned", "1 small bay leaf", "Salt and pepper", "3 ounces thickly sliced pancetta or slab bacon, cut crosswise into 1/4-inch-wide lardons", "Extra-virgin olive oil", "1 medium red onion, diced", "12 ounces wild chanterelle mushrooms, thickly sliced or chopped or a mixture of pale oyster mushrooms", "3 or 4 garlic cloves, minced", "1/4 to 1/2 teaspoon crushed red pepper flakes, to taste", "1 teaspoon freshly chopped rosemary, plus a sprig for the pasta pot", "1 pound bucatini, spaghetti or other dry pasta", "2 tablespoons roughly chopped parsley", "Parmesan or pecorino cheese, grated (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put beans in a pot and cover with water by 2 inches. Add bay leaf and 1/2 teaspoon salt and and bring to a boil over high heat. Reduce to a simmer and cook until tender, about 30 minutes. Let beans cool to room temperature in cooking liquid and set aside. When cool, taste and correct salt. (If using dried beans, cooking time will be about 1 hour.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a large pot of water for cooking pasta and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put pancetta in a wide, deep skillet over medium-high heat. Add 1 tablespoon olive oil and stir to coat. Let lardons sizzle gently until crisp and golden, about 3 minutes. Add onions, season lightly with salt and cook, stirring, until lightly browned and softened, about 5 minutes. Remove onion mixture from pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to stove over high heat and add 2 tablespoons olive oil. When oil is hot, add chanterelles and stir to coat. Season generously with salt and pepper and cook, stirring until lightly browned, about 2 minutes. Turn heat to medium and stir in garlic, crushed red pepper flakes and chopped rosemary. Cook for a minute more and turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a handful of salt to the pasta water, then add rosemary sprig and bring to a full boil. Add bucatini and stir well. Adjust heat to keep pasta cooking briskly. Cook until firmly al dente (you should feel it is not quite done) and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pasta is cooking, put skillet of mushrooms back on medium-high heat. Add reserved onion-pancetta mixture and heat through, stirring. Add beans and 1 cup bean cooking liquid and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cooked pasta to pan and stir well, coating the pasta with the mushroom-bean mixture. While stirring, let pasta finish cooking, about 1 minute more, adding a little more bean liquid if necessary. Transfer to a wide pasta bowl, sprinkle with parsley and serve. Offer grated Parmesan or pecorino cheese if you wish."}]}