{"@context": "http://schema.org", "@type": "Recipe", "name": "Torn Croutons", "description": "Store-bought croutons simply can’t compete with homemade ones. To begin with, your raw ingredients are almost certainly of a higher quality, and hence more delicious, than the stuff anyone else will use. What’s more, the rustic, uneven shape of torn croutons, like these croutons from \"Salt, Fat, Acid, Heat\" by Samin Nosrat, lends a variety of textures to your salads. Dressing clings to them better, they’re more lovely to look at, and they are less likely to scratch the roof of your mouth.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2017/05/09/dining/09SALADGUIDE15/09SALADGUIDE15-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "8 cups", "recipeCuisine": "", "recipeCategory": "", "keywords": "country bread, sourdough", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 65}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 234, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "342 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1-pound loaf day-old country or sourdough bread", "1⁄3 cup extra-virgin olive oil", "Salt, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. For more teeth-friendly croutons, remove the crusts from the bread, then cut the loaf into inch-thick slices. Cut each slice into inch-wide strips. Working over a large bowl, tear each strip into inch-size pieces. Alternatively, you can tear croutons directly off the loaf, as long as you get somewhat evenly sized pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss croutons with olive oil to coat them evenly, then spread them out in a single layer on a baking sheet. Use a second sheet as needed to prevent crowding, which will entrap steam and keep the croutons from browning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast croutons for about 18 to 22 minutes, checking them after 8 minutes. Rotate the pans, switch their oven positions, and use a metal spatula to turn and rotate the croutons so that they brown evenly. Once they begin to brown, check them every few minutes, continuing to turn and rotate. Some croutons might be done when others still need a few more minutes of baking, so remove them from the tray and let the rest finish cooking. Bake the croutons until they’re golden brown and crunchy on the outside, with just a tiny bit of chew on the inside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste a crouton and adjust the seasoning with a light sprinkling of salt if needed. Let croutons cool in a single layer on the baking sheet. Use immediately or keep in an airtight container for up to 2 days. To refresh stale croutons, bake for 3 to 4 minutes at 400 degrees."}], "link": "https://cooking.nytimes.com/recipes/1018757-torn-croutons"}