{"@context": "http://schema.org", "@type": "Recipe", "name": "Provençal Greens Soup", "description": "In France this simple, nutritious soup is made with wild greens that you might forage on an afternoon’s walk, such as nettles, watercress and dandelion greens. If you must use one green, make it Swiss chard. The soup can be prepared through step 1 several hours before serving.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2019/01/02/dining/mrs-provencal-greens-soup/mrs-provencal-greens-soup-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner, easy, lunch, soups and stews", "keywords": "appetizer, beet greens, country bread, dandelion greens, egg, swiss chard, watercress, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1484}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 170, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "360 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "2 leeks, cut in half lengthwise, sliced, rinsed of dirt and drained on paper towels", "4 garlic cloves, sliced", "Kosher salt", "6 cups chopped greens (leaves only), such as Swiss chard, dandelion greens, watercress and beet greens", "Black pepper, to taste", "2 large eggs", "4 thick slices country bread, toasted and rubbed with a cut clove of garlic", "Grated Parmesan, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon olive oil in a large, heavy soup pot over medium heat, and add the leeks. Cook, stirring, until tender, 3 to 5 minutes. Add the garlic and 1/2 teaspoon salt, and cook, stirring, until the garlic is fragrant, about 1 minute. Add the greens, and stir until they begin to wilt. Add 1 1/2 quarts water (6 cups) and salt to taste, and bring to a simmer. Reduce the heat and simmer, partially covered, for 15 to 20 minutes, until the greens are very tender and the broth sweet. Add pepper, and taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a bowl. Making sure that the soup is not boiling, whisk a ladle of it into the beaten eggs. Take the soup off the heat, and stir in the tempered eggs. Brush the garlic croutons with olive oil, and place one or two in each bowl. Ladle in the soup, sprinkle on some Parmesan if desired and serve."}], "link": "https://cooking.nytimes.com/recipes/1018496-provencal-greens-soup"}