{"@context": "http://schema.org", "@type": "Recipe", "name": "Codfish Cakes With Sweet Peppers and Onions", "description": "Codfish cakes are traditionally made with salt cod, which needs a day or two of soaking to soften and desalinate the salted fish. This version uses lightly cured fresh cod instead, and a bright mix of green herbs. These cakes are not floured or breaded — instead, they are gently fried in olive oil until golden.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/09/14/dining/14KITCHEN-WEB1/14KITCHEN-WEB1-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, seafood", "keywords": "bread crumbs, chorizo, cilantro, cod, mint, onion, pimentón, scallions, sweet red pepper, thyme, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 94}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 248, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "4 grams", "proteinContent": "24 grams", "saturatedFatContent": "1 gram", "sodiumContent": "629 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds cod, scrod or haddock fillet", "Salt and pepper", "A few thyme sprigs", "2 bay leaves", "1 cup bread crumbs, soaked 10 minutes in 1 cup milk and squeezed dry", "1/2 teaspoon lemon zest", "3 tablespoons chopped parsley", "3 tablespoons chopped mint", "1 cup chopped cilantro, leaves and tender stems", "4 scallions, white and light green parts, very thinly sliced", "Extra-virgin olive oil", "4 ounces Spanish chorizo, diced (optional)", "4 cups thinly sliced sweet red peppers (such as Corno di Toro, Cubanelle, Jimmy Nardello or red bell), from 4 medium peppers", "2 cups thinly sliced onion, from 2 medium onions", "Pinch of crushed red pepper flakes", "Pinch of pimentón", "3 garlic cloves, minced", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season cod fillet all over with salt and pepper, then wrap and refrigerate for at least 3 hours, or overnight. Rinse briefly with cold water and pat dry with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a saucepan with water. Add thyme and bay leaves and bring to a boil. Carefully slip fish into the water and turn off heat. Wait 2 minutes and test with a fork; the fish should be just done. Drain fish and let cool, then transfer to a mixing bowl and flake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add bread crumbs, lemon zest, parsley, mint, cilantro and scallions to fish. Mix with a wooden spoon until well combined. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form mixture into 12 balls, flatten them slightly, and arrange on a baking sheet in a single layer. Wrap and refrigerate for 15 minutes, or until ready to cook, up to 4 hours in advance. (Mixture may seem loose and crumbly, but the cakes will hold together when cooked.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 tablespoons olive oil in a large wide skillet over medium-high heat. Add chorizo, if using, and let sizzle for a minute, then add peppers and onions, red pepper flakes, pimentón and garlic. Season with salt and pepper and stir to coat. Let mixture cook, stirring frequently, until onions and peppers soften and begin to brown, about 8 to 10 minutes. Set pan aside. Reheat just before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook fish cakes, pour about 1/4 inch olive oil in a wide cast-iron skillet over medium heat. When it is hot, carefully place fish cakes in the pan in one layer without crowding (work in batches if necessary). Cook until browned on first side, about 3 minutes. Turn cakes over and cook for 2 minutes more, until browned. Serve with the stewed peppers and onions, and lemon wedges."}], "link": "https://cooking.nytimes.com/recipes/1018281-codfish-cakes-with-sweet-peppers-and-onions"}