{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Chicken Parm", "description": "Chicken parm – crisp chicken served with tomato sauce, draped in mozzarella and anointed with grated Parmesan, served perhaps on a hero roll or beside a tangle of pasta – is among the finest dishes of the Italian diaspora in America. There is sweetness and salt to the dish, along with the base creaminess of cheese and the satisfying crunch of the chicken’s crust. These combine, especially under a spray of red pepper flakes, to deliver immense satisfaction. This recipe, adapted from one the chef Justin Bazdarich uses at the Speedy Romeo restaurants in New York, moves the preparation of the dish to the grill, and delivers a dish that is smoke-scented and beautiful, with flavors that manage to be both delicate and robust.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/06/26/magazine/26eat/26mag-26eat-t_CA0-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "chicken thighs, kale, mozzarella, tomatoes, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 309}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 782, "unsaturatedFatContent": "39 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "62 grams", "fiberContent": "3 grams", "proteinContent": "46 grams", "saturatedFatContent": "18 grams", "sodiumContent": "1006 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 boneless, skin-on chicken thighs, about 2 1/2 pounds", "1 tablespoon lemon zest", "6 sprigs thyme, leaves only", "3 cloves garlic, peeled", "1/2 cup olive oil", "1 28-ounce can whole San Marzano tomatoes", "Kosher salt, to taste", "1 medium-size bunch kale, stems removed and sliced into strips", "Red-pepper flakes, to taste", "8-10 basil leaves, roughly torn", "8 ounces fresh mozzarella sliced thinly into 8 pieces", "1/3 cup grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Marinate the chicken. Place the chicken skin-side down in a snug pan or platter with sides, then evenly apply the lemon zest, thyme leaves and 2/3 of the garlic and massage it into the flesh. Pour 1/4 cup of the olive oil over the chicken, and cover with plastic wrap. Refrigerate for a few hours or overnight, or leave on the countertop for an hour or so while you prepare the rest of the dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tomato sauce. Heat broiler on high. Put the tomatoes into a food processor, and pulse a few times to break them up. Pour the chopped tomatoes into a small sheet pan with sides, then slide it directly under the broiler, and allow it to cook until much of the liquid has evaporated and the sauce has become thick, about 10 to 12 minutes. Remove from oven, allow to cool slightly, then pour into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk 2 tablespoons olive oil into the tomatoes, along with a pinch of salt, to taste. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the kale. Heat the remaining 2 tablespoons of olive oil in a large sauté pan with a lid over medium-high heat until it shimmers. Add the remaining garlic, and cook until it turns fragrant, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add kale to the pan, turn the heat to high and add a splash of water. Use a spoon to toss the greens in the oil and water, then cover and cook for approximately 5 to 7 minutes, until the kale is soft and wilted, but still quite green. Remove cover, and continue to cook, stirring occasionally until all the liquid has evaporated, 1 to 2 minutes more. Remove the kale from the pan, sprinkle with basil and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to cook the chicken, build a fire in your grill, leaving one side free of coals. When coals are covered with gray ash and the temperature is medium (you can hold your hand 5 inches above the coals for 5 to 7 seconds), you are ready to cook. (For a gas grill, turn one burner to high, leaving the others off, lower cover and heat for 15 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the thighs on the side of the grill without coals, skin-side down, cover the grill and cook until skin is crisp and the flesh has started to whiten, about 12 minutes. Turn the chicken pieces over, and top each one with a piece of mozzarella. Cover the grill again, and cook for an additional 8 minutes or so, or until the cheese has melted entirely and the chicken has cooked through. (Thighs are done when a thermometer inserted in the thickest part of the thigh reads 165 degrees.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the tomato sauce onto a large platter, and top with the cooked kale. Nestle the chicken on top of the kale and sauce. Sprinkle the Parmesan, some red-pepper flakes and a little salt over the top of the chicken, and serve."}], "link": "https://cooking.nytimes.com/recipes/1018191-grilled-chicken-parm"}