{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Bone Broth or Chicken Stock", "description": "The difference between bone broth and regular broth, or stock, comes down to the length of the cooking time and the addition of acid to the cooking liquid. They taste very similar, though the bone broth has a slightly more intense flavor and a thicker, silkier texture. They can be used interchangeably in recipes. Really, the main difference is that many people consider bone broth to be therapeutic: The longer cooking time of a bone broth allows the collagen and minerals from the bones and connective tissue to dissolve into the liquid.\n\n\n<i>This is one of <a href=\"/68861692/7716592-melissa-clark-dinner-in-an-instant\">10 recipes</a> from Melissa Clark’s “Dinner in an Instant: 75 Modern Recipes for Your Pressure Cooker, Multicooker, and Instant Pot” (Clarkson Potter, 2017).</i>\n\n<i>Melissa Clark’s <a href=\"http://www.penguinrandomhouse.com/books/562277/dinner-in-an-instant-by-melissa-clark/9781524762964/\">“Dinner in an Instant”</a> is available everywhere books are sold. <a href=\"https://www.amazon.com/Dinner-Instant-Recipes-Pressure-Multicooker-ebook/dp/B06XK41BQV/?tag=NYTBks-20&ascsubtag=dinnerinstant\">Order your copy today.</a></i>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/09/25/dining/bonebrothchickenstock/bonebrothchickenstock-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "3 quarts", "recipeCuisine": "", "recipeCategory": "cookbook exclusive, soups and stews", "keywords": "bones, garlic, parsley, thyme, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 250}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 482, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "0 grams", "proteinContent": "0 grams", "saturatedFatContent": "0 grams", "sodiumContent": "147 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["3 pounds bones, preferably a mix of meaty bones and marrow-filled bones", "3 tablespoons apple cider vinegar", "1 1/2 tablespoons coarse sea salt, or to taste", "1 to 2 celery stalks", "1 large carrot", "1 large onion, 2 leeks, or a bunch of leek greens", "1 whole clove or star anise pod", "2 to 6 garlic cloves", "5 to 7 sprigs fresh thyme or dill", "5 to 7 sprigs fresh parsley", "1 bay leaf", "1 teaspoon black peppercorns", "2 to 4 1-inch-thick coins peeled fresh ginger (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If you want to roast the bones first, heat the oven to 450ºF. Lay the bones out on a rimmed baking sheet and roast until well browned, 25 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the bones (roasted or not) in the pressure cooker pot and add all the remaining ingredients. Cover with 3 to 3 1/2 quarts of water (the water shouldn’t come more than two-thirds of the way up the side of the pot). To make regular stock, cook on high pressure for 1 hour if using all chicken or poultry bones, or 2 hours for beef or pork bones or a combination of poultry and meat. For bone broth, cook on high pressure for 3 hours for poultry bones, and 4 1/2 hours for beef, pork, or mixed bones. When making bone broth, you’ll know you’ve cooked it long enough if all the connective tissue, tendons, and cartilage have dissolved and the bones crumble a bit when you poke at them. If this hasn’t happened, cook it on high pressure for another 30 minutes and check it again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the pressure to release naturally. Use the broth or stock right away, or store it in the refrigerator or freezer. Bone broth and regular stock will keep for 5 days refrigerated or up to 6 months frozen."}], "link": "https://cooking.nytimes.com/recipes/1018861-pressure-cooker-bone-broth-or-chicken-stock"}