{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Loin With Basil Crust and Fennel", "description": "In July and August I use a lot of fresh basil. I love to use it as a coating on a roasted loin of lamb. When the meat is sliced, there is the beautiful green of the crust and the gorgeous pink of rare lamb, the colors arranged on a pale creamy bed of quickly cooked fennel. There are three steps to cooking the loin, a cut you can get by asking your butcher to debone a rack of lamb. I sauté the meat to brown and caramelize the outside, then I roast it a bit, coat it with the basil crust and roast it again.", "author": {"@type": "Person", "name": "Michel Richard"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "basil, fennel, lamb loin, pernod, main course, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 973, "unsaturatedFatContent": "71 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "90 grams", "fiberContent": "3 grams", "proteinContent": "17 grams", "saturatedFatContent": "14 grams", "sodiumContent": "695 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["20 large basil leaves, washed and completely dried", "1 cup vegetable oil", "1/2 cup fresh bread crumbs", "2 cloves garlic, peeled", "Salt and freshly ground black pepper", "1 12-ounce boneless lamb loins, silver skin and fat removed", "2 tablespoons extra virgin olive oil", "1/2 cup chicken broth", "3 tablespoons flour", "1 large egg, beaten", "4 sprigs thyme, for garnish", "8 ounces (1 small bulb) fennel, sliced into fine (1/8 inch or less) julienne", "2 tablespoons extra virgin olive oil", "2 teaspoons Pernod, pastis or other anise-flavored liqueur, or 1 teaspoon aniseed", "2 teaspoons sugar", "Juice from 1 lemon", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "To prepare lamb:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, heat oil to 300 degrees. Place half the basil leaves in oil until they turn dark green, 30 to 50 seconds. Transfer to paper towels to drain, and repeat with remaining basil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, combine basil, bread crumbs, garlic, and salt and pepper to taste. Blend thoroughly until mixture is fine in texture and bright green. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 300 degrees. Season lamb loins with salt and pepper to taste. In large sauté pan over very high heat, heat 2 tablespoons olive oil and add lamb. Sauté until well-browned on all sides, about 5 minutes. Transfer to flameproof baking pan, roast for 12 minutes, turning two or three times."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove loins and keep warm; they may be held for up to one hour. Discard fat from pan, and place pan over medium heat. Stir in broth, scraping bottom of pan well, and allow liquid to reduce by half. Season with salt and pepper, and strain into a small saucepan. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll lamb loins in flour to coat evenly, pat to remove excess flour. Spread basil-bread crumb mixture across a baking sheet. Brush loins evenly with beaten egg and roll in bread crumb mixture, pressing firmly so crumbs will adhere. Return loins to a 300-degree oven until crust is very lightly browned and loins have reheated, about 5 minutes. While loins brown, prepare fennel."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To prepare fennel:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine fennel, olive oil, Pernod, sugar and lemon juice. Place over medium heat, and sauté until fennel is slightly wilted, about 1 minute. Remove from heat, and season with salt and pepper to taste."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To serve:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place saucepan with lamb juices over low heat to warm. Cut each lamb loin into six slices. Divide fennel among four plates, and arrange slices of lamb on top. Drizzle lamb juices around plates, and garnish with thyme sprigs. Serve immediately."}]}], "link": "https://cooking.nytimes.com/recipes/1018253-lamb-loin-with-basil-crust-and-fennel"}