{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Broccoli With Apricot Puttanesca", "description": "This astoundingly good recipe came to The Times from Nick Anderer, who cooks over open fire every day at Marta in New York. A sweet and sour puttanesca is draped over charred broccoli still warm from the grill, creating a dish that goes well next to a piece of grilled fish or meat. Do cut the broccoli into large florets; it makes them easier to manage on the grill.", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2016/05/25/dining/25CHEF8/25CHEF8-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "broccoli, dried apricots, olives, pickled cherry peppers, white balsamic vinegar, dairy-free, gluten-free, vegan, vegetarian, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 172}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 315, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "8 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "799 milligrams", "sugarContent": "16 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup dried apricots (about 14)", "3/4 to 1 cup white balsamic vinegar", "2 tablespoons capers, roughly chopped", "2 tablespoons Taggiasca olives, pitted and chopped (or use Kalamata olives)", "1 tablespoon marinated Calabrian chiles in oil, minced with seeds (or use pickled hot cherry peppers)", "1 teaspoon dried Sicilian oregano (or use 1/2 teaspoon regular dried oregano)", "1/2 cup olive oil, more as needed", "Juice of 1/2 lemon", "2 large heads broccoli, cut into large florets", "Salt", "1 small white onion, very thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut dried apricots into small pieces (about 6 pieces per apricot) and place in a small saucepan; add enough vinegar to cover. Slowly bring mixture to a simmer. When liquid is simmering, remove from heat and strain the apricots, reserving the cooking liquid. In a small bowl, mix drained apricots with the capers, olives, chiles and oregano."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate small bowl, whisk 1/8 cup of the reserved apricot cooking liquid with 1/2 cup olive oil and the lemon juice to make a dressing. (Puttanesca and dressing can be made in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat grill to high. In a large bowl, toss broccoli with olive oil to coat; lightly season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place broccoli directly on the grill (or in a grill basket, if you have one) and cook, covered, until the outsides are beginning to char, about 3 minutes. Flip broccoli and cook 2 more minutes, or until it is tender and nicely charred."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove broccoli from grill and toss with onion, apricot puttanesca and dressing until evenly coated. Transfer to a serving platter and serve right away, or reserve and serve at room temperature later."}]}