{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Southern Succotash", "description": "The food historian and writer Jessica B. Harris wrote a whole cookbook paying tribute to Martha’s Vineyard, the Massachusetts resort island where lobsters, oysters and farm-fresh vegetables are abundant. This Southern-style succotash is ideal for summer, when the tomatoes are overflowing. Dr. Harris loves to use okra in the place of beans, which are often an ingredient in succotash dishes. If you can’t find a habanero chile pepper but still want to add heat, a small jalapeño will work.", "author": {"@type": "Person", "name": "Nicole Taylor"}, "image": "https://static01.nyt.com/images/2017/08/22/dining/22COOKING-SOUTHERNSUCCOTASH2/22COOKING-SOUTHERNSUCCOTASH2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, easy, lunch, vegetables", "keywords": "corn, habanero chile, okra, tomato, gluten-free, vegan, vegetarian, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 85}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 80, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "542 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 pound okra, tops and tails trimmed, cut into 1/2-inch-thick rounds", "6 large, ripe tomatoes, peeled, seeded and coarsely chopped (about 3 1/2 pounds)", "2 cups freshly cut corn kernels (from about 2 medium ears)", "1 habanero chile, pricked with a fork (optional)", "Salt and ground black pepper, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine okra and 1 cup water in a medium saucepan. Add tomatoes, corn and habanero, if using, and place over medium heat. Do not stir. Bring to a boil, then lower the heat to simmer. Cover and cook for 15 minutes, or until the vegetables are tender and the flavors are well blended. Stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you used the chile, remove it from the pan when the dish has reached the desired spiciness. Season with salt and pepper, and serve hot."}]}