{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Mushrooms With Braised Black Lentils and Parsley Croutons", "description": "The lentils and mushrooms could hold their own, independently, as dependable side dishes, able to play to any menu lead from whole roasted sea bass to suckling pig. The bright, lemony, parsleyed brown-butter croutons, though, are what transforms an otherwise pleasant member of the cast to serious scene stealer. ", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2017/10/26/dining/26cooking-mushrooms/26cooking-mushrooms-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, vegetables", "keywords": "black lentils, country bread, fennel, mushroom, onion, parsley", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 165}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 384, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "8 grams", "proteinContent": "17 grams", "saturatedFatContent": "8 grams", "sodiumContent": "607 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds mixed mushrooms, such as cremini, shiitake or hen-of-the-woods.", "Kosher salt", "Black pepper", "Extra-virgin olive oil", "1 medium white onion, minced", "1 large bulb fennel, diced, stalk and fronds reserved", "1/4 cup slivered garlic", "2 cups black lentils, rinsed", "2 bay leaves", "1/2 cup (1 stick) unsalted butter", "2 cups diced dense country bread (remove crusts before cutting)", "1/4 cup finely chopped parsley", "Zest of 2 lemons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For mushrooms, trim any woody stems, and clean with a damp kitchen towel as needed. Place face down on a sheet tray lined with parchment. Season assertively with salt and pepper. Generously drizzle with olive oil, and roast until tender, about 20 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a heavy-bottomed wide sauté pan, heat 1/4 cup olive oil over gentle heat. Add in the onion, fennel and garlic. Season with salt and black pepper and cook until tender, stirring often, about 10 minutes, taking care not to brown the vegetables. Add the lentils, stirring to coat them with the olive oil and vegetable mix. (Add more olive oil if needed to get a glossy coating on the lentils.) Cover just barely with cold water, add the bay leaves and fennel stalk and reseason with salt and pepper. Simmer, partly covered, until the lentils are tender but not mushy, stirring occasionally and adding more water as needed, as you might for a risotto. (You want to end up with wet-juicy cooked seasoned lentils but not lentil soup.) Turn off heat, remove bay leaves and cooked-out fennel stems or fronds, and finish with a healthy drizzle of olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For croutons, over medium heat, melt the butter in a skillet large enough to hold the diced bread in a single layer. Add in the bread, stir to coat evenly with the butter and season with salt. Toast the croutons in the butter on the stovetop, stirring frequently, until golden brown and crispy. The butter will smell browned and toasted. Remove from the heat, season with salt and black pepper and allow to cool briefly before tossing with chopped parsley and lemon zest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine lentils with the roasted mushrooms and any accrued roasted mushroom juices, scatter croutons over top and serve."}], "link": "https://cooking.nytimes.com/recipes/1018999-roasted-mushrooms-with-braised-black-lentils-and-parsley-croutons"}