{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken-Fried Steak With Queso Gravy", "description": "Here’s an Americanized taste of the schnitzel brought to Texas by German immigrants in the 19th century, with a Tex-Mexified twist. Instead of serving the fried steaks with a peppery cream gravy, I’ve followed the teachings of Lisa Fain, who writes the \"Homesick Texan\" blog and is the author of \"Queso! Regional Recipes for the World's Favorite Chile-Cheese Dip,\" and applied a <a href=\"https://cooking.nytimes.com/recipes/1018916-queso-gravy\">queso gravy</a> instead – the cheese cut with milk, infused with onion, jalapeño and cumin, and stabilized with a little cornstarch. It’s rich eating, to be sure, but as a result I’ve cut the portion size of the meat down to a mere quarter-pound per person. I like some pico de gallo on top, so there are some raw vegetables above the cheese, and mashed potatoes on the side because that’s how chicken-fried steak is served in Texas, whatever’s on top of the meat. ", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/09/03/magazine/03eat1/03eat1-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "Serves 8", "recipeCuisine": "southwestern", "recipeCategory": "", "keywords": "egg, milk, top round beef", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 155}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 665, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "2 grams", "proteinContent": "33 grams", "saturatedFatContent": "7 grams", "sodiumContent": "524 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds beef top round, cut into 8 equal-size pieces", "Neutral oil, like canola or grapeseed, for frying.", "1 tablespoon plus 2 teaspoons kosher salt", "2 teaspoons freshly ground black pepper", "1 tablespoon ground cumin", "1/2 teaspoon cayenne pepper, or to taste", "3 cups all-purpose flour", "3 large eggs", "1/2 cup whole milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pieces of steak under plastic wrap or parchment paper, and use a meat hammer or the back of a small pan to pound each to a uniform 1/4-inch thickness, roughly doubling its surface size. Heat oven to 200. Pour 1/2 inch to 3/4 inch of oil into a cast-iron or other large, heavy skillet, and place over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine salt, pepper, cumin and cayenne pepper in a small bowl, then use the mixture to season the meat aggressively, massaging the spices into the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the flour into a large zip-top bag or baking dish. Beat eggs and milk together in a bowl. Shake each piece of steak in the bag of flour or press into the dish of flour, making sure both sides are well coated. Shake off excess flour, dip steak into milk mixture, and then again into the flour. Shake off excess, and place steak on a large plate or sheet pan. Repeat with remaining steaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oil has reached 300 degrees, or a flick of flour sizzles in it furiously, work in batches to cook the steaks in the pan, so that they have room around them, probably just two steaks per batch. They will pop and hiss. Cook for 2 to 3 minutes, or until juices start to bubble out of the top of the coating, then use tongs to turn the pieces over gently, and cook the other side 3 to 4 minutes longer, until they are crisp and golden brown. Transfer cooked steaks to a sheet pan, and keep warm in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove steaks from oven and serve, topping each steak with <a href=\"https://cooking.nytimes.com/recipes/1018916-queso-gravy\">queso gravy</a> and, if you like, some pico de gallo or favorite salsa."}], "link": "https://cooking.nytimes.com/recipes/1018915-chicken-fried-steak-with-queso-gravy"}