{"@context": "http://schema.org", "@type": "Recipe", "name": "Outdoor Porchetta", "description": "Porchetta is a popular Italian street food: juicy, aromatic slices of roast pork and pork cracklings stuffed into bread to make a sandwich. It's often done with a whole pig, but you can make your own porchetta for a crowd with a whole boneless pork shoulder. Here is a great way to do that in summer, or when the cut is too large for your roasting pan. You can order a shoulder from any butcher with a day or two of advance notice, or adapt the recipe for smaller pieces; any meaty roast with skin or a good layer of fat on the outside will work. The meat goes well with the unsalted bread that is typical in Umbria, where porchetta is a specialty. But you can use any bread you like, or serve with <a href=\"http://cooking.nytimes.com/recipes/298-roasted-potatoes-with-sage-and-garlic\">potatoes roasted in olive oil and scented with sage</a>.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/06/22/dining/22PORCHETTAREX/22PORCHETTAREX-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "15 to 20 servings", "recipeCuisine": "italian", "recipeCategory": "roasts, sandwiches", "keywords": "crusty rolls, fennel pollen, pork shoulder, rosemary, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 95}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 400, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "1 gram", "proteinContent": "29 grams", "saturatedFatContent": "10 grams", "sodiumContent": "394 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 whole boneless skin-on pork shoulder", "Salt and ground black pepper", "8 to 10 garlic cloves, chopped", "3 tablespoons fennel pollen or minced fresh rosemary", "Crusty rolls (such as kaiser) or fresh focaccia, cut in half horizontally, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the tip of a sharp, strong knife to roughly score the skin into diamonds, about 3/4 inch on each side. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Liberally season the inside of the roast with salt and pepper. Rub in garlic and fennel pollen or rosemary. With the skin on the outside, roll into a cylinder and tie tightly at 1- to 2-inch intervals."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On one side of a grill large enough for indirect cooking, rest a drip pan under the grate to catch the drippings. Pour in an inch or two of hot water to prevent flare-ups. You may need to top up or empty and refill the pan once during the cooking, depending on how fatty the roast is."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the other side of the grill to high. Place the tied roast on the other side, away from the direct heat, and close the grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast at 350 to 375 degrees (the temperature can hover between the two), turning occasionally, until a meat thermometer inserted into the thickest part of the roast registers 140 degrees, about 3 to 4 hours. (The temperature will continue to rise as the meat rests.) If the meat is cooked through but the skin is not crisp, move the roast to the part of the grill that sits over direct, high heat. Cook with the grill open, turning often, just until sizzling and crisp (not more than 10 minutes, to prevent overcooking).  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let rest, tented loosely with foil, at least 20 minutes before slicing. (A bread knife is useful to cut through the skin.) The meat can be served hot or at room temperature. Serve in sandwiches on crusty rolls, or inside split pieces of focaccia."}], "link": "https://cooking.nytimes.com/recipes/1018188-outdoor-porchetta"}