{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Roasted Rabbit With Guanciale, Wilted Greens and Pan Drippings", "description": "Rabbits are so lean on their own that they benefit from some added fat — in this case, a few strips of guanciale, the compellingly flavorful cured pork jowl from Italy. Once the pan juices from the roasted rabbit have commingled with the fat from the guanciale and the bitter water released from the Treviso, you have a perfect, craveable balance on the plate, in every forkful.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2017/10/26/dining/26cooking-rabbit/26cooking-rabbit-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "guanciale, rabbit, treviso, watercress, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 17}, "recipeIngredient": ["2 whole rabbits", "Kosher salt", "Freshly ground black pepper", "2 bunches watercress", "1 bunch dandelion greens", "2 heads Treviso", "1/2 pound guanciale, sliced thin", "1/2 cup dry white wine", "Extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season rabbits on all sides and inside the cavity with salt and freshly ground black pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the watercress and dandelion greens, removing the woodiest stems. Cut the Treviso into halves the long way, then cut each half into thirds, and trim away any especially tough white stalky interior core."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay sliced guanciale on a sheet pan large enough to hold the rabbits. (You can use 2 separate pans if necessary.) Scatter the dandelion greens, watercress and Treviso on top of the guanciale, and then place the rabbit on top, back side facing up. Drizzle the rabbit and greens with the wine and extra-virgin olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast rabbits for 20 minutes. After 20 minutes, check rabbits, and rotate the pans to ensure that they are cooking and browning evenly. Return to the oven to continue roasting until rabbit legs are just cooked through, about 15 more minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let rabbit rest for 10 minutes, then cut into 8 pieces each; two hindquarters, two forequarters and four loin pieces. Transfer the guanciale and greens to a serving platter. Place the rabbit pieces on top and drizzle with the pan-drippings left on the sheet tray and a healthy drizzle of olive oil."}]}