{"@context": "http://schema.org", "@type": "Recipe", "name": "Short Rib Meatballs With Farro and Carrot Salad", "description": "", "author": {"@type": "Person", "name": "Steven Stern"}, "image": null, "totalTime": "PT1H5M", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "meatballs", "keywords": "carrot, celery root, farro, ground short ribs, main course", "aggregateRating": null, "recipeIngredient": ["2 cups crustless day-old bread, torn into chunks", "1 cup milk", "Olive oil", "1 small onion, very thinly sliced", "3 cloves garlic, very thinly sliced", "2 pounds ground short ribs or other ground beef", "1/2 cup golden raisins", "1/4 teaspoon minced fresh hot red chile pepper", "2 tablespoons chopped fresh herbs, such as thyme, mint or summer savory", "Salt and ground black pepper", "Salt", "2 cups farro", "4 tablespoons extra virgin olive oil", "2 medium onions, thinly sliced", "Juice of 1 lemon", "2 tablespoons sherry vinegar, or to taste", "Juice of 1 lime", "2 tablespoons Greek yogurt", "Salt and freshly ground black pepper", "2 scallions, thinly sliced diagonally", "2 tablespoons finely julienned fresh mint leaves", "2 medium carrots, thinly shaved on a mandoline", "1 medium celery root, peeled, quartered and thinly shaved on a mandoline"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the meatballs: Heat oven to 375 degrees. Place bread in a medium bowl and add milk. Soak for 10 minutes, then drain and break up bread with a fork. Place a small sauté pan over low heat and film bottom with olive oil. Add onions and garlic and sauté until soft but not colored, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer bread and onion mixture to a large bowl and add beef, raisins, minced hot pepper and chopped herbs. Season with salt and pepper. Shape a teaspoon of mixture into a small hamburger and sauté over medium-high heat; taste and adjust seasoning if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form meatballs about 1 1/2 inches in diameter (2 ounces each). Place on a baking sheet and roast until browned and nearly cooked through, 10 to 12 minutes. Cover and keep warm; meatballs will continue to cook a bit more as they are resting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the farro: Fill a saucepan with water and salt as if making pasta. Bring to a boil, and add farro. Simmer until grains are tender but not mushy, about 20 minutes. Drain and rinse with cool water. Place a sauté pan over high heat and add 1 tablespoon olive oil. When oil is shimmering, add onions. Sauté until browned, about 5 minutes, then add to cooked farro. Add lemon juice, remaining 3 tablespoons olive oil, and sherry vinegar to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the carrot salad: In a medium bowl, combine lime juice, yogurt and salt and pepper to taste; mix well. Add scallions, mint, carrots and celery root. Toss gently to mix."}], "link": "https://cooking.nytimes.com/recipes/1018632-short-rib-meatballs-with-farro-and-carrot-salad"}