{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Chocolate Pudding", "description": "Dense, creamy and fudgy, this pudding is meant to be made in a 6- to 8-quart electric pressure cooker like an Instant Pot. You can bake this recipe as one larger pudding or as individual servings. \n\nIt can be made in a stovetop pressure cooker, by trimming a few minutes off the cooking time, or you can also bake the individual servings in a water bath in the oven. To do so, heat the oven to 300 degrees. Set the filled, uncovered custard cups in a large roasting pan positioned on the oven's center rack. Add hot tap water to the pan, halfway up the sides of cups. Cover the entire pan with foil, and use a fork to prick holes in foil. Bake until edges are lightly set (lifting the foil to check) but the centers are still jiggly – they will set as they cool – 30 to 35 minutes.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/02/01/dining/01APPE2-1485571646973/01APPE2-1485571646973-articleLarge.jpg", "totalTime": "PT3H40M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "snack, weekday, custards and puddings", "keywords": "bittersweet chocolate, crème fraîche, heavy cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 197}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 434, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "20 grams", "sodiumContent": "83 milligrams", "sugarContent": "26 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 cups heavy cream", "1/2 cup whole milk", "6 ounces bittersweet chocolate (preferably 60 percent to 65 percent), chopped", "5 large egg yolks", "1/3 cup light brown sugar", "2 teaspoons vanilla extract, or 1 tablespoon dark rum or bourbon", "1/4 teaspoon ground cardamom or cinnamon (optional)", "1/8 teaspoon kosher salt", "Crème fraîche, or whipped cream, for serving", "Chocolate shavings, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy saucepan, bring cream and milk to a simmer. Remove from heat; whisk in chocolate until melted and smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together yolks, sugar, vanilla (or rum or bourbon), cardamom or cinnamon (if using) and salt. Whisking constantly, pour hot chocolate into yolk mixture. Strain through a very fine mesh sieve into a large measuring cup or bowl. This can be made up to 2 days ahead and stored in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour into a 1-quart, 7-inch soufflé dish, or divide chocolate mixture among six (4- to 6-ounce) custard cups, espresso cups or small ramekins. Cover with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place steamer rack in pressure cooker, and fill cooker with 1 1/2 cups water. If baking the larger pudding, place dish on top of rack. Cook on low pressure for 18 minutes. Wait 5 minutes, then manually release pressure. If making the individual servings, place 3 custard cups on top of rack. Cook for 5 minutes on low pressure, then manually release pressure. Repeat with remaining three cups. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After cooking puddings, remove foil covers to allow the steam to evaporate, and cool to room temperature. Cover puddings with plastic wrap, and chill at least 3 hours and up to 3 days before serving with crème fraîche and chocolate shavings, if you like."}], "link": "https://cooking.nytimes.com/recipes/1018550-pressure-cooker-chocolate-pudding"}