{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkish-Style Lamb Boreks", "description": "These irresistible savory pastries go by many names throughout the Middle East. In Turkey, they are called boreks and the best ones have a beguiling, complex filling that features salty, sweet and sour elements. If you can’t find pomegranate molasses, substitute lemon juice and honey, and maybe a splash of sweet vinegar. It’s easy to cut these large boreks into two, three or four pieces, for feeding a crowd.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/02/15/dining/15KITCH1/15KITCH1-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "8 large servings, or up to 32 small bites", "recipeCuisine": "turkish", "recipeCategory": "finger foods, pastries", "keywords": "appetizer, main course, feta, lamb, phyllo, pomegranate molasses, sumac, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 84}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 506, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "3 grams", "proteinContent": "20 grams", "saturatedFatContent": "12 grams", "sodiumContent": "544 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil, more for brushing phyllo dough", "1 tablespoon unsalted butter", "1 large onion, diced (about 2 cups)", "1 pound ground lamb", "Salt and pepper", "1/2 teaspoon cinnamon", "1/2 teaspoon toasted ground cumin", "1/8 teaspoon cayenne, or 1/2 teaspoon crushed red pepper", "1 tablespoon sumac powder", "1 tablespoon pomegranate molasses", "1/2 cup golden raisins", "1/4 cup pine nuts, lightly toasted", "4 ounces feta cheese, crumbled or mashed with a fork", "1 cup thick plain Greek-style yogurt or drained whole milk yogurt, preferably quite tangy", "Salt and pepper", "1 egg, lightly beaten", "2 tablespoons roughly chopped fresh parsley", "1 tablespoon roughly chopped fresh mint", "1 teaspoon crumbled dried mint", "16 phyllo dough sheets, 18 by 14 inches", "1 egg, well beaten", "3 tablespoons sesame, nigella or poppy seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the meat filling: Place a wide skillet over medium-high heat. Add 2 tablespoons olive oil and the butter. When oil and butter are hot, add onions and cook briskly, stirring, until onions are lightly browned, about 5 minutes. Add lamb to onions and break into rough pieces with a wooden spoon, mashing occasionally, until lamb is crumbly and cooked through, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season mixture generously with salt and pepper, then add cinnamon, cumin, cayenne and sumac. Cook for 2 or 3 minutes more, stirring. Raise heat as necessary to let mixture brown well. Stir in pomegranate molasses, raisins and pine nuts. Taste and adjust seasoning, then set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cheese filling: Put feta and yogurt in a bowl and whisk together. Season with salt and pepper, whisk in beaten egg, then stir in parsley, fresh mint and dried mint."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Assemble boreks one at a time: Lay one sheet of phyllo on a clean work surface. Brush very lightly with olive oil. Carefully place another phyllo sheet directly on top and brush with oil. Fold this doubled sheet in half, to form a rectangle 9 by 14 inches. Position it so the 9-inch end is facing you."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon 3 tablespoons cheese filling over surface of rectangle, smearing with the back of a spoon to cover, leaving a 1/2-inch border. Sprinkle 1/4 cup lamb mixture in a 2-inch ribbon along the edge closest to you."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold over long sides of pastry an inch or so to help contain filling. Lift edge and loosely roll up pastry away from you, as if rolling up a carpet. Brush pastry lightly with oil as you proceed. The result should look like a flat cigar, about 3 inches wide and about 8 inches long. Continue to assemble  remaining boreks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pastries to a parchment-lined baking sheet, placing them 1 inch apart. Brush tops with egg wash and sprinkle with sesame, nigella or poppy seeds. Bake for 25 to 30 minutes, until nicely browned. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1018576-turkish-style-lamb-boreks"}