{"@context": "http://schema.org", "@type": "Recipe", "name": "Berry Jam", "description": "Jam made from peak-season berries is a far cry from anything you can buy at the grocery store. As the berries cook, the water in them evaporates, their sugars thicken and their flavors concentrate. What's left is the fruit's essence, which is why it's worth seeking out the best berries you can. This recipe works for several berry varieties, but note that some types are naturally more acidic than others, so adjust the fresh lemon or lime juice accordingly.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2017/08/07/dining/07JAMGUIDE5/07JAMGUIDE5-mediumThreeByTwo440.jpg", "totalTime": "PT1H15M", "recipeYield": "4 to 6 cups (4 to 6 8-ounce jars)", "recipeCuisine": "", "recipeCategory": "jams, jellies and preserves", "keywords": "blackberries, blueberries, raspberries, strawberries, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 47}, "recipeIngredient": ["4 pounds/1.8 kilograms whole blueberries or raspberries; blackberries, halved lengthwise; or 4 1/2 pounds/2 kilograms strawberries, hulled and quartered (see note)", "3 cups/600 grams granulated sugar", "3 to 4 tablespoons fresh lemon or lime juice (from about 2 lemons or limes)", "Add-ins (optional, see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss berries and sugar together in a large, heavy-bottomed pot. Let sit for at least 15 minutes and up to overnight, periodically tossing to coat and to dissolve the sugar. (This will help coax the juices out of the fruit.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a small plate in the refrigerator to chill. (You’ll use this later.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the fruit to a strong simmer over medium heat until the berries burst and the juices start to boil, about 15 minutes. If using a vanilla bean as an add-in, put it in the pot at this point."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat to medium–high. Cook the jam, at first stirring occasionally with a wooden spoon or spatula, then more frequently as the juices thicken. Cook until most of the liquid has evaporated and the fruit has begun to break down, 40 to 50 minutes. How much it breaks down will depend on its type and ripeness: For example, strawberries are likely to retain more of their shape, while raspberries will break down almost entirely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the jam cooks, the liquid will reduce, the sugars thicken and the natural pectins activate. You’ll notice the liquid go from a rapid, rolling boil with smaller bubbles to a slow, thick, tarlike boil with larger bubbles: This is the stage at which it’s most important to stir constantly along the bottom of the pot to prevent scorching and sticking. (Sugar is heavier than water and will concentrate there, increasing the chance that the fruit will burn.) It’s also the stage at which splattering may occur, so take care in stirring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the jam reaches a slow, thick boil, add lemon juice and continue to cook, stirring constantly until the jam returns to its earlier consistency, about another 5 minutes. To test the consistency, spoon a bit of jam onto the chilled plate, return it to the refrigerator and chill for 2 minutes. Drag your finger through it: It should hold its shape on either side without appearing watery or runny. If it’s not there yet, cook a few minutes more. (Note: Some fruit, like strawberries, contain more water and less natural pectin than say, a raspberry. This means the jam will never be quite as thick or gelled, but it will still be delicious)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat, and incorporate any of the add-ins listed (see notes). Pick out vanilla bean if you added it earlier. Divide jam between several 8-ounce canning jars, leaving 1/4-inch head space, and seal immediately. Can the jams (see our <a href=\"https://cooking.nytimes.com/guides/45-how-to-make-jam\">How to Make Jam</a> guide for more instruction), or store in the refrigerator, using them within a couple of weeks."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Berry Jam", "description": "guides-jam-blueberry", "thumbnailUrl": "https://static01.nyt.com/images/2017/08/07/dining/07JAMGUIDE5/07JAMGUIDE5-mediumThreeByTwo440.jpg", "uploadDate": "2017-08-03T21:50:32.000Z", "duration": "PT1M15S"}, "link": "https://cooking.nytimes.com/recipes/1018845-berry-jam"}