{"@context": "http://schema.org", "@type": "Recipe", "name": "Mr. Micawber’s Favorite Gin Punch", "description": "According to his great-grandson, Cedric, Charles Dickens ‘‘loved the ritual of mixing the evening glass of Gin Punch, which he performed with all the energy and discrimination of Mr. Micawber.’’ You may recall that, in ‘‘David Copperfield,’’ Wilkins Micawber is uplifted by a humble gin punch: ‘‘I never saw a man so thoroughly enjoy himself amid the fragrance of lemon-peel and sugar, the odour of burning spirit, and the steam of boiling water, as Mr. Micawber did that afternoon.” Although this is called a punch, note that it’s a serving for one — but don't let that stop you from making it for company. Its combination of spirit, warmth and spice will bring to mind a hot toddy, and it's fragrant and flavorful enough to supplant the more familiar whiskey-based version — at least for a season.", "author": {"@type": "Person", "name": "Rosie Schaap"}, "image": "https://static01.nyt.com/images/2016/12/11/magazine/11drink3/11drink3-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "cocktails", "keywords": "gin, madeira, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 12}, "recipeIngredient": ["1/2 lemon", "1 teaspoon dark brown sugar", "1 teaspoon honey", "Pinch ground cinnamon", "1 clove", "Water just off the boil", "1 1/2 oz. Madeira", "1 1/2 oz. London dry gin", "1 stick cinnamon (optional)", "Grated nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Juice 1/2 lemon through a strainer directly into a warmed, heatproof glass (like those used for Irish coffee). Add the sugar and honey, and stir. Add the cinnamon and clove. Fill the glass three-quarters full with water just off the boil. Stir. Add the Madeira and gin and stir gently with a spoon or with a cinnamon stick, if you prefer. Grate a little nutmeg on top."}], "link": "https://cooking.nytimes.com/recipes/1018474-mr-micawbers-favorite-gin-punch"}