{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Eggplant With Ricotta, Mozzarella and Anchovy", "description": "I learned this dish from a Sicilian cook in a small town outside Palermo. She makes it by layering thinly sliced eggplant with fresh curd cheese and caciocavallo (I use fresh ricotta and provolone instead), as well as pecorino and Parmesan cheese — a bit like a lasagna without pasta. It is quite delicious and unusual in that there is no tomato sauce, as there often is in so many Sicilian baked eggplant dishes. The anchovies, melted into the crisp bread-crumb-and-cheese topping, provide a sharp contrast to the sweetness of the eggplant. I like to serve a tomato salad alongside.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/07/05/dining/05KITCHEN4/05KITCHEN4-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "casseroles", "keywords": "anchovy, eggplant, Parmesan, pecorino, provolone, smoked mozzarella, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 500}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 398, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "3 grams", "proteinContent": "26 grams", "saturatedFatContent": "15 grams", "sodiumContent": "908 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["Extra-virgin olive oil", "3 or 4 small eggplants (about 2 pounds), peeled and cut into 1/2-inch slices", "Salt and pepper", "Pinch of crushed red pepper", "1 small red onion, thinly sliced", "12 ounces fresh ricotta", "1/2 pound smoked mozzarella, thinly sliced (or use fresh mozzarella)", "2 cups provolone cheese, coarsely grated (about 1/2 pound)", "1/2 cup finely grated Parmesan or Grana Padano cheese (about 2 ounces)", "1/2 cup finely grated pecorino cheese (about 2 ounces)", "12 anchovy fillets", "1/4 cup toasted bread crumbs, preferably homemade", "1 teaspoon dried oregano, preferably Sicilian"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Generously oil a 9- by 13-inch baking dish. Season eggplant slices on both sides with salt and pepper. Arrange half the eggplant slices in one layer on bottom of dish, overlapping slices slightly. Drizzle or paint eggplant generously with olive oil. Sprinkle with crushed red pepper to taste and scatter onion slices evenly over surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a small spoon, distribute the ricotta in little blobs evenly over surface, then arrange half the smoked mozzarella over the ricotta. Sprinkle with 1 cup grated provolone."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make another layer of overlapping slices with remaining seasoned eggplant. Drizzle or paint eggplant generously with olive oil. Top surface evenly with remaining smoked mozzarella and provolone, then sprinkle with Parmesan and pecorino. Arrange anchovy fillets over top and sprinkle with bread crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake uncovered for 45 minutes to 1 hour, until eggplant is quite tender when pierced with a fork and top is crisp and golden. (If top seems to be browning too quickly, tent with foil and reduce heat to 350 degrees.) Remove from oven, dust with oregano and let rest at least 20 minutes before cutting into squares. The dish is best served at room temperature, not piping hot."}]}