{"@context": "http://schema.org", "@type": "Recipe", "name": "Avgolemono Rice", "description": "This avgolemono rice uses lamb stock because we love its connection to the roast leg of lamb at Easter, but you can happily use chicken stock at any time of year. The rice is cooked “pasta style,” in plenty of boiling salted water and drained when done, which is how we cook rice pretty much all the time now, dodging the sometimes mushy, sometimes waterlogged, sometimes al dente results of the usual cooking method. The egg-lemon sauce is tart and creamy at the same time, a unique richness without any cream or butter, that is killer almost anywhere it lands, from warm asparagus, to gently roasted salmon, to cold poached chicken, to steamed artichokes, even to orzo pasta.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2017/04/16/magazine/16eat2/16eat2-articleLarge-v4.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "greek", "recipeCategory": "grains and rice", "keywords": "lamb stock, peas, rice, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 192}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 322, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "2 grams", "proteinContent": "11 grams", "saturatedFatContent": "2 grams", "sodiumContent": "582 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["Coarse kosher salt, for cooking rice and for seasoning the sauce", "1 1/4 cups jasmine rice", "3/4 cup frozen small peas", "2 cups excellent homemade brown lamb stock (using well-roasted bones; even better if bits of meat remain)", "5 large egg yolks", "1/4 cup freshly squeezed lemon juice", "4 scallions, sliced in 1/3-inch rings, on a slight bias", "Freshly and finely ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 8 cups of water to a rolling boil. Season lightly with salt. Rinse the rice, and pour into boiling water, stirring well to keep grains from clumping. When the water returns to a boil, lower heat a little to a gentle boil, and cook the rice “pasta-style” until just done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the rice through a fine-mesh colander, giving it a couple of hearty shakes to remove the last of the water. Immediately spread cooked rice out on a sheet pan lined with parchment to cool quickly. Do not pat down or pack the rice — you want it fluffy and to be able to cool and dry quickly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the peas under cool water briefly to remove any frosty crystals."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the lamb stock to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a stainless bowl, whisk egg yolks and lemon juice together until fully incorporated.In a slow steady stream, while constantly whisking, add half the hot lamb stock into the yolks. Then whisk the egg-lemon mixture back into the remaining stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pot to the stove, and simmer (still whisking constantly so as not to cook the egg too fast and too hard), until the avgolemono sauce is full-bodied, approximately the consistency of buttermilk — a minute or 90 seconds more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the scallions, then the peas, and when they both turn bright green, turn off the heat, and stir in the rice. Season to taste with salt and pepper. The rice should be as soupy as risi e bisi and as creamy as risotto."}]}