{"@context": "http://schema.org", "@type": "Recipe", "name": "Meringue Mess With Rhubarb and Strawberries", "description": "There is a traditional English dessert called Eton Mess, attributed to Eton College, in which broken meringues, strawberries and softly whipped cream are folded together. “Mess” in this context doesn’t mean “messy,” but rather “mixture.” This recipe is a springtime mess of rhubarb and strawberries. Feel free to substitute other berries or stone fruit as they come into season. It’s an easy dish to put together, especially if you use store-bought meringues. Instructions are given here for making meringues, but it is a bit of a project and one that should not be attempted in humid weather because the meringues will not set properly. If you prefer a more refined version, spread meringues with whipped cream, spoon the fruit on top, and call it Pavlova.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/06/07/dining/07KITCHEN2/07KITCHEN2-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 to 8 servings", "recipeCuisine": "british", "recipeCategory": "", "keywords": "dessert, pistachio, rhubarb, strawberry", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 94}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 399, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "7 grams", "sodiumContent": "42 milligrams", "sugarContent": "63 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 egg whites", "1 cup/200 grams sugar", "Or use 6 to 8 store-bought meringue shells", "3/4 pound/340 grams rhubarb, chopped (about 3 cups)", "1 cup/200 grams sugar, plus 2 tablespoons for cream", "1 1-inch-piece cinnamon stick", "6 cloves", "1 cup/240 milliliters heavy cream", "1 teaspoon rose water, optional", "2 pints/1 pound/450 grams strawberries, hulled and halved or quartered", "3 tablespoons chopped pistachios", "Mint leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meringues: Heat oven to 200 degrees. Put egg whites in a mixing bowl. Beat at high speed until thickened and foamy, then gradually add sugar and continue beating until whites are glossy and hold stiff peaks, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with parchment paper and place 6 to 8 large spoonfuls of whites on it, 2 to 3 inches apart. Flatten meringue blobs slightly with a knife and bake for 1 hour. Reduce temperature to 150 degrees and bake for 1 1/2 hours, until dry and crisp. If time permits, leave meringues in turned-off oven overnight to dry thoroughly. Cool and store in an airtight container."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the rhubarb: Put rhubarb in a nonreactive saucepan, add sugar, cinnamon and cloves, and stir to combine. Cook over medium-high heat, stirring frequently; it should become juicy and syrupy in a few minutes. Lower heat and continue cooking until rhubarb is tender but not mushy, about 10 minutes. Cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the cream in a large bowl with 2 tablespoons sugar, leaving it quite soft, almost pourable. Add rose water if using. Break or cut meringues into 1-inch pieces and add to bowl. In a separate bowl, combine strawberries, rhubarb and all juices and toss to coat. Add strawberry mixture to meringues and cream. Using a rubber spatula, fold everything together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a serving bowl or individual dishes, sprinkle with pistachios and garnish with mint leaves."}], "link": "https://cooking.nytimes.com/recipes/1018779-meringue-mess-with-rhubarb-and-strawberries"}