{"@context": "http://schema.org", "@type": "Recipe", "name": "Modern Chicken Potpie", "description": "Here's a radical notion: chicken potpie does not have to be filled with goopy white sauce, carrots and peas. Traditional recipes are long on starch and richness, short on flavor. This updated version is savory with chicken stock, herbs, and wine (no white sauce needed), easier to make, and still familiar. Use thigh meat, for more taste and better texture than breast. And vegetables should be served separately, not forcemarched into the filling. Roasted carrots, peas with mint and buttered steamed asparagus are all nice to serve alongside chicken potpie.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/11/20/dining/20COOKING-CHICKPOTPIE1/20COOKING-CHICKPOTPIE1-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, pies and tarts", "keywords": "bacon, chicken stock, chicken thighs, marsala, mushroom, pancetta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1036}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 465, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "1 gram", "proteinContent": "21 grams", "saturatedFatContent": "11 grams", "sodiumContent": "677 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon vegetable oil", "1 garlic clove, peeled and smashed", "6 ounces bacon or pancetta, preferably thick-cut, sliced into strips", "1 medium onion, chopped", "8 ounces mushrooms, such as button or cremini, thickly sliced", "1/4 cup all-purpose flour", "1 teaspoon dried thyme", "1/2 teaspoon paprika", "Salt and ground black pepper", "1 pound boneless chicken thighs, cut into bite-size pieces", "2 tablespoons butter", "2 1/2 cups rich chicken stock", "1/4 cup Marsala, Madeira or sherry", "1 tablespoon sherry vinegar", "2 tablespoons finely chopped parsley, more for garnish", "1 9-inch <a href=\"http://cooking.nytimes.com/recipes/448-all-butter-pie-crust\">pie crust</a>, chilled, or 1 sheet puff pastry", "1 egg, beaten with 1 tablespoon water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil and garlic together over low heat. When it sizzles, add bacon and onions and cook, stirring often, until fat is rendered and bacon is golden brown. Adjust the heat so the bacon slowly gives up its fat. Remove garlic clove and add mushrooms. Cook, stirring, until mushrooms are browned and slightly softened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a sealable plastic bag, combine flour, thyme, paprika, 2 large pinches salt and 1 large pinch pepper. Add chicken and shake well to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the skillet with the bacon and mushrooms, add butter and melt over medium heat. Add chicken pieces and any flour that remains in the bag. Cook, stirring, until chicken pieces are golden and the flour on the bottom of the pan is browned. Pour in stock, Marsala and vinegar. Scrape bottom of pan, and let simmer about 5 minutes, until thickened. Taste for salt, pepper and vinegar and adjust the seasonings. Turn off heat and stir in parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer chicken and sauce to 9-inch round pie dish or 8-inch square baking dish. Roll out pie crust to desired shape and size. Drape crust over filling, making a few slits or decorative holes on top. Tuck edges down around filling and brush crust with egg wash. If the dish is piled high with filling, place on a baking sheet to catch any overflow before transferring to oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until crust is browned and filling is bubbling, 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool slightly, at least 10 minutes, before serving with a big spoon. If desired, garnish each serving with parsley."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Chicken Potpie", "description": "Chicken potpie gets a much-needed makeover, and the results are astounding.", "thumbnailUrl": "https://static01.nyt.com/images/2017/11/20/dining/20COOKING-CHICKPOTPIE1/20COOKING-CHICKPOTPIE1-mediumThreeByTwo440.jpg", "uploadDate": "2016-10-03T19:06:34.000Z", "duration": "PT1M22S"}}