{"@context": "http://schema.org", "@type": "Recipe", "name": "Double Chocolate Cookies", "description": "With plenty of cocoa powder and big wells of dark chocolate, these double chocolate cookies are so fudgy that a tall glass of cold milk is not only delicious, but essential — especially when they are served hot from the oven. Just like David Leite’s impeccable chocolate chip cookies, they bake up even better after the dough has had time to rest in the fridge. The extralong chill gives the dough a chance to hydrate fully and firm up, which yields more uniformly baked cookies, with the perfect amount of crunch around the edges and chew in the center. Thin chocolate discs or wafers, which are widely available, are used here. They melt into lovely chocolate layers as the cookies bake. But if you can’t find them, chocolate chips make a fine substitute; there's no need to adjust the baking time.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2016/12/05/dining/05COOKING-CHOCOLATECHIPCOOKIES1/05COOKING-CHOCOLATECHIPCOOKIES1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "9 to 10 big cookies", "recipeCuisine": "american", "recipeCategory": "cookies and bars", "keywords": "cocoa powder, semisweet chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 868}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 442, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "12 grams", "sodiumContent": "235 milligrams", "sugarContent": "47 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup/145 grams all-purpose flour", "3/4 cup/75 grams Dutch-process cocoa powder", "3/4 teaspoon kosher salt", "1/2 teaspoon baking powder", "1/2 teaspoon baking soda", "10 tablespoons/141 grams unsalted butter, at room temperature", "3/4 cup/150 grams dark brown sugar", "2/3 cup/133 grams granulated sugar", "1 large egg", "2 teaspoons pure vanilla extract", "2 cups/305 grams semisweet or bittersweet chocolate discs (or use 2 cups/340 grams chocolate chips)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together flour, cocoa powder, salt, baking powder and baking soda. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a stand mixer fitted with the paddle attachment, beat together butter, brown sugar and granulated sugar until very light, about 5 minutes. Add egg and vanilla and beat until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer on low, add the dry ingredients and beat just until combined. Add the chocolate discs and mix briefly to combine. Press plastic wrap against the dough and chill it for at least 24 hours and up to 36."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line a baking sheet with parchment paper. Portion the dough out into balls slightly larger than golf balls, about 3 1/2 ounces each, and transfer five balls to the baking sheet. (They will spread significantly.) Bake the cookies until set, being careful to remove cookies from the oven when still soft in the center, about 18 minutes. Transfer the parchment with the cookies to a rack to cool. Repeat with the remaining dough, baking a second batch of four or five cookies. Serve warm."}]}