{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Bread", "description": "Is this potato bread from Copenhagen time-consuming? Yes, but unattended for the most part. There are a few unusual aspects to this recipe that produces a batch of warm, buttery, flaky little breads. With the yogurt and slow-rising, they deliver a pleasing touch of sourness. And the way the dough is shaped, by making many folds, gives the breads an inviting flakiness. Though baking rounds is what the chef suggests, I also prepared it by forming about 15 small balls of dough, placing them next to one another in a buttered layer-cake pan and baking them until golden, without grilling first, to turn them into a batch of Parker House rolls.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2017/11/01/dining/01CHEF2/01CHEF2-articleLarge.jpg", "totalTime": "P2DT2H", "recipeYield": "8 breads", "recipeCuisine": "scandinavian", "recipeCategory": "breads, project", "keywords": "plain yogurt, yukon gold potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 29}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 86, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "102 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["20 ounces (about 550 grams) medium-size Yukon Gold potatoes (about 6)", "1 1/2 tablespoons (30 grams) fine sea salt", "10 ounces (300 grams) plain yogurt", "1 packet active dry yeast", "4 cups, approximately, (550 grams) all-purpose flour, plus more for dusting", "3 tablespoons (42 grams) unsalted butter, melted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place potatoes in a saucepan, cover with water to a depth of 1 inch, bring to a boil, lower heat to a simmer and cook until the potatoes are tender when pierced with a knife. Drain potatoes and set aside to cool. When cool, peel potatoes and place in a zipper-close plastic bag with 1/2 tablespoon of the salt. Seal bag and shake to distribute the salt. Press down on the potatoes to crush them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the yogurt in a bowl and stir in yeast. Set aside 5 minutes. Place potatoes in the bowl of a stand mixer with a paddle attachment. Add the yogurt mixture and remaining salt and process on low speed until just mixed. Gradually add 3 2/3 cups of the flour, or a little more as needed for the mixture to come together as a dough. It will be a little sticky. Knead by hand, adding more flour if necessary, to make a fairly smooth ball of dough. Cover bowl with plastic wrap and let sit at room temperature 3 to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate at least overnight and up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make breads, remove dough from refrigerator for 2 hours. Cover a baking sheet with parchment. Flour a work surface and turn ball of dough out onto it. Pull a golf-ball-size piece of the dough off and set it aside to refrigerate and use as starter for subsequent batches. Divide remaining dough in 8 portions. Form one portion into a disk. Stretch one side of the disk out and fold it back on top. Turn disk and repeat 9 times. With floured hands, form the disk into a ball, then flatten it back into a disk shape about 3 1/2 inches in diameter and about 1/2 inch thick. Place on the baking sheet. Repeat with remaining dough. Breads can be cooked immediately or set aside for up to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a grill or stovetop grill pan on medium-high. Place disks of dough on grill or pan a minute or so, enough for a crust to form on the outside without coloring. Turn and repeat on the other side. Transfer rounds to the baking sheet. Heat oven to 400 degrees. Brush dough with melted butter on both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake rounds 5 minutes. Turn over, brush tops with more butter and continue baking 6 to 10 minutes more, until a knife slipped into the side comes out clean. Transfer breads to a rack to cool. To serve, warm breads 10 minutes in a 300-degree oven and wrap in a napkin."}]}