{"@context": "http://schema.org", "@type": "Recipe", "name": "Almond-Apricot Tart", "description": "This rather simple tart recipe is open to interpretation. Bake it according to the recipe, which includes pastry bolstered with ground almonds and a filling rich with apricots that suggests frangipane with more almonds and mascarpone. But as the season takes on summer’s glow, you could use this recipe as a template and swap out the apricots for a layer of lightly sweetened fresh raspberries splashed with framboise eau de vie. Diced poached sweetened rhubarb, diced fresh apricots or quartered and stemmed fresh black figs would work, too.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/05/12/dining/almond-apricot-tart/almond-apricot-tart-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "almond, apricot, tart pastry, dessert, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 103}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 505, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "12 grams", "sodiumContent": "271 milligrams", "sugarContent": "31 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["30 dried apricots, about 9 ounces", "2/3 cup whisky", "1 1/4 cups all-purpose flour, plus more for rolling", "1/2 teaspoon salt", "2 tablespoons granulated sugar", "6 tablespoons cold unsalted butter, diced", "2 whole eggs", "1 egg yolk", "3/4 cup sifted confectioners’ sugar", "1 cup mascarpone", "1 teaspoon almond extract", "3 tablespoons sliced almonds", "3/4 cup ground almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place apricots and whisky in a saucepan, bring to a simmer and set aside. Turn apricots in warm whisky from time to time while continuing with preparation."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Combine flour, 1/4 cup ground almonds, salt and granulated sugar in a bowl or food processor. Whisk to combine. By hand or machine, add butter, pulsing or using a pastry blender to make a crumbly mixture. Beat egg yolk with 4 tablespoons cold water and add, mixing or pulsing until ingredients come together to form a dough. Add a little more water as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape pastry into a flattened disk on a floured surface and roll to fit a 9-inch straight-sided tart pan. Prick the bottom. Line with foil and pastry weights and bake 10 minutes. Remove foil and weights and bake 10 minutes more, until lightly golden. Remove from oven. Reduce oven temperature to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain apricots, reserving any whisky. Tightly line pastry shell with apricots. Whisk together the remaining 1/2 cup ground almonds and confectioners’ sugar in a bowl. In a separate bowl, whisk mascarpone until smooth. Beat 2 remaining eggs and add to mascarpone along with reserved whisky and almond extract. Mix into combined almonds and confectioners’ sugar. Pour over apricots in pastry shell."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place tart in oven and bake 20 minutes. Sprinkle sliced almonds around the outside edge of the tart filling to form a border about an inch wide. Return to oven and bake another 15 to 20 minutes, until the filling is puffed and lightly browned. Remove from oven, place on a rack and let cool to room temperature before serving."}], "link": "https://cooking.nytimes.com/recipes/1018112-almond-apricot-tart"}