{"@context": "http://schema.org", "@type": "Recipe", "name": "New Crab Louis", "description": "Crab Louis is a rather perfect meal for a summer night, particularly in this slimmed down, very homemade, ketchup-less version. With nothing processed or sweetened, an updated Crab Louis is simply good American crab, Little Gem- or Boston Bibb-lettuce, and pickle- and caper-studded mayonnaise whisked from olive oil and the best, richest-yolked eggs you can find. The effect is as straightforward as the original's, but the details are resolutely contemporary.", "author": {"@type": "Person", "name": "Tamar Adler"}, "image": "https://static01.nyt.com/images/2016/07/03/magazine/03eat/03mag-03eat-t_CA0-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "capers, crab, dill pickles, English cucumber, Little Gems lettuce, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 82}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 266, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "30 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1060 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3-4 heads Little Gems lettuce (or 2 heads Boston lettuce or 1 head iceberg)", "1 (12-ounce) English cucumber, halved lengthwise and seeded", "3/4 teaspoon kosher salt, divided, plus more to taste", "3 tablespoons sherry or white distilled vinegar", "5 eggs at room temperature", "1/4 teaspoon smooth Dijon mustard", "1 tablespoon fresh lemon juice, plus more to taste", "1 cup not sharp, good-tasting extra-virgin olive oil like Frantoia or California Olive Ranch", "A few drops room-temperature water", "1 tablespoon finely chopped shallot (about 1/2 shallot)", "1 stalk green garlic, light and whitest green parts only, or 1/2 clove regular garlic, peeled and chopped", "2 1/2 tablespoons finely chopped very dilly dill pickles", "1/2 tablespoon chopped drained capers", "1 pound picked-through jumbo lump crab meat (canned is fine), chilled", "Homemade vinegar-based hot sauce or Tabasco", "Chives or chive blossoms", "Optional: Finishing salt, like Maldon", "Optional: An avocado; other vegetables, like boiled asparagus or potatoes, or wedged tomato"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the lettuce, and dry in a salad spinner and on dish towels. Chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the cucumber skin in stripes, then halve lengthwise, and seed with a spoon. Cut into bite-size pieces. Drizzle with 1/4 teaspoon salt and the sherry or vinegar, and leave to marinate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 4 eggs to a boil, covered, in cold water. Once the water boils, turn off the heat, and leave the eggs sitting covered, 5 to 6 minutes, depending on egg size, for them to just set with the tiniest softness in the middle. Drain immediately, and leave in very cold water for a few minutes. Peel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a damp dish towel into a ring on the kitchen table. Set a medium, round bottomed mixing bowl in it. Separate the final egg yolk. (Reserve the egg white to add to an omelet.) Whisk together the yolk, mustard, 1/4 teaspoon salt and lemon juice well. After about 5 seconds of whisking, begin to add the oil, drop by drop. Once the mayonnaise begins to thicken, start adding oil more quickly. Whisk in all of the oil, adding drops of water, if needed, to get it to a consistency just looser than store-bought mayonnaise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, drizzle chopped shallot with a little lemon juice and a pinch of salt. Using a mortar and pestle or the side of a large chef’s knife, pound garlic to a paste with the last ¼ teaspoon salt. Add to mayonnaise. Add chopped pickles and capers. Add the reserved shallots. Mix well, and taste for salt. Refrigerate, covered, if not using immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay leaves of lettuce in a lightly piled layer on dinner plates. Drain the cucumbers, and divide between plates. Halve or quarter eggs, and divide among plates, salting each lightly. Divide crab among salads. Shake hot sauce directly over the crab on each plate, as liberally as you like. Dollop each salad with dressing, mostly on crab, but allowed to cascade. Finish with a little crunchy salt, if using, and chopped chives or chive blossoms. Add any additional vegetables before the crab. Serve any remaining dressing on the side. Eat cold."}], "link": "https://cooking.nytimes.com/recipes/1018202-new-crab-louis"}