{"@context": "http://schema.org", "@type": "Recipe", "name": "Hot Italian Sausage and Broccoli Rabe Frittata", "description": "This is a substantial baked frittata that feeds a small crowd. Filled with spicy Italian sausage, flavorful greens and four kinds of cheese, it tastes best at room temperature, and it's perfect for a weekend late breakfast or any time of day.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/11/23/dining/23KITCH1/23KITCH1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch", "keywords": "broccoli rabe, eggs, mozzarella, olive oil, Parmesan, provolone, ricotta, rosemary, sausage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 419}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 486, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "5 grams", "proteinContent": "28 grams", "saturatedFatContent": "17 grams", "sodiumContent": "844 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 pound broccoli rabe, tough stem ends removed", "3/4 pound hot Italian sausage, loose or in links", "2 tablespoons extra-virgin olive oil", "1 medium onion, diced", "Salt and black pepper", "3 cloves garlic, minced", "2 teaspoons roughly chopped rosemary", "1 1/2 cups ricotta", "3 ounces grated provolone (about 1 1/4 cup)", "3 ounces grated Parmesan (about 3/4 cup)", "4 ounces grated smoked mozzarella (about 1 1/2 cup)", "10 eggs, lightly beaten and seasoned with salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Bring a large pot of salted water to boil. Add broccoli rabe and cook for 1 minute, just to wilt, then remove, rinse with cold water and drain. Roughly chop greens, then squeeze to remove excess water and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 10-inch cast-iron skillet over medium-high heat. Add sausage (remove casings from links first) and cook, stirring and mashing, until sausage is in large, well-browned crumbled pieces, 6 to 8 minutes. Remove cooked sausage, blot on paper towels, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add olive oil to skillet. When oil is hot, add onion and cook, stirring, until softened and lightly browned, about 5 minutes. Season well with salt and pepper, then add garlic and rosemary and cook for 1 minute more. Turn off heat and stir in chopped greens and reserved sausage. Let mixture cool in pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon dabs of ricotta over greens mixture, then sprinkle evenly with provolone, Parmesan and mozzarella. Pour seasoned eggs over, tilting pan to distribute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 30 to 35 minutes, until top is golden and eggs are no longer runny at the center. (Use a skewer or paring knife to check; residual heat will continue to cook frittata as it cools.) Let cool at least 15 minutes, then cut into wedges."}], "link": "https://cooking.nytimes.com/recipes/1018427-hot-italian-sausage-and-broccoli-rabe-frittata"}