{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple or Pear Jam", "description": "Thicker than applesauce, thinner than apple butter, apple jam is its own delight entirely. No food mill or masher is required: Most apples will break down into a thick, glossy mash on their own. The few bits of apple here and there even enhance the texture. Pears work equally well here, but keep in mind that their lower pectin content and acidity levels mean they'll be a touch less jamlike than a batch made with apples.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2017/08/07/dining/07JAMGUIDE15/07JAMGUIDE15-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "About 4 to 6 cups (4 to 6 8-ounce jars)", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, jams, jellies and preserves", "keywords": "apple, pear, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 50}, "recipeIngredient": ["5 1/2 pounds/2.5 kilograms apples or pears, peeled, cored and cut into 3/4 inch pieces (about 4 pounds/1.8 kilograms cut fruit)", "Add-ins (optional, see note)", "3 cups/600 grams granulated sugar", "1/4 cup/60 milliliters fresh lemon juice (from about 2 lemons)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a small plate in the refrigerator to chill. (You’ll use this later.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, heavy-bottomed pot, cover fruit and any add-ins (see note) with 4 cups/960 milliliters of water. Bring to a strong simmer over medium–high heat. Cook until water is reduced by about 3/4, and fruit is soft and tender (or even falling apart slightly), 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add sugar and continue to cook, stirring occasionally at first and more frequently as the jam cooks and juices thicken until most of the liquid has evaporated and the fruit has really started to break down, another 30 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the jam cooks, the liquid reduces, the sugars thicken and the natural pectins activate. You’ll notice the liquid go from a rapid, rolling boil with smaller bubbles to a slow, thick, tarlike boil with larger bubbles: This is the stage at which it’s most important to stir constantly along the bottom of the pot to prevent scorching and sticking. (Sugar is heavier than water and will concentrate there, increasing any chance of the fruit burning.) It’s also the stage at which splattering may occur, so take care in stirring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the jam reaches a slow, thick boil, add lemon juice and incorporate any of the add-ins and continue to cook, stirring constantly until the jam has returned to its previously thickened state, about another 5 minutes. At this stage, the jam should look like a coarse, shiny applesauce. But if you’d really like to be sure, spoon a bit of jam onto the chilled plate, return it to the refrigerator and chill for 2 minutes. Drag your finger through it: It should hold its shape on either side without appearing watery or runny. If it doesn't, cook it a few minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spoon or other utensil, pick out any spices or vanilla beans. Divide between jars, leaving 1/4 inch of space from the top of the jar, and seal immediately. Can the jams (see our <a href=\"https://cooking.nytimes.com/guides/45-how-to-make-jam\">How to Make Jam</a> guide for more instruction), or store in the refrigerator, using them up within a couple of weeks."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Apple or Pear Jam", "description": "guides-jam-apple", "thumbnailUrl": "https://static01.nyt.com/images/2017/08/07/dining/07JAMGUIDE15/07JAMGUIDE15-mediumThreeByTwo440.jpg", "uploadDate": "2017-08-03T21:47:33.000Z", "duration": "PT1M8S"}, "link": "https://cooking.nytimes.com/recipes/1018847-apple-or-pear-jam"}