{"@context": "http://schema.org", "@type": "Recipe", "name": "Gingery Mixed Berry Pie", "description": "Mixed berry pie is the ultimate summertime treat: Handfuls of the season’s finest blueberries, blackberries and raspberries are tucked into a crisp, buttery crust that’s just begging to be served with a scoop of ice cream. Fresh ginger lends unexpected warmth and spice to this well-loved classic, but for a little punch, add up to 1 tablespoon of very finely minced candied ginger. If you find yourself short on one type of berry, make up the difference with another — just make sure the berries are the best you can find. For a crisp bottom crust, bake the pie in the lower third of your oven until it is deeply golden and the fruit juices are bubbling, and don’t skip the lattice top. It’s not just for looks: The vents help steam escape and the berry juices to concentrate.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2017/07/21/dining/21COOKING-BERRY_PIE1/21COOKING-BERRY_PIE1-articleLarge.jpg", "totalTime": "PT1H50M", "recipeYield": "One 9-inch pie", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "blackberries, blueberries, ginger, raspberries, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 133}, "recipeIngredient": ["2/3 cup/140 grams granulated sugar", "1 teaspoon finely grated lemon zest", "5 tablespoons/40 grams cornstarch", "2 teaspoons very finely grated, peeled fresh ginger", "1 tablespoon candied ginger, finely minced (optional)", "4 cups/592 grams blueberries", "2 cups/288 grams blackberries", "2 cups/246 grams raspberries", "1 tablespoon freshly squeezed lemon juice", "Pinch kosher salt", "1 egg for egg wash", "2 teaspoons turbinado sugar", "1/4 teaspoon flaky salt, like Maldon, not table salt", "A <a href=\"https://cooking.nytimes.com/recipes/448-all-butter-pie-crust\">double batch of all-butter pie crust,</a> refrigerated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the sugar and lemon zest. Rub the zest into the sugar with your fingertips until well combined and fragrant. Stir in the cornstarch, fresh ginger and candied ginger (if using). Add the blueberries, blackberries and raspberries to the bowl. Sprinkle the lemon juice over the top, but don’t stir quite yet. Let sit while you make the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one disk of the pie dough on a lightly floured surface. With a lightly floured rolling pin, roll the dough into a 12-inch-wide circle 1/8 to 1/4 inch thick. Fit it into a 9-inch pie dish, trim any rough edges, leaving a 1-inch overhang, and set it in the fridge while you roll the other crust and cut the lattice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the second disk of pie dough into a circle roughly 12 inches wide and 1/8 to 1/4 inch thick. Use a pastry wheel or knife to cut the dough into strips about 1 1/2 inches wide."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently stir the filling together until well mixed and pour it into the pie dish. Press gently to pack down the berries into the dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Weave the dough strips into a lattice. Trim off any excess dough and fold the edges of the bottom crust up and over the lattice strips. Crimp together the edges. Slide the whole pie into the freezer until the crust is very firm, about 15 minutes. While the pie is chilling, heat the oven to 400 degrees and set a rack in the bottom third of the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the pie has chilled, place it on a baking sheet to catch any drips. Beat the egg, then brush the top of the pie with the egg wash and sprinkle with turbinado sugar and flaky salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the pie until it is deep golden brown and the juices are bubbling, 45 to 55 minutes. If the crust begins to burn before the filling bubbles, tent it with aluminum foil. Cool before serving."}], "link": "https://cooking.nytimes.com/recipes/1018870-gingery-mixed-berry-pie"}