{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Chicken Salad With Croutons and Shallot Dressing", "description": "This bowl of chicken, croutons and greens makes a cool, satisfying summer dinner. Leftover roast chicken with its juices yields the most savory dressing, but leftover fried or poached chicken are also excellent.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/07/27/dining/27LEFTOVER-WEB/27LEFTOVER-WEB-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "3 or 4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "bread, chicken, mesclun, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 75}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 525, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "2 grams", "proteinContent": "21 grams", "saturatedFatContent": "10 grams", "sodiumContent": "487 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/3 cup minced red onion or shallots", "3 tablespoons sherry or balsamic vinegar", "Salt and freshly cracked black pepper", "1/4 cup extra-virgin olive oil, more to taste", "1/4 cup minced parsley", "3 tablespoons olive oil", "2 to 3 cups bite-size bread pieces", "10 to 12 ounces leftover roast chicken, skin and bones removed, with any juices that have collected in the container", "5 to 6 ounces tender salad greens, like mesclun, Bibb or oak leaf lettuce", "2 ounce chunk Parmesan or aged Gouda or other sharp cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: In a bowl, combine shallots and vinegar and set aside 10 to 30 minutes to soften. Add 2 big pinches of salt and a dozen grinds of black pepper. Whisk in the oil and then the parsley. Taste and add more oil, salt and pepper as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the croutons: Gently warm the olive oil in a skillet. When a piece of bread sizzles when dropped into the pan, add all the bread and cook slowly, stirring, until golden brown on all sides. Sprinkle with salt, transfer croutons to a bowl and wipe out the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pan, add the cooled chicken juices (they may have jelled). Don’t worry if your chicken doesn’t have juices; the salad will still be excellent. Add a tablespoon of water to pan and heat juices until smooth and runny. Dice or tear the chicken into bite-size pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss the greens well with about 2/3 of the dressing. Taste and add more if needed. Divide greens among 3 or 4 bowls or plates. On top, divide the chicken, then the croutons, then the juices. Using a vegetable peeler, shave 3 or 4 thin, wide slices of cheese on top of each salad. Spoon a little more dressing on top and grind pepper over. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1018227-roast-chicken-salad-with-croutons-and-shallot-dressing"}