{"@context": "http://schema.org", "@type": "Recipe", "name": "Fig Jam", "description": "Fig jam is a perfect way to preserve a surfeit of this seductive fruit. The added touch here, beyond the fruit, sugar and lemon juice, is the small amount of balsamic vinegar, which intensifies the sometimes elusive flavor of the figs. This jam is wonderful stirred into plain yogurt.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2016/08/31/dining/31martha2/31martha2-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "About 2 cups", "recipeCuisine": "", "recipeCategory": "jams, jellies and preserves", "keywords": "balsamic vinegar, figs, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 148}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 382, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "99 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "3 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "2 milligrams", "sugarContent": "96 grams", "transFatContent": null}, "recipeIngredient": ["1 1/4 pounds/600 grams ripe figs, cut in small dice", "2 1/2 cups/480 grams sugar, divided", "2 1/2 tablespoons fresh strained lemon juice", "2 teaspoons balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss together chopped figs and half the sugar. Cover bowl with plastic wrap and refrigerate for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer figs and sugar to a small stainless or enameled saucepan. (The pan should not be more than twice the volume of the fruit and sugar mixture.) Over medium heat, bring to a boil, stirring with a heatproof rubber spatula. When mixture comes to a boil, scrape back into bowl and cover with plastic. Let cool, then refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape fig mixture back into the saucepan. Have a skimmer and a bowl of water handy. Place a small plate in the refrigerator. Bring fruit back to a boil over medium heat, stirring. When mixture comes to a boil, stir in remaining sugar, the lemon juice and the balsamic vinegar. Boil, stirring, until mixture is thick but not too concentrated, 10 to 15 minutes. Skim off any foam that rises, dipping the skimmer into the bowl of water to remove the foam. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To test for doneness, remove plate from refrigerator and place a spoonful of the jam on it. Wait about 20 seconds and tilt the plate. The jam should only run slightly, and slowly. Boil a little longer if it seems too runny, but take care not to cook it until too thick. It needs to be spreadable."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a bowl or a sterilized jar. Cover and let cool, then refrigerate."}]}