{"@context": "http://schema.org", "@type": "Recipe", "name": "Peach and Blueberry Cobbler With Hazelnut Biscuits", "description": "Cobbler is an irresistible summer treat, with its combination of bubbling fruit and golden biscuits. This version uses sweet, nutty hazelnut flour in the biscuits, which bake up crunchy on the outside and tender in the middle. To swap whole hazelnuts for the meal, start with 1/2 cup (64 grams) hazelnuts, toasted and with skins rubbed off. Grind the cooled nuts in a food processor or coffee grinder with the 1/3 cup (65 grams) granulated sugar until finely ground, and proceed with recipe as written. Tart wild blueberries are best here; use fresh if you can find them, but frozen are widely available and can go straight into the mix, no thawing necessary. Conventional supermarket blueberries work, too, but shouldn’t be the first choice; they are watery and have a weaker flavor.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2016/08/24/dining/24PEACHES-WEB4/24PEACHES-WEB4-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "", "keywords": "blueberries, hazelnut flour, heavy cream, peach, vanilla bean, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 135}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 391, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "10 grams", "sodiumContent": "278 milligrams", "sugarContent": "27 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup/56 grams hazelnut meal", "1 1/2 cups/190 grams all-purpose flour", "1/3 cup/65 grams granulated sugar", "1 tablespoon baking powder", "1/2 teaspoon kosher salt", "1/2 cup/115 grams cold unsalted butter (1 stick), cut into pieces", "1/3 cup/75 milliliters cold heavy cream, plus more for brushing top", "1/4 cup/60 milliliters cold whole milk", "Sanding sugar, for sprinkling", "2 to 4 tablespoons sugar (depending on how sweet the fruit is)", "1/2 vanilla bean, split and seeds scraped (or 1 1/2 teaspoons vanilla extract)", "2 pounds/910 grams ripe peaches (3 to 4 medium peaches), pitted and cut into eighths (no need to peel it)", "2 cups/320 grams blueberries, preferably wild, either fresh or frozen (no need to thaw)", "1 tablespoon cornstarch", "Pinch of kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. In a small skillet, cook hazelnut meal over medium-low heat, stirring constantly, until golden and fragrant, 3 to 5 minutes. Transfer to a plate and let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: Combine sugar and vanilla seeds in a 2-quart baking dish and use your fingers to grind them together. Add peaches and blueberries, sprinkle with the cornstarch and salt, and gently toss to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the biscuit topping: Combine cooled hazelnut meal, flour, sugar, baking powder and salt in a large bowl and whisk to combine. Cut butter into the flour mixture with a pastry blender or two knives until the mixture resembles coarse meal with a few pea-size pieces. (Pop the flour mixture into the refrigerator for a little while if the butter has gotten warm.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine cream and milk and then, with a fork, stir it into the flour mixture just until evenly moistened. Don’t overwork the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop the dough in 8 to 10 apricot-size balls (a scant 1/4 cup) on top of the fruit mixture. Brush the tops of the dough balls with cream and sprinkle with sanding sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until fruit is bubbling, topping is golden brown, and a toothpick inserted into the center of one biscuit comes out with moist crumbs attached, 40 to 45 minutes. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1018260-peach-and-blueberry-cobbler-with-hazelnut-biscuits"}