{"@context": "http://schema.org", "@type": "Recipe", "name": "Harra Bi Isbaou", "description": "This hearty Middle Eastern stew of lentils and pasta-like dumplings (a small Italian pasta is most commonly used today) is flavored with a tangy-savory mix of tamarind and lemon juice combined with sautéed garlic and cilantro. It is then topped with crispy onions and bread. It can be served at any temperature, but it’s important that the dish be served with all of its garnishes. \n\n“They say it’s called harra bi isbaou (which means 'burned finger' in Arabic) because the peasants who invented it couldn’t wait for it to cool down to eat it, so they burned their fingers,” said Umm Ali, a home cook from the Aleppo suburbs who fled to Beirut with her family in 2013. This version of the dish is an adaptation of her recipe which came to The Times by way of Dalia Mortada in <a href=\"http://www.nytimes.com/2016/09/11/opinion/sunday/the-flavors-that-unite-syrians.html\">a Sunday Review piece she wrote about the role of food in Syria's culture</a>.", "author": {"@type": "Person", "name": "The New York Times"}, "image": null, "totalTime": "PT2H40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 14}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 549, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "99 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "13 grams", "proteinContent": "23 grams", "saturatedFatContent": "1 gram", "sodiumContent": "810 milligrams", "sugarContent": "20 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups (400 grams) brown lentils", "Vegetable oil, for deep frying", "3 large onions, sliced (about 6 cups)", "2 to 3 pita rounds, cut into ½-inch squares (about 3 cups)", "1 tablespoon olive oil", "1 generous cup finely chopped cilantro (from 1 large bunch)", "6 large cloves garlic, minced", "Kosher salt", "1/2 cup (70 grams) small pasta variety (such as elbow macaroni)", "4 1/2 ounces (125 grams) tamarind pulp (or use ¼ cup pomegranate syrup)", "3 tablespoons (44 milliliters) lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the lentils in a large bowl and cover with several inches of water. Let soak 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 1 inch of vegetable oil in a deep pot over medium-high heat. Add onions in 1- or 2-cup batches (don’t overcrowd them in the pan) and deep-fry until golden to dark brown, about 5 minutes. Be careful not to burn the onions, or they’ll be bitter. Remove with a slotted spoon to a plate covered in paper towels and let cool uncovered so that they don’t get soggy. Repeat with remaining onions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pieces of pita to the oil, 1 cup at a time, and deep-fry until dark golden brown, about 1 minute. Remove with a slotted spoon to their own plate covered in paper towels and let cool uncovered. Repeat with remaining pita."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a medium skillet over medium-high heat. Add the cilantro, half the garlic and a dash of salt and cook, stirring constantly, until the cilantro becomes a deep green and the mixture is fragrant; remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the lentils have soaked for 2 hours they should be slightly tender. Drain them and transfer to a heavy-bottomed pot. Cover with 4 cups (960 milliliters) water and add 1 teaspoon salt. Bring to a boil, then reduce heat to medium-low and simmer until tender, about 20 minutes. Stir in the pasta and cook until tender, 5 to 8 more minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the tamarind pulp in a small bowl and add 6 ounces (177 milliliters) water. Massage the pulp with your hands to dissolve the tamarind in the liquid. Strain the mixture through a mesh sieve to remove any seeds, using a spoon to push it through. You should have ½ cup liquefied tamarind. Once the pasta and lentils are tender, add the tamarind and lemon juice and stir well. After about 5 minutes, stir in the remaining crushed garlic and half of the fried onions. Simmer until the mixture is a thick stew — not dry, but not watery either, about 5 more minutes. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "This dish can be served hot off the stove, at room temperature or cold. Distribute lentils to bowls and divide the garlic-cilantro mixture among them. Sprinkle with fried bread and top with crispy onions."}]}