{"@context": "http://schema.org", "@type": "Recipe", "name": "Pineapple-Rhubarb 'Salad' With Basil Cream", "description": "This dish is more like a compote than a soup, but unlike most compotes, the fruit is cooked as little as possible so the flavors and textures remain distinct. The rhubarb must be cut very small to retain some of the crunch, but cook all the way through. Don't be tempted to cook the pineapple at all as the dessert would lose its fresh flavor if you did.", "author": {"@type": "Person", "name": "Michel Richard"}, "image": null, "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "american, french", "recipeCategory": "", "keywords": "basil, pineapple, rhubarb, vanilla ice cream, dessert, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 151, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "2 grams", "sodiumContent": "28 milligrams", "sugarContent": "27 grams", "transFatContent": null}, "recipeIngredient": ["5 tablespoons packed brown sugar", "2 cups finely diced (1/4 inch) peeled rhubarb (about 3 stalks, 10 inches long)", "1 rounded cup finely diced (1/4 inch) ripe fresh pineapple", "20 large basil leaves", "About 3/4 cup good quality vanilla ice cream, slightly softened"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a medium sauté pan over high heat. Melt sugar, and add rhubarb. Sauté rhubarb for about 30 seconds, then reduce heat to low. Cover, and cook until rhubarb is softened but still firm, 2 to 3 more minutes. Transfer rhubarb to a mixing bowl, and add pineapple. Set aside, or cover and refrigerate for up to 24 hours; bring to room temperature before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside a bowl of ice water. Bring a small pan of water to a boil, and add basil leaves. Blanch leaves for 30 seconds, then transfer leaves to ice water to stop the cooking. In a blender, combine ice cream and basil leaves. Purée until mixture is smoothly blended. If necessary, freeze until mixture is thick but can still be poured from a spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide fruit mixture equally among four 1/2-cup serving dishes. Top each with a spoonful of basil-ice cream mixture, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1018255-pineapple-rhubarb-salad-with-basil-cream"}