{"@context": "http://schema.org", "@type": "Recipe", "name": "Bryant Terry’s Millet Cakes With Smoky-Spicy Green Sauce", "description": "Bryant Terry is the chef in residence at the <a href=\"https://www.moadsf.org/\">Museum of the African Diaspora</a> in San Francisco, where he creates events that celebrate the African-American intersection of food and culture. With millet, lentils and potatoes, these vegan cakes are a nod to ’70s-style macrobiotic dishes — but upgraded with a smoky, garlicky sauce built from roasted green peppers. They are also good on their own if you don’t have time to make the sauce, and are delicious topped with an egg as a non-vegan alternative.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2017/11/29/dining/29VEGANS1-1511382927403/29VEGANS1-1511382927403-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, grains and rice, vegetables, main course", "keywords": "berbere spice blend, bourbon, millet, millet flour, panko, red lentils, kwanzaa, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 72}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 758, "unsaturatedFatContent": "46 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "53 grams", "fiberContent": "10 grams", "proteinContent": "13 grams", "saturatedFatContent": "4 grams", "sodiumContent": "754 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 dried Medjool date, pitted", "2 tablespoons extra-virgin olive oil", "1 teaspoon minced fresh ginger", "2 large garlic cloves, minced", "Fine sea salt", "4 green bell peppers, roasted, peeled and seeded (see note)", "1 large jalapeño, roasted, peeled and seeded (see note)", "1/4 cup minced cilantro", "1 teaspoon bourbon", "Freshly ground white pepper", "2 tablespoons powdered flax seeds", "1 medium russet potato, scrubbed", "1/2 cup millet, rinsed", "Fine sea salt", "1/2 cup red lentils, sorted and rinsed", "2 tablespoons peanut or safflower oil, more for frying", "3/4 cup finely chopped yellow onion", "2 large garlic cloves, minced", "1 3/4 teaspoons berbere spice blend (available at spice shops, online, and at large markets like Whole Foods)", "2 tablespoons millet flour", "1 1/2 cups panko (Japanese bread crumbs), drizzled with 1 tablespoon peanut or safflower oil and toasted in a hot pan until golden", "2 cups roasted red peppers, sliced, for garnish (optional; see Note for roasting instructions)", "1/2 medium head red leaf lettuce (about 1/4 pound), sliced into thin chiffonade, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Put the date in a small saucepan, add water to cover and bring to a boil. Remove from heat and set aside. When date is completely softened, drain off water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium skillet over medium heat, combine oil, ginger, garlic and 1/2 teaspoon of salt and cook, stirring, until the garlic starts to smell fragrant, about 2 minutes. Transfer the contents of the pan to a blender. Add the roasted peppers, cilantro, bourbon, and the softened date and purée until smooth. Taste and adjust the seasonings with salt and pepper.  Set aside until ready to serve.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cakes: Combine flax powder and 6 tablespoons water in a small bowl. Mix well with a fork. Cover and refrigerate to let thicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. With a fork, pierce the potato all over then wrap in foil. Bake until tender, 50 to 60 minutes. Set aside to cool. When the potato is cool enough to handle, peel it, transfer to a bowl, and mash until smooth. Set aside 1/2 cup of the mashed potato for this dish and use the rest for something else."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan over medium heat, toast the millet, gently shaking the pan to ensure even cooking, until the millet smells fragrant, 3 to 5 minutes. Add 1 cup of water and 1/2 teaspoon of salt and raise the heat to high until the water boils. Immediately turn down the heat to low, cover, and cook until the water has evaporated, 18 to 20 minutes. Remove from heat, cover and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small saucepan, combine lentils with 1 1/2 cups water over high heat. Bring to a boil, reduce the heat to low, skim off any foam, and simmer, covered, until just tender, 5 to 7 minutes. The lentils should be soft but not falling apart. Remove the lid, drain off any excess liquid, and stir in a generous pinch of salt. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium skillet, heat 2 tablespoons of peanut oil over medium-high heat and until the surface shimmers. Add onions and sauté, stirring often, until soft and just beginning to brown, about 5 minutes. Add garlic and sauté until it starts to smell fragrant, 1 to 2 minutes. Add berbere spice blend and 1/2 teaspoon salt and cook, stirring, until combined about 1 minute. Transfer onion mixture to a medium bowl. Mix in the 1/2 cup of reserved potato, millet and lentils, plus millet flour and the reserved flax seed mixture until thoroughly combined. Season with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands, form the mixture into 12 cakes, using about 1/4 cup of mixture per cake and placing the finished cakes on parchment paper. Transfer to a container with a lid, using parchment paper to separate the layers. Refrigerate, covered, at least 2 hours or up to 2 days to firm up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, heat oven to 200 degrees Fahrenheit and gently reheat the sauce. Spread the toasted panko in a shallow dish and combine with 1 teaspoon salt. Gently dredge each cake in the salted panko, coating both sides and shaking off any excess crumbs. After coating, transfer each cake to a parchment-paper-lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large cast-iron skillet or heavy nonstick pan over medium-high heat, heat 3 tablespoons peanut oil over medium-high heat until shimmering. Add enough cakes to fit in the pan without overcrowding. Cook until golden, about 2 to 3 minutes per side. Transfer to a paper-towel-lined plate to drain, then  to the lined baking sheet. Place the cakes in the oven to keep warm. Wipe out the skillet and repeat with remaining cakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spread a generous 1/4 cup of warm sauce on the bottom of 4 serving plates. Place 3 cakes on each plate. Garnish with a handful of lettuce and roasted red peppers."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1018979-bryant-terrys-millet-cakes-with-smoky-spicy-green-sauce"}