{"@context": "http://schema.org", "@type": "Recipe", "name": "Bariis Iskukaris (Somali-Style Rice)", "description": "Somali-style rice, when prepared for festive occasions, can be a satisfying meal on its own: The rice is cooked in a rich stock and often jeweled with pieces of meat and vegetables. This version of the dish comes from Ayaan and Idyl Mohallim, twin sisters who make their own xawaash, an aromatic spice mixture that is layered with fenugreek and turmeric. The finished rice is also generously seasoned with saffron, as well as softened peppers and raisins. At Thanksgiving, the rice is a versatile side with roast turkey and vegetables, and the day after, it's a great base for leftovers. You could easily use a vegetable stock in place of a meat stock for a vegetarian version, and add more vegetables to the topping. The Mohallim sisters, on occasion, add blanched green beans to the mix.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2016/11/11/dining/COOKING-RICE2/COOKING-SOMALIAN2-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "12 to 16 servings", "recipeCuisine": "african", "recipeCategory": "grains and rice", "keywords": "rice, spices, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 112}, "recipeIngredient": ["4 cups Basmati rice", "1/2 cup olive oil", "1 large yellow onion, chopped", "3 cloves garlic, minced", "2 cinnamon sticks", "5 whole green cardamom pods", "10 whole cloves", "2 teaspoons xawaash spice mix (see below)", "8 cups chicken stock", "1 teaspoon saffron threads, finely chopped", "1 cup raisins", "Salt", "1 tablespoon cumin seeds", "1 tablespoon coriander seeds", "2 teaspoons dried whole sage", "1 teaspoon black peppercorns", "1 teaspoon fenugreek seeds", "1 teaspoon ground turmeric", "1 1/4 teaspoons ground ginger", "8 green cardamom pods", "10 whole cloves", "1/4 teaspoon freshly grated nutmeg", "1/3 cinnamon stick", "2 tablespoons olive oil", "1 red onion, peeled and thinly sliced", "1/4 cup raisins", "1 red bell pepper, cored and thinly sliced", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak rice in cold water 30 to 45 minutes, then drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the xawaash: Combine all the spices in a spice grinder and finely grind. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the topping: Heat olive oil in a wide, deep pot over medium-high heat and add the onions, stirring occasionally until translucent. Add raisins and allow to soften, about 2 minutes, then add red bell pepper and cook until softened, about 5 to 7 minutes. Season with salt and set aside on a paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pot, make the rice: Heat 1/2 cup oil. Add onions and sauté, stirring frequently, until softened, 6 to 8 minutes. Add garlic, cinnamon sticks, cardamom, cloves and xawaash and cook, stirring, 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in stock and rice. Bring to boil, then cover and cook on low heat 20 minutes. Stir in saffron and raisins and season to taste with salt. Cover, turn off heat and steam for 5 more minutes. Transfer to a serving platter, using a large spoon to pile rice in a heap onto a platter. Sprinkle topping over rice and serve."}], "link": "https://cooking.nytimes.com/recipes/1018410-bariis-iskukaris-somali-style-rice"}