{"@context": "http://schema.org", "@type": "Recipe", "name": "Firehouse Chili Gumbo", "description": "This recipe is adapted from the one that a Louisiana firefighter named Jeremy Chauvin entered into a national cook-off run by Hormel Foods in 2017, and that took home the prize for America’s Best Firehouse Chili. It is not really a chili in the Texas sense of the word. There is a roux at its base — it’s more like a chili gumbo, a bayou take on the original red. Serve with grated cheese and corn chips. Chauvin told me he was moved to enter the chili contest as a way to honor his brother Spencer, also a firefighter, who was killed in the line of duty in 2016. “I just want people to remember his sacrifice,” he said. ", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/10/08/magazine/08eat1/08eat1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "Serves 8 to 10", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "green pepper, ground beef, tomato, yellow peppers", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 993}, "recipeIngredient": ["2 tablespoons neutral oil, like canola or grapeseed", "3 pounds ground beef, ideally coarse-ground", "1 tablespoon kosher salt", "1 teaspoon ground white pepper", "1 teaspoon ground black pepper", "1 teaspoon ground cayenne pepper, or to taste", "2 tablespoons chile powder", "1 teaspoon ground turmeric", "1 teaspoon dried oregano", "1 teaspoon ground cumin", "3 tablespoons steak sauce", "2 tablespoons Worcestershire sauce", "2 14.5-ounce cans diced tomatoes", "2 tablespoons unsalted butter", "1 tablespoon olive oil", "2 tablespoons all-purpose flour", "1 large yellow onion, peeled and diced", "2 medium shallots, peeled and diced", "1 green bell pepper, diced", "1 yellow bell pepper, diced", "3 ribs celery, trimmed and diced", "3 cloves garlic, peeled and minced", "2 6-ounce cans tomato paste", "2 8-ounce cans tomato sauce", "1 to 2 cups tomato juice", "1 cup ketchup", "1 tablespoon apple-cider vinegar, or to taste", "2 tablespoons hot sauce, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chili. Heat the oil in a large skillet or heavy-bottomed pot set over medium-high heat. Working in batches, cook the beef, stirring often, until it has begun to brown at the edges. Using a slotted spoon, transfer browned meat to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off excess fat, turn heat down to medium and return the browned beef to the skillet or pot. Add salt, peppers, chile powder, turmeric, oregano and cumin, and stir to combine. Add steak sauce, Worcestershire sauce and diced tomatoes, and stir again. Cover the skillet or pot, and cook, stirring a few times, for 15 minutes or so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the gumbo. Place a large pot with a heavy bottom over medium heat, and put the butter and oil into it. When the butter is melted and foaming, sprinkle the flour into the pan, and whisk to combine. Continue whisking until the mixture is golden brown, approximately 15 to 20 minutes. Add the onion, shallots, bell peppers, celery and garlic, and cook, stirring often, until the vegetables have started to soften, approximately 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chili gumbo. Add the beef mixture to the pot with the vegetables along with the tomato paste, tomato sauce, tomato juice and ketchup, and stir to combine. Cook, stirring occasionally, for 30 to 45 minutes, then add apple-cider vinegar and hot sauce to taste. Take the pot off the heat, and serve, or allow to cool and refrigerate overnight to allow the flavors to cure. Heat before serving."}], "link": "https://cooking.nytimes.com/recipes/1018961-firehouse-chili-gumbo"}