{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Cod With Potatoes in Chorizo-Mussel Broth", "description": "This recipe came to The Times in 2002 from the French chef Eric Ripert, whose cooking at Le Bernardin carries flavors reminiscent of his culinary training near the Spanish border. Quickly sautéed cod is placed on a bed of potatoes with a savory, supple broth ladled over. It takes not too much time, and it is delicious.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/05/02/dining/sauteed-cod/sauteed-cod-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings.", "recipeCuisine": "spanish", "recipeCategory": "dinner", "keywords": "cod, mussels, spanish chorizo, yukon gold potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 109}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 941, "unsaturatedFatContent": "39 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "57 grams", "fiberContent": "7 grams", "proteinContent": "54 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1547 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["9 large cloves garlic: 4 unpeeled, 2 thinly sliced and 3 finely minced", "2/3 cup extra virgin olive oil", "1 1/2 pounds medium Yukon Gold potatoes, peeled", "Salt", "3 large shallots, sliced thin, plus 1/4 cup minced shallots", "1/2 cup dry white wine", "1 pound mussels, scrubbed", "2 ounces chorizo, preferably Spanish, peeled and sliced thin", "1 cup clam juice", "5 branches thyme", "5 branches rosemary", "4 tablespoons butter", "5 tablespoons minced flat-leaf parsley", "1 1/2 tablespoons lemon juice", "20 to 24 ounces skinless cod fillet, in 4 portions", "Freshly ground white pepper", "1 1/2 tablespoons lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Brush unpeeled garlic with a teaspoon of olive oil, wrap in foil, bake 40 minutes. Meanwhile, place potatoes in pot of salted water to cover, bring to a boil, and cook over medium heat until very tender, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon olive oil in 3-quart saucepan. Add sliced shallots and sliced garlic, cook over low heat until soft but not colored, add wine, bring to a simmer and add mussels. Cover and cook until mussels open, about 3 minutes. Drain through a fine sieve, and reserve cooking liquid. Shuck mussels and reserve, covered. Clean pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 2 tablespoons oil in mussel pan. Add minced shallots and minced garlic. Sauté until soft. Add chorizo, and sauté until starting to brown. Add clam juice and mussel cooking liquid. Bring to a simmer, add 1 branch each thyme and rosemary, remove from heat, add shucked mussels, and set aside, covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When roasted garlic is done, remove it from foil, and peel cloves. When potatoes are done, drain them, and return them to cooking pot. Mash with a fork, adding roasted garlic cloves, butter, and 4 tablespoons olive oil. Place over low heat, fold in 4 tablespoons parsley, add 2 teaspoons lemon juice and season to taste with salt. Set aside over very low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat fish dry, and season with salt and pepper on both sides. In heavy skillet large enough to hold fish without crowding, add remaining oil. Place over high heat. When oil is hot, sauté fish, turning once, until golden brown, 4 to 5 minutes on each side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat chorizo-mussel broth over low heat, and add remaining lemon juice. Remove thyme and rosemary, and add remaining parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a portion of potatoes in center of each of four shallow soup plates. Place a portion of fish on potatoes. Spoon broth, chorizo and mussels around potatoes, and garnish with thyme and rosemary."}], "link": "https://cooking.nytimes.com/recipes/1018093-sauteed-cod-with-potatoes-in-chorizo-mussel-broth"}