{"@context": "http://schema.org", "@type": "Recipe", "name": "Peach-Raspberry Ice Cream Cake", "description": "Adults swoon and children squeal at the prospect of ice cream cake. This from-scratch version, with layers of peach-studded ice cream, raspberries and tender butter cake, will delight both those contingents. The ice cream here does not require an ice cream maker; it's made by folding freshly whipped cream into a mixture of chopped peaches, peach preserves and evaporated milk. It is deliberately less sweet than other no-churn ice cream recipes you'll see, to avoid overwhelming the delicate peach flavor. But if you prefer, you can use store-bought ice cream in place of the cream mixture here. Omit the evaporated milk and heavy cream; instead, combine the chopped peaches with the peach preserves and salt, then fold into two pints of softened good-quality vanilla ice cream. It will be richer, but a little messier to assemble.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2016/08/24/dining/24PEACHES-WEB1/24PEACHES-WEB1-articleLarge.jpg", "totalTime": "PT9H", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "cakes, ice creams and sorbets", "keywords": "dessert, peach, peach preserves, raspberry, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 172}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 305, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "11 grams", "sodiumContent": "161 milligrams", "sugarContent": "23 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 ripe peach, finely chopped (about 170 grams/1 1/4 cups; no need to peel it)", "2 tablespoons granulated sugar", "2 cups/240 grams raspberries, lightly mashed", "1/2 cup/154 grams good-quality peach preserves, large fruit pieces chopped", "1/2 cup/120 milliliters evaporated milk", "Pinch of salt", "1 1/2 cups/360 milliliters heavy cream", "3/4 cup/95 grams all-purpose flour", "3/4 teaspoon baking powder", "1/2 teaspoon kosher salt", "5 tablespoons/70 grams unsalted butter, at room temperature, plus more for greasing pan", "1/2 cup/100 grams granulated sugar", "1/2 teaspoon pure vanilla extract", "1 large egg plus 1 large egg yolk, at room temperature", "2 tablespoons/30 milliliters whole milk, at room temperature", "1 ripe peach, thinly sliced (no need to peel it)", "1/2 cup/60 grams raspberries", "1 tablespoon granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Butter a 9-by-13-inch baking pan and line with parchment paper. Butter the parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Macerate fruit: In a small bowl, combine chopped peaches and 1 tablespoon sugar. In another bowl, combine mashed raspberries with 1 tablespoon sugar. Let both macerate for at least 1 hour while you bake the cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare cake: In a medium bowl, whisk together flour, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, with an electric mixer on medium, beat together butter and 1/2 cup sugar until light and fluffy, about 3 minutes. Scrape down sides of bowl, then beat in vanilla extract and the whole egg. Scrape down sides of bowl again, then beat in egg yolk. With the mixer on low, beat in half the flour mixture, followed by the milk, and then the remaining flour mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer batter to pan and spread it into a thin, even layer. Bake until cake is golden brown and springs back when pressed lightly, 10 to 12 minutes. Let cool in pan on a rack for 10 minutes. Run a small thin knife or spatula around the cake, then carefully turn out onto rack to cool completely. Discard parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare ice cream: In a large bowl, combine preserves, evaporated milk, salt and macerated peaches, plus any juices. In another large bowl, whip cream to stiff peaks (do not overbeat). Gently fold cream into peach mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble ice cream cake: Line a 9- by-5-inch loaf pan with plastic wrap, leaving a 6-inch overhang on each side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut cooled cake into thirds, making three rectangles 9 by 4 1/3 inches each. (You want a 1/4-inch border of space around each cake layer once it's in the loaf pan; depending on the shape of your pan, you may need to trim cake.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a third of the cream mixture (about 1 1/3 cups) to pan and smooth into an even layer. Top with one cake layer, pressing down slightly so cream comes up and around sides of cake evenly. Drain mashed raspberries, then spread half the fruit onto cake. Repeat process a second time, adding another third of the cream; a cake layer, pressing down slightly so cream comes up and around sides; and remaining raspberries. Add remaining cream, then top with final cake layer, pressing down slightly so cream comes up and around sides. Use plastic overhang to wrap cake up tightly. Freeze until firm, at least 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, toss sliced peach with 1/2 cup raspberries and 1 tablespoon sugar and let macerate until a bit juicy, about 10 minutes. Remove cake from freezer, unwrap, and lift out of pan. Invert onto a serving plate and let stand at room temperature for 5 to 10 minutes. Top with peach-raspberry mixture."}], "link": "https://cooking.nytimes.com/recipes/1018259-peach-raspberry-ice-cream-cake"}