{"@context": "http://schema.org", "@type": "Recipe", "name": "Syrian Walnut Baklava", "description": "Marhaf Homsi learned to make this Syrian-style walnut baklava from his family in Hama. The baklava he and his wife, Nawal Wardeh, now bake in Brooklyn and sell at their online store, Syrian Sweet Refuge, is less intensely sweet than the sticky confection familiar to many Americans. Cut into large squares, as is traditional in Hama, where the couple ran a bakery for 30 years, the baklava is lightly soaked in a lemon sugar syrup, rather than honey. Use the best quality walnuts available and chop them by hand; Mr. Homsi finds that walnuts chopped in a food processor get bruised and overly pulverized, creating a powdery texture. Be sure to leave time to defrost frozen phyllo dough, which takes 2 hours to thaw on the counter.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/02/08/dining/08SYRIAN3/08SYRIAN3-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "24 pieces", "recipeCuisine": "middle eastern", "recipeCategory": "", "keywords": "clarified butter, orange blossom water, phyllo dough, walnut, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 299, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "10 grams", "sodiumContent": "81 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["13 ounces/367 grams walnuts (3 1/4 cups whole walnuts)", "1 teaspoon confectioners’ sugar", "1/2 teaspoon orange blossom water", "1 package phyllo dough (1 pound, about 30 sheets, sized as close as possible to 13 x 18 inches), defrosted if frozen", "1 1/2 cups/340 grams clarified butter or ghee, melted", "3/4 cup/150 grams granulated sugar", "1 1/2 tablespoons lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Chop walnuts by hand into small pieces. (A food processor will bruise and pulverize the walnuts, creating a powdery effect.) Transfer to a bowl and mix with confectioners’ sugar and orange blossom water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover phyllo pastry with a clean, lightly damp kitchen towel. Layer a pastry sheet into a 13-by-18-inch pan, securing it in a few places with dabs of clarified butter in the bottom of the pan. Brush sheet lightly with butter before layering on the next sheet. Continue layering butter and sheets; once half the sheets have been used, scatter the walnut mixture evenly over the top, being careful not to rip the pastry or leave any spots uncovered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Layer the remaining sheets, brushing each lightly with butter, including the top one. If your sheets are larger than the pan, trim the stack all at once so the edges are flush with the pan. Cut baklava into 3-inch squares, and pour any remaining butter around the edges. Bake for 40 minutes, or until top is a light golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare simple syrup: Boil granulated sugar and 3/4 cup/180 milliliters water together in a small pot over medium-high heat, stirring to combine. Remove from heat and add lemon juice. Stir, set aside and let cool to lukewarm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If there is excess butter in the baklava pan, carefully tip it over the sink to drain. While baklava is still hot, drizzle over the lukewarm syrup, being sure to get it in the gaps between pieces. Once completely cool, the baklava is best stored covered at room temperature and eaten within a few days."}], "link": "https://cooking.nytimes.com/recipes/1018572-syrian-walnut-baklava"}