{"@context": "http://schema.org", "@type": "Recipe", "name": "Farro With Roasted Squash, Feta and Mint", "description": "Falling somewhere between a grain bowl and a warm grain salad, this colorful dish is substantial enough to be a meatless main course, or it makes a hearty side dish to simple roasted meat or fish. You can use whatever kind of squash you like here, either peeled or unpeeled. Squash skin is perfectly edible; let anyone who objects cut theirs away at the table (though see if you can get them to try it first). If you don’t have farro, you can substitute brown rice. Just increase the cooking time by about 20 minutes.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/12/30/dining/clark-squash-still/clark-squash-still-mediumThreeByTwo440.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, weeknight, grains and rice, salads and dressings, vegetables", "keywords": "apple cider, farro, feta, mint, squash, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 823}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 511, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "60 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "8 grams", "proteinContent": "11 grams", "saturatedFatContent": "6 grams", "sodiumContent": "888 milligrams", "sugarContent": "16 grams", "transFatContent": null}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "2 teaspoons sugar", "3/4 teaspoon ground cinnamon", "3/4 teaspoon fine sea salt, more as needed", "1/4 teaspoon black pepper", "1/8 teaspoon cayenne, or to taste", "3 pounds winter squash, such as kabocha, carnival or butternut, seeded and cut into 1/2-inch thick slices (leave the peels on or remove as desired)", "1 1/2 cups apple cider", "2 1/2 teaspoons kosher salt, more to taste", "1 1/2 cups farro", "2 tablespoons apple cider vinegar, more to taste", "2 garlic cloves, grated on a Microplane or minced", "1/2 teaspoon black pepper", "7 tablespoons extra-virgin olive oil, more as needed", "3 ounces feta cheese, crumbled (about 3/4 cup)", "Fresh mint or arugula leaves, or both"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Prepare the squash: In a large bowl, mix together olive oil, sugar, cinnamon, salt, pepper and cayenne. Add squash and toss well to coat with the spiced oil. Lay the squash pieces out flat on one or two rimmed baking sheets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast squash until the bottoms are golden, 10 to 15 minutes. Carefully turn the pieces over and continue to roast until tender, another 10 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the farro: In a medium pot, bring the apple cider, 2 cups water and the salt to a simmer. Add farro and simmer until water is absorbed and the farro is tender, 20 to 30 minutes. If the liquid evaporates before the farro is done, add a little more water. Or, if there’s still liquid in the pot when the farro is done, drain it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together vinegar, garlic and pepper. Whisk in olive oil. Add farro and toss well, adding more oil or salt, or both, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon the farro on a platter and top with the squash, feta, mint or arugula, or both, and a drizzle of olive oil."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Farro With Roasted Squash, Feta and Mint", "description": "Pair squash with farro for a delicious meatless main course.", "thumbnailUrl": "https://static01.nyt.com/images/2016/12/30/dining/clark-squash-still/clark-squash-still-mediumThreeByTwo440.jpg", "uploadDate": "2016-12-30T18:43:31.000Z", "duration": "PT2M42S"}, "link": "https://cooking.nytimes.com/recipes/1018514-farro-with-roasted-squash-feta-and-mint"}