{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn Fritters", "description": "Corn is the One True Vegetable of American summer. Vine-ripened tomatoes are thrilling, but not ours alone. And zucchini, while pleasant, does not make anyone’s toes curl. But the crunch and suck of ripe local corn on the cob is, so far, confined to the Here and Now. Once you’ve tired of piled-high platters of cobs, turn to corn fritters, which are always greeted with surprise — joy, even. And they are forgiving, because they can be made with fresh, or leftover cooked, kernels. Frying on a hot day isn’t anyone’s idea of fun, so my recipe has evolved into a hybrid of fritter and pancake, cooked in shallow oil. It goes with everything on the August table and, with maple syrup, peaches and bacon, is an ideal breakfast for dinner.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/07/11/dining/11CORNFRITTERS-MAPLESYRUP/11CORNFRITTERS-MAPLESYRUP-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, dinner, pancakes", "keywords": "corn, cornmeal, main course, side dish, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 88}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 121, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "202 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 ears corn, raw or cooked, husks and silk removed", "1/3 cup milk", "1 large egg", "1 teaspoon sugar", "1/2 teaspoon baking powder", "1/2 teaspoon salt", "Pinch cayenne", "1/4 cup cornmeal", "1/4 cup flour", "Vegetable oil, for cooking", "Maple syrup, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim off the tips of the corn cobs. Standing a cob in a wide bowl, slice off the kernels with a sharp knife. Repeat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the corn, add the milk, egg, sugar, baking powder, salt and cayenne. Combine with a large whisk. Mix in cornmeal and flour. Let rest for at least 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 200 degrees. Line a rimmed baking sheet with paper towels or brown paper bags, and put it in the oven. In a large nonstick skillet, heat 2 tablespoons oil over medium heat. Working in batches, drop batter into the pan by heaping tablespoons. Fry until golden brown, about 3 minutes on each side. Transfer to the prepared baking sheet and sprinkle with salt. The fritters can be kept warm in the oven up to 30 minutes. Serve with maple syrup."}], "link": "https://cooking.nytimes.com/recipes/1018837-corn-fritters"}