{"@context": "http://schema.org", "@type": "Recipe", "name": "Frosty Lime Pie", "description": "This frozen dessert delivers cold, tart relief on a hot summer day. Pearl Byrd Foster served this pie on her menu at Mr. and Mrs. Foster’s Place, her 15-table restaurant on the Upper East Side. Ms. Foster opened the restaurant after a 30-year career in hotel, department store and food magazine kitchens. Raymond Sokolov, a former food editor of The New York Times, wrote about this recipe in 1971. The real secret to making this pie, he said, is in how you handle the egg yolks. Heat them too much and they scramble, or too little and they won’t thicken. When the yolks get too hot for your finger, around 165 degrees, they’re hot enough.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2017/05/23/dining/23COOKING-FROSTY-LIME-PIE1/23COOKING-FROSTY-LIME-PIE1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "ice dishes, pies and tarts", "keywords": "dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 154}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 312, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "0 grams", "proteinContent": "5 grams", "saturatedFatContent": "10 grams", "sodiumContent": "180 milligrams", "sugarContent": "27 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 cups graham cracker crumbs", "1/4 cup superfine sugar", "Pinch of salt", "1/4 cup unsalted butter, at room temperature", "5 eggs, separated", "3/4 cup superfine sugar, divided", "2/3 cup fresh squeezed, strained lime juice", "2 teaspoons grated lime zest", "1/8 teaspoon salt", "1 1/2 cups heavy cream, whipped", "Thin slices of lime or fresh strawberries", "Sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Place the graham cracker crumbs, sugar and salt in a bowl. Add the butter and work with a wooden spoon (or your fingers) to blend well. Press the mixture evenly into a 9-inch pie plate with your fingertips, or use an 8-inch pie plate to press down the mixture. Transfer to oven and bake 10 minutes. Cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Beat the yolks in the bowl of a stand mixer until very thick. Gradually beat in half the sugar until mixture is very pale and thick and forms a rope when dropped from the beater."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the lime juice and zest and transfer to a double boiler. Heat over over simmering water, stirring until mixture coats the back of a spoon. Do not allow to boil. Transfer to a large bowl and let cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the yolk mixture reaches room temperature, beat the egg whites with the salt in a separate bowl until soft peaks form. Gradually beat in the remaining sugar until mixture is stiff and shiny. Stir a third of this meringue mixture into the cooled yolk mixture. Fold in remaining meringue mixture until evenly distributed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the mixture out into the cooled graham cracker pie shell and bake 15 minutes, or until lightly tinged with brown. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pie to the refrigerator and let chill thoroughly, uncovered, then transfer to the freezer. Freeze at least 8 hours or overnight. Once it is frozen, cover with plastic wrap and keep frozen until just before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the freezer 10 minutes before serving. Cover with the whipped cream and garnish with lime slices dipped in sugar or fresh strawberries."}]}