{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Vegetable Couscous With Spicy Pesto", "description": "Hearty but not heavy, this stew uses lots of summer vegetables available from the farmers' market. It’s a little complicated to put together, but both the vegetable stew and the couscous can be made in advance, even a day ahead, without suffering. (And if you are short on time, you can skip Step 1 — cooking the dried chickpeas — and use 2 cups canned chickpeas instead.) In season, look for other varieties of sweet peppers besides conventional bell peppers, and colorful tomatoes and onions as well. Even though the directions on most packaged couscous claim it can be cooked in less than 10 minutes, taking the time to steam it further makes it lighter and more digestible.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/08/31/dining/31kitchen1/31kitchen1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "chickpea, cilantro, corn, couscous, okra, sweet pepper, tomato, zucchini, main course, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 129}, "recipeIngredient": ["1 cup dried chickpeas, soaked overnight in cold water", "1 small onion stuck with 2 cloves", "1 bay leaf", "A short piece of cinnamon stick", "1 medium carrot, peeled", "Salt and pepper", "3 tablespoons extra-virgin olive oil", "1 large red onion, cut in 1/2-inch-thick slices", "2 teaspoons grated or minced garlic", "1 tablespoon tomato paste", "1/2 teaspoon pimentón or paprika", "1/2 teaspoon red pepper flakes", "1/2 teaspoon toasted ground cumin", "1/2 teaspoon toasted ground coriander", "2 cups sweet peppers (such as red and yellow bell, cubanelle, gypsy or corno di toro), cut in 1-inch cubes", "4 cups zucchini, cut in 1-inch cubes", "2 cups chopped ripe tomato", "1/2 pound okra, left whole", "2 tablespoons butter", "2 cups corn kernels (from about 3 large ears)", "Salt and pepper", "2 cups couscous", "1/2 teaspoon ground cinnamon", "Pinch of crumbled saffron (optional)", "1/2 teaspoon turmeric", "4 cups roughly chopped cilantro, leaves and tender stems only", "1 or 2 serrano chiles, roughly chopped, to taste", "1 smashed garlic clove", "1/2 teaspoon toasted ground cumin", "1 cup extra-virgin olive oil", "1/2 teaspoon salt", "Juice of 1 lime"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chickpeas for the stew: Put chickpeas in a medium saucepan and cover with water. Add onion stuck with cloves, bay leaf, cinnamon stick and carrot. Bring to a boil, then reduce heat and gently simmer for 45 minutes or so, until tender. Add 1/2 teaspoon salt and let chickpeas cool in their broth. May be cooked a day or 2 ahead. Alternatively, use 2 cups canned chickpeas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the couscous: Melt butter in large saucepan over medium heat. Add corn kernels and season generously with salt and pepper, then sauté, stirring, for a minute or so. Add couscous, cinnamon, saffron (if using), turmeric and 3 cups water, bring to a boil, then lower heat and simmer for 1 minute, stirring. Put the lid on and turn off heat. Leave for 10 to 15 minutes, then fluff. Taste and adjust salt, then keep warm. Or, for lighter, more tender couscous grains, follow step 3 (optional)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread warm couscous on a baking sheet to let cool to room temperature, then rake with fingers to remove clumps. Sprinkle with 1/2 cup cold water. Then place couscous in top compartment of a steamer and put water in bottom compartment. To steam, bring water to a boil, then reduce heat but leave at a rapid simmer. Steam for 15 minutes, covered. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the stew: Heat olive oil in a large heavy-bottomed soup pot or Dutch oven over medium-high heat. Add red onion and cook, stirring, for 5 minutes, until somewhat softened. Add garlic, tomato paste, pimentón, red pepper flakes, cumin and coriander and stir to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add sweet peppers, zucchini and tomatoes and season generously with salt. Add cooked chickpeas and 3 cups chickpea cooking liquid or water. Stir to combine, bring to a simmer and cover. Simmer for 10 minutes, then add okra, cover again and cook for 5 minutes more, until all vegetables are soft. Check seasoning of broth and adjust if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the pesto: Put cilantro, serrano chile, garlic, cumin, olive oil and salt in a food processor and pulse to a rough purée. Transfer to a small serving bowl. To keep green color, add lime juice just before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle stew (with plenty of broth) into large wide bowls or deep plates. Nestle a large spoonful of couscous on the side. Pass the spicy pesto separately, telling everyone to add pesto to taste."}]}