{"@context": "http://schema.org", "@type": "Recipe", "name": "Champagne Melon Soup With Raspberry Ice Balls", "description": "Melon with port is a traditional combination in France, the wine served in half a Cavaillon melon, but I always though it could be improved. The beautiful pastel shades of the melons are lost in the deep red-purple of the wine, and port overwhelms the taste of the fruit. In this recipe, the raspberry ice cubes add color and another flavor dimension to the soup, which is quite intense: they make it taste like a kir royale. I keep raspberry cubes in the freezer for more than just this soup. You can also drop them into a glass of Champagne or a martini.", "author": {"@type": "Person", "name": "Michel Richard"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "soups and stews", "keywords": "appetizer, cantaloupe, champagne, honeydew, mint leaves, raspberries, spring, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 319, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "9 grams", "proteinContent": "5 grams", "saturatedFatContent": "0 grams", "sodiumContent": "94 milligrams", "sugarContent": "54 grams", "transFatContent": null}, "recipeIngredient": ["2 cups raspberries", "Sugar", "1 ripe honeydew melon", "2 ripe cantaloupes", "2 tablespoons fresh lemon juice, or to taste", "12 large mint leaves", "1 1/2 cups Champagne"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender, combine raspberries with 4 tablespoons water. Purée until smooth. Line a strainer with cheesecloth, and set over a bowl. Pour in purée, and twist cloth to squeeze out purée. Stir in 4 teaspoons of sugar, or to taste. Spoon mixture into an ice cube tray that makes round balls or another decorative shape. Freeze until firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut honeydew melon in half, and remove seeds. Using a melon baller, remove flesh from melon to within 3/4 inch of peel. Set aside melon balls. Using a large spoon, scrape out and reserve remaining flesh. Discard peels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut cantaloupe in half, using a straight cut or saw toothed design. Remove seeds. Using a melon baller, remove flesh to within 1/4 inch of peel; reserve any extra flesh. Cut off bottoms of cantaloupes, so they stand securely. In a large bowl, mix honeydew and cantaloupe melon balls with lemon juice. Place an equal amount of melon balls in each melon half, and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender, purée any honeydew or cantaloupe flesh that has not been shaped into balls. Press through a fine strainer, and add 2 teaspoons of sugar. Refrigerate if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon 2 tablespoons of melon purée over melon balls in each cantaloupe half. Allow to sit at room temperature for 30 minutes. Meanwhile, cut mint leaves into very thin strips, and dust lightly with sugar. Arrange 4 raspberry balls in each melon half, and sprinkle with mint. Set each melon half in soup bowl. At the table, pour Champagne directly into cantaloupe halves, and allow to fizz out and over cantaloupes."}], "link": "https://cooking.nytimes.com/recipes/1018251-champagne-melon-soup-with-raspberry-ice-balls"}