{"@context": "http://schema.org", "@type": "Recipe", "name": "Cuban-Style Arroz Congrí", "description": "The combination of white rice and black beans is a Cuban staple. Black beans served on top of or next to white rice is most commonly called Moros y Cristianos, a reference to the medieval battle between Islamic Moors and Christian Spaniards on the Iberian Peninsula. When rice and beans are mixed with sautéed aromatic vegetables and sometimes bits of pork, the result is called congrí. (In some Cuban households, it is also called Moros y Cristianos.) As a rule, congrí is a fluffier and drier dish than Moros y Cristianos. Yolanda Horruitiner, who has lived in Cuba for all of her 70 years, makes this simple version of congrí without pork or cumin, which is a staple in some versions. Feel free to add either to the sofrito base. This recipe uses a stovetop to cook both the rice and beans, although the dish can be assembled more quickly using a pressure cooker and rice cooker and making the sofrito in a separate sauté pan, then mixing it into the rice before it’s all cooked.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2016/05/18/dining/18JPCUBA3/18JPCUBA3-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": " 6 to 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "black beans, long-grain rice, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 296}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 253, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "1 gram", "sodiumContent": "203 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 cup dried black beans ", "2 tablespoons olive oil", "1 small onion, chopped into 1/2-inch pieces", "1 small green pepper, chopped into 1/2-inch pieces", "5 or 6 cloves garlic, roughly chopped", "1 teaspoon kosher salt", "Freshly ground pepper", "1 tablespoon fresh oregano, roughly chopped", "1/4 teaspoon dried dill", "2 small bay leaves", "1 tablespoon cider vinegar", "1 tablespoon dry red wine, or vino seco", "1 1/2 cups long-grain rice, rinsed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the beans and pick them over for any small stones. Put the beans and 8 cups water in a medium-size pot. Bring to a boil, then reduce to a low simmer, partly cover and cook until tender, about 1 to 2 hours. (Time will vary depending on the bean.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the sofrito: Put the oil in a medium-size pot (large enough to hold the rice as well) over medium heat. When it’s hot, add the onion, green pepper and garlic. Add a pinch of salt and several grinds of pepper. Sauté until the vegetables are limp. Stir in the oregano, dill and bay leaves and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the beans, reserving the broth and being careful to not break the beans. In a large measuring cup, add the vinegar and wine, 1 cup of the reserved bean broth and enough water for all the liquid to measure 2 1/4 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the sofrito back on medium heat, add the rice and stir to combine. Cook the rice for 1 to 2 minutes, then add the seasoned bean broth/water mixture and the salt. Bring to a boil, stir, then reduce to a simmer, cover and cook for 17 minutes. Remove from heat, fluff with a fork and return cover to pot for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove bay leaves and put rice mixture into a mixing bowl. Gently mix in the beans, being careful not to break them. Season well with salt and pepper and transfer to a serving bowl. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1018115-cuban-style-arroz-congri"}