{"@context": "http://schema.org", "@type": "Recipe", "name": "Key Lime Poundcake", "description": "Susan Levin Turner has taught many Southerners, both professional chefs and home cooks, how to bake a proper cake. She has made cakes for politicians and celebrities, and turned out five when the chef Edna Lewis turned 76. “Cakes bring people together for celebrations and funerals and everything in between,” she said. Ms. Turner, who owns Food Glorious Food in Tallahassee, Fla., developed this recipe to combine Key limes, a flavor associated with South Florida, with poundcake, a staple in the more rural, agricultural parts of North Florida. She bakes hers in an old-fashioned large square poundcake pan, but the recipe has been adapted here for a loaf pan, which is a little easier to find and work with. She likes to coat the inside of the greased cake pan with sugar, which helps the cake slide from the pan and offers a little more crispness to the crust. This recipe uses flour instead for tenderness, but the sugar method offers a homey Southern touch. Or use a combination of both.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2016/04/25/dining/25COOKING-KEYLIMEPOUNDCAKE/25COOKING-KEYLIMEPOUNDCAKE-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "8 to 10 servings", "recipeCuisine": "southern", "recipeCategory": "cakes", "keywords": "cream cheese, Key lime juice, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 255}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 599, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "73 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "1 gram", "proteinContent": "6 grams", "saturatedFatContent": "19 grams", "sodiumContent": "166 milligrams", "sugarContent": "53 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup/226 grams unsalted butter at room temperature, cut into pieces, plus more for greasing the pan  ", "2 cups/240 grams all-purpose flour, more for flouring the pan", "1 1/2 teaspoons baking powder", "4 ounces/113 grams cream cheese at room temperature, cut into pieces", "1 1/2 cups/297 grams granulated white sugar", "4 eggs at room temperature, lightly beaten", "2 tablespoons lime zest", "1 tablespoon Key lime juice", "4 ounces/113 grams cream cheese at room temperature", "1/4 cup/57 grams unsalted butter at room temperature", "2 cups/227 grams confectioners' sugar", "1/4 cup/60 milliliters Key lime juice", "2 tablespoons lime zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Heat oven to 325 degrees. Generously butter and flour a 9-by-5-inch loaf pan. Sift the flour and baking powder and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix butter and cream cheese in bowl of a stand mixer, or with a hand mixer on medium speed, until blended; gradually add sugar and beat on medium speed for 5 minutes until light in color and fluffy. Add the beaten eggs about a quarter at a time, fully incorporating before adding the next."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add lime zest and mix to incorporate. Add dry ingredients alternately with lime juice, beginning and ending with flour mixture and adding juice in two additions. Mix just enough to incorporate. Pour batter into pan until it is just 3/4-inch from the top (you may have a little batter left over; do not use it or you risk overflow). Firmly tap the pan on the counter a few times to reduce air pockets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for about 1 hour, or until just set in the middle. Check cake after 30 minutes; if top is browning too quickly, tent with foil. If the cake is not set in the middle after an hour, continue baking, checking middle at 5-minute intervals, until set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool in the pan for 20 minutes; loosen edges and turn out cake onto plate with raised edges to contain the glaze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the glaze: In a glass bowl, beat the cream cheese and butter until well blended and a little fluffy, about 2 minutes. With the mixer on slow speed, gradually add confectioners' sugar until fully incorporated, then beat for 20 to 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix in the lime juice, then heat the mixture in a microwave oven for a minute or more until it is very warm and loose. Using a wooden skewer, poke several holes in the cake. Pour half the glaze over cake, let sit for 10 minutes, pour remaining glaze over cake and sprinkle with lime zest."}]}