{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish Soup With Fennel and Pernod", "description": "This recipe was designed for new parents, who must cook stealthily to keep from waking an infant. The silent chef must follow a few simple, yet unforgiving rules: any busy, attention-demanding work has to happen before baby's bedtime; recipes must easily tolerate a lengthy span between prep and finish, ideally resting at room temperature to lessen the mess and effort involved in refrigerating and reheating; and the final steps, after baby's bedtime, have to be both quiet and fairly routine.", "author": {"@type": "Person", "name": "The New York Times"}, "image": null, "totalTime": "PT40M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "for two, soups and stews", "keywords": "canned tomatoes, dry white wine, fennel, fish fillets, mussels, pernod, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 537, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "6 grams", "proteinContent": "54 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1951 milligrams", "sugarContent": "19 grams", "transFatContent": null}, "recipeIngredient": ["1 small onion", "1 rib celery", "4 garlic cloves", "1/2 head fennel (save wispy tops for garnish)", "3 tablespoons best quality extra-virgin olive oil; more for drizzling", "2 tablespoons plus 1 teaspoon Pernod or other anise-flavored liqueur", "1 teaspoon crushed red pepper flakes", "Salt and black pepper", "1 cup dry white wine", "1 cup canned tomato purée, preferably San Marzano", "4 whole peeled canned tomatoes, preferably San Marzano, rinsed and chopped", "20 mussels, scrubbed", "3/4 pound skinless flaky white fish fillets, such as halibut, cut into two pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stage 1, pre-bedtime. Put onion, celery, garlic and fennel in a food processor, and pulse gently until chopped into a coarse paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in a large saucepan over medium-high heat. Add coarsely processed vegetables to pan, and sauté, stirring often, until softened, about 4 minutes. Add 2 tablespoons Pernod, and boil until almost evaporated. Add red pepper flakes, and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in wine, and bring to a boil. Reduce for 2 minutes, and add tomato purée and chopped tomatoes. Bring to boil, stir, cover and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stage 2, post-bedtime. Return saucepan to medium heat until barely simmering. Gently slide mussels and fish into broth. Bring broth back to a simmer, and cook, stirring once or twice to give mussels room to open, until mussels and fish are cooked through, 6 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide mussels and fish into warmed bowls. Pour soup over all, and scatter with fennel tops. Sprinkle with remaining teaspoon Pernod (skip Pernod if children are eating) and more olive oil. Serve immediately with crusty bread, if desired."}], "link": "https://cooking.nytimes.com/recipes/1018617-fish-soup-with-fennel-and-pernod"}