{"@context": "http://schema.org", "@type": "Recipe", "name": "Pecan-Raisin Rolls", "description": "These sweet yeasted breakfast buns may be prepared and refrigerated in muffin tins overnight so they are oven-ready after one last rise the next day.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/11/09/dining/09KITCH2/09KITCH2-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "12 rolls", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, snack, breads, pastries", "keywords": "cinnamon, golden raisins, light brown sugar, pecans, yeast", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 157}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 479, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "80 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "6 grams", "sodiumContent": "181 milligrams", "sugarContent": "48 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup/180 milliliters whole milk", "2 teaspoons dry active yeast", "2 tablespoons sugar", "1 teaspoon kosher salt", "1 egg plus 1 egg yolk, beaten", "1/2 cup/113 grams unsalted butter (1 stick), melted and cooled, plus butter for greasing muffin tins", "2 3/4 cups/425 grams all-purpose flour", "2 cups/360 grams light brown sugar", "1 teaspoon cinnamon", "1 cup/120 grams chopped pecans", "1 cup/150 grams golden raisins, soaked 30 minutes in warm water and drained", "Egg wash (see note)", "1 cup/100 grams granulated sugar", "1/2 teaspoon cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: Put milk in a mixing bowl and stir in yeast and sugar. Leave until mixture begins to bubble, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in salt, beaten egg and melted butter, then stir in flour until a rough dough forms. Knead dough until smooth, soft and satiny, about 5 minutes. Cover with plastic wrap and let rise until doubled, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a standard 12-muffin tin. Punch down dough and turn out onto a lightly floured surface. Roll out to a rectangle approximately 12 by 8 inches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: Mix together brown sugar, cinnamon, pecans and raisins. Sprinkle mixture evenly over rolled-out dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As if rolling up a carpet, roll dough tightly into a 12-inch-long cylinder. Cut into 12 equal pieces, about 3 ounces each. Set dough pieces flat side down into buttered muffin tin and paint each lightly with egg wash. (At this point, unbaked rolls may be wrapped in plastic and refrigerated overnight, to be baked the next day if you'd like.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Loosely cover muffin tin with plastic wrap and put in a warm place to rise. Let rolls rise until doubled, about 45 minutes. Paint rolls lightly with egg wash, place tin on a baking sheet and bake for 25 minutes, until tops of rolls are well browned. Remove from oven and let sit for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully invert hot muffin tin over a baking sheet. Use a fork if necessary to help remove rolls from tin. (Be careful: The hot caramelized sugar on rolls will cause a bad burn if dripped on skin.) If desired, make topping by combining sugar and cinnamon, and sprinkle rolls with the topping while still warm. Let rolls cool bottom side up on baking sheet."}], "link": "https://cooking.nytimes.com/recipes/1018401-pecan-raisin-rolls"}