{"@context": "http://schema.org", "@type": "Recipe", "name": "Onion Quiche", "description": "Tender, sweet bits of onion suffuse this classic, savory tart, which gets its brawny, salty tang from browned chunks of cured pork (lardons, pancetta or bacon), all bound with a nutmeg-flecked custard. It’s a dish that feels both delicate and rich, and makes a lovely lunch or brunch dish. You can make the dough up to 3 days ahead, and prebake the crust a day ahead. But the quiche is best served warm or at room temperature on the day you assembled and baked it. This recipe is part of <a href=\"https://cooking.nytimes.com/new-essentials-french-cooking\">The New Essentials of French Cooking</a>, a guide to definitive dishes every modern cook should master. <a href=\"https://store.nytimes.com/products/new-essentials-of-french-cooking\">Buy the book.</a>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/01/15/dining/DINING-QUICHE2/DINING-QUICHE2-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "breakfast, brunch, lunch, pies and tarts", "keywords": "bacon, gruyère, heavy cream, pancetta, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 213}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 589, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "3 grams", "proteinContent": "10 grams", "saturatedFatContent": "26 grams", "sodiumContent": "601 milligrams", "sugarContent": "7 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 cups/250 grams all-purpose flour, more as needed", "1 teaspoon kosher salt", "1/4 teaspoon sugar", "1 cup/225 grams unsalted butter (2 sticks), cold, cut in 1/2-inch cubes", "Scant 1/2 cup ice water, or as needed", "4 tablespoons unsalted butter", "1 tablespoon extra-virgin olive oil", "2 1/2 pounds onions (about 6 to 8 large), finely chopped", "1 1/2 tablespoons all-purpose flour", "2 ounces lardons, diced pancetta or bacon (about 1/2 cup)", "2 large eggs", "2/3 cup heavy cream", "1 teaspoon kosher salt", "1/4 teaspoon freshly ground black pepper", "1/4 teaspoon freshly grated nutmeg", "2 ounces Gruyère, shredded (about 1/2 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tart dough: In a food processor, pulse flour, salt and sugar to combine. Add butter, then pulse until lima-bean-size pieces form. Gradually drizzle water into mixture and pulse just to combine, adding more water by the tablespoon if dough doesn’t come together. Transfer dough to a lightly floured surface. Press it together into a ball, flatten into a disk and wrap in plastic. Refrigerate for at least 1 hour and up to 3 days. (If you don’t have a food processor, see Tip below.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While dough chills, cook the onions for the filling: In a 12-inch skillet over medium heat, melt 3 tablespoons butter and oil. Add onions and cook, stirring occasionally, until pale golden and liquid has been cooked off, about 1 hour. (If the onions start to get too dark, reduce the heat to low.) Stir in flour and cook for an additional 5 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a 9-inch tart pan. Take chilled dough out of plastic wrap and place on a floured surface. Roll dough into an 11-inch circle, drape over it over tart pan and press into bottom edges and down sides. Use a knife or rolling pin to cut off excess dough, then use your fingers to push dough 1/4-inch up past the edge of pan. Use a fork to poke evenly spaced holes in the bottom and sides of the dough and chill for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Place chilled tart on a baking sheet. Line with foil, fill with pie weights and bake for 15 minutes. Remove tart from oven and carefully remove foil and pie weights. Return tart to oven to continue baking, uncovered, until dough is just baked through and barely turning golden on the edges, about 5 minutes. Remove from oven and let cool to room temperature. Reduce oven temperature to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare lardons: Heat a medium, dry skillet over medium heat, then add lardons and cook until they start to brown, about 8 minutes. Use a slotted spoon to transfer to a plate lined with a paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk to combine eggs, cream, salt, pepper and nutmeg. Fold in onions, then half the Gruyère. Cube remaining 1 tablespoon butter into pea-size pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter cooked lardons over parbaked tart shell. Scrape egg and onion mixture into shell, smoothing top, and then scatter remaining Gruyère on top. Dot with butter pieces, then bake in a 375-degree oven until puffed and browned, 25 to 30 minutes. Let cool slightly, then remove tart ring from pan and slide quiche onto a wire rack. Serve warm or at room temperature."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Recipe: Onion Quiche", "description": "A savory tart of rich egg custard studded with cured meats or vegetables and baked in a pastry shell.", "thumbnailUrl": "https://static01.nyt.com/images/2017/01/15/dining/DINING-QUICHE2/DINING-QUICHE2-mediumThreeByTwo440.jpg", "uploadDate": "2017-01-18T17:52:15.000Z", "duration": "PT6M46S"}, "link": "https://cooking.nytimes.com/recipes/1018502-onion-quiche"}