{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemony Pasta With Chickpeas and Parsley", "description": "You can used either canned or home-cooked chickpeas in this take on the classic Italian dish pasta con ceci, which is an excellent, nutritious, quick-cooking dinner. But even more appealing is the way the soft earthiness of the chickpeas plays off the al dente pasta, coating it like a rich sauce but without a lot of fat. The whole dish is zipped up with some lemon, garlic and red pepper flakes.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/03/08/dining/08APPE4/08APPE4-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, for two, quick, weekday, pastas", "keywords": "chickpea, parmigiano-reggiano, parsley, pasta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1440}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1235, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "152 grams", "cholesterolContent": null, "fatContent": "50 grams", "fiberContent": "23 grams", "proteinContent": "49 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1299 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Kosher salt, as needed", "8 ounces regular or whole-wheat fusilli or other short, sturdy pasta", "2 cups cooked chickpeas, home-cooked or canned", "1/4 cup extra-virgin olive oil, plus more for drizzling", "2 garlic cloves, smashed and peeled", "1/2 onion, diced", "1 tablespoon finely chopped fresh rosemary leaves", "Pinch of red pepper flakes, plus more as needed", "1 1/2 cups chickpea cooking liquid (from a homemade pot; do not use the liquid from the can), vegetable stock or water", "3 cups fresh parsley leaves (from 1 large bunch)", "2/3 cup grated Parmigiano-Reggiano, plus more for serving", "1 tablespoon unsalted butter", "Finely grated zest of 1/2 lemon", "Ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of heavily salted water to a boil. Add fusilli and cook until it is just shy of al dente. (It should be slightly underdone to your taste because you’ll finish cooking it in the sauce.) Drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta is cooking, prepare the chickpea sauce: Place chickpeas in a large bowl and use a potato masher or a fork to lightly mash them; they should be about half-crushed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a 12-inch skillet over medium heat. Add garlic cloves and fry until they are golden brown, about 2 minutes. Stir in onions, rosemary, red pepper flakes and a pinch of salt. Cook, stirring occasionally, until onions are soft, about 10 minutes. Then stir in chickpeas and the cooking liquid, stock or water. Bring to a simmer and cook gently until most of the liquid has evaporated, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in pasta and parsley, and cook until the pasta has finished cooking and is coated in the sauce, 1 to 2 minutes. Quickly toss in cheese, butter, lemon zest, black pepper to taste and salt if needed. Drizzle with olive oil and shower with additional cheese before serving."}]}