{"@context": "http://schema.org", "@type": "Recipe", "name": "Mashed Potato Salad With Scallions and Herbs", "description": "Creamier than a classic potato salad, and chunkier and zestier than regular mashed potatoes, this hybrid dish can be served warm or at room temperature, when its texture is at its softest and best. (Never serve this cold; no one likes cold mashed potatoes.) The key to getting the right texture is to cook the potatoes a little more than you would for potato salad, but not so much that they completely fall apart. You are looking for chunks of potatoes coated in a fluffy layer of highly seasoned mashed potatoes. Potato salads tend to absorb their seasonings as they sit, so for the most flavorful dish, be prepared to add more salt, lemon juice and olive oil to taste just before serving.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/09/06/dining/06Appetite1/06Appetite1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, salads and dressings, vegetables", "keywords": "parsley, potato, rosemary, scallion, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 376}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 110, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "298 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds red potatoes, cut into 1 1/2-inch chunks", "Finely grated zest and juice of 1 lemon, plus more lemon juice for serving", "2 teaspoons minced fresh rosemary", "1 teaspoon fine sea salt, more as needed", "1 teaspoon coarsely ground black pepper", "Dash or two of hot sauce, to taste", "1/3 cup extra-virgin olive oil, more for drizzling", "2 tablespoons mayonnaise, sour cream or crème fraîche", "1 tablespoon Dijon or whole-grain mustard", "1/2 cup thinly sliced scallions (white and green parts)", "1/4 cup chopped parsley", "2 tablespoons chopped basil or dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the potatoes in a pot of well-salted water until they are very tender but not mushy, 15 to 22 minutes. Drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, whisk together lemon zest and juice, rosemary, salt, pepper and hot sauce. When the salt is dissolved, whisk in the olive oil, mayonnaise and mustard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potatoes to the bowl and mix them very well, until well coated with dressing. Then use the spoon to mash about a quarter of them. You want 1-inch (or so) chunks of potatoes coated in some mashed potatoes. Add scallions and parsley and toss well. Taste and add more salt, lemon juice, hot sauce and olive oil, if needed. Scatter chopped basil or dill over dressed potatoes. Serve warm or at room temperature, but not cold."}]}