{"@context": "http://schema.org", "@type": "Recipe", "name": "Cassoulet", "description": "This slow-cooked casserole of white beans and several kinds of meat has long been considered the pinnacle of regional French home cooking. It takes planning (you’ll need to find all the ingredients), time and a good deal of culinary stamina. But the voluptuous mix of aromatic beans surrounding rich chunks of duck confit, sausages, roasted pork and lamb and a crisp salt pork crust is well worth the effort. Serve this with a green salad. It doesn’t need any other accompaniment, and you wouldn’t have room for it, anyway. This recipe is part of <a href=\"https://cooking.nytimes.com/new-essentials-french-cooking\">The New Essentials of French Cooking</a>, a guide to definitive dishes every modern cook should master. <a href=\"https://store.nytimes.com/products/new-essentials-of-french-cooking\">Buy the book.</a>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/01/13/dining/COOKING-CASSOULET2/COOKING-CASSOULET2-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "12 servings", "recipeCuisine": "french", "recipeCategory": "dinner, project", "keywords": "bread crumbs, cannellini beans, duck leg, goose fat, kielbasa, lamb, pork, pork sausage, rosemary, salt pork, thyme, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 196}, "recipeIngredient": ["2 1/2 pounds bone-in pork stew meat, cut into 2-inch pieces", "2 1/2 pounds bone-in lamb stew meat, cut into 2-inch pieces", "2 1/2 teaspoons kosher salt", "9 garlic cloves, peeled, plus 3 grated or minced garlic cloves", "1/8 teaspoon ground cloves", "1 teaspoon freshly ground black pepper", "1 bay leaf, torn into pieces", "2 sprigs rosemary, torn into pieces", "2 sprigs thyme, torn into pieces", "1/2 cup/4 ounces duck fat, melted (or goose fat or lard, or a combination)", "1 pound dried Tarbais, flageolet, lingot, Great Northern or cannellini beans", "3 teaspoons kosher salt", "1 bouquet garni (3 sprigs Italian parsley, 3 sprigs thyme and 1 bay leaf, tied with kitchen string; see Techniques)", "1 stalk celery, halved", "1 large carrot, halved", "2 garlic cloves, peeled", "1/2 teaspoon freshly ground black pepper", "1 whole clove", "1/2 white onion, cut stem to root end", "8 ounces fully cooked French garlic sausage or kielbasa, skin removed and cut into chunks", "8 ounces salt pork", "1/4 cup duck fat (or goose fat, lard, a combination or olive oil), more as needed", "1 pound fresh pork sausage, pricked all over with a fork", "1 1/2 large onions, diced", "2 large carrots, diced", "2 celery stalks, diced", "9 garlic cloves, peeled", "3 cups tomato purée, from fresh or canned tomatoes", "Kosher salt, to taste", "4 legs duck confit, bought or homemade (see Techniques)", "1 1/2 cups panko, or other plain, dried bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The night before cooking, marinate the meat and soak the beans. For meat: In a large bowl, combine all ingredients except fat and toss to combine. Cover and refrigerate overnight. For beans: In a large bowl, combine beans, 1 teaspoon salt and enough cold water to cover by 4 inches. Cover and let sit overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, roast the meat: Heat oven to 325 degrees. Pour fat over meat in the bowl and toss to coat. Spread meat in one even layer on a rimmed baking sheet, leaving space between each piece to encourage browning (use two pans if necessary). Top meat with any fat left in bowl. Roast until browned, about 1 hour, then turn pieces, cover with foil, and continue to roast until soft, another 1 1/2 hours. Remove meat from baking sheet, then scrape up all browned bits stuck to the pan. Reserve fat and browned bits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the beans: Drain beans, add them to a large stockpot and cover with 2 inches water. Add bouquet garni, celery, carrot, 2 garlic cloves, 2 teaspoons salt and the pepper. Stick whole clove into the folds of the onion half and add that as well. Bring to a boil and then simmer over medium heat, stirring often, until beans are cooked through, 1 to 1 1/2 hours, adding garlic sausage after 30 minutes. When beans are cooked, remove bouquet garni and aromatics, including vegetables. Reserving cooking liquid, drain the beans and sausage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While beans are cooking, bring a medium pot of water to a boil and add salt pork. Simmer for 30 minutes, remove and let cool. Cut off skin, then slice pork into very thin pieces and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a very large skillet (at least 12 inches) over medium heat and add a drizzle of duck or other fat. Add fresh pork sausages and cook until well browned on all sides, about 20 minutes. Remove to a plate and reserve, leaving any sausage fat in skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In same skillet over medium-high heat, add 1/4 cup of the reserved fat and the browned bits from the roasted meat. Add diced onions, carrots and celery, and cook until softened, about 10 minutes. Add 9 whole garlic cloves and cook until fragrant, another 2 to 4 minutes. Add tomato purée, season with salt to taste, and simmer until thickened to a saucelike consistency, 5 to 10 minutes, if necessary. Add cooked beans and stir to combine. Remove from heat and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the cassoulet: Heat oven to 375 degrees. In a large Dutch oven, lay salt pork pieces in an even layer to cover the bottom of the pot. Add a scant third of the bean and garlic sausage mixture, spreading evenly. Top with half of the roasted meat pieces, 2 pork sausages and 2 duck legs. Add another scant third of the bean mixture, and top with remaining meat, sausages and duck legs. Top with remaining beans, spreading them to the edges and covering all meat. Pour reserved bean liquid along the edges of the pot, until liquid comes up to the top layer of beans but does not cover. Sprinkle bread crumbs on top and drizzle with 1/4 cup duck fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until crust is lightly browned, about 30 minutes. Use a large spoon to lightly crack the crust; the bean liquid will bubble up. Use the spoon to drizzle the bean liquid all over the top of the crust. Return to oven and bake 1 hour more, cracking the crust and drizzling with the bean liquid every 20 minutes, until the crust is well browned and liquid is bubbling. (The total baking time should be 1 1/2 hours.) Remove from oven and let cool slightly, then serve."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Recipe: Cassoulet", "description": "A casserole of aromatic beans baked slowly alongside cured and roasted meats, topped with crisp bread crumbs.", "thumbnailUrl": "https://static01.nyt.com/images/2017/01/13/dining/COOKING-CASSOULET2/COOKING-CASSOULET2-mediumThreeByTwo440.jpg", "uploadDate": "2017-01-18T16:34:22.000Z", "duration": "PT4M21S"}, "link": "https://cooking.nytimes.com/recipes/1018520-cassoulet"}