{"@context": "http://schema.org", "@type": "Recipe", "name": "Shaker Lemon Pie", "description": "Thanksgiving often coincides with the arrival of all kinds of great citrus, which is why the chef Elisabeth Prueitt, of Tartine in San Francisco, offered this take on a classic Shaker lemon pie. Traditionally made from whole lemons, this version also incorporates blood oranges and cardamom, and it’s a bright, welcome addition to the pecan and pumpkin desserts this time of year. Start it the day before by slicing the fruit and leaving it to sit in sugar overnight, then mix it with beaten eggs the next day. At home, Ms. Prueitt uses her tangy <a href=\"http://cooking.nytimes.com/recipes/1018414-cream-cheese-dough\">all-purpose cream cheese dough, which also happens to be gluten-free,</a> but you could use regular pie dough if you prefer. Baking the pan directly on the oven floor (or on a baking stone placed on the oven floor) helps ensure that it browns evenly.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2016/11/09/dining/09TARTINE9/09TARTINE9-articleLarge.jpg", "totalTime": "PT9H30M", "recipeYield": "1 9-inch pie", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "dessert, gluten-free, lemon, orange", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 151}, "recipeIngredient": ["2 medium lemons", "1 blood orange or navel orange", "2 cups/400 grams granulated sugar", "5 large eggs", "1/4 teaspoon salt", "3/4 teaspoon ground cardamom", "Cream cheese dough (<a href=\"http://cooking.nytimes.com/recipes/1018414-cream-cheese-dough\">see recipe</a>), or use regular pie dough", "Cornstarch or tapioca starch, for rolling dough", "1 tablespoon cream", "Confectioners' sugar, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mandoline or a sharp knife, slice lemons and orange paper-thin, discarding the thick, pithy ends and any seeds. Put in a glass bowl and toss with granulated sugar. Cover and let sit at room temperature for at least 8 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the pie dough: Place one dough disk on a surface lightly dusted with cornstarch or tapioca. Roll dough to 1/8 inch/3 millimeters thick, rolling from the center evenly out in all directions. If the dough is cracking and is not pliable, let it sit at room temperature a little longer to warm up. Dust with additional cornstarch as needed to discourage sticking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut out a circle 2 inches/5 centimeters larger than the pie pan. Carefully lift dough and transfer to pan, easing dough into the bottom and sides but not stretching or pressing too firmly, or it will shrink during baking. If dough tears, patch with a little extra dough, pressing gently to adhere. Trim dough, leaving a 1/4-inch overhang. Refrigerate for 15 minutes, and roll second dough disk in the same way."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If any seeds have floated to top of citrus mixture, fish them out. In a separate bowl, whisk eggs, salt and cardamom until blended, then add to the lemon mixture, mixing thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. If you have a baking stone, place it on the oven floor. Pour lemon filling into chilled shell, evenly distributing citrus pieces, and moisten the edge of the shell with water. Gently transfer upper crust onto the pie. Crimp the dough together using your fingers or a fork, and trim so it is flush with the edge of the pan and there is no overhang."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the top of the dough with the cream and chill for 20 minutes. Cut small vents in the top of the dough with a sharp knife, then place pie on baking stone or directly on the oven floor for 20 minutes. Transfer to a rack in the middle of the oven and bake another 30 to 40 minutes, until the top crust is golden brown and cooked through. Let cool before dusting with confectioners' sugar and serving."}], "link": "https://cooking.nytimes.com/recipes/1018415-shaker-lemon-pie"}