{"@context": "http://schema.org", "@type": "Recipe", "name": "Linzer Cookies", "description": "Lightly spiced, jam-filled linzer cookies (a smaller version of the classic linzer torte) are a traditional sandwich cookie with a tender texture and subtle nutty flavor that comes from finely ground almonds in the dough. As with sugar cookies, which benefit from the addition of frosting, the dough for a linzer does not need to be too sweet: It's filled with a tangy raspberry jam and finished with plenty of powdered sugar. A hole in the top of the cookie gives the signature stained-glass-window effect, making it one of the most effortless and impressive treats you could make this holiday season.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/12/18/dining/AR-linzer-cookies/merlin_148112754_848e3f58-b9f8-4a66-8181-d0533ff13cc2-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "About 2 1/2 dozen cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "almonds, cinnamon, eggs, flour, raspberry jam, sugar, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 468}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 228, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "6 grams", "sodiumContent": "84 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cups/435 grams all-purpose flour", "1 cup/155 grams raw, skin-on almonds (or 3/4 cup/75 grams almond flour)", "1 1/2 teaspoons ground cinnamon", "1 teaspoon baking powder", "1 teaspoon kosher salt", "1 1/2 cups/340 grams unsalted butter (3 sticks)", "1 1/4 cups/250 grams granulated sugar", "2 large eggs", "1 teaspoon vanilla extract", "1 cup/290 grams raspberry jam", "Powdered sugar, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulse together flour and almonds in a food processor until the almonds are very finely ground. Add cinnamon, baking powder and salt, and pulse to blend. (Alternatively, whisk together flour, ground almonds or almond flour, cinnamon, baking powder and salt in a large bowl.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer, beat butter and sugar together on medium-high until the mixture is light, fluffy and pale, 2 to 3 minutes. Scrape down the sides of the bowl and add in eggs, 1 at a time, beating well after each addition. Add vanilla extract, and beat until everything is well combined, again stopping to scrape down bowl as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add in dry ingredients all at once and mix on low speed, just until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough in 2 equal pieces, and wrap each piece in cling film, patting into a 1-inch-thick disk. Chill at least 2 hours, up to 5 days ahead."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Working with 1 disk at a time, roll out the dough between 2 sheets of parchment paper so it's about 1/8 inch thick. (Because of the almonds, the dough may crack in places while you’re rolling it out. This is O.K., just patch it up with scraps.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a round cookie cutter 2 1/2 inches in diameter, cut out as many circles as possible. Take half of these circles and cut out a 1-inch circle from the interior of the larger circles, creating a doughnut shape that will become the top of the cookie. If at any point the dough becomes too soft to cut and cleanly remove from parchment paper, slide it onto a cookie sheet and chill for a few minutes in the freezer or refrigerator. Gather any scraps of dough, combine them and roll them out, chilling as necessary. Transfer dough circles to a parchment-lined baking sheet spaced 1 inch apart and bake until the edges are golden brown, 12 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the linzer cookies, spread about a teaspoon of raspberry jam onto the flat sides of the larger circles. Dust the tops of the cutout circles with powdered sugar and place on top of raspberry jam."}], "link": "https://cooking.nytimes.com/recipes/1018385-linzer-cookies"}