{"@context": "http://schema.org", "@type": "Recipe", "name": "The Best Fried-Eggplant Sandwich", "description": "In the spring of 2016, my most favorite sandwich was fried eggplant, mozzarella and roast beef on an Italian hero, with hot peppers and a slash of mayonnaise. I adapted the recipe from a sandwich served at Defonte’s Sandwich Shop, on Columbia Street in Red Hook, Brooklyn. It is a beautiful torpedo of food, crunchy, silken, sweet and spicy all at once. You can certainly omit the roast beef to make it vegetarian or at any rate a little smaller, the sort of meal that offers satisfaction without hurting anyone, that delivers deliciousness at a lower cost to the body that consumes it. It is still a colossal feed. It is still the best sandwich.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/05/01/magazine/01eat1/01eat1-articleLarge-v2.png", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "italian", "recipeCategory": "sandwiches", "keywords": "cherry peppers, eggplant, mozzarella, roast beef", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 308}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1005, "unsaturatedFatContent": "60 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "84 grams", "fiberContent": "10 grams", "proteinContent": "28 grams", "saturatedFatContent": "21 grams", "sodiumContent": "1249 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 smallish Italian eggplants, roughly 1 1/2 pounds total", "2 tablespoons kosher salt", "1 cup extra-virgin olive oil", "4 large eggs", "2 tablespoons grated Parmesan cheese", "4 hero rolls", "2 to 3 tablespoons mayonnaise", "8 ounces fresh mozzarella cheese, cut into thin slices", "8 ounces sliced cooked roast beef (optional)", "1 cup hot cherry peppers, or to taste, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large, rimmed sheet pan with paper towels. Trim stem end from eggplants, then peel and discard skin. Using a knife or a mandoline, slice the eggplant lengthwise into 3/16-inch-thick slabs. Arrange eggplant in a single layer on a baking sheet. Sprinkle both sides of eggplant with salt. Let stand for approximately 10 to 15 minutes. Pat eggplant dry with paper towels, and stack on a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard the wet paper towels, and replace them in the sheet pan with more, then place a wire rack on top. In a large, deep skillet, heat the oil over medium-high heat until it is shimmery. Working in batches, fry the eggplant slabs until just tender, approximately 30 to 40 seconds per side. Transfer fried eggplant to rack to drain. Remove skillet from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together eggs and grated Parmesan. Return the skillet to the stove over medium-high heat until the oil is hot again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches, dip drained eggplant into egg batter, then fry in oil until puffed, lightly golden and cooked through, approximately 2 to 4 minutes per batch. Transfer fried eggplant to rack to drain. You can cook the eggplant in advance of assembling sandwiches. Covered, it will keep in the refrigerator for a few days, though the eggplant is best at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble sandwiches. Cut the hero rolls open, then spread each one with mayonnaise. Layer the slices of eggplant onto the bread in equal portions, and top with equal portions of the mozzarella and the sliced roast beef. Add slices of hot cherry peppers to taste, fold the sandwich together and serve."}]}