{"@context": "http://schema.org", "@type": "Recipe", "name": "New York Deli-Style Rye Bread", "description": "American \"deli rye\" is descended from traditional breads in Middle and Eastern Europe, where rye and wheat grow together and \"bread spice\" (a combination of caraway, coriander, anise and fennel seeds) is common.  This kind of rye bread spread across the United States in the 20th century along with Jewish delicatessens, where it served as the perfect foil for rich fillings like pastrami and chopped liver -- not to mention tuna melts. The sour tang and chewy texture of the original breads have largely been lost over time, because rye bread today is made mostly from wheat flour and just a scant amount of rye. This recipe restores some of the original charm, but is still quick and easy for home baking.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/01/11/dining/11JPRYE8/11JPRYE8-articleLarge-v2.jpg", "totalTime": "PT4H30M", "recipeYield": "1 large loaf", "recipeCuisine": "", "recipeCategory": "breads", "keywords": "rye", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 137}, "recipeIngredient": ["2 cups/310 grams bread flour", "1 cup/155 grams light rye flour", "2 teaspoons/6 grams caraway seeds (optional)", "2 teaspoons/10 grams kosher salt", "1 1/2 teaspoon/5 grams active dry yeast", "2 teaspoons honey", "2 teaspoons flavorless vegetable oil, such as grapeseed or canola", "1 teaspoon cornstarch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a standing mixer, whisk together the flours, caraway seeds (if using), salt and yeast. Put 1 1/4 cups lukewarm water into a small bowl, then stir in the honey and oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a dough hook attachment at low speed, gradually pour in the liquid mixture. Mix just until a cohesive dough starts to form and no streaks of dry flour remain, about 2 minutes. Scrape down sides of the bowl halfway through. Cover bowl tightly with plastic wrap and let dough rest for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn mixer to medium-low and knead until smooth and elastic, easily clearing the sides of the bowl, about 8 minutes. The dough should be moist but not sticky; if needed, add more flour 1 tablespoon at a time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil a medium-size mixing bowl. Transfer the dough to a lightly floured surface and knead 30 seconds, shaping dough into a smooth round ball. Place seam side down in the oiled bowl. Cover with plastic wrap and let rise until doubled in size, 1 1/2 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stack 2 rimmed baking sheets and line the top sheet with aluminum foil. Punch the dough down to deflate. Turn out onto a lightly floured surface. Press and stretch into a rough 6-inch square."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lift and fold top 2 corners of dough into the center of the square and press gently to seal. Lift and fold down the upper third of the dough toward the center and press gently to seal. Lift and fold down the top half of the dough to form a loaf, and pinch the seam closed. Turn the loaf seam side down, gently slide hands underneath, and transfer to the prepared pan. You should have an oval loaf about 8 inches by 4 inches; use hands to shape as needed. Cover with oiled plastic wrap and let rise until loaf increases in size by about half, 30 minutes to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place a rack in the lower third of oven and heat to 450 degrees. When the dough has risen, make 3 deep slashes across the top, using a sharp paring knife or razor blade. Place in oven, reduce heat to 375 degrees and bake until deep golden brown, 35 to 40 minutes, rotating pan once during baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, dissolve cornstarch in 1 cup cold water. Simmer in saucepan or microwave until clear and syrupy. Transfer hot, baked bread immediately to a wire rack and brush top and sides with cornstarch mixture until glazed and shiny. Let cool completely before slicing."}]}