{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramelized Winter Squash With Pumpkin Seed Persillade", "description": "This method of flame-roasting a whole winter squash, just as you would roast a bell pepper, comes from the San Francisco chef Dominique Crenn. Surprisingly, the skin becomes soft, smoky and entirely edible. (The dish can also be made with squash chunks: see note at the end of the recipe.)\n\nCaramelizing the fragrant mash at the last minute brings out the sweetness and smoke, and a fresh herb sauce brings it back to earth. The pumpkin seeds in the garlicky, green sauce, or persillade, echo the flavors of the squash.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/02/15/dining/15CRENN4/15CRENN4-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "bread crumbs, pumpkin seeds, sage, winter squash, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 284, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "8 grams", "proteinContent": "4 grams", "saturatedFatContent": "3 grams", "sodiumContent": "540 milligrams", "sugarContent": "27 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 to 4 pounds (about 2) whole winter squash, such as butternut, banana or Hubbard (see note)", "1/3 cup sage leaves, loosely packed", "2/3 cup parsley leaves, loosely packed", "Zest of 1 lemon, freshly grated", "2 tablespoons toasted pumpkin seeds", "1 large garlic clove", "Extra-virgin olive oil", "Salt", "Raw sugar or maple syrup", "2 tablespoons unsalted butter", "1 cup coarse bread crumbs, preferably sourdough"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees, or heat a gas grill to high. Line a rimmed sheet pan with foil, parchment paper or silicone baking mats. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Over a gas burner or on a grill, char the squash until skin is blackened and blistered, turning with tongs as if roasting a bell pepper. (Depending on size, this will take about 15 minutes.) Transfer squash to the prepared pan and bake until flesh and skin are soft, about 45 minutes. When cool enough to handle, use paper towels to rub off most of the blackened skin. Cut open. Use a knife or fingers to cut into chunks, discarding any tough pieces of skin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the persillade: Using a large knife or small food processor, finely chop the herbs, zest and pumpkin seeds together. Transfer to a bowl or container. Crush or grate the garlic clove and add to the herb mixture. Pour in olive oil to cover and stir. Taste and add salt as needed. Set aside until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the optional bread crumbs: In a medium skillet over medium heat, melt the butter. Stir in the bread crumbs and toast, raising the heat if necessary, until golden and crunchy, 3 to 4 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cooked squash in a bowl, drizzle with olive oil, salt and a pinch of sugar or drizzle of syrup. Using your hands or a pair of forks, toss roughly, breaking the pieces up into a rough, chunky mass. Season to taste and transfer to an ovenproof skillet or a sheet pan. (Recipe can be made up to this point and held at room temperature up to 4 hours in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before serving, place the squash on lowest rack of oven and heat the broiler. When hot, raise the pan and broil until lightly charred on top. Use a spatula to place a serving on each plate, charred side up. Spoon the sauce around or over squash. Sprinkle with bread crumbs, if using, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1018577-caramelized-winter-squash-with-pumpkin-seed-persillade"}