{"@context": "http://schema.org", "@type": "Recipe", "name": "Buttermilk-Biscuit Shortcakes With Strawberries", "description": "Making biscuits is a combination of technique, faith and magic. You pull the dough together with your hands, pass through a stage where only a belief in the baking gods keeps you from ditching the mess and then, presto chango, the dough smoothes, and the oven’s heat makes them rise tall and beautiful. These biscuits are sweeter than most, because they’re meant to be shortcakes topped with berries and cream. (For a savory biscuit, use just 1 teaspoon sugar and omit the citrus zest, if you’d like.) Although they’re best soon after they’ve come from the oven, here’s a baker’s trick that makes biscuits a convenience food: Freeze the cut-out dough. When you’re ready to bake, let the pucks sit out to warm a bit while you preheat the oven; give them an extra minute or two of baking time if you think they need it.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2017/04/30/magazine/30desserts/30desserts-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "butter, buttermilk, orange, strawberries, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 243}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 264, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "8 grams", "sodiumContent": "253 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 hibiscus tea bag (like Red Zinger)", "1/3 cup (80 ml.) boiling water", "2 tablespoons sugar", "1 fat strip orange, lemon or lime zest", "1 pound (about 25) strawberries, hulled and coarsely chopped", "3 tablespoons sugar", "Finely grated zest of 1 orange, lemon or lime", "2 cups (272 grams) all-purpose flour", "1 tablespoon baking powder", "1/2 teaspoon fine sea salt", "1/4 teaspoon baking soda", "6 tablespoons (85 grams) very cold unsalted butter, cut into small pieces", "3/4 cup cold buttermilk", "1 pound (about 25) strawberries, hulled and halved from top to bottom", "1 tablespoon sugar", "1 cup (240 ml.) heavy cream", "2 tablespoons confectioners’ sugar", "1 teaspoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the saucy berries: Steep the tea bag in boiling water for 5 minutes; pour the tea into a medium pot. Mix in the sugar, zest and berries, and cook, stirring, until the syrup bubbles exuberantly and the berries soften, about 5 minutes. Scrape into a bowl, discard zest and let cool while you make the biscuits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the biscuits: Heat the oven to 400, and line a baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the sugar and zest in a large bowl, and rub them between your fingertips until the sugar is moist and aromatic. Add the dry ingredients, and stir with a fork to blend. Drop in the butter, toss it around with your fingers until it’s coated with flour and then press and pinch until you’ve got pea-size pieces of butter and flakes like oatmeal. Make a well in the center, pour in the cold buttermilk and turn and stir with a fork until the dough forms moist curds and clumps. Some dry crumbs may remain in the bottom of the bowl — don’t fuss with them now. Reach in with your hands, and knead gently, folding the dough on itself about 8 times, until it forms a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust the counter lightly with flour, turn out the dough, dust the top and roll to a scant 1/2-inch thick. (Size and shape don’t matter.) Using a 2-to-2 1/2-inch biscuit or other cutter, cut rounds as close to one another as possible. Cut in a quick up-and-down movement — if you twist the cutter, you’ll impede the biscuits’ rise and their flakiness. Arrange 2 inches apart on the baking sheet. Gather the scraps together, reroll and cut more biscuits, knowing that these scrappers may not rise as high as those in the first round."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the biscuits for 16-18 minutes, or until they’re tall and golden; transfer to a cooling rack. Use the biscuits when they’re warm or at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the topping: Toss the berries and sugar together; leave on the counter, stirring now and then, while you whip the cream. Using a mixer, beat the cream just until it begins to thicken, then whip in the confectioners’ sugar and vanilla. Don’t overbeat — soft cream is good here."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble: Pull apart each biscuit along a natural flake line, and place the bottoms on plates. Top each with a spoonful of saucy berries, cream and then sugared berries. Decide what to do with the other half of each biscuit: Lean it up against the shortcake; place it at a jaunty angle on top of each shortcake; make another shortcake with it; or tuck it away to toast in the morning."}], "link": "https://cooking.nytimes.com/recipes/1018743-buttermilk-biscuit-shortcakes-with-strawberries"}