{"@context": "http://schema.org", "@type": "Recipe", "name": "Meatloaf With Moroccan Spices", "description": "This recipe is from \"A Meatloaf in Every Oven,\" by Frank Bruni and Jennifer Steinhauer, who say it was the invention of a friend, Anne Kornblut. The plethora of spices and large amounts of garlic may seem overwhelming, but ground meat has a deep tolerance for seasoning and is usually improved by it. The fresh herbs are a foil for all the rich seasonings, and the vegetables give the loaf an especially lovely texture.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2017/02/08/dining/08MEATLOAF3/08MEATLOAF3-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "6 generous servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "ginger root, ground lamb, whole-wheat bread crumbs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 196}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 746, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "54 grams", "fiberContent": "6 grams", "proteinContent": "37 grams", "saturatedFatContent": "19 grams", "sodiumContent": "820 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil, more as needed", "1 medium onion, diced (about 1 cup)", "12 garlic cloves, minced", "1 to 2 medium stalks celery, diced (about 1/2 cup)", "1 large carrot, diced (about 1/2 cup)", "3 inches fresh ginger root, peeled and minced (about 1/3 cup)", "2 tablespoons ground cumin", "2 tablespoons smoked paprika", "1 tablespoon ground coriander", "1 tablespoon ground cinnamon", "1 teaspoon salt", "7 tablespoons tomato paste", "1/2 cup chopped fresh cilantro leaves", "1/2 cup chopped fresh mint leaves", "1/2 cup chopped fresh parsley leaves", "2 eggs, lightly beaten", "1 cup whole-wheat bread crumbs", "2 pounds ground lamb", "1/2 cup pine nuts toasted in a 350-degree oven until fragrant and golden brown (about 5 to 7 minutes)", "1 cup plain full-fat Greek-style yogurt", "3 tablespoons fresh lemon juice (from about 1 lemon)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Heat olive oil in a large pan over medium heat, then add the onions. Cook, stirring occasionally, for 5 minutes. Add the garlic and stir for another minute or two. Add the celery, carrots and ginger, and cook for about 5 minutes, adding more olive oil as needed to make sure ingredients are well coated and softening."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the spices: cumin, smoked paprika, coriander, cinnamon and salt, stirring well to mix. (You can alter spices to your liking, with more or less of those recommended or adding curry powder, nutmeg, allspice, black or cayenne pepper.) Add the tomato paste and cook for another 5 minutes, stirring well and scraping the bottom of the pan with a spatula to ensure the spices don’t burn. Once mixture is cooked, remove pan from heat and let cool for about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine in a large bowl the fresh herbs (cilantro, mint and parsley) and the eggs and bread crumbs. Add the ground lamb and the cooled mixture. Mix well with clean hands, until all ingredients are blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the mixture into a 9-by-5-inch loaf pan and cover with aluminum foil. Create a water bath by placing the loaf pan into a larger baking pan and filling the larger pan halfway with lukewarm water. (This helps keep the meatloaf moist by keeping the temperature more even during baking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the meatloaf, in the bath, into the oven and cook for about 1 hour 30 minutes. After an hour, check the meatloaf, and remove the foil if you would like a firmer top. Bake until internal temperature reaches 140 degrees. (This is a good time to toast the pine nuts if you’re making the sauce.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pans from the oven, lift the loaf pan out of the water bath, and let the meatloaf cool for at least 5 minutes. If there is excessive grease, carefully pour that out and discard it. Serve warm, at room temperature, or cooled, depending on your taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you're making the sauce, mix the yogurt, lemon juice and pine nuts together with a spoon, and serve in a small dish on the side."}], "link": "https://cooking.nytimes.com/recipes/1018555-meatloaf-with-moroccan-spices"}