{"@context": "http://schema.org", "@type": "Recipe", "name": "Gefilte Fish", "description": "If you loathe gefilte fish, that staple of the Seder, it may just be that you've never had it homemade. In this recipe, created to convert gefilte fish skeptics, the traditional patties are updated with more flavorful fish, and then poached in court-bouillon — that is, a light vegetable broth. Be sure to use a wide pot here; the patties rise to the top as they cook, and you want to give them enough space.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2016/04/13/dining/13GEFILTE/13GEFILTE-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "About 20 patties", "recipeCuisine": "eastern european, jewish", "recipeCategory": "finger foods", "keywords": "appetizer, side dish, carp, fennel, matzo meal, pike, salmon, striped bass, trout, whitefish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 276}, "recipeIngredient": ["2 medium yellow onions, peeled", "2 celery stalks", "3 large carrots, peeled", "1 fennel bulb", "6 black peppercorns", "2 1/2 teaspoons salt, or to taste", "1 1/2 pounds boneless, skinless salmon, whitefish or striped bass fillets, cut into 2-inch pieces", "1/2 pound boneless, skinless trout, pike or carp (or a mixture of two), cut into 2-inch pieces", "10 chives", "3 tablespoons chopped parsley, tarragon, dill and/or a combination", "3 large eggs, lightly beaten", "1 tablespoon vegetable oil", "4 to 6 tablespoons matzo meal", "1/2 teaspoon ground black pepper", "1 head radicchio or endive, or both, for serving", "Prepared horseradish, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large, wide pot with 10 cups of water and place over high heat. While bringing to a boil, coarsely chop and add to the pot 1 onion, 1 celery stalk, 1 carrot and the fennel bulb. Add the peppercorns and 1 teaspoon salt. Once water is boiling, reduce the heat and simmer, uncovered, while preparing the fish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely chop the remaining onion, celery stalk and 1 carrot, then pulse in a food processor until finely chopped. Add fish, chives and 2 tablespoons parsley, tarragon and/or dill, and keep pulsing until fish is chopped but not mushy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Move the fish mixture to a medium bowl and add eggs, oil, matzo meal, 1 1/2 teaspoons salt (or more to taste) and the ground black pepper, and mix well with your hands."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put your hands in a bowl of cold water. Using your hands, mold the fish mixture into a 3- by 2-inch oval patty (about 2 ounces) and gently place on a platter. Repeat with the remaining fish mixture, dipping your hands in water as needed.   "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pop the third carrot into the simmering broth and gently add the patties to the pot. Cover and cook for about 20 minutes until patties are firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a slotted spoon to remove the fish and carrot from the poaching liquid to cool on a plate. Slice the carrot diagonally into thin rounds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place each patty on a leaf of radicchio or endive or both. Set the sliced carrot rounds on top of each patty. Garnish with the remaining tablespoon of fresh herbs and serve warm or at room temperature with horseradish, preferably homemade. If making a day ahead, refrigerate, covered, then return the patties to room temperature before serving."}], "link": "https://cooking.nytimes.com/recipes/1018051-gefilte-fish"}