{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Sweet Peppers With Tuna, Bulgur and Herbs", "description": "Small, sweet bell peppers (also called mini peppers) in shades of red, orange and green make attractive vessels for stuffing. In this recipe, adapted from the home cook Meline Toumani, they’re roasted until caramelized, then filled with a mixture of bulgur, tuna, herbs and capers for brightness. Offer these to nibble with cocktails when you’re feeding a crowd, or serve them with a salad and some warm pita bread for a light but highly flavorful supper for a smaller group. Be sure to use the best-quality tuna you can get here; tuna packed in olive oil (rather than water or other types of oil) is generally richer and better tasting.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/10/18/dining/18appetite1/18appetite1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "mediterranean, turkish", "recipeCategory": "finger foods", "keywords": "appetizer, main course, bell pepper, bulgur, jalapeño, tuna", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 162}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 356, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "7 grams", "proteinContent": "16 grams", "saturatedFatContent": "3 grams", "sodiumContent": "820 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds sweet small bell peppers, cored (about 24)", "6 tablespoons olive oil, more as needed", "1 1/4 teaspoons fine sea salt, more as needed", "1 cup medium or coarse bulgur", "1 tablespoon tomato paste", "1 teaspoon ground cumin", "2 cups chicken or vegetable stock or water", "1/2 cup diced celery", "1/2 cup diced onion", "1/2 cup diced green bell pepper", "1 medium or 2 small jalapeños, seeded and minced", "2 cloves garlic, minced", "2 chopped anchovy filets (optional)", "Black pepper, to taste", "1 (5- to 7-ounce) jar of tuna packed in olive oil, drained", "2 tablespoons mayonnaise or plain Greek-style yogurt", "2 tablespoons lemon juice, more to taste", "1/3 cup chopped cilantro", "1/3 cup chopped fresh parsley, mint or dill (or a combination), more for garnish", "2 1/2 tablespoons capers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. On a rimmed baking sheet, toss peppers with 1 1/2 tablespoons oil and 1/4 teaspoon salt. Roast, stirring once or twice, until peppers are tender, 15 to 22 minutes. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium pot, heat 1 tablespoon oil over medium heat. Add bulgur and toast, stirring, until it smells nutty, about 3 minutes. Add tomato paste, cumin and 1 teaspoon salt, and sauté until tomato paste darkens, 1 to 2 minutes. Pour in stock or water and bring to a boil. Lower heat and simmer until bulgur is soft all the way through, 15 to 20 minutes. Drain off any remaining liquid and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large skillet over medium-high heat. Add 1 tablespoon oil and heat until shimmering. Add celery and sauté until just beginning to soften, about 3 minutes. Add onion, green bell pepper, jalapeño, garlic and anchovies (if using). Sauté until vegetables are just tender but not soft (a little texture is welcome), 4 to 6 minutes. If mixture begins to stick to the bottom of the pan, add a tablespoon or two of water. Season with salt and pepper to taste. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put tuna in a large bowl and use a fork to break into chunks. Add remaining 2 1/2 tablespoons oil, mayonnaise (or yogurt) and lemon juice and mash until tuna is broken into small flakes. Mix in onion-celery mixture, bulgur, herbs and capers and stir well. Taste and add more salt, pepper and/or lemon juice as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a slit lengthwise down each pepper to open it up. Stuff the bulgur mixture into the open peppers, then pinch the peppers so that the stuffing holds the two sides together. (It's O.K. if the peppers aren't completely closed.) Arrange on a platter, sprinkle with lemon juice and garnish with herbs. Serve immediately or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1018962-stuffed-sweet-peppers-with-tuna-bulgur-and-herbs"}