{"@context": "http://schema.org", "@type": "Recipe", "name": "Crisp Toffee Bars", "description": "The original recipe for these buttery, basic toffee bars belongs to Maida Heatter, the great American dessert maven of the 20th century. It was adapted for a cast-iron skillet by Charlotte Druckman, who wrote a book on cast-iron baking in 2016. “You can caramelize a crust in cast iron in a way that would never happen in a sheet pan,” she said. Make sure to bake the bars until very well browned across the top; that is the sign that the desired level of crisp chewiness has been achieved. The recipe calls for adding either nuts or chocolate to dough; you can add both if you like, but in that case use a larger cast-iron skillet (or use a plain old 9-by-13-inch baking pan).", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/06/29/dining/29CASTIRON-WEB7/29CASTIRON-WEB7-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 2 dozen bars", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "dark brown sugar, slivered almonds, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 233}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 172, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "6 grams", "sodiumContent": "53 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 sticks/225 grams unsalted butter, cold but not frozen, more for buttering the pan", "1/2 teaspoon salt", "1 teaspoon vanilla extract", "1 cup/210 grams soft-packed dark brown sugar", "2 cups/240 grams unbleached all-purpose flour", "1 cup/100 grams slivered or sliced almonds (or walnut pieces), toasted, or 6 ounces/170 grams chocolate chips or small chunks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Place a rack in the middle and place a 10-inch cast-iron skillet on it.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, beat butter on low speed for about a minute, until softened. Scrape down the bowl and the paddle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer running at low speed, add salt and vanilla. Add the brown sugar, then turn the speed up to medium and beat until mixture is the color of peanut butter and fluffy, 1 to 2 minutes. Scrape down the bowl again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer running at low speed, shake in flour, beating just until dough holds together. Mix in nuts or chocolate just until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the hot skillet from the oven and place a small lump of butter in it. As butter melts, brush it onto the bottom and sides of the pan until evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dump dough into skillet and press it out to evenly fill the skillet. You can use your fingers (being careful to avoid touching the hot pan), a potato masher or the bottom of a measuring cup. Press dough down firmly to make a compact, even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to oven and bake for 30 to 40 minutes, until the top is walnut brown. You may be tempted to take it out when the edges have begun to darken, but let it continue to cook so the entire surface can take on that color. There may be bubbles visible on top of the dough; that’s a good sign."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and let cool in the pan. If necessary, run a butter knife around the sides of the pan to loosen. Square off the circle shape of the pan by cutting the four rounded edges off; you will have an approximately 9-inch square. Cut the square into bars, squares or diamonds. (The rounded edges can be chopped or crumbled and used as an ice cream topping.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the bars cool completely before removing from pan. Use a small spatula or butter knife to transfer them to paper towels to blot the buttery bottoms. Store in airtight container; they keep well for up to 1 week."}], "link": "https://cooking.nytimes.com/recipes/1018198-crisp-toffee-bars"}