{"@context": "http://schema.org", "@type": "Recipe", "name": "Charred Asparagus With Green Garlic Chimichurri", "description": "Chimichurri is the South American green herb sauce that goes with just about everything. Easy to put together, it tastes best freshly prepared. When green garlic is in season in spring and early summer, use that; or substitute 2 or 3 regular garlic cloves at other times of the year. To keep it green and fresh tasting, add the vinegar just before serving. Char the asparagus in a hot cast-iron skillet or griddle, over hot coals, or under the broiler. Pencil-thin asparagus cooks quite quickly this way, but medium-size spears may be substituted.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/04/26/dining/26KITCHEN1/26KITCHEN1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, quick, weekday, vegetables", "keywords": "appetizer, side dish, asparagus, feta, green garlic, olives, parsley, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 353}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 358, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "8 grams", "sodiumContent": "446 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["3 tablespoons finely chopped green garlic", "1/2 cup finely chopped parsley", "2 teaspoons finely chopped fresh oregano or 1 teaspoon dried oregano", "1/2 cup extra-virgin olive oil, plus more for drizzling", "Salt and pepper", "1 pound pencil-thin asparagus, tough ends snapped off", "1 tablespoon red wine vinegar", "4 ounces crumbled feta", "Handful of olives", "Crushed red pepper, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a cast-iron pan or broiler, or prepare a charcoal grill. Make the chimichurri sauce: In a small bowl, stir together chopped green garlic, parsley, oregano, olive oil and 1/4 cup water. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread asparagus on a baking sheet, drizzle very lightly with oil and sprinkle with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer asparagus to hot cast-iron pan or to a grill grate that is placed very close to live coals; alternatively if broiling, place pan as close to broiler element as possible. Let asparagus cook for 4 to 5 minutes, until nicely charred, with a few burnt and blistered spots. Asparagus cooked this way tastes best if slightly undercooked and still bright green."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put cooked asparagus on a platter. Stir vinegar into chimichurri and spoon sauce generously over spears. Top with crumbled feta and olives, then sprinkle with crushed red pepper and serve."}], "link": "https://cooking.nytimes.com/recipes/1018734-charred-asparagus-with-green-garlic-chimichurri"}