{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked French Toast With Oat Crumble Topping", "description": "The beauty of a baked French toast casserole is that you can prepare it entirely in advance, usually the night before you want to serve it, then pop it into the oven about 45 minutes before you’re ready to eat. This version combines toasted challah with a nutmeg-flavored custard, which is then topped with a crunchy oat crumble. Pears add a ripe and juicy note to the dish, but if you’d rather go fruitless, you can leave them out. The finished dish is sublime served with vanilla-honey syrup drizzled on top, but it is also excellent with maple syrup.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/12/22/dining/22CHALLAH-FRENCHTOAST/22CHALLAH-FRENCHTOAST-articleLarge-v2.jpg", "totalTime": "PT5H30M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, casseroles", "keywords": "brioche, challah, eggs, honey, oats, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 298}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 413, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "11 grams", "sodiumContent": "358 milligrams", "sugarContent": "26 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["9 cups/455 grams challah, brioche or other soft bread cut in 1-inch cubes, preferably day old (from a large, 1-pound loaf)", "Butter, for the baking dish", "8 large eggs", "1 1/2 cups/355 milliliters whole milk", "1/2 cup/118 milliliters heavy cream or crème fraîche", "1/4 cup/60 milliliters honey", "1 tablespoon vanilla extract", "1/2 teaspoon freshly grated nutmeg", "1/2 teaspoon ground cardamom", "1/4 teaspoon fine sea salt", "1/2 cup/63 grams all-purpose flour", "1/3 cup/30 grams rolled oats (or use chopped nuts or sliced almonds)", "1/3 cup/67 grams light brown sugar", "2 teaspoons ground cinnamon", "1 teaspoon ground ginger", "1/2 teaspoon fine sea salt", "1/2 cup/114 grams cold unsalted butter (1 stick), cut into cubes", "1 large or 2 small pears, peeled or unpeeled as desired, cored and diced into 1/4-inch pieces (optional)", "1/2 cup/118 milliliters good honey", "1 vanilla bean, split lengthwise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Spread bread cubes out and toast until lightly golden, 7 to 15 minutes. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously butter a 2-quart casserole dish or 9- by 13-inch baking dish and fill with bread cubes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, whisk together eggs, milk, cream, honey, vanilla, nutmeg, cardamom and salt until smooth. Pour over bread, tossing well. Press down on bread so it forms an even layer that is mostly submerged in custard. Cover and refrigerate for at least 4 hours and preferably overnight (or up to 48 hours ahead)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the topping: In a large bowl, stir together flour, oats, brown sugar, cinnamon, ginger and salt. Using your fingers or a pastry blender, cut in the butter until the mixture is crumbly. You can also pulse the topping ingredients together in a food processor if you’d rather. (The topping can be prepared up to 48 hours in advance; store covered in the refrigerator until needed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread diced pears, if using, evenly over the top of the bread, then cover with crumble mixture. Bake until golden and firm, 40 to 50 minutes. If you’d like a crunchier crust, broil for the final 1 to 2 minutes. Or leave the topping softer; it’s good both ways."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the syrup, if desired: In a small saucepan, combine honey and 1 to 2 tablespoons water, depending upon how thick you want the syrup to be. Using a paring knife, scrape the seeds from the vanilla bean and add seeds to the pot. Bring to a simmer, then turn off the heat and let the vanilla infuse for at least 10 minutes. (Syrup can be made up to 1 week ahead.) Serve the French toast warm with the honey-vanilla syrup, or maple syrup."}], "link": "https://cooking.nytimes.com/recipes/1018482-baked-french-toast-with-oat-crumble-topping"}