{"@context": "http://schema.org", "@type": "Recipe", "name": "Mashed Eggplant With Capers, Scallions and Parsley", "description": "Summer is the perfect time to adopt the Mediterranean custom of serving savory little room temperature dishes for casual nibbling, referred to as mezze throughout the Middle East. An assortment of mezze can precede a larger feast, served as appetizers, or you may make an informal meal of mezze, picnic-style, indoors or out. This lemony Turkish-style eggplant dip fits the bill beautifully, spread on baguette toasts or crisp pita bread.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/07/27/dining/27KITCH1-WEB/27KITCH1-WEB-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "middle eastern, turkish", "recipeCategory": "dips and spreads", "keywords": "appetizer, capers, eggplant, pomegranate molasses, scallion, yogurt, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 104}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 86, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "5 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "416 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup large capers, preferably salt-packed", "2 pounds medium eggplants", "Salt and pepper", "Extra-virgin olive oil", "1 cup thinly slivered scallions, plus more for garnish", "1 cup chopped parsley, plus more for garnish", "1/2 teaspoon grated garlic", "1 teaspoon lemon zest", "3 tablespoons lemon juice", "2 tablespoons pomegranate molasses", "2 tablespoons yogurt", "1 pinch cayenne", "Baguette toasts or pita bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the capers in a bowl and rinse off salt thoroughly with lukewarm water. Soak rinsed capers in lukewarm water for 20 minutes. Drain and rinse again, then blot dry. Chop roughly and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Peel eggplants and cut into 1-inch cubes. Toss cubes in a mixing bowl with salt and pepper, then drizzle with 3 tablespoons olive oil and toss to coat. Place on a baking sheet in one layer and roast uncovered for 15 to 20 minutes, or until golden and tender when pierced with a fork. Cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put cooked eggplants in a food processor and pulse briefly. Add capers, scallions, parsley, garlic, lemon zest and juice, pomegranate molasses, yogurt, cayenne and 2 tablespoons olive oil and blend until well combined. Transfer to a bowl. (May be prepared and stored at cool room temperature, covered, up to 2 hours in advance, or refrigerated for up to a week.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before serving, taste and adjust seasoning. Serve eggplant spread on toast, sprinkled with scallions and parsley, or as a dip for pita bread."}], "link": "https://cooking.nytimes.com/recipes/1018220-mashed-eggplant-with-capers-scallions-and-parsley"}