{"@context": "http://schema.org", "@type": "Recipe", "name": "Prune Pudding", "description": "This smooth, satisfying pudding recipe served at Franklin Delano Roosevelt's White House originally called for leaving the prunes in water overnight. But now that pitted prunes are readily available, an hour’s soak is all you need to speed the cooking process. Sweet, but not overly so, it lends itself to delicious variations: add a bit of cardamom; sprinkle with walnuts; spoon some over thick, creamy yogurt; or try all of these together. The strong cinnamon flavor and dark color make the pudding ideal for autumn and holiday desserts. The portions here may seem small, but as with any dish involving prunes, a little goes a long way.", "author": {"@type": "Person", "name": "Steven Kurutz"}, "image": "https://static01.nyt.com/images/2016/08/10/dining/10DEPRESSION-WEB2/10DEPRESSION-WEB2-articleLarge.jpg", "totalTime": "PT2H35M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "custards and puddings", "keywords": "cinnamon stick, prune, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 18}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 258, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "5 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "2 milligrams", "sugarContent": "47 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound (about 2 dozen medium-size) pitted prunes", "1/2 cup sugar", "1/4 teaspoon powdered cinnamon", "1 1-inch cinnamon stick", "3 tablespoons cornstarch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place prunes in a medium-size saucepan, pour in 2 cups hot water and let stand for 1 hour. Transfer saucepan to the stove and bring prunes to a boil. Reduce heat to low and simmer, covered, for 5 to 10 minutes until soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain prunes, reserving the liquid, and roughly chop. Add more hot water to the reserved prune water so it totals 2 cups. Place prunes and prune water back in the saucepan and add the sugar, powdered cinnamon and cinnamon stick. Stir to combine and bring to a boil, then reduce heat to low and simmer for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make a slurry by mixing the cornstarch and 2 tablespoons cold water. Add the slurry to the prune mixture and cook over low heat for 5 minutes, stirring constantly, to thicken mixture. Remove the cinnamon stick and ladle the pudding into ramekins. Let cool, then chill in the refrigerator. Serve cold."}], "link": "https://cooking.nytimes.com/recipes/1018241-prune-pudding"}