{"@context": "http://schema.org", "@type": "Recipe", "name": "Pirlo", "description": "Like Andrea Pirlo, the celebrated Italian midfielder with whom it shares its name, the drink called Pirlo comes from Brescia, in northern Italy. But I can’t think of an aperitivo hour anywhere where it would not be perfectly at home. My friend Damiano Abeni, also a Brescian, introduced me to the Pirlo in Rome. It’s the easiest thing ever to make: Stripped to its essentials, the drink simply combines Campari with sparkling white Italian wine. But Damiano specifically uses Pignoletto frizzante (“NO PROSECCO allowed,” he wrote to me by email, caps his), and prefers to garnish with half a slice of Sicilian blood orange of the Tarocco variety. He favors 2-3 parts of wine to one part Campari, allowing that one “can play with the proportions,” and that in warm weather, ice may be added — but for Damiano, the addition of ice usually means “more Campari.” Unsurprisingly, he forgoes the club soda — but you may wish to add some if you like extra fizz (and lower alcohol).", "author": {"@type": "Person", "name": "Rosie Schaap"}, "image": "https://static01.nyt.com/images/2017/02/26/magazine/26drink4/26eat4-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "cocktails", "keywords": "campari, orange, white wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 18}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 262, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": null, "fiberContent": null, "proteinContent": "0 grams", "saturatedFatContent": null, "sodiumContent": "16 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 part Campari", "2-3 parts dry sparkling Italian white wine (preferably Pignoletto frizzante, never prosecco)", "Half an orange slice to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To a large, balloon-style wineglass, add the Campari and the wine. Garnish with a half slice of orange. (You can drop it right into the glass, as Damiano does.) In warm weather, feel free to add ice."}]}