{"@context": "http://schema.org", "@type": "Recipe", "name": "Deep-Dish Apple Pie", "description": "If you’re going to the trouble of making a pie, why not make it a blockbuster? This pie, adapted from the professional pie coach Kate McDermott, is both deeper and wider than the traditional nine-inch version. The thicker rim is especially satisfying, like a buttery, crumbly slab of shortbread. You can use a 10-inch deep-dish pie pan, or a deep nine- or 10-inch square, or another 2 1/2- to 3-quart baking dish of your choice. A mix of apple types always makes the best filling.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2018/04/02/dining/02COOKING-DEEPDISH-APPLEPIE2/02COOKING-DEEPDISH-APPLEPIE2-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "12 to 16 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "apple, calvados, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 303}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 406, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "14 grams", "sodiumContent": "294 milligrams", "sugarContent": "17 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 3/4 cups/450 grams all-purpose flour, more for dusting surfaces", "1 1/2 teaspoons kosher salt", "1/2 teaspoon sugar", "12 ounces/340 grams cold unsalted butter (3 sticks), cut into large dice", "About 10 cups/40 ounces/1200 grams peeled and sliced apples, more as needed (see note)", "1/2 cup/100 grams granulated sugar", "1/2 teaspoon salt", "1 teaspoon cinnamon", "Pinch freshly grated nutmeg", "1/2 teaspoon allspice", "1 to 2 teaspoons freshly squeezed lemon juice or 1 tablespoon unfiltered apple cider vinegar", "1 to 2 tablespoons Calvados or other apple liqueur, brandy or cider", "1/2 cup/70 grams all-purpose flour", "2 tablespoons/30 grams cold butter, cut into small pieces", "1 egg", "2 teaspoons coarse or granulated sugar for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: In a food processor or stand mixer, mix together the flour, salt and sugar. Add butter and pulse (or mix at medium-low speed) until the pieces are coated with flour. Add 1/2 cup ice water and mix until incorporated. Keep dribbling in ice water, a tablespoon at a time, mixing until the dough just comes together into a lump. It should be moist, but not sticky. Turn out onto a lightly floured surface. (If dough feels wet, use a little extra flour.) Press the dough together, turning over a few times, until smooth and solid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape into 2 disks, using about 1/3 of the dough for the top crust and the remaining 2/3 for the bottom crust. Wrap separately in plastic wrap and refrigerate at least 1 hour and up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface or nonstick baking mat, roll out the larger disk to about 1/4-inch thickness. The size and shape will depend on your dish. Use the crust to line a large 2 1/2- to 3-quart baking dish, like a 10-inch round or 9-inch square, at least 2 inches deep. Refrigerate while you prepare the apples."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a large mixing bowl, combine the apples, sugar, salt, cinnamon, nutmeg, allspice, lemon juice or vinegar, 1 tablespoon Calvados and flour. Toss together until the apples are roughly coated with what looks like wet sand. If filling is dry, add the remaining tablespoon of Calvados. Pour into the pie crust, mounding above the rim, and dot with butter. (If necessary, add more apple pieces to the top. Don't worry about mixing them in.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out remaining dough to 1/4-inch thickness (or a bit less) and lay it gently over the fruit. Trim any excess and fold the edges into a thick rim. Crimp, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the egg thoroughly with 1 tablespoon cold water. Brush over the entire top crust, including the edges. Cut 5 or 6 vents on top. Refrigerate pie while the oven heats."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a baking sheet on the middle rack of the oven and heat to 425 degrees. Place pie on baking sheet and bake for 20 minutes. Reduce heat to 375 degrees. Bake another 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the oven and carefully sprinkle the sugar over the surface of the pie. Bake about 10 minutes longer. Look for steam and bubbling juices coming out of the vents, and a well-browned crust, before removing the pie from the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool at least 1 hour before serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Deep-Dish Apple Pie", "description": "An apple pie of unusual size that justifies the effort.", "thumbnailUrl": "https://static01.nyt.com/images/2018/04/02/dining/02COOKING-DEEPDISH-APPLEPIE2/02COOKING-DEEPDISH-APPLEPIE2-mediumThreeByTwo440.jpg", "uploadDate": "2017-10-20T12:19:59.000Z", "duration": "PT1M11S"}}