{"@context": "http://schema.org", "@type": "Recipe", "name": "Pakistani Potato Samosas", "description": "Samosas are popular snacks in Pakistan, India and elsewhere. The delicious fried parcels are often sold on the street, but the best ones are made at home. You can make the flavorful potato filling in advance if you wish. The highly seasoned potatoes can be served on their own as a side dish. Ajwain seed, a spice with a thyme-like flavor, is available from south Asian groceries or online spice merchants.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/10/26/dining/26KITCHEN1/26KITCHEN1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "About 20 small samosas", "recipeCuisine": "pakistani", "recipeCategory": "dinner, lunch, snack, finger foods", "keywords": "ajwain seeds, carrot, garam masala, russet potatoes, appetizer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 111}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 180, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "174 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups all-purpose flour", "1/2 teaspoon salt", "1 teaspoon ajwain or cumin seeds", "1/4 cup vegetable oil", "1/2 cup cold water", "1 1/2 pounds russet potatoes, peeled, in 1-inch cubes", "3 medium carrots, chopped, optional", "3 tablespoons vegetable oil, plus about 3 cups more for frying", "1 chopped onion, about 1 cup", "Salt and pepper", "1 teaspoon cumin seeds", "1 teaspoon black mustard seeds", "1 teaspoon grated garlic", "1 teaspoon grated ginger", "2 Serrano chiles, finely chopped", "1 teaspoon turmeric", "1/2 teaspoon garam masala", "3 tablespoons lemon juice", "1 cup chopped cilantro, tender stems and leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Put flour, salt and ajwain seeds in a medium bowl. Drizzle in oil and work into flour with fingers until mixture looks mealy. Add water gradually, stirring until a soft dough has formed. If dough seems too dry, add a tablespoon of water; if it seems wet, add a tablespoon of flour. Knead for 1 minute and form into a ball. Wrap and set aside for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Simmer the potatoes and carrots in well-salted water until tender, about 10 to 15 minutes. Drain and set aside to cool. Put 2 tablespoons oil in a deep, heavy skillet over medium-high heat. Add onions, season with salt and pepper and cook, stirring, until softened and beginning to brown, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 1 tablespoon oil in a very small skillet over medium heat. When hot, add cumin and mustard seeds. When seeds are fragrant and beginning to pop, stir in garlic, ginger, chiles, turmeric and garam masala. Let sizzle for a minute, then add skillet contents to onions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add reserved potatoes and carrots and stir well to coat. Check seasoning and adjust salt. Remove mixture to a bowl and let cool to room temperature. When cool, add lemon juice and chopped cilantro. Mix well, smashing the potatoes a bit in the process."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the samosas. Portion the dough into 20 pieces, each weighing 1 1/2 ounces. Form each piece into a ball and place on a large plate. Cover with a damp napkin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll each dough ball into a thin disk about 6 inches in diameter, as if rolling out pie dough. Cut each disk exactly in half, leaving 2 pieces with a straight side and a round side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form each half-disk into a cone by folding it over and pinching the straight sides together. Put 3 tablespoons filling in the opening on the round side, then pinch closed to make a stuffed triangle. Form the rest of dough balls into samosas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat about 2 inches of oil in the bottom of wok over medium-high heat. Adjust heat to maintain the oil at 350 degrees. Slip samosas 4 at a time into the hot oil and let fry on one side until golden, a minute or so, then flip and cook other side. Lift from oil and drain on paper towels. Serve samosas hot or at room temperature, accompanied by your favorite chutney."}], "link": "https://cooking.nytimes.com/recipes/1018358-pakistani-potato-samosas"}