{"@context": "http://schema.org", "@type": "Recipe", "name": "Butternut Squash and Green Curry Soup", "description": "This creamy, vibrant soup is a Thai-inspired version of the puréed squash soup you know and love. The green curry paste, which is relatively easy to find in the international aisle of the grocery store, along with coconut milk and fish sauce, perfectly complements the butternut squash's sweetness. But it's the topping — a spin on miang kham, a snack in Thailand and Laos full of peanuts, coconut and chiles — that's the real standout.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2019/03/22/dining/sn-butternut-squash-and-green-curry-soup/sn-butternut-squash-and-green-curry-soup-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "appetizer, main course, butternut squash, coconut, coconut milk, curry paste, fish sauce, ginger, lemongrass, lime leaves, peanut, shallot, dairy-free, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 486}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 577, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "9 grams", "proteinContent": "13 grams", "saturatedFatContent": "26 grams", "sodiumContent": "1287 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons coconut oil or neutral-tasting oil", "3 medium shallots, diced", "1 (2-inch) piece of fresh ginger, peeled and thinly sliced", "1 lemongrass stalk, cut into 3-inch pieces", "Kosher salt", "2 medium butternut squashes (about 4 pounds), peeled, seeded and cut into about 3/4-inch cubes", "2 (13 1/2-ounce) cans coconut milk", "6 to 8 tablespoons Thai green curry paste, or to taste", "3 tablespoons fish sauce", "3 to 4 cups water or chicken stock, preferably homemade", "3/4 cup raw peanuts", "3/4 cup unsweetened raw coconut flakes", "2 tablespoons fish sauce", "8 small dried red chiles, such as Japones or chiles de árbol, thinly sliced", "1 tablespoon neutral-tasting or melted coconut oil", "1 tablespoon minced lemongrass", "1 teaspoon sugar", "10 lime leaves, thinly sliced (optional)", "Handful of Thai or Italian basil leaves", "2 to 3 limes, quartered"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Melt oil in a large Dutch oven or soup pot over medium-high heat. When oil shimmers, add shallots, ginger, lemongrass and a generous pinch of salt. Reduce heat to low. Cook, stirring occasionally, until shallots are tender and just starting to brown, about 18 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add squash, coconut milk, curry paste, 3 tablespoons fish sauce and 3 cups water or stock. Increase heat to high. When liquid comes to a boil, reduce to a simmer and cook the soup covered until squash is tender, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make garnish while soup cooks: In a medium mixing bowl, toss together peanuts, coconut flakes, fish sauce, chiles, 1 tablespoon oil, the minced lemongrass, the sugar and the lime leaves, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread mixture out onto a baking sheet in a single layer. Bake for 18 to 20 minutes, stirring every 3 minutes after the first 10 minutes. Remove from oven when coconut is deep golden brown, and pour mixture immediately into a bowl to prevent overcooking. Stir to combine, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove soup from heat. Remove lemongrass stalks from pot. Use a hand blender to purée soup. Alternatively, transfer soup in batches to a blender or food processor and purée. Taste and adjust for salt and curry paste. Add water or stock to thin soup to the desired consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice the basil leaves and arrange on a small plate or platter, along with lime wedges and peanut mixture. Serve soup hot with garnishes."}], "link": "https://cooking.nytimes.com/recipes/1018491-butternut-squash-and-green-curry-soup"}