{"@context": "http://schema.org", "@type": "Recipe", "name": "Linguine With Lobster and Avocado", "description": "The summer season was beginning, whetting the appetite for a copious seafood salad or a tangy ceviche. But instead, I tore a page from ceviche’s playbook and assembled a pasta dish with the avocado, tomato, jalapeño, scallion, cilantro and citrus juice, along with lobster, to mingle with pasta. The result was brightly fresh-tasting, a warm-weather charmer with a touch of spice. Even during the brief cooking, some of the avocado will melt into the mixture, suavely coating the strands of linguine. But be sure that some of the avocado is still intact. The dish is satisfying as the main event yet light enough to serve as a first course followed by chicken or sausages hot off the grill.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/06/08/dining/08PAIRING-WEB/08PAIRING-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 first-course servings, 2 to 3 as a main course", "recipeCuisine": "", "recipeCategory": "pastas", "keywords": "appetizer, main course, avocado, jalapeño, linguine, lobster, tomatoes", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 232}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 515, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "7 grams", "proteinContent": "33 grams", "saturatedFatContent": "3 grams", "sodiumContent": "841 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 ripe avocado, peeled, pitted, cut in 1/2-inch dice", "Juice of 1 lemon", "3 tablespoons extra-virgin olive oil", "Salt and ground white pepper", "8 ounces linguine", "1/2 cup finely chopped onion", "1 small jalapeño chile, seeded and minced", "8 ounces grape tomatoes, halved", "1 1 1/4-pound cooked lobster, meat removed and diced", "2 scallions, chopped", "2 tablespoons minced cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Thoroughly mix avocado and lemon juice in a bowl. Add 1 tablespoon oil, season with salt and pepper and set aside. Bring a pot of salted water to a boil and add linguine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the remaining oil in a large skillet. Add onion and jalapeño and cook on medium-low until onion is translucent. Add tomatoes and continue cooking 5 minutes or so until they begin to soften and their skins start to wrinkle. Fold in lobster and avocado with its lemon juice and oil, and add 2/3 cup of the pasta water. Continue to cook on low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When linguine is al dente, drain it and add it to the skillet. Add scallions and cilantro and fold ingredients together until well combined, the mixture is moist but not soupy, and only a little of the avocado has melted down. Check your salt and pepper, then serve."}], "link": "https://cooking.nytimes.com/recipes/1018159-linguine-with-lobster-and-avocado"}