{"@context": "http://schema.org", "@type": "Recipe", "name": "Big Salad With Grains", "description": "There's no true recipe for a big salad, but for this robust green meal, you will want to keep a few rules in mind. Skip the soft lettuces, which tend to get squashed in a big salad, and start with sturdier greens, like kale or escarole. Add fruits and vegetables, a protein, like a hard-boiled egg, and a starch or two. You want a total of six to eight ingredients, before toppings. Too few, and it could get boring; too many, and the bowl gets crowded and confusing. Finish it off with a substantial dressing, like avocado, yogurt or tahini, and add a couple of toppings, like chives or chopped nuts. Serve with a side of whole-grain bread for a filling and healthy meal.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/05/09/dining/09SALADGUIDE9/09SALADGUIDE9-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "1 serving", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, quick, weekday, salads and dressings", "keywords": "avocado, egg, grains, salad greens, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 612}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 998, "unsaturatedFatContent": "45 grams", "carbohydrateContent": "100 grams", "cholesterolContent": null, "fatContent": "59 grams", "fiberContent": "19 grams", "proteinContent": "25 grams", "saturatedFatContent": "10 grams", "sodiumContent": "80 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups sturdy salad greens, such as romaine, iceberg, escarole or kale", "1/2 cup cooked grains, like quinoa, farro, bulgur wheat or barley", "1 cup roasted vegetables, like potatoes, sweet potatoes or winter squash", "1/4 cup thinly sliced raw vegetables, like bell peppers, celery, carrots, fennel, mushrooms, onions, radishes, snap or snow peas, summer squash or tomatoes", "1/4 cup salad dressing, like yogurt, tahini or a vinaigrette, plus more to taste", "1/2 avocado, thinly sliced", "1 hard-boiled egg, peeled and halved", "2 teaspoons snipped chives, plus more to taste", "2 teaspoons sliced or chopped nuts, like almonds, walnuts, pecans or hazelnuts, plus more to taste", "Whole-grain bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place greens in bottom of serving bowl. Add grains in an even layer over greens. Repeat with the roasted vegetables, then the raw vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top with dressing, and toss gently. Fan out avocado on top on one side of bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place hard-boiled egg pieces on the side opposite the avocado. Top with chives and nuts. Serve with whole-grain bread."}]}