{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Wine-Braised Short Ribs With Carrots", "description": "Everyone loves beef short ribs. Because the meat is well-marbled, a couple of hours’ slow cooking keeps it incredibly succulent. This homely combination of beef with carrot, cooked rather plainly, is classic in traditional French cooking, and produces truly delicious results. Like all other braises, this one improves if made a day (or two) in advance of serving, though you can certainly make it all in one go if you wish. Cooking it ahead accomplishes a number of things, not least of which is that it needs only reheating to serve. Another is that refrigerating the braise in its juices always seems to intensify the flavors. Yet one more reason: It is easier to remove the fat on the surface of the liquid when it is cold, rather than trying to skim it from the surface hot.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/12/21/dining/21KITCHEN/21KITCHEN-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "carrot, leek, red wine, short ribs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 459}, "recipeIngredient": ["5 pounds meaty beef short ribs, cut flanken- or English-style", "Salt and pepper", "Olive oil", "1 large onion, peeled and halved", "2 whole cloves", "2 bay leaves", "2 tablespoons tomato paste", "2 cups dry red wine", "4 cups beef or chicken broth, heated", "2 pounds small carrots, peeled and cut in 2- or 3-inch lengths of roughly equal thickness", "1 medium leek, white and tender green parts, cut in 1-inch dice (about 2 cups)", "2 tablespoons unsalted butter", "1 teaspoon potato starch or cornstarch, dissolved in 2 tablespoons cold water (optional)", "3 tablespoons chopped parsley, for serving", "2 tablespoons finely cut chives, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season each rib generously all over with salt and pepper. If time permits, set aside for an hour to let seasoning penetrate meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Put a large cast-iron skillet over medium-high heat. When pan is hot, add olive oil just to film the bottom. Working in batches so as not to crowd pan, brown a few short ribs at a time on both meaty sides. Reduce heat as necessary to achieve browning gradually; it may take 4 to 5 minutes per side for well-browned ribs. This will guarantee a dark, rich color for the sauce. Transfer ribs to a Dutch oven or deep, wide baking dish. Leave skillet on the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a clove to pin a bay leaf to the rounded side of each onion half. Set the onion cut side down in the skillet and let cut side brown for a minute or two. Transfer onion to pot with ribs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomato paste and wine to skillet and bring to a simmer, stirring and scraping with a wooden spoon to dissolve all of the flavorful brown bits, then pour wine mixture over ribs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add broth to Dutch oven, cover and bake for 2 to 2 1/2 hours, until meat is very tender when probed. Remove from heat, uncover  and skim fat from surface. (See note.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large saucepan with well-salted water and bring to a boil. Add carrots and simmer until done, but not too soft, about 8 to 10 minutes. Drain carrots, reserving 1/2 cup of cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return saucepan to stove over medium-high heat and add butter. Add leeks, season with salt, and cook, stirring, until barely softened. Add carrots and reserved cooking water. Gently combine, turn off heat and cover for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully transfer short ribs to a large, deep serving platter. Bring braising juices to a boil over high heat. If you wish to thicken the sauce lightly, add potato starch mixture and cook 1 minute more. Ladle sauce over ribs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer carrot and leek mixture, along with buttery juices, to a serving dish. Sprinkle carrots and ribs with parsley and chives and serve."}]}