{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramel Peach Skillet Pie", "description": "In this decadent pie baked in a skillet, fresh peaches are coated in caramel before being topped with a homemade puff pastry crust. The trick to controlling the sweetness here is making sure to cook the caramel until it’s very dark brown but not burned. You’re looking for the color of an Irish setter: deep brown with a reddish cast. The puff pastry is a shortcut version (often called quick or rough puff pastry) that’s less labor-intensive than the classic kind. Its texture is somewhere between flaky pie dough and typical puff pastry, with a deeply buttery flavor. You can make it up to three days ahead (or longer if you freeze it). This said, purchased all-butter puff pastry is a fine substitute. You’ll need a 12- to 14-ounce package.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/07/26/multimedia/clark-peaches/clark-peaches-mediumThreeByTwo440.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "dessert, peach, tapioca, vanilla bean, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 280}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 538, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "18 grams", "sodiumContent": "196 milligrams", "sugarContent": "35 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 cups/283 grams unsalted butter (2 1/2 sticks), cubed", "2 1/4 cups/280 grams all-purpose flour", "3/4 teaspoon kosher salt", "9 cups sliced peaches or nectarines, or a combination (from 3 pounds/1.3 kilograms)", "2/3 cup/150 grams sugar, plus 1 tablespoon", "2 1/2 tablespoons/23 grams quick-cooking tapioca", "1/2 teaspoon vanilla bean paste, or 1 vanilla bean, scraped", "1/2 teaspoon ground cardamom or cinnamon", "Pinch sea salt", "1 teaspoon lemon juice, or to taste (optional)", "Cinnamon sugar, for sprinkling", "Ice cream, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the puff pastry: Cube 1 cup/226 grams of butter (2 sticks) and place in the freezer while you measure out remaining ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, pulse to combine flour and salt. Add remaining 1/4 cup/57 grams butter (1/2 stick) to food processor; pulse to combine. Add the chilled butter cubes from the freezer and pulse twice, 1 second or less for each pulse."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/3 cup/80 milliliters water, pulse very quickly once, then add another 1/3 cup/80 milliliters water and pulse once. Dough will still look dry and floury in spots, but it should look as if some areas are starting to clump together. But it will not form a ball. If the dough looks very dry, add another tablespoon or two of water, taking care to pulse it in only once. Do not overpulse this dough; the butter must remain in distinct large chunks, or the dough won’t puff."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn out the floury dough crumbles onto a lightly floured work surface and press them together into a rough rectangle. Using a floured rolling pin, roll rectangle out until it's 1/2 inch/13 millimeters thick (about 6 by 9 inches, or 15 by 23 centimeters) with the short side of the rectangle closest to you. The dough will be dry and still very crumbly in spots, but don’t worry: It will come together as you continue to fold and roll."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a pastry scraper or spatula to fold the top third of the dough down, then the bottom third of the dough up, so it’s folded like a letter. (Dough will still be crumbly, and that’s O.K.) Turn the folded dough 90 degrees, using a pastry scraper to push edges together if they fall apart. Press rolling pin on top of the layered dough several times to seal it, then roll into a rectangle that is 1/2 inch (13 millimeters) thick, always rolling from open end to open end. Continue rolling, folding and turning until the dough looks smooth and comes together, about four 90-degree turns."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the final fold, fold the edges of the dough rectangle like a book. To do this, fold the top and bottom parts into the center of the rectangle, so their ends meet. Then fold one half over the other. Wrap the dough in plastic and chill it for 45 minutes (or up to 3 days)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the filling: Heat oven to 400 degrees. Toss cut peaches with 1 tablespoon sugar and let sit while you make the caramel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 9-inch ovenproof skillet, combine 2 tablespoons water with remaining 2/3 cup/150 grams sugar and cook over medium heat, swirling the pan, until very dark amber brown in color, about 8 minutes. To test the color, dribble some of the caramel on a white plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the peaches and their juices into the skillet; the caramel will sizzle a bit, so stand back. Cook peaches, stirring gently once or twice, until they start to soften, about 5 minutes, then remove from heat. Stir in tapioca, vanilla, cardamom and salt. Taste and add 1 teaspoon or so lemon juice, if necessary, to bring out the flavor of the peaches if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife, cut chilled puff pastry in half. Wrap half the pastry back up in plastic wrap and freeze for up to 3 months. Then roll out the other half on a lightly floured surface into a round that is 1/4 inch (6 millimeters) thick. Prick the round all over with the tines of a fork. Place pastry on top of the peaches in the skillet, tucking the edges into the skillet. (Be careful: The skillet may still be hot.) Sprinkle with cinnamon sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the skillet on a rimmed baking pan to catch any overflow, and bake for 20 minutes. Reduce heat to 350 degrees and bake until top is golden brown and has puffed, and juices are bubbling, about 20 more minutes. Let pie cool for at least 20 minutes before serving from the skillet, preferably with ice cream."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Caramel Peach Skillet Pie", "description": "Homemade puff pastry and bittersweet caramel elevate this peach skillet pie.", "thumbnailUrl": "https://static01.nyt.com/images/2016/07/26/multimedia/clark-peaches/clark-peaches-mediumThreeByTwo440.jpg", "uploadDate": "2016-07-29T12:16:20.000Z", "duration": "PT2M48S"}, "link": "https://cooking.nytimes.com/recipes/1018228-caramel-peach-skillet-pie"}