{"@context": "http://schema.org", "@type": "Recipe", "name": "Burrata With Romano Beans and Roasted Eggplant", "description": "Although burrata is inarguably the star of this stunning summery salad, roasted eggplant, cherry tomatoes and Romano beans add a brilliant mix of colors, textures and flavors to the creamy mozzarella. The eggplant is soft and rich; the tomatoes, juicy and sweet; and the Romano beans, which look like flat, broad green beans, add a nice crunch. Then, to season it all, the vegetables are tossed with a piquant mix of garlic oil, capers, olives and fresh herbs. Serve this as a light meal or a first course, with grilled or toasted country bread, perhaps smeared with a little of the garlic confit left over from making the garlic oil.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/08/18/multimedia/clark-romano-beans/clark-romano-beans-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings, vegetables", "keywords": "appetizer, basil, burrata, eggplant, kalamata olives, mint, romano beans, tomato, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 237}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 681, "unsaturatedFatContent": "37 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "57 grams", "fiberContent": "9 grams", "proteinContent": "24 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1090 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["1 1/4 pounds eggplant, diced in 1-inch pieces", "1/2 teaspoon kosher salt, more as needed for cooking beans", "8 garlic cloves, smashed and peeled", "2/3 cup extra-virgin olive oil, more as needed", "6 ounces cherry tomatoes, halved (about 1 1/2 cups)", "1 pound Romano beans, trimmed", "1/4 cup pitted and sliced kalamata olives", "1 tablespoon capers, drained", "1/4 cup torn fresh mint", "1/4 cup torn fresh basil", "2 teaspoons red wine vinegar, more as needed", "Flaky sea salt, such as Maldon, as needed", "Black pepper, as needed", "12 ounces burrata", "Crusty bread, toasted or grilled, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put eggplant in a colander. Sprinkle with 1/2 teaspoon kosher salt and let stand in the sink to drain for 20 to 30 minutes, tossing occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make garlic oil: Place garlic cloves in a small pot and cover with 1/3 cup olive oil. Place over very low heat and cook gently until soft and pale golden, 10 to 15 minutes. Let cool. Mash garlic with a fork, then strain the oil into a jar or little bowl, pressing hard on the solids. (Use the solids, known as garlic confit, as a spread for bread or keep to mix into vinaigrettes or marinades. It will keep for at least a week in the refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Squeeze out as much excess liquid from eggplant as possible (or pat very dry). Toss eggplant with 1/3 cup olive oil and spread out on 1 or 2 rimmed baking sheets so the pieces aren’t touching. (This makes for the best browning.) Roast, tossing once or twice, until golden brown, 20 to 30 minutes. Transfer eggplant to a bowl and toss with tomatoes and 3 tablespoons garlic oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Drop in Romano beans and cook until just tender, 3 to 6 minutes depending on their size and thickness. Drain well under cold running water. Cut into 1-inch pieces; add to bowl of eggplant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss olives, capers, mint, basil, vinegar and a little more garlic oil into salad. Season with flaky salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cheese in the center of a serving platter and surround with salad. Drizzle with more garlic oil if you like, and sprinkle with more flaky sea salt. Serve with crusty bread."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Burrata With Romano Beans and Eggplant", "description": "Crisp Romano beans, roasted eggplant and luscious garlic confit come together with burrata to create a hearty main course salad.", "thumbnailUrl": "https://static01.nyt.com/images/2016/08/18/multimedia/clark-romano-beans/clark-romano-beans-mediumThreeByTwo440.jpg", "uploadDate": "2016-08-19T17:44:47.000Z", "duration": "PT2M20S"}, "link": "https://cooking.nytimes.com/recipes/1018257-burrata-with-romano-beans-and-roasted-eggplant"}