{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Steak Tacos With Cherry Tomato-Avocado Salsa", "description": "In this supremely summery taco recipe, chile-rubbed grilled steak is topped with a spicy tomato-avocado salsa before being rolled into warm corn tortillas. Grilling the onions, garlic and jalapeño for the salsa adds a concentrated sweetness, while lime zest keeps everything sharp and bright. If you don’t have access to a grill, feel free to use your broiler.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/08/09/dining/09APPE1/09APPE1-articleLarge-v2.jpg", "totalTime": "PT1H40M", "recipeYield": "8 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, weekday, tacos", "keywords": "cherry tomatoes, skirt steak, tortilla, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 153}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 347, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "4 grams", "proteinContent": "30 grams", "saturatedFatContent": "8 grams", "sodiumContent": "648 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 teaspoons kosher salt", "2 1/2 teaspoons New Mexican or other mild chile powder", "1 1/2 teaspoons ground coriander", "1/2 teaspoon ground cumin", "1 large garlic clove, finely grated or minced", "Finely grated zest of 1 lime (cut lime into wedges for serving)", "2 1/2 pounds skirt steak (usually 2 steaks)", "1 white onion, peeled and sliced into 1-inch-thick slices", "2 large garlic cloves, unpeeled", "2 jalapeños", "1 quart cherry tomatoes, quartered", "1 avocado, diced", "1/4 cup chopped cilantro leaves and stems", "2 teaspoons fresh lime juice, more to taste", "3/4 teaspoon kosher salt, more to taste", "Corn or flour tortillas, for serving", "Sliced radishes, for serving", "Mexican crema or sour cream, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the steak: In a small bowl, mix together the salt, chile powder, coriander, cumin, garlic and lime zest. Rub mixture all over the steaks, cover and refrigerate for at least 1 hour or preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the salsa: Light the grill or heat to medium-high (or heat the broiler). Grill onion, garlic and 1 jalapeño until tender and charred on all sides, 5 to 10 minutes (or place on a broiler pan and broil). Remove from heat until cool enough to handle, then roughly chop onions, peel garlic and remove seeds and stem from jalapeño."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer grilled onion, garlic and jalapeño to a blender or mini food processor. Halve the fresh jalapeño and seed it, if desired, then add it to the blender. Process to a chunky paste. Scrape into a serving bowl and toss with tomatoes, avocado, cilantro, lime juice and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add more charcoal to the grill, if needed, and grill the steaks until done to taste, about 2 minutes per side for rare (or broil). Let meat rest on a cutting board covered with foil for at least 7 minutes. Meanwhile, grill or broil the tortillas until warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, slice the meat across the grain, and serve with the warm tortillas, radishes, lime wedges, salsa and crema. Let people assemble their own tacos at the table."}], "link": "https://cooking.nytimes.com/recipes/1018875-grilled-steak-tacos-with-cherry-tomato-avocado-salsa"}