{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Grilled Squid and Green Bean Salad", "description": "Everyone loves calamari, but grilling is an easy, delicious alternative to frying. Grill the squid whole, then slice it into rings to serve warm or at room temperature, dressed with an assertive vinaigrette — in this case, with ginger, hot pepper, sesame oil and scallions. Cooking over hot coals adds a smoky note, but a stovetop grill works well, too. Any size squid may be prepared this way, but meaty larger squid works best. And, if grilling isn't a possibility, whole squid can also be broiled or roasted.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/07/12/dining/12kitchen1/12kitchen1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, seafood", "keywords": "appetizer, main course, cilantro, green beans, jalapeño, scallion, squid, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 51}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 283, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "4 grams", "proteinContent": "21 grams", "saturatedFatContent": "3 grams", "sodiumContent": "670 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 pound large squid, whole bodies (tubes) and tentacles, cleaned (about 8) ", "Salt and pepper", "3 to 4 tablespoons peanut oil or other vegetable oil", "2 teaspoons toasted sesame oil", "3 tablespoons lime juice or rice vinegar", "1 tablespoon Asian fish sauce or 2 teaspoons finely chopped anchovy", "1 tablespoon finely chopped ginger", "2 garlic cloves, minced", "1 jalapeño chile, seeds removed to lessen heat if desired, chopped or thinly sliced", "1 red Fresno chile, seeds removed to lessen heat, chopped or thinly sliced", "1 pound tender green beans or Romano beans, ends trimmed (topped and tailed)", "1/2 cup slivered scallions, both white and green parts", "1 small bunch cilantro, leaves and tender stems roughly chopped, plus a few sprigs reserved for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse squid with cold water, drain and pat dry. Transfer to a baking sheet in one layer. Drizzle with 1 tablespoon peanut oil. Season squid on both sides with salt and pepper, and season tentacles. (If they are small, thread them onto bamboo skewers.) Make sure everything is lightly coated with oil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a charcoal grill, or heat a stovetop grill to medium-high. Bring a large pot of well-salted water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the vinaigrette: In a small bowl, whisk together 2 tablespoons peanut oil, toasted sesame oil, lime juice and fish sauce. Stir in ginger, garlic and half the jalapeño and Fresno chiles (or less, if chiles are very hot)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop beans into boiling water and cook for 1 to 2 minutes, until firm tender. Drain and spread out on a baking sheet lined with a kitchen towel. Let cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the squid bodies on the grill and cook for 3 to 4 minutes per side, until lightly browned (bodies will puff up). Grill tentacles until firm and slightly charred, turning with tongs, 3 to 4 minutes. Transfer cooked squid to a cutting board. Let cool slightly, then cut bodies crosswise into 1/2-inch-thick slices. Cut tentacles in halves or quarters, if large; otherwise leave whole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place green beans and sliced squid in a large bowl. Sprinkle lightly with salt, then add the vinaigrette and toss to coat with wooden spoons. Add remaining half of the chiles, the scallions and cilantro and toss again. Taste and adjust seasoning as necessary. Transfer to a serving platter. Sprinkle with remaining chiles if desired and garnish with cilantro springs."}], "link": "https://cooking.nytimes.com/recipes/1018832-spicy-grilled-squid-and-green-bean-salad"}