{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Calamari", "description": "Long a star on Camille Orrichio Loccisano’s traditional Italian-American Feast of the Seven Fishes table, these stuffed squid were also a hit at her restaurant, the appropriately named Casa Calamari. After a slow simmer in briny tomato sauce, diced shrimp and peppery crumbs plump up into a rich stuffing that fills tender calamari bodies; they're like seafood dumplings in reverse.", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2016/04/10/magazine/10eat/10mag-10eat-t_CA1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 3-4", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "black-pepper taralli, shrimp, squid, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 118}, "recipeIngredient": ["1/2 of an 8- or 10-ounce bag black-pepper taralli *see note", "1 1/2 pounds large squid (about 12), cleaned, bodies and tentacles separated", "1/4 cup extra-virgin olive oil", "1 1/2 tablespoons unsalted butter", "5 garlic cloves, roughly chopped", "Red-pepper flakes, to taste", "3/4 pound peeled shrimp, cut into 1/2-inch pieces", "Kosher salt", "1/4-1/2 cup dry white wine", "1/2 teaspoon finely grated fresh lemon zest", "1/4 cup extra-virgin olive oil", "Red-pepper flakes, to taste", "4 garlic cloves, crushed", "2 28-ounce cans crushed tomatoes", "Kosher salt and freshly ground black pepper", "1 handful Italian flat-leaf parsley, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, pulse the taralli until it forms coarse crumbs. Measure 1 1/4 cups of the crumbs. Pulse the squid tentacles in the food processor to chop them fine, and pat them very dry with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat 1/4 cup olive oil over medium heat. When shimmering, add the squid tentacles, and spread them out. Sear until golden brown, about 5 minutes, then add the butter, garlic and red-pepper flakes to taste. Cook, stirring, until the garlic just starts to color, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shrimp, season with salt and cook until just pink, about 2 minutes. Add the wine, and simmer for 1 minute. Turn off the heat, and stir in the taralli crumbs and lemon zest. The crumbs should look like wet, clumpy sand. If the mixture is too dry, sprinkle in a little more wine, and allow the filling to cool until just warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stuff each squid body with the filling, leaving the bottom and top inches unfilled (the stuffing will expand as it cooks). Secure the tops with toothpicks, and season all over with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: In a wide, deep pan, warm 1/4 cup olive oil over medium heat. Add red-pepper flakes to taste and the garlic, and cook until fragrant and just beginning to color. Stir in the tomatoes, and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the tomatoes to a boil, then lower the heat and simmer the sauce for 15 minutes. Add the calamari and any extra stuffing, and bring back to a very gentle simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the pan, and simmer for 45 minutes, stirring occasionally and adjusting the heat to make sure the sauce maintains a lazy bubble. Adjust with salt to taste. Garnish with the parsley. Serve with bread or pasta."}], "link": "https://cooking.nytimes.com/recipes/1018050-stuffed-calamari"}