{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Beef Short Ribs With Red Wine and Chile", "description": "Prunes are the secret ingredient in this recipe. They practically disappear during cooking, leaving behind their complex sweetness. This recipe was meant for a 6- to 8-quart electric pressure cooker, but to use a stovetop pressure cooker, just cook the ribs a few minutes less than you would if using an electric one. You could also bake this in a covered Dutch oven at 325 degrees for 3 hours. In any case, it is easiest to make the day before, chill it, then skim the fat off the top. Serve this with polenta or mashed potatoes.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/02/01/dining/01APPE5/01APPE5-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, roasts, soups and stews", "keywords": "fennel, leek, prune, red wine, short ribs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1054}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1181, "unsaturatedFatContent": "49 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "99 grams", "fiberContent": "6 grams", "proteinContent": "41 grams", "saturatedFatContent": "43 grams", "sodiumContent": "881 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["2 teaspoons kosher salt, more as needed", "1 teaspoon coriander powder", "1 teaspoon ground black pepper", "3 to 4 pounds bone-in beef short ribs", "1 tablespoon olive oil or other fat (like bacon fat or duck fat), more as needed", "3 leeks, whites only, chopped", "2 large fennel bulbs, diced", "4 garlic cloves, minced", "1 tablespoon chipotle chile powder", "1 tablespoon tomato paste", "1 cup dry red wine", "1/2 cup pitted prunes, diced", "Fennel fronds or sliced scallions, or both, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If time permits, rub salt, coriander and pepper all over beef and let marinate in refrigerator for 1 hour, or, ideally, overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set electric pressure cooker to sauté function and add oil (or use a large skillet on the stove over medium-high heat). Sear beef until evenly browned on all sides, about 2 minutes per side. You’ll probably have to do this in batches. Transfer to a plate as the pieces brown. Or if using a skillet, transfer them to pressure cooker."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add leeks, fennel and pinch of salt to hot pan and cook until soft, about 8 minutes, then add garlic, chile powder and tomato paste; cook until fragrant, 1 to 2 minutes. Pour in wine. Add prunes and beef (or add prunes and fennel-wine mixture to the meat in the pot)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover, then cook for 35 minutes on high pressure. Manually release pressure. If sauce seems thin, pull out beef pieces and reduce sauce using sauté function. Serve with fennel fronds or scallions, or both, for garnish."}]}