{"@context": "http://schema.org", "@type": "Recipe", "name": "Zucchini Carpaccio", "description": "Raw zucchini has a fresh, green flavor that is lost when the vegetable is cooked. Excellent olive oil and fresh lemon juice make the perfect dressing to bathe the slices in; the acid softens and flavors the zucchini. After the nuts and/or herbs, the garnishes are all optional. Try them in any combination, or play around with others: cracked black pepper, crushed pink peppercorns or crumbled dried chiles.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/09/14/dining/14UMBRIA-RECIPES2/14UMBRIA-RECIPES2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "vegetables", "keywords": "almond, fruity olive oil, pine nuts, raw honey, zucchini, appetizer, side dish, gluten-free, vegan, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 226}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 64, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "182 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["2 medium zucchini", "Salt", "2 garlic cloves, thinly sliced", "Freshly squeezed juice of 1/2 lemon", "2 to 3 tablespoons fruity olive oil", "2 tablespoons toasted pine nuts or chopped almonds, and/or chopped fresh herbs", "1 teaspoon raw honey, 1 tablespoon raisins or fresh Parmesan shavings (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice zucchini lengthwise with a mandoline or chef’s knife as thinly as you can, and sprinkle lightly with salt. Place in a colander for 30 minutes to remove the excess moisture, tossing occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dry on paper towels and arrange the zucchini in layers in a shallow serving dish, adding slices of garlic between the layers. Drizzle with lemon juice and marinate, refrigerated, for at least 15 minutes and up to 1 hour. If you have more than 2 layers, you may need to turn the zucchini upside down every 15 minutes to coat them evenly with the lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, arrange a few slices of zucchini on each plate. (Remove and discard garlic slices as you go.) Drizzle with olive oil and top with nuts and/or herbs. If you wish, add a few drops of runny honey, a few raisins or some Parmesan shavings."}], "link": "https://cooking.nytimes.com/recipes/1018265-zucchini-carpaccio"}