{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Sea Scallops With Yellow Beets, Cucumbers and Lime", "description": "Here’s a simple bright dish that’s nearly effortless to put together. You make a sort of salad-like relish with onion, cucumber and golden beet, seasoned with ginger and lime juice. Once the scallops are grilled, you spoon the relish over and drizzle with fruity olive oil, along with a shower of chopped sweet herbs. Done and done. If sea scallops are not available, use wild shrimp or halibut or salmon fillets. It is best to cook and cool the beets in advance (even a day ahead).", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/08/24/dining/24KITCHEN1/24KITCHEN1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, seafood", "keywords": "beet, cucumber, ginger, lime, onion, scallops, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 185}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 127, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "2 grams", "proteinContent": "11 grams", "saturatedFatContent": "1 gram", "sodiumContent": "561 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 medium yellow beets", "1 1/2 pounds large dry-packed sea scallops (about 18 scallops)", "Salt and pepper", "Extra-virgin olive oil", "1 cup finely diced red onion", "4 tablespoons lime juice, plus more for finishing", "1 teaspoon grated ginger", "2 medium cucumbers, peeled and diced into 1/2 inch cubes", "2 tablespoons roughly chopped dill", "2 tablespoons roughly chopped mint", "2 tablespoons finely cut chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Place beets in a baking dish with an inch of water. Tightly cover baking dish and roast for 1 hour or so, until beets are soft enough to yield to a fork and skins easily rub off. Peel beets, let them cool, then dice into 1/2-inch cubes. Alternatively, peel and dice raw beets, then simmer in salted water for 20 to 30 minutes, until tender. (Beets may be cooked up to a day in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put scallops on a baking sheet, pat dry and season on both sides with salt and pepper. Drizzle or paint very lightly with olive oil, just to coat the surface. Leave at room temperature for 15 minutes to absorb seasoning. (Or refrigerate up to 6 hours in advance; bring to room temperature before proceeding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put onions, ginger and lime juice in a mixing bowl with a big pinch of salt. Let macerate for 10 minutes or so, then add beets and cucumber to bowl. Season generously with salt and pepper and toss to coat well with juices. Leave to marinate, tossing occasionally, for at least 10 minutes and up to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a bed of medium-hot coals for grilling or heat a stovetop grill pan. Lay the scallops on the grill and let them crisp gradually, for 5 minutes or so. Don’t try to turn them until they are well browned or they’ll stick. Flip and cook for 2 or 3 minutes more, until cooked through, but juicy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer scallops to a serving dish in one layer. Spoon beets and cucumbers over the scallops and sprinkle with dill, mint and chives. Squeeze a little more lime juice over everything and drizzle with good fruity olive oil."}]}