{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Chicken Salad With Green Beans, Capers and Olives", "description": "The key to a moist, juicy grilled boneless chicken breast is simple but crucial: Keep the heat moderate and don’t overcook the chicken. Skin-on chicken is ideal. (It's not always easy to find; sometimes you’ll see skin-on breasts that have breastbone and ribs attached, which you can easily remove. Or ask a butcher.) If boneless, skinless chicken is your only option, that’s fine, but proceed with care and adjust the cooking time on the grill to about 3 minutes per side. Cook the chicken breasts just before making the salad and let them rest for a few minutes when they come off the grill, so juices can redistribute. Slice the meat on an angle while it’s still slightly warm.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/08/03/dining/03KITCH1-WEB/03KITCH1-WEB-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "capers, chicken breast, dijon mustard, olives, romano beans, rosemary, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 176}, "recipeIngredient": ["4 boneless chicken breasts, preferably skin-on, trimmed (about 6 ounces each)", "Salt and pepper", "Zest of 1 lemon", "1 teaspoon chopped rosemary", "1/2 teaspoon grated garlic", "2 tablespoons extra-virgin olive oil", "Pinch of crushed red pepper flakes", "3 tablespoons lemon juice", "1/2 teaspoon grated garlic", "1 teaspoon Dijon mustard", "1 tablespoon chopped capers", "3 tablespoons extra-virgin olive oil", "Salt and pepper", "1 cup pitted Niçoise olives", "1/2 teaspoon grated garlic", "2 tablespoons extra-virgin olive oil", "1 pound small green beans or Romano beans, or a mixture, topped and tailed", "Salt and pepper", "4 hard-cooked eggs, quartered", "Green and black olives, for garnish (optional)", "2 tablespoons chopped parsley, for garnish", "Handful of green or purple basil leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Marinate the chicken: Season breasts on both sides with salt and pepper. Sprinkle with lemon zest, rosemary, garlic, olive oil and red pepper flakes. Smear seasoning on meat to coat well and leave at room temperature for 15 minutes. (You may season the meat up to 4 hours ahead and store covered in refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the vinaigrette: In a small bowl, stir together lemon juice, garlic, mustard and capers. Whisk in olive oil and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the olive paste: Chop olives roughly with a food processor. Transfer to a bowl and stir in garlic and olive oil. (May be prepared in advance; keeps 1 week, refrigerated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Simmer beans for 2 minutes or until tender, then drain and spread on a towel-lined baking sheet to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, grill the chicken: Lay skin-side down on a medium-high grill. If the fire is too hot, the skin will scorch — you want it to brown gradually. Cook for 4 to 5 minutes on the skin side, until skin is golden. Flip the chicken and cook on the other side for 2 minutes or so, until firm to the touch when pressed with index finger. (If using skinless breasts, reduce cooking time to about 3 minutes per side.) Remove chicken to a platter and let rest for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble salad: Put beans in a large bowl. Season with salt and pepper and dress with vinaigrette, coating well. Transfer beans to a large platter or individual plates. Cut breasts on an angle into 1/2-inch slices and lay on top. Quickly dab about 1 teaspoon olive paste on each breast and spread on meat with back of spoon. Surround with quartered egg and scattered olives, if using. Sprinkle with parsley and basil."}], "link": "https://cooking.nytimes.com/recipes/1018229-grilled-chicken-salad-with-green-beans-capers-and-olives"}