{"@context": "http://schema.org", "@type": "Recipe", "name": "Crawfish Étouffée", "description": "This recipe for étouffée, which is the French word for “smothered,” comes from Karlos Knott of Bayou Teche Brewing in Arnaudville, La. This is “pretty close to a traditional Cajun crawfish étouffée,” said Mr. Knott. “If you substitute a green bell pepper for the chile and omit the dried thyme, you would be cooking one exactly like my grandmother used to make. Some people like to stir in the juice from half of a lemon into the pan just prior to serving.” Look for precooked Louisiana crawfish tails in 1-pound packages in your fishmonger’s freezer section. Though according to Mr. Knott, who gets his crawfish from the family pond behind his brewery, the best tasting version is made with leftovers from a crawfish boil — that way you have lots of leftover crawfish fat.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2017/02/22/dining/22JPBAYOU6/22JPBAYOU6-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "cajun", "recipeCategory": "dinner, seafood", "keywords": "crawfish, poblano chili, rice, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 102}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 678, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "1 gram", "proteinContent": "30 grams", "saturatedFatContent": "22 grams", "sodiumContent": "750 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 sticks unsalted butter", "1 diced onion", "1 seeded and diced poblano chile pepper", "3 celery stalks, diced", "3 garlic cloves, minced", "1 teaspoon salt, plus more to taste", "1/2 teaspoon black pepper", "1 teaspoon dried thyme", "1/2 teaspoon cayenne pepper", "2 pounds frozen precooked crawfish tails, thawed in their packages", "1/2 cup diced green onions", "1/2 cup diced parsley leaves", "2 cups medium-grain rice", "2 tablespoons unsalted butter", "1 teaspoon salt", "2 to 3 bay leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the étouffée: In a large soup pot or Dutch oven, melt butter over medium heat. Add onions, poblano chile, celery and garlic and cook until softened and translucent, about 8 minutes or so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the heat and add 1 teaspoon salt, the black pepper, the thyme and the cayenne pepper. Place the thawed crawfish meat in a bowl and set it aside in the refrigerator; use your fingers to squeeze any fat or liquid you can from their packages into the pot. Simmer, stirring occasionally, for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add thawed crawfish tails and green onions to the pot and cook for 10 minutes, or until crawfish are tightly curled. Add parsley and cook 5 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the vegetables simmer, prepare the rice: Place all ingredients in a saucepan with 3 1/2 cups water and bring to a boil. Stir, then turn the heat down to very low and cover. Simmer for 20 minutes, then take the pot off the heat. Let it rest, covered, for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the étouffée and add salt as needed. Serve over the rice."}]}