{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Chicken and Dumplings", "description": "It doesn’t get more comforting than a simmering pot of chicken and soft, fluffy dumplings. This one is relatively classic, though I’ve added some chives to the dumplings for color and freshness. But feel free to leave them out for something more traditionally beige. Or stir in a handful of thawed frozen peas at the end for sweetness and a touch of green.\n\nI prefer using all dark meat here—a combination of drumsticks and thighs gives great flavor and won’t overcook as readily as white meat. But use whatever pieces you like, or a combination. If using all white meat, cook it for a minute or two less.\n\n\n<i>This is one of <a href=\"/68861692/7716592-melissa-clark-dinner-in-an-instant\">10 recipes</a> from Melissa Clark’s “Dinner in an Instant: 75 Modern Recipes for Your Pressure Cooker, Multicooker, and Instant Pot” (Clarkson Potter, 2017).</i>\n\n<i>Melissa Clark’s <a href=\"http://www.penguinrandomhouse.com/books/562277/dinner-in-an-instant-by-melissa-clark/9781524762964/\">“Dinner in an Instant”</a> is available everywhere books are sold. <a href=\"https://www.amazon.com/Dinner-Instant-Recipes-Pressure-Multicooker-ebook/dp/B06XK41BQV/?tag=NYTBks-20&ascsubtag=dinnerinstant\">Order your copy today.</a></i>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/09/25/dining/chickendumplings/chickendumplings-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, cookbook exclusive, dumplings, poultry, soups and stews", "keywords": "all-purpose flour, chicken, chicken stock, chives, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 333}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 609, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "78 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "5 grams", "proteinContent": "21 grams", "saturatedFatContent": "13 grams", "sodiumContent": "1207 milligrams", "sugarContent": "11 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 1/2 pounds bone-in chicken pieces, preferably dark meat", "1 1/2 teaspoons kosher salt, plus more as needed", "1/2 teaspoon freshly ground black pepper", "4 tablespoons (1/2 stick) unsalted butter", "2 carrots, diced", "2 celery stalks, diced", "1 Spanish onion, diced", "1 turnip, peeled and diced", "4 garlic cloves, smashed", "1/4 cup all-purpose flour", "1 quart <a href=\"/recipes/1018861\">chicken stock</a>, preferably homemade", "Chopped fresh parsley or celery leaves, for serving", "1 1/2 cups all-purpose flour", "1/2 cup fine cornmeal", "1/4 cup minced fresh chive (optional)", "2 teaspoons baking powder", "3/4 teaspoon kosher salt", "1/4 teaspoon freshly ground black pepper", "2 tablespoons butter, melted", "3/4 cup whole milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss the chicken pieces with the salt and pepper. Let them sit for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the sauté function, melt 2 tablespoons of the butter in the pressure cooker. Add the chicken pieces, in batches, and brown them on all sides until deep golden brown, about 5 minutes per side. Transfer the chicken to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 2 tablespoons butter to the pressure cooker and stir in the carrots, celery, onion, turnip, and garlic cloves. Cook until softened, about 10 minutes. Then stir in the flour and cook until the mixture starts to turn golden, about another 3 minutes. Stir in the chicken stock, scraping up the browned bits from the bottom of the pot, and nestle the browned chicken into the vegetables. Cover and cook on high pressure for 13 minutes, and then release the pressure manually. Transfer the chicken pieces to a plate, reserving the broth in the pot. When the chicken is cool enough to handle, remove the bones and skin if you like, and tear the meat into chunks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the dumplings: In a medium bowl, whisk together the flour, cornmeal, chives if using, baking powder, salt, and pepper. Pour the melted butter and the milk into the flour mixture, and stir gently with a spoon or spatula until just combined. Drop spoonfuls of the batter into the broth in the pot, spacing them evenly across the surface. Cover and cook on high pressure for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Test the dumplings by cutting into one and making sure it’s cooked all the way through. If not, turn the sauté function on and simmer the dumplings until they are done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the chicken back into the pot to warm it up, and serve it topped with parsley leaves."}], "link": "https://cooking.nytimes.com/recipes/1018856-pressure-cooker-chicken-and-dumplings"}