{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Noodles With Spicy Pork and Herbs", "description": "This cold rice-noodle dish, dressed in vinegar and chile oil and topped with spicy pork, herbs and peanuts, has roots in Yunnan, a southwestern Chinese province, where the garnish may vary according to the kitchen and season. The dish is quick to put together but can be served at a leisurely pace: Plate it, or set all of the components on the table and let people put together their own bowls the way they like, to their taste. The chef Simone Tong, who runs a Yunnan-inspired noodle restaurant in Manhattan, makes her version with ground pork, peanuts and a mix of fresh herbs but adds raw breakfast radishes and lacto-fermented pickles as well, for extra crunch and flavor. Feel free to do the same, or not; it’s in the spirit of the dish to improvise with what’s in season and what’s on hand.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/07/23/magazine/23eat1/23eat1-articleLarge-v5.jpg", "totalTime": "PT20M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "", "keywords": "pork, rice noodles", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 942}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 698, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "97 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "3 grams", "proteinContent": "19 grams", "saturatedFatContent": "6 grams", "sodiumContent": "513 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound thin, round rice noodles", "2 tablespoons rice vinegar", "1 tablespoon soy sauce", "1 tablespoon black vinegar", "1 tablespoon chile oil (like Lao Gan Ma brand)", "1 teaspoon sugar", "1 tablespoon canola or other neutral oil", "1/2 pound ground pork", "1 teaspoon salt", "2 garlic cloves, sliced", "1 1-inch piece ginger, chopped", "2 scallions, light parts chopped, green parts reserved for garnish", "1 tablespoon yacai (Sichuan preserved vegetables, optional)", "Handful of herbs like mint, basil and cilantro leaves, washed", "1/4 cup salted, roasted peanuts, chopped", "4 breakfast radishes, sliced (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to boil, and cook noodles according to instructions. Drain noodles while running under cold water, until they are cool to the touch. Set aside. Mix dressing by whisking rice vinegar, soy sauce, black vinegar, chile oil and sugar until sugar dissolves. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the pork topping: Heat oil in saucepan over medium heat, and add ground pork and salt. Pan-fry, breaking meat into small pieces with a wooden spoon, until no pink parts and no liquid remain in the pan, about 5 minutes. Add garlic, ginger and scallion whites, and stir occasionally until the raw smell has disappeared and the meat is starting to brown in places, about 5 minutes. Add the vegetables, if using, along with a tablespoon of water, and cook for 2 or 3 minutes more, or until mixture is darkened and thick. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to serve, divide cool, drained noodles into four individual bowls, and top each with a tablespoon of vinegar dressing followed by a pile of ground pork, herbs, peanuts and radishes, to taste. Serve with any remaining garnish, and additional chile oil and chile-oil solids, on the side."}], "link": "https://cooking.nytimes.com/recipes/1018852-rice-noodles-with-spicy-pork-and-herbs"}