{"@context": "http://schema.org", "@type": "Recipe", "name": "Burrata With Fava Beans, Fennel and Celery", "description": "Good fresh burrata — mozzarella’s luscious, creamy-centered cousin — really needs no adornment, just good bread to accompany it (and perhaps a drizzle of olive oil and few arugula leaves). To make it more festive, add a quickly made seasonal vegetable topping and serve the gilded burrata as a salad or antipasto. Bright green fava beans, celery and fennel make a lovely rendition for spring.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/05/24/dining/24KITCHEN-SUB/24KITCHEN-SUB-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "salads and dressings", "keywords": "appetizer, burrata, celery, fava beans, fennel, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 162}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 609, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "27 grams", "proteinContent": "40 grams", "saturatedFatContent": "10 grams", "sodiumContent": "1073 milligrams", "sugarContent": "34 grams", "transFatContent": null}, "recipeIngredient": ["3 pounds fresh fava beans in the pod", "1 small shallot, finely diced", "3 tablespoons lemon juice", "Salt and pepper", "1/4 cup fruity extra-virgin olive oil", "1/2 cup thinly sliced celery (tender inner stalks)", "2/3 cup thinly sliced fennel", "A handful of small arugula leaves", "8 ounces burrata", "Mint or basil, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large saucepan of water to a boil, and fill a large bowl with ice water and keep it nearby. Meanwhile, shuck the fava beans from the pods. Plunge beans into boiling water and cook for about 2 minutes. Drain beans, then cool in the ice water to stop cooking. Blot beans on a clean kitchen towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove outer gray skin from each bean: Pierce with a thumbnail or paring knife and squeeze to pop bean from skin. Your yield should be about 2 1/2 cups peeled beans. Discard skins. (If desired, beans may be peeled several hours ahead or a day in advance and refrigerated. Return to room temperature before proceeding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: Put diced shallot in a small bowl and cover with lemon juice. Add a good pinch of salt and let stand for 5 to 10 minutes. Whisk in olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place fava beans, celery and fennel in a mixing bowl and season with salt and pepper. Add dressing and toss well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place burrata in the center of a platter. Arrange arugula leaves at edges of platter. Spoon fava bean mixture and dressing over and around burrata. Garnish with roughly chopped mint or torn basil leaves and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1018767-burrata-with-fava-beans-fennel-and-celery"}