{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry and Pistachio Galette", "description": "With a double filling of homemade strawberry compote sitting on top of a layer pistachio frangipane, this elegant galette is a perfect way to showcase ripe summer berries. It is a bit more demanding to make than many other galettes, but you can do it in stages, making the dough, the compote and the frangipane a few days ahead, then bake on the same day as you plan to serve it so the pastry stays delightfully crisp. And if you miss strawberry season, make this with raspberries, blackberries or blueberries, adjusting the sugar in the compote to match the sweetness of the fruit (taste and add more sugar for sour fruit, less sugar for sweeter fruit). ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/05/25/dining/24APPE1/24APPE1-mediumThreeByTwo440.jpg", "totalTime": "PT2H30M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "brandy, cream cheese, pistachio, strawberries, dessert, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 459}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 448, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "17 grams", "sodiumContent": "214 milligrams", "sugarContent": "15 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 1/4 cups/280 grams all-purpose flour, plus more for rolling the dough", "1 teaspoon kosher salt", "1 tablespoon granulated sugar", "1 cup/226 grams unsalted butter (2 sticks), very cold, cut in 1-inch pieces", "4 ounces/113 grams cream cheese, very cold, cut in 1-inch pieces", "1 teaspoon lemon juice", "3 to 4 tablespoons/45 to 60 milliliters ice water", "1 pound/454 grams strawberries, hulled and halved", "1/2 teaspoon lemon juice, plus 1/2 teaspoon lemon zest", "1/2 cup/100 grams plus 1 to 2 tablespoons granulated sugar", "3/4 cup/100 grams shelled raw pistachios, plus 2 tablespoons chopped raw pistachios", "1/2 cup/113 grams unsalted butter (1 stick), softened", "3 large eggs", "1 tablespoon brandy", "1/4 teaspoon almond extract (optional)", "Turbinado or Demerara sugar, as needed", "Confectioners’ sugar, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a food processor, pulse to combine flour, salt and sugar. Add butter and cream cheese and pulse until lima-bean-size pieces form. Drizzle in lemon juice and 3 tablespoons/45 milliliters ice water, then pulse just until dough comes together, adding another tablespoon/15 milliliters of water if dough looks dry. Pat into a disc, wrap in plastic, and chill at least 1 hour and up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the strawberry compote: Combine approximately 2/3 of the strawberries in a small pot with the lemon juice and 1 to 2 tablespoons granulated sugar to taste, depending on sweetness of the berries. Cook over medium heat until strawberries start to break down and juices are thick and syrupy, about 12 minutes. Let cool. Compote can be made up to 5 days ahead and stored in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the frangipane: In a food processor, process 3/4 cup/100 grams shelled raw pistachios and remaining 1/2 cup/100 grams sugar until finely ground. Add butter; pulse until combined, then add 2 eggs, the brandy, the lemon zest  and the almond extract (if using), and pulse until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Dust a work surface with flour. Roll out dough to a 16-inch circle (it will be just slightly thicker than 1/8-inch), then transfer to parchment-lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Leaving a 3-inch border around the edges, spread the frangipane filling evenly over dough. Using a slotted spoon, dollop strawberry compote over frangipane, spreading any syrup gently so the compote and frangipane remain in separate layers, then fold dough edges up over the filling. About 6 to 8 inches of the filling should be exposed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk  remaining egg with 1 tablespoon cold water, then brush over the dough. Sprinkle with turbinado sugar and chopped pistachios. Bake until edges are deeply golden, 40 to 50 minutes. Transfer to a wire rack to cool completely. To serve, top with remaining halved strawberries and dust with confectioners’ sugar."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Strawberry and Pistachio Galette", "description": "Pistachio frangipane and strawberry compote give a subtle sophistication to this casual tart.", "thumbnailUrl": "https://static01.nyt.com/images/2017/05/25/dining/24APPE1/24APPE1-mediumThreeByTwo440.jpg", "uploadDate": "2017-05-19T17:13:43.000Z", "duration": "PT3M21S"}, "link": "https://cooking.nytimes.com/recipes/1018764-strawberry-and-pistachio-galette"}