{"@context": "http://schema.org", "@type": "Recipe", "name": "Seeded Molasses Whole-Wheat Dinner Rolls", "description": "Dinner rolls don’t have to be white and fluffy. These flavorful brown-bread rolls are chock full of a variety of tasty seeds and are sweetened with a touch of molasses. The dough resembles a whole-wheat challah, with a crisp crust and a light texture.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/12/07/dining/07KITCH2/07KITCH2-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "About 30 rolls", "recipeCuisine": "", "recipeCategory": "breads", "keywords": "flaxseed, millet, molasses, pepitas, spelt flour, sunflower seeds, whole wheat flour, yeast, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 64}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 135, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "113 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon dark molasses", "2 teaspoons dry active yeast", "1 1/2 cups/375 milliliters cold water", "2 cups/250 grams unbleached bread flour", "1/4 cup/40 grams flax seed", "1/4 cup/50 grams millet", "1/4 cup/30 grams sunflower seeds", "1/4 cup/40 grams pepita seeds", "2 eggs, beaten", "1/4 cup/60 milliliters olive oil", "1 cup/140 grams spelt flour", "2 cups/300 grams whole-wheat flour, more for flouring work surface", "2 teaspoons kosher salt", "1 egg, beaten", "1 teaspoon caraway seeds", "1 teaspoon cumin seeds", "1 tablespoon sesame seeds", "1 teaspoon nigella seeds", "1 teaspoon anise seeds", "Sea salt, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sponge: Put molasses, yeast and water in a large mixing bowl (or the bowl of a stand mixer) and stir to dissolve. Whisk in bread flour to obtain a batterlike consistency. Cover bowl with plastic wrap and leave at room temperature until mixture looks active, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, soak the larger seeds for the dough: Put flax, millet, sunflower and pepita seeds in a small bowl and cover with boiling water. Leave to soak for 30 minutes, then drain. Rinse with cool water and drain well, then stir soaked seeds into the sponge mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add eggs, olive oil, spelt flour, whole-wheat flour and salt. Mix well with a wooden spoon until dough comes together in a shaggy mass. Turn out onto a lightly floured work surface and knead for 5 minutes or so, until dough forms smooth ball. (Use only enough flour to help with kneading; dough will be a bit sticky.) Alternatively, use the dough hook of a stand mixer to knead the dough for 4 to 5 minutes, until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to a large zip-top plastic storage bag and refrigerate overnight for a slow, cool rise. (If you wish to skip this step, leave dough to rise in the bowl covered with plastic wrap until doubled, about 1 hour; see note.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Put risen dough on a lightly floured work surface. Cut dough into 3-ounce/85-gram pieces. Form each piece into a tight ball. Place 2 inches apart on a parchment-lined baking sheet. Cover dough balls loosely with a large piece of plastic wrap and place baking sheet in a warm spot until balls have doubled, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover and paint tops of balls lightly with beaten egg. Mix together caraway, cumin, sesame, nigella and anise seeds. Sprinkle seed mixture over each ball, then sprinkle with sea salt, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 15 to 20 minutes, or until nicely browned. Cool on a rack."}], "link": "https://cooking.nytimes.com/recipes/1018458-seeded-molasses-whole-wheat-dinner-rolls"}