{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Roasted Breast of Veal", "description": "A whole breast of veal is a succulent, fatty, tender magnificence to enjoy, at any time, but especially so when you have holiday turkey and ham fatigue. It doesn’t make immediate sense that I consider the veal — with its fat and cartilage and bone and sinew and silver skin — a light meal, but in my experience, the few bites of sticky tender meat you end up with are so outrageously succulent and hit the spot so hard you don’t need more. The long, slow, low overnight cooking is perfect for both the meat and your schedule if you are trying to pull off a real, civilian party — and sit down at it.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2016/11/27/magazine/27feast-recipe4-roasted-veal/27feast-recipe4-roasted-veal-articleLarge-v2.jpg", "totalTime": "PT12H30M", "recipeYield": "Serves 10-20", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, roasts", "keywords": "fall, winter, main course, onion, potato, veal", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "recipeIngredient": ["Whole breast of veal — approximately 15 pounds", "Salt", "Freshly ground black pepper", "Ground juniper", "Ground allspice", "Fresh thyme", "Olive oil", "4 Yukon Gold potatoes", "1 large yellow onion", "Dry white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Vaguely trim breast — just the fat globs on the rib cage and any especially skanky skin, if it even exists. If the blue U.S.D.A. ink stamp on the flesh offends you, remove it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place breast in a deep roasting pan large enough to accommodate it, and season meat thoroughly and assertively with salt, all over, turning the breast ribs-side up as well, seasoning with salt all over. Do the same thing, less assertively by half, with ground black pepper. Set breast back in pan ribs-side down, and season the flesh side extremely conservatively with both ground juniper and ground allspice. A light hand here, please. Strip a few pinches of fresh thyme leaves from their stems, and scatter over the veal. Drizzle generously with the oil, allowing some to pool in roasting pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the veal sit at room temperature to shake the chill from the refrigerator while you prepare the potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and cut into wedges 4 Yukon Gold potatoes, and scatter around in pan. Peel and halve the onion, and slice into 1/3-inch-thick half-moons. Scatter onion around in pan on top of potatoes. Keep potato and onion under the meat, not on top of it, so that breast can fully brown and get a crisp skin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill roasting pan 2 inches deep with water and white wine, in equal parts. Set in 275-degree oven, and let roast for up to 12 hours, depending on weight. Remove when it is deeply golden brown and soft and tender. You don’t want it falling off the bone, but you should be able to see how loose and relaxed it has become in the layers. You may need to tent the pan with foil for the first or the last 45 minutes of roasting to give it a little braise time for the deepest interior, recalcitrant parts. Conversely, you may want to turn up the oven and give it a 30-minute finish in a hot oven to get better color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick out vertebrae. Slice off ribs. Then portion as you wish, using a sharp knife big enough for the job. Include the potatoes and onions and the liquid from the pan when you serve."}], "link": "https://cooking.nytimes.com/recipes/1018439-whole-roasted-breast-of-veal"}