{"@context": "http://schema.org", "@type": "Recipe", "name": "Kuku Paka (Chicken With Coconut)", "description": "This rich dish of chicken in a spiced coconut sauce comes from Kenya's coast, though creative cooks now produce variations of it all over the country. This simple version was adapted from many of them, including Kirti Patel, Agnes Kalyonge and the author Madhur Jaffrey. It requires slowly grilling the marinated chicken, ideally over charcoal — a little extra work that lends the finished kuku paka a wonderful smoky flavor — though in a pinch, you can use a grill pan on the stove. Note: The coconut sauce should be creamy but not flat, so be sure to spike it at the end with enough lemon juice to give it the edge of sourness that is one of this great dish's defining characteristics.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/06/21/dining/21KENYA1/21KENYA1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "african", "recipeCategory": "dinner, barbecues, poultry", "keywords": "chicken thigh, coconut milk, coconut oil, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 914}, "recipeIngredient": ["4 pounds chicken thighs and drumsticks on the bone", "3 plum tomatoes", "1 white onion, peeled and quartered ", "1 2-inch piece ginger, peeled", "4 garlic cloves, peeled", "4 serrano chiles, stemmed and seeded (use fewer if you prefer a mild dish)", "2 teaspoons kosher salt", "2 teaspoons ground cumin", "1 teaspoon ground coriander", "2 tablespoons coconut oil", "27 ounces (2 cans) coconut milk", "Juice of 1 lemon", "Handful of cilantro leaves, chopped, for garnish", "Rice, chapati or flatbread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim any excess skin from the chicken, keeping some skin intact. Score each chicken piece in 2 or 3 places, slicing about a half-inch into the meat. In a food processor, combine the tomatoes, onions, ginger, garlic, chiles, salt, cumin and coriander. Process until a rough paste forms. Rub 1 scant cup of the mixture all over the chicken, into the cuts and under the skin, reserving the rest for the sauce. Set chicken aside in the refrigerator for at least 1 hour, or up to 5."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare and light a charcoal grill. Meanwhile, as the grill heats, prepare the sauce: In a large pan, heat the coconut oil over medium heat and add the remaining paste, stirring occasionally, until all of the water in mixture evaporates and the oil separates, becoming visible on the surface, about 15 minutes. Continue to cook, stirring more frequently so the bottom doesn’t burn, until the paste is thick and dark and the raw smell has lessened, about 5 minutes. Add the coconut milk and simmer until the sauce is about as thick as cake batter and has turned a mellow shade of orange, about 20 to 25 minutes, then turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the marinated chicken, turning the pieces so the skin is browned and the meat is cooked through, then add to the sauce. If the sauce has become too thick to coat the meat and provide a good gravy, stir in a splash of water. Turn the heat back on to low, cover and simmer for 5 minutes, or until the flavors have melded. Taste the sauce and adjust seasoning with salt and lemon juice, then garnish with cilantro. Serve with rice, chapati or flatbread."}], "link": "https://cooking.nytimes.com/recipes/1018802-kuku-paka-chicken-with-coconut"}