{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Garlicky Beans With Broccoli Rabe", "description": "This white bean dish isn’t shy when it comes to garlic. It’s used in the pot along with the simmering beans, and also fried in olive oil as a crunchy, pungent garnish. As a contrast, the broccoli rabe and red onion get very sweet when you sauté them slowly until they are browned and caramelized. Alongside the soft, mild white beans, it’s a satisfying and comforting dish with a garlicky kick.\n\n\n<i>This is one of <a href=\"/68861692/7716592-melissa-clark-dinner-in-an-instant\">10 recipes</a> from Melissa Clark’s “Dinner in an Instant: 75 Modern Recipes for Your Pressure Cooker, Multicooker, and Instant Pot” (Clarkson Potter, 2017).</i>\n\n<i>Melissa Clark’s <a href=\"http://www.penguinrandomhouse.com/books/562277/dinner-in-an-instant-by-melissa-clark/9781524762964/\">“Dinner in an Instant”</a> is available everywhere books are sold. <a href=\"https://www.amazon.com/Dinner-Instant-Recipes-Pressure-Multicooker-ebook/dp/B06XK41BQV/?tag=NYTBks-20&ascsubtag=dinnerinstant\">Order your copy today.</a></i>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/09/25/dining/garlickybeansbroccolirabe/garlickybeansbroccolirabe-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, beans, cookbook exclusive", "keywords": "broccoli rabe, cannellini beans, garlic, rosemary, gluten-free, vegan, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 366}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 392, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "11 grams", "proteinContent": "15 grams", "saturatedFatContent": "3 grams", "sodiumContent": "357 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 pound dried cannellini or other white beans", "7 garlic cloves: 4 smashed, 3 thinly sliced", "4 tablespoons plus 1/2 cup extra-virgin olive oil, plus more as needed", "2 1/2 teaspoons kosher salt, plus more as needed", "1 large sprig fresh rosemary", "1 bay leaf", "1 carrot, trimmed", "1 large or 2 small red onions, halved and thinly sliced", "1 pound fresh broccoli rabe, woody ends trimmed", "1/8 teaspoon crushed red pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the pressure cooker, combine the beans, 7 cups of water, the 4 smashed garlic cloves, 2 tablespoons of the oil, and 2 teaspoons of the salt. Tie the rosemary, bay leaf, and carrot together with kitchen twine, and then drop the bundle into the pressure cooker. Cover, and cook on high pressure for 25 minutes. Allow the pressure to release naturally. If the beans aren’t done, cook on high pressure for another 5 minutes, then manually release the pressure."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the beans are cooking, heat 1/2 cup oil in a large skillet over medium-low heat. Stir in the sliced garlic and a pinch of salt, and sauté until the garlic is just starting to turn golden, 2 to 3 minutes. Transfer the garlic oil to a small bowl and reserve for the garnish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the skillet to the stove, raise the heat to medium-high, and add the remaining 2 tablespoons oil. Stir in the onion and cook until golden, about 5 minutes. Raise the heat to high and stir in the broccoli rabe, remaining 1/2 teaspoon salt, and the red pepper flakes, tossing to coat with the oil. Add 1/2 cup of water to the skillet, and cook until the water has been absorbed and the broccoli rabe is softened and browned, about 10 minutes (drizzle in more oil as necessary to prevent sticking)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, remove the herb bundle from the bean pot and then drain the beans, reserving the liquid if you like (use it like stock). Place the beans in a shallow bowl or on a platter. Drizzle the beans with the garlic oil, and top with the broccoli rabe."}], "link": "https://cooking.nytimes.com/recipes/1018860-pressure-cooker-garlicky-beans-with-broccoli-rabe"}