{"@context": "http://schema.org", "@type": "Recipe", "name": "Ricotta Gnocchi With Parsley Pesto", "description": "Gnocchi are little savory Italian dumplings, most often served as a  pasta course. They are often made from a dough of potato, egg and flour, but there are many kinds. Some are made with cooked semolina, such as gnocchi alla romana, which are baked with cream and cheese. Fresh ricotta is the secret for these exceedingly light, airy dumplings. Bound with eggs and only a handful of flour, they can be served in broth, with a light tomato sauce, tossed with butter and sage leaves, or with a simple green pesto. Look for  the best fresh ricotta: The low-fat commercial type doesn’t qualify. Drain it well before using, or the dough will be too wet. Put it in a fine mesh sieve set over a bowl and refrigerate for several hours or overnight. Use the drained liquid whey in soups or smoothies.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/02/08/dining/08KITCH1/08KITCH1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, pastas", "keywords": "appetizer, main course, side dish, garlic, parmesan, parsley, pistachio, rice flour, ricotta, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 181}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 327, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "1 gram", "proteinContent": "11 grams", "saturatedFatContent": "11 grams", "sodiumContent": "283 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound fresh ricotta, about 2 cups, drained well", "Salt and pepper", "3 or 4 tablespoons grated Parmesan, plus more for serving", "2 eggs, beaten", "1/4 to 1/2 cup all-purpose flour, as needed", "Fine semolina flour or rice flour, for dusting", "3 cups flat-leaf parsley leaves and tender stems", "1 small garlic clove, minced", "1/2 cup extra-virgin olive oil", "3 tablespoons unsalted butter", "1/4 cup toasted pistachios, roughly chopped for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put ricotta in a large mixing bowl and season generously with salt and pepper. Whisk in Parmesan and taste. The mixture should be well seasoned. Add eggs and mix well, then sprinkle in 1/4 cup flour and stir with a wooden spoon to incorporate. You should have a soft, rather sticky dough. Dump dough onto a clean work surface. Add a little more flour if necessary and pat very lightly to form a soft mass."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Test the dough: Bring a saucepan of well-salted water to a boil. Take 1 tablespoon of dough and drop into water. Dough should sink to the bottom, then rise to the surface. Let simmer 1 minute, then remove and taste. If the dumpling keeps its shape, continue to Step 3. If it falls apart, add a little more flour to the dough, but carefully: If you add too much, the gnocchi will be stodgy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust dough lightly with semolina, then cut it into 4 equal parts. Dust work surface with semolina. With your hands flat, gently roll each piece into a rope about 3/4-inch in diameter and 12 inches long. Keep sprinkling semolina on dough to keep it from sticking to the counter or your hands."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using scissors or a sharp, thin-bladed knife, cut each log into 12 pieces. Dust bottom of a baking sheet with semolina. Transfer gnocchi with a spatula to baking sheet, leaving space between them so they are not touching. Refrigerate, uncovered, for 1 hour (or leave in a cool room)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the parsley pesto, put parsley, garlic, olive oil and butter in the work bowl of a food processor. Pulse briefly, then blend to a rough purée. Taste and season with salt and pepper. You should have about 1 cup pesto, more than you need for this recipe. Leftover pesto can be refrigerated for up to 3 days, or frozen for up to a month."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large pot of well-salted water over high heat and bring to a boil. Add gnocchi, working in batches, if necessary. When they bob to the surface, let them cook for about 2 minutes and lift them from the pot with a slotted spoon or spider, transferring gnocchi to a large, wide skillet. Add 4 to 6 tablespoons pesto and 1/2 cup pasta cooking water to skillet and swirl pan to coat gnocchi."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve gnocchi in warmed individual shallow soup bowls or a deep, wide platter. Sprinkle with chopped pistachios and dust with Parmesan. Pass more grated Parmesan separately."}]}