{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Tenderloin Stuffed With Herbs and Capers", "description": "Pork tenderloin is a lean cut that can easily dry out. But stuffing it with herbs, shallots and capers helps keep it nice and juicy as it roasts in a hot oven, and tying up the meat so it’s the same thickness all over helps it cook evenly. After the pork is roasted, the drippings are simmered with orange juice, garlic and a little wine to make a quick, gently sweet pan sauce that goes wonderfully well with the meat. Serve with polenta, crusty bread or rice to soak up the sauce. ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/04/18/dining/19app-1/19app-1-mediumThreeByTwo440.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, one pot, roasts", "keywords": "capers, orange juice, pork tenderloin, rosemary, sage, shallot, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 516}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 433, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "3 grams", "proteinContent": "43 grams", "saturatedFatContent": "7 grams", "sodiumContent": "730 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 3/4 pounds pork tenderloin", "1 teaspoon kosher salt, more to taste", "1/2 teaspoon ground black pepper", "3 tablespoons extra-virgin olive oil", "4 shallots, minced", "2 1/2 tablespoons minced capers, plus a splash of their liquid", "2 1/2 teaspoons chopped sage", "1 1/2 teaspoons chopped rosemary", "1 1/2 teaspoons chopped thyme, more for serving", "1 garlic clove, finely grated or minced", "1 tablespoon dry white wine or vermouth (or use more stock)", "1/4 cup freshly squeezed orange juice", "1/4 cup pork, chicken or other meat stock", "1 to 2 tablespoons butter", "Squeeze of fresh lemon juice (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Slice pork tenderloin lengthwise to butterfly it, but don't  quite slice all the way through: The 2 pieces should remain attached. Season with salt and pepper, then let sit while you prepare filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, oven-safe skillet, heat 2 tablespoons oil over medium-high heat. Stir in shallots, 1/2 tablespoon capers, 2 teaspoons sage, 1 teaspoon rosemary, 1 teaspoon thyme and salt and pepper to taste. Stirring frequently, cook until shallots start to brown, about 5 minutes, then stir in garlic and cook until fragrant, about 1 minute. (Adjust heat if necessary to prevent burning.) Transfer to a plate to cool slightly. Wipe out skillet and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread cooled filling evenly on pork, then close pork, along the hinge, like a book. Then fold the thinner end up against the thicker portion so that pork is the same width all over. Tie with kitchen twine at 1 1/2-inch intervals."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, heat remaining 1 tablespoon oil over medium heat until oil is hot but not smoking. Place tenderloin seam-side up in the skillet, then transfer to oven and roast for 15 minutes. Flip pork over and continue roasting until meat reaches 140 to 145 degrees in the center, about 10 minutes longer. Transfer meat to a cutting board to rest; reserve skillet and juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the meat rests, make the sauce: Heat skillet over medium-high heat, then stir in vermouth and the remaining 1/2 teaspoon each sage, rosemary and thyme, scraping up the browned bits on bottom of pan. Cook until vermouth is almost evaporated, then add orange juice and stock, and cook over medium-high heat until thickened and syrupy. Whisk in remaining 2 tablespoons capers, their liquid and the butter; season with salt and pepper to taste. If the sauce tastes too sweet, add a squeeze of lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, slice pork into 1/2-inch-thick slices and top with sauce and fresh thyme."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Pork Tenderloin Stuffed with Herbs and Capers", "description": "Sautéed shallots, capers and herbs add extra layers of flavor to this one-pot meal.", "thumbnailUrl": "https://static01.nyt.com/images/2017/04/18/dining/19app-1/19app-1-mediumThreeByTwo440.jpg", "uploadDate": "2017-04-14T17:19:00.000Z", "duration": "PT2M45S"}, "link": "https://cooking.nytimes.com/recipes/1018725-pork-tenderloin-stuffed-with-herbs-and-capers"}