{"@context": "http://schema.org", "@type": "Recipe", "name": "Bittersweet Chocolate Soufflé", "description": "Dark and intense in flavor, yet with a light and custardy texture, a chocolate soufflé is an eternal showstopper of a dessert. To get that intense chocolate flavor, this version uses a base of melted butter and chocolate without any starch. Be sure to use excellent bittersweet chocolate, but if you prefer a slightly sweeter soufflé, feel free to substitute milk chocolate for all or part of the bittersweet. Or to move the soufflé in the other direction, substitute a chocolate with a higher cocoa solids ratio, 70 to 75 percent, which will decrease the overall sugar. For maximum \"wow\" factor, always serve a soufflé straight from the oven. Crème anglaise or chocolate sauce would be fine accompaniments, as would scoops of your favorite ice cream. This recipe is part of <a href=\"https://cooking.nytimes.com/new-essentials-french-cooking\">The New Essentials of French Cooking</a>, a guide to definitive dishes every modern cook should master. <a href=\"https://store.nytimes.com/products/new-essentials-of-french-cooking\">Buy the book.</a>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/01/13/dining/13SOUFLE-3/13SOUFLE-3-mediumThreeByTwo440.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "bittersweet chocolate, eggs, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 324}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 411, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "18 grams", "sodiumContent": "116 milligrams", "sugarContent": "29 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 cup/114 grams unsalted butter (1 stick), softened, plus more for coating dish", "4 tablespoons/50 grams granulated sugar, plus more for coating dish", "8 ounces/225 grams bittersweet chocolate (60 to 65 percent cacao), finely chopped", "6 eggs, separated, at room temperature", "Pinch fine sea salt", "1/2 teaspoon cream of tartar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove wire racks from oven and place a baking sheet directly on oven floor. Heat oven to 400 degrees. Generously butter a 1 1/2-quart soufflé dish. Coat bottom and sides thoroughly with sugar, tapping out excess. For the best rise, make sure there is sugar covering all the butter on the sides of the dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, melt chocolate and butter either in the microwave or in a bowl over a pot of simmering water. Let cool only slightly (it should still be warm), then whisk in egg yolks and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer, beat egg whites and cream of tartar at medium speed until the mixture is fluffy and holds very soft peaks. Add sugar, 1 tablespoon at a time, beating until whites hold stiff peaks and look glossy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently whisk a quarter of the egg whites into the chocolate mixture to lighten it. Fold in remaining whites in two additions, then transfer batter to prepared dish. Rub your thumb around the inside edge of the dish to create about a ¼-inch space between the dish and the soufflé mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dish to baking sheet in the oven, and reduce oven temperature to 375 degrees. Bake until soufflé is puffed and center moves only slightly when dish is shaken gently, about 25 to 35 minutes. (Do not open oven door during first 20 minutes.) Bake it a little less for a runnier soufflé and a little more for a firmer soufflé. Serve immediately."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Recipe: Bittersweet Chocolate Soufflé", "description": "A savory or sweet dish in which a roux or purée is mixed with egg yolks and whipped whites and baked until light and ethereal.", "thumbnailUrl": "https://static01.nyt.com/images/2017/01/13/dining/13SOUFLE-3/13SOUFLE-3-mediumThreeByTwo440.jpg", "uploadDate": "2017-01-17T22:10:16.000Z", "duration": "PT3M52S"}}