{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Tetrazzini", "description": "Chicken tetrazzini takes its name from the Italian opera star Luisa Tetrazzini, and was a mainstay of upscale restaurant menus of the early 20th century. Today, though, it is hardly fancy. (And definitely not Italian.) The recipe that follows is built on the frame of what might be called a Mississippi-style tetrazzini, made with canned tomatoes and chiles and processed cheese. The chef Brad McDonald, who grew up in Yazoo City, at the top of the Delta, used to cook a bespoke version for his tasting menu at the Lockhart, a restaurant in London, using washed-rind Irish cheese and a mixture of roasted green bell peppers and jalapeños to flavor his shredded chicken, along with porcini mushrooms and guajillo chiles. I made a few changes of my own, and discovered a weeknight casserole of great distinction.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/10/02/magazine/02eat/02mag-02eat-t_CA0-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "american, italian", "recipeCategory": "dinner, for two", "keywords": "chicken, poblano pepper, porcini mushrooms, spaghetti, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 410}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 649, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "3 grams", "proteinContent": "39 grams", "saturatedFatContent": "12 grams", "sodiumContent": "777 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 ounce dried porcini mushrooms", "4 medium-size poblano peppers", "5 dried guajillo chiles, ends snipped and seeds discarded", "1 1/2 cups chicken stock, homemade or low-sodium", "1 1/2 cups whole milk", "3 cloves garlic, peeled and thinly sliced", "1 medium-size shallot, peeled and thinly sliced", "8 ounces Cheddar cheese, grated", "1 pound spaghetti", "1 store-bought rotisserie chicken, the meat removed and shredded, approximately 1 pound", "1 lemon, juiced", "Kosher salt and freshly ground black pepper to taste", "1/4 cup parsley, roughly chopped, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn broiler to high, and set a large pot filled with salted water over high heat to come to a boil. As oven heats, place the mushrooms in a small bowl, and pour boiling water over them, then leave them to soak for approximately 20 to 25 minutes, then strain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the poblanos on a small sheet pan, and set on the highest rack under the broiler so that the skin blackens, turning a few times so that the roasting is even, approximately 15 to 20 minutes. When the skin is blackened and blistered all over, place the peppers in a medium bowl, cover it with a plate and allow to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce. Put the dried chiles in a medium pot set over medium-high heat, and allow them to cook until they become fragrant, approximately 5 to 7 minutes, then turn heat to low, and add the chicken stock, milk, garlic and shallots. Allow the mixture to cook at just below a simmer for approximately 10 minutes, or until the chiles have softened. Remove from heat, and pour into a blender, then add 6 ounces of the grated Cheddar, and process to a smooth consistency. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, remove the skin and seeds from the roasted poblanos, and cut them into thin strips. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400. Cook the spaghetti in the boiling salted water in the large pot until just al dente, approximately 9 to 10 minutes. Drain, and rinse under cold water until cool, then drain again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the spaghetti to the cooking pot, and toss it with the roasted pepper strips, the mushrooms, the shredded chicken meat and the lemon juice, then season with salt and pepper. Transfer to a casserole dish, approximately 9 inches by 13 inches, and pour the reserved cheese sauce over it. Cover with the remaining shredded cheese, place in oven and bake until the cheese has melted and started to turn golden brown, approximately 20 minutes. Garnish with chopped parsley, if you like, and serve."}]}