{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweeney Potatoes", "description": "This is a variation of a dish sometimes called \"company potatoes,\" popular in the postwar kitchens of the 1950s, made with canned condensed soups and frozen hash browns. Maura Passanisi, of Alameda, Calif., shared it with The Times as a tribute to her grandmother, Florence Sweeney, who originally served it as a Thanksgiving side dish. Ms. Passanisi uses fresh russet potatoes and no condensed soup, but plenty of cream cheese, sour cream, butter and cheese. \"Legendary,\" she calls the dish. And so it is. Small portions are best. It's rich. And feeds a crowd.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/11/11/dining/COOKING-POTATOES2/COOKING-IRISH2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "cheddar, cream cheese, potato, sour cream, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 978}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 412, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "19 grams", "sodiumContent": "478 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 1/2 pounds russet potatoes, scrubbed and cut into 1/4-inch cubes", "1 (8-ounce) package cream cheese, at room temperature", "1/2 cup unsalted butter, melted, plus more butter for the pan", "1 cup sour cream", "1/4 to 1/2 cup whole milk", "Kosher salt and ground black pepper, to taste", "2 1/2 cups freshly grated sharp Cheddar cheese (about 8 ounces)", "Chopped fresh parsley, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Put potatoes in a large heavy-bottomed pot and cover with cold water. Set on stove over high heat and bring to a boil, then reduce heat and allow potatoes to simmer until they have just started to soften, about 10 minutes. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine cream cheese, melted butter and sour cream in a large bowl and stir to combine. Add enough milk so that the mixture is creamy but not soupy. Season mixture with salt and pepper to taste. Add potatoes to bowl and stir gently to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously grease a 9-by-13-inch baking dish. Tip half the potatoes into the dish and spread to the edges, then scatter half the grated cheese over the top. Add remaining potatoes and spread to the edges, then top with remaining cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until casserole is bubbling at the edges and cheese has melted across the top, 30 to 35 minutes. Sprinkle with parsley before serving, if you'd like."}], "link": "https://cooking.nytimes.com/recipes/1018412-sweeney-potatoes"}