{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Satay With Thai Spices and Peanut Sauce", "description": "Throughout Southeast Asia, little skewers of marinated meat, grilled over coals, are sold as street snacks. Sweetly fragrant with coconut milk and spices, they are perfect for barbecue parties served with steamed rice, or on their own with drinks, whether grilled indoors or out. You may use pork loin or tenderloin, but marbled sirloin or shoulder is more succulent.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/04/27/dining/27KITCHEN/27KITCHEN-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "12 small skewers", "recipeCuisine": "thai", "recipeCategory": "finger foods", "keywords": "appetizer, coconut milk, cucumber, fish sauce, ginger, lemongrass, peanut, pork, thai chile", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 298}, "recipeIngredient": ["1 1/2 pounds pork loin, tenderloin or shoulder, sliced into thin rectangles (1/4 inch x 1 inch x 2 inches; you should have about 24 pieces)", "1 shallot, minced", "2 garlic cloves, minced", "1 tablespoon grated ginger", "3 tablespoons chopped lemongrass", "1 teaspoon cumin seeds, toasted and ground", "1 teaspoon coriander seeds, toasted and ground", "1 1/2 teaspoons turmeric", "1/4 teaspoon cayenne", "1 tablespoon fish sauce", "1 tablespoon lime juice", "2 teaspoons soy sauce", "1 tablespoon brown sugar", "1/2 cup coconut milk", "Cilantro and basil leaves, for garnish (optional)", "1 pound Persian or Japanese cucumbers, peeled, halved and cut into 1/4-inch slices", "1/2 teaspoon salt", "2 tablespoons lime juice", "2 tablespoons granulated sugar", "2 small shallots thinly sliced, about 1/4 cup", "2  fresh Thai or serrano chiles, sliced into rounds", "1 cup dry roasted peanuts, unsalted", "2 cloves garlic, chopped", "1 teaspoon soy sauce", "2 teaspoons sesame oil", "2 tablespoons brown sugar", "2 tablespoons fish sauce", "2 tablespoons lime juice, more to taste", "1/8 teaspoon cayenne", "1/2 cup coconut milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the skewers: Put pork in a mixing bowl. In a separate bowl, stir together shallot, garlic, ginger, lemongrass, cumin, coriander, turmeric, cayenne, fish sauce, lime juice, soy sauce, brown sugar and coconut milk, and pour over meat. Toss with your hands to coat well. Let marinate for at least 30 minutes or overnight. Meanwhile, soak 12 bamboo skewers in water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cucumbers: Put cucumbers in a mixing bowl and season with salt. Add lime juice, sugar, shallots and chiles and toss to coat. Let stand for 15 minutes. Check seasoning, then transfer to a serving dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the peanut sauce: Pulse the peanuts briefly in a food processor just until finely ground. Add the garlic, soy sauce, sesame oil, brown sugar, fish sauce, lime juice, cayenne and coconut milk, and process until well puréed. Transfer to a bowl, then taste and adjust seasoning. Thin a bit with lime juice or water as desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thread 2 slices of pork onto each bamboo skewer, keeping the meat as flat as possible. Grill over hot coals, under the broiler or on a stovetop grill pan for 3 minutes on each side, until cooked through and lightly browned. Transfer to a platter and garnish with cilantro and basil leaves. Serve with cucumber relish and peanut sauce."}], "link": "https://cooking.nytimes.com/recipes/1018070-pork-satay-with-thai-spices-and-peanut-sauce"}