{"@context": "http://schema.org", "@type": "Recipe", "name": "Aligot (Mashed Potatoes With Cheese)", "description": "Somewhere between buttery mashed potatoes and pure melted cheese lies aligot, the comforting, cheese-enhanced mashed-potato dish from central France. The key to getting a smooth, airy texture is to rice the potatoes while they're still hot, then incorporate cold butter, hot milk and grated cheese over low heat. To build up the stringiness of that melting cheese, Ham el-Waylly, a chef at the Brooklyn restaurant Hail Mary, suggests whipping it with confidence, speed and vigor. This is what will create aligot's characteristic cheese strings: long and sheer, with some elasticity. \"They should fight with you,\" Waylly says. While fresh tomme or Cantal is traditional, Gruyère or Comté work well, too.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2016/11/20/magazine/20eat-copy/20eat-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "butter, cheese, potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 283}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 630, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "1 gram", "proteinContent": "20 grams", "saturatedFatContent": "32 grams", "sodiumContent": "531 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 pound russet potatoes, peeled and quartered", "1/4 pound cold, unsalted butter, cut into 1/2-inch cubes", "1/2 cup cream, heated", "1/2 pound Comté or Gruyère cheese, grated", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer the potatoes in water until very tender to the point of a knife, about 15 to 20 minutes. Drain potatoes, and tip out any remaining water from the pot. Push the hot potatoes through a ricer back into the pot. Over low heat, use a heatproof spatula to move the potatoes around the pot for a minute so that any excess water can evaporate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter to the potatoes, half at a time, stirring until completely incorporated. Add hot cream, half at a time, stirring until incorporated. Add cheese a little bit at a time, stirring vigorously, until all the cheese is evenly melted and the spoon makes cheesy strings as you pull it away from the potatoes. If necessary, turn the heat up a little. Taste, and season with salt. Serve."}]}