{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Mango or Banana Lassi", "description": "Like other South Floridians, the chef Niven Patel of Ghee Indian Kitchen in Miami has access to fresh, locally grown, exceptionally flavorful varieties of bananas and mangoes he can ripen to perfection. Elsewhere in the country, that’s not the case: In fact, Mr. Patel said, most Indian restaurants use a canned ripe Indian mango purée to remedy that problem. But by roasting the mangoes or bananas first with sugar and warm spices, you can get good flavor from fruit of any quality or ripeness. Mr. Patel makes his own yogurt, which gives this lassi a complex tartness that balances the sweet spiced fruit, but a very good-quality regular plain yogurt (as in not strained or Greek) is a fine stand-in. The mango yields a slightly thicker lassi than the banana; if you'd like, add a little extra milk to thin it out, tasting as you go to make sure you don't dilute the flavor.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2017/08/16/dining/16TROPICALJp7/16TROPICALJp7-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "2 to 4 servings", "recipeCuisine": "indian", "recipeCategory": "non-alcoholic drinks, shakes and smoothies", "keywords": "banana, mango, vanilla bean, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 54}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 265, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "77 milligrams", "sugarContent": "48 grams", "transFatContent": null}, "recipeIngredient": ["2 ripe medium mangoes or bananas, peeled and cut into large chunks", "1/2 cup brown sugar", "1/2 vanilla bean, split lengthwise and seeds scraped", "1 green cardamom pod, lightly crushed", "2 cups plain whole milk yogurt", "1/2 cup whole milk", "1/2 cup ice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the fruit in a small ovenproof skillet or baking dish. Sprinkle with sugar, then add vanilla bean seeds and pod, and the cardamom pod, stirring so the fruit is coated with sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the fruit until soft, stirring every 5 minutes, until most — but not all — of the liquid the fruit releases has evaporated and begins to bubble and thicken, about 25 to 30 minutes for the bananas and 40 minutes for the mangoes. (If you let them cook too long, the sugar mixture will stick to the pan.) Discard vanilla bean and cardamom, and let the fruit cool completely, then refrigerate until chilled. This step can be done several hours or the day before."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Measure out 3/4 cup of the chilled roasted fruit. (You may have a little left over, depending on the size of the fruit you started with.) In a blender, combine the roasted fruit with yogurt, milk and ice. Process just until smooth, scraping down the sides of the pitcher once or twice, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1018886-roasted-mango-or-banana-lassi"}