{"@context": "http://schema.org", "@type": "Recipe", "name": "Deep-Fried Borek", "description": "You can make your own feuille de brick, but it’s one of those products, like burgundy wine and saltine crackers, better left to the professional artisans. Alas, even finding it commercially made can be difficult as well, but it is worth the effort to procure.  Fortunately, it freezes beautifully, so when you find a source, get more than one package and freeze the extra for future use. Thin as a sheet of tracing paper and as transparent, the dough fries up shatteringly crisp, and makes an incomparable borek. Everyone at dinner will ask you how you did it.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2017/10/29/magazine/29Rabbit-recipes1/29Rabbit-recipes1-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "finger foods, project", "keywords": "feuille de brick dough, grape leaves, halloumi, nigella seed, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 22}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 919, "unsaturatedFatContent": "39 grams", "carbohydrateContent": "89 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "6 grams", "proteinContent": "24 grams", "saturatedFatContent": "10 grams", "sodiumContent": "1308 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["6 round (12-inch) sheets feuille de brick dough", "8 ounces halloumi cheese, sliced into thin 2 1/2-inch strips, the thickness of a cigarette", "2 tablespoons ground Aleppo pepper", "2 tablespoons nigella seed", "1 cup picked parsley leaves", "12 brined, jarred grape leaves, stems and ribs removed, cut into quarters", "2 eggs, whisked thoroughly", "Vegetable oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay out the stack of brick dough on a flat work surface, and cut into quarters, as if cutting a pizza. Peel apart individual sheets of dough, and then re-layer gently. Cover with a dry kitchen towel while you work to keep the fragile, quick-drying dough supple and workable."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working two at a time, position a dough triangle so that the wide end is at the bottom and the triangle tip is pointing away from you. Place a strip of halloumi cheese across the bottom of the dough portion, leaving a 1/2-inch margin at the bottom edge. Add a pinch of Aleppo pepper and 1 of nigella seed, then add 2 parsley leaves and 2 pieces of grape leaf in a neat pile on top of the cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a pastry brush or your fingers, carefully and lightly brush the outer edge of the dough with egg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold in the bottom right and left edges of the dough over the filling, and then roll the package away from you, tucking in the edges as you roll, as you would roll a burrito, a newborn baby or a closed cigarette. Try and keep your package as neat and tightly rolled as possible. Set aside, and repeat until you have used all the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 inches of vegetable oil in a heavy-bottomed pot until it registers 350 degrees Fahrenheit on a thermometer. Working in small batches, fry the borek until golden-brown and cooked through, about 5 minutes. Take care to move the borek around during the first few minutes of frying, as they can easily stick together. Transfer the borek to a tray lined with paper towels. Serve while hot but not blistering so."}], "link": "https://cooking.nytimes.com/recipes/1018997-deep-fried-borek"}