{"@context": "http://schema.org", "@type": "Recipe", "name": "Jamaican-Spiced Turkey", "description": "When Francine Turone hosted her first Thanksgiving dinner in New York City, she declared turkey “bland and boring.” But after friends protested, she came up with this recipe inspired by her upbringing in Kingston, Jamaica. This turkey, a showstopping centerpiece for any big family event, roasts on a bed of whole vegetables, which absorb its fat. A deeply spiced brine and rub packed with cinnamon, allspice berries, thyme and chile pepper imparts huge flavors, rounded out by an herb-infused brown butter. If things are looking to be busy, the butter and rub can be prepared a day ahead.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2016/11/11/dining/COOKING-JERK1/COOKING-JAMAICAN1-articleLarge-v3.jpg", "totalTime": "PT6H", "recipeYield": "12 to 16 servings", "recipeCuisine": "caribbean", "recipeCategory": "dinner, project", "keywords": "fall, herbs, spices, turkey, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 45}, "recipeIngredient": ["1 1/4 cups kosher salt", "1/2 cup granulated sugar", "5 cloves garlic, lightly crushed and peeled", "1 large Spanish or Vidalia onion, peeled and quartered", "20 fresh thyme sprigs (or 2 tablespoons dried)", "8 whole cloves", "1 tablespoon allspice berries, lightly crushed", "2 bay leaves", "6 sage leaves", "1 stick cinnamon", "5 to 6 scallions, white and green parts, halved crosswise", "3 to 4 juniper berries, lightly crushed", "1 15- to 18-pound turkey (preferably heritage or pasture-raised)", "1 1/4 cups unsalted butter (2 1/2 sticks)", "20 fresh thyme sprigs", "1/4 cup chopped scallions (about 3), white and green parts", "1/2 cinnamon stick, broken into pieces", "2 tablespoons allspice berries", "1 tablespoon whole peppercorns", "1/2 tablespoon dried thyme", "1/2 dried mild or medium hot chile pepper (such as guajillo), stem removed, torn into pieces", "1/2 teaspoon fennel seeds", "5 scallions, trimmed", "3 onions, peeled and quartered", "3 celery stalks (with tops)", "2 fennel bulbs (with stems and fronds), cut into thirds", "10 garlic cloves", "3 large carrots, trimmed and peeled", "Salt and pepper", "3 cups vegetable or chicken stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Brine the turkey: Combine all the brine ingredients except the turkey in a large stock pot and add 1 gallon water. Bring to a boil, then remove from heat and stir in another 1/2 gallon water; let cool to room temperature. Place turkey breast-side-down in a container large enough to hold it and the brine. Add brine and refrigerate 8 to 12 hours. Remove from refrigerator about an hour before cooking and bring to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the herb butter: Melt butter in a medium saucepan over medium heat. Reduce heat to medium-low and simmer 9 to 12 minutes, stirring often to prevent burning, until butter darkens to deep amber. Add thyme and scallions and remove from heat. (Butter may foam up; stir to keep it from foaming over.) Let steep for 10 to 15 minutes, then strain into a bowl, pressing out all the butter with a spatula. Allow butter to cool so it firms up, but is still a little soft and pliable. Stir butter while it cools to re-incorporate any bits that fall to the bottom."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the spice rub: Combine all the rub ingredients in a heavy skillet over medium-high heat. Toast, stirring or shaking the pan occasionally, 2 to 4 minutes. Watch carefully to avoid burning. Let cool, then grind finely in a spice grinder or mortar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the turkey: Heat oven to 475 degrees. Line a large roasting pan with the scallions, onions, celery, fennel, garlic and carrots and sprinkle with salt and pepper. Pour in stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove turkey from brine and pat dry. Season cavity with about 1/2 tablespoon of the spice rub. Gently loosen the breast skin with your fingers as far down as you can go, being careful not to tear the skin. Spread almost all of the herb butter under the skin and smooth it out as evenly as possible by rubbing the skin. Rub remaining butter lightly over the rest of the turkey. Sprinkle about 2 tablespoons of the spice rub all over turkey. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place turkey in pan on top of vegetables. Tuck the wings under turkey, and tie legs together with kitchen twine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " Roast turkey for 30 minutes, then reduce oven temperature to 325 degrees and loosely cover with foil. Cook turkey, basting with the liquid in the pan every 45 minutes, until the leg feels loose in the socket and a thermometer inserted into the thigh registers 165 degrees. Start checking the temperature after about 2 hours. Depending on the size of your turkey, it may take up to 4 hours to cook through. Let sit 20 to 25 minutes before carving."}]}