{"@context": "http://schema.org", "@type": "Recipe", "name": "Bar Snack Brussels Sprouts Steeped in Olive Oil and Fish Sauce", "description": "This recipe does not include quantities for an excellent reason. At Prune, in New York, we started with a pound of brussels sprouts for dinner but ate them all while still prepping in the kitchen and then increased to two pounds and ate those as well, before we even sat down. Now we make them to be eaten standing up on purpose. Set out on the bar for parties, where you’d expect to find olives; they never last there either.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2016/11/27/magazine/27feast-recipe1-brussel-sprouts/27feast-recipe1-brussel-sprouts-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "", "keywords": "brussels sprouts, fish sauce, olive oil, salt, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 363}, "recipeIngredient": ["Kosher salt", "Brussels sprouts, trimmed at stalk end", "Extra-virgin olive oil", "Vietnamese fish sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil, and season with coarse kosher salt until as salty as the sea. We encourage you to actually get a spoon and taste the hot water for salinity. It’s the only way to know what you’ve got in the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the brussels sprouts, and cook for about 10 minutes, until they are just cooked through. Still firm but not al dente."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain sprouts, and quickly transfer to a heatproof shallow bowl, and while hot, douse them with good-quality olive oil and sprinkle fish sauce over them judiciously. Stir, and taste one. Add another splash of fish sauce, if needed, and let the sprouts cool completely, resting and steeping for an hour or so, before serving at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1018434-bar-snack-brussels-sprouts-steeped-in-olive-oil-and-fish-sauce"}