{"@context": "http://schema.org", "@type": "Recipe", "name": "Le Grand Aioli", "description": "For those interactive group-gathering festive meals that first come to mind — fondue, say, or raclette — you either have to maintain a giant heated stone by an even larger roaring fire or a balance a pot of boiling oil, molten cheese or finicky chocolate over a live flame. Le grand aioli, by contrast, is a distinctly relaxing, convivial and participatory group meal that requires no dangerous apparatus: It’s just a vivid spread of vegetables, simply cooked, and a few pieces of steamed seafood to go with the large quantity of rather garlicky mayonnaise. Since the meal is served at room temperature – neither hot nor cold – it is one of those exceedingly-gentle-on-the-cook meals for which you can just sit down and stay down. The only exertion involved once you set it out is passing the cold wine.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2017/09/10/magazine/10eat1/10eat1-articleLarge.jpg", "totalTime": "P1DT20M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "baby zucchini, cod, French breakfast radish, green beans, mussles, potato, white wine, yellow wax beans, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 125}, "recipeIngredient": ["1 1/2 pounds cod fillets, skin removed", "Kosher salt", "1 pound baby red or mixed beets, trimmed and scrubbed", "Extra-virgin olive oil", "Freshly ground black pepper", "2 tablespoons red-wine vinegar", "14-16 new or fingerling potatoes, scrubbed", "1/2 pound green beans, stem end trimmed", "1/2 pound yellow wax beans, stem end trimmed", "1 pound baby zucchini", "6 eggs", "1 bunch French breakfast radish, large leaves trimmed", "3 heads gem lettuce", "2 pounds mussels", "1 clove garlic, slivered", "1 shallot, chopped", "3 sprigs thyme", "Pinch of red chile flakes", "1/2 cup white wine", "3 cloves garlic, plus more to taste", "1 large egg", "1 large egg yolk", "Juice of 1 lemon, plus more to taste", "Kosher salt", "1 1/2 cups blended oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "On the night before you serve the grand aioli, gently season the cod with kosher salt on both sides; cover, and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400. Place beets in a small roasting pan. Coat the beets in 4 tablespoons of olive oil, and season with salt and pepper, to taste. Add the red-wine vinegar and 4 tablespoons water to the pan. Cover with foil, and roast until beets are tender, approximately 1 hour. Check beets halfway through cooking, and add more olive oil and water if the roasting pan looks dry. Remove beets from oven, and uncover the pan. Cover the beets with a clean kitchen towel, and let them stand at room temperature until cool enough to handle. Using the kitchen towel (or paper towels) to help you, rub off the outer skin of the beets. Peeling the beets while they are still quite warm makes the otherwise difficult task easy. Set aside the peeled beets until completely cool, then halve or quarter, depending on the size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, fill a large pot with water, and bring to a boil. Season aggressively with salt. In this case you want the water even saltier than the sea. It should nearly make you pucker when you taste it. Be sure to taste it!"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the heat so that the water is at an energetic simmer. Add the potatoes, and cook until easily pierced with a skewer, approximately 12 minutes. Remove from the simmering water with a slotted spoon, and transfer to a sheet tray lined with a clean kitchen towel to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the green beans and wax beans to the simmering water, and cook until tender, 4 to 5 minutes, depending on thickness. Remove using a slotted spoon, and transfer to the sheet tray to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the zucchini to the simmering water, and cook until just tender, about 5 minutes. Remove with slotted spoon, and transfer to the sheet tray to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat up on the pot of water, returning it to an aggressive boil. Gently lower the eggs into the boiling water using a slotted spoon, being careful not to crack their shells. Cook 10 minutes. Remove the eggs from the water, and peel them quickly under cool running tap water. Cut them in half lengthwise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the vegetables are cool, slice the potatoes in half. If the zucchini are very small, you can leave them whole, otherwise halve or quarter them lengthwise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl with cold water, and drop in the radishes. Agitate the radishes to help shake loose any sand, then let it settle on the bottom of the bowl. Lift the radishes out, and set aside. Repeat this process 2 or 3 more times, using fresh water each time, until the radishes are clean and free of sand. Let dry, then halve or quarter, depending on their size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the little gem lettuces in half, and drop into a large bowl of cold water. There should be enough room in the bowl so that the lettuces float easily in a single layer. Let stand for 5 minutes so that any sand drops to the bottom of the bowl, then gently lift the lettuces out, and set aside. Repeat this process 2 more times, using fresh water each time, until the lettuces are clean and free of sand. Pat dry or spin gently in a salad spinner."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrub the mussels under running water, and debeard them. Heat 2 tablespoons olive oil over medium-high in a pot large enough to hold the mussels in a single layer. When the oil starts to shimmer, add the garlic, shallot, thyme sprigs and chile flakes. Let the aromatics toast, but not brown, stirring constantly, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the mussels, then pour in the wine. Cover the pot with a tightfitting lid, and steam 2 minutes. Check the mussels, and remove any that have opened to a platter. Continue cooking, removing each mussel as it opens so they do not overcook. Discard any that do not open after 10 minutes. Set mussels aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange a steamer basket in a large pot, and fill with 1/2 inch of water; bring to a simmer. Arrange cod in steamer (cut into large pieces, if necessary), and cover with the lid or foil. Gently steam until just cooked through, about 7 minutes. Remove the cod from the steamer, and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate the garlic into the bowl of a food processor using a microplane. Add the whole egg, egg yolk, lemon juice, 1 tablespoon of water and a generous pinch of kosher salt. With the processor running, slowly drizzle in the oil. The aioli will start to thicken and emulsify after a few minutes. If the aioli is too thick, add another tablespoon of water to loosen. Taste the aioli, and adjust for seasoning, adding more salt, lemon juice or microplaned garlic, as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On several large platters arrange all the beautiful ingredients in neat but loose bundles. Serve with the aioli for dipping."}]}