{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Steak With Lebanese Spices", "description": "The Lebanese seven-spice mixture baharat (the Arabic word for spices) usually has a base of black pepper and allspice, along with coriander, cumin, clove, cinnamon, nutmeg, but that's not set in stone. Sometimes powdered ginger, cardamom and hot paprika are part of the mix. There are often more than seven spices, and sometimes fewer. It is an all-purpose spice blend, good for adding depth to stews, and as a rub for meat. London broil is what butchers call a boneless piece of meat from nearly any cut that is broiled or grilled and then sliced before serving, almost like a little roast. A butterflied leg of lamb has four such pieces, and grilling each separately is easier than cooking the whole boneless leg. You can buy chops instead, but they usually cost more.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/09/07/dining/07KITCHEN-WEB1/07KITCHEN-WEB1-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "middle eastern", "recipeCategory": "steaks and chops", "keywords": "chard, cucumber, lamb, yogurt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 145}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 233, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "3 grams", "proteinContent": "12 grams", "saturatedFatContent": "6 grams", "sodiumContent": "865 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 butterflied lamb leg, about 1 1/2 pounds, or 4 lamb steaks or chops, 6 ounces each", "Salt", "2 teaspoons Lebanese baharat (seven-spice powder), see note", "4 thinly sliced garlic cloves, plus 1/2 teaspoon grated garlic", "Extra-virgin olive oil", "1 1/2 cups plain yogurt, preferably whole-milk yogurt", "4 Persian cucumbers, diced, about 1 cup", "3 tablespoons chopped mint", "Pinch of crushed red pepper", "1 large bunch rainbow chard, about 1 1/2 pounds, cut in 2-inch-wide ribbons", "Dill sprigs, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay butterflied lamb leg on a cutting board and cut into 4 equal pieces, approximately 6 ounces each. Trim extraneous fat or gristle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place lamb on a baking sheet and season on both sides with salt and the seven-spice powder. Sprinkle meat with sliced garlic and drizzle with 1 tablespoon olive oil. Rub with your hands to coat, massaging the spices into the lamb. Cover bowl with plastic wrap and let stand at room temperature for at least 1 hour, or wrap and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put yogurt in a mixing bowl and season with salt. Stir in cucumbers, mint, grated garlic and crushed red pepper. Taste and adjust seasoning. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large cast-iron skillet or stovetop grill pan over medium-high heat. When the pan is hot, add lamb steaks in one layer and cook for about 5 minutes, until nicely browned. Turn pieces and cook for 3 to 4 minutes more, until juices appear on surface, for medium-rare. Transfer lamb to a cutting board and let rest for about 10 minutes before slicing. (Alternatively, broil lamb or grill over coals.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While lamb is resting, put 2 tablespoons olive oil in a wide skillet over medium-high heat. When oil is hot, add chard and 1/4 cup water. Season lightly with salt. Cook for 1 to 2 minutes, until chard is just wilted. Remove chard from pan with a slotted spoon and transfer to a serving platter or individual plates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carve lamb on the bias in 1/8-inch-thick slices, against the grain, and place next to the chard. Garnish with dill sprigs, if desired, and serve with a spoonful of cucumber-yogurt sauce. Pass the rest of the sauce separately."}], "link": "https://cooking.nytimes.com/recipes/1018274-lamb-steak-with-lebanese-spices"}