{"@context": "http://schema.org", "@type": "Recipe", "name": "Tarte Flambée", "description": "Traditionally, this onion and bacon tart was a baker’s treat made from dough scraps leftover from bread baking. The scraps were rolled out, topped with raw onion, bacon and fromage blanc (a soft, yogurtlike cheese) and baked until the dough puffed and the onions singed at the edges. Now you’re as likely to find this savory tart at a restaurant or coming straight from someone’s kitchen as at a bakery. This version, adapted from the chef Gabriel Kreuther, uses a biscuitlike crust made with baking powder instead of the usual yeasted dough. Since you don’t have to let the dough rise, you can have a tarte flambée on the table in under 45 minutes. Serve this as an appetizer, a light main course, or for an unusual brunch offering. This recipe is part of <a href=\"https://cooking.nytimes.com/new-essentials-french-cooking\">The New Essentials of French Cooking</a>, a guide to definitive dishes every modern cook should master. <a href=\"https://store.nytimes.com/products/new-essentials-of-french-cooking\">Buy the book.</a>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/01/15/dining/DINING-TARTEFLAMBE1/DINING-TARTEFAMBE1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "dinner, lunch, pies and tarts", "keywords": "bacon, crème fraîche, fromage blanc, onion, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 87}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 131, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "3 grams", "sodiumContent": "141 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup crème fraîche", "1/3 cup fromage blanc", "1/8 teaspoon freshly grated nutmeg", "1 teaspoon kosher salt, more to taste", "Freshly ground black pepper, to taste", "7/8 cup/110 grams all-purpose flour, plus more for dusting", "1 1/2 teaspoons baking powder", "1 1/2 teaspoons olive oil", "1 large egg yolk", "2 strips/100 grams thick-cut smoked bacon, finely diced (about 2/3 cup)", "1/3 cup finely chopped white onion"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have a pizza stone, place it on the middle rack of your oven, top with a baking sheet, and heat the oven to 425 degrees. (If you don’t have a stone, just place the baking sheet on the oven rack)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine crème fraîche, fromage blanc, nutmeg, 1/2 teaspoon salt and the pepper. Set aside while you make the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate medium bowl, whisk to combine flour, baking powder and remaining 1/2 teaspoon salt. In a small bowl, whisk to combine olive oil, egg yolk and 1/4 cup water. Add to dry ingredients and use a fork to combine until it creates a shaggy dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out onto a floured surface and knead for 1 minute, until the dough is uniform and elastic. (Flour your hands as necessary to keep the dough from sticking.) Roll out to a 12-inch round, then transfer to a parchment-lined baking sheet without a rim (or use an overturned rimmed baking pan)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread fromage blanc mixture evenly over the dough, leaving a 1/2-inch border along the edges. Sprinkle bacon and onions over fromage blanc. Slide tart, still on parchment paper, off baking sheet and directly onto baking sheet in oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until top is beginning to brown, and sides are golden and crispy, about 20 minutes. Remove from oven and slide off parchment paper to serving platter. Serve warm."}]}