{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Mushroom and Butternut Squash Tart", "description": "This is a substantial tart with a crunchy, whole-grain dough. Don’t be put off by the yeast in the dough. It makes it both airy and crisp, and isn’t at all hard to handle. You don’t even need a mixer; this dough comes together quickly and easily by hand. For the most complex flavors, use a variety of different types of mushrooms, though just one kind is fine if that's what you have. Oysters, maitake, shiitake, black trumpet and chanterelles are best, but even cremini mushrooms work nicely. Serve this warm or at room temperature, preferably within 6 hours of baking for the crispiest crust, though it will hold up for a day or two if you store it in the refrigerator and reheat it in a 300 degree oven before serving.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/02/24/dining/1S4A8944/1S4A8944-mediumThreeByTwo440.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "finger foods, pies and tarts", "keywords": "appetizer, main course, butternut squash, cheddar, leek, mushroom, fall, winter, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 629}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 305, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "4 grams", "proteinContent": "11 grams", "saturatedFatContent": "4 grams", "sodiumContent": "425 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 teaspoons active dry yeast", "1 teaspoon sugar", "1/4 cup/60 milliliters extra-virgin olive oil", "1 1/4 cups/160 grams all-purpose flour, more as needed", "3/4 cup/110 grams whole-wheat or rye flour", "1 1/2 teaspoons fine sea salt", "10 ounces/283 grams oyster or other mushrooms, cut into 1-inch pieces (about 4 cups)", "3 large leeks, white and light green parts only, thinly sliced (about 4 cups)", "3 tablespoons extra-virgin olive oil, more for drizzling", "1 pound/454 grams butternut squash, peeled and sliced 1/4-inch thick (about 2 cups)", "Fine sea salt, to taste", "Black pepper, to taste", "1 teaspoon chopped thyme leaves", "1/4 teaspoon red pepper flakes, or to taste", "1 cup/114 grams grated white Cheddar or Gruyère cheese", "2 tablespoons chopped chives (optional)", "Fresh lemon juice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: In a medium bowl, sprinkle dry yeast and sugar over 2/3 cup/158 milliliters warm water. Let stand until foamy, 5 to 10 minutes, then add oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together flours and salt, then stir in yeast mixture with a wooden spoon until combined. Turn out onto a floured surface and knead until dough is uniform and elastic, 3 to 5 minutes, adding more flour if needed. (Flour your hands if necessary to keep dough from sticking.) Or, if the dough seems a bit dry, add a bit more water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to an oiled bowl, turn dough to coat it with oil, cover with a damp cloth and let rest in a warm place until doubled in bulk, 1 to 2 hours (or longer if you kitchen is cold or drafty)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the topping: Heat oven to 450 degrees. On a large rimmed baking sheet, toss mushrooms and leeks with 2 tablespoons olive oil and salt and pepper to taste. On another rimmed baking sheet, toss the squash with 1 tablespoon oil and salt and pepper to taste. Spread squash and mushroom mixtures out evenly on their respective pans and roast until lightly browned at the edges, 15 to 20 minutes for the mushrooms, 18 to 22 for the squash. Don’t let the vegetables get too brown, you will be cooking them again. Transfer baking sheets to a wire rack and let vegetables cool. (You can roast the vegetables up to 8 hours in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil a rimmed baking sheet. Roll dough out on a floured surface to an 11- by 16-inch/28- by 41-centimeter rectangle, then transfer to oiled baking sheet and press the dough out to the sides. Cover with a damp cloth and let rest for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven back to 450 degrees. Spread mushroom mixture over dough, sprinkle with thyme and red pepper flakes and top with squash. Sprinkle lightly with salt, then with cheese, then drizzle with olive oil. Bake until golden brown all over, 14 to 18 minutes. Serve hot or warm, sprinkled with chives if desired and lemon juice to taste."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Mushroom and Squash Tart", "description": "Sweet butternut squash balances the earthy roasted mushrooms on this airy pizza tart.", "thumbnailUrl": "https://static01.nyt.com/images/2017/02/24/dining/1S4A8944/1S4A8944-mediumThreeByTwo440.jpg", "uploadDate": "2017-02-24T17:44:49.000Z", "duration": "PT2M51S"}, "link": "https://cooking.nytimes.com/recipes/1018589-roasted-mushroom-and-butternut-squash-tart"}