{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Mochi With Red Bean Filling", "description": "Nothing compares to the texture of fresh mochi, the sweet, delightfully chewy Japanese rice dough. And when you make it yourself (which takes about 10 minutes), you can really enjoy it fresh, at the peak of its textural pleasures. Chop up the cooled mochi and toss it in roasted soybean flour, and it's ready to go as a sweet snack or ice cream topping. Or, as in this recipe, put in some extra time and wrap the sticky dough around a simple red bean filling to make daifuku. The pastry chef Tomoko Kato uses shiratamako flour processed in Japan, but mochiko flour can be easier to find, and the results are similar.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2016/07/06/dining/06MOCHI-SUB-WEB/06MOCHI-SUB-WEB-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "20 pieces", "recipeCuisine": "japanese", "recipeCategory": "", "keywords": "dessert, dried azuki beans, mochiko flour, potato starch, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 102}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 88, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "30 milligrams", "sugarContent": "15 grams", "transFatContent": null}, "recipeIngredient": ["1 cup/200 grams dried azuki beans", "3/4 cup/150 grams sugar", "1/4 teaspoon salt", "Potato starch, for dusting", "1 cup/150 grams mochiko flour (also known as sweet rice flour or glutinous rice flour)", "3/4 cup/150 grams sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Rinse the beans and transfer to a large pot. Cover the beans with water and bring to a boil; drain. Cover the beans again with water and this time simmer until they are completely tender, about an hour to an hour and a half, adding more water if necessary to keep the beans submerged. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Purée the drained beans in a food processor or blender to make a smooth paste. If the beans are too dry to catch the blades, add a few tablespoons of water. Return the bean purée to the same pot and stir in the sugar and salt. Cook over medium-low heat, stirring occasionally, until most of the water has evaporated and the purée is very thick, 10 to 15 minutes. Spread bean paste in a wide, shallow container and refrigerate until firm and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the mochi dough: Line a sheet pan with a piece of parchment paper and spread a generous heap of potato starch in a large circle; set aside. In a bowl, whisk together the mochiko flour and 1 1/3 cup/300 milliliters water until smooth. Pour mixture through a mesh strainer into a saucepan, using the whisk to help push it through if necessary. Add the sugar and mix well. Switch to a heatproof spatula and cook the mixture over medium heat, stirring constantly, until it thickens and comes together as one big, smooth, shiny mass that can hold its shape, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a starch-dusted knife, cut the dough into 20 even pieces. (If eating plain, or as an ice cream topping, cut into 40 to 50 smaller pieces.) One at a time, use a rolling pin to roll a piece of mochi dough into a thick, flat disk about 2 inches by 2 inches. Use potato starch liberally to keep the dough from sticking to your work surface, the rolling pin or your fingers. Roll a scant tablespoon of bean paste between your hands to form a ball and place it in the center of the rolled-out dough piece. Use your fingers to evenly stretch the mochi dough up and around the filling without squishing it, pinching the dough shut at the top to seal it, and then gently rolling the mochi between your hands to form a rounded shape. Set on the parchment-lined baking sheet with the seam on the bottom. Eat the filled mochi the day they’re made, or cover and store in the refrigerator for 1 day."}]}