{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Olive Gnocchi With Tomatoes and Basil", "description": "The eye can influence wine choices almost as easily as the nose or the palate. Snowy little pillows of gnocchi often suggest a white wine, but before me was a plate of dusky ones, darkened with black olive paste. The dish demanded a red wine, one with rustic heft. Black olive gnocchi is a highlight at La Terrazza, the restaurant at the Splendido Hotel in Portofino, Italy, where I opted for a local red, a Rossese di Dolceacqua, alongside. The preparation is simple and will be successful as long as you apply a light touch.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "pastas", "keywords": "black olives, cherry tomatoes, potato, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 521, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "6 grams", "proteinContent": "21 grams", "saturatedFatContent": "9 grams", "sodiumContent": "813 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 pound Idaho potatoes", "Salt", "3 tablespoons extra virgin olive oil", "1 large clove garlic, sliced", "1 pound cherry tomatoes, quartered", "4 ounces pitted black or kalamata olives", "Freshly ground black pepper", "1 cup flour", "1 1/4 cup freshly grated Parmigiano-Reggiano, more for serving", "2 large egg yolks, beaten", "2 1/2 tablespoons black olive paste", "20 fresh basil leaves, slivered"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place potatoes in a saucepan, cover with salted water and boil until tender, about 25 minutes. Meanwhile, heat oil in a skillet, add garlic, cook over medium heat until barely starting to color; stir in tomatoes. Coarsely chop olives and add half to the skillet. Cook briefly, until tomatoes collapse. Season with salt and pepper, and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When potatoes are tender, peel and rice them into a large bowl. Mix all but 3 tablespoons flour with 1 1/4 cups cheese, toss with potatoes and pile in a mound on work surface. Make a well in center. Mix egg yolks and olive paste, and place in well. Chop remaining olives finely and add to well. Knead to blend ingredients and form a soft dough. Shape into a ball and divide in 8 portions. Roll each into a rope about 10 inches long and 1/2 inch in diameter. Cut into 1/2-inch dumplings (gnocchi). Dust with remaining flour and lightly pile in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 4 quarts salted water to a boil. Reduce heat to a fast simmer, add gnocchi and as they rise to the surface, use a slotted spoon or skimmer to remove to a colander. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat sauce in skillet, fold in basil and add gnocchi. Heat, mixing gently. Check seasoning and serve, with extra cheese alongside."}], "link": "https://cooking.nytimes.com/recipes/1018613-black-olive-gnocchi-with-tomatoes-and-basil"}