{"@context": "http://schema.org", "@type": "Recipe", "name": "Turmeric Tea", "description": "Turmeric milk is a simple infusion of warm milk with turmeric that exists with countless variations in homes across India, where it's known as haldi doodh. The drink might include black pepper, and a touch of jaggery or honey to sweeten it. This hybridized version lies somewhere closer to a masala chai with a dose of black tea and a spoon of fresh grated ginger. The recipe makes two dainty portions, or one robust one, but it's in the spirit of things to play with the ratios to suit your own taste, to use your sweetener of choice and even to replace the milk entirely with almond or cashew milk. Cooking with powdered turmeric is less messy than with fresh, and won't require gloves to keep your fingers from staining. ", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/01/22/magazine/22eat/22mag-22eat-t_CA1-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "Serves 1", "recipeCuisine": "", "recipeCategory": "", "keywords": "black tea, cardamom pods, cinnamon stick, ginger, turmeric", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 539}, "recipeIngredient": ["1/4 cup water", "1/2 teaspoon dried turmeric (or a 1/2-inch piece fresh turmeric, peeled and grated)", "1 1/2-inch piece ginger, peeled and grated", "1 cardamom pod", "1 cinnamon stick", "3 black peppercorns", "1/2 tablespoon honey", "1 cup milk (or nut milk)", "1 black tea bag"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pan over low heat, add the water, turmeric, ginger, cardamom, cinnamon, peppercorns and honey. Bring to a simmer, then pour in milk, and add the tea bag. When milk is steaming, use a spoon to taste, and add more honey if you like. Pour through a fine-mesh strainer right into a cup, and drink while hot."}], "link": "https://cooking.nytimes.com/recipes/1018548-turmeric-tea"}