{"@context": "http://schema.org", "@type": "Recipe", "name": "Gochujang Barbecue Ribs With Peanuts and Scallions", "description": "The simplest dishes are the hardest to get right, and barbecue ribs are no exception. That is why the chef Joseph Lenn, of J.C. Holdway in Knoxville, Tenn., always quick-cures the ribs with an overnight rub of salt, black pepper and brown sugar. This ensures the meat is seasoned evenly throughout, and is something he recommends for any slow-cooked or braised meat. Mr. Lenn’s mop sauce, a homage to the Dixie Sweet sauce at Martin’s Bar-B-Que Joint in Nashville, is fired up with gochujang, a Korean chile paste. It works equally well on bone-in chicken breasts and wings.", "author": {"@type": "Person", "name": "Jane Black"}, "image": "https://static01.nyt.com/images/2017/06/21/dining/21CHEF2/21CHEF2-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "6 to 8 servings", "recipeCuisine": "barbecue, southern", "recipeCategory": "dinner, lunch, barbecues, meat", "keywords": "gochujang, light brown sugar, peanut, scallion, spareribs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 288}, "recipeIngredient": ["3 racks St. Louis-style spareribs (2 1/2 pounds each)", "1/2 cup kosher salt", "1/2 cup packed light brown sugar", "1/4 cup ground black pepper", "1/2 cup gochujang", "1 1/2 cups apple cider vinegar", "1/2 cup packed light brown sugar", "1 teaspoon ground black pepper", "1/2 teaspoon chile powder, such as ancho", "1/4 teaspoon crushed red pepper flakes", "1 teaspoon smoked paprika", "1 cup chopped peanuts", "1 cup sliced scallions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before you plan to cook the ribs, use a paper towel to help you pull the silver skin off the backside of the ribs. Combine salt, light brown sugar and black pepper to make a rub, then generously season ribs with the rub on both sides. (You may have some rub left over.) Place on a rimmed baking sheet, wrap in plastic, put in the refrigerator, and let sit overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the sauce, combine all ingredients and whisk until brown sugar is dissolved. (You can use a hand mixer if you'd like.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, prepare a charcoal grill (preferably a kamado, the egg-shaped ceramic grill) and warm it to 225 to 250 degrees. If your grill doesn't have a thermometer, use an oven thermometer to try to keep the temperature consistent. (See note.) Place ribs on a rack so they are not sitting directly on the grate. Cook  3 to 3 1/2 hours, turning and basting ribs with barbecue sauce every hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Glaze the ribs with the sauce once more before serving. Cut the ribs and then sprinkle with peanuts and scallions and serve."}], "link": "https://cooking.nytimes.com/recipes/1018796-gochujang-barbecue-ribs-with-peanuts-and-scallions"}