{"@context": "http://schema.org", "@type": "Recipe", "name": "Coq au Vin With Prunes", "description": "The standard <a href=\"https://cooking.nytimes.com/recipes/1018529-coq-au-vin\">coq au vin</a>, even when it is made with shortcuts, is a hearty dish, what with its bacon, garlic, deep red wine and enrichment of butter. But the one I like best is made with prunes: it's darker, richer, fuller, the kind of recipe one adores and makes repeatedly. The prunes melt into the wine and become barely recognizable, bringing even more depth, not only of color but of flavor. Despite its relative ease of preparation, this becomes a serious dish, the kind that demands plenty of bread so that you can linger over the juices. Feel free to play with variations here: sauté some sliced button mushrooms, a dozen or more peeled pearl onions or whole cloves of garlic (but don't omit the chopped onions) in the skillet after you've cooked the bacon.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner, poultry", "keywords": "chicken, prune, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 78}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 922, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "82 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "9 grams", "proteinContent": "46 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1206 milligrams", "sugarContent": "46 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon olive oil", "1 chicken, cut into serving pieces", "Salt and pepper", "2 medium onions, chopped", "1/2 cup salt pork or bacon, minced (optional)", "1 tablespoon minced garlic", "1 pound pitted prunes", "2 cups Burgundy, pinot noir or other fruity red wine", "2 tablespoons butter, optional                       ", "Minced parsley for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put oil in a large skillet, preferably nonstick, and turn heat to medium-high. A minute later, add as many chicken pieces as will fit without crowding, skin side down. Cook, rotating pieces and adjusting heat as necessary to cook them evenly, until nicely browned on skin side, about 5 minutes; turn and brown on other sides. As pieces are done, sprinkle them with salt and pepper, transfer them to a large casserole, and add remaining pieces. The entire process will take about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When chicken is all browned, add onions to fat remaining in skillet; cook over medium-high heat, stirring occasionally, until softened, 3 to 5 minutes, then transfer them to casserole. Add salt pork or bacon to skillet, if you are using one of them, and cook, stirring occasionally, until brown and crisp, about 5 minutes; transfer to casserole and drain all but 1 tablespoon of fat. Turn heat to medium, add garlic and, 30 seconds later, the prunes. Cook for a minute, stirring once or twice, then add to casserole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat under skillet to high and add half the wine. Cook, stirring and scraping bottom of pan to remove any solid particles there, until wine is reduced by half. Pour into casserole along with remaining wine. Turn heat under casserole to high and bring to a boil; stir, then reduce heat to low and cover. Simmer, stirring once or twice, until chicken is done, about 30 minutes. Remove top, stir in optional butter, if using, and raise heat to high; cook until sauce thickens a bit. Taste and adjust seasoning if necessary. Garnish with parsley and serve."}]}