{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Roasted Garlic, Pancetta and Arugula", "description": "For this pasta, garlic is roasted in the oven to bring out its sweetness, then sautéed with bold flavors: salty pancetta, fiery chile flakes and a squeeze of lemon. Chopped peppery arugula and a pound of penne round out the dish. It takes 40 minutes to an hour to roast the garlic, but you can do it a day in advance, and it is worth it for the final, honeyed results.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/12/30/dining/30COOKING-PENNE-PANCETTA2/30COOKING-PENNE-PANCETTA2-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas", "keywords": "arugula, garlic, green garlic, pancetta, penne, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 162}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 778, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "112 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "6 grams", "proteinContent": "27 grams", "saturatedFatContent": "8 grams", "sodiumContent": "633 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 fat bulbs green garlic or 4 heads regular garlic", "3 tablespoons extra-virgin olive oil, more for drizzling", "Kosher salt", "Freshly ground black pepper", "1 pound penne rigate", "1/2 pound pancetta, chopped", "1 large pinch crushed red pepper flakes", "1 teaspoon freshly squeezed lemon juice, or to taste", "2 large bunches arugula, roughly chopped (about 5 cups)", "Grated Parmesan cheese, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Trim hairy root and green stem from green garlic, or trim 1/4-inch off top of regular garlic, making sure to expose all cloves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place garlic in a small, shallow baking dish, root side down, and drizzle each with a little olive oil. Cover dish with foil. Roast until cloves or bulbs are golden brown, about 40 minutes to 1 hour (green garlic will cook faster than regular garlic). If bottom of dish starts to burn before garlic is roasted, add one tablespoon water. Transfer to a rack to cool. Garlic can be roasted up to one day ahead; wrap well and store in refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Add pasta and cook according to package directions until al dente."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pasta cooks, heat 3 tablespoons olive oil in a large skillet on medium-high heat. Add pancetta and red pepper flakes. Sauté until pancetta is golden and crisp around edges, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel outside layer of green garlic, or if using regular garlic, squeeze cloves from their papery skins. Chop roasted garlic, and add to skillet with lemon juice and a large pinch of salt and pepper. Sauté for 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain pasta, reserving 1/2 cup cooking water. Add drained pasta and arugula to skillet, place over low heat, and toss until arugula wilts. Add just enough cooking water to scrape up brown bits in pan (do this 1 tablespoon at a time). Taste and adjust seasoning, then serve with Parmesan."}], "link": "https://cooking.nytimes.com/recipes/1018494-pasta-with-roasted-garlic-pancetta-and-arugula"}