{"@context": "http://schema.org", "@type": "Recipe", "name": "Jajangmyeon", "description": "This dish is a Koreanified take on the fried sauce noodles served in the Shandong province of China. It occupies a similar place in Korean cuisine to the one General Tso’s chicken has in American food: a birth-country meal translated to accommodate the too-tired-to-cook takeout tastes of a host nation. It is milder than the Chinese original, a little more porky, the sort of dish you’ll have people asking you to make once or twice a month. You’ll need thick white-wheat noodles, like udon, and some of the Korean black-bean paste known as chunjang, available at Korean markets and online. If you can’t find pickled daikon to serve as a garnish, some raw onions dressed in vinegar will make a fine alternative.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/04/03/magazine/03eat/03eat-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "korean", "recipeCategory": "noodles", "keywords": "chunjang, pork belly, pork shoulder, udon noodles, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 93}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 996, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "99 grams", "cholesterolContent": null, "fatContent": "51 grams", "fiberContent": "7 grams", "proteinContent": "36 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1008 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons neutral oil, like canola", "8 ounces pork belly, cut into half-inch dice", "8 ounce pork shoulder, cut into half-inch dice", "2 inches of ginger root, peeled and minced", "4 garlic cloves, peeled and minced", "1 small carrot, peeled and diced", "1 large waxy potato, like a Yukon gold, peeled and diced", "1 Spanish onion, peeled and diced", "1 zucchini, 1/2 peeled and diced, 1/2 peeled and julienned", "1/2 cup chunjang, Korean black-bean paste", "2 tablespoons light brown sugar", "Kosher salt to taste", "1 pound fresh udon noodles", "1/2 cup pickled yellow daikon radish, cut into half moons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wok or large sauté pan over high heat, and add the oil to it. When it shimmers and is about to smoke, add the pork belly and shoulder, and allow them to brown, stirring occasionally, approximately 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to medium-high, and add the ginger and garlic, and sauté until softened, approximately 1 to 2 minutes, then add the carrot, potato, onion and the diced zucchini, and cook, stirring occasionally, until softened, approximately 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the black-bean paste to the pan, along with the sugar, a light sprinkle of salt and about 1 cup water. Stir to combine, then allow to cook until the sauce has thickened and the meat and vegetables have cooked through entirely, approximately 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, set a large pot filled with water over high heat to bring to a boil. Add the noodles, and cook until they are soft, approximately 6 to 8 minutes. Reserve a cup of the noodle water, and then drain the noodles, rinsing them with cold water to bring them to room temperature. Set aside in a large serving bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a little of the reserved noodle water to the pork-and-black-bean sauce if it is too thick, then pour the sauce over the noodles. Garnish with the julienned zucchini and the pickled daikon."}], "link": "https://cooking.nytimes.com/recipes/1018046-jajangmyeon"}