{"@context": "http://schema.org", "@type": "Recipe", "name": "Vietnamese Rice Noodles With Lemongrass Shrimp", "description": "Nearly every little shop in Vietnam serves some version of this satisfying, simple dish. Bowls of room-temperature rice noodles are festooned with wok-fried or grilled shrimp (or beef, pork or chicken), scented with lemongrass, splashed with a sweet-and-spicy dipping sauce, and then served with pickled vegetables and tender, aromatic herbs.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/05/03/dining/03KITCHEN1/03KITCHEN1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "vietnamese", "recipeCategory": "dinner, lunch, noodles, seafood", "keywords": "carrot, cilantro, daikon, fish sauce, lemongrass, mint, rice noodles, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 194}, "recipeIngredient": ["1 cup finely julienned carrot", "1 cup finely julienned daikon", "2 teaspoons granulated sugar", "1/2 teaspoon salt", "1 tablespoon rice vinegar", "3 tablespoons light brown sugar", "3 tablespoons rice vinegar", "4 tablespoons lime juice", "3 tablespoons Vietnamese fish sauce, like Red Boat", "3 garlic cloves, minced", "1 tablespoon minced or grated ginger", "1 medium-hot red chile pepper, such as Fresno, finely chopped", "1 red or green bird chile pepper, thinly sliced, or substitute half a thinly sliced serrano pepper", "1 1/2 pounds shrimp, preferably wild, peeled and deveined", "2 tablespoons Vietnamese fish sauce", "1 tablespoon light brown sugar", "3 garlic cloves, minced", "3 tablespoons finely chopped lemongrass, pale tender center part only", "1 pound rice noodles, preferably rice vermicelli", "1 or 2 small lettuce heads, with the leaves separated, rinsed and patted dry", "3 cups mixed herb sprigs, such as cilantro, mint, basil, watercress and tender celery leaves", "2 tablespoons vegetable oil", "4 scallions, slivered", "4 tablespoons crushed roasted peanuts", "Handful of bean sprouts (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pickled vegetables: Put carrot and daikon in a small bowl and sprinkle with sugar and salt. Add rice vinegar, toss well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dipping sauce: In a small bowl, stir together brown sugar, vinegar, lime juice, fish sauce, garlic, ginger and chiles. Stir in 1/2 cup cold water and let mixture sit for 15 minutes. (Leftover sauce will keep up to 3 days, refrigerated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Marinate the shrimp: Put shrimp in a shallow dish. Add fish sauce, brown sugar, garlic and lemongrass. Mix well to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a large pot of water to boil. Turn off heat and add rice noodles. Soak noodles, stirring occasionally, until softened, usually about 7 to 8 minutes. Drain and rinse with cold water. Leave in colander at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a platter of lettuce leaves and herb sprigs for the table. Keep cool, covered with a damp towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put oil in a wok or frying pan over medium-high heat. When oil is hot, add shrimp without crowding (work in batches if necessary). Cook for about 2 minutes per side, until lightly browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide noodles among 4 large soup bowls, then top each with hot shrimp, pickled vegetables and a tablespoon or so of dipping sauce. Sprinkle with scallions and peanuts (and beans sprouts if using). Pass herb platter and remaining dipping sauce at the table, and encourage guests to customize bowls as desired."}]}