{"@context": "http://schema.org", "@type": "Recipe", "name": "Splayed Turkey With Herbs", "description": "This unorthodox method for roasting a turkey gives you a delicious, evenly cooked bird — fast. Before roasting, the bird’s legs are splayed so they lie flat on the bottom of the roasting pan, where they are seared. That jump-starts the cooking of the dark meat (which always needs more time than the white meat). Then, after searing, the bird is surrounded by onions and wine before going into the oven; this essentially braises the dark meat while the breast meat roasts. The result is tender dark meat and juicy white meat, all ready in under 2 hours in the oven. An added bonus: You’ll get a pan full of rich oniony drippings that can enrich your gravy, or take its place entirely.\n\nTo get the deepest flavor, this recipe calls for dry-brining your bird at least a day or two ahead. But you can reduce the brining time to 2 hours if you’re pressed for time. Also, if you're trying this with a bird that weighs more than 13 pounds, you will need an extra-large roast pan, and to roast it for a bit longer.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/11/03/multimedia/clark-turkey/clark-turkey-mediumThreeByTwo440.jpg", "totalTime": "P1DT2H30M", "recipeYield": "12 servings", "recipeCuisine": "american", "recipeCategory": "dinner, poultry", "keywords": "fall, winter, main course, turkey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 253}, "recipeIngredient": ["1 12-pound turkey, giblets and neck removed and saved for stock", "2 tablespoons coarse kosher salt", "1 1/2 teaspoons black pepper", "Finely grated zest of 1 lemon", "1 bunch lemon thyme or regular thyme", "10 garlic cloves, smashed and peeled", "2 fresh or dried bay leaves", "2 tablespoons extra-virgin olive oil, more for drizzling", "Dry white wine, as needed, for the pan", "1 large onion, halved and sliced 3/4-inch thick (not thinner, or slices may burn)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife, cut through the skin that connects legs to the breast on both sides of the turkey. Press down on thighs until they pop out of the sockets and the legs lie flat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together salt, pepper and lemon zest. Smear mixture all over turkey, including inside the cavity. Pat herb sprigs and garlic all over bird. Stuff bay leaves into cavity. Refrigerate, uncovered, overnight or for up to 2 nights."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove turkey from the refrigerator 1 hour before you want to roast it. Remove all but the top rack from the oven. (You can remove that, too, but if you leave it in, you’ll be able to roast something else at the same time as the turkey.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Take all the herb sprigs and garlic cloves off the surface of the turkey and stuff them into the cavity."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large, empty heavy-duty roasting pan on top of the stove, across two burners if possible. Heat up the pan for a minute or so, until the pan is quite hot. Add the oil, let it heat up for a few seconds, then add the turkey, breast side up, so the legs are parallel to the short sides of the pan and have room to flop open. Press down on the splayed legs so they touch the bottom of the pan. Let turkey sear for 5 minutes, pressing down on the legs occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour enough wine into the bottom of the pan to reach a depth of 1/8 inch. Scatter onions around turkey and sprinkle them lightly with salt. Drizzle turkey and onions with a little oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "7. Transfer pan to oven, setting it directly on the oven floor (not on a rack). If you have an electric oven, position the rack at the lowest possible position. Top with a pizza stone, if you have one. Place turkey in its roasting pan on the rack and cook as directed. Roast for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to 350 degrees, give the onions a stir, and if the bottom of the pan is dry, add a splash of wine to moisten the onions. (As the turkey continues to cook, occasionally check the onions to make sure they don’t dry out or they may burn, adding wine as needed.) Roast until an instant-read thermometer inserted into the thickest part of the thigh (but not touching the bone) reads 165 degrees and the breast meat reaches at least 160 degrees, about another 40 to 65 minutes depending upon your oven and the pan you use. Transfer turkey to a cutting board and let rest for 20 minutes before carving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Splayed Turkey With Herbs", "description": "This cooking technique yields perfectly cooked Thanksgiving turkey.", "thumbnailUrl": "https://static01.nyt.com/images/2016/11/03/multimedia/clark-turkey/clark-turkey-mediumThreeByTwo440.jpg", "uploadDate": "2016-11-07T20:31:14.000Z", "duration": "PT2M47S"}}