{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry Sauce", "description": "Cranberry sauce should be sweet but not cloying, and tart without causing pucker and anguish. It should have a jelly-like quality, but should owe more to the appearance of jam. The key element to making cranberry sauce is to understand that cranberries are high in pectin, a carbohydrate that exists in many fruits and which is released by the berries when they are heated and the cells of the fruit break down. In the presence of sugar, the pectin molecules bond to one another, forming a kind of gel. The longer you cook a cranberry sauce, the more pectin is released and liquid is evaporated, and the stiffer the result will be. Science! Sometimes it's helpful. So is spice. Some like a clove or two added to their cranberry sauce. (I am not one of them.) Others, a whisper of ginger and a small handful of nuts, for texture. Of this, I approve.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/09/27/dining/27CranberryRex2/27CranberryRex2-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "About 2 cups", "recipeCuisine": "american", "recipeCategory": "condiments, sauces and gravies", "keywords": "cranberry, fall, winter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 620}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 221, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "5 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "3 milligrams", "sugarContent": "48 grams", "transFatContent": null}, "recipeIngredient": ["1 12-ounce bag fresh or thawed frozen cranberries", "3/4 cup sugar", "3/4 cup orange juice, preferably fresh squeezed", "Zest of 1 orange, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cranberries in a small saucepan over medium-high heat and pour over these the sugar and orange juice. Stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook until sugar is entirely melted and cranberries begin to burst in the heat, 4 to 6 minutes. Stir again, add zest, and cook for 2 or 3 minutes longer, turn off heat, cover pan, and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put cranberry mixture in a serving bowl, cover, and place in refrigerator until cold, at least 2 hours, or until you need it."}]}