{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Wine-Braised Short Ribs With Lemongrass and Soy", "description": "This is the dish that the chef Marcus Samuelsson made for President Obama when he visited the restaurant Red Rooster Harlem. This is an easy braise with wonderful flavors — plum sauce, lemongrass, soy sauce — and as it is pointed out in \"The Red Rooster Cookbook,\" short ribs taste more expensive than they actually are, making them ideal for guests. Make it earlier in the day, then simply reheat when you're ready to serve dinner. The book suggests freezing the extra braising liquid in ice cube trays, so you can slip it into pan sauces or pasta for oomph.", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": "https://static01.nyt.com/images/2020/02/26/dining/obamas-short-ribs/obamas-short-ribs-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "lemongrass, plum sauce, short ribs, soy sauce, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 903}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1241, "unsaturatedFatContent": "52 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "100 grams", "fiberContent": "3 grams", "proteinContent": "43 grams", "saturatedFatContent": "41 grams", "sodiumContent": "1634 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["8 (6-ounce) English-cut short ribs", "Kosher salt and freshly ground black pepper", "2 tablespoons grapeseed oil", "1 onion, chopped", "1 carrot, trimmed and chopped", "2 celery ribs, trimmed and chopped", "1 lemongrass stalk, trimmed, smashed and minced", "3 garlic cloves, chopped", "1 (1-inch) piece ginger, peeled and minced", "1/2 cup dry red wine", "3 cups beef or chicken broth", "1/2 cup plum sauce", "1/4 cup soy sauce", "2 sprigs thyme", "2 sprigs flat-leaf parsley", "2 bay leaves", "Freshly grated horseradish, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Pat meat dry with paper towels and season all over with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat grapeseed oil in a large Dutch oven over medium-high heat. When oil shimmers, add short ribs and brown on all sides, about 2 minutes per side; transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion, carrot, celery, lemongrass, garlic and ginger to the pot. Season with salt and cook, stirring often, until onion softens, about 5 minutes. Pour in wine and cook, stirring to dissolve any of the brown bits that may still be on the bottom of the pot. Add broth, plum sauce, soy sauce, thyme, parsley and bay leaves and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return short ribs to pot, along with any juices, cover and slide pot into oven. Braise until meat is fork-tender, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer meat to a plate. Strain braising liquid into a fat separator. If you don't have a fat separator, use a ladle to skim the fat off the top of the braising liquid; then strain through a fine mesh sieve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard bay leaves and thyme stems and transfer vegetables to a food processor. Process vegetables until smooth, then add 1 1/2 cups of the defatted braising liquid to the processor and pulse to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return sauce to Dutch oven and season to taste with salt and pepper. Add short ribs and turn to coat in the sauce; set aside until you’re ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat short ribs in the sauce. Divide short ribs between four shallow bowls and top each with a spoonful of sauce. Put remaining sauce in a bowl for passing at the table, along with a bowl of horseradish, if you'd like."}], "link": "https://cooking.nytimes.com/recipes/1018318-red-wine-braised-short-ribs-with-lemongrass-and-soy"}