{"@context": "http://schema.org", "@type": "Recipe", "name": "Thai-Style Spare Ribs", "description": "These ribs are often served in Thailand to accompany ice-cold beer, said Andy Ricker, the chef and owner of the Pok Pok restaurants in New York and Portland, Ore. He warns against overcooking them: Thai diners prefer ribs on the chewy side rather than falling-off-the-bone tender. They may be cooked over indirect heat in a covered charcoal grill, but it is far easier to bake them in a slow oven, then reheat (on the grill, if you wish) at the last minute. The ribs are quite flavorful on their own, but serve them with a spicy dipping sauce if you prefer.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/08/16/dining/16kitchenrex/16Kitchen-recs-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "4 to 6 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, meat", "keywords": "baby back ribs, ginger, honey, soy sauce, tamarind paste, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 304}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 104, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "0 grams", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "382 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 racks of baby back ribs, 3 to 4 pounds, halved lengthwise to make 3-inch ribs (ask your butcher to do this)", "2 teaspoons kosher salt", "3 tablespoons honey", "2 tablespoons soy sauce", "1 tablespoon tamarind paste or hoisin sauce", "1 teaspoon toasted sesame oil", "2 garlic cloves, minced", "2 tablespoons grated ginger", "1/2 teaspoon crushed red pepper", "1/2 teaspoon black pepper", "1/4 teaspoon cinnamon", "Pinch of grated nutmeg", "Pinch of cayenne", "2 tablespoons Shaoxing cooking wine, mirin or sherry", "3 tablespoons chopped garlic chives or scallions, for garnish", "3 tablespoons chopped cilantro leaves and tender stems, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the ribs flat in a roasting pan. (You will have 4 long pieces.) Season lightly with salt on both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the marinade: In a small bowl, combine honey, soy sauce, tamarind paste, sesame oil, garlic, ginger, red pepper, black pepper, cinnamon, nutmeg and cayenne. Add the wine and 1/4 cup hot water and whisk well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour marinade over ribs to completely coat. Marinate at room temperature for 2 hours, turning once or twice, or cover and refrigerate for several hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position a rack in the middle of the oven and heat to 250 degrees. Transfer the roasting pan, uncovered, to the rack. Roast ribs for 1 1/2 hours, basting with pan juices and turning ribs over every 20 minutes or so. If pan juices seem to be drying out or burning, add a little water to the pan. (Alternatively, cook ribs over indirect heat in a covered charcoal grill, turning ribs every 20 minutes or so.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour juices from the roasting pan into a small saucepan. Spoon off fat from surface of sauce, then simmer sauce for a few minutes until slightly thickened, then use the juices to paint the ribs. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn up oven heat to 400 degrees. Return ribs to oven for 10 to 15 minutes, until nicely glazed. (Alternatively, return ribs to the grill to glaze.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a sharp knife to divide ribs, cutting between the bones. Pile ribs onto a platter, sprinkle with garlic chives and cilantro, and serve."}], "link": "https://cooking.nytimes.com/recipes/1018889-thai-style-spare-ribs"}