{"@context": "http://schema.org", "@type": "Recipe", "name": "Farro Pasta With Peas, Pancetta and Herbs", "description": "This quickly made, exceedingly delicious recipe is a springtime celebration of peas: snow peas, sugar-snap peas and garden peas, all freshly shucked. (Of course, you can use only one kind, if you prefer.) A touch of pancetta adds a salty umami to the peas' sweetness. Good ham or thick-sliced bacon also work, and, for a vegetarian version, you can  use roughly chopped green olives. Here, the rustic, nutty flavor of whole-grain farro pasta provides a lovely contrast. Look for dried farro spaghetti or, if you can find them, fresh farro pappardelle or fettuccine. But if farro pasta is unavailable, whole-wheat or buckwheat noodles are also quite pea-friendly.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/04/05/dining/05KITCHEN1/05KITCHEN1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, pastas", "keywords": "lemon zest, mint, pancetta, parsley, peas, sage, scallion, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 30}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 523, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "8 grams", "proteinContent": "18 grams", "saturatedFatContent": "7 grams", "sodiumContent": "547 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt and pepper", "2 tablespoons extra-virgin olive oil", "4 ounces pancetta, about 2 thick slices, cut crosswise into lardons", "1 pound farro spaghetti or another pasta shape", "1 1/2 cups chopped scallions, about 2 trimmed bunches", "1/2 teaspoon crushed red pepper", "2 tablespoons roughly chopped sage", "1 1/2 cups shucked garden peas, about 8 ounces", "1 1/2 cups snap peas, about 8 ounces, trimmed", "2 cups snow peas, about 6 ounces, trimmed", "2 tablespoons butter at room temperature", "1/2 teaspoon lemon zest", "2 tablespoons roughly chopped parsley", "2 tablespoons roughly chopped mint", "1/4 cup crumbled ricotta salata or mild feta cheese, about 2 ounces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large pot of well-salted water over high heat and bring to a boil for the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large, wide skillet over medium-high heat. Add olive oil and pancetta. Let pancetta sizzle and take color, stirring, until nicely browned, with a little give, about 5 minutes. Remove pancetta with a slotted spoon and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Start to cook the pasta, timing it to be ready just as the peas are done. Cook until pasta is quite al dente (less time than package directions indicate). Drain pasta, reserving a cup or so of pasta-cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Leaving skillet over medium-high heat, add scallions, crushed red pepper and sage, stirring well to coat. Add 3 types of peas and season generously with salt and pepper. Cook, stirring, until firm-tender, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add drained pasta to vegetables in the pan, along with 1/2 cup pasta-cooking water and let simmer. Toss well with 2 wooden spoons, or tongs, and season pasta–vegetable mixture once more with salt and pepper. Add more pasta cooking water as necessary, until vegetables have softened a bit and pasta is just done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off heat and stir in butter. Mix together lemon zest, parsley and mint, and sprinkle over pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pasta to a large, low bowl, sprinkle with ricotta salata and serve. (You might also divide the dish into individual servings.)"}], "link": "https://cooking.nytimes.com/recipes/1018691-farro-pasta-with-peas-pancetta-and-herbs"}