{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick Minestrone", "description": "Minestrone doesn't have to be a long-simmering project. Adding pancetta means that the soup develops full flavor quickly, and the vegetables stay tender and tasty. To jump-start the recipe, use a food processor to get the soup base going, and then start prepping the vegetables. Canned beans are great for this recipe, but don't use other canned or frozen vegetables here -- the key to a good minestrone is the fusion of the fresh vegetable flavors.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/09/27/dining/27tomatorex/27tomatorex-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "soups and stews", "keywords": "baby kale, canned tomatoes, pancetta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 356}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 325, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "8 grams", "proteinContent": "13 grams", "saturatedFatContent": "3 grams", "sodiumContent": "743 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup extra-virgin olive oil", "2 ounces pancetta, finely chopped", "1 large onion or 2 shallots, peeled and cut into chunks", "1 celery rib, trimmed and cut into chunks", "1 large carrot, peeled and cut into chunks", "8 ounces baby kale or shredded savoy cabbage (about 1/4 of a medium-size head)", "2 celery ribs, cut into small dice", "2 carrots, cut into small dice", "1 medium zucchini, cut into large dice", "1 (15-ounce) can cranberry, cannellini or other white beans, rinsed and drained", "4 to 5 canned whole peeled tomatoes, seeded and cut into small dice", "Kosher salt and freshly ground black pepper", "1 quart vegetable or chicken stock, plus more to taste", "2 sprigs fresh rosemary, marjoram or oregano", "Slice of crusty bread for each serving (optional, see note)", "Extra-virgin olive oil", "Freshly shredded Parmigiano-Reggiano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the soup base: In a medium-size heavy soup pot, combine the oil and pancetta over medium-low heat to slowly render the fat and cook the pancetta, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a food processor, combine the onion or shallots, celery and carrot. Pulse until finely chopped. Add to pot with cooked pancetta and adjust heat so the vegetables soften and cook without browning, stirring occasionally, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the other vegetables: Stirring after each addition, add the kale or cabbage, celery, carrots, zucchini, beans and tomatoes. Season generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the stock and 1 cup water (or, if you prefer a soup that’s not as thick, add additional stock to taste, up to 2 cups). Add the herb sprigs. Cover, raise the heat and bring to a full boil. Uncover, lower the heat to a bubbly simmer, and cook 30 minutes, or until vegetables are tender, stirring occasionally. Taste and adjust the seasonings with salt and pepper. Remove the herb sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve in bowls, drizzling a little olive oil and sprinkling a big pinch of cheese over each serving."}], "link": "https://cooking.nytimes.com/recipes/1018940-quick-minestrone"}