{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Vegetable Gratin", "description": "Cooking some of the ingredients beforehand is the key to a rich-tasting, nonsoggy gratin of summer vegetables: It pulls out water and concentrates flavors. The recipe has three layers — aromatics, vegetables and topping — but you can omit the topping to make it just two. Be sure to use fresh bread, nothing hard and stale, in that topping. Fluffy bits, not sandy shards, make the best crust.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/08/12/multimedia/recipelab-gratin/recipelab-gratin-mediumThreeByTwo440.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "casseroles, vegetables", "keywords": "baguette, bell pepper, gruyère, onion, parmesan, summer squash, tomato, zucchini, side dish, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 203}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 370, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "4 grams", "proteinContent": "10 grams", "saturatedFatContent": "5 grams", "sodiumContent": "724 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 medium onions, thinly sliced", "1/4 cup olive oil", "2 red bell peppers, thinly sliced, or 2 additional onions", "1/2 teaspoon red pepper flakes", "4 cloves garlic, smashed", "1 1/2 pounds plum or other ripe tomatoes", "1/4 cup olive oil", "1 baguette", "1 cup shredded Parmesan or Gruyère cheese", "1/4 cup olive oil, more for baking", "1 1/2 pounds zucchini, sliced 1/4-inch thick", "1 1/2 pounds yellow squash, sliced 1/4-inch thick", "1/4 cup freshly chopped basil or parsley, more for garnish", "Salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the base layer: In a large, heavy ovenproof skillet or enameled cast-iron pan (10 to 12 inches across), combine onions and olive oil and heat to a sizzle, stirring to separate. Add bell peppers, red pepper flakes and garlic. Cook, stirring, over low heat until peppers are very soft and onions are browned, about 20 minutes. Remove from heat and remove garlic, leaving remaining mixture in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the topping (if using): Core tomatoes and slice them 1/4 inch thick. Lay on paper towels to drain for 10 minutes. Heat 2 tablespoons oil in a large skillet over low heat. Add tomatoes and cook very slowly, turning once or twice, until liquid has bubbled away and flesh is cooked through, about 8 minutes. (Do not overcook, or tomatoes will fall apart.) Turn off heat and let slices cool in skillet; they will continue to dry out. Tear baguette into pieces and pulse in a food processor to make coarse, fluffy, pea-size crumbs. Add remaining 2 tablespoons oil and the cheese and pulse to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the gratin: Heat oven to 425 degrees. (If your oven has a convection feature, use it, reducing baking temperature to 400 degrees.) In a large bowl, combine oil, zucchini and squash, and toss well until lightly and evenly coated. Add basil, sprinkle generously with salt and pepper, and toss again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On top of the base layer in pan, arrange squash and zucchini slices around the inner rim of the pan, standing on their edges in roughly alternating colors. Pat down into the pan so slices overlap and lie down, like shingles or fallen dominoes. Repeat to make another circle inside the first, and again if necessary, until pan is filled. Sprinkle with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush oil over the top of the gratin and transfer to oven. Bake 30 minutes. Raise oven temperature to 450 degrees (425 degrees for convection), or heat the broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If not using topping, brush surface again with oil. If using topping, arrange tomato slices in one layer on top of the par-baked gratin. Spread bread-cheese mixture over tomatoes and press down gently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake or broil until vegetables are browned around the edges or crust is crisp and golden. Let cool slightly and serve hot or at warm room temperature. Garnish each serving with herbs."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Summer Vegetable Gratin", "description": "Put tomatoes, zucchini and squash to good use in this summer gratin.", "thumbnailUrl": "https://static01.nyt.com/images/2016/08/12/multimedia/recipelab-gratin/recipelab-gratin-mediumThreeByTwo440.jpg", "uploadDate": "2016-08-15T12:19:57.000Z", "duration": "PT1M41S"}, "link": "https://cooking.nytimes.com/recipes/1018247-summer-vegetable-gratin"}