{"@context": "http://schema.org", "@type": "Recipe", "name": "Eye of the Komodo", "description": "My friend Michael Sharkey is one of the best home bartenders I know, and he sometimes surprises me with delicious new creations when I visit. His latest is the Eye of the Komodo (he originally christened it Ojo del Komodo — but I botched and Anglicized it, probably because I think the Eye of the Komodo sounds more like a ‘60s horror movie). Built on a foundation of what Michael calls “lizard liquid” and fortified by mezcal, it is bright green, satisfyingly spicy and garnished with a vegetal “eyeball.” What’s not to love?", "author": {"@type": "Person", "name": "Rosie Schaap"}, "image": "https://static01.nyt.com/images/2016/07/24/magazine/24mag-eye-of-komodo/24mag-eye-of-komodo-articleLarge-v2.jpg", "recipeYield": "4 drinks", "recipeCuisine": "", "recipeCategory": "cocktails", "keywords": "cilantro, cucumber, jalapeño, mezcal", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 43}, "recipeIngredient": ["1 large cucumber peeled and cut into big chunks (save 4 slices for garnish)", "1 handful cilantro", "1/2 a jalapeño, with most of the seeds removed (save 4 slices for garnish)", "8 ounces mezcal", "8 ounces \"lizard liquid\"", "2 ounces fresh lime juice (save 4 slices of lime for garnish)", "2 scant tablespoon agave nectar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "First, prepare the “lizard liquid\": Combine cucumber chunks, cilantro and jalapeño in a food processor until completely liquefied. Strain through a fine-mesh strainer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a cocktail shaker filled with ice, combine mezcal, \"lizard liquid,\" lime juice and agave nectar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill 4 glasses with ice, shake the mixture and pour over the ice. Garnish with layered cucumber, lime and jalapeño slices, held together with a toothpick. (Those are the lizard eyes). Dust with chile powder."}]}