{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoky Lobster Salad With Potatoes", "description": "This salad is a riff on a traditional Spanish dish, pulpo a la gallega, a favorite item on tapas bar menus all over the country. It is essentially boiled octopus and potatoes, sliced and served with a good drizzle of olive oil and a dusting of smoky pimentón. This version uses lobster instead, and adds strips of roasted pepper and cherry tomatoes.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/08/30/dining/30KITCH1/30KITCH1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "spanish", "recipeCategory": "seafood", "keywords": "appetizer, cherry tomatoes, lobster, pimenton, red bell pepper", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 15}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 365, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "41 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1041 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Kosher salt", "1 1/2 pounds small, yellow-fleshed potatoes, such as Yukon, peeled", "2 live lobsters (about 3 pounds)", "2 medium red bell peppers", "1 pint cherry tomatoes, halved (about 2 cups)", "4 tablespoons extra-virgin olive oil, more to taste", "1 teaspoon pimentón (smoked Spanish paprika)", "A few parsley leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to a boil. Add potatoes and lobsters, let the water return to the boil and simmer for 15 minutes. Remove lobsters and let cool to room temperature. Probe potatoes with a small knife to make sure they are fully cooked, then drain and let cool to room temperature. (Alternatively, cook potatoes in a separate pot.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, roast the peppers: Place whole peppers over the flames of a gas stovetop burner turned to high, under the broiler or over a bed of hot coals. Turn the peppers frequently with tongs, allowing the skins to completely blacken, about 5 minutes. Remove from heat, and place in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the peppers cool, cut them in half, top to bottom. Use a spoon to remove the seeds, then place the peppers flat on a cutting board blackened-side up. With a paring knife, scrape away the charred skin and wipe with a paper towel. Don’t worry if a few charred specks remain— do not rinse. Cut peppers into 1/2-inch-wide strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove lobster meat from shell. (A pair of strong kitchen shears is a good tool to use.) Cut tail meat crosswise into 1/2-inch slices, and claw meat into similar pieces. Reserve knuckle and head meat for a cook’s treat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the salad, slice the potatoes into 1/4-inch slices and arrange in one layer on a large platter without crowding. Top each potato slice with a piece of lobster. Drape pepper strips over lobster and decorate with cherry tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle lightly with salt and drizzle generously with olive oil. Dust surface with pimentón. Garnish with parsley leaves and serve at room temperature."}]}