{"@context": "http://schema.org", "@type": "Recipe", "name": "Blueberry Pie", "description": "Perfection is a fool’s mission when it comes to blueberry pie. Sometimes the filling is a little runny. Other times, slightly thick, depending on the blueberries themselves. But this recipe helps even the odds, with the use of arrowroot starch in place of the more typical flour or cornstarch, and an awesome pre-thickening technique picked up from the pastry chef Kierin Baldwin. You could use a different pie crust, but I like the all-butter version below, at least with a pre-baked bottom and an artfully cut top that allows steam to escape.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/08/06/dining/ss-blueberry-pie/ss-blueberry-pie-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "arrowroot flour, blueberry, butter, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 403}, "recipeIngredient": ["2 1/2 cups or 300 grams all-purpose flour", "1/2 teaspoon or 3 grams kosher salt", "1 1/4 cups or 285 grams unsalted butter, cold and cut into cubes", "8 to 10 tablespoons or 120 to 150 grams of ice water", "1 egg, beaten with 1 tablespoon or 15 grams of water", "8 cups or 1.2 kilograms blueberries, picked over and washed", "1/2 cup or 140 grams raw sugar", "2 tablespoons or 30 grams lemon juice", "2 to 3 tablespoons or 16 to 24 grams arrowroot flour or cornstarch", "1/4 teaspoon or 1.5 grams kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crust, combine the flour and salt in a large bowl or food processor. Add the butter, and either use your fingers to rub the fat into the flour until the mixture resembles coarse meal or pulse the processor a few times to achieve a similar result. Gradually and lightly mix in ice water, a few tablespoons at a time, until the dough just comes together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out onto a lightly floured surface, and gather into a ball. Divide the ball into two equal portions, and flatten each into a disk with the heel of your hand. Cover tightly with plastic wrap, and refrigerate for at least 1 hour and up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prebake the pie shell. Heat oven to 375. Roll out one of the disks of dough on a lightly floured surface, and fit into a 9-inch pie plate. Trim the dough so that there is a slight overhang at the top of the pie plate, then place the shell in the freezer for 20 minutes or so to chill. Remove the pie shell from the freezer, cover the dough with parchment paper and fill the shell with pie weights or dried beans. Place the shell into the oven, and bake until the bottom has just started to brown, approximately 20 to 25 minutes. Take the pie shell out of the oven, remove the parchment and pie weights and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling. Separate 1 cup or 150 grams of the blueberries, and combine them in the bowl of a food processor or blender with the sugar, lemon juice, 2 tablespoons or 16 grams of the arrowroot flour or cornstarch and the salt, then pulse to purée. Put the blueberry mixture into a small pot set over medium-high heat, and cook, whisking constantly, until the liquid has just thickened, approximately 1 minute. Pour the thickened mixture over the remaining blueberries, and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the pie. Heat oven to 400. Mound the filling high in the center of the cooled pie shell, and apply the egg wash to the top edge of the cooked bottom crust. Roll out the second disk of dough, and place it over the top, gently crimping it onto the egg-washed edge of the bottom crust. Place the pie into the freezer to set, approximately 20 minutes, then cut vents into the top with a sharp knife, place the pie on a baking sheet and set it into the oven to bake for approximately 30 minutes. Then turn the pie, reduce heat to 350 and bake until the pie is golden and the filling has begun to bubble up through the vents, another 25 to 45 minutes. Allow pie to cool to room temperature before you cut into it."}], "link": "https://cooking.nytimes.com/recipes/1018208-blueberry-pie"}