{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Broccoli With Almonds and Cardamom (Malai Broccoli)", "description": "This recipe comes from the British cookbook author Meera Sodha, who adapted it from a dish she tasted in Goa, India. It's a smart, simple technique that turns the broccoli crisp and creamy at the same time: charred florets with a lick of thick nutmeg-spiced sauce baked into every nook and cranny. Ms. Sodha uses a mix of cream cheese, yogurt and ground almonds. Don't be afraid to get messy and use your hands to thoroughly coat the broccoli in the sauce; it pays off later.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/09/27/dining/27VEGETARIAN6/27VEGETARIAN6-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "indian", "recipeCategory": "vegetables", "keywords": "broccoli, cream cheese, greek yogurt, ground almonds, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 401}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 247, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "8 grams", "sodiumContent": "454 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 2/3 pounds broccoli florets (from 2 to 3 heads of broccoli)", "8 ounces cream cheese, softened", "4 tablespoons Greek yogurt", "1 teaspoon kosher salt", "1 teaspoon ground black pepper", "1/2 teaspoon ground cardamom", "1/4 teaspoon ground or freshly grated whole nutmeg", "3/4 cup ground almonds", "3 tablespoons lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees and line 2 large baking trays with parchment paper. Break the broccoli into bite-size pieces. Place all the other ingredients into a large bowl and mix well, using a spatula, spoon or electric mixer to combine. Add the broccoli and mix using clean hands, making sure the mixture gets into all the nooks and crannies of the florets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the broccoli between the 2 baking sheets and roast for 10 minutes. Turn the pieces over and return to the oven for another 10 minutes, or until the broccoli is tender, crunchy and charred in places. Pile into a bowl and serve."}]}