{"@context": "http://schema.org", "@type": "Recipe", "name": "Craquelin-Topped Cream Puffs", "description": "Pâte à choux, aka cream puff dough, is a baker’s putty, the mixture that becomes the cream puff as well as éclairs, beignets, churros, croquembouches, gâteaux St. Honoré and tens more desserts. The dough is cooked before it’s baked, and it's a quick-change artist – a lump when it goes into the oven, it emerges golden, ping-pong-ball light, a couple or three times its size and smelling of warm butter and eggs. It's simple to master, and it lends itself to tweaks and endless embellishments. Here, the puffs are capped with a round of frozen sweet dough called craquelin, which produces a crunchy coating that's a little like streusel. It adds enough texture and sweetness so that filling becomes a choice, not a necessity.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2017/05/28/magazine/28desserts/28mag-28desserts-t_CA0-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 40 puffs", "recipeCuisine": "french", "recipeCategory": "cakes", "keywords": "butter, egg, flour, milk, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 115}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 101, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "3 grams", "sodiumContent": "34 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["9 tablespoons (128 grams) cool unsalted butter, cut into small cubes", "1 cup (200 grams) lightly packed brown sugar", "Pinch fine sea salt", "1 1/4 cups (170 grams) all-purpose flour", "1 1/2 teaspoons pure vanilla extract", "1/2 cup (120 ml) whole milk", "1/2 cup (120 ml) water", "1 stick (113 grams) unsalted butter", "1 tablespoon sugar", "1/4 teaspoon fine sea salt", "1 cup (136 grams) all-purpose flour", "4 large eggs", "1 large egg white"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the craquelin: Pulse the butter, sugar and salt in a food processor until just blended. Add the flour, and pulse until you have moist curds; pulse in the vanilla. Scrape the dough out onto the counter, and pull it together into a ball. Divide in half, shape each half into a disk and roll out each piece between parchment paper until it’s about 1/8 to 1/16 inch thick. Freeze for at least 1 hour, and then cut into 1 3/4-to-2-inch-diameter rounds. Freeze until needed (always use frozen)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350. Line 2 baking sheets with parchment paper. Have a small (2-teaspoon capacity) cookie scoop, spoon or a piping bag at hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the puffs: Bring the milk, water, butter, sugar and salt just to a boil in a medium pan. Reduce the heat to low, add the flour all at once and start stirring like mad with a flexible spatula. Stir and mash the dough until it comes together and leaves a film on the bottom of the pan. Keep cooking and stirring nonstop for another 3 minutes to dry but not color it. Scrape the dough into the bowl of a mixer fitted with the paddle attachment (or work with a hand mixer). Beat the dough for 2 minutes to cool it down a bit. Combine the eggs and white, stir with a fork to break them up and then add to the dough in three additions, beating on medium speed. Beat until the dough is satiny and runs off the beater smoothly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop, spoon or pipe puffs that are about 1 1/2 inches in diameter, leaving about 2 inches between each puff. (At this point, you can freeze them and then, when they are solid, pack them in an airtight container. When you’re ready to bake, arrange the frozen puffs on a lined baking sheet and keep them on the counter while you preheat the oven.) Place a frozen round of craquelin on each puff."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 30 to 35 minutes, rotating the baking sheets if needed, or until the tops are golden brown and crackled. The puffs will feel firm when gently squeezed and sound hollow when tapped on the bottom. Transfer them to racks, and cool to room temperature."}]}