{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Grape, Blue Cheese and Thyme Flatbread", "description": "Black grapes, such as Concords, come into season in the fall. The combination of grapes, sweet spices and blue cheese is an unusual one, yet utterly delicious -- especially for the kind of person who loves ending a meal on a sweet and cheesy note. I serve this for brunch, or before dinner with drinks. For even more flavor and substance, add a scattering of arugula and prosciutto on top.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2017/10/18/dining/18Baking4/18Baking4-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "italian, mediterranean", "recipeCategory": "brunch, lunch, breads", "keywords": "appetizer, dessert, blue cheese, gorgonzola, grapes, thyme, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 53}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 343, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "326 milligrams", "sugarContent": "27 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 cups/200 grams white bread flour", "1 teaspoon instant dried yeast (fast-action yeast)", "2 1/2 tablespoons olive oil, more for oiling work surface", "1/2 teaspoon kosher salt", "1 1/2 pounds/700 grams seedless black grapes, such as Concord", "1 teaspoon ground star anise", "1 teaspoon ground cinnamon", "Freshly cut zest of 1 lemon, in strips", "1/4 cup/55 grams raw or demerara sugar", "1 teaspoon cornstarch (cornflour)", "3 ounces/80 grams mild, creamy blue cheese like Gorgonzola (dolcelatte type) or St. Agur, torn into 1/2-inch/1-centimeter pieces", "1 tablespoon picked thyme leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a large bowl, combine the flour and yeast with 1 tablespoon of the oil and 1/2 teaspoon of salt. Add 1/2 cup/120 milliliters lukewarm water and, using a sturdy spatula, bring the mixture together until it forms a shaggy mass."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to a lightly oiled work surface and, with lightly oiled hands, knead for about five minutes, until soft and elastic. If it starts to stick to your work surface then just add a little bit more oil. Coat the dough ball very lightly in oil, transfer to a clean bowl, cover with a slightly damp cloth and leave in a warm spot for about 1 hour, until nearly doubled in size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the dough is rising, make the topping: In a large sauté pan over medium-high heat, combine the grapes, 1/2 teaspoon star anise, 1/2 teaspoon cinnamon, 1 cup/240 milliliters water, the lemon zest and sugar. Cook for 13 to 15 minutes, stirring frequently and gently smashing the grapes with the back of a spatula until the consistency is jammy and the grapes have softened and begin to burst. Discard the lemon zest and stir in the cornstarch. Remove from heat and set aside to cool for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 500 degrees Fahrenheit/260 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large, sturdy baking sheet in the oven to heat. (A thin pan can warp at this high temperature.) Lightly oil a work surface and, using a rolling pin, roll out the dough to form a roughly 11-by-15-inch/20-by-40-centimeter rectangle (a bit smaller than the sheet pan). Use your hands to press the dough so that the edges are slightly thicker than the rest of the dough, like a pizza, to prevent juices from spilling over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from oven, brush with 1 1/2 tablespoons of oil and lay the dough on top. Brush the edges of the dough with oil. Spoon the grape jam onto the center of the dough and spread outward, leaving a 3/4-inch/2-centimeter rim clear around the edges. Sprinkle with the remaining 1/2 teaspoon each of star anise and cinnamon. Bake for 12 to 15 minutes, or until crisp and browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and immediately scatter the blue cheese evenly over the top so it starts to melt. Sprinkle with the thyme and let cool 10 minutes. Transfer to a cutting board and cut while still warm. Serve warm (preferably) or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1018966-black-grape-blue-cheese-and-thyme-flatbread"}