{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Mint, Basil and Fresh Mozzarella", "description": "In this green pasta dish, basil, mint, Parmesan and garlic are blended into a smooth pesto-like sauce, then tossed with pasta, creamy mozzarella and crunchy pine nuts just before serving. Marinating the mozzarella in some of the sauce as the pasta cooks imbues the mild cheese with flavor, and allows it to start softening so it melts in contact with the pasta. Serve this hot or warm, when the cheese is supple and a little runny.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/07/19/dining/19APPE1/19APPE1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, quick, weekday, pastas", "keywords": "basil, mint, mozzarella, pasta, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 739}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 785, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "3 grams", "proteinContent": "25 grams", "saturatedFatContent": "12 grams", "sodiumContent": "417 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup pine nuts", "2/3 cup grated Parmesan, plus more for garnish", "4 cups fresh basil leaves, plus more torn leaves for garnish", "1 cup fresh mint leaves, plus more torn leaves for garnish", "2 garlic cloves, finely grated or minced", "1/2 teaspoon fine sea salt, or to taste", "Pinch red chile flakes", "1/2 cup extra-virgin olive oil, plus more as needed", "8 ounces fresh bocconcini or mozzarella, cut into 1/2-inch pieces", "12 ounces pasta, such as campanelle or fusilli", "Coarsely ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet over medium heat, toast pine nuts, shaking the pan frequently, until golden, about 3 minutes. Transfer to a plate to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender or mini food processor, combine Parmesan, basil, mint, garlic, salt and chile flakes. Pulse to combine, then add oil and process until smooth, adding more oil if needed to make a smooth paste. Taste and adjust salt and chile flakes if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer 2 tablespoons sauce to a small bowl and stir in mozzarella. Cover and let marinate at room temperature while boiling the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Cook pasta according to package directions until al dente. Use a mug to scoop out approximately 1/2 cup pasta water, then drain pasta. Transfer pasta to a serving bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, toss pasta with sauce and marinated mozzarella, adding a little of the reserved pasta water if the mixture looks dry. (It’s O.K. if the mozzarella melts slightly while you’re tossing.) Top with pine nuts, torn basil and mint, black pepper, Parmesan and another drizzle of oil to serve."}], "link": "https://cooking.nytimes.com/recipes/1018835-pasta-with-mint-basil-and-fresh-mozzarella"}