{"@context": "http://schema.org", "@type": "Recipe", "name": "Ma’amoul", "description": "Ma’amoul are popular Middle Eastern shortbread cookies flavored with mahlab — a powdered spice made of cherry pits — and orange blossom water. They’re usually stuffed with crushed pistachios, crushed walnuts or date paste and stamped with geometric designs. They are often presented as gifts during high holidays, and are best enjoyed with tea or Turkish coffee. This version, which came to The Times by way of Dalia Mortada in <a href=\"http://www.nytimes.com/2016/09/11/opinion/sunday/the-flavors-that-unite-syrians.html\">a Sunday Review piece she wrote about Syrian food</a>, is adapted from Rana Jebran, a founder of HoneyDoe, a Syrian catering company in Chicago.", "author": {"@type": "Person", "name": "The New York Times"}, "image": null, "totalTime": "PT3H", "recipeYield": "18 to 20 cookies", "recipeCuisine": "middle eastern", "recipeCategory": "cookies and bars", "keywords": "dessert, mahlab, pistachios, semolina flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 211, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "5 grams", "sodiumContent": "2 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["9 tablespoons (125 grams) unsalted butter, softened", "1/4 cup ghee (clarified butter)", "1 1/2 cups (250 grams) coarse semolina", "1 1/2 cups (250 grams) fine semolina (or all-purpose flour)", "1/4 cup (50 grams) granulated sugar", "1/2 teaspoon mahlab (available in Middle Eastern shops)", "1/4 cup orange blossom water", "1/2 teaspoon instant yeast", "1 to 3 tablespoons cold milk", "Powdered sugar, for dusting", "6 tablespoons (50 grams) shelled pistachios, finely chopped", "1/2 tablespoon powdered sugar", "1/2 tablespoon orange blossom water", "1/2 cup (50 grams) walnut pieces, finely choppped", "1/2 tablespoon powdered sugar", "1/4 teaspoon cinnamon", "1/2 tablespoon orange blossom water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: In a large bowl combine the butter and ghee and mix well with a spatula. In a separate bowl, combine the coarse and fine semolina, the sugar and mahlab and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the dry ingredients to the butter-ghee mixture. Use your hands to massage the ingredients together, rubbing it between your fingers without kneading or over-working the dough. Add ¼ cup orange blossom water and thoroughly mix with your hands again. Cover and set aside to rest for at least two hours and up to 10 hours at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the nut fillings: In a bowl, thoroughly mix the pistachios, sugar and orange blossom water; set aside. In a separate bowl thoroughly mix the walnuts, sugar, cinnamon and orange blossom water; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350˚F and line a baking sheet with parchment paper. In a small bowl, mix the yeast with 2 tablespoons warm water until it dissolves. Add it to the dough and mix using your hands (but, again, don’t knead). If the dough seems too dry to form into a ball, add cold milk, 1 tablespoon at a time, until the dough comes together. The dough shouldn’t be wet, just moist enough to stick together when forming the cookies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take a chunk of dough and roll it into a ball the size of a golf ball. Holding the dough ball in one hand, take the index finger of your other hand to indent the center and form a hollow area by continuing to press down while turning the ball with your other hand. Spoon one of the nut fillings into the hole and close it back up, pinching the dough together over the filling. Repeat with remaining dough and filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the Middle East, ma’amoul cookies have beautiful intricate designs after being pressed into special molds. You can find molds online or at a Middle Eastern supermarket. Otherwise you could use a muffin tin to shape the cookies. Press the stuffed dough ball into an oiled mold and then gently smack the mold onto your hand to get the cookie out. Arrange the molded cookies on the prepared baking sheet and bake until golden brown on the bottom, about 14 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust the cookies with a layer of powdered sugar as soon as they come out of the oven (the sugar will melt into the dough), then dust again once cooled. Serve with a cup of tea or Turkish coffee."}]}