{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Peanut Butter Cups", "description": "These chocolate peanut butter cups are dangerously simple to make, with just a few ingredients that you probably have in the pantry right now. They come together faster than a trip to the convenience store. And they are completely customizable. Once you’ve gotten your fill of the standard peanut butter cup, try honey-sweetened cashew butter cups. Or cinnamon-spiked almond butter cups. Drizzle the finished cups with a bit of white or milk chocolate, some flaky sea salt or a sprinkle of finely chopped nuts for an upgraded presentation. Or sneak a tiny dollop of raspberry jam underneath the peanut butter layer for another delightfully classic pairing. The possibilities are endless.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2019/10/28/dining/05COOKING-PEANUTTERCUPS2/05COOKING-PEANUTTERCUPS2-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "18 cups", "recipeCuisine": "american", "recipeCategory": "candies", "keywords": "dessert, peanut butter, semisweet chocolate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 501}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 257, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "7 grams", "sodiumContent": "100 milligrams", "sugarContent": "19 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["9 ounces/255 grams semisweet chocolate", "3/4 cup/205 grams smooth natural peanut butter", "1/4 cup/28 grams confectioners’ sugar", "1/2 teaspoon vanilla extract", "1/2 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set 18 mini paper baking cups on a baking sheet. Melt 4 ounces of the chocolate either over a double boiler on the stove top or in short bursts in the microwave. Spoon 1 teaspoon of melted chocolate into each cup. Use an offset spatula or a small spoon to spread the chocolate slightly up the sides of each baking cup; make sure you have an even chocolate base at the bottom of each cup. Let cool at room temperature for about 15 to 20 minutes until mostly solid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium bowl, stir together peanut butter, confectioners’ sugar, vanilla extract and salt. (Make sure the peanut butter is well-combined in the jar before you measure it.) Transfer the peanut butter mixture to a resealable plastic bag and seal it tightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut one corner of the plastic bag and pipe 2 to 3 teaspoons of peanut butter mixture into the center of each cup. With a very lightly moistened finger, tamp down the peanut butter and make it flat and even, but leave a bit of space between the peanut butter and the edge of the paper cup (you should be able to see a ring of chocolate peeking from below the peanut butter)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the remaining 5 ounces of chocolate. Spoon 1 teaspoon of chocolate onto the top of each cup. Use an offset spatula or a small spoon to spread the chocolate evenly over the top and down the sides of the cup. Refrigerate until solid, about 30 minutes."}], "link": "https://cooking.nytimes.com/recipes/1018460-chocolate-peanut-butter-cups"}