{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Lamb and Rice with Walnuts, Mint and Pomegranate", "description": "A baked lamb and rice dish I tasted in Istanbul, etli pilav, inspired this one-pot meal, topped with walnuts and fresh mint and pomegranate seeds. Similar pilaf-style rice dishes are made all across the Middle East and into Asia. Kabuli pulao in Afghanistan is acclaimed; the Persian baghali polov ba gusht is justly famous, as is the Lebanese Hashwet al-ruz; and there are myriad fabled biryanis made with lamb (or goat) in India and Pakistan. Pomegranate molasses is available in Middle Eastern groceries or online. It provides a sweet-sour, fruity undertone, but you may omit it and still get good results. Try a squeeze of lime instead.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/10/25/dining/25KITCHEN1/25KITCHEN1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, easy, casseroles, meat, one pot", "keywords": "boneless lamb shoulder, dried chickpeas, golden raisins, walnut, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 219}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 846, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "75 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "7 grams", "proteinContent": "37 grams", "saturatedFatContent": "17 grams", "sodiumContent": "692 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup dried chickpeas, soaked overnight, or 3 cups cooked or canned chickpeas", "2 pounds boneless lamb shoulder, cut in 1-inch cubes", "Salt and freshly ground black pepper", "2 tablespoons olive oil", "1 large onion, diced", "1/2 cup golden raisins", "2 tablespoons pomegranate molasses, optional", "1/2 teaspoon ground cumin", "1/2 teaspoon ground coriander", "1/2 teaspoon ground allspice", "1/4 teaspoon ground mace or nutmeg", "1 cinnamon stick, 2 inches long", "1 1/2 cups basmati rice, soaked for 20 minutes and rinsed", "1 tablespoon unsalted butter", "1 cup walnut halves and pieces", "1/2 cup fresh pomegranate seeds", "2 tablespoons roughly chopped mint", "Pinch of crushed red pepper", "Thick plain yogurt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using dried chickpeas: Put soaked chickpeas in a saucepan and cover with water by 1 inch. Bring to a boil, then reduce heat to a simmer. Cook, uncovered, for 45 minutes to an hour, until tender. Top up with water as necessary to keep chickpeas covered. (If using pre-cooked or canned chickpeas, skip this step.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season lamb pieces generously with salt and pepper. In a large heavy skillet or Dutch oven with a lid, heat oil over medium-high heat. Working in batches over high heat, brown the lamb pieces on both sides, removing them to a plate as they are cooked. (Don’t crowd the pan or they won’t brown nicely.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the lamb is browned and the pot is empty, reduce heat to medium high. Add onions, season with salt and pepper and cook, stirring occasionally, until softened and lightly browned, 6 to 8 minutes. Add raisins, pomegranate molasses (if using), cumin, coriander, allspice, mace, and cinnamon and stir to coat. Return lamb to the pot, along with any juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using canned chickpeas, drain well. If using cooked chickpeas, drain and reserve the cooking liquid. Add drained chickpeas and rice to onion mixture and stir together. Turn heat to high and add 2 cups chickpea cooking liquid (or 2 cups water or broth, if using canned chickpeas). Bring to a boil, then reduce to a simmer. Cover tightly. Bake about 1 hour, until lamb is tender when probed with a fork and rice is cooked through. Let rest for at least 10 minutes before serving, or up to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small skillet, melt butter over medium heat until it foams. Add walnuts and cook, stirring, until lightly browned, about 2 minutes. Salt lightly and set aside. Fluff the lamb and rice gently, lifting up from the bottom. Serve directly from pot or transfer to a serving platter. Sprinkle with walnuts, pomegranate seeds, mint and crushed red pepper. Pass a bowl of yogurt at the table."}], "link": "https://cooking.nytimes.com/recipes/1018976-spiced-lamb-and-rice-with-walnuts-mint-and-pomegranate"}