{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef With Horseradish-Beet Aioli", "description": "For this modern take on traditional boiled beef, a beef fillet is very gently simmered (never boiled) with root vegetables in stock, then sliced up rosy rare and dolloped with a homemade horseradish aioli and some flaky sea salt. It’s piquant, juicy and on the lighter side of a beefy main course. Tenderloin works best here, but it's not generally considered kosher, so if you are making it for Passover, Rosh Hashana or another Jewish holiday, use a boneless rib roast or center cut London broil.  The magenta-colored beet horseradish keeps in the fridge for weeks, and it's also great on roast beef sandwiches.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/04/08/multimedia/clark-beef-tenderloin/clark-beef-tenderloin-mediumThreeByTwo440.jpg", "totalTime": "PT4H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "beef stock, beef tenderloin, beet, horseradish root, root vegetables, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 54}, "recipeIngredient": ["3 pounds center-cut beef tenderloin, boneless rib roast or center-cut London broil, trimmed", "2 teaspoons kosher salt, more as needed", "1 1/2 teaspoons black pepper", "Finely grated zest of 1 lemon", "2 garlic cloves, finely grated on a microplane or mashed", "3 large leeks, white and light green parts, trimmed, halved lengthwise and rinsed", "1 tablespoon extra-virgin olive oil", "1/2 cup dry white wine", "5 cups mixed root vegetables, such as parsnip, carrot, turnip, celery root and rutabaga, trimmed, peeled and cut into 3/4-inch chunks (1 1/2 pounds trimmed)", "10 smashed and peeled garlic cloves", "6 cups good-quality beef stock (or chicken stock in a pinch)", "1 small bunch thyme, tied with kitchen twine", "1 bay leaf", "Lemon juice, as needed", "Coarse sea salt, as needed", "Chopped chives, for garnish", "1 medium horseradish root (about 10 ounces), peeled and cut into large chunks", "1 small raw beet, peeled", "2/3 cup white wine vinegar", "1 1/2 tablespoons granulated sugar", "1/2 teaspoon kosher salt", "1 large egg, at room temperature", "1 large egg yolk, at room temperature", "Juice of 1/2 lemon", "1/2 teaspoon kosher salt", "1 cup extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the beef: Pat the beef dry and season all over with salt, pepper, lemon zest and grated garlic. Cover with plastic wrap and refrigerate at least 1 hour or overnight. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the fresh horseradish and beets: In a food processor fitted with the grating blade, grate horseradish and beet. Replace the grating blade with the food processor chopping blade. Add vinegar, sugar and salt. Process until mixture is finely chopped, stopping occasionally to scrape down the sides of the bowl, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the aioli: In a medium bowl, whisk together egg, egg yolk, lemon juice and salt. Whisking constantly, add oil in a thin, steady stream until fully incorporated. (Or do this in the blender if you prefer.) Aioli should be emulsified, but somewhat loose. Stir in 2 to 4 tablespoons horseradish mixture, to taste; reserve remaining horseradish mixture and serve alongside aioli and beef. Chill aioli until needed; it will keep for up to 5 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove beef from refrigerator. If needed, fold the thin end of the meat over itself so the meat becomes an evenly thick log, then tie ends with kitchen twine. (Skip this step if the meat is already an evenly thick log.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bundle three leek halves together with kitchen twine, securing them in at least two places so that the leeks don’t slip out. Repeat with remaining leek halves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil over medium-high heat in the bottom of a wide Dutch oven. Add beef and brown well on all sides, about 10 minutes. Transfer meat to a platter. Stir in wine and cook, scraping up any browned bits from bottom of pan, until reduced by half, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add leeks, root vegetables, garlic and stock to the pot. Tie thyme branches together with twine and drop into the pot. Stir in bay leaf. Bring mixture to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add meat and any juices on the plate and cook, partly covered, at a gentle simmer (do not let it come to a boil) until meat reaches desired doneness (120 degrees on an instant-read thermometer for rare), 15 to 25 minutes. Immediately remove meat from pot, transfer to a plate, and tent with foil to rest 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If vegetables are not quite tender, continue to simmer them until they are. Taste stock and season with salt and a squeeze of lemon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the meat thinly just before serving. To serve, spoon vegetables into shallow bowls and arrange meat on top. Ladle a little of the broth over and around meat and vegetables. Sprinkle with coarse sea salt and chopped chives. Serve with aioli and additional fresh horseradish and beets."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Simmered Beef with Horseradish", "description": "Make your own horseradish for this festive beef tenderloin.", "thumbnailUrl": "https://static01.nyt.com/images/2016/04/08/multimedia/clark-beef-tenderloin/clark-beef-tenderloin-mediumThreeByTwo440.jpg", "uploadDate": "2016-04-08T15:41:00.000Z", "duration": "PT2M28S"}, "link": "https://cooking.nytimes.com/recipes/1018048-beef-with-horseradish-beet-aioli"}