{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Oysters With Hot-Sauce Butter", "description": "Oysters cook quickly on a hot grill, the meat poaching in a bubbling compound butter flavored with a vinegar-rich hot sauce, garlic and lemon zest. Ideally, you can assign someone else the job of shucking and focus on the grill, making sure the oysters don't stay on it much longer than 2 or 3 minutes, so the meat is still plump and juicy. If you're working on your own, open the oysters in advance and handle them carefully, so as not to spill the liquor inside the shells, which combines with the melted butter to create a delicious, briny flavor. To make a whole meal out of them, serve them with some grilled bread and a simple salad.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/08/20/magazine/20eat1/20eat1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "", "keywords": "anchovy, butter, hot sauce, oyster", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 102}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 901, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "60 grams", "fiberContent": "0 grams", "proteinContent": "58 grams", "saturatedFatContent": "32 grams", "sodiumContent": "959 milligrams", "sugarContent": "1 gram", "transFatContent": "2 grams"}, "recipeIngredient": ["8 ounces butter", "3 tablespoons Crystal hot sauce", "1 small garlic clove", "1 lemon, zested, then cut into wedges", "1 anchovy", "48 oysters"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, combine butter, hot sauce, garlic, lemon zest and anchovy, and pulse until there are no streaks of hot sauce and the butter is a uniform shade of pale pink. (If you don’t have a food processor, leave the butter out until it’s very soft, then beat the ingredients together with a spoon.) Scrape the mixture into a small bowl, and set aside in the fridge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the oysters in a large bowl in the sink, and scrub off any sand or grit. Rinse well, drain and refrigerate until you’re ready to shuck. To shuck: Grip an oyster with a folded dishtowel so the shell is cupped side down, hinge side facing toward you. Push the tip of the oyster knife into the hinge, and twist so it cracks open. Make sure the knife is clean of shell and grit, then use it to release the top shell, and slide it under the oyster meat to release it from the bottom shell. Repeat with remaining oysters, discarding any that are already open or that have a bad smell."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Build a fire in your charcoal grill, or set a gas grill to high. Gently crumple a sheet of aluminum foil so its grooves can support the open oysters and keep them from spilling, and set it on the grate. Place 12 oysters on the foil, and top each with approximately ½ teaspoon of butter; use more for especially large oysters, but less for small ones. The idea is to cover the oyster with butter, but not to overfill the shell. Cover the grill, and cook until the butter and oyster juices are bubbling but the oyster is still plump, about 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use tongs to transfer hot oysters to a platter lined with another piece of foil that will keep the shells upright, and serve immediately with a bottle of hot sauce and lemon wedges at the table. Repeat with remaining oysters."}], "link": "https://cooking.nytimes.com/recipes/1018899-grilled-oysters-with-hot-sauce-butter"}