{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Chickpeas, Chorizo and Bread Crumbs", "description": "If you're a planner, you can soak and cook dried chickpeas for this easy pasta dish, but if you're not, no worries. Using two or three cans makes it a real cinch; you'll have it on the table in about 20 minutes. First, brown the chorizo or kielbasa and set aside. Toast the bread crumbs in the same pan with a smattering of minced garlic, and set that aside, too. Dump the chickpeas into the pan with a bit of their liquid and let that reduce a bit while the pasta cooks. After draining the pasta, toss it with the chickpeas and sausage, and heat through. Serve it in big bowls with bread crumbs scattered over the top and a few aggressive grinds of the pepper mill. Our favorite pasta shape for this recipe is conchiglie, or shells, because the chickpeas nestle inside like they belong there, but it will work with almost any small cut pasta.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2018/12/05/dining/pasta-chickpeas-chorizo-bread-crumbs/merlin_147457086_4bdda1b3-8147-4e11-9762-ef4359833f8a-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weeknight, pastas", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 139}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 754, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "109 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "16 grams", "proteinContent": "33 grams", "saturatedFatContent": "6 grams", "sodiumContent": "950 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["Salt and black pepper", "Extra virgin olive oil, as needed", "1/4 pound cooked Spanish chorizo or kielbasa, chopped", "1 tablespoon minced garlic", "1 cup coarse fresh bread crumbs", "4 cups cooked chickpeas, with their liquid", "1/2 pound pasta, like shells, ziti or penne (even smaller cut pasta is good here)", "Chopped parsley leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large pot of water to boil and salt it. Put 1 tablespoon olive oil in a skillet over medium heat and add chorizo; heat, stirring occasionally, until chorizo is lightly browned, then remove with a slotted spoon and set aside. Add 2 tablespoons olive oil and then the garlic; cook until it colors lightly, then add bread crumbs. Toast, shaking skillet frequently, until bread crumbs turn golden brown, about 10 minutes; if necessary, add a little more olive oil. Season with salt and pepper and remove to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 more tablespoons olive oil to skillet and, over medium heat, chickpeas and about 1 cup of their liquid. Cook pasta until it is nearly but not quite tender; drain, then add it to chickpeas. Cook, stirring occasionally, until pasta is tender; stir in chorizo, heat through, and taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve chickpea-pasta mixture in bowls, garnished with crisp bread crumbs and a sprinkling of parsley."}]}