{"@context": "http://schema.org", "@type": "Recipe", "name": "Moo Shu Pork", "description": "This is not your corner takeout's moo shu pork, but it is popular in China, where its northern origins are debated, according to the author Carolyn Phillips. The egg is thought to resemble the flowers of the sweet olive (osmanthus fragrans) shrub, hence its Chinese name, muxi rou, or osmathus blossom pork. The ingredients are stir-fried in batches to cook evenly and retain the vibrancy of the colors. The sauce is intentionally salty, so underseason the stir-fry and add just a dab of sauce to each wheat wrapper.", "author": {"@type": "Person", "name": "Sara Bonisteel"}, "image": "https://static01.nyt.com/images/2016/09/28/dining/28CHINESE-WEB2/28CHINESE-WEB2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 to 3 main course servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, project", "keywords": "main course, pork tenderloin, rice wine, sweet bean paste", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 284}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 935, "unsaturatedFatContent": "42 grams", "carbohydrateContent": "83 grams", "cholesterolContent": null, "fatContent": "54 grams", "fiberContent": "8 grams", "proteinContent": "30 grams", "saturatedFatContent": "9 grams", "sodiumContent": "2120 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons toasted sesame oil", "1/4 cup sweet bean paste", "2 teaspoons soy sauce", "2 teaspoons sugar", "2 tablespoons mild rice wine, such as sake", "1 teaspoon sugar", "4 ounces boneless pork tenderloin (or beef or pressed bean curd)", "1/2 teaspoon fine sea salt", "1/4 cup shredded dried wood ear fungus (often sold as “black fungus”) or 3 fresh wood ears ", "1/4 cup dried daylily flowers, or 1 small carrot, peeled and julienned", "6 tablespoons toasted sesame oil or peanut or vegetable oil, divided", "2 cloves garlic, minced", "3 large eggs, lightly beaten", "1 large fresh winter bamboo shoot, peeled, blanched and julienned (or frozen and defrosted, julienned), or 8 ounces mung bean sprouts", "2 green onions, trimmed to 1 1/2-inch lengths and cut into thin shreds", "8 thin wheat wrappers (<a href=\"http://cooking.nytimes.com/recipes/1018334-chinese-wheat-wrappers\">see recipe</a>) or 8 soft flour tortillas, warmed", "2 green onions, trimmed to 1 1/2-inch lengths and cut into thin shreds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Heat sesame oil in a wok over medium heat and mix in sweet bean paste. Stir together until smooth and then add soy sauce and sugar. When sauce bubbles, taste and adjust seasoning, then scrape sauce into a small bowl. Rinse out wok."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the moo shu pork: In a small bowl, mix together rice wine and sugar. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice meat against the grain into 1/4-inch-thick pieces. Cut into batons about 1/8-inch wide. Put batons in a small bowl and toss them with salt. (If using pressed bean curd, cut it into thin julienne before tossing it with salt.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak shredded dried wood ear fungus in boiling water until pliable, about 15 minutes, then rinse and drain in colander. (Fresh wood ears should be rinsed before they’re trimmed and cut into thin strips.) Meanwhile, if using dried daylily flowers, cover with boiling water and let soak until soft, about 10 minutes, then drain and tear into strips. (Carrots do not need to be soaked.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place wok over medium heat, and when hot, swirl in 2 tablespoons sesame oil. Toss in garlic and fry until fragrant. Add eggs and scramble them, breaking up large curds into pieces 1/2 inch or smaller. When eggs are barely done, scrape into a large, clean bowl. If any garlic remains in the wok, wipe it out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise heat under wok to high. Pour in another 2 tablespoons oil into the hot wok and quickly stir-fry meat until it’s browned before scraping it into eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return wok to high heat. Stir-fry bamboo shoots with a little bit more oil as needed, then add wood ears and either the daylily flowers or carrot and cook these until they are barely done before tossing them into the bowl with the meat and eggs. (If you’re using bean sprouts in place of bamboo shoots, cook the wood ears and daylily flowers or carrot alone and add them to the bowl with the meat and eggs; then place wok over high heat, swirl in a tiny bit of oil and quickly stir-fry the sprouts until they’re just beyond raw but still very crisp before adding them to the bowl with the other cooked ingredients.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place wok back over high heat, pour in any remaining sesame oil, and add green onions, all of the cooked meat, eggs and vegetables, and the rice wine and sugar mixture. Toss these quickly together for a few seconds, taste and adjust seasoning, and plate in a bowl or on a rimmed platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot with the sauce, wheat wrappers and shredded green onions. Have each diner spread about 2 teaspoons sauce down the center of the wrapper, sprinkle on some raw green onions, and pile on about 1/2 cup of the meat mixture. Fold the bottom edge of the wrapper up over the meat mixture, then fold one side over the center before rolling up the rest of the wrapper from the opposite edge. Eat with your hands."}], "link": "https://cooking.nytimes.com/recipes/1018333-moo-shu-pork"}