{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Brie", "description": "Serve a creamy, runny-centered, pastry-wrapped baked brie at your next party and watch your guests cluster around it, slicing off bits until it completely disappears. Don’t be tempted to use a fancy, artisan brie from a cheese shop here. This recipe works best with the regular kind of brie you find at the supermarket; fancier bries may leak out of their pastry. Choose any flavor jam for the topping. Orange or ginger marmalade will give you something tangier than, say, raspberry and cherry jam, which are sweeter, more mellow options. While a wedge of brie will work in this recipe, a round of brie looks prettiest.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/05/06/dining/25COOKING-BAKEDBRIE1/25COOKING-BAKEDBRIE1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 or more servings", "recipeCuisine": "", "recipeCategory": "easy, finger foods", "keywords": "appetizer, brie, jam, puff pastry", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 951}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 43, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "32 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 piece of brie, 4 to 8 ounces, cold", "1 sheet puff pastry, chilled but not frozen", "2 tablespoons thick jam or marmalade, any flavor", "1 egg beaten with 1 tablespoon water", "1 tablespoon demerara sugar (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Using a large chef’s knife, cut the white rind off the brie and discard (this works best when the cheese is very cold)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the chilled dough to about 1/8-inch thick. Transfer the rolled dough to a baking sheet covered with parchment paper. Place the brie at the center of the dough square and then spread the jam over the top of cheese. Drape the four corners of the dough, one at a time, across the brie to enclose it. If there is too much overlapping dough, trim the sides before draping. You want the dough to just cover the brie."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the egg wash over the brie, making sure it does not pool where it meets the tray or it will stick. Sprinkle with the sugar if using. Bake on the middle rack of the oven for 35 to 45 minutes, until the pastry is golden brown and cooked through. Transfer to a wire rack and let cool for 8 to 10 minutes before serving warm."}]}