{"@context": "http://schema.org", "@type": "Recipe", "name": "Award-Winning Maple Blueberry Pie", "description": "Paul Arguin, an epidemiologist, relaxes by making pie. This one, with its generous amount of fruit and sweetness from maple syrup, won the blueberry-division prize in the 2017 National Pie Championships. A few tricks raise it above other blueberry pies. One is the crust, which has a touch of cinnamon and maple sugar, and uses cider vinegar and just a little shortening for structure. Dr. Arguin cooks the filling in a sous-vide machine, which keeps the berries whole but tender. For the top crust, he borrows an idea from cake makers who work with fondant. Four planks of dough are pressed into an inexpensive silicone mat molded to look like wood grain, then peeled off and set on top of the pie. Home cooks without fancy equipment, take heart. The berries can be cooked slowly on the stove, and four strips of plain dough for the top crust work just as well.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2017/07/19/dining/19PIE6/19PIE6-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "blueberries, maple extract, maple syrup, tapioca, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 90}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 555, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "77 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "13 grams", "sodiumContent": "347 milligrams", "sugarContent": "35 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["2 3/4 cups/340 grams all-purpose flour", "1/8 teaspoon cinnamon", "1 tablespoon maple sugar", "1 teaspoon salt", "1/4 teaspoon baking powder", "4 tablespoons/57 grams cold shortening", "12 tablespoons/170 grams cold unsalted butter, cut into cubes", "2 teaspoons cider vinegar", "6 tablespoons/89 milliliters cold water", "6 cups/907 grams blueberries", "1 Granny Smith apple", "2 heaping tablespoons minute tapioca (a little less if you prefer a softer filling)", "1/8 teaspoon salt", "1/8 teaspoon cinnamon", "1/2 cup/100 grams sugar", "1/3 cup/79 milliliters maple syrup", "3/4 teaspoon maple extract", "1 tablespoon lemon juice", "1 egg yolk", "1 tablespoon heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In the bowl of a food processor, mix the flour, cinnamon, maple sugar, salt and baking powder. Add the shortening and process until well incorporated. Add the butter and pulse until pea-size nuggets of butter remain. Add the vinegar and water, and pulse until dough is just holding together. Divide into 2 disks. Wrap in plastic and chill in refrigerator overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: If using a sous-vide machine, place the blueberries into a vacuum-sealable bag. (If not, see Step 4.) Peel and core the apple and grate with a box grater. Squeeze the grated apple to remove the juice. Disperse the grated apple among the blueberries in the bag."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor, grind the tapioca, salt, cinnamon and sugar until the tapioca is fine. Then add to the bag. Stir the maple syrup, maple extract and lemon juice together and pour into the bag. Seal the vacuum bag. Cook in water bath at 150 degrees for 1 hour. Remove and cool on the countertop for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a stovetop, prepare the ingredients in the same way as the sous-vide method, but place all the ingredients in a saucepan with a lid, and stir well to combine. Cook over medium-low heat, stirring gently and occasionally, just until the berries soften and begin to give off their juice, about 20 minutes. Remove and cool on the countertop for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the pie: Roll out one of the dough disks on a lightly floured surface to make a top crust, and cut into 4 large strips. Press the dough into a wood-grain impression silicone mat and freeze for about 15 minutes. Or, simply place the 4 strips on a baking sheet lined with parchment and freeze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the second dough disk and place in a 9-inch pie plate. Pour maple blueberry filling into it. Place 4 crust strips on top of pie, slipping one end under another to form an attractive pattern. Trim and crimp edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill pie in the freezer while heating oven to 425 degrees. Stir the egg yolk and heavy cream together and brush over the top-crust strips. Place the pie in the oven on the bottom rack and immediately reduce heat to 400 degrees. After 15 minutes, rotate pie and cover edge with a pie ring or strips of foil to prevent the edges from overbrowning. Bake for an additional 40 minutes. Let pie cool slightly before slicing."}]}