{"@context": "http://schema.org", "@type": "Recipe", "name": "Alice Waters’s Seasonal Minestrone", "description": "Alice Waters often recommends that cooks master a good minestrone. It’s communal and seasonal, two pillars on which she has built her cooking career. This summer recipe came from the cookbook that is her top seller: \"The Art of Simple Food.\" It uses the best of the season’s green beans, tomatoes and squash. In the spring, fresh peas, asparagus and spinach would make a good vegetable trio, with some fennel standing in for the carrot in the sofrito. In the fall, cubes of butternut squash, a small can of tomatoes and a bunch of kale would star, with rosemary and a little chopped sage instead of thyme for seasoning. Winter might bring a soup built from turnips, potatoes and cabbage. If the turnips have greens, add them, too. Start with a large pot that has a heavy bottom. Always cook the vegetables through, about 10 minutes. They should look good enough to eat on their own. Add the beans about 10 minutes before serving. A cup or two of cooked pasta can be stirred in at the last minute. Don’t overcook the pasta. The olive oil and cheese garnish should be added once the soup is in the bowls. Ms. Waters likes to pass those at the table, once everyone is served. Pesto makes a lovely garnish, too, and gives a garlicky, herbal punch to the soup.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2017/08/23/dining/23WATERSJump4/23WATERSJump4-articleLarge.jpg", "totalTime": "PT2H45M", "recipeYield": "8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, for two, lunch, soups and stews", "keywords": "summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 269}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 187, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "7 grams", "proteinContent": "8 grams", "saturatedFatContent": "1 gram", "sodiumContent": "393 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 cup dried cannellini or other white beans", "¼ cup olive oil", "1 large onion, finely chopped", "2 carrots, peeled and finely chopped", "4 garlic cloves, coarsely chopped", "5 thyme sprigs", "1 bay leaf", "2 teaspoons kosher salt", "1 small leek, white part only, diced", "½ pound green beans, trimmed and cut into 1-inch lengths", "1 medium zucchini, cut into small dice", "2 medium tomatoes, peeled, seeded and chopped", "2 cups spinach, coarsely chopped", "Grated Parmesan cheese, for serving", "Pesto, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the beans overnight in a large pot, covered by several inches of water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, simmer the beans 2 hours or until tender. Drain and set aside, reserving the cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large pot over medium heat. Add the onion and carrots and cook for about 10 minutes, or until onion is translucent. Add the garlic, thyme, bay leaf and salt. Reduce heat to medium-low and cook, stirring often, for 5 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 3 cups water and bring to a low boil. When boiling, add the leek and green beans. After 5 minutes, add the zucchini and tomatoes. After 15 minutes, add the spinach and beans and cook for 5 more minutes. If the soup is too thick, add water (reserved bean water is good)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bay leaf and bare thyme sticks and adjust the seasoning, if necessary. Serve in bowls, each garnished with grated Parmesan cheese or pesto."}], "link": "https://cooking.nytimes.com/recipes/1018898-alice-waterss-seasonal-minestrone"}