{"@context": "http://schema.org", "@type": "Recipe", "name": "Vanilla-Honey Soft Serve Ice Cream", "description": "You don’t need an ice cream maker for rich, custardy ice cream. With the help of an electric mixer and food processor, you can create ice cream with the texture of soft serve. One of the keys to a silky texture without the ice crystals that plague other no-churn ice cream recipes is using cream cheese (a trick picked up from Jeni Britton Bauer of Jeni’s Splendid Ice Creams). This helps hold the custard's emulsification even during freezing. This ice cream is best served right out of the food processor or blender, but if you want to make it entirely ahead, take it out of the freezer 20 minutes before serving. If you would like to make this recipe with an ice cream maker, freeze the custard according to manufacturer’s directions after cooling it completely.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/06/08/multimedia/clark-honey-icecream/clark-honey-icecream-mediumThreeByTwo440.jpg", "totalTime": "PT40M", "recipeYield": "About 1 1/2 pints", "recipeCuisine": "american", "recipeCategory": "ice creams and sorbets", "keywords": "cream cheese, heavy cream, honey, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 247}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 278, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "0 grams", "proteinContent": "3 grams", "saturatedFatContent": "14 grams", "sodiumContent": "90 milligrams", "sugarContent": "16 grams", "transFatContent": null}, "recipeIngredient": ["6 large egg yolks", "1/2 cup/100 grams granulated sugar", "1/3 cup/79 milliliters flavorful honey", "2 teaspoons/10 milliliters vanilla extract", "1/4 teaspoon fine sea salt", "3 cups/710 milliliters heavy cream", "3 ounces/85 grams cream cheese, cubed, at room temperature", "1/3 cup/79 milliliters whole milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together yolks, sugar, honey, vanilla and salt until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan over medium heat, bring cream to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisking the yolks constantly, slowly pour half the hot cream into the egg mixture. Scrape custard back into saucepan and cook over medium-low heat, stirring constantly, until custard is thick enough to coat the back of a spoon (180 degrees on an instant-read or candy thermometer). Do not let mixture come to a simmer or it could curdle. Strain into a heatproof bowl and whisk in cream cheese until completely melted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Nestle bowl in a larger bowl filled with ice water. Using a hand mixer or immersion blender, whip custard until thick and cold, about 5 minutes. Spoon mixture into 3 or 4 ice cube trays. Freeze for at least 3 hours or overnight (or up to 1 week)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an offset spatula or butter knife, pop out ice cream cubes. Transfer to a food processor or blender. Pulse cubes with milk until the ice cream is smooth and has the consistency of soft serve. Serve immediately, or return to container and freeze for up to 1 week."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Soft Serve Ice Cream", "description": "Honey’s natural sweetness adds a rich depth to this homemade vanilla no-churn soft serve ice cream.", "thumbnailUrl": "https://static01.nyt.com/images/2016/06/08/multimedia/clark-honey-icecream/clark-honey-icecream-mediumThreeByTwo440.jpg", "uploadDate": "2016-06-10T16:17:29.000Z", "duration": "PT2M16S"}}