{"@context": "http://schema.org", "@type": "Recipe", "name": "Arroz Gordo", "description": "Arroz gordo, or fat rice from Macau, is reminiscent of paella, which is no surprise considering that Macau was a colony of Portugal, a country that shares many culinary traditions with its Iberian neighbor, Spain. Here, deliciously seasoned rice is studded with bits of duck and sausage and a host of other savory ingredients, all seasoned with a nod to Asia.\n\nMany of the components of this recipe can be prepared separately ahead of time and refrigerated, and in the case of the chicken, up to a week in advance and frozen. All that is needed is a quick reheat and last-minute assembly.\n\nThis recipe calls for chicken, pork, sausage, clams and shrimp, but feel free to make substitutions. Plump mussels would be a fine stand-in for the clams, and you could even purchase Chinese roast pork to skip the step of roasting your own.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/12/07/dining/07ENTERTAINING1/07ENTERTAINING1-articleLarge.jpg", "totalTime": "P2D", "recipeYield": "8 to 10 servings", "recipeCuisine": "chinese, portuguese", "recipeCategory": "dinner, project", "keywords": "chicken, clams, croutons, duck confit, eggs, olives, pork, rice, sausage, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "recipeIngredient": ["1 cup golden raisins", "1/2 cup plus 1 tablespoon sherry vinegar", "1 cup plain croutons", "4 tablespoons duck fat or chicken fat", "1 1/2 tablespoons extra-virgin olive oil", "1 medium-large onion, slivered", "1 large red bell pepper, cored, seeded and slivered", "Salt and pepper", "1 1/2 tablespoons minced garlic", "1/2 tablespoon tomato paste", "1/2 teaspoon smoked paprika", "2 prepared duck confit legs and thighs, available in many food stores and online", "4 scallions, cut in 2-inch lengths", "1 4-inch piece fresh ginger, sliced thin", "3 cups jasmine rice", "1/2 cup chicken stock", "Glazed Pork (<a href=\"http://cooking.nytimes.com/recipes/1018465-glazed-pork\">see recipe</a>)", "Turmeric Chicken (<a href=\"http://cooking.nytimes.com/recipes/1018466-turmeric-chicken\">see recipe</a>)", "1 pound linguiça sausage, sliced", "Chile Shrimp (<a href=\"http://cooking.nytimes.com/recipes/1018467-chile-shrimp\">see recipe</a>)", "Garlic Clams (<a href=\"http://cooking.nytimes.com/recipes/1018468-garlic-clams\">see recipe</a>)", "4 hard-cooked eggs, halved", "1 cup pitted green olives, preferably Portuguese", "3 lemons, quartered", "3 scallions, slivered on a slant, including green part", "Chile powder, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place raisins, 1/2 cup of the vinegar and 1 cup water in a small saucepan. Bring to a simmer, remove from heat and set aside. Toss croutons with 3 tablespoons duck fat in a skillet on medium heat until lightly browned. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a heavy shallow saucepan that has a cover. Add onion, bell pepper and a teaspoon of salt, cover and cook on low about 20 minutes, stirring from time to time, until vegetables are soft. Uncover and continue to cook, stirring occasionally, until vegetables start to caramelize, another 20 minutes or so. Add garlic, tomato paste and paprika and continue to cook 30 minutes more, until oil starts to pool in pan. Deglaze pan with 1 tablespoon vinegar and season with salt and pepper. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place duck confit in a large pot, add 12 cups water, the scallions, ginger and 1 tablespoon salt. Bring to a boil, reduce heat to low, cover and cook 1 hour. Remove duck, strain broth and reserve, discarding scallions and ginger. Finely chop duck meat and fat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring strained duck broth to a boil in the original pot, add rice, stir and cook 4 minutes. Drain well, discarding liquid. Spread rice on a sheet pan to cool 30 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer rice to a large mixing bowl. Drain raisins and fold in, along with duck and the onion and bell pepper mixture. Use rice immediately to continue recipe or refrigerate up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Grease a large, heavy casserole, at least 6 quarts, with the remaining duck fat. Add the rice, flattening the surface. Make a 2-inch hole, down to the surface of the pan, in the center of the rice. Place pan on medium-high heat for about 5 minutes, until rice starts to sizzle. Pour chicken stock into the opening, cover pan, cook just 5 minutes, then place in the oven for 30 minutes. Rice should be steamed, fluffy and crisped around the bottom and sides. Remove from oven and keep covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to 300 degrees. On a baking sheet or two, spread basted pork, basted chicken and sliced sausage. Bake meats about 10 minutes, until heated through. Remove from oven and cover sheet with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shortly before serving, uncover the rice. If you plan to serve the dish from its cooking vessel, scatter the croutons on top and arrange the pork, chicken and sausage over the rice. Otherwise transfer the rice to an ovenproof serving platter, add the croutons and arrange the pork, chicken and sausage on top. Place in the oven 10 minutes to reheat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and place the shrimp, clams, eggs, olives, lemons and scallions around the rice. Drizzle the pan sauce from the shrimp on top. Dust a little chile powder on the eggs and lemon wedges and serve."}]}