{"@context": "http://schema.org", "@type": "Recipe", "name": "Samgyetang (Ginseng Chicken Soup)", "description": "This is a traditional Korean soup consumed on the hottest days of summer. Fancier Korean restaurants will often add extra medicinal herbs and aromatics, but the home-cooked, mom-approved samgyetang that Koreans know best has six indispensable ingredients: chicken, garlic, scallions, glutinous rice, ginseng (fresh is preferred) and dried red dates (jujubes). The last three items may be hard to find, but every Korean grocery stocks them. Many shops even sell samgyetang-stuffing kits, which come with a small packet of rice, a couple of dried jujubes and a nub of dried ginseng, with some brands offering additional, often arcanely named aromatics (like milkvetch root or acanthopanax) to fortify the broth. The soup is normally prepared for one, with a single small chicken or Cornish hen served whole in boiling broth. We doubled the recipe to feed two, but it can be easily halved.", "author": {"@type": "Person", "name": "Dave Kim"}, "image": "https://static01.nyt.com/images/2017/07/19/dining/26HOT1/19HOT1-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "2 servings", "recipeCuisine": "korean", "recipeCategory": "for two, soups and stews", "keywords": "cornish game hens, ginseng root, glutinous rice, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 42}, "recipeIngredient": ["1/2 cup glutinous (sweet) rice", "2 ginseng roots (fresh or dried)", "4 small dried red dates (jujubes), pitted", "2 Cornish hens, 1 to 1 1/2 pounds each", "1 teaspoon coarse kosher salt, more to taste", "8 cloves garlic, peeled", "4 scallions, white parts sliced, green parts finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the rice, then cover it with water and soak for at least 2 hours, or overnight. At the same time, soak the ginseng (if using dried; there's no need to soak fresh) and the red dates, separately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When rice, dried ginseng and jujubes have finished soaking, drain and rinse them. Remove the giblets from the hens and rub about 1/2 teaspoon coarse salt all over each, inside the cavity and underneath the skin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a couple of spoonfuls of soaked rice into each cavity, then add the ginseng root, jujubes and garlic, and finish stuffing with more rice. Some cooks truss the birds, but the rice will expand during cooking and keep most of the stuffing inside the cavity."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the two hens and any remaining rice in a pot just big enough to hold them both. Add the white parts of the scallions. Fill the pot with 8 cups water or more, if needed, to cover most of the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover, bring to a boil, then lower heat and simmer gently for 1 hour, until the meat falls easily off the bone."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer each chicken to a large soup bowl and add the broth. Sprinkle chopped green scallions on top, and salt to taste at the table."}], "link": "https://cooking.nytimes.com/recipes/1018827-samgyetang-ginseng-chicken-soup"}