{"@context": "http://schema.org", "@type": "Recipe", "name": "White Bean Stew With Carrots, Fennel and Peas", "description": "A supply of dried white beans in the pantry means you can always make some sort of white bean stew without a trip to the store. White beans are welcome in any season, though this dish is perfect for spring, with its bright green peas. Use any kind of white bean: ordinary white northern or navy beans, larger cannellini or corona beans or, as pictured here, a small Italian heirloom variety called purgatory bean. This stew is versatile; it's equally delicious served hot or at room temperature, and it can be a first course, a main course or part of an antipasto. Finish with a drizzle of good, fruity extra virgin olive oil. The spicy herb topping makes a bright embellishment.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/03/22/dining/22Kitchen1/22Kitchen1-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, main course, carrot, egg, fennel, peas, white beans, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 334}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 273, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "12 grams", "proteinContent": "18 grams", "saturatedFatContent": "1 gram", "sodiumContent": "451 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups dried white beans (about 1 pound), picked over for debris and rinsed", "1 medium onion, peeled and halved, stuck with 2 cloves", "1 bay leaf", "1 small sprig rosemary", "Salt and pepper", "3 tablespoons extra-virgin olive oil, plus more for garnish", "1 large white onion, medium-diced (about 1 1/2 cups)", "3 celery stalks, medium-diced (about 1 cup)", "6 orange carrots, medium-diced (about 1 1/2 cups)", "1 or 2 fennel bulbs, medium-diced (about 1 1/2 cups)", "1 teaspoon crushed fennel seed", "1/2 teaspoon red pepper flakes", "1/2 teaspoon minced garlic", "1 bunch small yellow carrots, peeled, and left whole or halved lengthwise (optional)", "1 cup fresh peas (from 2 pounds in the pod, or use frozen)", "3 tablespoons roughly chopped parsley", "2 tablespoons roughly chopped mint", "1/2 teaspoon grated lemon zest", "1/2 serrano chile, seeds removed and finely chopped", "4 large eggs, boiled 9 minutes, chilled in ice water, peeled and halved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put beans in a heavy-bottomed pot along with clove-studded onion, bay leaf and rosemary. Add cold water to cover by about 2 inches, cover the pot, and place over high heat. Bring to a boil, then reduce heat to maintain a gentle simmer, with lid ajar. Check beans occasionally and add water as necessary to keep liquid 1 inch above beans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 40 minutes, add 2 teaspoons salt, carefully stirring with a wooden spoon to avoid smashing beans. Continue cooking until beans are tender, about 1 to 1 1/2 hours total. (Some beans cook more quickly, so begin checking after 1 hour.) Let beans cool in cooking liquid. You may cook beans to this point several hours or up to a day in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in a wide deep skillet or Dutch oven over medium-high heat. Add diced onions, celery, carrots and fennel, season generously with salt and pepper, then add fennel seed, red pepper flakes and garlic. Cook mixture until softened, about 10 minutes, stirring occasionally; lower heat if necessary to keep vegetables from browning. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, if using yellow carrots, simmer them in a saucepan of well-salted water. When carrots are cooked through but firm, about 5 minutes, remove from water with a slotted spoon and spread on a platter to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer peas in a saucepan of well-salted water for about 2 minutes. (If you cooked yellow carrots, you can use the same saucepan and water to simmer peas.) Drain and add peas to diced vegetable mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble dish, return the skillet with the vegetables to the stove over medium high heat. Add drained white beans, reserving the bean cooking liquid. Cook, stirring, until heated through, about 5 minutes, gradually adding enough cooking liquid to keep mixture a bit soupy, 1 cup or so. Taste and adjust for salt. Add cooked yellow carrots, and let them heat through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer stew to a deep platter or wide serving bowl. Mix together parsley, mint, lemon zest and chile and sprinkle over the top. Garnish with halved eggs, lightly salted, and drizzle everything with 2 tablespoons tasty extra-virgin olive oil."}], "link": "https://cooking.nytimes.com/recipes/1018666-white-bean-stew-with-carrots-fennel-and-peas"}