{"@context": "http://schema.org", "@type": "Recipe", "name": "Rainbow Sprinkle Cake", "description": "In the 1990s, when home bakers started putting rainbow sprinkles in their cakes, as well as on their cakes, the Funfetti craze was born.  Pillsbury introduced its Funfetti cake mix in 1989, and the idea was quickly adopted by home cooks for waffles, pancakes and cupcakes. Now, as seen on photo-friendly social media sites like Instagram and Pinterest, rainbow sprinkles are decorating everything from morning smoothie bowls to late-night martinis. But the Funfetti layer cake is still the most fun. You can buy premixed rainbow sprinkles, but professionals mix their own to get just the right color combination. (Coming up with a signature \"house blend\" is a good Saturday morning project for kids.) And though it may be tempting, do not use any sprinkles made with natural colorings in the cake -- they fade away, instead of leaving beautiful streaks of color.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2019/04/01/dining/jm-rainbow-sprinkle-cake/jm-rainbow-sprinkle-cake-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "confectioners' sugar, cream cheese, rainbow sprinkles, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1503}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 628, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "93 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "16 grams", "sodiumContent": "264 milligrams", "sugarContent": "78 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 cup/110 grams unsalted butter (1 stick), slightly softened, more for pans", "1 1/2 cups/190 grams all-purpose flour, more for pans", "1 teaspoon baking powder", "1/4 teaspoon baking soda", "1/4 teaspoon fine salt", "2/3 cup/158 milliliters whole milk", "1 1/2 teaspoons pure vanilla extract", "1 cup/200 grams sugar", "1 whole egg plus 2 egg whites", "1/3 cup rainbow sprinkles (not pastel, or naturally colored)", "8 ounces/225 grams cream cheese, slightly softened", "1/2 cup/110 grams unsalted butter (1 stick), slightly softened", "1/8 teaspoon fine salt, more to taste", "3 cups/300 grams confectioners’ sugar, sifted, more to taste", "1/2 teaspoon pure vanilla extract", "1 cup rainbow sprinkles (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Heat oven to 325 degrees and place a rack in the center. Butter and line the bottoms of two 8-inch round cake pans with parchment paper. Butter the parchment. Flour the pans, coating the bottom and sides, then tap out any excess flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together flour, baking powder, baking soda and salt. In a small bowl, stir together milk and vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixer fitted with the paddle attachment, beat butter and sugar at medium-high speed until light and fluffy, 2 to 3 minutes. Reduce speed to low and, with mixer running, slowly add egg and whites and beat until smooth and creamy, 1 to 2 minutes. Scrape down bowl. Add half the flour mixture, then the milk mixture, then the remaining flour mixture, beating to blend after each addition. Scrape down bowl and blend once more. Remove bowl and use a spatula or spoon to mix in sprinkles by hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide batter evenly between the pans and bake until the tops are just dry to the touch and a toothpick inserted into the center comes out clean, 20 to 25 minutes. Rotate the pans halfway through baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pans to a wire rack and let cool completely, at least 4 hours, before turning out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the frosting: In a mixer fitted with the paddle attachment, beat cream cheese, butter and salt together at medium speed until light and fluffy, 2 minutes. Reduce speed to low and, with mixer running, slowly add sugar and beat until smooth. Beat in vanilla just until incorporated. Taste frosting; you should be able to taste the cream cheese and a little bit of saltiness, as well as the sweetness. If desired, add more salt or sugar. Keep refrigerated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn cooled cakes out of pans. Using a bread knife, cut off any domed or uneven parts of each cake to make flat surfaces. Place one of the cakes on a platter or a cake stand, cut side up. Using an offset spatula, frost the top. Stack the other layer on top, cut side down. Place remaining frosting on top of the cake and, working from the center outward, frost the top and sides of the cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a baking sheet under the platter or cake stand, to catch any fallen sprinkles. Sprinkle the top with a layer of sprinkles. Toss remaining sprinkles at the sides of the cake, or press handfuls of sprinkles gently up the sides to make a thicker coating. Gather fallen sprinkles and repeat until coated to your liking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate cake 30 minutes or longer to set. Serve cool."}], "link": "https://cooking.nytimes.com/recipes/1018364-rainbow-sprinkle-cake"}