{"@context": "http://schema.org", "@type": "Recipe", "name": "Monkfish Roasted With Herbs and Olives", "description": "Firm-fleshed fish can be described as \"meaty\" — monkfish fits this category — and are often best roasted in a hot oven. Tart lemon slices, aromatic herbs and olives enhance and complement that meatiness, just as they would roast lamb or chicken. A smear of rustic zesty black olive paste is the perfect condiment to complete this simple dish. Use whatever kind of olives appeal to you. At most supermarket self-serve olive bars you can combine 3 or 4 types in one container. I prefer a mixture of green and black whole olives with pits to roast with the fish. For the olive paste, pitted black olives are ideal. But it’s fine to use just one type of olive, of course, and go pit-free throughout — it is a forgiving, malleable sort of recipe. To that end, if monkfish is unavailable, consider halibut, swordfish, grouper, sea bass or snapper.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/03/29/dining/29KITCHEN1/29KITCHEN1-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, seafood", "keywords": "gluten-free, lemon, monkfish, olives, rosemary, thyme, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 144}, "recipeIngredient": ["1 1/2 pounds monkfish fillet, preferably in 1 or 2 large pieces (or use halibut, swordfish, grouper, sea bass or snapper)", "Salt and pepper", "Thyme sprigs", "Rosemary sprigs", "A few fresh bay leaves (optional)", "Extra-virgin olive oil", "1 small lemon, thinly sliced", "12 whole black or green olives, pitted if desired", "1/4 cup pitted black olives, such as niçoise, Gaeta or kalamata", "1 small garlic clove, peeled and minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Tie the monkfish fillets with butcher’s twine at 2-inch intervals. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the bottom of an earthenware or other low-sided baking dish with thyme and rosemary sprigs. Tuck bay leaves here and there, if using. Lay the fish on top of the herbs and drizzle with 2 tablespoons olive oil. Scatter the lemon slices and whole olives over fish. Set aside for 30 minutes to marinate. Heat oven to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the olive paste: Put pitted black olives, garlic and 1/4 cup olive oil in a small food processor and pulse to a rough paste. (Alternatively, chop olives finely with a knife and stir together with garlic and oil.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast fish, uncovered, for 15 to 20 minutes, until lightly browned on top and firm to the touch. Check with a paring knife to be sure fish is cooked through. Let rest for 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Snip twine with scissors and remove from fish. Cut fish into 4 portions and spoon some of the roasted lemon slices and whole olives over the top. Dab each piece with a teaspoon of olive paste, or pass olive paste separately."}]}