{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Coconut Curry Chicken", "description": "The highly spiced coconut sauce here is so good, you’ll want to slather it on anything! And it’s a great and adaptable medium for cooking other proteins — not just chicken. Try cubes of lamb, fish fillets, or chunks of pork. Or, if you prefer boneless chicken breasts to thighs, use them here, pressure-cooking them for 2 minutes instead of 4.\n\nWhen serving, tell your guests to be aware of the cardamom pods so they don’t accidentally bite into one—or use the ground cardamom instead. And note that brands of garam masala vary in terms of their chile content, so some are hotter than others. If you’re unsure how hot your mix is, add it gradually to the pot, tasting as you go.\n\n<i>This is one of <a href=\"/68861692/7716592-melissa-clark-dinner-in-an-instant\">ten recipes</a> from Melissa Clark’s ‘Dinner in an Instant: 75 Modern Recipes for Your Pressure Cooker, Multicooker, and Instant Pot’ (Clarkson Potter, 2017).</i>\n\n<i>Melissa Clark’s <a href=\"http://www.penguinrandomhouse.com/books/562277/dinner-in-an-instant-by-melissa-clark/9781524762964/\">‘Dinner in an Instant’</a> is available everywhere books are sold. <a href=\"https://www.amazon.com/Dinner-Instant-Recipes-Pressure-Multicooker-ebook/dp/B06XK41BQV/?tag=NYTBks-20&ascsubtag=dinnerinstant\">Order your copy today.</a></i>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/09/25/dining/coconutcurrychicken/coconutcurrychicken-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, cookbook exclusive, curries", "keywords": "cardamom, chicken thighs, ghee, ginger, tomatoes, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1161}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 644, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "4 grams", "proteinContent": "59 grams", "saturatedFatContent": "23 grams", "sodiumContent": "1235 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 to 4 ripe tomatoes, halved through their equators", "3 tablespoons ghee, unsalted butter or safflower oil", "3 tablespoons virgin coconut oil", "2 cups finely chopped onions", "6 garlic cloves, grated on a Microplane or minced", "2 tablespoons grated peeled fresh ginger", "1 teaspoon cumin seeds", "1 3-inch cinnamon stick or 1/2 teaspoon ground cinnamon", "8 cardamom pods, lightly crushed with the flat side of a knife, or 1 teaspoon ground cardamom", "2 teaspoons ground coriander", "1 tablespoon kosher salt", "1 teaspoon ground turmeric", "1/4 teaspoon crushed red pepper flakes", "1/4 teaspoon black pepper", "2 1/2 pounds boneless, skinless chicken thighs, cut into 1-inch chunks", "1 to 2 teaspoons garam masala, to taste", "1/2 cup canned unsweetened coconut milk", "Cooked basmati rice, for serving (optional)", "Plain yogurt, for serving (optional)", "3 tablespoons finely chopped fresh cilantro, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a box grater over a bowl. Starting with their cut sides, grate the tomatoes through the large holes of the box grater so the tomato pulp falls into the bowl. Discard the skins. Measure out 2 cups of tomato purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the sauté function, heat the ghee and the coconut oil in the pressure cooker. Stir in the onions and cook, stirring often to encourage even browning, until they are caramelized, 12 to 18 minutes. Stir in the garlic, ginger and cumin seeds; cook until fragrant, about 2 minutes. Stir in the cinnamon and cardamom and cook for another minute. Then stir in the coriander, salt, turmeric, red pepper flakes, black pepper and finally the tomato purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken to the sauce, cover and cook on low pressure for 4 minutes. Let the pressure release naturally. If the sauce seems too thin, use a slotted spoon to transfer the chicken to a bowl and then simmer the sauce on the sauté setting until it has thickened to taste. (Note that the coconut milk will thin the sauce down further.) Stir in the garam masala and the coconut milk, and let the curry sit for 20 minutes for the flavors to meld. Serve with the rice and yogurt, if desired. Garnish with cilantro."}]}