{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Stew With Pears and Sweet Potatoes", "description": "It's nice knowing that pears, which we think of almost exclusively for desserts in this country, are often used in savory ways in Eastern European cuisines. In this stew, caraway seeds, allspice and fennel reinforce that heritage, while sweet potatoes add rich, round flavors. Although bone-in ribs seem a bit more flavorful, boneless are also fine here. You can even use a combination of both if that’s what turns out to be in the package you buy at the store. Because the pears can turn mushy overnight, this is the rare stew that’s actually best served the day that it’s made.", "author": {"@type": "Person", "name": "John Willoughby"}, "image": "https://static01.nyt.com/images/2018/01/03/dining/03COUNTRYRIBS/merlin_130347377_95e7cbf1-ec80-4671-8eb4-7d9a11c418d9-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "fennel, pear, pork rib, sweet potato, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 567}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 876, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "12 grams", "proteinContent": "63 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1428 milligrams", "sugarContent": "26 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 pounds boneless or 3 pounds bone-in country-style pork ribs", "2 teaspoons kosher salt", "2 teaspoons ground black pepper", "2 tablespoons vegetable oil, plus more as needed", "2 onions, halved and thinly sliced", "2 bulbs fennel, fronds removed, bulb cored and thinly sliced", "1/2 cup dry white wine", "2 large or 3 small sweet potatoes, peeled and cut into 1-inch cubes", "2 tablespoons caraway seeds", "1 teaspoon ground allspice", "2 bay leaves", "2 to 3 cups chicken stock", "3 pears of your choice, peeled, cored and cut into 1-inch cubes", "2 tablespoons lemon juice", "Grainy mustard for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using bone-in ribs, cut away the bones and set aside. Cut pork into 1-inch cubes, sprinkle the ribs evenly with the salt and allow to stand, refrigerated, for at least 1 hour and no more than 12 hours. Move oven rack to middle position and heat oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dry pork cubes well and sprinkle generously with pepper. Heat oil over medium-high heat in Dutch oven or other large, heavy pot until shimmering. Working in batches to avoid crowding, brown the pork well (including bones if you have them), transferring to a platter as browned, adding more oil in between batches if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onions and fennel to the pot and cook, stirring frequently, until onions are transparent, 7 to 10 minutes. Add the wine and bring to a simmer, stirring to dissolve any fond on the bottom of the pot. Add the pork (and bones if you have them), sweet potatoes, caraway seeds, allspice, bay leaves and enough chicken stock to just cover the meat. Bring to a simmer, cover and place in oven for 1 hour. Add the pears to the pot, then continue to cook until meat is very tender, about 30 to 45 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove bones from pot, stir in lemon juice, then serve stew in bowls, passing mustard separately so people can put a dollop on their stew if desired."}]}