{"@context": "http://schema.org", "@type": "Recipe", "name": "Classic French Toast", "description": "Here's a recipe for the kind of French toast people line up for outside restaurants on Sunday morning. It's simple: no new ingredients, tools or technology needed. You don’t even need stale bread. What you do need is thick-cut white bread, dunked into an egg-milk mixture with extra richness from egg yolks and heavy cream. That gives the French toast a buttery taste and firm but fluffy texture. (Oversoaking is the enemy here; the mixture should fill the bread, not cause it to break.) For an appetizing, lacy brown crust, sprinkle on sugar toward the end of cooking: It will caramelize and turn glossy. Just make sure to keep the heat low after you add the sugar. Otherwise, it could burn quickly over high heat.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/05/03/dining/03FRENCHTOAST2/03FRENCHTOAST2-mediumThreeByTwo440.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, pancakes", "keywords": "eggs, pullman bread, whole milk, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 676}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 390, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "15 grams", "saturatedFatContent": "6 grams", "sodiumContent": "463 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 whole eggs", "2 egg yolks", "2 cups whole milk, or 1 3/4 cups milk, plus 2 to 4 tablespoons cream", "1 teaspoon vanilla extract (optional)", "Pinch of salt", "Unsalted butter, for cooking", "8 slices white bread, such as Pullman, brioche or challah, sliced 1/2- to 3/4-inch thick", "Cinnamon sugar or granulated sugar (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 200 degrees, and place a wire rack on a sheet pan inside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a shallow bowl, whisk the eggs, additional yolks, milk, vanilla (if using) and salt until foamy and smooth. Set aside. Place a small lump of butter (enough to coat the bottom of the skillet when melted) in a large, heavy nonstick skillet over low heat. It will melt very slowly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When butter is just melted and bubbling, raise heat and bring to a sizzle. Place 2 slices of bread in the bowl with the egg mixture. Turn them a few times in the mixture until evenly saturated, about 5 seconds on each side. Do not soak."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lift a slice out of the egg mixture, gently shake off any excess, and place in the pan. Repeat until the skillet is full, and let the slices cook at a sizzle for about 2 minutes, until just turning golden brown on the bottom. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another small lump of butter to the pan and flip the slices over, swirling the pan so that the fresh butter coats the bottom. (This will allow the second side to brown.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue cooking over low heat until the second side is golden brown. Dust with cinnamon sugar, flip again, and dust the other side. Test for doneness by pressing the center: The dent should slowly spring back. If it remains, the interior is not yet cooked. Continue cooking at low heat, flipping occasionally, until done. Serve immediately, or transfer to the oven to keep warm while cooking remaining bread. Serve as soon as possible. Top with maple syrup, berries, jam, sliced bananas, orange supremes — whatever you'd like."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "French Toast", "description": "This custardy French toast leans heavily on cream and whole milk, with a generous dusting of cinnamon sugar.", "thumbnailUrl": "https://static01.nyt.com/images/2017/05/03/dining/03FRENCHTOAST2/03FRENCHTOAST2-mediumThreeByTwo440.jpg", "uploadDate": "2017-05-02T20:11:03.000Z", "duration": "PT53S"}, "link": "https://cooking.nytimes.com/recipes/1018748-classic-french-toast"}