{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Lamb Ribs With Spicy Yogurt Sauce", "description": "These crisp-edged lamb ribs, from the chef Ignacio Mattos, are a fine match for a spicy Corsican red wine. If you are unable to special-order lamb ribs from your butcher, you can trim your own. Buy a rack of lamb, neither Frenched nor baby, and remove the meaty eye section, saving it for another use. You will be left with the ribs. This recipe takes time, but can be made up to two days in advance. Give the ribs their final sear just before serving.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2017/01/25/dining/25PairingSub/25PairingSub-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, main course, Dijon mustard, lamb ribs, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 15}, "recipeIngredient": ["3 tablespoons sea salt", "2 cloves garlic, slivered", "3 pounds lamb ribs, in one piece (about 8 ribs), trimmed", "4 tablespoons Dijon mustard", "1 tablespoon crushed black peppercorns", "1 tablespoon crushed dry green peppercorns", "1/2 cup Greek yogurt", "1 tablespoon Dijon mustard", "1 jalapeño chile, seeded and minced", "1 teaspoon cumin seeds, toasted and ground", "Sea salt, to taste", "1 lemon, in wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Brine the ribs: Dissolve salt in 5 cups cool water. Pour into a roasting pan or baking dish that will hold the lamb and brine without much room to spare. Add the garlic. Remove thin membrane from the bone side of the lamb. Place lamb in brine. It should be just covered with the liquid; if not, add a little more water. Cover with plastic wrap and refrigerate 24 hours, turning once."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Marinate the ribs: Rinse lamb and pat dry. Discard brine. Smear mustard on both sides of lamb, and sprinkle with black and green peppercorns. Place lamb on a rack in the roasting pan and set aside at room temperature for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Mix yogurt with mustard, chile, cumin and salt. Cover and refrigerate until ready to use. (It will keep several days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 250 degrees. Bake lamb for 2 1/2 hours. Remove from oven and allow to cool about 30 minutes. The final sear for the lamb can be done immediately, or the lamb can be wrapped in foil, refrigerated and seared before serving, up to 2 days later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish, slice between the bones to separate each rib. Heat a cast-iron skillet on medium-high until very hot. Reduce heat to medium. Sear ribs on all sides until browned. Serve with lemon wedges and yogurt sauce on the side."}], "link": "https://cooking.nytimes.com/recipes/1018547-seared-lamb-ribs-with-spicy-yogurt-sauce"}