{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Brew Coffee, Pro Style", "description": "Camila Ramos, a founder of the Miami coffee shop All Day, has worked out a formulation that will appeal to coffee obsessives who are ready to take their cold brew to the next level.\n\nAll Day uses paper filter bags from the brand <a href=\"https://toddycafe.com/shop-product/211/Toddy-Paper-Filter-Bags\">Toddy</a>. These filters can rip, so you should first line the steeping container with a large reusable <a href=\"https://www.amazon.com/Pinfox-Reusable-Strainer-Filter-Coffee/dp/B071XN8Y3X\">food-safe nylon mesh bag</a>. The steeping container must be large enough so that the coffee and water take up no more than two-thirds of the volume.\n\nLook for a local roaster, as they roast beans for the water in your area, and try to buy beans that have been roasted 21 to 28 days earlier. (You can always buy a younger coffee and let it rest.) Fresher coffees tend to be more volatile in cold brew. This recipe calls for gently agitating the coffee slurry for a full 5 minutes, which will feel like an eternity. Don’t cut it short. This step is crucial to the extraction process, and will give your cold brew coffee a more dynamic flavor.", "author": {"@type": "Person", "name": "Oliver Strand"}, "image": "https://static01.nyt.com/images/2017/06/07/dining/07COLDBREW1-copy/07COLDBREW1-copy-articleLarge-v4.jpg", "totalTime": "PT6H", "recipeYield": "About 1 1/2 quarts/1 1/2 liters coffee concentrate", "recipeCuisine": "", "recipeCategory": "project", "keywords": "coffee", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 114}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 0, "unsaturatedFatContent": "0 grams", "carbohydrateContent": null, "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": null, "proteinContent": "0 grams", "saturatedFatContent": "0 grams", "sodiumContent": "4 milligrams", "sugarContent": null, "transFatContent": null}, "recipeIngredient": ["1 pound/500 grams coffee", "2 quarts/2 liters water, filtered"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grind coffee at a medium setting: slightly finer than what you would use for a French press and slightly coarser than what you would use for a pour-over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 4-quart/4-liter container with the nylon mesh bag, draping the edges over the side of the pot. Place the paper filter bag in the mesh one, folding over the top of the paper filter to form a cuff to give it some structure."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add ground coffee to the paper filter bag. Pour 1 quart/1 liter of water onto the grounds, and gently stir the slurry with a wide spoon for 5 minutes. It’s important to stir for the full period of time. Add remaining water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Twist close the top of the paper filter bag. (You can tie it with a piece of string.) Set a timer for 5 hours 30 minutes. During this time, do not move or otherwise agitate the container."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the brewing time elapses, gently lift the mesh bag out of container, and place it into a large metal strainer set on top of the steeping pot. Drain for 10 to 15 minutes. Discard the filter bag with the grounds, and decant the cold-brewed coffee concentrate into a clean 1 1/2-quart/1 1/2-liter carafe or jar with an airtight lid. Pour gently so that any remaining sediment is left behind in the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make a cold brew drink, pour three parts concentrate over ice and dilute with two parts water. For a richer flavor, dilute with milk. For a hot drink, combine coffee with hot water or milk. The concentrate will last 2 weeks refrigerated."}], "link": "https://cooking.nytimes.com/recipes/1018783-cold-brew-coffee-pro-style"}