{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Roasted Cauliflower With Black-Garlic Crumble and Parsley-Anchovy Butter", "description": "The chef Sean Brock came up with this first course after making Craig Claiborne’s <a href=\"https://cooking.nytimes.com/recipes/1012852-classic-bagna-cauda\">Bagna Cauda</a>. Instead of bathing the garlic and anchovy in the oil, Mr. Brock has you bathe a whole head of cauliflower in it. You use a ring mold to hold up the cauliflower in a sauté pan, then brown it by spooning over bubbling oil and butter — a process that’s fun and a little hairy — and finish it in the oven. In place of garlic, you use fermented black garlic (which is soft and woodsy in flavor) and milk powder to make a “crumble.” You slice the cauliflower into large slabs, like cross-sections of a tree, and top them with an anchovy butter and the crumble.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2009/11/08/magazine/whole-cauliflower/whole-cauliflower-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "", "keywords": "anchovy fillets, black garlic, cauliflower, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 781, "unsaturatedFatContent": "40 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "84 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "40 grams", "sodiumContent": "472 milligrams", "sugarContent": "2 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["8 tablespoons unsalted butter", "1/4 cup nonfat powdered milk", "10 black garlic cloves, peeled (see note)", "Half the reserved brown butter (3-4 tablespoons)", "4 tablespoons unsalted butter", "2 anchovy fillets", "Salt", "Grated zest from 1/2 lemon", "1 tablespoon lemon juice", "1/3 cup chopped parsley", "1 small head cauliflower", "1/2 cup olive oil", "4 tablespoons unsalted butter", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the black-garlic crumble: place the butter, powdered milk and black garlic cloves in a medium saucepan over low heat and cook until the powdered milk is golden brown and nutty, 20 minutes. Strain the butter from the solids and reserve. Dry the solids on paper towels. Place the solids and garlic cloves in a food processor and pulse to combine until the garlic is evenly distributed. Dry on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the parsley-anchovy butter: Heat half the reserved brown butter with the fresh butter and mash in the anchovies. Season with salt, zest and juice. Fold in the parsley. Refrigerate until moldable. Using plastic wrap, form the butter into a log. Chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Remove the leaves from the cauliflower, leaving 1 inch of stem intact. Place a ring mold or cookie cutter around the stem to keep the cauliflower upright. Place the cauliflower, oil and butter in a large sauté pan over medium heat. Season the cauliflower with salt. With a large spoon, continually pour the hot oil-butter mixture over the cauliflower, lowering the heat to medium-low if the fat begins to smoke. After about 20 minutes, once the outside is golden brown, place the pan in the oven and bake until just tender in the middle, 15 to 20 minutes. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: cut the warm cauliflower into 4 sections. Cut the butter log into 1/4-inch disks and place three slices on each section of cauliflower. Sprinkle with black-garlic crumble."}], "link": "https://cooking.nytimes.com/recipes/1018609-whole-roasted-cauliflower-with-black-garlic-crumble-and-parsley-anchovy-butter"}