{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey Meatballs in Tomato Sauce", "description": "Tender meatballs filled with onions and Parmesan, bathed in plenty of tomato sauce, are classics in every way except for one: They call for turkey instead of the usual beef (or beef-veal-pork combination). Serve them over spaghetti or polenta, or stuff them into a hero roll for a sandwich. Try to use ground dark meat turkey here if you can, it has a deeper, richer flavor than ground white meat.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/03/23/dining/23sauce/14COOKING-TURKEY-MEATBALL-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "28 meatballs, 4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, meatballs", "keywords": "chives, marinara sauce, parmesan, turkey, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 852}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 382, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "3 grams", "proteinContent": "30 grams", "saturatedFatContent": "5 grams", "sodiumContent": "827 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup grated Parmesan cheese, more for serving, if desired", "1/2 cup panko or other plain dried bread crumbs", "1/4 cup minced onion", "1/4 cup chopped chives or basil", "2 garlic cloves, grated on a microplane or minced", "1 1/2 teaspoons kosher salt", "1/2 teaspoon black pepper", "1/2 teaspoon dried oregano", "Pinch red pepper flakes (optional)", "1 1/2 pounds ground turkey, very cold", "1 large egg, beaten", "3 tablespoons extra-virgin olive oil, more as needed", "3 cups marinara sauce, more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine cheese, bread crumbs, onion, chives, garlic, salt, pepper, oregano and red pepper flakes, if using, and mix well. Add turkey and egg and blend with your hands until well mixed. If you’ve got time, cover mixture and chill for an hour or up to 24 hours. These are easiest to form into balls while very cold. Form into 28 meatballs, each about 1 1/4-inches in diameter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the oil in a large sauté pan. When hot, add enough of the meatballs to fit in one layer without crowding, and brown on all sides, 5 to 8 minutes. Transfer to a plate, add another tablespoon of oil to pan and brown another layer of meatballs, transferring them to the plate as they brown. Repeat until all meatballs are browned, adding more oil to the pan as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When meatballs are all browned, add marinara sauce to pan and bring to a simmer, scraping up the browned bits on the pan bottom. Return meatballs and their juices to pan, shake pan to cover the meatballs with sauce, and lower heat. Partly cover pan and simmer until the meatballs are cooked through, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot, drizzled with more olive oil and sprinkled with more cheese, if you like."}], "link": "https://cooking.nytimes.com/recipes/1018723-turkey-meatballs-in-tomato-sauce"}