{"@context": "http://schema.org", "@type": "Recipe", "name": "Pommes Anna", "description": "This classic 19th-century French recipe brings out the best of the humble potato. In it, thin potato slices are layered into a skillet, basted in butter and baked. As they cook, the slices are compressed (under another skillet) so they hold together when unmolded. The potatoes on the exterior become brown and crisp, while the ones inside absorb the butter and turn satiny soft. The garlic isn't traditional, but it adds a pungent sweetness. Serve it as a classic and elegant side with roasted meat, or top it with fried eggs for an unusual vegetarian main course. You'll find <a href=\"https://cooking.nytimes.com/recipes/1018510-clarified-butter\">a recipe for clarified butter here</a>. This recipe is part of <a href=\"https://cooking.nytimes.com/new-essentials-french-cooking\">The New Essentials of French Cooking</a>, a guide to definitive dishes every modern cook should master. <a href=\"https://store.nytimes.com/products/new-essentials-of-french-cooking\">Buy the book.</a>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/01/15/dining/DINING-POMMES-ANNA2/DINING-POMMES-ANNA2-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "brunch, dinner, lunch, weekday, vegetables", "keywords": "fall, spring, winter, garlic, potato, main course, side dish, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 226}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 554, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "75 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "12 grams", "proteinContent": "8 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1162 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["5 1/2 to 7 pounds russet or all-purpose white potatoes, as needed", "3/4 cup clarified butter, melted", "Fine sea salt, as needed", "Freshly ground black pepper, as needed", "2 to 4 garlic cloves, sliced paper-thin on a mandoline (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Place a rack in the middle and set a rimmed baking sheet on top of it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim potatoes into cylinders, peeling any skin left after trimming. Using a mandoline or sharp knife, slice into 1/8-inch slices and blot dry with paper towels. You should have about 8 1/2 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy 10-inch cast-iron skillet, heat 3 tablespoons clarified butter over medium heat. When hot, carefully place 1 potato slice in the middle, then quickly place more slices around it, overlapping them clockwise to make a ring. Place a second ring to surround the first, going counterclockwise. Continue to the edge of the pan, alternating the direction in which the potato rings overlap. Sprinkle with a generous 1/4 teaspoon salt and pepper to taste, then drizzle with another 2 tablespoons butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Create second layer of potatoes, just as you did the first. Dot a third of the garlic slices, if using, on top of this layer of potatoes. Season with salt and pepper; drizzle with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue layering potatoes, garlic, butter and salt until everything is used, making a dome of potatoes in the middle (they will sink as they cook). Occasionally shake skillet gently to ensure potatoes aren’t sticking. When finished, there should be enough butter that it can be seen bubbling up the sides of the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter the bottom of a 9-inch pan and one side of a piece of foil. Push the pan down firmly on top of the potatoes to press them. Remove pan, then cover potatoes with the foil, buttered side down. Cover the foil with a lid. Set skillet on the baking sheet in oven and bake for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove skillet from oven, uncover and remove foil, and again press potatoes down firmly with the 9-inch pan. (Rebutter bottom of pan, if necessary, before you press down.) Return to oven and bake uncovered, until potatoes are tender and the sides are dark brown when lifted away from skillet, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once more, remove skillet from oven and press potatoes down firmly with pan. Tip the skillet away from you to drain off the excess butter into a bowl (this can be reused for cooking), using the lid to keep the potatoes in place. Run a thin spatula around edge and bottom of skillet to loosen any slices stuck to the pan. Carefully turn out the potatoes onto a serving platter."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Recipe: Pommes Anna", "description": "A crisp, savory cake of thinly sliced potatoes arranged in circular layers and coated with butter.", "thumbnailUrl": "https://static01.nyt.com/images/2017/01/15/dining/DINING-POMMES-ANNA2/DINING-POMMES-ANNA2-mediumThreeByTwo440.jpg", "uploadDate": "2017-01-19T15:12:03.000Z", "duration": "PT3M31S"}, "link": "https://cooking.nytimes.com/recipes/1018512-pommes-anna"}