{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Cooker Chicken Biriyani with Saffron Cream", "description": "Fairuza Akhtar, a restaurant owner in Jackson Heights, Queens, who was born in Pakistan, has developed a quick method for making fragrant, creamy biriyani with whole spices and bites of chicken, at home in her rice cooker. \"My mother would fall down in a faint,\" she said, referring to the traditionally reverent attitude toward biriyanis in Northern India and Pakistan. \"But rice cookers are the way of the modern world.\"", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2008/10/01/dining/biriyani/biriyani-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "indian, pakistani", "recipeCategory": "dinner, grains and rice, poultry", "keywords": "basmati rice, chicken thigh, saffron, yogurt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 184}, "recipeIngredient": ["1 pound boneless, skinless chicken thighs", "1 cup plain yogurt, preferably whole milk", "1 1/2 teaspoons coriander powder", "1 teaspoon turmeric powder", "1 teaspoon mild chile powder", "1/2 teaspoon cumin powder", "1 onion cut into chunks", "1 2-inch chunk fresh ginger, peeled", "3 garlic cloves, peeled", "1 fresh green chile pepper such as jalapeño or Serrano, stemmed", "3 tablespoons canola oil or ghee (clarified butter)", "1 1/2 cups basmati rice, rinsed", "6 cloves", "6 cardamom pods", "1 cinnamon stick", "3 cups chicken broth (use low-sodium if canned) mixed with 1/4 teaspoon garam masala", "1 teaspoon salt", "Pinch saffron threads mixed with 2 tablespoons heavy cream", "3 tablespoons chopped cilantro, more for garnish", "3 tablespoons chopped mint", "1 lime", "Oil for frying", "1 onion, thinly sliced", "Big handful cashews", "Big handful raisins"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut chicken into bite-size chunks: 6 to 8 pieces from each thigh. In a bowl, mix yogurt and powdered spices. Add chicken, mix well to coat, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, purée onion, ginger, garlic and chili pepper together. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a rice cooker, heat oil in cooking bowl on ''cook.'' When hot, add onion paste and cook, uncovered, until some liquid has evaporated and paste begins to brown, about 15 minutes. Stir occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add rice and whole spices and stir well. Smooth top and arrange marinated chicken pieces over surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently pour in broth and salt. Cover and let cook until rice is tender and chicken is cooked through, about 25 minutes depending on cooker."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When done (or when cooker switches to \"warm\" function), add saffron cream and mix, making sure to scrape and scoop up bottom layer of rice. Sprinkle chopped cilantro and mint on top and re-cover. Let steam 5 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If making garnishes, heat 1 inch oil in a pot until rippling. Add onion and cook, separating rings, until golden brown. Lift out and drain. Add cashews and raisins to same oil and cook until cashews are golden brown. Lift out and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, squeeze lime over biriyani and mix very well, fluffing lightly. Scoop onto serving platter and garnish with chopped cilantro and fried onions, cashews and raisins."}]}