{"@context": "http://schema.org", "@type": "Recipe", "name": "Charred Cauliflower Stew", "description": "This vegetarian stew uses two different techniques — grilling (or broiling) and pickling —  to coax the maximum amount of flavor from cauliflower. Charring the cauliflower before adding it to your stew delivers smoky depth; quick-pickling some grated cauliflower adds bright spikes of flavor that contrast nicely with everything else in the bowl.", "author": {"@type": "Person", "name": "Amanda Cohen"}, "image": "https://static01.nyt.com/images/2016/03/23/dining/23CAULIFLOWER3/23CAULIFLOWER3-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, main course, cauliflower, celery, cheddar cheese, parsnip, potato, watercress, gluten-free, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 356}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 307, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "11 grams", "proteinContent": "12 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1781 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 heads cauliflower (about 2 pounds each)", "1/4 cup extra-virgin olive oil, plus more for the grill", "1/4 cup lemon juice", "Salt", "1 cup diced Spanish onions (about 1 small onion)", "1/4 cup minced garlic (about 8 large cloves)", "1 1/2 tablespoons ground coriander ", "1 tablespoon ground mustard ", "Pinch of cayenne", "1/2 cup peeled and diced parsnip (about 1 small parsnip)", "1/2 cup diced celery (about 2 small stalks)", "2 cups peeled and diced Yukon Gold potatoes (about 1 pound potatoes)", "8 cups vegetable stock or water", "Freshly ground black pepper", "1 cup watercress", "1/2 cup grated Cheddar cheese", "1/4 cup minced tarragon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the grill to high and lightly oil the grates, if you'd like, to make cleanup easier. (Or, if you don’t have a grill, heat the broiler to high and lightly oil a baking sheet.) Take one of the heads of cauliflower, pull off the leaves, and slice it into big slabs, stalk and all. Throw the slices on the grill and cook on each side until you get nice char marks, about 3 minutes per side, or broil until they turn dark brown, about 10 minutes (no need to flip them). Let slices cool, then roughly chop them. (You aren’t fully cooking the slices; they’ll cook in the stew. What you want to do is get that char on there.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the other head of cauliflower and grate 1/2 cup cauliflower florets into a small bowl. Break off a big chunk (about a quarter of the head) and set it aside, then roughly chop the rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pickled cauliflower: Mix the grated cauliflower with lemon juice and 1/4 teaspoon salt and let sit until stew is ready to be served."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 1/4 cup oil in a large pot, and set it over medium heat. Once it’s hot, add onions, garlic, coriander, mustard and cayenne. Cook, stirring, until onions are almost translucent but haven’t browned, 3 to 4 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in parsnips and celery and cook, stirring occasionally, until the parsnips soften, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the raw chopped cauliflower, the big chunk of cauliflower and the potatoes. Stir a few times, then pour in the stock. Increase heat to medium-high, bring to a simmer and let cook until the potatoes are tender, 15 to 18 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and transfer that big chunk of now-cooked cauliflower into a blender along with 2 cups of the soup. Make sure you get some potatoes, parsnips and celery in there. Blend, but do it carefully. Hot soup has a tendency to explode. Start it on low and slowly increase the speed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the blended mixture back into your big pot of stew, and season to taste with salt and pepper. Stir in the grilled or broiled cauliflower. When you’re ready to serve, bring it up to a boil again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide watercress between 6 large bowls. Ladle the stew into the bowls and top with cheese, tarragon and pickled cauliflower."}], "link": "https://cooking.nytimes.com/recipes/1018021-charred-cauliflower-stew"}