{"@context": "http://schema.org", "@type": "Recipe", "name": "Korean Meatballs and Noodles", "description": "This kalbi meatball recipe, adapted from the cookbook “Koreatown,” is easy and quick enough to consider for midweek dinner. It offers the sweetly peppered, slightly funky flavors typical of many Korean dishes, and gives new personality to everyday spaghetti and meatballs. My favorite utensil for making ground meat mixtures, by the way, is an old-fashioned potato masher. The book suggests wrapping the meatballs in lettuce, but I tossed them with noodles in a sauce that exploited the brown bits left in the cooking of the meatballs.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/03/23/dining/23PAIRING/23PAIRING-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "korean", "recipeCategory": "meatballs", "keywords": "gochujang, ground beef, pear, udon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 657}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 466, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "5 grams", "proteinContent": "36 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1093 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound ground beef, preferably short rib and chuck", "1 1/2 tablespoons honey", "1 teaspoon ground black pepper", "1 tablespoon Asian sesame oil", "1 tablespoon rice vinegar", "1/3 cup chopped peeled Bosc or Asian pear", "1/4 cup chopped onion", "1/2 tablespoon grated ginger", "3 tablespoons soy sauce", "2 cloves garlic, minced", "1 large egg, beaten", "1/3 cup dry bread crumbs, preferably whole wheat", "6 ounces udon noodles or linguine", "2 tablespoons gochujang, or ketchup seasoned with 1 teaspoon hot sauce", "3 scallions, trimmed and slant-cut"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Line a rimmed baking sheet with foil. Place beef in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine honey, black pepper, sesame oil, vinegar, pear, onion, ginger, soy sauce and half the garlic in a food processor or blender and whirl until well blended. Mix with beef. Add egg and bread crumbs and mix again. Form into 1 1/2-inch balls and arrange on the baking sheet with a bit of space between them. Place in the oven and bake 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While meatballs bake, bring a large pot of water to a boil. Add noodles and boil 5 minutes for udon, about 8 minutes for linguine. Reserve 2/3 cup of the pasta water, then drain pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When meatballs are done, transfer them to a bowl and scrape pan juices into a sauté pan. Heat on medium, add remaining garlic and cook briefly until it starts to color. Whisk in gochujang, then pasta water. Simmer about 3 minutes, until sauce reduces and starts to thicken. Reduce heat to low, add noodles and toss in sauce. Add meatballs and mix gently. Transfer to a warm serving dish or individual bowls, scatter with scallions and serve."}]}