{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Seared Steak With Red Wine Sauce", "description": "You can use any cut of steak, either bone-in or boneless, to make this classic French bistro dish. Steaks cut from the tenderloin, such as filet mignon, are the most tender pieces of beef, though they lack the assertively beefy chew of sirloins and rib steaks. Adding brandy to the pan sauce not only contributes flavor; its high alcohol content and acidity help extract flavor from the pan drippings. However, if setting it on fire makes you nervous, skip that step and let the brandy simmer down for an extra few minutes to cook off most of the alcohol. Make sure to open a good bottle of red wine to use in the sauce here, preferably one that you’re happy to finish off with dinner. This recipe is part of <a href=\"https://cooking.nytimes.com/new-essentials-french-cooking\">The New Essentials of French Cooking</a>, a guide to definitive dishes every modern cook should master. <a href=\"https://store.nytimes.com/products/new-essentials-of-french-cooking\">Buy the book.</a>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/01/13/dining/13STEAK-1/13STEAK-1-mediumThreeByTwo440.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner, steaks and chops", "keywords": "brandy, broth, chives, cognac, red wine, shallots, steak, high protein, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 356}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 517, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "1 gram", "proteinContent": "35 grams", "saturatedFatContent": "16 grams", "sodiumContent": "594 milligrams", "sugarContent": "3 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["Kosher salt, as needed", "Freshly ground black pepper, as needed", "1 1/2 pounds boneless steak, or 1 3/4 pounds bone-in steak (1 1/2 inches thick)", "2 shallots", "2 1/2 tablespoons unsalted butter", "1/2 teaspoon neutral oil, such as grapeseed", "2 tablespoons good brandy, preferably Cognac", "1/3 cup dry red wine", "1/3 cup beef or chicken stock, preferably homemade", "1 tablespoon chopped chives", "Watercress, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously sprinkle salt and pepper all over steaks, then let steaks rest uncovered for 15 minutes at room temperature. Meanwhile, mince the shallots."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1/2 tablespoon butter and the oil in a large skillet over medium-high heat until almost smoking. Add steaks and cook until done to taste, about 3 to 4 minutes per side for rare and a little longer for medium-rare or medium. (Bone-in steaks take a few minutes longer to cook through than boneless.) If the pan begins to smoke or burn, lower the heat. Transfer steaks to a plate to rest while you prepare the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add shallots to the skillet and cook over medium heat until lightly browned, about 1 minute. Add brandy to the skillet and use a long-handled match or igniter to set the brandy on fire. (Stand back when you do this.) Let flames die out, then add red wine and cook until reduced and syrupy, 2 to 4 minutes. Add stock and boil until reduced and thickened, 3 to 4 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from heat and whisk in remaining 2 tablespoons butter and the chives. Serve steaks and sauce immediately with watercress."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Recipe: Pan-Seared Steak With Red Wine Sauce", "description": "A beef steak seared in a hot pan and served with a sauce made from the wine or other liquid and the drippings in the pan.", "thumbnailUrl": "https://static01.nyt.com/images/2017/01/13/dining/13STEAK-1/13STEAK-1-mediumThreeByTwo440.jpg", "uploadDate": "2017-01-17T18:57:45.000Z", "duration": "PT4M14S"}}