{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Sweet Potatoes With Hot Honey Browned Butter", "description": "Doubling down on sweet potatoes’ sweetness by adding honey is like adding fuel to the fire, but the nuttiness from the browned butter, heat from the crushed red pepper flakes and bright acidity from the vinegar all work together to bring it back from the brink. This hot honey browned butter is also good on roasted winter squash, over plain oatmeal and — if we are being honest —probably over ice cream. But that’s a different conversation. (This recipe is adapted from \"Dining In: Highly Cookable Recipes\" by Alison Roman.)", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2017/10/12/dining/12COOKING-ROASTSWEETPOTATOES1/12COOKING-ROASTSWEETPOTATOES1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "fall, winter, side dish, sweet potatoes", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 100}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 292, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "4 grams", "proteinContent": "2 grams", "saturatedFatContent": "11 grams", "sodiumContent": "480 milligrams", "sugarContent": "14 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 small to medium sweet potatoes (about 1½ pounds), scrubbed", "6 tablespoons unsalted butter (3/4 stick)", "2 tablespoons honey", "1 tablespoon white wine vinegar or apple cider vinegar", "1 teaspoon crushed red pepper flakes", "Kosher salt and freshly ground pepper", "Flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Poke sweet potatoes all over with a fork and place them all directly on the oven rack. Roast until they are very tender, with bits of sweet potato sugar caramelizing in the spots they’ve been poked, 50 to 60 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt the butter in a small pot over medium heat, swirling the pot just until the butter starts to bubble and brown, about 5 minutes. Add the honey, vinegar and red pepper flakes, swirling to combine (it will bubble up quite a bit), and season with salt and pepper. Remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the sweet potatoes are out of the oven, slit them down the middle. Warm the browned butter mixture, and pour over the sweet potatoes. (Alternatively, scoop the flesh out of the skins and transfer to a bowl or serving dish, then drizzle with the browned butter sauce.) Generously sprinkle with flaky sea salt."}]}