{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramelized Citrus", "description": "This is a modernized version of a dessert that was popular in Britain during the 1970s, a simple, stylish confection that was a standby of posh dinner parties: caramelized oranges. It was then and remains the sort of dish that is not particularly difficult to make, but still signals a home cook’s understanding of elegance. My recipe nods to, but is not of, that era. It calls for saffron, which infuses the sauce with its sweet-savory, haylike aroma, and for yogurt, which is a delicious partner to the fruit. On which subject, an important final note: Be careful to remove all the white pith beneath the skin of the citrus, as it is exceedingly bitter.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/03/20/magazine/20eat1/20mag-20eat-t_CA1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4-8", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "caramel, citrus, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 248}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 53, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "2 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "0 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["4 assorted sweet citrus fruits, like blood or navel oranges or grapefruit", "1 cup or 285 grams Greek-style yogurt", "1 1/2 cups or 300 grams light brown sugar", "1 pinch saffron threads"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a small, sharp knife, cut off the tops and bottoms of the oranges and grapefruit, then slice the peel off them vertically, taking care to remove all the white pith below the skin of the fruit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the yogurt onto a platter or into a large bowl. Turn each fruit on its side, then slice it into rounds that are between 1/4-inch and 1/8-inch thick. Place the sliced fruit on top of the yogurt in an attractive pattern, then place the platter or bowl into the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the caramel. Put the sugar in a large sauté pan set over medium heat, then add to it 1/2 cup or 125 milliliters of water, and swirl the pan to dissolve the sugar. Let the mixture come slowly to a boil, without stirring, then lower heat slightly, and cook until the syrup has gone a very deep amber color, approximately 5 to 6 minutes. Remove from heat, add the saffron to the caramel and swirl to mix it in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the caramel over the sliced fruit. Return to the refrigerator for an hour or so, or serve right away."}], "link": "https://cooking.nytimes.com/recipes/1018032-caramelized-citrus"}