{"@context": "http://schema.org", "@type": "Recipe", "name": "Hudutu", "description": "This origins of this seafood soup — seared fish, shrimp and conch quickly poached in a simple coconut broth — can be discerned by its elements. It's a specialty of the Garifuna people, descendants of intermarried Africans and Carib natives who settled on the Atlantic coast of Honduras (as well as Belize, Guatemala and Nicaragua), and the tropical coconut and abundant seafood speak to where they live. The fact that it's always served with machuca, a mash of sweet and green plantains, reflects the Garifunas' West African origins, where cassava and plantain mashes called fufu are a staple.", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2016/09/18/magazine/18eat1/18mag-18eat-t_CA0-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6-8", "recipeCuisine": "african, central american", "recipeCategory": "soups and stews", "keywords": "adobo seasoning, coconut milk, conch, red snapper, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 549, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "1 gram", "proteinContent": "42 grams", "saturatedFatContent": "28 grams", "sodiumContent": "969 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons dried oregano leaves", "1 pound large shrimp, peeled", "4 teaspoons ground cumin", "Salt, to taste", "Goya adobo seasoning, to taste (optional)", "3/4 pound conch (or replace with more shrimp)", "1 1/2 pounds red snapper (see note)", "Vegetable oil, as needed", "3 cloves garlic, minced", "1/2 cup red or green bell pepper, finely chopped", "1/3 cup chopped cilantro, lightly packed", "5 cups coconut milk", "1/2 cup sofrito <a href=\"http://cooking.nytimes.com/recipes/1018303-sofrito\">(recipe here)</a>", "2 tablespoons chicken bouillon powder (see note)", "Machuca, for serving <a href=\"http://cooking.nytimes.com/recipes/1018304-machuca\">(recipe here)</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spice grinder, pulverize the oregano, and reserve ½ tablespoon of the powder for the soup. Season the shrimp with ½ teaspoon cumin, 1/3 of the oregano powder, salt to taste and a few pinches of adobo powder, if using. Pound the conch until tender with a mallet or the back of a knife, cut into bite-size pieces and season as you did the shrimp. Pat the snapper dry with paper towels, and season with 1/2 teaspoon cumin, the last third of the oregano powder, salt to taste and a few pinches of adobo powder, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1/4 inch of oil in a large frying pan over medium-high heat, until lightly smoking. Carefully place the snapper pieces into the oil, working in batches if necessary. Turn heat up to high, and sear until richly browned, about 3 minutes. Flip and sear the other side, another 3 minutes or so. Remove the fish to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of oil over medium heat in a large pot. Add the minced garlic, chopped peppers and cilantro and cook, stirring occasionally, until softened, about 5 minutes. Add the coconut milk, 5 cups water, sofrito, the remaining 2 1/2 teaspoons cumin, the reserved 1/2 tablespoon oregano powder and chicken bouillon. Bring this to a simmer over medium-high heat, stirring occasionally to keep the fat from separating. When it comes to a simmer, add the snapper, and turn the heat to high. When the liquid comes to a simmer again, add the shrimp. When it comes to a simmer again, add the conch, if using, and immediately turn off the heat. (The conch will cook quickly in the residual heat of the soup.) Season with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide immediately in shallow bowls to prevent the conch from overcooking, and serve with the <a href=\"http://cooking.nytimes.com/recipes/1018304-machuca\">machuca</a>, which guests can spoon into their bowls as desired."}]}