{"@context": "http://schema.org", "@type": "Recipe", "name": "Clam Fritters", "description": "This is a recipe for classic New England clam fritters prepared as conch fritters are in the Bahamas, with a low zip of jalapeno heat and a high one of lime juice. I serve them with my version of the ubiquitous mayo-ketchup sauce of the Lucayan archipelago. These fritters are terrific when prepared with freshly shucked clams, but if you don’t want to open clams by hand, they are still excellent with lightly steamed ones. A deep cast-iron skillet placed over a gas grill allows you to fry the fritters outdoors if you like, reducing kitchen mess. Or if you don’t wish to fry, you can treat the batter as if it were for pancakes. The flavor abides, if not the full crispiness.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/07/24/magazine/24eat/24mag-24eat-t_CA0-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings as an appetizer", "recipeCuisine": "caribbean", "recipeCategory": "finger foods", "keywords": "appetizer, clam juice, clams, jalapeño, lime, red bell pepper, red onion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 76}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 740, "unsaturatedFatContent": "66 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "74 grams", "fiberContent": "1 gram", "proteinContent": "13 grams", "saturatedFatContent": "6 grams", "sodiumContent": "679 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["36 cherrystone clams", "1 1/2 cups or 180 grams all-purpose flour", "3 large eggs, separated", "1/2 red onion, peeled and diced", "1/2 red pepper, seeded and diced", "2 ribs celery, diced", "2 cloves garlic, peeled and minced", "1 jalapeño pepper, seeded and diced", "3/4 cup clam broth or clam liquor", "2 teaspoons baking powder", "2 to 3 cups neutral oil, like canola", "2 scallions, chopped", "2 limes, cut into wedges", "3 tablespoons ketchup", "2 tablespoons mayonnaise", "1 tablespoon hot sauce", "3 tablespoons lime juice (the juice of 1 or 2 limes)", "Kosher salt and freshly ground black pepper, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Either open the clams by hand, reserving both the juice within them and the clams, or steam the clams until they just open, reserving both the broth and the clams. Put the clams on a cutting board, and chop them coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the flour in a mixing bowl, and add to it the egg yolks, onion, red pepper, celery, garlic, jalapeño and clams, then mix to combine. Add the clam broth to the mixture, and stir until it is a thick batter running almost to loose."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce. Whisk together the ketchup, mayonnaise, hot sauce and lime juice in a medium-size bowl. Season to taste with salt and pepper. Add more mayonnaise, hot sauce or lime juice if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites until stiff, then whisk the baking powder into the clam batter, and carefully fold the egg whites into it afterward."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat enough oil to come up an inch or so on the sides of a large, deep frying pan until it is quite hot, approximately 350 degrees. Drop the batter by the tablespoon into the hot oil, making sure not to crowd the pan, and cook, turning once or twice, until the fritters are golden brown and crisp. Remove with a slotted spoon, and place on a warmed platter. Serve with the sauce on the side, with the scallions and wedges of lime."}]}