{"@context": "http://schema.org", "@type": "Recipe", "name": "Jamie Oliver’s Chicken in Milk", "description": "The British chef and cooking star Jamie Oliver once called this recipe, which is based on a classic Italian one for pork in milk, “a slightly odd but really fantastic combination that must be tried.” Years later he told me that that characterization made him laugh. “I was hardly upselling its virtues,” he said. The dish’s merits are, in fact, legion. You sear a whole chicken in butter and a little oil, then dump out most of the fat and add cinnamon and garlic to the pot, along with a ton of lemon peel, sage leaves and a few cups of milk, then slide it into a hot oven to create one of the great dinners of all time. The milk breaks apart in the acidity and heat to become a ropy and fascinating sauce, and the garlic goes soft and sweet within it, its fragrance filigreed with the cinnamon and sage. The lemon meanwhile brightens all around it, and there is even a little bit of crispness to the skin, a textural miracle. It is the sort of meal you might cook once a month for a good long while and reminisce about for years. ", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/04/23/magazine/23eat/23mag-23eat-t_CA0-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "chicken, garlic, lemon, milk, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2456}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 932, "unsaturatedFatContent": "42 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "71 grams", "fiberContent": "3 grams", "proteinContent": "57 grams", "saturatedFatContent": "24 grams", "sodiumContent": "1442 milligrams", "sugarContent": "9 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 (3 to 4 pound) whole chicken", "Kosher salt and freshly ground black pepper, to taste", "1/4 cup unsalted butter", "1/4 cup extra-virgin olive oil", "1 small cinnamon stick", "10 cloves garlic, skins left on", "2 1/2 cups whole milk", "1 handful of fresh sage, leaves picked — around 15 to 20 leaves", "2 lemons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Season the chicken aggressively with the salt and pepper. Place a pot that will fit the chicken snugly over medium-high heat on the stove, and add to it the butter and olive oil. When the butter has melted and is starting to foam, add the chicken to the pot and fry it, turning every few minutes, until it has browned all over. Turn the heat down to low, remove the chicken from the pot and place it onto a plate, then drain off all but a few tablespoons of the fat from the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cinnamon stick and garlic to the pot, and allow them to sizzle in the oil for a minute or 2, then return the chicken to the pot along with the milk and sage leaves. Use a vegetable peeler to cut wide strips of skin off the two lemons, and add them to the pot as well. Slide the pot into the oven, and bake for approximately 1½ hours, basting the chicken occasionally, until the chicken is cooked through and tender and the sauce has reduced into a thick, curdled sauce. (If the sauce is reducing too quickly, put a cover halfway onto the pot.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, use a spoon to divide the chicken onto plates. Spoon sauce over each serving. Goes well with sautéed greens, pasta, rice, potatoes or bread."}]}