{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Ganache With Black Sesame and Miso", "description": "In this highly sophisticated confection, soft chocolate ganache and crumbly black sesame streusel sit on top of a salty-sweet black sesame and miso cream. Eaten together, the flavors veer toward the savory side — as perfect for people who don’t usually like sweets as it is for dessert lovers looking for nuance and depth.\nAt NA/NA in Paris, the chef Nathaly Nicolas-Ianniello garnishes this differently depending on the season – using some combination of micro herbs, edible flowers, and/or tart berries, such as currants or wild blueberries. But it’s also wonderful served plain, with just the crunchy bits of near-black streusel dotting the top.\nYou can make all the components days in advance, but don’t combine them until just before serving. The textural contrast of creamy, sandy and crisp is part of the charm.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/09/06/dining/06CHEF2/06CHEF2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "cookies and bars, pastries", "keywords": "black sesame seeds, corn syrup, dark chocolate, Demerara sugar, Dutch-processed cocoa powder, miso, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 28}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 937, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "72 grams", "fiberContent": "8 grams", "proteinContent": "13 grams", "saturatedFatContent": "38 grams", "sodiumContent": "449 milligrams", "sugarContent": "38 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup/240 milliliters whole milk", "1 teaspoon powdered gelatin", "1 cup/240 milliliters heavy cream", "1/4 cup/80 grams honey, more to taste", "7 tablespoons/120 grams black sesame paste (see note)", "1/4 cup/58 grams sweet miso (see note, or use 2 tablespoons/29 grams white shiro miso)", "3/4 cup/150 grams chopped dark chocolate (around 70 percent)", "1/2 cup plus 2 tablespoons/150 grams heavy cream", "1 1/2 tablespoons/30 grams light corn syrup or honey", "1 1/2 tablespoons/20 grams unsalted butter, at room temperature", "1/4 cup/50 grams finely chopped dark chocolate (around 70 percent)", "4 tablespoons/66 grams unsalted butter, cold and cut into 1/2-inch cubes", "1/3 cup plus 1 tablespoon/50 grams all-purpose flour", "2 1/2 tablespoons/32 grams packed light brown sugar", "2 1/2 tablespoons/30 grams Demerara sugar", "1 1/2 tablespoons/7 grams unsweetened, Dutch-processed cocoa powder", "Pinch kosher salt", "1/4 cup/30 grams black sesame seeds, more for serving", "Micro herbs, edible flowers or berries, such as red currants or wild blueberries, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sesame-miso cream: Place 1/2 cup milk in a small bowl, then sprinkle gelatin over the top. Let sit for 5 minutes to soften."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine remaining 1/2 cup milk, cream and honey in a small pot, and heat until simmering. Remove from heat, and stir in gelatin mixture, black sesame paste and miso. Mix with an immersion blender (or transfer to a regular blender to mix) until smooth. Taste and add a bit more honey, if you like. Divide sesame cream among 6 shallow bowls or small gratin dishes (or ramekins), cover with plastic wrap and refrigerate for at least 8 hours and up to 5 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the ganache: Place chocolate in a heatproof bowl. In a medium pot, bring cream and corn syrup to a boil. Pour over the chocolate, then let sit for 1 minute. Stir together with a spatula until combined, then stir in butter until melted and smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool ganache to room temperature, then cover and refrigerate until needed, at least 4 hours and up to 5 days. (Allow ganache to soften at room temperature for at least 30 minutes before serving)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the streusel, heat oven to 325 degrees, and line a cookie sheet with parchment paper. In a food processor, pulse chocolate until just chopped into mini chocolate chip-size pieces, about 1/8 inch. (Try not to go any finer so you preserve some texture.) Transfer to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter, flour, brown sugar, Demerara sugar, cocoa powder and salt to the food processor. Pulse just until the dough comes together into a crumbly mass. Scrape into bowl with chocolate, then add sesame seeds; fold to combine. Transfer to prepared cookie sheet. Top with another piece of parchment paper and roll out to a ½-inch-thick slab. (It doesn’t have to be round as long as it’s evenly thick.) Remove top layer of parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until darkened all over top, and the butter is bubbling up throughout the dough, about 25 to 30 minutes. Transfer the pan to a wire rack and let cool. Break into bite-size pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, uncover sesame cream and dollop or pipe some of the chocolate ganache on top. (You probably won’t need all of the ganache.) Top with crumbled streusel, black sesame seeds and micro herbs or edible flowers, if using."}], "link": "https://cooking.nytimes.com/recipes/1018914-chocolate-ganache-with-black-sesame-and-miso"}