{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken and Pumpkin with Dumplings", "description": "Asha Gomez moved to the American South from Kerala, a region of southern India. This recipe, from her book \"My Two Souths: Blending the Flavors of India into a Southern Kitchen,\" marries Southern-style dumplings made with rice flour and Indian flavors. The dish relies on stewing the chicken, a technique common to both cultures. Although smaller, dense pie pumpkins work here, they can be stringy and have less flavor than other forms of pumpkins and hard squash. Ms. Gomez likes calabaza squash, also known as West Indian pumpkin, which has a mottled skin that can range from dark green to light orange mottled with amber. The dusty blue-gray Jarrahdale pumpkin works well, too. In both cases, you will have a lot of pumpkin meat left over to cook, purée and freeze for baking or soup. The kabocha squash, or Japanese pumpkin, which has a dull, deep-green skin with some celadon or white stripes and averages about two to three pounds, is another option.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2016/10/12/dining/12PUMPKIN4-WEB/12PUMPKIN4-WEB-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "indian, southern", "recipeCategory": "dinner, dumplings", "keywords": "chicken, coconut milk, ginger, pumpkin, rice flour, thai basil", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 115}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1046, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "105 grams", "cholesterolContent": null, "fatContent": "50 grams", "fiberContent": "5 grams", "proteinContent": "44 grams", "saturatedFatContent": "22 grams", "sodiumContent": "1106 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil", "1 small fryer chicken (2 1/2 to 3 1/2 pounds), cut into 8 pieces", "1/4 cup unbleached all-purpose flour", "3 shallots, peeled and thinly sliced", "1 1-inch piece peeled fresh ginger, thinly sliced", "2 cups of raw pumpkin, such as kabocha, Jarrahdale or red kuri, seeded, peeled and diced", "2 stalks celery, rough cut into large chunks", "2 fresh bay leaves", "2 sprigs fresh thyme", "1 teaspoon turmeric powder", "1 1/2 teaspoons salt", "4 cups chicken stock", "2 cups coconut milk", "15 fresh Thai basil leaves, for garnish", "2 cups rice flour", "1 teaspoon cumin seeds", "1/2 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the chicken: Put the olive oil in a large Dutch oven with a tight-fitting lid and heat on medium until the oil is hot. In a separate bowl, dredge the chicken pieces in flour. Drop the chicken into the hot oil, 2 or 3 pieces at a time. Be careful to avoid crowding. Brown for about 2 minutes on each side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken from the Dutch oven. Add the shallots and ginger and cook, stirring, for 2 minutes. Add the pumpkin, celery, bay leaves, thyme, turmeric and salt. Cook, stirring, for 1 minute; stir in the stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the chicken to the Dutch oven; cover, reduce heat to medium-low, and simmer for 15 minutes. Add the coconut milk and stir just until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dumplings: In a medium bowl, mix the rice flour, cumin seeds and salt. Gradually stir 2 cups warm water into the rice flour mixture to make a soft dough that is not sticky; the dough will have a somewhat fragile, sandy texture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form 24 1/2-inch small balls of dough with your hands or a melon baller. Make a small divot in each dumpling by pressing down in the center with your thumb (much as you would in making gnocchi or orecchiette pasta) and place on a plate or baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a steamer basket over a medium pan containing 1 quart water. Place the dumplings in the basket, making sure they are not touching, and cover. Bring the water to a boil over medium-high heat. Steam the dumplings until they are firm and plump, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the final dish: Drop the dumplings into the chicken mixture, stir ever so gently to coat the dumplings with the sauce, then cover again and simmer for 12 minutes. Remove from heat. Cut the basil into chiffonade, or thin ribbons. Serve in bowls with a scattering of basil."}], "link": "https://cooking.nytimes.com/recipes/1018336-chicken-and-pumpkin-with-dumplings"}