{"@context": "http://schema.org", "@type": "Recipe", "name": "Tahini Ranch Dressing", "description": "This ranch-dressing adaptation comes from Julia Goldberg, a cook at Superiority Burger, Brooks Headley's vegetarian fast-food restaurant in New York. While traditional ranch relies on buttermilk and mayonnaise for its creaminess, the base in this version is tahini, or sesame butter, mixed with lemon juice and water until it turns smooth and glossy. Maple syrup and a generous amount of salt are crucial to mimicking the intense salty-sweetness of bottled ranch. The thick herb-packed sauce can be used as a versatile dressing for raw or grilled lettuces, a dip for crudités or a tangy sauce for grilled meat. After hours at Superiority Burger, the cooks like to experiment, drizzling it over oven-browned potatoes, or folding it into burritos. The recipe makes enough so that you can experiment with leftovers, too.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2016/08/28/magazine/28eat/28mag-28eat-t_CA0-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "2 cups", "recipeCuisine": "", "recipeCategory": "condiments, salads and dressings", "keywords": "chives, dill, maple syrup, parsley, tahini, side dish, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 334}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 432, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "7 grams", "proteinContent": "11 grams", "saturatedFatContent": "5 grams", "sodiumContent": "380 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 cup smooth liquid tahini (like Soom)", "1/2 cup lemon juice", "1/2 cup water", "1/2 teaspoon garlic powder", "2 tablespoons maple syrup", "1 tablespoon olive oil", "Salt and freshly ground black pepper to taste", "1 cup finely chopped dill, chives and parsley, in equal parts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, use a spatula to mix the tahini with lemon juice. The mixture will seize and thicken, and look alarmingly close to creamed butter and sugar. Don’t worry about this. Gradually add water, and keep mixing; the tahini will soon turn pale, smooth and creamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic powder, maple syrup and olive oil, and taste. Season with salt and pepper (the dressing could use at least a teaspoon of salt). Finally, mix in the herbs. The dressing is ready to use right away, though it will taste even better the following day and will keep in the fridge for up to a week."}]}