{"@context": "http://schema.org", "@type": "Recipe", "name": "Walnut Cake", "description": "I have to thank a couple of people for this recipe: first, the chef Stevie Parle, of Dock Kitchen in London, who published the recipe to inspire this one, and second, the aunt of one of my recipe testers, who made such a standout interpretation that we all marveled over the leftovers the next day in the test kitchen. I just had to try my own version, and here it is, made a touch more celebratory with caramelized walnuts and lashings of whipped cream, both of which can be omitted if you prefer keeping it plain and dairy-free (thereby making it suitable for Passover). The cake is moist and delicious enough as it is. If baking for Passover, you should also be sure to use muscovado sugar (or dark brown sugar) and amaretto that are certified kosher for Passover.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2017/04/05/dining/05BAKING4/05BAKING4-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "amaretto, walnut, dessert, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 282}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 487, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "78 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "6 grams", "sodiumContent": "355 milligrams", "sugarContent": "49 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Oil or butter, for greasing the pan", "4 large eggs, yolks and whites separated", "1 packed cup/200 grams dark muscovado sugar", "12 ounces/350 grams walnut halves (about 3 1/2 cups), blitzed to the consistency of fine bread crumbs in a food processor", "Finely grated zest of 1 lemon", "1/8 teaspoon kosher salt", "3 tablespoons amaretto", "1/3 cup plus 1 tablespoon/80 grams granulated or superfine sugar (caster sugar)", "2 ounces/60 grams walnut halves (1/2 cup)", "Sea salt", "2/3 cup/150 milliliters heavy cream (double cream)", "1/2 teaspoon granulated or superfine sugar (caster sugar)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees Fahrenheit/190 degrees Celsius. Grease an 8-inch/20-centimeter springform pan with oil or butter. Line the bottom of the pan with parchment paper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place egg yolks and muscovado sugar in the bowl of a stand mixer fitted with the whisk attachment (or in a large bowl, if using a hand-held electric mixer). Whip on high speed for about 2 minutes, or until pale and fluffy, scraping down sides of bowl as necessary. Transfer mixture to a large bowl. Add walnuts, lemon zest and salt and mix well to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and dry the stand mixer bowl and whisk attachment, then add egg whites to bowl. Whip on high speed for 2 minutes, or until stiff peaks form. Using a spatula, fold egg whites into the walnut mixture a third at a time; the mixture will be thick and quite difficult to bring together at first but will gradually loosen, so the final addition of whites lightens the batter considerably."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour batter into pan and bake for 40 minutes, until evenly puffed. This is a moist cake, so a skewer inserted inside should not come out completely dry and clean. Let cake cool for 5 minutes, then release it from the pan. (You may need to run a small knife around the edge.) Carefully flip over cake, remove pan bottom and paper, and flip again to transfer it to a large plate. Brush surface with amaretto and then leave to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While cake is cooling, make the caramelized walnuts: Sprinkle sugar evenly over the bottom of a medium saucepan and place over medium heat. Cook gently for about 6 minutes, swirling pan but resisting the urge to stir, until you get a medium brown syrup, the consistency of maple syrup. Add walnuts and quickly stir them into the syrup until coated. Pour nuts onto a parchment-lined sheet pan, spread in a single layer, and sprinkle with a pinch of salt. Once cool and hardened, roughly chop into 1/2- and 1-inch/1- and 2-centimeter pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: Add cream and sugar to the bowl of an electric stand mixer fitted with the whisk attachment (or use a large bowl and a hand-held whisk). Whip on high speed for 1 minute, or until firm and fluffy. When cake has cooled, spread cream over surface and then scatter with caramelized walnuts."}]}