{"@context": "http://schema.org", "@type": "Recipe", "name": "False Mahshi: Layered Swiss Chard, Beets, Rice and Beef", "description": "This is an Iraqi dish for Rosh Hashana, the Jewish New Year, with bitter Swiss chard, sweet beets and beef in a sweet and sour sauce. In Amara, a city near Basra in southern Iraq, the dish is called \"mahshi\" or \"stuffed\" in Arabic. It is traditionally made by stuffing Swiss chard leaves with beets, onions and sometimes meat. This version is called false mahshi, as the dish is made in layers.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2008/09/24/dining/false-mahshi/false-mahshi-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, one pot", "keywords": "beet, rib eye steak, spearmint, swiss chard, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 573, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "4 grams", "proteinContent": "26 grams", "saturatedFatContent": "11 grams", "sodiumContent": "773 milligrams", "sugarContent": "9 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 cups long-grain jasmine rice", "2 pounds rib-eye steak, cut in 1-inch cubes", "Salt and coarsely ground black pepper", "6 tablespoons vegetable oil", "2 large onions, peeled and diced", "2 large beets (about 1 pound), peeled, 1 cut into 1/2-inch dice and 1 grated", "1 pound Swiss chard, leaves left whole and stems cut into 2-inch pieces", "8 teaspoons sugar, or as needed", "4 tablespoons fresh spearmint leaves", "1 teaspoon dried mint", "4 cloves garlic, peeled and finely diced", "Juice of 3 lemons (about 1/2 cup), or as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place rice in a mixing bowl and cover with water. Stir, drain off cloudy water, and repeat until water runs clear. Cover rice with fresh water and let soak for about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season beef with salt and pepper to taste. Place Dutch oven over medium heat and add 1 tablespoon of oil. When oil is shimmering, add beef and sauté until well-browned on all sides, about 5 minutes. Remove beef and set aside. Return pan to low heat and add 2 more tablespoons of oil. Add onions and sauté until transparent, about 5 minutes. Add diced beets and sauté for another 5 minutes. Add two-thirds of the Swiss chard stems and continue cooking until onions are golden, about 5 more minutes. Stir in beef, cover, and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain rice and return to a bowl. Sprinkle with salt to taste, 5 teaspoons of sugar, 1/2 teaspoon black pepper, 1 tablespoon fresh mint and dried mint. Stir to blend, and add garlic, grated beet, remaining oil and juice of 1 lemon. Spread one-third of Swiss chard leaves in Dutch oven, on top of beef mixture. Spoon half of rice mixture on top, and cover with another third of chard leaves. Spread with remaining rice, and top with remaining Swiss chard leaves and stems."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix 1 1/2 cups water with remaining 3 teaspoons sugar and juice of another lemon. Taste and, if necessary, add more sugar or lemon juice so mixture is both sweet and sour. Pour over Swiss chard and bring to a boil. Cook partly covered until chard begins to wilt, 3 to 5 minutes. Add 1/2 cup water if pan is very wide and there is little liquid on bottom. Poke handle of a wooden spoon into mixture in three places, making holes to let steam rise through chard. Cover, reduce heat to very low, and cook until rice is tender, about 30 minutes. Remove from heat and let rest for 15 minutes. Just before serving, sprinkle with remaining lemon juice and remaining fresh mint."}]}