{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Schnitzels With Mint-Horseradish Pesto", "description": "This is a lamb dish done schnitzel-style, devised as a pairing for blaufränkisch wine from Austria. Ask your butcher to pound slices of top round of lamb, from the leg, only lightly, which will result in pieces that are about a half-inch thick, providing enough tolerance so the meat can brown without overcooking. Refrigerating the coated slices before frying them helps, too. A pesto sauce, made with mint leaves and zapped with horseradish, picks up some of the herbal and pepper flavors in the wine. Warm potato salad in a vinaigrette dressing would be a perfect side dish for the schnitzel.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "austrian", "recipeCategory": "meat", "keywords": "horseradish, mint leaves, sour cream, top round lamb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1117, "unsaturatedFatContent": "71 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "93 grams", "fiberContent": "4 grams", "proteinContent": "38 grams", "saturatedFatContent": "17 grams", "sodiumContent": "804 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup flour", "Salt and ground black pepper", "1/4 cup freshly grated horseradish", "1 large egg", "3/4 cup dry bread crumbs", "1 1/2 pounds top round of lamb, in four pieces lightly pounded to 1/2-inch thick", "1/2 cup (packed) fresh mint leaves", "1/3 cup extra virgin olive oil", "2 lemons", "2 tablespoons sour cream", "2/3 to 1 cup vegetable oil, preferably grape seed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread flour on a dinner plate and season with salt, pepper and 2 teaspoons horseradish. In a shallow bowl, beat egg with 1 tablespoon water. Spread bread crumbs onto a dinner plate. Dip lamb pieces first in flour, shaking off excess, then in egg, then in crumbs. Place on a platter. Refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place mint leaves and remaining horseradish in food processor and process until mint is minced. Slowly drizzle in olive oil through feed tube. Transfer to a serving bowl, stir in juice of 1 lemon and sour cream, season with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat vegetable oil to a depth of about 1/2 inch in a 12-inch skillet to very hot. Add 2 slices of lamb and cook over medium-high heat until browned, turning once, about 2 minutes a side. Try to keep oil and lamb moving in pan by gently sliding pan on burner in a circular motion. When done, place lamb on several thicknesses of paper towel to drain. Repeat with remaining lamb. Lamb will be medium-rare. If you want it more well done, reduce heat to medium so it takes longer to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a platter, and serve, with sauce and remaining lemon in wedges."}], "link": "https://cooking.nytimes.com/recipes/1018917-lamb-schnitzels-with-mint-horseradish-pesto"}