{"@context": "http://schema.org", "@type": "Recipe", "name": "Italian Spinach Stuffing", "description": "This is an Italian-American turkey stuffing that was invented in New Jersey by Pietronilla Conte, who emigrated from the Italian region of Molise in the early 20th century. Ms. Conte's granddaughter Lisa shared the recipe (which her mother, Carmela, also prepares) with us. \"She must have used a stuffing that she knew in Italy,\" Lisa Conte said of her grandmother. \"And she just looked at the turkey as a larger thing to stuff.\" The gizzards give the stuffing its depth of flavor (like giblet gravy), but you could leave them out, or substitute an equal amount of livers, or 6 ounces of pancetta or bacon.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/11/11/dining/COOKING-SPINACH1/COOKING-ITALIAN1-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "12 to 14 servings", "recipeCuisine": "italian", "recipeCategory": "stuffing and dressing", "keywords": "bread crumbs, chicken gizzards, garlic, mushroom, onion, spinach, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 248, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "22 grams", "saturatedFatContent": "4 grams", "sodiumContent": "532 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 tablespoons olive oil", "2 cups chopped sweet onion (about 1 large onion)", "8 cloves garlic, minced", "4 (10-ounce) boxes frozen chopped spinach, thawed, drained and squeezed dry", "2 cups chopped white mushrooms caps", "Salt and black pepper", "2 pounds well-trimmed chicken or turkey gizzards", "4 large eggs", "1 1/2 cups grated Parmigiano-Reggiano", "1 cup unseasoned bread crumbs", "1/2 cup chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons olive oil in a large pot over medium-high heat. Add onions and sauté, stirring, until translucent, about 5 minutes. Reduce heat to medium and add garlic, spinach and mushrooms and cook, stirring often, until well mixed and heated through, about 5 minutes. Season mixture to taste with salt and pepper; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely mince chicken gizzards. (You can do this by hand or in a food processor, but be careful not to overprocess.) Season gizzards all over with salt. Heat 2 tablespoons olive oil in a large skillet over medium-high heat. Add gizzards and sauté, stirring often, until cooked through, 5 to 7 minutes. Drain off any drippings, then stir gizzards into spinach mixture. Let cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. When spinach mixture is cool, add eggs, cheese, bread crumbs and parsley and stir until well combined. Transfer stuffing to a 3-quart casserole dish and bake, covered, 1 hour."}], "link": "https://cooking.nytimes.com/recipes/1018408-italian-spinach-stuffing"}