{"@context": "http://schema.org", "@type": "Recipe", "name": "Katsudon (Pork-Cutlet Rice Bowl)", "description": "Katsudon is a comforting, belly-warming dish from Japan, composed of sliced pork cutlets simmered in a dashi-based broth with onion and eggs and served over a bowl of warm rice. It's an ideal way to use up leftover cutlets from the refrigerator, but it's even more rewarding when it's made with fresh, warm cutlets, and it comes together quickly enough for a weeknight. Variations of katsudon can be found on restaurant menus and home kitchens — and in anime. This recipe includes an optional addition of frozen peas, inspired by the main character in \"Yuri!!! on Ice,\" whose parents serve katsudon with peas at their fictional inn. But it takes some delicious real-life cues from the work of Nancy Singleton Hachisu (who adds a small amount of julienned ginger to her broth, brightening it) and from the chef Tadashi Ono.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/10/22/magazine/22eat/22eat-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "meat, steaks and chops", "keywords": "bonito flakes, kombu, panko, pork, pork cutlets", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 263}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 787, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "4 grams", "proteinContent": "47 grams", "saturatedFatContent": "10 grams", "sodiumContent": "2261 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 cups water", "1 piece kombu, about 5 inches by 6 inches", "1 ounce bonito flakes", "2 pork-loin cutlets, 1/2 inch thick", "1/2 cup flour", "1 egg, lightly beaten", "3/4 cup panko", "Salt and pepper", "Vegetable oil, for deep-frying", "2/3 cup dashi", "2 tablespoons soy sauce", "2 tablespoons mirin", "1/2 cup white onion, thinly sliced", "1 piece ginger, 1 inch thick, thinly sliced and cut into strips", "1/4 cup frozen peas (optional)", "4 eggs", "White rice, to serve", "2 scallions, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dashi, bring the water and kombu up to a simmer, then turn off the heat. Fish out the kombu, then add the bonito, and allow to steep for 2 or 3 minutes. Skim off any scum on the surface, and pour through a fine-mesh strainer. Keep in the fridge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cutlets, put the flour, egg and panko in three separate wide bowls. Generously season each cutlet with salt and pepper on both sides. Dip them, one at a time, in the flour, then the egg, then the panko, making sure each cutlet is totally covered in crumbs. Pour vegetable oil into a large, wide skillet until it’s just under an inch high, and set over medium-high heat until it reaches 350 degrees. Fry cutlets until golden brown and crisp, turning after 3 minutes, and frying for a total of 6 minutes. Set on a wire rack to cool, then slice into 1/4 inch thick pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over medium heat, add 2/3 cup dashi, soy sauce, mirin, onion, ginger and peas, if using. Bring to a simmer, then turn the heat down to low and cook for about 5 minutes, until the onion has softened. Carefully place the sliced cutlets on top of the onion and broth. Cover, and cook for 3 more minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crack eggs into a small bowl, and beat them with a fork, then pour all along the top of the cutlets. Don’t stir, just cover and cook until the eggs are just about set but still slightly wobbly. To serve, heap rice into bowls, then slide cutlet slices, eggs and broth on top of each. Sprinkle with scallions."}]}