{"@context": "http://schema.org", "@type": "Recipe", "name": "Striped Bass with Fresh Figs", "description": "This recipe is inspired by a dish served at a pinot noir dinner at Bar Boulud, one of the chef Daniel Boulud’s restaurants. There, a whole wild striped bass was swaddled in fresh fig leaves and stuffed with fresh black figs in a red wine sauce. The brooding sauce bathed velvet figs, and its earthy depths made the already succulent fish a fine partner for some excellent bottles of red. My version, which uses fillets and omits fig leaves, is about as delicious as I remembered and much easier than I expected.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2017/10/11/dining/11pairrex/11pairrex-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "seafood", "keywords": "black figs, dry red wine, wild striped bass, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 19}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 578, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "7 grams", "proteinContent": "39 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1185 milligrams", "sugarContent": "47 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "2 large shallots, sliced thin", "1 large clove garlic, slivered", "16 ripe black figs, not too soft, stemmed and halved vertically", "1/2 teaspoon ground cloves", "3 tablespoons saba (Italian grape-must syrup); or pomegranate molasses", "3/4 cup dry red wine", "3 1/2 tablespoons soft unsalted butter, preferably high fat (84-86 percent)", "Salt and ground black pepper", "28- to 30-ounce fillet of wild striped bass, with skin, or halibut", "1 tablespoon flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1 tablespoon oil in a large skillet on medium heat. Add shallots and garlic and sauté until soft, about 5 minutes. Add figs and continue to sauté another minute or two, until they are warmed through and just start to soften. Sprinkle with cloves. Add saba and continue cooking until the syrup just coats the bottom of the pan. Stir in wine. Remove figs and as many shallots as you can from the pan, draining well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase heat to medium-high and cook sauce until wine has reduced by half. Reduce heat to medium-low. Add 2 tablespoons of the butter bit by bit, swirling it in. Cook a minute or so more, until sauce starts to become syrupy. Season with salt and pepper to taste. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a broiler. Place rack about 4 inches from the source of heat. Dry fish. Dust skin side of bass or bottom side of halibut with flour. Flip fillet and season top surface well with salt and pepper. Heat remaining butter on medium-high in a large, heavy skillet, preferably cast iron. Place fish, floured side down, in skillet and sear 2 minutes. Brush top surface of fish with some of the sauce and place fish under the broiler. Broil about 7 minutes, until just cooked through. Remove from heat. Transfer fish to a warm platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return figs and shallots to the sauce, heat on medium a minute or so, then spoon sauce with figs around the fish on the platter. Serve."}]}