{"@context": "http://schema.org", "@type": "Recipe", "name": "Kalpudding (Meatloaf With Caramelized Cabbage)", "description": "This is a Swedish version of a dish with roots in the Ottoman Empire, an infidel’s version of Turkish dolmas, made not with lamb and grape leaves but with ground pork and beef cloaked with deeply caramelized cabbage. It is served here with lingonberry preserves cut with vinegar and Worcestershire sauce, and made velvet with butter. The dish goes beautifully with boiled potatoes. In Sweden, you’d use golden syrup to caramelize the cabbage, but molasses works just as well. The Swedish chef Magnus Nilsson told me the result is no less Nordic for the substitution. “Cabbage smells in a very special way when it almost burns,” he said. “It gets savory, almost like a beef stock. It tastes almost brown and umami yummy.” You’ll want to eat it right away, but the leftovers make for a fine sandwich in coming days. ", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/03/05/magazine/05eat/05eat-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "scandinavian", "recipeCategory": "roasts", "keywords": "cabbage, ground beef, ground pork, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1452}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 947, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "67 grams", "fiberContent": "7 grams", "proteinContent": "35 grams", "saturatedFatContent": "33 grams", "sodiumContent": "1331 milligrams", "sugarContent": "35 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 tablespoons plus 1 teaspoon unsalted butter", "1 head green cabbage, approximately 3 pounds, cored and shredded", "3 tablespoons molasses", "Kosher salt and freshly ground pepper, to taste", "3/4 pound ground beef", "3/4 pound ground pork", "1 small yellow onion, peeled and chopped", "1 cup heavy cream", "4 tablespoons breadcrumbs", "1/3 cup chicken, beef or vegetable stock, ideally homemade or low-sodium store-bought (or water)", "1/3 cup lingonberry preserves", "1 tablespoon red-wine vinegar", "1 tablespoon unsalted butter", "1 teaspoon Worcestershire sauce, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350. Put a large pan over medium-high heat, and add the butter. When it starts to foam, add the cabbage and molasses, lower the heat to medium and sprinkle with salt. Cook slowly, stirringoften, until all the liquid has evaporated and the cabbage is caramelized, approximately 20-25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cabbage is cooking, lightly mix the meats in a large bowl, then add the onion, cream and breadcrumbs, and mix again to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cabbage is done, add about a third of it to the meat mixture, and mix to combine. Use the remaining butter to grease an 8-inch-square baking pan, and transfer the meat mixture to it, spreading it out to cover the whole surface evenly. Spread remaining cabbage over the meat, pour the stock or water over the top and place in the oven, on a sheet tray, to cook for approximately 40 to 45 minutes, or until the cabbage is very, very caramelized, almost dry and crunchy at the edges. Allow it to sit for 10 minutes or so before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the meat and cabbage cooks, make the sauce. Heat lingonberry preserves, vinegar and butter in a small pot set over medium heat, then add Worcestershire sauce to taste. Serve alongside the kalpudding."}], "link": "https://cooking.nytimes.com/recipes/1018628-kalpudding-meatloaf-with-caramelized-cabbage"}