{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Roasted Salmon With Jalapeño", "description": "Here is a simple, easy preparation for salmon that allows wild-caught fish, especially, to shine. The foaming butter amplifies the richness of the flesh, while the jalapeños keep it in check, as soy sauce does to the fattiest sushi. Some prefer to reverse the order of the cooking, so that the fish is served skin-side up, but I find that cooking it this way allows the butter to do its job more effectively and delivers a more beautiful plate of food as well. (Most of it is left in the pan when you’re done.) Top with chopped fresh herbs, and serve with roasted new potatoes.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/07/09/magazine/09eat/09eat-articleLarge-v5.jpg", "totalTime": "PT15M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "butter, jalapeño, salmon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 611}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 554, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "46 grams", "fiberContent": "0 grams", "proteinContent": "32 grams", "saturatedFatContent": "13 grams", "sodiumContent": "451 milligrams", "sugarContent": "0 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 5-to-6-ounce fillets of salmon, ideally wild-caught, 1/2-to-1-inch thick", "Kosher salt and ground black pepper", "2 tablespoons neutral oil, like grapeseed or canola", "2 tablespoons unsalted butter", "1 medium jalapeño pepper, seeded and diced fine, approximately 2 tablespoons (or to taste)", "1-2 tablespoons chopped cilantro, mint or flat-leaf parsley, or a combination of all three"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat fillets dry with a paper towel. Season on both sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy sauté pan or cast-iron skillet over high heat. When the pan is hot, add the oil, and swirl it around. When the oil begins to shimmer, place the fillets in the pan, flesh side down, and allow to sear for about a minute, until the salmon has just started to pick up some color and releases easily from the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a spatula to turn the fillets onto their skin side, lower heat to medium and let them sizzle until the fish is caramelized around its bottom edges, approximately 2 to 3 minutes. (You may wish to use your spatula to press down on the fillets for the first 10 or 15 seconds to keep the skin from curling in the heat.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat to low, and add butter and diced jalapeño to the far side of the pan, then use the handle to tilt the pan away from you. Use a spoon to baste the fish with the sizzling butter and jalapeño. Continue basting, quickly and repeatedly, until the fish is golden all over and cooked through, 45 to 90 seconds more, depending on the thickness of the salmon. Remove fillets from the pan, leaving the bulk of the butter and oil in it, and serve immediately, garnished with the chopped fresh herbs."}], "link": "https://cooking.nytimes.com/recipes/1018833-pan-roasted-salmon-with-jalapeno"}