{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Burfi", "description": "Burfi is a very sweet Indian candy — similar to fudge, but slightly earthier and more milky — that is typically made with some combination of milk, sugar, ghee and flavorings. In Indian culture, burfi is often given as a gift, accompanying any kind of celebration: a birthday, a holiday, even a simple get-together of friends. This recipe, adapted from Raja Sweets in Houston, caters to those looking for an accessible entry point to the world of burfi; it offers a slight variation on the basic formula by adding a layer of cocoa-infused khoya (the name for the milky base).", "author": {"@type": "Person", "name": "Priya Krishna"}, "image": "https://static01.nyt.com/images/2016/08/17/dining/17RAJA4/17RAJA4-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "16 pieces", "recipeCuisine": "indian", "recipeCategory": "candies", "keywords": "cocoa powder, ghee, milk powder, rose water, sweetened condensed milk, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 77}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 249, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "0 grams", "proteinContent": "4 grams", "saturatedFatContent": "8 grams", "sodiumContent": "62 milligrams", "sugarContent": "31 grams", "transFatContent": null}, "recipeIngredient": ["2/3 cup ghee (or use melted butter), plus more for greasing the pan", "1 tablespoon cocoa powder", "2/3 cup sugar", "2 cups sweetened condensed milk (a little less than two 14-ounce cans)", "2 cups powdered milk", "2 drops rose water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease only the sides of an 8-by-8-inch pan with ghee. Line pan with parchment paper so the paper hangs over two opposite sides of the pan. Mix together cocoa powder and sugar, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, mix together condensed milk and milk powder and add the ghee, to make khoya. Transfer pan to stovetop, add rose water and stir thoroughly with a wooden spoon to combine. Stirring constantly, cook the mixture on low heat (to avoid scorching) until it has a thick batter-like consistency, about 5 minutes. It will be quite stiff at first, but will become easier to stir as it heats."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour half the khoya into a medium, microwave-safe bowl and add the cocoa mixture, mixing until thoroughly incorporated. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the remainder of the khoya in the prepared pan and spread in an even layer. Let cool and refrigerate until firm, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat the reserved chocolate khoya in the microwave in 20 second intervals, stirring in between, until the consistency becomes spreadable again. (Alternatively, return the chocolate khoya to the stovetop and cook on low heat until mixture is hot throughout, stirring constantly, until the consistency becomes spreadable again.) Immediately pour the chocolate khoya on top of the white khoya, spreading it evenly to create two separate layers. Let the entire burfi cool and then refrigerate. Cut into small squares and serve at room temperature. The burfi can be refrigerated for up to 2 weeks."}], "link": "https://cooking.nytimes.com/recipes/1018246-chocolate-burfi"}