{"@context": "http://schema.org", "@type": "Recipe", "name": "Pommes Anna", "description": "It’s a marvel still, every time I make this dish, to recognize how the humble potato — the misshapen, dull brown dirty lump — can become this opulent, glistening, colossally elegant jewel with nothing more than attentive care, a sharp blade and good butter.  The potato slices want to bend and be supple but not be so thin as to be papery, else they will cook too quickly.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2017/01/01/magazine/01pommes-anna/01pommes-anna-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "", "recipeCuisine": "french", "recipeCategory": "", "keywords": "butter, potato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 389}, "recipeIngredient": ["3 large russet potatoes, washed but not peeled", "Butter", "Olive oil", "Kosher salt", "Well seasoned slope sided iron or non-stick pan, 8-10 inches wide. (An omelette pan is ideal.)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat large knob of butter with a healthy drizzle of olive oil over medium low heat until butter melts and just starts to foam. Shut off heat under pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp and stable Japanese mandolin — or the real French metal one if you’re lucky enough to have one — slice the potatoes into very thin but not paper-thin slices. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the slices tightly, careful shingling around the pan in concentric circles starting at the outer edge of the pan and working your way into the center.  Season the first layer with a little salt. Repeat with each potato until you achieve three tight and gorgeous layers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat back on under the pan at medium. Drizzle the potatoes with a generous pour of olive oil and dot a few more pats of butter around the pan of potatoes. Season with salt. As the pan starts to sizzle, you will see the fat bubbling up and spitting a bit. Put a lid on the pan and seal tightly for a minute or two, giving the potatoes a little steam bath, helping to soften and cook the flesh. Remove the lid and swirl the pan with a little muscle to see if the potatoes are binding together as their starch begins to heat up. If they slip loosely all around the pan, tuck the slices back into the tight circle using a heat-proof rubber spatula and allow to sizzle and cook longer uncovered.  Bump up the flame a little if the cooking sounds and looks listless — you want to hear sizzle.  When you start to smell the potatoes turning golden and crisp — like the smell of toast — swirl the pan again to confirm that the potato layers have formed a cake, and then flip the pommes Anna and cook on the other side also until golden and crispy. Slide onto serving plate or cutting board, season with salt, and cut into wedges."}], "link": "https://cooking.nytimes.com/recipes/1018518-pommes-anna"}