{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Confit With Roasted Potatoes and Parsley Salad", "description": "This recipe takes its name from the French technique for preserving food by salting it and cooking it for a long time in fat, as in your classic duck or goose confit. But it isn’t truly a confit — you won’t need gallons of fat. It’s more of a slow braise in olive oil scented with thyme and garlic. The chicken grows dense in the cooking, and deeply flavorful. (Have an immersion circulator? Just bag the chicken with a few tablespoons of olive oil, some salt, pepper, peeled garlic and a couple sprigs of thyme, then put it in the bath at 165 degrees for about four hours.) Pull the chicken from the oil when it’s done, and allow it to chill uncovered in the refrigerator until you’re ready to crisp it up in a hot pan while the potatoes roast unattended in the oven. For serving alongside, you discipline some parsley with a knife, and mix it with a salty, acidic mustard dressing that complements the bird.", "author": {"@type": "Person", "name": "Sam SIfton"}, "image": "https://static01.nyt.com/images/2017/02/12/magazine/12eat/12mag-12eat-t_CA0-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "chicken, potato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 237}, "recipeIngredient": ["2 chicken legs, thigh and drumstick together", "Kosher salt and freshly ground black pepper", "4 cups extra-virgin olive oil", "4 sprigs fresh thyme", "4 cloves garlic", "5-6 baby Yukon Gold potatoes or any “C”-size potato, red or yellow, halved", "1 bunch flat-leaf parsley leaves, rinsed, dried and roughly chopped", "1 shallot, peeled and thinly sliced", "2 tablespoons finely chopped Kalamata olives", "1 1/2 tablespoons lemon juice", "1 tablespoon whole-grain mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chicken confit. Heat oven to 250. Season the chicken legs with salt and pepper, and place in a pan just large enough to fit them comfortably. Add oil, thyme and garlic, place on stovetop over medium heat and cook until the oil just begins to bubble."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pan to oven, uncovered. Cook for 1 1/2 to 2 hours, until the meat is easily pierced with a thin-bladed knife. (Adjust oven temperature up or down to make sure oil is just bubbling.) Allow to cool, then remove chicken from oil and place on a plate. Place in refrigerator until ready to cook. Strain oil, and reserve, covered, in the refrigerator. Chicken can be cooked a few days ahead of use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the potatoes. Heat oven to 425. Place the potatoes in a roasting pan, and toss with 2 to 3 tablespoons of the reserved oil. Arrange the potatoes cut side down on the pan, and place in the oven, until golden and crisp, approximately 40 minutes to an hour. Remove from oven, and salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the chicken confit. Put 3 tablespoons of the reserved oil into a pan set over medium heat. When it shimmers, add the chicken, and cook, turning once or twice, until both sides are nicely crisp and brown, approximately 15 minutes. Serve hot or at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the parsley salad. Combine parsley leaves, shallots and olives in a medium-size bowl. In a small bowl, whisk together the lemon juice, 3 tablespoons of the reserved oil and the mustard. Season with salt and pepper to taste, then toss the parsley and the dressing together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a chicken leg and half of the potatoes and parsley salad on each plate."}], "link": "https://cooking.nytimes.com/recipes/1018578-chicken-confit-with-roasted-potatoes-and-parsley-salad"}