{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Arctic Char With Horseradish Crema", "description": "This recipe, from the chef Nick Anderer of Marta in Manhattan, pairs simply seasoned arctic char fillets (feel free to use salmon instead) with a bright, delicious crema with lemon and spicy horseradish. Make sure your grill grates are both clean and very hot before you put down the fish; that will help keep your fish from sticking. You'll also want a large grill spatula for flipping (not tongs) to get under the fish and help you carefully flip the fillets and keep them intact.", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2016/05/25/dining/25CHEF6/25CHEF6-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "arctic char, dijon mustard, horseradish, sour cream, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 107}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 578, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "2 grams", "proteinContent": "37 grams", "saturatedFatContent": "16 grams", "sodiumContent": "711 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 ounces fresh horseradish, peeled and coarsely grated (about 2/3 cup)", "1 1/2 cups sour cream", "1 tablespoon Dijon mustard", "2 tablespoons finely chopped chives", "2 tablespoons chopped fresh dill, plus more for garnish", "2 to 3 tablespoons freshly squeezed lemon juice, plus wedges for garnish", "Salt", "4 (6-ounce) arctic char fillets (or use salmon) ", "Olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the horseradish crema: Peel horseradish with a vegetable peeler and coarsely grate. Combine grated horseradish with sour cream, Dijon, chives and dill in a medium bowl and mix well. Season crema with lemon juice and salt to taste. (Crema can be made in advance; chill until you are ready to serve.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat grill to medium-high heat if you are using gas; if you have a charcoal grill, you want a nice hot bed of coals. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coat fish well with olive oil and season with salt. Set fish on the grill skin side down and cook, covered, until the flesh of the fish begins to turn opaque and the skin is crisp, 3 to 5 minutes. Use a grill spatula to carefully flip the fish and finish cooking to medium, about 2 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread horseradish crema on a serving platter or individual plates and place cooked fish on top with the skin side up. Garnish with dill and lemon wedges. Serve extra crema on the side."}], "link": "https://cooking.nytimes.com/recipes/1018127-grilled-arctic-char-with-horseradish-crema"}