{"@context": "http://schema.org", "@type": "Recipe", "name": "White Wine-Braised Rabbit With Mustard", "description": "This is a version of lapin à la moutarde, a homey, traditional French dish still popular in old-fashioned Parisian bistros at lunchtime. Yes, there are quite a few steps required to put this dish on the table, but probably no more than 30 minutes of active work. It is essentially a one-pot meal, with a little fiddling. The pleasingly sharp, succulent, saucy result is worth the extra effort. Get your rabbit in a butcher shop if possible, and ask to have it cut up; if your only option is a whole rabbit, it’s not much more difficult than cutting up a chicken. Serve with noodles if you'd like, or rice, mashed potatoes or steamed new potatoes.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/03/15/dining/15Kitchen1/15KITCH2-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner, lunch", "keywords": "main course, mustard, noodles, rabbit, white wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 146}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 882, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "5 grams", "proteinContent": "78 grams", "saturatedFatContent": "10 grams", "sodiumContent": "1707 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 small rabbit, about 3 pounds, cut into 6 to 8 pieces", "Salt and pepper", "3 tablespoons lard or vegetable oil", "1 cup all-purpose flour for dredging rabbit, plus 2 tablespoons for sauce", "1 large onion, diced (about 2 cups)", "1 cup dry white wine", "2 1/2 cups chicken broth", "1 tablespoon whole-grain mustard", "2 thyme branches", "12 sage leaves", "1/2 cup crème fraîche", "1 tablespoon Dijon mustard", "1 teaspoon chopped capers", "1/4 cup thinly sliced chives", "1 pound cooked pappardelle pasta or wide egg noodles, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay rabbit pieces on a baking sheet and season each piece generously with salt and pepper. (If you are using a pepper mill, adjust it for coarse grind.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Put a deep, heavy-bottomed, oven-safe saucepan or Dutch oven over medium-high heat and add lard or oil. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 1 cup flour on a wide plate. Dip seasoned rabbit pieces in flour and dust off excess. Gently set them in the hot oil in one layer without crowding; work in batches if necessary. Adjust heat to keep them from browning too quickly. Cook for about 3 to 4 minutes on each side until nicely browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove browned rabbit from pan and set aside. Add diced onion to fat remaining in pan. Keep heat brisk and cook onions until softened and lightly browned, stirring occasionally, about 5 to 6 minutes. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle onions with 2 tablespoons flour and stir until well incorporated, then cook for a minute or so, until mixture starts to smell toasty. Add wine and 1 cup broth, whisking as the sauce thickens. Whisk in remaining broth and the whole-grain mustard and bring to a simmer. Taste for salt and adjust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return browned rabbit pieces to the sauce. Add thyme and sage. Cover pot and bake for 45 minutes to 1 hour, until meat is fork tender. (Alternatively, simmer over low heat, covered, on the stove top, for about the same amount of time.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, remove rabbit pieces from sauce, set aside, and keep warm. Put saucepan over medium heat and bring contents to a simmer. Whisk in crème fraîche, Dijon mustard and capers and simmer until somewhat thickened, about 5 minutes. Taste sauce and adjust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer rabbit to a warmed serving bowl and ladle the sauce over. Sprinkle generously with chives and a little freshly ground pepper. Accompany with noodles if desired. "}], "link": "https://cooking.nytimes.com/recipes/1018651-white-wine-braised-rabbit-with-mustard"}