{"@context": "http://schema.org", "@type": "Recipe", "name": "Gonzalo Guzmán’s Pork-Braised Butter Beans With Eggs", "description": "Gonzalo Guzmán is the chef at Nopalito, a Mexican restaurant with two locations in San Francisco. His bright take on frijoles puercos, or pork and beans, is inspired by a version he once tasted in northern Mexico. It involves butter beans simmered with chile and onion until tender and plump, mixed up with crumbled chorizo and scrambled eggs. The result is a delicious, one-pot meal with a fresh garnish of cheese and herbs, and it makes for an ideal breakfast, lunch or dinner, ideally with a stack of warm tortillas on the side.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/05/28/magazine/28eat1/28eat1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "beans", "keywords": "bacon, butter beans, chorizo sausage, guajillo chiles", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 248}, "recipeIngredient": ["6 ounces (1 cup) dried butter beans", "1 white onion, halved", "3 cloves garlic, peeled", "1 dried guajillo chile", "1 teaspoon kosher salt", "1 tablespoon olive oil", "2 slices bacon, chopped", "1/2 teaspoon chile powder", "8 ounces Mexican chorizo, casings removed", "6 eggs", "Queso fresco, crumbled", "Cilantro leaves, chopped", "Spring onions, sliced", "1 pickled jalapeño, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, combine beans with 5 cups water, half the onion, the garlic and chile. Bring to a boil, then reduce to a simmer, and partly cover the pot with the lid. Cook until the beans are completely tender, 1 to 1 1/2 hours, adding more water if it reduces below the level of the beans. Fish out and discard the garlic, onion and chile; it’s fine if a few small pieces remain. Season with salt while the beans are hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the other half of the onion. Add oil to a large skillet over medium heat with the bacon, and sauté until the onion is soft and the bacon has rendered some fat, about 5 minutes. Add chile powder and chorizo, breaking up the sausage into small pieces with a spoon, until it’s cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break eggs into pork mixture, and stir to scramble. Once the eggs are cooked through, stir in the beans and bean cooking liquid, and simmer gently 5-10 minutes. Add a splash of water if needed, so some chile-stained broth bubbles just below the surface of the beans. Taste, and adjust seasoning with salt. Garnish generously with crumbled queso fresco, cilantro, spring onions and pickled jalapeño."}]}