{"@context": "http://schema.org", "@type": "Recipe", "name": "Chowder-Soaked Toast", "description": "This delicate and brothy clam chowder soaks into the toast — an elegant and light-handed way of adding tender — rather than floury, thick and pasty — body to the soup. Removing each clam as soon as it pops open during the steaming is a small effort with enormous yield: there's not one bite of pencil-eraser toughness throughout!", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2017/05/21/magazine/21eat1/21mag-21eat-t_CA0-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "clams, guanciale, potato, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 906, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "66 grams", "fiberContent": "4 grams", "proteinContent": "32 grams", "saturatedFatContent": "32 grams", "sodiumContent": "1349 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "1 onion, minced, scraps reserved", "2 ribs celery, minced, scraps reserved", "2 sprigs tarragon", "30 littleneck clams, rinsed and scrubbed", "6 ounces dry white wine", "6 ounces clam juice", "1/3 pound guanciale, sliced thin", "2 tablespoons canola oil", "2 leeks, dark, woody green parts removed, sliced into coins and washed well", "2 medium Yukon Gold potatoes, peeled, medium dice", "2 sprigs thyme, picked", "Salt and pepper", "3 cups heavy cream", "12 ounces chopped clams", "6 pieces of a dense rustic loaf, cut into thick 2-inch-by-2-inch squares"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the olive oil in a Dutch oven, and heat on medium-high for approximately 1 minute, until the oil starts to streak. Add onion scraps and celery scraps, tarragon and littleneck clams. Stir briefly to coat with oil, and barely soften, then add the wine. Reduce the wine by half, then add 3 ounces of clam juice. Cover, and allow clams to steam open, checking often so as to remove the clams as they open, until all are open and removed. Set clams aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the broth through a fine-mesh sieve lined with cheesecloth, and reserve the liquid. Remove all but 6 clams from the shell. Meanwhile, in a cast-iron or heavy-bottomed sauté pan, render the slices of guanciale in the canola oil until they are browned evenly on both sides. Reserve the fat and the guanciale."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the Dutch oven, heat the guanciale fat, and add onion, celery, leeks, potatoes and thyme, stirring to coat. Season with salt and pepper, and cook over low heat until the vegetables have just started to soften, taking care not to brown, about 5 minutes. Cover the vegetables with remaining clam juice, and simmer until potatoes are al dente."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the cream, and simmer until vegetables are cooked through, taking care not to boil. Add the chopped clams and the littlenecks, and season to taste with salt and ground black pepper. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the bread until golden, and place each piece in a bowl. Cover the toast with pieces of guanciale, and then add a ladleful of the chowder, about 6 ounces. Garnish with the remaining littleneck clams still in the shell."}]}