{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Chicken Thighs With Lemon, Thyme and Rosemary", "description": "The ease and deliciousness of this recipe, from the chef Nancy Silverton's cookbook \"Mozza at Home,\" deserves to be emphasized. Though you need several hours of refrigeration to allow the chicken skin to dry out, which makes it crisp, you can be flexible about it; do what’s convenient. No matter what, just be sure to pat the skin dry with paper towels. You may also find the final run under the broiler unnecessary. Use your judgment. And also consider swirling in a good splash of white wine or chicken stock to the juices in the baking dish before spooning them on the chicken. ", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/09/28/dining/28ENTERTAIN3/28ENTERTAIN3-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken thighs, garlic, lemon, rosemary, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1486}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 537, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "2 grams", "proteinContent": "39 grams", "saturatedFatContent": "10 grams", "sodiumContent": "628 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["12 chicken thighs, bone in and skin on", "1 medium onion, peeled, quartered vertically and sliced 1/4-inch thick vertically", "1 cup peeled garlic cloves (about 40)", "1 lemon cut in 1/4-inch-thick slices, seeded", "15 fresh thyme sprigs", "4 (3-inch) rosemary sprigs", "2 tablespoons kosher salt, or to taste", "2 teaspoons ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat chicken thighs dry and place, skin side up, in a single layer on a baking sheet. Place in refrigerator, uncovered, for 8 hours or overnight to dry skin. Remove chicken from refrigerator at least 45 minutes before cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 500 degrees. Spread onion slices and garlic cloves in a baking dish that can hold the chicken snugly in a single layer. Scatter lemon on the onion-garlic mixture and strew with thyme and rosemary sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken from baking sheet and place on several layers of paper towels, skin side down. Sprinkle with half the salt and pepper. Turn thighs over and season with remaining salt and pepper. Transfer to the baking dish skin side up. Use your hands to arrange the bed of onions and garlic so they’re completely under the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 40 to 50 minutes, until juices run clear when chicken is pierced with a knife point. If skin is not a deep golden brown and crispy, turn on broiler and broil chicken close to heat a few minutes to crisp and brown it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, move chicken off the bed of onions, garlic, lemon and herbs. Discard lemon and spoon the rest of the ingredients, along with pan juices, onto a serving platter. Place chicken on top and serve."}], "link": "https://cooking.nytimes.com/recipes/1018296-roasted-chicken-thighs-with-lemon-thyme-and-rosemary"}