{"@context": "http://schema.org", "@type": "Recipe", "name": "Peanut Butter Pie", "description": "Dead simple to make, this pie hits all the right notes. Sweet, nutty peanut butter mellows next to the tang of rich cream cheese and gets a lift from a little whipped cream. But if that doesn’t convince you, the chocolate cookie crust may. This version relies on five ingredients, instead of pre-made cookies, with the cocoa giving it a deep chocolate flavor. The crust is pressed into a well-buttered pie plate, baked, then cooled, ready to be filled and chilled. When it's time to serve, you have options: Finish it with a decorative chocolate topping or a puff of lightly sweetened whipped cream and a sprinkling of cocoa powder.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2017/03/08/dining/08COOKING-CHOC-PEANUT-BUTTER2/08COOKING-CHOC-PEANUT-BUTTER2-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "cream cheese, peanut butter, semisweet chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 358}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 634, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "5 grams", "proteinContent": "13 grams", "saturatedFatContent": "21 grams", "sodiumContent": "296 milligrams", "sugarContent": "34 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons/85 grams unsalted butter, melted, plus more for the pan", "3/4 cup/150 grams granulated sugar", "3/4 cup/75 grams unsweetened cocoa powder (not Dutch-processed)", "1/2 cup/60 grams all-purpose flour", "1/2 teaspoon kosher salt", "1 1/4 cups/300 milliliters heavy cream", "1 1/2 cup/405 grams smooth, sweetened peanut butter, like Jif or Skippy", "1 8-ounce/226 grams block full-fat cream cheese, at room temperature", "2/3 cup/133 grams light brown sugar", "1 teaspoon pure vanilla extract", "1/2 teaspoon kosher salt", "2 ounces/57 grams semisweet chocolate, chopped (optional)", "1 tablespoon/14 grams unsalted butter (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Heat the oven to 350 degrees. Have a nonstick standard 9-inch pie plate ready, or generously butter a 9-inch standard pie plate. In a medium bowl, whisk together the sugar, cocoa powder, flour and salt. Add butter, stirring and mashing with a fork, until the crumbs are evenly moistened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the crumbs to the prepared pan and press them evenly into the bottom and sides until crust is about 1/4-inch thick. Bake crust until it looks dry and set, 10 to 12 minutes. Transfer the pan to a rack to cool completely, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a large bowl, whip the cream to stiff peaks using an electric mixer at medium-high speed. Set aside. In another large bowl, beat the peanut butter, cream cheese, brown sugar, vanilla and salt on medium speed until fluffy, about 2 minutes. Use a large rubber spatula to gently fold the whipped cream into the peanut butter mixture. Transfer the mixture to the prepared pan and smooth the top. Chill uncovered for at least 4 to 6 hours, until filling is set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the topping, if using: In a microwave-safe bowl, melt the chocolate and the butter together in short bursts, stirring often. Transfer the chocolate mixture to a small plastic bag, and cut a 1/8-inch hole in one corner. Drizzle the chocolate over the top to make a decorative pattern. (You may have some left over depending on your taste.) Serve immediately."}]}