{"@context": "http://schema.org", "@type": "Recipe", "name": "Sabzi Polo (Persian Herbed Rice)", "description": "The star of this herb-flecked Persian-style rice recipe, by the actor and food blogger Naz Deravian, is the lavash tahdig — a crisp, buttery layer of toasted lavash flatbread at the bottom of the pot. Break it into pieces and use it to garnish the platter of rice, making sure everyone gets a piece. The rice itself is highly fragrant, scented with dill, mint and whatever other soft herbs you can get, along with heady saffron. You need to find thin flatbread to make this; the kind used for wraps is a good bet. It will take some time to clean all the herbs, but don't worry about taking off each leaf. Using tender stems and sprigs is perfectly fine.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/04/20/dining/20JPAPPE5/20JPAPPE5-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "middle eastern", "recipeCategory": "side dish", "keywords": "basil, basmati rice, fenugreek, herbs, lavash, mint, saffron, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 200}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 425, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "70 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "8 grams", "sodiumContent": "544 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cups white basmati rice", "Kosher salt, as needed", "10 cups packed mixed soft herbs, such as parsley, cilantro, dill, chives, tarragon and ramp greens", "1 1/2 cups packed mint leaves", "1/2 cup packed basil leaves (preferably lemon basil)", "5 stems of fresh fenugreek, leaves only (optional)", "8 tablespoons butter or ghee, more if needed", "1 teaspoon grapeseed or olive oil", "1/4 teaspoon saffron, plus a small pinch, ground with a mortar and pestle", "2 to 4 pieces thin lavash or other flatbread", "2 tablespoons dried dill", "2 stalks spring garlic (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large strainer, rinse the rice until the water runs clear, mixing it with your fingers as you rinse. Put the rinsed rice in a bowl and add 2 cups cold water and a handful of kosher salt (about 1/4 cup). Let sit for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor, combine herbs. Process, in batches if necessary, until coarsely chopped. (You should have about 6 cups; set aside 3/4 cup of the chopped herbs to use as garnish.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot bring 12 cups water and another handful salt (about 1/4 cup) to a boil. Drain rice and add to pot. Stir once very gently; return to a boil and cook until the grains are about halfway cooked (tender but with a firm spine), 3 to 5 minutes, skimming off any foam. Drain rice, give it a quick rinse with cold water, and spread it out on a platter or rimmed baking sheet until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl or pot, melt 4 tablespoons butter; reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonstick skillet with a cover, or shallow pot over low heat, melt remaining 4 tablespoons butter and add grapeseed oil.  Swirl the pan to make sure the melted butter covers the entire surface and sides of your skillet. If not, add more butter. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a small pinch saffron and large pinch salt to the butter and swirl around. Place lavash so it covers the bottom and halfway up the sides of the skillet in a single layer, overlapping only slightly where needed. (You can tear the lavash into pieces.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle a third of the rice over the lavash. If rice is clumpy, break apart with your fingers. Top with half of the chopped herbs. Sprinkle 1 tablespoon dried dill over fresh herbs. Repeat with another layer each of rice, herbs and dried dill, mounding layers in a pyramid-like shape. Top with final third of rice, and place spring garlic, if using, around the edges of the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the handle of a wooden spoon, poke several holes in the rice to allow the steam to escape. Pour reserved melted butter and 2 tablespoons hot water over rice. Cover and raise heat to medium. Cook for 10 minutes, or until steam is visible around the edges of the lid. (Don't go anywhere! The tahdig can burn very quickly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to medium-low. Lift lid and cover skillet with a clean kitchen towel. Return lid to skillet and cook for 10 minutes.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to very low. If you have a heat diffuser, place it under the skillet and cook for 20 to 30 minutes, or until rice is done and tahdig is golden brown. If you don’t have a diffuser, watch the pot carefully so the tahdig doesn’t burn. If you smell burning, turn the heat off and let the pot sit off the heat until rice is done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium bowl, combine 1/4 teaspoon saffron and 1 tablespoon hot water. When rice is done, set aside spring garlic; reserve. Gently transfer 1 cup rice to the saffron mixture, toss to color the rice yellow, and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste rice for doneness. If needed, gently stir in more salt. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon half of the green herb rice onto a serving platter, taking care to not disturb the tahdig at the bottom of the skillet. Add half the reserved fresh herbs. Repeat the layers of rice and herbs. Top with saffron rice and garnish with spring garlic. Lift out the tahdig, break into pieces and serve on the side."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1018064-sabzi-polo-persian-herbed-rice"}