{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken With Salsa Verde", "description": "Though there are a lot of ingredients in this recipe, it's a straightforward chicken saute-and-sauce combination. Brown the chicken -- dark meat is preferable -- then lightly brown the seeds, then soften the vegetables. The tomatillos, if canned, provide enough liquid; if you're using fresh tomatillos you might need to add a little water or stock, but not much. The chicken simmers in the sauce, and lime juice completes the picture. This is traditionally served with a host of garnishes, which I see as optional but fulfilling.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2008/03/12/dining/chicken-with-salsa-verde/chicken-with-salsa-verde-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 8 servings", "recipeCuisine": "", "recipeCategory": "poultry", "keywords": "chicken thigh, lard, poblano, serrano, tomatillo, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 52}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 352, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "5 grams", "proteinContent": "20 grams", "saturatedFatContent": "5 grams", "sodiumContent": "529 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons lard or neutral oil, like grapeseed or corn", "4 chicken leg-thigh pieces, each cut in two (or use 8 thighs)", "Salt and pepper", "1 1/2 cups pepitas (green squash seeds)", "1 large onion, chopped", "4 cloves garlic, chopped", "4 medium poblano or other mild green fresh chiles, diced, stemmed, seeded and chopped", "2 Serrano, jalapeño or other hot green fresh chiles, stemmed, seeded and minced, optional", "1 pound tomatillos (16 to 20), husked and rinsed (canned are O.K.; include their juices)", "1/2 cup chopped fresh cilantro", "1/4 cup chopped parsley", "1 tablespoon chopped fresh oregano or marjoram leaves", "Lime juice to taste", "Optional garnishes: diced avocado; sliced scallions, radishes, cabbage; lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put lard or oil in a large, deep skillet or casserole that can later be covered. Turn heat to medium-high and wait until lard melts or oil is hot. Add chicken, skin-side down. Season with salt and pepper and brown well, turning pieces as necessary, 10 to 15 minutes. Remove chicken; pour off excess fat from pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brown pepitas lightly in same pan over medium heat; remove with a slotted spoon. Add onion, garlic and chiles; cook until soft, stirring occasionally and seasoning with salt and pepper, about 10 minutes. Add tomatillos and their juices (if using fresh tomatillos, add about 1/2 cup stock or water). Stir, then reduce a bit over medium-high heat, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pepitas to pan, then add chicken. Cover and finish cooking, about 15 minutes, adding stock or water if necessary. Remove chicken. Finish sauce with herbs and lime. Serve with whatever garnishes you like."}], "link": "https://cooking.nytimes.com/recipes/1018624-chicken-with-salsa-verde"}