{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey Mole Verde", "description": "A few things may come to mind when thinking of mole: chocolate, long ingredient lists and even longer cooking directions. But mole verde is a bit of an exception. This version comes together in about an hour, combining a pumpkin-and-sesame-seed paste with a sauce built from tomatillos, chard, romaine and jalapeños. Cooked turkey simmers in sauce just long enough to pick up some of the green flavors. For balance, serve with white rice and corn tortillas.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2016/11/23/dining/23LEFTOVERS3/23LEFTOVERS3-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch", "keywords": "chard, jalapeño, pumpkin seeds, sesame seeds, tomatillo, turkey, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 99}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 462, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "6 grams", "proteinContent": "33 grams", "saturatedFatContent": "6 grams", "sodiumContent": "828 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup pumpkin seeds", "1/2 cup sesame seeds", "1 teaspoon ground cumin", "2 cups turkey or chicken stock, preferably homemade", "1/4 cup neutral-tasting oil (such as canola or grapeseed)", "1/2 medium yellow onion, peeled and cut into large pieces (about 1 cup)", "2 garlic cloves, peeled", "1 pound tomatillos, husks removed and halved", "4 green chard leaves, stems removed, roughly chopped", "5 romaine leaves, roughly chopped", "3 to 4 jalapeños, stemmed and cut into large pieces, to taste", "1 1/2 cups coarsely chopped cilantro leaves and tender stems (about 1 large bunch)", "2 teaspoons dried oregano", "4 cups shredded cooked turkey (about 1 pound), light and dark meat separated", "1 tablespoon kosher salt", "Steamed white rice, for serving", "Corn tortillas, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large skillet over medium heat. Add pumpkin seeds and toast, stirring constantly, until they swell, pop and turn a deep golden color, 3 to 4 minutes. Spread seeds out onto a baking sheet in a single layer to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place sesame seeds in heated pan, and return pan to medium heat. Toast, stirring constantly, until they turn a deep golden brown, 2 to 3 minutes. Spread them out alongside pumpkin seeds to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cool, place pumpkin and sesame seeds in the work bowl of a large blender (or food processor) and grind them into a fine powder. Transfer ground seeds to a medium bowl, add cumin and 1 cup turkey or chicken stock. Stir mixture to make a thick paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large Dutch oven or similar pot over medium heat, and add neutral oil. When oil shimmers, add seed paste and fry, stirring and scraping constantly, until paste is dry and deep golden in color, 6 to 7 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the blender or food processor, purée onion, garlic, tomatillos and 1/2 cup chicken stock until smooth. Add chard, romaine leaves, jalapeños, cilantro and oregano and purée again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return Dutch oven to medium heat, and transfer purée to the Dutch oven. Add in remaining 1/2 cup stock, shredded dark-meat turkey and salt and bring to a simmer, stirring from time to time. Simmer for 15 minutes, then add light-meat turkey and simmer 5 minutes more. Taste and adjust salt as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with steamed white rice and corn tortillas. Cover and refrigerate leftovers for up to 3 days, or freeze for up to 2 months."}]}