{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Garlicky Cuban Pork", "description": "This cumin-scented, garlic-laced pork is marinated with grapefruit, lime, and fresh oregano for a flavor that’s earthy and garlicky, yet bright from the citrus. The meat itself is as tender as can be, falling to shreds with the touch of a fork. Serve it over rice, or tuck it into tortillas along with some salsa and avocado to create tacos.\n\n<i>This is one of <a href=\"/68861692/7716592-melissa-clark-dinner-in-an-instant\">10 recipes</a> from Melissa Clark’s “Dinner in an Instant: 75 Modern Recipes for Your Pressure Cooker, Multicooker, and Instant Pot” (Clarkson Potter, 2017).</i>\n\n<i>Melissa Clark’s <a href=\"http://www.penguinrandomhouse.com/books/562277/dinner-in-an-instant-by-melissa-clark/9781524762964/\">“Dinner in an Instant”</a> is available everywhere books are sold. <a href=\"https://www.amazon.com/Dinner-Instant-Recipes-Pressure-Multicooker-ebook/dp/B06XK41BQV/?tag=NYTBks-20&ascsubtag=dinnerinstant\">Order your copy today.</a></i>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/09/25/dining/garlickycubanpork/garlickycubanpork-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "cuban", "recipeCategory": "dinner, cookbook exclusive, meat, one pot, roasts", "keywords": "cumin, grapefruit juice, lime juice, oregano, pork shoulder, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 815}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 415, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "1 gram", "proteinContent": "27 grams", "saturatedFatContent": "10 grams", "sodiumContent": "548 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["8 garlic cloves", "Juice of 1 grapefruit (about 2/3 cup)", "Finely grated zest and juice of 1 lime", "3 tablespoons extra-virgin olive oil", "2 tablespoons light brown sugar", "1 tablespoon fresh oregano leaves", "2 teaspoons ground cumin", "1 1/2 tablespoons kosher salt, plus more to taste", "1 4- to 5-pound boneless pork shoulder, cut into 4 pieces", "1 bay leaf", "Chopped fresh cilantro leaves, for serving", "Lime wedges, for serving", "Hot Sauce, for serving", "Tortillas, for serving (optional)", "Fresh tomato salsa, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender or mini food processor, combine the garlic, grapefruit juice, lime zest and juice, 2 tablespoons of the oil, brown sugar, oregano, cumin, and salt; process until blended. Transfer to a large bowl and add the pork and bay leaf; toss to combine. Marinate, covered, at room temperature for 1 hour (or refrigerate for up to 6 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the sauté function set on high if available, heat the remaining 1 tablespoon oil in the pressure cooker (or use a large skillet). Remove the pork from the marinade, reserving the marinade, and shake the meat to remove any excess liquid. Cook until it is browned on all sides, about 12 minutes (you will need to do this in batches, transferring the browned pork pieces to a plate as you go)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the pork is browned, return the pieces to the pot along with any juices from the plate. (If you used a skillet, add 1 tablespoon water and use a wooden spoon to scrape the skillet well to include all the browned bits stuck to the bottom.) Add the reserved marinade to the pot. Cover and cook on high pressure for 80 minutes. Let the pressure release naturally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pork from the cooking liquid (jus). Taste the jus, and if it seems bland or too thin, boil it down either in the pressure cooker on the sauté setting or in a separate pot on the stove until it thickens slightly and intensifies in flavor, 7 to 15 minutes. Remove the bay leaf and add a bit of salt if necessary. If you’d like to degrease the jus, use a fat separator to do so, or just let the jus settle and spoon the fat off the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shred the meat, using your hands or two forks. Toss the meat with the jus to taste (be generous—1 1/2 to 2 cups should do it), and serve with cilantro, lime wedges, and hot sauce."}], "link": "https://cooking.nytimes.com/recipes/1018851-pressure-cooker-garlicky-cuban-pork"}