{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Pot Spaghetti With Cherry Tomatoes and Kale", "description": "In this simple recipe, raw pasta and cherry tomatoes are simmered together in a single pan, cooking the pasta and forming a thick, starchy sauce at the same time. The efficient technique is internet famous, but this is the British cookbook author Anna Jones’s vegetarian take on the phenomenon, adapted from her book “A Modern Way to Cook.” The technique is easy to master and endlessly adaptable: When you add the kale, you could also toss in a couple of anchovies and a generous pinch of red-pepper flakes. When you season and top with cheese, you could add a pile of fresh chopped herbs, like mint, basil or oregano.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/12/20/dining/one-pot-spaghetti-tomatoes-kale-horizontal/merlin_147983214_857dc6d1-c441-4253-a9c8-3f2c31343fcd-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, quick, weekday, weeknight, pastas", "keywords": "cherry tomatoes, kale, spaghetti, spinach, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2455}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 697, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "99 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "9 grams", "proteinContent": "19 grams", "saturatedFatContent": "4 grams", "sodiumContent": "913 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 pound spaghetti", "1 pound cherry tomatoes, halved (about 2 pints)", "2 lemons, zested", "1/4 cup plus 3 tablespoons olive oil", "2 teaspoons kosher salt, plus more to taste", "1 bunch kale or spinach, leaves only, washed and chopped", "Black pepper", "Parmesan, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring just over a quart of water to a boil. Meanwhile, place spaghetti, tomatoes, lemon zest, oil and 2 teaspoons kosher salt in a large, dry, shallow pan. (The pan should be large enough that the dry spaghetti can lie flat.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully add the boiling water to the pan with the spaghetti. Cover pan, and bring up to a boil. Remove lid and simmer for about 6 minutes, using tongs to move the spaghetti around now and then so it doesn’t stick. Add kale or spinach and continue cooking until remaining liquid has reduced to a sauce and the pasta is cooked through. Taste, season with salt and pepper, and top with Parmesan."}], "link": "https://cooking.nytimes.com/recipes/1018322-one-pot-spaghetti-with-cherry-tomatoes-and-kale"}