{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Tenderloin Stuffed With Herb Pesto", "description": "Stuffed beef tenderloin is always an impressive main course. This one is summery, with a zesty, garlicky herb pesto, ideal for grilling over coals. It is delicious served at room temperature for an elegant summer buffet. Ask your butcher for a nice center-cut piece of tenderloin. If you aren’t comfortable with butterflying the meat yourself, ask the butcher to do that too, but it’s really not very difficult.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/06/14/dining/14KITCHEN1/14KITCHEN1-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, meat, roasts", "keywords": "basil, beef tenderloin, olives, parsley, pecorino romano, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 151}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 517, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "1 gram", "proteinContent": "40 grams", "saturatedFatContent": "15 grams", "sodiumContent": "564 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["3 pound center-cut beef tenderloin, trimmed of fat", "Salt and pepper", "2 cups Italian parsley leaves", "4 cups basil leaves", "4 garlic cloves, grated or finely minced", "1 cup pitted green olives", "1/2 cup extra-virgin olive oil, plus a little more for drizzling", "4 ounces grated pecorino romano (1 cup)", "1 teaspoon grated lemon zest", "1/2 teaspoon crushed red pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Position the meat on a cutting board so it is perpendicular to the board. With a sharp knife, make a 1-inch-deep incision along the length of the roast. Then use a sawing motion as you continue to cut, moving the knife down and to the left; with your fingers, begin to pry open the roast. Continue cutting, flattening the meat as you go to make a flat rectangular piece about 9 by 12 inches. (Don’t worry if it looks a bit ragged.) Lightly pound the meat with a mallet to make it evenly flat. Season meat on both sides with salt and pepper. Lay the meat on a baking sheet cut side up and refrigerate while you prepare the pesto."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pesto: Put parsley, basil, garlic and olives in a food processor or blender. Sprinkle lightly with salt and pepper. Pulse to roughly chop, then add oil and process to a coarse purée. Add cheese, lemon zest and crushed red pepper and pulse briefly to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread pesto evenly over the cut surface of the beef, leaving a 1-inch border at all edges. Roll up the meat like a jellyroll, with the seam on the bottom. Tie roll securely with butcher’s twine at 2-inch intervals along its length. Drizzle the surface of the roll with oil and rub with your hands to distribute. Leave meat at room temperature to season for at least 30 minutes. (Alternatively, wrap and refrigerate the roast for several hours or overnight. Return to room temperature before proceeding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Build a fire in a charcoal grill, leaving one side of the grill free of coals. Sear the roast on all sides directly over medium-hot coals. Move the roast off the coals and cook over indirect heat, turning occasionally, until an instant-read thermometer registers 125 degrees for medium-rare meat, about 30 minutes. (To prevent overcooking, begin checking after 20 minutes.) Let rest for at least 15 minutes before removing twine and carving into 1/2-inch slices. For easier slicing, let roast cool to room temperature."}], "link": "https://cooking.nytimes.com/recipes/1018792-beef-tenderloin-stuffed-with-herb-pesto"}