{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin Sheet Cake With Molasses Cream-Cheese Frosting", "description": "This simple, warmly spiced pumpkin cake is enough to feed a crowd, making it a perfect holiday treat. It's also relatively versatile: You can serve it in the pan for an easy presentation, or transfer it to a platter for something a little more refined. The frosting is just enough to coat the cake in a thin layer, but, if you want more, you may want to more for a generous coating. And, for a more subtly flavored frosting, substitute an equal amount of dark maple syrup for the molasses, or skip the molasses entirely for pure cream-cheese flavor.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2017/10/10/dining/10COOKING-PUMPKINCAKE1/10COOKING-PUMPKINCAKE1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "One 9x13-inch cake", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "cinnamon, ginger, molasses, pumpkin purée, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 519}, "recipeIngredient": ["1/2 cup/113 grams unsalted butter (1 stick), softened but cool, plus more for the pan", "2 cups/256 grams all-purpose flour, plus more for the pan", "1 teaspoon baking powder", "1 teaspoon baking soda", "3/4 teaspoon kosher salt", "2 teaspoons ginger", "2 teaspoons cinnamon", "1/4 teaspoon freshly grated nutmeg", "1/4 teaspoon ground cloves", "1 1/2 cups/330 grams light brown sugar, firmly packed", "1/4 cup/60 milliliters grapeseed or other neutral-flavored oil", "2 large eggs", "2 teaspoons vanilla extract", "1 (15-ounce/425-gram) can pumpkin purée", "1/2 cup/4 ounces/113 grams cream cheese, softened but cool", "1/4 cup/57 grams unsalted butter, softened but cool", "2 cups/226 grams confectioners' sugar, sifted", "1 tablespoon molasses", "1 teaspoon fresh lemon juice", "1/2 teaspoon vanilla extract", "Pinch kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Butter and flour a 9x13-inch baking pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the flour, baking powder, baking soda, salt and spices until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, combine the brown sugar, butter and grapeseed oil. Beat on medium-high until light and fluffy, about 3 minutes. Add the eggs one at a time, mixing for about 20 seconds between each. Add the vanilla extract and pumpkin purée and mix until well combined, scraping the bottom and sides of the bowl as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the mixer to low, and add the dry ingredients. Stir until a few spots of flour remain. Remove the bowl from the mixer, and use a rubber spatula to finish folding in the dry ingredients. The batter will be thick and fluffy, so make sure to scrape the bottom and sides of the bowl to ensure it is evenly mixed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan, smooth the top, and firmly tap the pan on the countertop a few times to release any large air bubbles. Bake the cake until golden and puffed, and a tester inserted into the center comes out clean, 25 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool the cake, still in the pan, on a rack for 15 minutes, then use the tip of a knife to loosen the edges and carefully invert it onto the rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the frosting: Add the cream cheese and butter to the bowl of a stand mixer fitted with the paddle attachment. Mix on medium-high until smooth. Turn the speed to low and slowly add the confectioner’s sugar, mix until the sugar is moistened, then turn the mixer up to medium-high and whip until smooth. Add the molasses, lemon juice, vanilla and pinch of salt, and whip until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Invert the cooled cake to a serving platter, frost and serve. Alternately, you can also frost and serve this cake in the pan it was baked in, if you’d rather not transfer it to a serving platter."}]}