{"@context": "http://schema.org", "@type": "Recipe", "name": "Eastern North Carolina Fish Stew", "description": "This quick-cooking fish stew, with its raft of eggs and no-stir preparation method, is specific to eastern North Carolina. Church fund-raisers and family gatherings center on the stew, where traditionally men would layer chunks of fish with bones and skin, thinly sliced potatoes, onions and spices in a caldron and stand around the fire watching it cook. About five minutes before it was done, someone would crack an egg for each guest into the tomato-rich broth. Eggs were a cheap filler and a way to stretch the stew to provide enough protein for a crowd, along with fish like striped bass or flounder from North Carolina’s Atlantic shore. Vivian Howard, who left New York to open Chef & the Farmer, a restaurant in Kinston, N.C., offers this version for home cooks. The key is not stirring it at all, and watching the heat so the bottom doesn’t scorch. Serve it with a couple of slices of squishy white bread (Sunbeam is traditional), which act as delicious sponges for the broth.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2017/01/18/dining/18HOWARD-slide-MD1K/18HOWARD-slide-MD1K-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "12 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, seafood, soups and stews", "keywords": "bacon, egg, fish steaks, potato, white bread, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 85}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 454, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "4 grams", "proteinContent": "34 grams", "saturatedFatContent": "7 grams", "sodiumContent": "928 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound sliced smoked bacon", "1 6-ounce can tomato paste", "3 pounds white or red potatoes, peeled and sliced into 1/4-inch rounds", "2 pounds yellow onions, peeled, halved and cut into 1/4-inch slices", "6 garlic cloves, thinly sliced", "3 pounds fish steaks (about 6 steaks) around 1-inch thick, with bones and skin intact (striped bass, salmon, red drum, rockfish or sheepshead are good options)", "2 1/2 tablespoons kosher salt, plus more to taste", "1 1/2 teaspoons chile flakes", "3 bay leaves", "12 eggs", "1 loaf white bread (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the bacon slices into 1-inch squares. Brown them in the bottom of a 10-to-12-quart stockpot over medium heat. Once bacon is crisp, remove it and reserve, leaving the bacon fat in the pot. Whisk the tomato paste into the fat, making sure you scrape up all the brown bits left from browning the bacon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat off and begin layering the ingredients in the stockpot. Start with a layer of potatoes, followed by a layer of onions and garlic, followed by a layer of fish. Top the fish with roughly a third of the salt, a third of the chile flakes and 1 bay leaf. Repeat this layering process two more times. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the pot with enough cool water to just barely reach the top of the fish. (If there’s a little fish peeking out over the top, that’s O.K. — better than if it’s swimming in water.) Cover the pot with a tightfitting lid and slowly bring to a boil over medium-high heat. (Throughout the cooking, resist the urge to stir.) Once it starts to boil, reduce heat and let it cook, covered, at a high simmer for about 15 minutes. Check the potatoes for doneness. They should be barely tender, not falling apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a large spoon to remove the fat from the surface of the soup, and discard. Taste the broth and add more salt if needed. Then, with the stew at a good simmer, add the eggs one by one in a single layer over the top. (Crack each egg into a small cup before dropping it in.) Cook the eggs for 5 minutes until they are lightly set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as the eggs are lightly set, use a large ladle to portion out the stew. A proper serving is at least half a fish steak, some potatoes, some onions and an egg swimming in broth. Shower each bowl with bacon, and serve immediately with a piece or two of bread, if desired."}], "link": "https://cooking.nytimes.com/recipes/1018542-eastern-north-carolina-fish-stew"}