{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan de Jamón (Venezuelan Ham Bread)", "description": "This recipe for the traditional Venezuelan Christmas bread comes from Martha Beltrán in Austin, Tex., who brought the recipe with her when she moved to the United States and now considers it essential to her family's Thanksgiving feast. Ms. Beltrán always starts the bread the day before she serves it, laminating it with butter three times before rolling it up with ham, bacon, olives and pimentos. The process can be long, but the dough can be left in the fridge for a flexible and forgiving amount of time, even overnight. When the finished loaves are sliced, each piece reveals a festive butter-slicked swirl.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2016/11/12/dining/COOKING-BREAD1/COOKING-VENEZUELAN1-articleLarge.jpg", "totalTime": "PT15H", "recipeYield": "12 to 14 servings (4 loaves)", "recipeCuisine": "south american", "recipeCategory": "breads, project", "keywords": "bacon, bread, ham, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 23}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 807, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "79 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "3 grams", "proteinContent": "19 grams", "saturatedFatContent": "23 grams", "sodiumContent": "1206 milligrams", "sugarContent": "20 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup/250 milliliters whole milk", "1/4 cup/50 grams plus 2 tablespoons granulated sugar", "1/2 ounce/14 grams/4 1/2 teaspoons instant yeast", "1 pound/454 grams salted butter (4 sticks), room temperature", "1/2 teaspoon salt", "7 eggs", "4 1/2 cups/509 grams self-rising flour", "3 1/3 cups/483 grams all-purpose flour, more for dusting surface", "1/2 pound/226 grams ham, thinly sliced and cut into long strips 1/2 inch wide", "18 ounces/509 grams smoked uncured bacon, cut into long 1/2-inch-wide strips (do not use thick cut)", "2 cups/288 grams raisins", "1/2 cup/85 grams pimento-stuffed green olives, thinly sliced", "1/4 cup/59 milliliters whole milk", "1 tablespoon sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the bread: In a small pot over medium-low heat, scald milk. When milk is near boiling and bubbles form around the edge of the pot, remove from heat and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine 1/2 cup warm water and 2 tablespoons sugar and mix well. Add yeast and let rest for 5 minutes or until bubbly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a stand mixer fitted with the whisk attachment, whisk together 3/4 cup (1 1/2 sticks) butter, the rest of the sugar and the salt on medium-low speed just to combine. With mixer running, add eggs, cooled scalded milk and yeast mixture. Mix on medium speed until thoroughly combined, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place flours in a medium bowl and whisk to combine. Change out the stand mixer attachment for a dough hook and slowly add flours to butter mixture about 1/2 cup at a time, until fully incorporated. The dough should pull away from the bowl's edges relatively cleanly. Let rest in bowl for about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle all-purpose flour on a clean work surface. Scrape out dough and knead for 5 minutes. If dough is too sticky to handle, add a little more flour, but do not let it get too dry. Cut dough into 2 pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll each piece of dough with heavy rolling pin into a 15-by-20-inch rectangle about 1/4 inch thick. Using a small offset spatula or butter knife, spread about 3 tablespoons butter in a thin layer over the top of the dough, just enough to cover."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold dough into thirds like a letter: With the short end of the dough facing you, fold up from the bottom, and then fold down from the top. Then, take the letter-shaped dough and fold one more time lengthwise, making a small square."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap each of the pieces in plastic or place each one in a plastic bag and let them rest in the refrigerator for about 4 hours. Repeat process of rolling, buttering, folding and refrigerating 2 more times with both pieces of dough. This will take a total of 12 hours, but additional chilling time between rollings is O.K., allowing you to break up the process overnight. (For instance, the first rolling can be done the night before, followed by subsequent rollings the next day.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove dough from refrigerator and divide each piece into 2 equal sections, for 4 pieces of dough in total. Lightly flour a clean work surface and roll one piece into a thin 15-by-20-inch rectangle, rewrapping in plastic and returning the other pieces to the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the bread: Working lengthwise, put down a stripe of ham strips in a single layer. Below that place a stripe of bacon strips and below that, a sparse stripe of raisins and olives. (Make sure to use a light hand with the raisins and olives.) Repeat this pattern until the surface of the dough is covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take one of the short edges of the dough, and carefully roll it up, like a jelly roll, tucking it in as you go to make sure it is tight. When it is fully rolled, tuck the open edges on either side underneath the roll, and place the whole roll seam-side down on a parchment-lined baking sheet so it doesn't pop open while baking. Repeat rolling-and-filling process with the other 3 pieces of dough. Place loaves on 2 baking sheets lined with parchment, 2 to a sheet. Cover loaves with a clean dish towel and let rise for 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Bake 2 loaves at a time for about 40 minutes, checking to make sure tops are becoming golden without burning. If loaves are browning too quickly, tent with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the glaze: While the bread bakes, add milk and sugar to a small bowl and stir to dissolve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At the 40-minute mark, pull the loaves out of the oven, and, using a pastry brush, glaze their tops. Bake for another 5 minutes, until the loaves have a slight sheen and are deep golden brown in color. Remove from oven and let bread rest for 10 minutes before slicing and serving."}], "link": "https://cooking.nytimes.com/recipes/1018409-pan-de-jamon-venezuelan-ham-bread"}