{"@context": "http://schema.org", "@type": "Recipe", "name": "Bits and Pieces Party Cheese Ball", "description": "The cheese ball is a stalwart of the Midwest cocktail party, where it can be fashioned from processed Cheddar cheese and port wine, or pineapple and cream cheese. This recipe relies on the leftover ends of good cheese or even just one kind of good-quality, sharp cheese like Gruyère. The idea of adding butter comes from Vivian Howard, the North Carolina chef who features a cheese ball with blue cheese, chopped dates and bacon in her cookbook \"Deep Run Roots.\" She calls hers a party magnet, and indeed, for all of the shade thrown at cheese balls, they are often the first thing to be eaten. They can be served with chutney, jam or simply alongside the best-quality crackers you can find.", "author": {"@type": "Person", "name": "KIm Severson"}, "image": "https://static01.nyt.com/images/2016/12/07/dining/07CHEESBALL1/07CHEESBALL1-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "1 12-ounce cheese ball, about 8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "easy, quick, snack, dips and spreads", "keywords": "appetizer, cream cheese, fish sauce, goat cheese, gruyère, pecan, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 424}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 174, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "0 grams", "proteinContent": "5 grams", "saturatedFatContent": "9 grams", "sodiumContent": "202 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons good-quality salted butter", "1 cup shredded sharp, flavorful cheese, in any combination that might include Gruyère, Cheddar or blue cheese", "3 ounces fresh goat cheese", "4 ounces cream cheese", "1 heaping tablespoon finely chopped scallions", "1/4 teaspoon cayenne", "1/4 teaspoon fish sauce", "1 tablespoon lemon juice", "1/3 cup chopped, salted roasted pecans", "1 heaping tablespoon chopped flat leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the butter and cheeses to come to room temperature. They should sit out of the refrigerator for at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put everything except the pecans and parsley in the bowl of a stand mixer fitted with the paddle attachment. Beat until smooth, scraping down the sides of the bowl once or twice. It should take about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Plop the mixture onto a piece of waxed paper and gently form into a ball. Place in the refrigerator for at least 15 minutes or until firm enough to work with."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the pecans and parsley together on a large plate or a cutting board, then roll the cheese ball in the mixture. Cover any surfaces with a sprinkling of the mixture and pat into the sides until you have an evenly coated ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap well in plastic wrap and refrigerate. When ready to serve, let the ball sit out for at least a half hour to soften. Serve with good plain crackers or small toasts."}]}