{"@context": "http://schema.org", "@type": "Recipe", "name": "Buckwheat Crepes With Asparagus, Ham and Gruyère", "description": "In Brittany, large buckwheat crepes are known as galettes and are filled with all sorts of savory ingredients. A classic one is made with ham and cheese. This scaled-down rendition adds sweet asparagus, which goes well with the nutty flavor of buckwheat flour. Traditionally they are served with a glass of sparkling cider. Have them as a first course or alongside fried eggs for a more substantial meal.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/04/20/dining/20KITCHEN4/20KITCHEN4-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "brunch, pancakes", "keywords": "asparagus, buckwheat flour, buttermilk, Gruyère, ham, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 115}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 449, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "5 grams", "proteinContent": "29 grams", "saturatedFatContent": "13 grams", "sodiumContent": "854 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup/120 grams buckwheat flour", "1/2 cup/60 grams all-purpose flour", "2 eggs", "2 1/2 cups buttermilk", "1/2 teaspoon salt, plus more as needed", "2 tablespoons butter, plus more for pan", "1 1/2 pounds medium asparagus, trimmed and bottom parts peeled, if desired", "6 cooked ham slices", "2 cups grated Gruyère or Comté cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the batter: Whisk together flours, eggs, buttermilk and salt until well combined. Put the batter in the fridge for at least 2 hours or, preferably, overnight. If necessary, thin batter with a little more buttermilk or water, to the consistency of heavy cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a crepe pan or well-seasoned cast iron skillet, about 8 inches in diameter, over medium-high heat. Use a piece of paper towel to rub a little butter in the pan, then quickly ladle in about 1/4 cup of batter. Swirl the pan to spread the batter all the way to the perimeter. Let crepe brown on one side for a minute or so, until crisp. Flip it over with a spatula (or carefully with your fingers) and cook one minute more. Don’t worry about browning the second side. Adjust heat if crepe browns too quickly; the pan needn’t be scorching hot. Remove from heat if crepe is cooking too quickly. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the crepe from the pan and set it aside while you continue to make 5 more. Stack crepes on top of each other as they are finished. (Crepes may be made in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of generously salted water to a boil. Cook the asparagus for 2 minutes, or just until it is firm-tender, then drain and spread on a clean kitchen towel to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Fill the crepes by laying each one top-side down, place a slice of ham on top, sprinkle generously with cheese, and lay 3 asparagus spears on top, off to one side. Fold over to make a half-moon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the filled crepes in one layer on a baking sheet. Drizzle with a little melted butter, then bake until they are crisp and the cheese is melted, about 5 to 7 minutes. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1018065-buckwheat-crepes-with-asparagus-ham-and-gruyere"}