{"@context": "http://schema.org", "@type": "Recipe", "name": "Marinated Beet Salad With Whipped Goat Cheese", "description": "It's easy to make a pretty good beet salad, but this one makes the leap into greatness. After decades of kitchen experiments, the chef and beet maven Andrew Carmellini shared how to elevate both elements: marinate the beets, then season and whip the goat cheese. Feel free to cook the beets on a grill instead of in the oven if you've got a fire going. Young beets, juicy and tender enough to bite into, can be used instead of the thick-skinned, mature kind. But do not roast: Steam them just until tender.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/08/23/dining/23beet1/23beet1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings, vegetables", "keywords": "appetizer, side dish, beets, goat cheese, herb leaves, shallots, sweet vinegar, white wine vinegar, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 589}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 165, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "369 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["8 to 10 medium-large beets (see note)", "2 tablespoons minced shallots", "3 tablespoons olive oil, plus more to taste", "2 tablespoons rich, sweet vinegar like Barolo, balsamic or sherry", "Salt and ground black pepper", "1/4 cup shelled nuts, like pistachios, walnuts or pecans (optional)", "1 cup loosely packed whole herb leaves (like parsley, mint or cilantro) or 2 cups small salad greens (like baby spinach, baby arugula or mâche), or use a mixture or herbs and greens", "1/4 cup fresh goat cheese", "1 tablespoon olive oil", "2 tablespoons whole milk or heavy cream", "1/2 teaspoon rice or white wine vinegar, plus more to taste", "1/2 teaspoon coarsely ground black pepper", "1/4 teaspoon salt, more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the beets: Place a rack in the center of the oven and heat to 400 degrees. Place a sheet pan underneath to catch any drips from the beets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the greens, tops and stems from the beets. Wash thoroughly and wrap in aluminum foil packages, about 4 beets per package. Place the packages directly on the oven rack and bake until beets are easily pierced by a fork or knife, 45 minutes to 1 hour depending on size. (No need to unwrap the beets to test them.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large bowl, combine shallots, oil, vinegar and a lavish sprinkling of salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove beets from oven and carefully open packages to let the steam escape. Let cool at least 20 minutes, or up to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unwrap beets and use a peeler or your fingers to remove any tough skin. Dice beets neatly into bite-size pieces. Add to bowl with shallot mixture, mix well and let marinate in the refrigerator for at least 30 minutes or up to 8 hours. Stir occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a toaster oven or 350-degree oven, toast nuts until golden, about 5 minutes. If unsalted, sprinkle with salt. Let cool, then coarsely chop."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the goat cheese: In a bowl, mix or whisk all ingredients together until smooth. Keep whipping until cheese is fluffy and soft. Taste and season with additional vinegar and salt. Refrigerate until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, pile beets on a serving platter or individual plates. Spoon remaining dressing over the top. Spoon dollops of goat cheese mixture on and around the beets, then tuck in herbs and/or greens. Sprinkle with nuts and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1018904-marinated-beet-salad-with-whipped-goat-cheese"}