{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Delicata Squash with Peanut, Sesame and Squash Seed Dukkah", "description": "Steven Satterfield, an Atlanta chef with a deep love for green peanut oil, developed this recipe for a coming book on goobers from Short Stack Editions. Green peanuts are nothing more than raw peanuts. They have a fresh, vegetal flavor, and retain their greenness when cold-pressed into oil. Mr. Satterfield's spin on the Egyptian condiment called dukkah centers on peanuts and benne seeds (the preferred term in the South for sesame seeds), two regulars in many Southern kitchens. The spice and nut mixture brings life to delicata squash, whose tender skin doesn’t need peeling. You can substitute olive oil for the green oil when roasting the squash, and the dukkah will keep in an airtight container in the pantry for a month. Pull it out to sprinkle over greens, meat, fish or grilled bread.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2016/11/02/dining/02PEANUTSJP5/02PEANUTSJP5-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "southern", "recipeCategory": "vegetables", "keywords": "appetizer, delicata squash, green peanut oil, peanut, sesame seeds", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 30}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 324, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "4 grams", "sodiumContent": "429 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["2 medium or 3 small delicata squash (about 2 1/2 pounds total)", "2 teaspoons kosher salt", "6 tablespoons green peanut oil", "1/2 cup sesame seeds, toasted", "1/2 cup plain, dry-roasted peanuts", "1 tablespoon ground coriander", "1 tablespoon ground cumin", "1 tablespoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Position racks in the upper and lower thirds of the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the squash in a large bowl and rinse well, then rub vigorously with a kitchen towel to remove any traces of dirt in the crevices. Transfer to a cutting board and cut each squash in half crosswise, leaving the skin on. Place each half cut-side down, and carefully slice in half lengthwise. Scrape the seeds and surrounding flesh into a medium bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the squash quarters into 1/2-inch cubes. In a large bowl, toss the cubes with 1 teaspoon of the salt and 4 tablespoons of the peanut oil. Add the remaining peanut oil to the bowl of squash seeds and toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two baking sheets with parchment paper or silicone mats. Arrange the squash cubes in a single layer on one of the sheets; on the other, arrange the squash seeds and press firmly into a single layer, making sure to mash the pockets of squash flesh as flat as possible. Place the cubed squash on the lower rack of oven, and the seeds on the upper rack. Start checking after about 20 minutes. but it can take up to a half-hour for the squash to become tender, the seeds to turn lightly brown and the surrounding flesh to dry. Remove both pans from oven and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, combine the roasted squash seeds, sesame seeds, peanuts, coriander, cumin, black pepper and the remaining teaspoon of salt. Process until the mixture resembles coarse cornmeal. Transfer the dukkah to a small bowl. When ready to serve, reheat the squash until hot all the way through, 7 to 10 minutes. Toss the hot squash with 4 to 6 tablespoons of the dukkah and serve."}]}