{"@context": "http://schema.org", "@type": "Recipe", "name": "Mini Almond Cakes With Chocolate or Cherry", "description": "These moist, rich almond cakes are miniature versions of a classic flourless almond torte, embellished here with either chocolate ganache or cherry jam. The bittersweet chocolate filling is a bit more sophisticated, while the cherry jam is sweetly crowd-pleasing. Or you can split the difference and make six of each. These gluten-free treats are best eaten within eight hours of baking so plan to make them the same day as serving. You can use either natural or blanched almond flour; the blanched will give you a slightly more delicate texture.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/02/08/dining/08APPE2/08APPE2-mediumThreeByTwo440.jpg", "totalTime": "PT50M", "recipeYield": "12 cupcakes", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "almond flour, bittersweet chocolate, cherry jam, cream, dessert, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 407}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 153, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "4 grams", "sodiumContent": "94 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/3 cup/80 milliliters heavy cream (optional)", "3 ounces/85 grams bittersweet chocolate, finely chopped (optional)", "6 tablespoons/85 grams melted unsalted butter, cooled, plus more for muffin tin", "3/4 cup/85 grams almond flour or meal", "3/4 cup/94 grams confectioners’ sugar", "1/4 teaspoon fine sea salt", "2 large eggs", "Few drops almond extract (optional)", "3 tablespoons/24 grams cornstarch", "1 1/4 teaspoons/4 grams baking powder", "2 large egg whites", "2 tablespoons/25 grams granulated sugar", "1/4 cup/60 milliliters cherry jam (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chocolate ganache, if using: In a heavy-bottomed saucepan, heat cream until bubbling (or place the cream in a glass measuring cup and heat it in the microwave). Remove from heat, add chocolate and let sit for 1 minute, then stir until smooth. Transfer chocolate to a small container (preferably metal) and freeze until firm, at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop and roll into 3/4-inch balls. Note that the ganache is very soft and can be messy to handle, but getting perfectly round balls isn’t necessary. Place in refrigerator until needed. Ganache balls can be prepared up to 1 week ahead."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Butter a muffin tin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a food processor or blender, mix almond flour, confectioners’ sugar and salt until powdery, about 30 seconds. Add eggs and almond extract and process until smooth, 30 seconds longer. Pulse in butter, cornstarch and baking powder. Scrape mixture into a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a beaters or an electric mixer, whip egg whites until very foamy. Gradually add granulated sugar while beating eggs until stiff peaks form."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spatula, gently and carefully fold a third of the egg whites into almond mixture to lighten it. Then, fold in the rest of the whites just until no streaks remain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon batter into prepared muffin tins, and bake for 10 minutes. Remove from oven. Pull balls of ganache from refrigerator, if using, and place 1 ball in center of each cake, pushing it down halfway into batter. Or spoon 1 teaspoon cherry jam on top of each cake; do not push down. Return to oven and bake until light brown and a toothpick inserted into cake (and not the chocolate or cherry) comes out clean, another 8 to 10 minutes. Serve warm or at room temperature, preferably within 8 hours of baking."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Almond Cakes With Chocolate or Cherry", "description": "Mini gluten-free cakes filled with bittersweet chocolate ganache or cherry jam are a sophisticated alternative to the classic cupcake.", "thumbnailUrl": "https://static01.nyt.com/images/2017/02/08/dining/08APPE2/08APPE2-mediumThreeByTwo440.jpg", "uploadDate": "2017-02-03T20:29:40.000Z", "duration": "PT3M8S"}, "link": "https://cooking.nytimes.com/recipes/1018568-mini-almond-cakes-with-chocolate-or-cherry"}