{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate-Cherry Sourdough Bread", "description": "This recipe for sourdough bread comes from Francisco Migoya and Nathan Myhrvold, who wrote \"Modernist Bread\" (The Cooking Lab, 2017). It requires an <a href=\"https://cooking.nytimes.com/recipes/1013152-sourdough-starter\">active sourdough starter</a> and plenty of time (about 20 hours) to allow the dough to develop and proof, though very little of that time is hands-on. Rich with tart dried cherries and dark chocolate chips, and gently bitter from the coffee and cocoa powder, the complex, tangy bread is somewhere between sweet and savory, ideal as is or spread with a little salted butter. Since the dough is dark to begin with, use a thermometer to test if it's done, and make sure you allow it to cool completely before slicing it open.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/01/12/dining/sourdoughcherry/sourdoughcherry-articleLarge.jpg", "totalTime": "PT21H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "breads, project", "keywords": "bread flour, dark chocolate chips, dried cherries, sourdough starter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 161}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 325, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "247 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 heaped teaspoon/8 grams instant dry yeast", "3/4 cup/185 grams warm water", "1 cup plus 1 tablespoon/230 grams liquid sourdough starter (<a href=\"https://cooking.nytimes.com/recipes/1013152-sourdough-starter\">see recipe</a>)", "1 2/3 cups/225 grams bread flour, plus extra for dusting", "1/4 cup/30 grams cocoa powder", "1 tablespoon/15 grams espresso or very strongly brewed coffee", "1 1/8 teaspoon/7 grams fine salt", "Canola oil (or other neutral oil), for greasing", "1 cup/160 grams dark chocolate chips", "1 generous cup/160 grams dried cherries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide mixing bowl, whisk together the yeast and water and allow the yeast to bloom, about 1 minute. Whisk the sourdough starter into the mixture until dissolved, then add the flour, cocoa powder and coffee. Use a dough scraper to stir the ingredients into a shaggy mass. Cover with plastic wrap and set aside for 20 minutes, then add the salt, incorporating it well. Transfer to a lightly oiled plastic container and cover with plastic wrap; it will be sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rest dough for 30 minutes, then lightly oil hands to fold: Pull one edge of the dough up and press it down into the center of the ball; repeat with the 3 other edges of the dough, then cover dough. In 30 minutes, repeat the folding, this time incorporating the chocolate chips and cherries. Repeat the folding every half-hour, for a total of 6 folds. Check for gluten development: Pinch a piece of dough between your fingers and stretch it. It should stretch out to a thin, transparent membrane before tearing. If not, repeat folding and check again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the bread out onto a lightly floured surface and use hands to gently tuck the edges up toward the center of the dough, then flip the dough over so it’s seam-side down, and gently round with your hands. Cover with plastic wrap and rest dough for 20 minutes, then tuck edges down toward the seam, to shape dough into a tighter ball. Cover with plastic wrap and rest for 10 minutes. Transfer to a flour-dusted wicker breadbasket, seam side up, pinching the seam shut if necessary. Wrap basket with plastic wrap, or slide the basket into a clean plastic bag, closing it. Proof at about 55 degrees, or in the refrigerator, for 14 to 16 hours, until dough has increased in size, and springs back slightly to the touch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to bake, remove the dough from the refrigerator and transfer it, smooth side up, to a large cast-iron pot (with a lid) lined with a round of parchment paper. Be careful not to over-handle dough and lose air bubbles. Cover and bring to room temperature for 1 to 2 hours. Position a baking rack in the center of the oven and heat to 500 degrees. Using a razor or fine, sharp knife blade, score a cross on the top of dough, making a fast, clean cut about 1/8- to 1/4-inch deep."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake covered for 33 minutes. Remove lid and bake for another 10 minutes, cracking open the oven door for the last 5 minutes. Push a thermometer into the bread dough; it should read 195 to 200 degrees for cooked bread. Transfer bread to a cooling rack, carefully remove the paper, and allow to cool completely at room temperature before cutting open."}], "link": "https://cooking.nytimes.com/recipes/1018955-chocolate-cherry-sourdough-bread"}