{"@context": "http://schema.org", "@type": "Recipe", "name": "Barbecued Red Onion Chutney", "description": "You'll need a medium-hot charcoal fire for this recipe. So either start cooking when the main dish comes off the fire or, if making this dish separately, light a charcoal fire in your grill, putting all the coals on one side, and wait until it has died down to medium. Serve this smoky chutney alongside pork or beef.", "author": {"@type": "Person", "name": "John Willoughby and Chris Schlesinger"}, "image": "https://static01.nyt.com/images/2016/05/25/dining/25PANTRY5/25PANTRY5-articleLarge.jpg", "totalTime": "PT2H25M", "recipeYield": "About 2 cups", "recipeCuisine": "", "recipeCategory": "condiments", "keywords": "brown sugar, cider vinegar, onion, fall, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 22}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 226, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "4 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "73 milligrams", "sugarContent": "25 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 large red onions, peeled and cut into half-inch circles", "Vegetable oil for coating", "1 tablespoon plus 1/2 cup brown sugar", "1 tablespoon chile powder", "1 tablespoon cumin powder", "1 tablespoon curry powder", "2 tablespoons extra-virgin olive oil", "1/2 cup cider vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Coat onions lightly with oil. Mix together 1 tablespoon each brown sugar, chile powder, cumin and curry powder and rub onion circles all over with the mixture. (If you have metal skewers, thread two onion circles horizontally onto each skewer first, then coat with oil and seasoning.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place onions on grill over coals and cook until cut sides are golden brown streaked with black, 3 to 4 minutes per side. Move to side or back of grill where temperature is low and cook, flipping once or twice, until onions are soft enough to yield easily when squeezed with tongs, at least 15 and up to 40 minutes, removing smaller onions from grill as they become cooked to this stage. Remove from grill and, if not using immediately, refrigerate, covered, until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make chutney, roughly chop onions. Heat olive oil in large sauté pan over medium heat until shimmering. Add onions and cook until very soft, about 5 to 10 minutes. Add remaining 1/2 cup brown sugar and the cider vinegar, bring to a simmer and cook 10 minutes, until slightly thickened. This chutney keeps, covered and refrigerated, about 1 week."}]}