{"@context": "http://schema.org", "@type": "Recipe", "name": "Easter Egg Nest Cake", "description": "It is, I hope, the acceptable face of culinary cute: a chocolaty flourless cake that falls on cooling. The sides crack, forming the outside of the nest, and into the cake's sunken cavity you spread a soft, voluptuous mixture of whipped cream and melted chocolate. And on top of this you drop small, sugar-coated candy Easter eggs.\nIt's ease itself — especially as you can make the cake the day before, and given that the cracks and crevices are part of its charm, you don't need to be filled with perfectionist angst. And if not complying with the traditions of this holiday, you can fill the crater instead with cream whipped with a teaspoon of vanilla, and dust the top, cappuccino-style, with some cocoa pushed through a strainer.\nI've used both bittersweet and semisweet chocolate in this cake. Either way it works, either way it seduces. It has the denseness of a chocolate cake, but the lightness of a mousse. Even those who customarily push dessert away, smugly claiming not to eat sweets, will be coming back for second helpings.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2017/03/28/dining/28COOKING-EASTER-EGGCAKE/28COOKING-EASTER-EGGCAKE-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "candy, chocolate, heavy cream, dessert, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 296}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 602, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "3 grams", "proteinContent": "11 grams", "saturatedFatContent": "24 grams", "sodiumContent": "114 milligrams", "sugarContent": "48 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 tablespoons/114 grams (1 stick) unsalted butter, cut into pieces, softened", "8 ounces/226 grams chocolate, melted", "6 large eggs: 2 whole; 4 separated", "1/2 cup/113 grams plus 1/3 cup/75 grams superfine sugar", "1 teaspoon vanilla extract", "1 cup/240 milliliters heavy cream", "1 teaspoon vanilla extract", "4 ounces/113 grams chocolate, melted and cooled", "Approximately 1 cup small candy eggs like robin's eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line the bottom of a 9-inch springform cake pan with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the cake: Stir butter into chocolate, reheating mixture to incorporate butter if needed, and let cool. In a medium bowl, whisk 4 egg whites until foamy. Gradually add 1/2 cup sugar and whisk until whites hold their shape but are not too stiff. Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk 2 whole eggs and 4 egg yolks with 1/3 cup of sugar and vanilla until combined. Stir in chocolate to mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In three additions, fold whites into chocolate mixture. Pour into prepared pan and bake for 35 to 40 minutes, or until cake rises, cracks and center is no longer wobbly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool cake on a wire rack; middle will sink and the sides will crack. Carefully remove cake from pan and place it on serving plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For icing, whip cream with vanilla until it is firm but not stiff. Fold in melted chocolate. Fill top of cake with icing, easing it out gently toward edges. Arrange Easter eggs on top. "}], "link": "https://cooking.nytimes.com/recipes/1018669-easter-egg-nest-cake"}