{"@context": "http://schema.org", "@type": "Recipe", "name": "Feta-and-Herb Phyllo Tart", "description": "Kathy Tsaples, the author of the cookbook “Sweet Greek Life: My Shared Table,” inspired this savory tart. The quality of phyllo dough varies hugely from one brand to another. It’s particularly important here to get a good-quality phyllo as there is so much of it. This is a sort of quiche with a twist, with the phyllo both acting as a casing and adding the extra crispness you get from blind baking. It’s a meal in itself, served with a simple salad. If you don’t have a tart pan handy, use a 9-inch cake pan.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2017/05/10/dining/10BAKING1/10BAKING1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "greek", "recipeCategory": "brunch, dinner, lunch, pies and tarts", "keywords": "feta, mint, parsley, pecorino romano, phyllo, tarragon, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 174}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 290, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "1 gram", "proteinContent": "9 grams", "saturatedFatContent": "12 grams", "sodiumContent": "358 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 sheets of thin 16-by-12-inch/40-by-30-centimeter phyllo pastry (about 200 grams)", "3 tablespoons/45 grams unsalted butter, melted", "1 scant cup/100 grams finely crumbled feta (3 1/2 ounces/100 grams)", "2 lightly packed cups/50 grams finely grated pecorino Romano (1 1/2 ounces/45 grams)", "2 tablespoons/5 grams roughly chopped parsley", "2 tablespoons/5 grams roughly chopped tarragon leaves", "2 tablespoons/5 grams roughly chopped mint leaves", "4 eggs", "3/4 cup/180 milliliters heavy cream (double cream)", "1/2 cup/120 milliliters whole milk", "Salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees Fahrenheit/200 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush one of the phyllo sheets lightly with melted butter and place, butter side-up, in a 9-inch/25-centimeter round tart pan. Press the pastry into the corners and then brush another sheet of phyllo in the same way, pressing it into the pan at a 45-degree angle to the first sheet. Continue twice more (using 4 sheets total), covering the base and sides of the pan with a uniformly thick layer of phyllo. Trim the overhanging pastry, but not completely, leaving 1/2-inch/1 centimeter of phyllo over the edges of the tart. Set both the pan and pastry scraps aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take another sheet of phyllo (unbuttered this time) and position the long side in front of you. Fold the bottom edge up to form a fold 1 inch/3 centimeters wide. Continue folding the pastry in alternating directions (as if you were making a concertina fan) until you end up with 1 long pleated strip. Repeat with the remaining sheets of pastry in the same way. (If the pastry breaks or tears, pat it back into place and continue as if the torn pieces were still connected.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Starting from the middle of the tart tin, coil 1 folded strip from the middle outwards to start forming a rough snail, spreading the strips roughly 1/4 inch/1/2 to 1 centimeter apart. (You want visible gaps between the phyllo strips, so you can fill them with chunks of feta and the custard.) Meet the end of the pastry with the second strip and continue the snail in the same way until the 4 sheets have been used. You may still have some space around the edge, which you can fill with the scrap trimmings, folding them in the same way as best you can."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the pastry carefully with remaining butter and set any pastry coils upright if they’ve fallen over. Place tart pan on a baking sheet and bake for 15 to 18 minutes, until the pastry is a dark golden brown. Remove from oven and set aside to cool for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, mix feta, pecorino and herbs until blended and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate medium bowl, whisk together eggs, cream and milk with 1/2 teaspoon salt and a good grind of pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently press cheese and herbs in between the gaps of the phyllo pastry, being careful not to break the pastry base. Pour the custard over evenly, drizzling in just a little at a time and allowing it to soak evenly into all the gaps in the pastry. Bake for 25 to 28 minutes, until the custard has set and the cheese has browned. Remove from the oven and serve warm, cut into slices."}], "link": "https://cooking.nytimes.com/recipes/1018750-feta-and-herb-phyllo-tart"}