{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Osso Buco", "description": "This classic dish of veal shanks braised in wine and tomatoes is a masterpiece of northern Italian cooking. Be sure to provide small spoons (espresso spoons work well) so people can scoop the marrow out of the bones, then eat the marrow sprinkled with salt and some of the gremolata.\n\n\n<i>This is one of <a href=\"/68861692/7716592-melissa-clark-dinner-in-an-instant\">10 recipes</a> from Melissa Clark’s “Dinner in an Instant: 75 Modern Recipes for Your Pressure Cooker, Multicooker, and Instant Pot” (Clarkson Potter, 2017).</i>\n\n<i>Melissa Clark’s <a href=\"http://www.penguinrandomhouse.com/books/562277/dinner-in-an-instant-by-melissa-clark/9781524762964/\">“Dinner in an Instant”</a> is available everywhere books are sold. <a href=\"https://www.amazon.com/Dinner-Instant-Recipes-Pressure-Multicooker-ebook/dp/B06XK41BQV/?tag=NYTBks-20&ascsubtag=dinnerinstant\">Order your copy today.</a></i>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/09/25/dining/pressurecookerossobuco/pressurecookerossobuco-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, cookbook exclusive, meat, one pot", "keywords": "main course, rosemary, thyme, tomato paste, veal shank", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 398}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 407, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "4 grams", "proteinContent": "42 grams", "saturatedFatContent": "6 grams", "sodiumContent": "885 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["All-purpose flour, for dredging", "4 sprigs fresh thyme", "2 sprigs fresh rosemary", "1 bay leaf", "2 1/2 to 3 pounds (4 pieces) osso buco (bone-in veal shanks), patted dry with a paper towel", "2 teaspoons kosher salt", "Freshly ground black pepper", "3 tablespoons extra-virgin olive oil", "2 tablespoons unsalted butter", "1 onion, diced into 1/4-inch pieces", "2 medium carrots, diced into 1/4-inch pieces", "1 celery stalk, diced into 1/4-inch pieces", "4 garlic cloves, thinly sliced", "1/2 teaspoon tomato paste", "1/2 cup dry white wine", "1/2 cup chicken or beef stock, preferably homemade", "1 14.5-ounce can diced tomatoes, drained", "1/4 cup finely chopped fresh parsley", "Finely grated zest of 1/2 lemon", "2 garlic cloves, minced", "Pinch of kosher salt, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread flour in a shallow bowl or plate. Tie the thyme sprigs, rosemary sprigs, and bay leaf together with kitchen twine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the veal with the salt and pepper to taste, and then dredge it in the flour to coat all sides. Using the sauté function on high if available, heat the oil in the pressure cooker. Add the osso buco in batches (do not crowd the pot), and brown it well on all sides, 5 to 7 minutes per side. Altogether this will take 20 to 30 minutes to get the pieces nicely golden all over. Transfer the osso buco pieces to a plate as they brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the sauté function down to medium if available, or unplug the pot for a minute to let it cool down slightly. Add the butter to the pressure cooker and let it melt; then stir in the onion, carrots, and celery. Cook until the vegetables are very soft, about 8 minutes. Stir in the garlic and tomato paste, and cook until the garlic is fragrant and the tomato paste has darkened, another 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wine to the pot to deglaze it, scraping up any browned bits from the bottom. Stir in the stock and tomatoes and bring to a simmer. Nestle the osso buco pieces into the pot, then top with the herb bundle. Cover and cook on high pressure for 40 minutes. Let the pressure release naturally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the osso buco to a plate and, using the sauté function, simmer the sauce, stirring it often, until it is thick and reduced, 10 to 15 minutes. Let the sauce settle for at least 10 minutes, and then spoon any excess fat off the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sauce is settling, make the gremolata: In a small bowl, stir together the parsley, lemon zest, garlic, and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, transfer the osso buco to a serving platter, spoon the sauce over the top, and sprinkle with the gremolata, with more on the side."}]}