{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggplant Ravaiya", "description": "Ravaiya is the name of this traditional Gujarati dish, where whole small vegetables like okra, potatoes or the baby eggplant used here — ringan is the Gujarati term for eggplant — are stuffed with a chunky spice paste, a complexly flavored mixture of crushed peanuts, chiles, ginger and spices. As the eggplant cooks, that melts into a rich, nutty sauce, and the result is a remarkably full-flavored vegetarian meal in under an hour. You can serve this dish with basmati rice, or with Indian flatbreads like roti or paratha, the latter of which you can find frozen in some supermarkets and heat on your stovetop.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2017/08/16/dining/16TROPICALJp6/16TROPICALJp6-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, vegetables", "keywords": "chile powder, cumin, eggplant, peanut, gluten-free, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 133}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 382, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "15 grams", "proteinContent": "13 grams", "saturatedFatContent": "3 grams", "sodiumContent": "967 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup roasted peanuts", "1 tablespoon kosher salt", "1 tablespoon jaggery (unrefined cane sugar), or cane or turbinado sugar", "1 tablespoon ground coriander", "1 teaspoon ground cumin", "1 teaspoon Kashmiri chile powder or 1/2 teaspoon ground cayenne pepper", "1/2 teaspoon ground turmeric", "1/2 teaspoon minced garlic", "1/2 teaspoon minced ginger", "1/2 teaspoon minced Serrano chile (if you like less heat, you can remove the seeds and pith)", "Pinch asafetida (optional)", "1 teaspoon chickpea flour", "2 tablespoons olive oil", "8 baby eggplants (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put all ingredients except for the olive oil and eggplants in a food processor, and pulse until the peanuts are ground. Add oil and pulse to combine; the mixture will resemble damp sand. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut a crosshatch in the bottom of the eggplant about three-quarters of the way up the fruit, leaving the stem intact. (In other words, you’re making a deep plus-sign shape in the bulbous part of the fruit, so you can stuff it with the peanut filling.) Repeat with the remaining eggplants."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stuff each eggplant with a little of the peanut mixture, just enough to fill the hole. You should have some peanut mixture left over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the stuffed eggplants on their sides in a single layer on the bottom of a large pot or saucepan with a lid. The eggplants can overlap a little, but ideally they will all fit on the bottom of the pot. Dollop the leftover peanut mixture on top of and around the eggplants, and add 1 cup of water. Turn heat to medium and cover the pot. Let the eggplant cook at a simmer, adjusting the heat as necessary, for about 20 to 25 minutes, or until the eggplants are just tender when you poke them at the stem end with the tip of a knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the sauce for salt, and serve hot with basmati rice or Indian flatbreads."}], "link": "https://cooking.nytimes.com/recipes/1018887-eggplant-ravaiya"}