{"@context": "http://schema.org", "@type": "Recipe", "name": "Clam-Chowder Pizza", "description": "The clam pizza is thought to have been born in New Haven at Frank Pepe Pizzeria Napoletana, in the middle of the last century, and has since made its way south to New York City. My recipe honors no one particular preparation but does pay homage to the clam pan roasts of the Grand Central Oyster Bar. It uses as sauce the building blocks of a classic clam chowder — alliums slowly fried with bacon, then infused with clam juice and wine, reduced to a glaze and thickened with cream — and tops it with chopped clams, lemon zest and a spray of hot pepper flakes. This makes for a heavy pie. If you’re having a hard time moving it around on the pizza peel before baking, place a sheet of parchment paper beneath the dough, which will help when you slide the pie to the hot surface of the baking stone in the oven.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/01/15/magazine/15eat-1/15eat-1-articleLarge-v2.gif", "totalTime": "PT1H15M", "recipeYield": "4 to 8 servings", "recipeCuisine": "", "recipeCategory": "pizza and calzones", "keywords": "bacon, clams, cream, leek, mozzarella, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 208}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 415, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "2 grams", "proteinContent": "14 grams", "saturatedFatContent": "10 grams", "sodiumContent": "665 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 medium-size quahog clams, usually rated “top neck” or “cherrystone,” rinsed", "1 1/2 cups dry white wine", "1 tablespoon unsalted butter", "1/4 pound slab bacon, diced", "2 leeks, tops removed, halved and cleaned, then thinly sliced into half moons", "3 cloves garlic, peeled and minced", "3 tablespoons parsley, roughly chopped", "1/2 cup heavy cream", "Freshly ground black pepper, to taste", "1 9-to-10-ounce ball pizza dough, <a href=\"https://cooking.nytimes.com/recipes/1016230-robertas-pizza-dough\">ideally homemade</a> (about 260 grams)", "2 3/4 ounces fresh mozzarella, roughly torn", "1 teaspoon lemon zest", "Calabrian or other red-pepper flakes, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a pizza stone or tiles on the middle rack of your oven, and turn heat to its highest setting. Let it heat for at least an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the clams in a large, heavy Dutch oven, add about 2 cups of water and 3/4 cup of the wine, then set over medium-high heat. Cover, and cook until clams have opened, approximately 10 to 15 minutes. (Clams that fail to open after 15 to 20 minutes should be discarded.) Strain clam broth through a sieve lined with cheesecloth or doubled-up paper towels, and set aside. Remove clams from shells, chop roughly and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse out the pot, and return it to the stove. Add butter, and turn heat to medium low. Add bacon, and cook, stirring occasionally, until the fat has rendered and the bacon has started to brown, approximately 5 to 7 minutes. Use a slotted spoon to remove bacon from fat, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the leeks to the fat, and cook, stirring frequently, for about 5 minutes, then add the garlic and half of the parsley. Continue cooking and stirring until the leeks are soft but not brown, about 5 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the remaining wine and approximately 1 cup of the reserved clam stock (save the rest for another use), and continue cooking until the liquids have reduced almost to syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cream and black pepper. Let the mixture come to a bare simmer, then allow to reduce and thicken, then add reserved clams and remove from heat. (You can do all this the day before you make the pizza, then refrigerate until ready to use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pizza. Lightly flour a work surface, and stretch or roll the dough into a 12-inch round. Place on a lightly floured pizza peel or rimless baking sheet. Using a pastry brush or a spoon, lightly paint the surface of the dough with some of the cream from the clams, leaving a half-inch border all around. Then top the pizza with the chopped clams, bacon and leeks, and the cheese. (If there is any remaining liquid, you can lightly – lightly! – drizzle the pie with it.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shake the pizza peel slightly to make sure the dough is not sticking. (Gently lift any sections that are sticking, and sprinkle the peel with flour.) Carefully slide the pizza directly onto the baking stone in one quick, forward-and-back motion. Cook until the crust has browned on the bottom and the top is bubbling and browning in spots, about 7 minutes. Sprinkle with the remaining parsley, the lemon zest and red-pepper flakes to taste, then serve."}], "link": "https://cooking.nytimes.com/recipes/1018543-clam-chowder-pizza"}