{"@context": "http://schema.org", "@type": "Recipe", "name": "Persian Tamarind Fish", "description": "In this complexly flavored and highly sophisticated dish from the cookbook author Louisa Shafia, tamarind, caramelized onion, ground almonds and barberries are made into a thick and tangy paste that gets spread over fish fillets before baking. Thinner fillets work better here than thick, center-cut pieces. You want more surface area on which to spread the herbal barberry mixture, which can be made a day ahead and stored in the fridge. If you can't find dried barberries, use dried cranberries instead.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/04/20/dining/20JPAPPE4/20JPAPPE4-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "middle eastern", "recipeCategory": "", "keywords": "almond, barberries, bass, dried cranberries, herbs, mackerel, salmon, tamarind, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 248}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 584, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "3 grams", "proteinContent": "44 grams", "saturatedFatContent": "7 grams", "sodiumContent": "604 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup dried barberries or cranberries", "8 (6- to 8-ounce) striped bass, mackerel or salmon fillets, 1/2 to 3/4 inches thick", "Fine sea salt, to taste", "Ground black pepper, to taste", "3 tablespoons olive oil, plus more for brushing and drizzling over fish", "1 large Spanish onion, halved stem to root, peeled and thinly sliced", "3 garlic cloves, minced or grated on a Microplane", "3/4 cup whole raw almonds, coarsely ground", "2 to 3 tablespoons tamarind paste or concentrate", "1 cup tightly packed minced soft fresh herbs, plus more for serving (use at least three of the following: cilantro, parsley, tarragon, basil, mint, chives)", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the barberries in a bowl and cover with warm water. Let soak for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse fish under cold water and pat dry. Season generously with salt and pepper on both sides, brush all over with oil, and place fillets on a baking sheet. Refrigerate until ready to use, up to 2 hours uncovered, or up to 24 hours covered with plastic wrap."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons oil in a large skillet over medium-high heat. Add onions and cook until they start to darken at the edges, 7 to 10 minutes. Reduce heat to low and cook until dark brown and reduced to half the original volume, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic, almonds, drained barberries and 2 tablespoons tamarind to pan. (If using cranberries instead of barberries, add an additional tablespoon of tamarind.) Cook over medium heat until fragrant, 5 minutes. Stir in herbs, and salt and pepper to taste. Transfer to a bowl and cool to room temperature. Meanwhile, heat oven to 375 degrees. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press barberry mixture on top of fillets. Drizzle with more oil and bake until fish is just cooked through, 10 to 15 minutes. Transfer to a serving platter. Top with any barberry mixture that fell off the fish, sprinkle with more fresh herbs, and serve with lime wedges."}]}