{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Fresh Pasta Dough", "description": "Fresh pasta isn't something to master in one go. It takes time and practice, but it yields dividends. This particular recipe is vastly versatile. It can be made into <a href=\"https://cooking.nytimes.com/recipes/1018706-whole-wheat-fettuccine-with-spicy-broccoli-rabe\">whole grain pasta,</a> by swapping in 1 cup sifted whole wheat, spelt or farro flour in place of 1 cup all-purpose or 00 flour. Add more egg yolks or water as needed and rest the dough for 1 hour. Or try a green pasta, as in <a href=\"https://cooking.nytimes.com/recipes/1018704-ravioli-verdi-with-butter-parmesan-and-pepper\">this ravioli verdi</a>: Steam or sauté 6 ounces baby spinach (about 6 cups) until just wilted. Spread it out on a parchment-lined baking sheet, and, when cool, squeeze water out thoroughly, a handful at a time, then chop roughly. Purée with 2 eggs and 1 egg yolk, then use this mixture in place of eggs in the recipe. Or, for something a little different, make an herbed pasta, <a href=\"https://cooking.nytimes.com/recipes/1018705-herbed-pappardelle-with-parsley-and-garlic\">like this pappardelle,</a> by stirring in 1/2 cup finely chopped parsley, chives, chervil, tarragon, or basil in any combination to the eggs before adding to the flour in the main recipe.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2017/04/07/dining/07PASTAGUIDE5/07PASTAGUIDE5-mediumThreeByTwo440.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings for cut pasta, 6 to 8 servings for stuffed pasta", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, pastas", "keywords": "eggs, flour, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 326}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 197, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "28 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups 00 or all-purpose flour", "2 large eggs", "3 egg yolks, plus more as needed", "Semolina flour, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mound the flour in the center of a large, wide mixing bowl. Dig a well in the center of the mound and add eggs and yolks. Using a fork, beat together the eggs and begin to incorporate the flour, starting with the inner rim of the well. The dough will start to come together in a shaggy mass when about half of the flour is incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use your fingers to continue to mix the dough. Press any loose bits of flour into the mass of dough. If needed, add another egg yolk or a tablespoon of water to absorb all of the flour. Once the dough comes together into a cohesive mass, remove it from the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a lightly floured surface and knead by hand for 4 to 5 more minutes until the dough is smooth, elastic and uniform in color. Wrap the dough in plastic and set aside for at least 30 minutes (and up to 4 hours) at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line three baking sheets with parchment paper and lightly dust with semolina flour. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut off a quarter of the dough. Rewrap rest, and set aside. Use the heel of your hand to flatten the dough into an oval approximately the same width as your pasta machine, about six inches. Set the rollers to their widest setting and pass the dough through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the dough out onto a lightly floured cutting board or countertop and neatly press together into halves, so it’s again about the same width of the pasta machine. Feed the pasta through again at the widest setting. Think of these first rollings as an extended kneading. Continue to fold the dough in thirds and roll it until it is smooth, silky and even-textured. Do your best to make the sheet the full width of the machine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the dough is silky and smooth, you can begin to roll it out more thinly. Roll it once through each of the next two or three settings, adding flour as needed, until the dough is about 1/4-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the pasta is about 1/4-inch thick, begin rolling it twice through each setting. As you roll, lightly sprinkle all-purpose or 00 flour on both sides of the pasta to prevent it from sticking to itself."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out pasta until you can just see the outline of your hand when you hold it under a sheet, about 1/16-inch thick for noodles, or 1/32-inch thick for a filled pasta. (On most machines, you won’t make it to the thinnest setting.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut pasta into sheets, about 12 to 14 inches long. Dust the sheets lightly with semolina flour and stack on one of the prepared baking sheets and cover with a clean, lightly dampened kitchen towel. Repeat with remaining dough."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Basic Pasta Dough", "description": "How to make pasta dough from scratch.", "thumbnailUrl": "https://static01.nyt.com/images/2017/04/07/dining/07PASTAGUIDE5/07PASTAGUIDE5-mediumThreeByTwo440.jpg", "uploadDate": "2017-04-05T15:12:57.000Z", "duration": "PT2M48S"}, "link": "https://cooking.nytimes.com/recipes/1018702-basic-fresh-pasta-dough"}