{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Bourguignon", "description": "Like coq au vin, its sister dish from the Burgundy region of France, beef Bourguignon is a stew of meat slowly simmered in hearty red wine along with pearl onions, mushrooms and crisp, cubed bacon. Use a good wine here, something simple but drinkable. It makes all the difference in the finished dish. As with all beef stews, this one is best made a day or two ahead; don’t sauté the mushrooms and onions until just before serving. This recipe is part of <a href=\"https://cooking.nytimes.com/new-essentials-french-cooking\">The New Essentials of French Cooking</a>, a guide to definitive dishes every modern cook should master. <a href=\"https://store.nytimes.com/products/new-essentials-of-french-cooking\">Buy the book.</a>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/01/13/dining/13COOKING-BEEFBOURGUIGNON/13COOKING-BEEFBOURGUIGNON-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "dinner, roasts, soups and stews", "keywords": "bacon, cremini, pancetta, pearl onion, stewing beef, wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1226}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 666, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "6 grams", "proteinContent": "57 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1075 milligrams", "sugarContent": "15 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 pounds beef chuck or other boneless stewing beef, cut into 2-inch cubes and patted dry", "2 1/4 teaspoons kosher salt, more to taste", "1/2 teaspoon freshly ground black pepper", "5 ounces lardons, pancetta or bacon, diced (about 1 1/4 cups)", "1 onion, finely chopped", "1 large carrot, sliced", "2 garlic cloves, minced", "1 teaspoon tomato paste", "2 tablespoons all-purpose flour", "1 750-milliliter bottle of red wine", "1 large bay leaf", "1 large sprig of thyme", "8 ounces pearl onions, peeled (about 12 to 15 onions)", "8 ounces cremini mushrooms, halved if large (about 4 cups)", "1 tablespoon extra-virgin olive oil", "Pinch sugar", "Chopped flat-leaf parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season beef with 2 teaspoons salt and 1/2 teaspoon pepper. Set aside for at least 30 minutes at room temperature, or chill in the refrigerator for up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven or heavy-bottomed pot with a tightfitting lid, cook lardons over medium-low heat until fat is rendered and lardons are browned and crisp, about 10 to 15 minutes. Transfer with a slotted spoon to a paper towel-lined plate. Reserve fat in pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Raise heat under pot to medium-high and cook until fat is starting to smoke. Lay half the beef cubes in a single layer in the pot, leaving space between pieces. Cook until well browned on all sides, 10 to 15 minutes; transfer pieces to a plate as they brown. Repeat with remaining beef."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat, if necessary, to prevent burning. Stir in onion, carrot and remaining 1/4 teaspoon salt and cook until soft, about 10 minutes, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in garlic and tomato paste, and cook for 1 minute. Stir in flour, cook for 1 minute, then add wine, bay leaf and thyme, scraping up brown bits at bottom of pot. Add browned beef and half the cooked lardons back to pot, cover, and transfer to oven. Let cook until beef is very tender, about 1 1/2 hours, turning meat halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large skillet set over high heat, combine pearl onions, mushrooms, 1/4 cup water, the olive oil and a pinch each of salt, pepper and sugar. Bring to a simmer, then cover and reduce heat to medium, cooking for 15 minutes. Uncover, raise heat to high, and cook, tossing frequently, until vegetables are well browned, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, scatter onions and mushrooms and remaining cooked lardons over stew, then top with parsley."}], "link": "https://cooking.nytimes.com/recipes/1018528-beef-bourguignon"}