{"@context": "http://schema.org", "@type": "Recipe", "name": "Fragrant Thai-Style Clams in Coconut Broth", "description": "The classic, highly aromatic Thai seasoning for seafood includes lemongrass, galangal, lime leaf, hot pepper and coconut milk. Spicy and refreshing, the bright-tasting broth is a mix of sweet, salty, sour and herbaceous. You may substitute mussels or prawns for the clams.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/11/30/dining/30KITCH1/30KITCH1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 main course or 4 appetizer servings", "recipeCuisine": "thai", "recipeCategory": "quick, seafood, soups and stews", "keywords": "appetizer, main course, chicken broth, clams, coconut oil, fish sauce, galangal, ginger, kaffir lime leaves, lemongrass", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 136}, "recipeIngredient": ["1 tablespoon coconut oil", "1 red onion, peeled, halved and sliced into 1/4-inch half-moons", "2 cups chicken broth", "1 stalk lemongrass, pale bottom part only, smashed and cut in thick diagonal slices", "3 slices galangal, 1/4 inch thick (see note)", "3 slices ginger, 1/4 inch thick", "3 or 4 small hot Thai chiles, thinly sliced", "4 makrut lime leaves (kaffir leaves), torn", "1 tablespoon palm sugar or brown sugar", "1 tablespoon fish sauce", "1 cup coconut milk", "Salt, to taste", "2 pounds small clams", "1 cup roughly chopped cilantro, leaves and tender stems", "1/2 cup thinly sliced scallions, white and tender green parts", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat coconut oil in a heavy-bottomed soup pot over medium-high heat. Add onions and cook until softened, about 5 minutes. Add chicken broth and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add lemongrass, galangal, ginger, chiles, lime leaves, sugar and fish sauce. Simmer for 20 minutes. Add coconut milk, then taste broth for salt and adjust. (You may prepare up to this point 1 to 2 hours in advance and leave at room temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring mixture to a boil over high heat and add clams. Cover and cook for 5 to 8 minutes, stirring once or twice, until all clams have opened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer clams to soup bowls. Strain broth if desired and ladle over clams. Sprinkle with cilantro and scallions. Squeeze lime over each bowl and serve with lime wedges."}], "link": "https://cooking.nytimes.com/recipes/1018444-fragrant-thai-style-clams-in-coconut-broth"}