{"@context": "http://schema.org", "@type": "Recipe", "name": "German Chocolate Cake", "description": "German chocolate cake is an American classic, named after a chocolatier called Samuel German (as opposed to the European nation). Milder than devil’s food cake, this chocolate cake has layers that are subtle and sweet, chocolatey but not excessively so. They create a lovely, velvet-textured vehicle for the heaps of gooey, toasted coconut and pecan custard. For more chocolate appeal, rich ganache can be slathered on the sides. This not only adds another blissful layer of chocolate, but also neatens up the look and makes for a party-worthy presentation.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2017/01/17/dining/17COOKING-GERMAN-CHOC-CAKE2/17COOKING-GERMAN-CHOC-CAKE2-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "coconut, coffee, pecan, semisweet chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 306}, "recipeIngredient": ["1 1/2 sticks/171 grams unsalted butter (12 tablespoons), at room temperature, plus more for the pans", "1 3/4 cups/254 grams all-purpose flour", "1/2 cup/50 grams Dutch-process cocoa powder", "1/2 teaspoon baking powder", "1/2 teaspoon baking soda", "3/4 teaspoon kosher salt", "1 1/2 cups/300 grams granulated sugar", "3 large eggs, at room temperature", "1 1/2 teaspoons vanilla extract", "4 ounces/113.5 grams semisweet chocolate, melted and cooled slightly", "1/2 cup/120 milliliters brewed coffee, cooled to room temperature", "1/2 cup/114 grams plain whole milk yogurt or sour cream, at room temperature", "2 cups/7 ounces/198 grams sweetened shredded coconut", "2 cups/227 grams pecan halves", "1 12-ounce can/354 milliliters evaporated milk", "5 large egg yolks, at room temperature", "3/4 cup/150 grams light brown sugar", "1/2 teaspoon kosher salt", "4 tablespoons/57 grams unsalted butter, cut into 4 pieces, at room temperature", "1 teaspoon vanilla extract", "3/4 cup/180 milliliters heavy cream", "6 ounces/170 grams semisweet chocolate, chopped", "Pinch kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cake: Heat oven to 350 degrees. Butter three 8-inch round cake pans. Line the pans with parchment and butter the parchment. In a medium bowl, sift together flour, cocoa powder, baking powder, baking soda and salt, and whisk to combine well. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, beat butter and sugar on medium-high until light and fluffy, about 3 minutes. Scrape down the sides and bottom of bowl. Turn the mixer down to medium and add the eggs, one at a time, beating well after each addition, again scraping down the bowl as necessary. Beat in vanilla and melted chocolate until smooth. In a small bowl, combine coffee and yogurt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer on low, add half the flour mixture to the butter mixture, and mix to combine. Add the coffee mixture and mix to combine. Then add the remaining flour mixture, scraping the bowl one more time to make sure everything has been combined. Divide the batter between the prepared pans, smooth the tops and bake until a toothpick inserted into the center comes out clean, 20 to 25 minutes. Transfer cakes in the pans to a rack to cool for 5 minutes. Run a knife around the edges to loosen the cakes and invert them onto racks to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the filling: On two separate trays lined with parchment paper, toast coconut and pecans at 325 degrees, stirring occasionally, until coconut is deep golden brown and nuts are fragrant, about 5 to 10 minutes. Watch carefully — coconut and nuts can quickly turn from golden to burned. Remove from oven, roughly chop the pecans, and transfer both coconut and pecans to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, cook evaporated milk, egg yolks, brown sugar and salt over medium heat, whisking at first and then stirring constantly, until the mixture has thickened enough to leave a line on the back of a wooden spoon, 5 to 7 minutes. Be careful not to let the mixture curdle. Lower the heat as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and add the butter, stirring until it has melted. Add vanilla and stir to combine. Add the milk mixture to the coconut and pecans, stirring to combine. This mixture will thicken slightly as it cools."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the cake, set one layer on a serving plate. Top with 1/3 of the coconut mixture. Repeat two more times, so the top of the cake is covered in coconut."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If desired, finish with ganache: Heat heavy cream over medium heat until very hot. Place the chocolate in a medium bowl, and pour the hot cream over the chocolate. Let stand 5 minutes. Add salt and whisk until smooth. Let this mixture stand at room temperature, stirring occasionally, until it is thick enough to spread around the sides of the cake."}], "link": "https://cooking.nytimes.com/recipes/1018497-german-chocolate-cake"}