{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggplant Caponata", "description": "Caponata became part of Sicilian cooking centuries ago, when the island was under Arab rule. The Arabs brought eggplants and sugar, along with citrus and spices. Other versions of caponata contain raisins and pine nuts; this one has capers and green olives. Some cooks add a lot of tomato, but I prefer just a touch of good tomato paste. The seasoning is sweet, sour and salty, and laced with olive oil. Like pickles and other savory preserves, caponata is often made in quantity and stored in jars for use throughout the year. Serve it on little toasts as an appetizer or to accompany a meal.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/07/05/dining/05KITCHEN3/05KITCHEN3-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 or more servings", "recipeCuisine": "italian", "recipeCategory": "dips and spreads, vegetables", "keywords": "appetizer, side dish, capers, celery, eggplant, olives, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 236}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 147, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "5 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "583 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["Extra-virgin olive oil", "3 or 4 small eggplants (about 2 pounds), peeled and cut into 1-inch cubes", "Salt and pepper", "1 onion, chopped", "4 small celery stalks, chopped (about 1 cup), blanched for 1 minute in boiling salted water, then cooled", "1 tablespoon tomato paste", "2 tablespoons capers, rinsed", "1 cup good-quality green olives, pitted", "Pinch of crushed red pepper", "1 bay leaf", "3 tablespoons granulated sugar", "1/4 cup red wine vinegar", "1/2 cup dry white wine", "2 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a wide cast-iron pan over medium-high heat. Add 4 tablespoons olive oil to coat surface of pan. When oil is wavy, test by adding a cube of eggplant. It should begin to sizzle and brown immediately. Fill the pan with a single layer of eggplant cubes. Turn eggplant with a spatula or tongs and brown nicely on all sides. Lower heat as necessary to maintain an even temperature; if the pan is too hot, the eggplant will burn."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove cooked eggplant to a plate and continue to fry remaining eggplant in batches, adding more oil as necessary. Season finished eggplant with salt and pepper. (Alternatively, roast the eggplant on a baking sheet at 400 degrees, lightly drizzled with oil, until cooked and nicely browned, about 20 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 2 tablespoons oil in a stainless-steel skillet over medium-high heat. Add onions, season lightly with salt and cook, stirring, until softened and lightly colored, about 5 minutes. Stir in blanched celery, tomato paste, capers and olives. Add crushed red pepper, bay leaf, sugar, vinegar and wine. Simmer for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently fold in cooked eggplant and simmer 2 or 3 minutes more. Taste cooking juices and adjust salt if necessary. Let mellow for 1 hour at room temperature (or make it a day in advance for fuller flavor). Sprinkle with parsley to serve. The caponata will keep for a week, refrigerated."}], "link": "https://cooking.nytimes.com/recipes/1018823-eggplant-caponata"}