{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange-Almond Mandelbrot", "description": "Mandelbrot (or mandel bread) is an Eastern European Jewish cookie, a variation on biscotti. The dough is baked twice: first in a log, and then again after it's been sliced into cookies. This recipe includes the smart trick of freezing the dough after baking it the first time, then cutting it into slices when still frozen before baking again. This makes for a thinner slice, fewer crumbs when cutting and a crispier texture. You can make it with matzo cake meal during Passover — a delicious variation.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2017/04/05/dining/05PASSOVER3/05PASSOVER3-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "About 30 cookies", "recipeCuisine": "eastern european, jewish", "recipeCategory": "cookies and bars", "keywords": "almond, almond flour, matzo cake meal, orange, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 75}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 193, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "3 grams", "sodiumContent": "40 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups plus 1 tablespoon/264 grams all-purpose flour or 1 1/2 cups/204 grams matzo cake meal", "1/2 cup/85 grams potato starch", "1/2 cup/55 grams almond flour", "1 1/2 teaspoons cinnamon", "1/2 teaspoon sea salt", "1 1/4 cups/250 grams granulated sugar", "12 tablespoons/169 grams/1 1/2 sticks unsalted butter or coconut oil, at room temperature", "3 large eggs", "1 cup/126 grams slivered almonds", "1/2 teaspoon vanilla", "Zest of 2 oranges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mix flour or matzo cake meal, potato starch, almond flour, 1/2 teaspoon cinnamon and the salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, cream 1 cup/200 grams sugar and the butter or coconut oil. Add eggs, one at a time, mixing well after each addition. Stir in flour or matzo mixture, almonds, vanilla and orange zest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place half the dough on a piece of parchment paper about 20 inches long. Use parchment paper to help mold the dough into a log about 10 inches long and 2 inches in diameter. (The dough is very soft and may be hard to worth with.) Gently press down along the top of the log to flatten it slightly. Twist ends of the parchment paper to seal. Repeat with the remaining dough. Refrigerate both logs for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and line a baking sheet with parchment paper. Unwrap dough logs and put on the prepared baking sheet, side by side. Bake logs for 35 to 45 minutes, until just beginning to brown. The dough should not be too cracked on the top. It is better to underbake than overbake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let logs cool, wrap in plastic and freeze until you are ready to finish them, or for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and line 2 baking sheets with parchment paper. Mix remaining 1 teaspoon cinnamon and 1/4 cup/50 grams sugar in a small bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove logs from freezer. With a sharp, serrated knife, cut the logs into roughly 1/2-inch-thick slices, discarding the end slices if they fall apart. (If the logs have been in the freezer for several hours, let them sit at room temperature for a few minutes before slicing.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip both sides of each slice in the cinnamon-sugar mixture and place them flat on prepared baking sheets. Bake for 10 to 15 minutes, carefully turn slices over, then bake another 10 minutes, or until golden brown and starting to crisp."}]}