{"@context": "http://schema.org", "@type": "Recipe", "name": "Shredded Vegetable Socca", "description": "Socca is street food in Nice, in the South of France. This Los Angeles version, served at the restaurant Sqirl, makes it a meal by adding shredded vegetables to the chickpea pancake and tops it with greens and creamy labneh. This recipe calls for carrots, winter squash (Sqirl generally uses kabocha) or zucchini — pick one and proceed. Add a fried egg on top to make it heartier, if you'd like.", "author": {"@type": "Person", "name": "Oliver Strand"}, "image": "https://static01.nyt.com/images/2016/09/28/dining/28SQIRL2-WEB/28SQIRL2-WEB-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "pancakes", "keywords": "carrot, chickpea flour, greek yogurt, greens, labneh, winter squash, zucchini, gluten-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 89}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 313, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "5 grams", "proteinContent": "15 grams", "saturatedFatContent": "7 grams", "sodiumContent": "599 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound/455 grams zucchini, carrots or winter squash, peeled and coarsely grated on the large holes of a box grater or with the grating attachment of a food processor", "Fine sea salt", "1/4 teaspoon cumin seeds", "1/4 teaspoon coriander seeds", "1/4 teaspoon fennel seeds", "4 large eggs", "1 clove garlic, minced", "1 tablespoon chopped fresh oregano", "2 tablespoons chopped fresh mint", "3 tablespoons chopped fresh cilantro", "2/3 cup/80 grams chickpea flour", "Black pepper", "Pinch of ground cinnamon (use only with winter squash)", "Pinch of ground ginger (use with squash)", "2 tablespoons unsalted butter, more as needed", "1/2 cup/120 milliliters labneh or whole-milk Greek yogurt", "3 cups/60 grams spicy salad greens (such as watercress, arugula or baby mustard greens)", "1 tablespoon fresh lemon juice", "1 tablespoon extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss grated vegetable with big pinches of salt. Put it in a fine-mesh sieve and let drain, squeezing every so often so that the vegetable releases its water, for at least 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine cumin, coriander and fennel seeds in a dry skillet over medium-low heat. Toast the spices, shaking the pan often, until fragrant but not burned, about 3 minutes. Using a mortar and pestle or a spice grinder, grind toasted spices to a powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the eggs in a large bowl. Add drained vegetable, along with garlic, oregano, mint, cilantro, chickpea flour and toasted spices. Season with 1/2 teaspoon salt and a few grinds of black pepper, and mix well. If you are using winter squash, stir in cinnamon and  ginger. (The pancake batter can be made up to 2 days ahead and stored, covered, in the fridge.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in a large skillet, preferably cast iron, over medium heat. Spoon in two 1/2 cupfuls of the pancake batter. Use the back of your spoon or a spatula to flatten each to 1/2-inch thick. Cook, rotating the skillet  for even browning, until pancakes are nicely browned, about 4 minutes. Flip, then cook the second side for another few minutes. Transfer pancakes to a plate. Repeat to make 2 more pancakes, adding butter to the skillet if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season labneh or yogurt with salt to taste. Just before serving, toss greens with lemon juice, oil and  salt and pepper. Top each pancake with a  dollop of labneh or  yogurt and a tangle of greens."}], "link": "https://cooking.nytimes.com/recipes/1018320-shredded-vegetable-socca"}