{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Gyros", "description": "This lemon-bright and paprika-dusted pita filling is based on memories of the gyros served at Kalimera Souvlaki Art in Melbourne, Australia, one of the best Greek restaurants in a city that supports a great number of them. I've cooked it here in the oven, but the preparation would take well to the grill. However you prepare it, serve the crisped meat with warm pita, cucumbers, tomatoes and onion, <a href=\"https://cooking.nytimes.com/recipes/1016438-tzatziki\">tzatziki sauce</a>, hot sauce, French fries, mint leaves, really whatever you like. ", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/06/11/magazine/11eat/11mag-11eat-t_CA0-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "greek", "recipeCategory": "meat", "keywords": "lemon, oregano, pork shoulder, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 670}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 586, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "46 grams", "fiberContent": "3 grams", "proteinContent": "34 grams", "saturatedFatContent": "13 grams", "sodiumContent": "662 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["2 1/2 pounds pork shoulder", "Juice of 2 lemons", "1/4 cup plus 1 tablespoon extra-virgin olive oil", "8 cloves garlic, peeled and minced", "1 medium-size tomato", "2 medium-size yellow onions, peeled", "1 tablespoon plus 1 teaspoon smoked or sweet paprika", "1 tablespoon kosher salt", "2 teaspoons freshly ground black pepper", "1 1/2 tablespoons fresh oregano leaves, approximately 5 sprigs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put pork shoulder on a plate, and place in the freezer for approximately 1 hour, or until it is firm to the touch. Put meat on a cutting board, and using a sharp knife, remove and discard any skin, then slice the meat thinly against the grain, into 1/2-inch slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the marinade. In a large bowl, whisk together the lemon juice, 1/4 cup olive oil and garlic. Using a box grater, grate the tomato and one of the onions into the marinade, then add 1 tablespoon of the paprika, along with the salt, pepper and oregano leaves. Whisk again, then place the sliced pork into the marinade, toss to combine and cover and refrigerate the meat for at least one hour and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, heat oven to 450. Use the remaining tablespoon of olive oil to grease a rimmed sheet pan. Quarter the remaining onion, add it to the pork and marinade and toss once to combine. Remove the pork and onion from the marinade, and place on the pan, spreading everything evenly across it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the pork in the oven, and roast until it is browned, crisp at the edges and cooked through, about 30-40 minutes. Check the meat at around 20 minutes to see how much liquid is in the pan. If there is a lot, remove the pan, and pour off all but a few tablespoons. Remove the finished pork from the oven, allow to rest for a minute or two, then chop into bits. (To make the pork even crisper, set a large pan over high heat, add a tablespoon of olive oil to the pan, then the sliced pork, and sauté until everything curls tight in the heat.) Scatter the remaining paprika over the top of the meat, and serve with warm pita, sliced cucumbers and onions, tomato, tzatziki sauce, hot sauce, French fries, scattered mint leaves, ketchup, really whatever you like."}], "link": "https://cooking.nytimes.com/recipes/1018793-pork-gyros"}