{"@context": "http://schema.org", "@type": "Recipe", "name": "Namoura (Syrup-Soaked Semolina Cake)", "description": "Amanda Saab, a social worker and home cook who lives near Detroit, riffs on her Lebanese grandmother's recipe for namoura, a cake made from semolina flour, soaked in syrup while it's still warm. When she serves it at iftar dinners during Ramadan, Ms. Saab often doses the syrup with a little bit of lavender extract. You could follow her lead, or use another floral note like vanilla or rose. The cake has no eggs, but this version gets its rich flavor and texture from aerated yogurt, which goes bubbly within minutes of being mixed with a little baking soda.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/05/26/dining/31ramadanrex1-1/31ramadanrex1-1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "20 to 24 pieces", "recipeCuisine": "middle eastern", "recipeCategory": "cakes", "keywords": "dessert, semolina flour, slivered almonds, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 278}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 247, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "4 grams", "sodiumContent": "149 milligrams", "sugarContent": "26 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups/400 grams granulated sugar", "1 tablespoon freshly squeezed lemon juice", "1 1/4 teaspoons lavender extract, vanilla extract or rose water ", "3/4 cup/170 grams unsalted butter (1 1/2 sticks), melted, plus more for coating the pan", "3 cups/490 grams semolina flour", "3/4 cup/150 grams granulated sugar", "1 cup/227 grams plain whole-milk yogurt", "2 1/2 teaspoons baking soda", "1/4 cup/29 grams slivered almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan over high heat, boil sugar and 1 cup/240 milliliters of water, stirring until the sugar is dissolved. Reduce the heat to a simmer, add lemon juice and extract, and stir to combine. Simmer until thickened into a syrup, about 2 minutes. Remove from the heat and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Coat a 9-by-13-inch baking dish with butter. Place the semolina, melted butter and sugar in a large bowl and stir until well combined; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the yogurt and baking soda in a medium bowl and stir to combine. Set aside until the mixture has nearly doubled in size, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the yogurt mixture over the semolina mixture and mix well to combine. Transfer to the buttered baking dish and press into an even layer. Using a knife, score the surface of the namoura on the diagonal into 2-inch diamond-shaped pieces. Top each diamond in the center with an almond. Bake until golden brown, 25 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place baking dish on a wire rack and drizzle the cooled syrup over the top of the hot namoura. Let cool to room temperature before recutting along the scored lines and serving."}]}