{"@context": "http://schema.org", "@type": "Recipe", "name": "Cast-Iron Sourdough Pancakes", "description": "This recipe comes from Vinegar Hill House in Brooklyn, via Angela Johnson Sherry, who shared her family's recipe with the restaurant almost a decade ago. The restaurant sprinkles a little seasonal fruit at the bottom of the pan, then follows with a lot of airy pancake batter to make thick, crisp, golden brown pancakes that look almost like layers of cake. Use a hot oven and a pre-heated cast-iron pan, either a small one around 4 inches in diameter to make one pancake each, or a large one around 8 inches in diameter to make a couple of giant pancakes you can split at the table.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/03/19/magazine/19eat1/19eat1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, pancakes", "keywords": "pear, sourdough starter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 697}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 497, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "85 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "7 grams", "proteinContent": "16 grams", "saturatedFatContent": "5 grams", "sodiumContent": "917 milligrams", "sugarContent": "26 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 to 1 cup <a href=\"https://cooking.nytimes.com/recipes/1013152-sourdough-starter\">sourdough starter</a>", "2 cups all-purpose flour", "2 cups whole milk", "3 eggs", "1 teaspoon baking soda", "1 teaspoon salt", "1 tablespoon sugar", "1 tablespoon butter, plus more for serving", "3 to 4 peeled and sliced pears (you could also use sliced apples, peaches or strawberries, or whole blueberries)", "Maple syrup, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix <a href=\"https://cooking.nytimes.com/recipes/1013152-sourdough-starter\">sourdough starter</a> with flour and milk, then let it sit out at room temperature, covered with a cloth, overnight and up to 24 hours. Stir well, and transfer a scant cup of this mixture into a plastic container with lid or glass jar to store in the fridge, for another batch of pancakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the eggs, baking soda, salt and sugar into the rest of the fermented flour and milk. The batter will loosen and take on the thick, airy liquid texture of a milkshake. If the batter seems a little too stiff, add a splash of milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450, with a cast-iron skillet inside the oven. (You can use a 4-inch pan for individual pancakes or an 8-inch pan for a larger pancake, which can be cut to share.) When the pan is hot, remove it, and swirl in 1 tablespoon butter until melted, then add a thin layer of fruit, so that you can still see some parts of the bottom of the pan. If using firm fruits like apples or pears, place the pan on medium heat on the stovetop, and let the fruit sizzle for a minute or two until it has softened on its edges, then add batter. If using softer fruits or berries, add the batter right away. Add enough batter to totally cover the fruit and make a substantial pancake about a half-inch in thickness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to oven for 15 minutes, or until the top of the pancake is evenly browned and the edges are crisp. Flip pancake onto a plate fruit-side up, and serve hot with another knob of butter on top and a generous glug of maple syrup. Repeat with remaining batter."}]}