{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Whole Fish With Lemongrass, Chiles and Coconut", "description": "Spicy, herbal and a little sweet from the coconut milk, these grilled whole fish are perfumed with lemongrass and spiked with tiny, potent Thai chiles. I like dorade here, but you can use any small whole fish (1 pound or so). Have your fishmonger clean them but leave in the bones. They help keep the fish moist on the grill and add great flavor. You can also roast the fish instead of grilling; place them on a rimmed baking sheet and roast at 425 degrees until the fish is cooked through, usually 10 to 15 minutes.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/06/03/multimedia/clark-grilled-dorade/clark-grilled-dorade-mediumThreeByTwo440.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick", "keywords": "cilantro, coconut milk, dorade, fish sauce, lemongrass, mint, Thai chile, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 147}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 615, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "3 grams", "proteinContent": "86 grams", "saturatedFatContent": "12 grams", "sodiumContent": "495 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["4 (1-pound) whole dorade, branzino or trout, cleaned", "1/4 teaspoon fine sea salt, more as needed", "Black pepper, as needed", "1 1/2 tablespoons coconut oil, softened or melted", "3 limes", "2 small shallots, peeled", "1 bunch cilantro, leaves and stems separated (about 2 cups leaves)", "2 small stalks lemongrass, halved lengthwise and cut into 3-inch pieces", "1 cup mint leaves, more for garnish", "1 Thai chile or 1 to 2 serrano chiles, seeded and coarsely chopped", "2 small garlic cloves, grated on a Microplane or minced", "1/4 teaspoon Asian fish sauce, more to taste", "1/2 cup unsweetened coconut milk", "1 tablespoon safflower or grapeseed oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season cavities and outside of fish with salt and pepper. Rub skin all over with coconut oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice 1 lime and 1 shallot. Cut another lime into wedges and save for garnish. Fill each fish cavity with lime and shallot slices, a handful of cilantro stems (discard the rest) and the lemongrass."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sauce: Coarsely chop the remaining shallot and juice the remaining lime. In a mini food processor, combine shallot, 1 tablespoon lime juice, the cilantro leaves, the mint, the chile, the garlic, the fish sauce and 1/4 teaspoon salt. Pulse until herbs are chopped, then add coconut milk and oil. Continue to pulse until a coarse, chunky sauce forms. (Don’t overdo it; you want a relish-like texture, not a purée.) Taste and add more salt, fish sauce and/or lime juice if necessary. (Alternatively, chop everything really finely by hand and stir in the coconut milk and lime juice.) Sauce can be prepared up to 4 hours ahead. Refrigerate until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light or heat the grill to medium-high heat. Place fish in basket and grill until blistered and just cooked through, 3 to 4 minutes per side. (Poke the fish along the spine; it should be tender but still juicy.) Serve, garnished with lime wedges and mint leaves, with sauce on the side."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Grilled Whole Fish with Chiles and Coconut", "description": "Thai flavors enhance the smokiness of this whole fish grilled over charcoal.", "thumbnailUrl": "https://static01.nyt.com/images/2016/06/03/multimedia/clark-grilled-dorade/clark-grilled-dorade-mediumThreeByTwo440.jpg", "uploadDate": "2016-06-03T14:58:09.000Z", "duration": "PT2M20S"}, "link": "https://cooking.nytimes.com/recipes/1018158-grilled-whole-fish-with-lemongrass-chiles-and-coconut"}