{"@context": "http://schema.org", "@type": "Recipe", "name": "Moroccan Shakshuka", "description": "In this shakshuka variation by the San Francisco chef Mourad Lahlou, lamb and beef kefta (meatballs) are browned, then simmered in a spiced tomato-red pepper sauce. Instead of the usual whole eggs poached in the sauce, Mr. Lahlou adds only the yolks, which burst into a luscious orange sauce when tapped with a fork. In his native Morocco, this kind of dish would traditionally be cooked in a tagine, but a large skillet works equally well. Serve this with flatbread for brunch, lunch or dinner. Chef Lahlou garnishes his shakshuka with edible flowers and micro cilantro, as shown here, but tender cilantro springs will do beautifully, too.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/05/24/dining/24CHEF2/24CHEF2-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "moroccan", "recipeCategory": "brunch, dinner, meatballs", "keywords": "canned tomatoes, carrot juice, ground beef, ground lamb, preserved lemon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 190}, "recipeIngredient": ["1 large red bell pepper", "2 tablespoons grapeseed or extra-virgin olive oil", "1 1/2 cups finely diced red onion", "2 tablespoons minced garlic", "6 cups diced canned tomatoes, preferably San Marzano", "1 cup carrot juice", "1 tablespoon chopped fresh thyme leaves", "2 teaspoons kosher salt, more to taste", "3/4 teaspoon sweet paprika", "1/2 teaspoon ground cumin", "1/4 teaspoon ground white pepper", "Pinch of cayenne", "2 1/2 tablespoons minced preserved lemon", "1 tablespoon chopped parsley", "1 tablespoon chopped cilantro, plus tender sprigs for garnish", "6 large egg yolks, at room temperature", "Extra-virgin olive oil, for brushing", "1 1/2 teaspoons kosher salt", "2 teaspoons sweet paprika", "2 teaspoons ground cumin", "1/2 teaspoon ground white pepper", "1/8 teaspoon cayenne", "1/4 cup finely diced red onion", "1 tablespoon minced parsley", "1 tablespoon minced cilantro", "1 teaspoon minced garlic", "8 ounces ground beef (80 percent lean)", "8 ounces ground lamb", "1 large egg, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Over an open flame on the stove top or under the broiler, roast the red pepper until skin is black and blistered all over, 8 to 12 minutes, turning the pepper as needed. Transfer to a heatproof bowl, cover with a plate or plastic wrap and let sit for 15 minutes, until cool enough to handle. Uncover and rub the skin off, then seed and finely chop the pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 12-inch cast-iron skillet, heat oil over medium-high heat. Stir in onion and cook until starting to brown, 7 to 12 minutes. Stir in garlic and roasted red pepper, and sauté for another 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in tomatoes, carrot juice, thyme, salt, paprika, cumin, white pepper, cayenne and 1/4 cup water, and bring to a simmer. Simmer over medium-low heat until mixture is reduced by a third, 40 minutes to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sauce simmers, make the kefta: Drizzle olive oil on a rimmed baking sheet and turn on your broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mix the salt, paprika, cumin, white pepper, cayenne, red onion, parsley, cilantro and garlic. Mix in the beef, lamb and beaten egg just to combine, then scoop out 1 1/2-inch balls, transferring to prepared baking sheet. Flatten balls slightly, then broil without turning until well browned, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, stir the preserved lemon, parsley and cilantro into the sauce and bring to a simmer. Arrange kefta in sauce along the outer edges of the skillet, leaving room for the egg yolks in the middle. Simmer kefta balls in sauce until they are cooked through and the sauce has reduced a little more, 10 to 15 minutes. Taste and add more salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slip yolks into the center of the pan, cover pan and heat gently until yolks are warmed through, 2 to 4 minutes. Serve immediately, garnished with cilantro sprigs."}], "link": "https://cooking.nytimes.com/recipes/1018765-moroccan-shakshuka"}