{"@context": "http://schema.org", "@type": "Recipe", "name": "Classic Pasta alla Norma", "description": "This is down-home, primal Sicilian cooking, using inexpensive and commonly available ingredients: olive oil, eggplant, tomato and pasta. A showering of grated ricotta salata and toasted bread crumbs adorns this humble yet justly famous dish. The Sicilian composer Vincenzo Bellini adored it with such a passion that it was eventually named after his 19th-century opera \"Norma\" — or so goes the story.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/07/05/dining/05KITCHEN1/05KITCHEN1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, pastas", "keywords": "basil, eggplant, pasta, ricotta salata, tomato, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 238}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 474, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "74 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "8 grams", "proteinContent": "18 grams", "saturatedFatContent": "5 grams", "sodiumContent": "909 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["Extra-virgin olive oil", "1 small onion, diced", "Salt and pepper", "2 garlic cloves, peeled", "Pinch of crushed red pepper", "12 basil leaves, plus a few basil sprigs for garnish", "4 cups peeled, chopped tomatoes with juice, fresh or canned", "3 or 4 small eggplants (about 2 pounds), peeled and cut into 1-inch cubes", "1 pound pasta, such as penne, rigatoncini or spaghetti", "1 cup coarsely grated ricotta salata", "1/4 cup toasted bread crumbs, preferably homemade"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a quick tomato sauce: Put 2 tablespoons olive oil in a large, deep skillet over medium-high heat. Add onions, season with salt and pepper and cook, stirring occasionally, until softened, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in garlic, red pepper and basil leaves and cook for 1 minute. Add tomatoes, stir and bring to a simmer. Reduce heat to low and let sauce simmer gently for 20 minutes, until slightly thickened. Taste and adjust seasoning. Set aside. (Sauce may be prepared up to 2 days in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a large pot of well-salted water to a boil. Turn heat to low and cover pot until it’s time to cook the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a wide cast-iron pan over medium-high heat. Add 4 tablespoons olive oil to coat surface of pan. When oil is wavy, test by adding a cube of eggplant. It should begin to sizzle and brown immediately. Fill the pan with a single layer of eggplant cubes. Turn eggplant with a spatula or tongs and brown nicely on all sides. Lower heat as necessary to maintain an even temperature; if the pan is too hot, the eggplant will burn."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove cooked eggplant to a plate and continue to fry remaining eggplant in batches, adding more oil as necessary. Season finished eggplant with salt and pepper. (Alternatively, roast the eggplant on a baking sheet at 400 degrees, lightly drizzled with oil, until cooked and nicely browned, about 20 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble and serve, boil pasta until al dente, leaving it a little firmer than normal. Bring the tomato sauce to a simmer. Add eggplant to sauce and gently stir to combine. Reserve a cup of pasta cooking water, then drain pasta and add to sauce. Using 2 wooden spoons or tongs, toss pasta and sauce, and let cook 1 minute more. Thin sauce if necessary with a little pasta cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a warmed wide pasta bowl. Sprinkle with grated ricotta salata and bread crumbs. Garnish with torn or whole basil leaves and a drizzle of olive oil, if desired."}], "link": "https://cooking.nytimes.com/recipes/1018822-classic-pasta-alla-norma"}