{"@context": "http://schema.org", "@type": "Recipe", "name": "Berry Tiramisù", "description": "This fruity, summery version of tiramisù was invented by Letizia Mattiaci, a cook in Umbria who teaches cooking classes in her home kitchen, high in the hills above Assisi. Berries and cream are, of course, a classic combination, but putting them together this way makes for a beguiling dessert. The berries give off a delicious violet juice that is used to soften the ladyfingers, just as strong coffee is used in the traditional recipe.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/09/14/dining/14UMBRIA-RECIPES3/14UMBRIA-RECIPES3-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "berries, dessert wine, egg, ladyfingers, mascarpone, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 71}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 442, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "14 grams", "sodiumContent": "172 milligrams", "sugarContent": "21 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds/600 to 700 grams mixed berries of your choice (blackberries, strawberries, blueberries or raspberries, fresh or frozen)", "3 to 4 tablespoons granulated sugar", "1 tablespoon lemon juice", "1/2 cup dry Marsala, Vinsanto or other dessert wine", "3 egg yolks", "6 tablespoons/75 grams granulated sugar", "1 tablespoon dry Marsala, Vinsanto or other dessert wine", "10 ounces/375 grams mascarpone", "1 1/2 cups/355 milliliters chilled whipping cream", "30 to 36 Italian ladyfingers", "2 to 3 tablespoons brown sugar, for dusting", "Edible flowers, for topping (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the berries: Trim berries and cut any large ones into 1/2-inch/1 centimeter pieces. Place berries in a ceramic bowl and add 3 to 4 tablespoons of sugar (depending on the sweetness of the fruit), the lemon juice and the dessert wine. Let them soak for as long as possible, at least 2 hours, so they release their juice, which you will need to moisten the lady fingers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the custard: Whisk together egg yolks and sugar in a metal bowl and set over a saucepan of barely simmering water. Continue whisking (by hand or with an electric mixer) until very warm to the touch but not quite boiling, about 5 minutes. The mixture should reach 160 degrees. Add dessert wine and whisk thoroughly for another minute. Remove bowl from heat, place in an ice bath and let cool completely. Whisk in mascarpone until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the cream in a separate bowl until it holds stiff peaks. Fold it gently into the mascarpone mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble: Line the bottom of a deep 9-inch-square serving dish with half of the ladyfingers, making compact rows. Spread half the berries on top with about half of their juices. Make sure to drizzle the juice evenly over the ladyfingers so they will be soft but not soggy. Cover with half the mascarpone custard. Repeat process once more, for a two-layer tiramisù, then refrigerate at least 2 hours and up to 1 day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with brown sugar and decorate with edible flowers before serving. Cut into squares first, or use a spoon."}]}