{"@context": "http://schema.org", "@type": "Recipe", "name": "Provençal White Wine Beef Daube", "description": "A classic Provençal beef daube, or slow-baked stew, is made with quantities of red wine, like the recipes that Julia Child often made in her house in Provence, La Pitchoune. Patricia Wells, a former New York Times food writer in Paris, also lives part-time in the South of France, and she has adapted the daube for white wine, which plays a more subtle part in flavoring the stew. The large amount of liquid makes a tender braise that can also be served as a sauce for pasta: penne, gnocchi and long noodles like tagliatelle are familiar in the region, which borders Italy on the east.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/09/21/dining/21JULIA3/21JULIA3-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "8 to 10 servings", "recipeCuisine": "french, provencal", "recipeCategory": "soups and stews", "keywords": "bouquet garni, brandy, mushroom, stewing beef, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 301}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 571, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "2 grams", "proteinContent": "61 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1226 milligrams", "sugarContent": "5 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 tablespoons extra-virgin olive oil", "2 tablespoons brandy, eau-de-vie or Cognac", "6 pounds boneless stewing beef, such as round, shin, blade or chuck, cut into 3-ounce chunks", "Salt and freshly ground black pepper", "2 large onions, thinly sliced", "4 carrots, peeled and thickly sliced", "4 ounces mushrooms, trimmed and thickly sliced", "1 head garlic, cloves separated, smashed and peeled", "Grated zest of 1 orange, more for garnish (optional)", "2 ripe tomatoes, chopped, or 1 cup canned tomato purée", "2 bottles white wine", "1 bouquet garni (1 small bunch fresh parsley, 6 to 8 sprigs fresh thyme and 2 bay leaves, tied together or bundled in cheesecloth)", "1/2 to 1 teaspoon whole black peppercorns", "1/4 cup freshly chopped parsley, for garnish", "Small pasta, such as orzo, mezze penne or conchiglie, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl or sealable plastic bag, combine 2 tablespoons olive oil, the Cognac, the beef and a generous sprinkling of salt and pepper. Cover and set aside to marinate at room temperature for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a rack in the center of the oven and heat to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide, heavy casserole with a tight-fitting lid, heat remaining 2 tablespoons oil over medium-high heat until it shimmers. Add onions, carrots, mushrooms, garlic, orange zest and 2 big pinches salt; stir well to coat and heat through. Reduce heat to low, cover, and sweat (cook without browning) for 8 to 10 minutes, until onions and garlic are softened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add beef and its marinade, tomatoes, wine, bouquet garni and peppercorns. Stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and bake in the center of the oven until meat is ultratender, 3 to 4 hours. There is no need to stir or baste, but check from time to time to make sure the liquid is at a very gentle simmer; boiling will make the meat tough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the stew is ready, adjust the seasonings with salt and pepper and serve immediately. Or, refrigerate overnight or longer, skim any hardened fat from the top, and reheat before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve over hot pasta, garnished with parsley and orange zest, if desired."}], "link": "https://cooking.nytimes.com/recipes/1018309-provencal-white-wine-beef-daube"}