{"@context": "http://schema.org", "@type": "Recipe", "name": "Curried Goat", "description": "To Hazel Craig, the mother of the pastry chef Jessica Craig, it’s not Christmas without curried goat, a hearty, spicy dish that’s often served during the holidays in Hazel’s native Jamaica. The star ingredient here is the Jamaican curry powder blend. It’s worth making your own to maximize the dish’s depth and complexity, and the recipe here makes extra (which can be used in any kind of stew or braise). Hazel insists that the best way to prepare goat is not to brown the meat first, but to cook everything all at once in the same pot. “When you heat everything up together,” she said, all the flavor “gets locked in there.”", "author": {"@type": "Person", "name": "Priya Krishna"}, "image": "https://static01.nyt.com/images/2018/12/19/dining/19jamaicanrex3/merlin_147982983_dc2e1113-2ae5-4afe-a79f-24ba5990276d-articleLarge.jpg", "totalTime": "PT14H", "recipeYield": "8 to 10 servings", "recipeCuisine": "caribbean", "recipeCategory": "dinner, meat", "keywords": "goat, lawry's seasoned salt, russet potatoes, scotch bonnet chile, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 62}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 339, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "4 grams", "proteinContent": "31 grams", "saturatedFatContent": "2 grams", "sodiumContent": "565 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons cumin seeds", "4 tablespoons coriander seeds", "2 tablespoons ground turmeric", "1 tablespoon fenugreek seeds", "1 tablespoon ground black pepper", "1 tablespoon garlic powder", "2 teaspoons onion powder", "2 teaspoons ground allspice", "3 pounds boneless goat meat, such as shoulder or leg, cut into 2-inch cubes", "1/2 cup vegetable or canola oil", "1 large white onion, sliced", "6 garlic cloves, minced", "1 Scotch bonnet chile, sliced, seeds removed", "3 fresh thyme sprigs", "2 teaspoons Lawry’s Seasoned Salt, plus more if needed", "1/4 teaspoon ground black pepper", "3 medium russet potatoes, peeled and chopped into 1-inch pieces", "Cooked white rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the Jamaican curry powder: In a skillet, toast the spices over low heat, gently shaking the pan, until fragrant, about 2 minutes. Let cool. Transfer to a spice grinder, blender or mini food processor and pulse until the mixture forms a fine powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the goat: Set the meat in a large bowl. Put on a pair of disposable latex or vinyl gloves. (Scotch bonnet chile can be very hot to the touch.) Add the oil, onion, garlic, chile, thyme sprigs, seasoned salt, black pepper and half the prepared Jamaican curry powder (or 4 tablespoons store-bought) to the bowl and massage the marinade into the meat. (Save remaining spice mix for another use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the meat to an airtight container and refrigerate at least 12 hours and up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the meat in a large pot or Dutch oven. Add the potatoes and 2 cups water. Cook over medium-high heat until the mixture comes to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to low, cover and simmer, stirring every 20 minutes, until the potatoes break down, the sauce has thickened and the meat is tender and cooked through, about 1 1/2 to 2 hours. The curried goat will look like a thick stew. Add more seasoned salt, if needed. Serve with the rice."}], "link": "https://cooking.nytimes.com/recipes/1019848-curried-goat"}