{"@context": "http://schema.org", "@type": "Recipe", "name": "Beer-Braised Beef and Onions", "description": "This hearty, warming beef and onion stew is flavored with Belgian beer, bay leaves and sweet paprika. A variation on a traditional Flemish carbonnade, it’s rich and homey but still lively, with a ruddy color from the paprika. The very large quantity of onions adds sweetness, and also helps make the sauce velvety soft. Serve it over potatoes, noodles or polenta.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/01/31/dining/31appetite3/merlin_132677150_c909c0b9-1b5e-44c1-a693-54e51244c542-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "8 to 12 servings", "recipeCuisine": "belgian, french", "recipeCategory": "dinner, soups and stews", "keywords": "beef, beer, onion, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 494}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 317, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "2 grams", "proteinContent": "42 grams", "saturatedFatContent": "5 grams", "sodiumContent": "746 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 tablespoon kosher salt, more as needed", "1 teaspoon black pepper, more for garnish", "6 bay leaves", "2 teaspoons sweet paprika, more for garnish", "4 pounds boneless beef stew meat, cut into 1 1/2-inch chunks", "1 tablespoon unsalted butter", "1 tablespoon extra-virgin olive oil, more as needed", "4 Spanish or very large yellow onions, thinly sliced", "6 sprigs fresh thyme", "4 sprigs fresh parsley, plus chopped parsley, for garnish", "1 tablespoon tomato paste", "1 teaspoon ground coriander", "1/4 teaspoon ground cinnamon", "1 tablespoon all-purpose flour", "2 cups beef or chicken stock, preferably homemade", "1 cup beer, preferably Belgian-style or brown ale", "Flaky sea salt, for garnish", "Dijon-style mustard, preferably extra-hot, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine salt, pepper, bay leaves and paprika. Toss meat to coat, then cover, refrigerate and marinate at least 2 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. In a large (8-quart) Dutch oven or other heavy pot, heat butter and oil over medium-high until shimmering. Working in batches, brown beef on two sides until dark and crusty, transferring to a bowl when browned (reserve bay leaves). As you cook, add more oil and adjust heat if necessary to prevent burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the meat is browned, add onions to the empty pot and return the heat to medium-high if you lowered it. Cook, stirring and scraping up the brown coating on the bottom of the pan as the onions release their liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue cooking until onions are deeply golden brown and soft, 20 to 30 minutes, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make a bouquet garni by tying thyme, parsley and reserved bay leaves together with kitchen string (or just throw them in the pot and warn your guests not to eat them)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Push the onions to the sides, then add tomato paste, coriander and cinnamon to the bottom of the pan. Cook, stirring, 1 minute, until paste is darkened and fragrant. Stir in flour, cook another minute, then add stock, beer, 1 cup water and bouquet garni. Return beef and any juices in the bowl to the pot, bring to a simmer, then cover and transfer to oven. Cook until beef is tender, about 2 1/2 to 3 hours, turning it over halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the sauce seems thin, remove the meat with a slotted spoon; cover with foil to keep warm. Return pot with liquid to stove and simmer until thickened to taste, 5 to 10 minutes. Return the meat to pot and stir to heat through. Serve from the pot or a platter. Garnish with chopped parsley, flaky sea salt, pepper and paprika. Serve with mustard on the side."}], "link": "https://cooking.nytimes.com/recipes/1019156-beer-braised-beef-and-onions"}