{"@context": "http://schema.org", "@type": "Recipe", "name": "Buffalo Cauliflower", "description": "Cauliflower is a blank canvas that can take on flavors that pack a punch, like Buffalo sauce. It also has lots of craggy edges that the sauce can cling to for maximum flavor. For crisp-edged buffalo cauliflower without a fryer, turn on the broiler. Once the tender florets are roasted, broil them a few minutes so the silky, spicy sauce caramelizes and chars in spots. (A finish under the broiler can also elevate chicken wings coated in Buffalo sauce.) Stir together a quick Ranch-style yogurt sauce for dipping, and get on with the game (or lunch).", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/01/14/dining/as-buffalo-cauliflower/as-buffalo-cauliflower-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 Servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, snack, weekday, vegetables", "keywords": "appetizer, main course, side dish, buttermilk, cauliflower, hot sauce, yogurt, fall, winter, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 368}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 279, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "10 grams", "sodiumContent": "726 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 large head cauliflower (about 2½ pounds), cut into medium and large florets (about 8 cups)", "3 tablespoons extra-virgin olive oil", "Kosher salt and black pepper", "4 tablespoons unsalted butter", "1/3 cup Buffalo-style hot sauce", "1/2 cup full-fat yogurt", "1/4 cup buttermilk or mayonnaise", "2 tablespoons finely chopped dill, parsley, and-or chives", "1 1/2 tablespoons white wine vinegar or rice vinegar or lemon juice", "1/2 teaspoon garlic powder or 1 small garlic clove, grated", "Kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees, and place a rack close to the broiler and another in the middle of the oven. (If your broiler is in a drawer below the oven, no need to move the racks.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss the cauliflower with the oil to evenly coat, then season with salt and pepper. Spread out the cauliflower on a baking sheet in an even layer (arrange flat edges pan-side down for extra browning). Bake the cauliflower on the middle rack, stirring occasionally, until just tender, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As cauliflower roasts, make the sauce: Melt the butter with the hot sauce in a medium saucepan or skillet over low heat, and stir to combine. Season to taste with salt and pepper. Once melted, turn off the heat, but keep the saucepan on the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the yogurt ranch (optional): Stir together all the ingredients in a small bowl. Season to taste with salt and pepper, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull the cauliflower out of the oven, and turn on the broiler. Transfer the cauliflower to the hot sauce-butter mixture, stirring the cauliflower to fully coat with the sauce. Then, using a slotted spoon, transfer the cauliflower back to the baking sheet in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil until the cauliflower is singed in spots and cooked throughout, about 5 minutes. (Depending on your broiler, you may need to rotate the pan after 2 or 3 minutes for even cooking.) Serve with yogurt ranch for dipping or drizzling, if desired."}]}