{"@context": "http://schema.org", "@type": "Recipe", "name": "Lentil and Orzo Stew With Roasted Eggplant", "description": "For rich, golden cubes of roasted eggplant, a high-temperature oven is crucial. Here, lentils and pasta make for a hearty stew, and the coriander seeds introduce a robust, clean flavor. Use a mortar and pestle, a spice grinder or the base of a wine bottle to crush the seeds, opening them up before they’re tossed with the eggplant. Serve this stew warm or hot, topped with an aged, salty cheese like ricotta salata or feta, and a soft-poached egg if you like. The lemon zest and juice are essential and enhance the finish.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2018/12/18/dining/YK-orzo-and-lentils/YK-orzo-and-lentils-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "coriander, eggplant, lentils, orzo, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 782}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 608, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "69 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "13 grams", "proteinContent": "25 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1472 milligrams", "sugarContent": "15 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds eggplant (2 small or 1 large, skin on, or peeled, if desired), chopped into 1-inch pieces", "1/4 cup plus 2 tablespoons olive oil", "1 tablespoon coriander seeds, crushed", "Kosher salt and black pepper", "1 medium carrot, finely chopped", "1 medium yellow onion, finely chopped", "2 celery stalks, finely chopped", "3 garlic cloves, finely chopped", "1 tablespoon tomato paste", "1 cup dried lentils (green, black or brown)", "5 cups chicken or vegetable stock, or water", "1/2 cup orzo or other small pasta, such as ditalini, stelline or macaroni", "Zest and juice from 1 lemon, plus 4 lemon wedges for garnish", "1/4 cup shaved ricotta salata or crumbled feta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. In a large bowl, toss the eggplant with 1/4 cup olive oil and crushed coriander seeds until coated; season with salt and pepper. Arrange in an even layer on a large rimmed baking sheet and roast until eggplant is tender and golden brown, 25 to 30 minutes, giving the baking sheet a shake halfway through roasting to toss the eggplant pieces for even cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat the remaining 2 tablespoons oil over medium. Add the carrot, onion and celery. Season with salt and pepper. Cook, stirring frequently, until vegetables are softened, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the garlic and tomato paste and cook, stirring occasionally, until tomato paste begins to darken on the bottom of the pan, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the lentils until coated. Pour in stock or water and bring to a boil over high heat. Lower to medium and simmer until lentils are tender, 20 to 30 minutes, depending on the type and age of lentils you use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the orzo and cook until softened, 8 to 10 minutes. Remove from heat and stir in the lemon zest and juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season to taste with salt and pepper. Top with the roasted eggplant pieces and large shavings of ricotta salata, and serve with lemon wedges for squeezing."}]}