{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Roasted Tomato Sauce With Pasta", "description": "Instead of standing over a bubbling cauldron all day long, wondering how many dots of sauce you can collect on your apron, let the oven do all the work. You’ll want to use canned tomatoes here, rather than fresh ones, because you can trust that the canned ones were picked at peak season, their flavors amplified by being preserved in a can with a little salt. By roasting them in a low oven for a few hours, you’re effectively adding umami to an already umami-packed ingredient. Well, the oven is. You’re not doing a thing except boiling some pasta, and eventually, marveling at how such a rich red sauce came from such humble, any-season ingredients.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2018/09/13/dining/as-slow-roasted-tomato-sauce/as-slow-roasted-tomato-sauce-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, for two, lunch, quick, weekday, pastas, vegetables", "keywords": "canned tomatoes, hot sauce, pasta, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 142}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 610, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "100 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "11 grams", "proteinContent": "18 grams", "saturatedFatContent": "2 grams", "sodiumContent": "699 milligrams", "sugarContent": "13 grams", "transFatContent": null}, "recipeIngredient": ["2 (28-ounce) cans whole, peeled tomatoes", "6 garlic cloves, peeled", "1/4 cup olive oil", "2 teaspoons hot sauce of choice (optional)", "1/2 teaspoon kosher salt, plus more as needed", "1 pound mezze rigatoni, penne or other tubular pasta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees. Drain the tomatoes, then transfer them to a baking sheet. Gently break the tomatoes up with your hands or kitchen scissors into a mix of big and little chunks. Stir in the garlic, olive oil, hot sauce, if using, and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast, stirring occasionally (and more frequently after the first hour of cooking), until the tomatoes turn dark red and the edges begin to caramelize, about 2 hours. Mash with a fork to break up the garlic and any remaining chunks of tomato."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot or Dutch oven of heavily salted water to the boil. Cook your pasta al dente according to package directions. Reserve 1 cup of the pasta water, and drain the pasta. Return the pot to the stove, turn the heat to medium-high, then add the tomato sauce and 1/2 cup of pasta water. Let simmer until combined, glossy and saucy, about a minute or 2, adding more pasta water as needed. Add the pasta and toss to coat."}]}