{"@context": "http://schema.org", "@type": "Recipe", "name": "Upside-Down Date Cake With Marmalade", "description": "The upside-down cake never goes out of style — and it can be revived again and again by exploring different flavor combinations. This one tops a medjool-date studded cake with a vibrant kumquat marmalade and a Cognac mascarpone. It can be served warm for dessert, or at room temperature for a casual afternoon treat. Any leftover marmalade can be stored in the fridge and will breathe new life into your morning toast.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2018/12/19/dining/19ottorex2/19ottorex2-articleLarge.jpg", "totalTime": "PT3H15M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "almond flour, cognac, demerara sugar, kumquats, mascarpone, medjool dates, tangerine, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 83}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 921, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "125 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "6 grams", "proteinContent": "10 grams", "saturatedFatContent": "25 grams", "sodiumContent": "407 milligrams", "sugarContent": "100 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3/4 pound/350 grams kumquats or tangerines", "3 whole star anise", "2 cinnamon sticks", "1/4 teaspoon vanilla bean paste or extract", "1 1/2 cups/300 grams granulated sugar (caster sugar)", "3 tablespoons lemon juice", "2 tablespoons orange juice", "1 tablespoon Cognac", "3/4 cup/170 grams unsalted butter (1 1/2 sticks), at room temperature, plus more for greasing the pan", "1 1/3 cup/175 grams all-purpose flour (plain flour)", "1/2 cup/50 grams almond flour (ground almonds)", "2 teaspoons baking powder", "2 teaspoons ground star anise", "1/2 teaspoon salt", "3/4 cup plus 2 tablespoons/170 grams Demerara sugar", "3 large eggs", "8 ounces/225 grams medjool dates, pitted and chopped into 1/2-inch/1-centimeter pieces", "1/3 cup/70 milliliters whole milk, at room temperature", "8 ounces/250 grams mascarpone", "1 cup/250 milliliters heavy whipping cream (double cream)", "3 tablespoons confectioners’ sugar (icing sugar)", "1 tablespoon Cognac"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the marmalade: Trim and discard the ends of the kumquats, slice the kumquats into 1/8-inch/1/4-centimeter rounds and discard the seeds (pips). If using tangerines, quarter them lengthwise then cut them into 1/8-inch/1/4-centimeter-thick slices. Transfer the fruit and the star anise, cinnamon, vanilla and 2 cups/450 milliliters water to a large saucepan. Bring to a boil over medium-high heat and cook until the fruit has softened, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sugar and lemon juice and cook, stirring often, until the marmalade darkens and has a loose, jam-like consistency, adjusting the temperature as necessary to maintain a rapid bubble, 15 to 25 minutes, depending on the juiciness of your fruit. (You don’t want to overcook the marmalade, as it will continue to thicken as it cools.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat and stir in the orange juice and Cognac. Let cool at least 1 hour. (We like the look and flavor of the star anise and cinnamon sticks, but feel free to remove them at this point, if you like.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake: Heat oven to 350 degrees Fahrenheit/160 degrees Celsius. Butter the bottom and sides of an 8-inch/20-centimeter springform cake pan (cake tin) and line the bottom and sides with parchment paper. Measure out 1/4 cup marmalade and set aside. Spoon 1 cup/250 grams marmalade into the pan, leaving a 3/4-inch/2-centimeter border around the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together the flour, almond flour, baking powder, ground star anise and salt and set aside. Place the 3/4 cup/170 grams butter and the Demerara sugar in the bowl of a stand mixer. Using the paddle attachment, mix on medium speed until light and fluffy, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the speed to medium-low and add the eggs one by one, scraping down the bowl as needed, until combined, about 2 minutes. Add the dates and mix for 30 seconds on medium speed. On low speed, add the flour mixture, followed by the milk and mix until well combined, about 30 seconds more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the batter into the prepared pan, starting around the perimeter of the pan to keep the marmalade in place, then smooth the surface into an even layer. Transfer the pan onto a baking sheet (tray). Bake until the cake springs back to a light touch in the center or a skewer inserted into the center of the cake comes out clean, 60 to 75 minutes, rotating the cake halfway through baking. Let cool for 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the Cognac mascarpone: Combine all the ingredients in the bowl of a stand mixer. Using the whisk attachment, whisk on medium-high speed until smooth and thickened, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully release the sides of the cake pan and invert a serving plate over the top of the pan. Flip the whole thing over and carefully remove the paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently warm the reserved 1/4 cup marmalade and spoon evenly over the top of the cake. Slice with a sharp knife and serve warm, with the Cognac mascarpone alongside."}], "link": "https://cooking.nytimes.com/recipes/1019825-upside-down-date-cake-with-marmalade"}