{"@context": "http://schema.org", "@type": "Recipe", "name": "Chinese-Style Breakfast Egg Wrap (Jian Bing)", "description": "Throughout northern China and Taiwan, street vendors start peddling jian bing as the sun rises. They spread the wheat flour and mung bean batter on a large griddle and spread it thin, then crack an egg or two on top. They scatter on scallions, cilantro and pickled mustard greens, and scramble and spread the mix before squirting on hoisin sauce and chile paste. Sometimes, they add sliced lettuce or wonton crisps for crunch. Making jian bing is a specialized skill and not easily recreated, but this approximation delivers the pleasure and convenience of an omelet cooked onto a thin pancake, the pancake here being store-bought flour tortillas. When warmed, they share the comforting chewiness of the original. This version uses a few essential condiments: Pickled mustard greens, hoisin and chile paste can be found in Chinese or Asian markets or online. But you can, of course, leave them out. In fact, kids often prefer just the egg and tortilla.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2018/09/08/dining/ko-jian-bing-horizontal/ko-jian-bing-horizontal-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "1 wrap", "recipeCuisine": "chinese", "recipeCategory": "breakfast, brunch", "keywords": "cilantro, egg, mustard greens, scallion, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 214}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 418, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "2 grams", "proteinContent": "17 grams", "saturatedFatContent": "5 grams", "sodiumContent": "512 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 large eggs", "Kosher salt", "1 (8-inch) flour tortilla", "1 tablespoon vegetable oil", "1 scallion, thinly sliced (about 2 tablespoons)", "2 tablespoons chopped fresh cilantro (about 4 sprigs)", "1 tablespoon Chinese pickled mustard greens (optional)", "Hoisin sauce, chile paste and sesame seeds, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs and 1/4 teaspoon salt with a fork until almost blended with some yellow streaks remaining."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a small nonstick skillet over medium heat. Put the tortilla in it and turn until warm and pliable, about 1 minute. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise the heat to medium-high. Add the oil to the skillet, then the scallion and 1/8 teaspoon salt. Cook, stirring, until just bright green and tender, about 30 seconds. Add the eggs, vigorously stir with a silicone spatula to scramble lightly, then quickly spread in an even layer. Scatter on the cilantro and pickled greens, if using, then immediately press the warmed tortilla on top and let cook until the egg just sets and sticks to the tortilla, about 30 seconds. Flip onto a plate, egg facing up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using, drizzle the hoisin sauce and chile paste over the egg and sprinkle with sesame seeds. Fold in quarters and serve immediately or wrap in foil to eat out of hand."}], "link": "https://cooking.nytimes.com/recipes/1019522-chinese-style-breakfast-egg-wrap-jian-bing"}