{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Almond Cake With Lemon Glaze", "description": "Most lemon cakes rely on zest and juice for flavor. This one uses the whole fruit, pith and all, for an intense citrus flavor. There’s also almond flour in the batter, which gives the cake a dense richness. If you can get Meyer lemons, use them here. Most likely the hybrid of a lemon and a mandarin, Meyer lemons, with thin skins and plenty of juice, are a bit sweeter and less acidic than regular lemons.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/10/24/dining/24apperex1/24apperex1-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "almond extract, almond flour, meyer lemon, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 571}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 493, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "4 grams", "proteinContent": "11 grams", "saturatedFatContent": "6 grams", "sodiumContent": "238 milligrams", "sugarContent": "52 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons/55 grams unsalted butter (1/2 stick), melted and cooled, plus more for the pan", "1/2 cup/65 grams all-purpose flour, plus more for the pan", "3 medium lemons, preferably Meyer lemons", "2 cups/225 grams almond flour or meal (or ground almonds)", "1 teaspoon baking powder", "1/2 teaspoon fine sea salt", "5 large eggs, separated", "1 1/4 cups/250 grams sugar", "1/4 teaspoon almond extract", "1 to 1 1/2 cups/125 to 185 grams confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter and flour a 9-inch springform pan. Put 2 lemons in a medium pot and cover with water by at least 2 inches. Bring to a boil, partly cover pot, and let simmer for 40 minutes, or until very tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a slotted spoon to transfer lemons to a bowl. Let cool. Use a spoon to break open lemons and remove the pits. Purée lemons in a mini food processor or blender, scraping down the sides frequently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Zest remaining lemon into a medium bowl. (Save the rest of the lemon for glaze.) Stir in almond meal,   all-purpose flour, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer, beat egg whites until very foamy. With the mixer still going, gradually beat in 1/4 cup sugar, continuing to beat until stiff peaks form. Slide beaten whites onto a large plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same mixing bowl (you don’t need to wipe it out), beat egg yolks and remaining 1 cup sugar until thick and pale, about 1 minute. Beat in lemon purée, almond meal mixture and almond extract. Using a rubber spatula, fold in melted butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold a third of the egg whites into the yolk mixture to lighten it. Fold in another third until well incorporated. Finally fold in remaining egg whites, taking care not to overmix. (A few white streaks are O.K.) Spread batter into prepared pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until top of cake is well browned and it springs back when lightly pressed in the center, 45 to 60 minutes. Transfer to a wire rack to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cake is almost cool but still slightly warm (after about 30 to 45 minutes), make the glaze. Juice the zested lemon into a bowl and stir in confectioners' sugar until you have a thick but pourable glaze (if it’s too thick, stir in a few drops of water). Pour glaze over slightly warm cake and let cool completely."}]}