{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Scallop Pasta With Burst Tomatoes and Herbs", "description": "Although usually designated as a “something special” ingredient, scallops make a perfect weeknight dinner because they cook in minutes. To get a good, crisp sear, be patient (it's hard for us, too) and let the pan get quite hot before adding the scallops. Once you do, leave them alone to ensure a deeply golden crust. Toss them with pasta and candy-colored cherry tomatoes that burst and get coaxed into a jammy sauce. Finish with a showering of fresh, tender herbs and a drizzle of olive oil.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/02/04/dining/ch-pasta-with-scallops-tomatoes-and-herbs/merlin_149536239_0aa05c95-efc8-4938-a0d4-77cea46458b6-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, for two, quick, weekday, weeknight, pastas, seafood", "keywords": "dairy-free, herbs, pasta, scallops, shallot, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1006}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 453, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "5 grams", "proteinContent": "21 grams", "saturatedFatContent": "2 grams", "sodiumContent": "679 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Kosher salt and black pepper", "1 pound linguine fini or other long, thin pasta", "4 tablespoons olive oil, plus more for drizzling", "2 shallots, thinly sliced into rings", "1 1/4 pounds Sun Gold, cherry or grape tomatoes", "2 garlic cloves, thinly sliced", "Pinch of red-pepper flakes (optional)", "1 pound large sea scallops, patted dry", "1 1/2 cups roughly chopped mixed herbs, such as tarragon, mint, parsley and chives, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water (2 heaping tablespoons kosher salt to about 7 quarts water) to a boil. Add the pasta and cook according to package instructions until al dente. Reserve 1 1/2 cups pasta cooking water, then drain pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the pot and heat 2 tablespoons olive oil over medium. Add the shallots and cook until they begin to soften, 2 to 3 minutes. Add the tomatoes and cook, stirring occasionally, until they start to burst, 5 to 7 minutes. Add about 1/3 cup reserved pasta water, and press the tomatoes gently with the back of a spatula or wooden spoon to get them nice and jammy. Stir in the garlic and red-pepper flakes, if using, and cook, allowing the sauce to simmer, 1 to 2 minutes. Season with salt and pepper; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the scallops well on both sides with salt and pepper. In a 12-inch skillet, heat the remaining 2 tablespoons olive oil over high. When the oil shimmers, add the scallops, working in batches to avoid crowding the pan, and cook until golden brown and crisp, flipping once, 1 to 2 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta, 1 1/2 cups herbs and 1/4 cup reserved pasta water to the pot with the tomatoes and toss to coat, adding additional pasta water if needed. Divide the pasta among shallow bowls and top with scallops. Garnish with additional herbs and a drizzle of olive oil, if desired."}], "link": "https://cooking.nytimes.com/recipes/1019981-seared-scallop-pasta-with-burst-tomatoes-and-herbs"}