{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Tikka Masala", "description": "This creamy, spiced curry made with tomato and hunks of chicken is a longtime favorite of Indian food lovers. This version is streamlined a bit, making it not-quite-authentic, but truly accessible to anyone with a well-stocked pantry. It's also adapted for those without a grill, so the yogurt-marinated chicken spends a few minutes under the broiler to replicate the blackened, smoky bits. Finally, chicken breasts or thighs work equally well here.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/01/30/dining/30COOKING-CHICKEN-TIKKA-MASALA/30COOKING-CHICKEN-TIKKA-MASALA-mediumThreeByTwo440.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "indian", "recipeCategory": "curries", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1343}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 641, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "7 grams", "proteinContent": "53 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1314 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon garam masala", "2 teaspoons ground turmeric", "2 teaspoons ground cumin", "2 teaspoons hot paprika or 1 teaspoon cayenne", "1½ teaspoons kosher salt, plus more for seasoning", "1 teaspoon ground black pepper, plus more for seasoning", "1 1/2 cups whole-milk yogurt", "2 tablespoons fresh lemon or lime juice", "6 large cloves garlic, finely grated", "2-inch piece of ginger, finely grated", "2 pounds boneless, skinless chicken thighs, left whole, or breasts, cut in half lengthwise or in thirds if extra large", "2 tablespoons vegetable oil or ghee", "1 large yellow onion, thinly sliced", "3 tablespoons tomato paste", "1 (28-ounce) can whole tomatoes", "3/4 cup heavy cream", "1 1/2 cups coarsely chopped cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine garam masala, turmeric, cumin, paprika, 1½ teaspoons kosher salt and 1 teaspoon black pepper in a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk 1 cup yogurt, lemon juice, 3 cloves of garlic, half the ginger and half the spice mixture together. Add chicken and toss to coat. Cover and chill at least 4 hours, up to 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat oil in a large, heavy bottomed pot over medium heat. Add onion and cook, stirring occasionally until lightly browned in spots, about 5 to 8 minutes. Add tomato paste, remaining garlic, ginger and spice mixture and cook, stirring frequently until spices are fragrant and tomato paste has started caramelizing on the bottom of the pot, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crush tomatoes with your hands, leaving some larger bits and add them and any liquid left in the can to the pot along with the heavy cream and 1 cup water. Season with salt and pepper and stir, scraping up any bits from the bottom of the pot. Bring to a simmer and reduce heat to medium-low and cook, stirring occasionally until flavors meld and the sauce is thickened slightly, 20 to 25 minutes. Remove from heat and cover until chicken is ready (or after cooling, refrigerate if marinating chicken for more than 4 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once chicken is ready, turn on the broiler and place oven rack about 6 inches away from heat source."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a rimmed baking sheet with aluminium foil and place a wire rack inside the pan. Remove chicken from the marinade, scraping off any excess, and place the pieces on the rack. Broil just until lightly charred in spots, 5 to 7 minutes on the first side, before flipping pieces and broiling an additional 2 to 3 minutes.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring tomato sauce to a simmer if it’s not already. Remove chicken from the oven and transfer to spiced tomato sauce along with remaining ½ cup yogurt. Continue to simmer until chicken is cooked through and sauce is thickened nicely, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide chicken among four bowls and top with cilantro. Serve with rice or naan for dipping."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Chicken Tikka Masala", "description": "Learn to make the classic curry.", "thumbnailUrl": "https://static01.nyt.com/images/2018/01/30/dining/30COOKING-CHICKEN-TIKKA-MASALA/30COOKING-CHICKEN-TIKKA-MASALA-mediumThreeByTwo440.jpg", "uploadDate": "2018-02-22T16:02:34.000Z", "duration": "PT1M50S"}}