{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted-Mushroom-and-Broccoli Grain Bowls", "description": "Full of chewy grains, caramelized broccoli and juicy mushrooms, this delicious blend of textures and flavors can feel like the best way to get your vitamins and fiber. The omelet ribbons come together almost like fettuccine on top, and <a href=\"https://cooking.nytimes.com/recipes/1019272-lemon-herb-buttermilk-dressing\">the lemony, herbal buttermilk dressing</a>  lends the bowl some decadence. If you have the vegetables and grains already cooked and stashed in the fridge, this dish comes together in just a few minutes. Feel free to use any combination of roasted vegetables and grains you like — this recipe can be a template for all your leftovers. ", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2018/04/15/magazine/15mag-eat1/15mag-eat1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 servings, plus leftovers", "recipeCuisine": "", "recipeCategory": "", "keywords": "broccoli, egg, portobello, wheat berries, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 440}, "recipeIngredient": ["1 1/2 pounds broccoli", "Salt", "Olive oil, as needed", "1 pound portobello or other mushrooms, in 3/4-inch pieces", "2 eggs", "2 cups cooked grains (wheat berries, brown rice, farro, quinoa, couscous, wild rice, etc.), warm", "Lemon-herb buttermilk dressing, to taste <a href=\"https://cooking.nytimes.com/recipes/1019272-lemon-herb-buttermilk-dressing\">(see recipe)</a>", "Toasted almonds or peanuts, for garnish (or toasted bread crumbs, or potato sticks, or wasabi peas, just anything you like for crunch)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the vegetables: Cut the broccoli into bite-size florets. Peel the stems, and cut these into 3/4-inch pieces. In a large bowl, season the broccoli well with salt, and toss with 3 or 4 tablespoons of olive oil to coat. Spread it out in one layer on a sheet pan. Season and oil the mushrooms the same way, and spread them out on a separate sheet pan. Roast the vegetables until the mushrooms are browned but still juicy and the broccoli has charred edges, 25 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the omelet ribbons: In a small bowl, beat the eggs with a couple pinches of salt. Heat a large nonstick sauté pan over medium heat until hot. Add 1 to 2 teaspoons of oil. When the oil slips around the pan like water, add half the egg, and swirl to coat the pan. Cook until set, about 30 seconds. Use a spatula to roll the omelet up like a jellyroll toward the edge of the pan, then turn it out onto a cutting board. Repeat with the rest of the egg. Slice the omelets into 1/4-inch-thick ribbons."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, season and dress the warm grains with salt and the dressing to taste. Divide among bowls. Top the grains with some mushrooms and broccoli, drizzling on a little more dressing. Top with the omelet ribbons and your crunchy garnish, and eat. Use the leftovers to make this again."}]}