{"@context": "http://schema.org", "@type": "Recipe", "name": "Velvet Fish With Mushrooms", "description": "Here’s a recipe that takes its flavor inspiration from a dish served at Nancy Xiao’s restaurant China Xiang, in the theater district of Manhattan: a sweet-salty rice wine sauce over velveted fish. Its preparation owes much to the teachings of the classic 1969 cookbook “Chinese Gastronomy,” by Tsuifeng Lin and Hsiang Ju Lin, and the advice of the chef Jonathan Wu. It is what the Lins call “two-passes” cooking, with the fish cooked twice, first to velvet it, then to cover it with sauce. (It’s important, Wu notes, not to think of it as stir-frying with high heat but as gentle, careful cooking that does not break up the fish.) It’s great with flounder as at China Xiang, but also with tilapia, with halibut, with whatever firm-fleshed white fish you can find at the market. You can substitute firm tofu in place of the fish, or go half and half. It’s a dish to fall in love with, to make your own.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2018/09/09/magazine/09mag-eat-image1/09mag-eat-image1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "chinese", "recipeCategory": "seafood", "keywords": "main course, mushroom, oyster sauce, rice wine, scallion, white fish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 375}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 212, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "1 gram", "proteinContent": "17 grams", "saturatedFatContent": "1 gram", "sodiumContent": "742 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons egg white, lightly beaten", "2 tablespoons plus 1 teaspoon cornstarch", "2 tablespoons plus 1 teaspoon Chinese rice wine or sake", "1/2 teaspoon kosher salt", "1 pound firm-fleshed, thick white fish fillets, like flounder, cod or halibut", "6 dried wood-ear mushrooms or shiitake mushrooms", "1 teaspoon plus 2 tablespoons neutral oil", "1 teaspoon oyster sauce", "1 tablespoon dark soy sauce", "1 tablespoon low-sodium soy sauce", "1/4 teaspoon Chinese black vinegar", "1/2 teaspoon white vinegar", "3/4 teaspoon white sugar", "1 tablespoon sliced scallions, white part only", "1 tablespoon minced garlic", "1 tablespoon minced ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the egg white into a medium-size bowl, then add to it 1 tablespoon plus 1 teaspoon cornstarch, 1 tablespoon plus 1 teaspoon rice wine and salt, and whisk until all the cornstarch has dissolved. Use a chef’s knife held at a 45-degree angle to the cutting surface to slice the fish fillets crosswise into 1/2-inch slices. Add the fish to the cornstarch mixture, then carefully toss it to coat the fish, and set aside to marinate for 30 to 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the mushrooms in a small bowl, then pour hot water over them and allow them to soak for 20 minutes or so, until they are very soft. Remove the mushrooms from the water and dry them, then thinly slice each mushroom. (Reserve the mushroom-soaking liquid.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce. Combine the oyster sauce, the remaining tablespoon of rice wine, soy sauces, vinegars and sugar in a bowl, then whisk to combine. Sprinkle in the remaining tablespoon cornstarch, and whisk to dissolve it into the sauce. Add a tablespoon of the mushroom-soaking liquid or water, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Velvet the fish. Fill a wok or large pot with water, and bring to a boil over high heat. Add a teaspoon of oil to the boiling water. Carefully add the fish to the water, piece by piece, working in batches so as not to crowd the pieces. Allow the fish to cook until it has turned opaque, approximately 1 to 2 minutes, depending on the thickness of the fillets. Using a skimmer or spider, transfer the fish carefully to a platter to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish the dish, heat the remaining 2 tablespoons oil in a wok or large skillet set over high heat. When the oil shimmers and is about to smoke, add the scallions, garlic and ginger, and stir-fry for 30 seconds, or until the mixture is fragrant. Add the mushrooms, and continue to stir-fry for an additional 30 seconds. Stir the sauce mixture, and add it to the wok, then cook for 2 to 3 minutes, until it has thickened slightly. If it is too thick, thin it out with some of the mushroom-soaking liquid. Add the fish to the wok, and carefully toss until the flesh is coated. Transfer the mixture to a warm platter, and serve immediately."}]}