{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Spaghetti and Meatballs", "description": "Spaghetti and meatballs isn’t necessarily any faster when made in an electric pressure cooker, but it does take away a lot of hands-on work. And it can all be done in one pot instead of the usual two to three it would take on the stove. Here, the meatballs, which are not fried but cooked entirely in the sauce, are gently spiced and very tender — the height of kid-friendly cuisine. The ricotta topping is optional, but it makes the whole thing especially creamy and rich. If you have some homemade marinara sauce in the freezer, or a favorite store-bought kind, you can substitute 3 1/4 cups of it here. Olive fans take note: Adding 1/4 cup sliced pitted olives to the sauce will probably make you very happy come dinnertime.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/01/02/dining/02appetite2/merlin_148492107_c986aef4-a994-448b-a69e-63ca7e37e819-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas", "keywords": "basil, crushed canned tomatoes, ground beef, spaghetti, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 446}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 743, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "6 grams", "proteinContent": "37 grams", "saturatedFatContent": "13 grams", "sodiumContent": "961 milligrams", "sugarContent": "11 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "2 garlic cloves, very thinly sliced", "1/4 teaspoon red-pepper flakes", "1/4 teaspoon freshly ground black pepper", "1 (28-ounce) can crushed tomatoes", "1 teaspoon kosher salt", "2 basil sprigs, plus more thinly sliced for serving", "8 ounces spaghetti (not thin spaghetti), broken in half", "2 tablespoons grated Parmesan, plus more for serving", "1 cup ricotta (optional)", "1 pound ground beef (or substitute veal, pork or turkey)", "1/4 cup panko bread crumbs", "1/4 cup grated Parmesan", "2 tablespoons chopped basil", "1 large egg", "1 teaspoon kosher salt", "1 to 2 garlic cloves, finely grated or minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set pressure cooker to the sauté function, and heat 2 tablespoons oil in the pot. Stir in garlic, red pepper and black pepper, and cook for 1 minute or until fragrant. Stir in tomatoes, salt and basil sprigs; cook, stirring occasionally, for 10 minutes (lower the sauté function to low or briefly turn the machine off if the sauce splatters too much)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the meatballs: In a large bowl, mix together beef, bread crumbs, Parmesan, chopped basil, egg, salt and garlic. Roll into 1 1/4-inch balls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 1 cup water into sauce in pot, scraping up any browned bits on bottom of pot (if you don't do this, the burn light may turn on). Scatter uncooked spaghetti over the sauce. Drizzle remaining 1 tablespoon oil over spaghetti, stirring gently (try to keep the spaghetti on top of the sauce), then top with meatballs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and cook on high pressure for 5 minutes. Manually release the pressure, then remove the cover and stir to separate the spaghetti. Stir in 2 tablespoons Parmesan. At this point, the pasta will be almost but not quite cooked through. Place the top back on the pressure cooker (loosely) and let it sit for 3 to 10 minutes, until the sauce has thickened and spaghetti is al dente but not mushy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve dolloped with ricotta, if using, and sprinkled with thinly sliced basil and more Parmesan if you like."}], "link": "https://cooking.nytimes.com/recipes/1019870-pressure-cooker-spaghetti-and-meatballs"}