{"@context": "http://schema.org", "@type": "Recipe", "name": "Ratatouille Pie", "description": "In this buttery, rustic pie, chunks of eggplant, zucchini and tomato are roasted with olive oil until velvety soft, then covered in a cheesy, mayonnaise-spiked custard. Chopped olives scattered on top cut through the richness and give the whole thing a salty tang. It's the perfect next-day use for ratatouille, should you have some. Use it here instead of roasting the vegetables. You’ll need about 3 to 4 cups (enough to fill the pie crust two-thirds of the way up). You can parbake the crust, roast the vegetables and make the custard the day before, but don’t bake everything together until the day of serving.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/08/29/dining/29appe1-sub/merlin_142593993_9440b6f0-479b-4dd4-abc9-60d9481fc66e-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "brunch, dinner, lunch, pies and tarts, vegetables", "keywords": "cherry tomatoes, eggplant, gruyère, zucchini, main course, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 476}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 465, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "13 grams", "sodiumContent": "566 milligrams", "sugarContent": "5 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 cups/160 grams all-purpose flour", "1/2 teaspoon kosher salt", "1/2 teaspoon sugar", "1/2 cup/113 grams unsalted butter (1 stick), cut into cubes, plus more for buttering foil", "1/3 cup ice water, plus more if needed", "1 large eggplant (about 1 1/2 pounds), cut into 3/4-inch cubes", "1/2 cup extra-virgin olive oil", "5 garlic cloves, smashed and peeled", "1 tablespoon rosemary leaves, chopped", "1 tablespoon thyme leaves", "Kosher salt, as needed", "1 cup cherry tomatoes, cut in half", "1 large white onion, sliced 1/4-inch thick", "1 small zucchini or summer squash, cut into 3/4-inch cubes (about 7 ounces)", "1 large egg", "3/4 cup coarsely grated white Cheddar or Gruyère", "1/4 cup freshly grated Parmesan", "1/3 cup mayonnaise", "1/4 teaspoon black pepper, plus more as needed", "1/2 cup basil leaves, chopped", "1 small plum tomato, sliced 1/4-inch thick (optional)", "1 tablespoon chopped Moroccan black olives (or other good black olives)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a large bowl, mix together flour, salt and sugar to combine. Mix in cubed butter with your hands, pinching and squeezing the butter cubes (or use a pastry blender or food processor) until the largest pieces are the size of lima beans. Drizzle in the water a little at a time, mixing until the dough starts to come together into a mass. You may not need all the water, or you may need to add more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When dough is starting to hold together but is still somewhat crumbly, transfer it to a lightly floured surface and press and knead it together into a smooth ball. Flatten into disk, wrap in plastic wrap and chill for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While dough chills, heat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a rimmed baking sheet, toss together eggplant, 1/4 cup oil, 2 garlic cloves, 1 1/2 teaspoons rosemary, 1 1/2 teaspoons thyme and 1/4 teaspoon salt. On a second rimmed baking sheet, toss together the cherry tomatoes, onion slices, 2 tablespoons oil, 2 garlic cloves, 1 teaspoon rosemary, 1 teaspoon thyme and 1/4 teaspoon salt. On a third rimmed baking sheet (or roasting pan if you don’t have any more baking sheets), toss together zucchini, 2 tablespoons oil, 1 garlic clove, 1/2 teaspoon rosemary, 1/2 teaspoon thyme and a large pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place all the pans in the oven (or work in batches if they don’t fit at once) and roast until vegetables are browned, tossing every 10 minutes or so; about 35 minutes for onions, tomatoes and zucchini, and 45 minutes for eggplant. Remove from oven and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a floured surface, roll out dough to a 12-inch circle, then transfer to a 9-inch pie pan. Crimp edges to make a decorative crust. Use a fork to prick holes in bottom and sides of dough. Chill for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise oven temperature to 425 degrees. Place pie shell on a rimmed baking sheet. Line dough with foil, fill with pie weights and bake for 15 minutes. Remove foil and weights, and continue baking until the dough is just baked through and barely turning golden on the edges, 5 to 10 minutes longer. Transfer to a wire rack to cool. Reduce oven temperature to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, beat egg until well mixed, then fold in both cheeses, mayonnaise, a pinch of salt and 1/4 teaspoon pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape all roasted vegetables into a large bowl, add basil, and toss well. Taste and season with more salt and pepper if needed. Spoon mixture into the baked pie shell, then top with cheese mixture. Arrange plum tomato slices on top, if using, and scatter with olives."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until filling is lightly golden, about 30 minutes. Cool for at least 20 minutes before serving warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1019497-ratatouille-pie"}