{"@context": "http://schema.org", "@type": "Recipe", "name": "Stock-and-Cider-Brined Chicken Over Stuffing", "description": "This one-pan dinner is ugly — rustic, if we’re being kind — but good. Or as the Italians say, “brutta ma buona.” Truly, though, it’s everything you could ask for in a rich, comforting meal. As it cooks, the chicken, brined in stock and cider, drips its flavorful juices onto the bread. The bread absorbs every drop, turning into a chewy, savory nest cradling the tender, perfectly browned chicken. Each bit of stuffing offers a different surprise — sometimes the sweet-and-sour zing of a prune, other times the faint rumor of Thanksgiving whispered by celery and thyme. It’s as satisfying as you could ever hope, even if it isn’t particularly attractive.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2019/01/13/magazine/13mag-Eat-image1/13mag-Eat-image1-articleLarge.jpg", "totalTime": "PT9H30M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, poultry", "keywords": "apple cider, chicken stock, chicken thighs, prune, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 489}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 872, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "8 grams", "proteinContent": "43 grams", "saturatedFatContent": "17 grams", "sodiumContent": "1160 milligrams", "sugarContent": "25 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["6 tablespoons unsalted butter, divided", "1 medium yellow onion, diced into 1/2-inch pieces", "3 celery ribs, diced into 1/2-inch pieces", "2 medium carrots, peeled and sliced into 1/2-inch pieces", "1 tablespoon plus 1 teaspoon fine sea salt, divided", "1/2 teaspoon freshly ground black pepper", "1 1-pound loaf crusty country bread", "1 1/2 cups sodium-free chicken stock, preferably homemade or purchased from a butcher", "1 1/2 cups apple cider", "1 cup quartered pitted prunes", "2 tablespoons apple-cider vinegar", "2 1/2 pounds (6 to 8 large) bone-in, skin-on chicken thighs", "2 tablespoons finely chopped sage", "2 tablespoons finely chopped parsley", "1 tablespoon finely chopped thyme", "Optional: 1 1/2 cups cooked, chopped leafy greens like kale, chard or broccoli rabe"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the brine: Melt 3 tablespoons of the butter in a 10-inch cast-iron skillet or similar pan over medium-low heat. Add onion, celery and carrots, 1/2 teaspoon of the salt and the pepper. Cook, stirring occasionally, until the vegetables are all tender, about 20 minutes. Transfer to a plate, and cool to room temperature in freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the vegetables cool, cut the bread into 3/4-inch cubes and spread into a single layer on a baking sheet. Allow to dry out overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the stock and cider in a large measuring cup and pour 1 1/2 cups of the mixture into a plastic gallon-size zipper bag. Add vegetables, remaining salt, prunes, vinegar and chicken thighs. Seal bag, and massage everything around to dissolve salt and combine. Refrigerate 8 hours or overnight. Cover and refrigerate remaining stock-cider mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook the chicken: Allow chicken to come to room temperature. Heat oven to 400. Scraping off brine and vegetables, remove chicken from bag, and set aside. Place brine with vegetables and remaining stock-cider mixture in a 10-inch cast-iron skillet or similar pan, and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine cubed bread, vegetables and liquid, sage, parsley, thyme and greens, if using. Return pan to low heat, and add remaining 3 tablespoons butter to melt. Pack stuffing mixture into pan, and lay chicken thighs on top. Place pan onto a rimmed baking sheet to catch any overflow, and bake on lower rack for 50 to 55 minutes until chicken and stuffing are golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow to cool for 10 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1019896-stock-and-cider-brined-chicken-over-stuffing"}