{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish Koftas in Tomato and Cardamom Sauce", "description": "On first inspection, this dish looks like herb-flecked meatballs in tomato sauce, but the sauce is spiced, tangy and aromatic, and the meatballs are, well, fish balls, made of a combination of mackerel and sardines. We use tinned sardines here, for ease, but you can obviously substitute with fresh sardines, scaled and boned. You'll also want to pay attention to the total weight or volume of the mackerel: Some types are larger than others. All work here, but you may not need to buy as many fillets. Serve with some couscous or rice and a spoonful of yogurt, if you like.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2018/05/16/dining/16ottorex1/merlin_137834622_1ebd5480-a425-4e80-b958-dbbf38c176dd-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, meatballs, seafood", "keywords": "cardamom, mackerel, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 91}, "recipeIngredient": ["1/3 cup/75 milliliters olive oil", "8 garlic cloves, finely chopped", "3 green chile peppers, such as serrano, finely sliced (and seeded if you don’t like heat)", "Salt", "2 large celery stalks, trimmed and finely chopped", "1 banana shallot (or a large regular shallot), finely chopped", "1 pound/500 grams ripe vine tomatoes (4 to 5 medium), blitzed in a food processor for 1 minute (or use 2 cups canned tomato purée)", "3 tablespoons tomato paste", "2 teaspoons granulated or caster sugar", "1 1/2 teaspoons ground cumin", "1 teaspoon lime zest, plus 1 tablespoon lime juice (from 1 lime)", "8 cardamom pods, crushed in a mortar and pestle, skins discarded (or use a scant 1/2 teaspoon ground cardamom)", "3/4 cup plus 2 tablespoons/200 milliliters dry white wine", "2 tablespoons/5 grams finely chopped cilantro or coriander leaves, for serving", "2 tablespoons/5 grams finely chopped dill, for serving", "4 mackerel fillets (from 2 roughly 1-pound/500-gram fish), skin and pin bones removed, flesh roughly chopped into 3/4-inch/2-centimeter pieces (for about 12 ounces/320 grams of chopped fish)", "About 5 ounces/150 grams drained tinned sardines in olive oil, roughly chopped", "1 heaping tablespoon/10 grams pistachios, roughly chopped", "1/2 cup/10 grams loosely packed roughly chopped fresh dill", "1 loosely packed cup/15 grams roughly chopped fresh cilantro leaves (coriander leaves)", "1 tablespoon finely grated zest (from 2 limes); cut the zested limes into wedges or juice them, for serving", "1 green chile pepper (such as serrano), finely chopped", "1 egg, beaten", "5 tablespoons/70 grams potato flour, divided", "3 tablespoons/50 milliliters vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start with the sauce: In a large sauté pan (choose one that has a lid), heat olive oil, garlic, half the sliced chile pepper and a good pinch of salt over medium-low heat. Gently fry for 6 minutes, stirring frequently, until garlic is soft and golden. Remove 2 tablespoons of the oil (with some of the chile and garlic) and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add celery, shallot and 1 1/2 teaspoons salt to the same pan and continue to cook for 8 minutes, stirring often, until soft and translucent. Increase the heat to medium, add the tomatoes, tomato paste, sugar, cumin, lime zest and juice and the cardamom and continue to cook for another 5 minutes, stirring occasionally. Add the wine, 1 1/2 cups/350 milliliters water and 1/4 teaspoon salt and bring to a gentle simmer. Cook for 20 minutes, turning the heat down if the sauce bubbles too much, and stirring once in a while."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sauce is simmering, make the fish koftas: Add fish, pistachios, herbs, lime zest, chile and egg to a bowl with 3 tablespoons potato flour and 1/8 teaspoon salt and mix together well. Grease your hands with a little oil and roll the mix into approximately 12 golf-sized balls (about 1 1/2 to 1 3/4 ounces/45 to 50 grams each), applying pressure to compact them as you go. Add the remaining 2 tablespoons/25 grams flour to a plate and roll each ball in the flour so they are coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat vegetable oil in a large, nonstick saucepan over medium-high heat. Once hot, add the fish balls and cook for about 5 minutes, turning throughout until all sides are golden-brown and crisp. (Remove the sauce from the heat and set aside if it finishes before you finish the koftas.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the sauce has been cooking for 20 minutes, transfer the balls into the sauce, drizzling over some of the frying oil (or return the sauce to medium heat). Cover the pan with the lid and cook for 4 minutes, until hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lid and scatter the herbs and the remaining fresh chile over the top, then drizzle with the reserved garlic and chile oil. Serve hot, with lime juice added to taste, or with lime wedges alongside."}], "link": "https://cooking.nytimes.com/recipes/1019307-fish-koftas-in-tomato-and-cardamom-sauce"}