{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Butter Rugelach", "description": "Apple butter, like applesauce, is made from apples that have been cooked down, but the process is taken even further. The result is a thick, caramelized paste that you can spread with a knife instead of eating it with a spoon. Here, it is paired with honey, walnuts and currants to make a fall-inspired rugelach cookie. The cream cheese in the dough gives it a pleasant tang and makes it super easy to work with.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2018/08/29/dining/seneviratne-apple-butter-rugelach/seneviratne-apple-butter-rugelach-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "32 cookies", "recipeCuisine": "american, jewish", "recipeCategory": "cookies and bars, pastries", "keywords": "apple butter, walnut, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 229}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 100, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "53 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 tablespoons/115 grams unsalted butter (1 stick), at room temperature", "4 ounces/115 grams cream cheese, at room temperature (3/4 cup)", "1/4 cup/50 grams granulated sugar", "1 teaspoon vanilla extract", "1/2 teaspoon kosher salt", "1 cup/130 grams all-purpose flour, plus more for rolling", "1/2 cup/130 grams unsweetened apple butter", "2 tablespoons honey", "2 tablespoons sugar", "3/4 teaspoon ground cinnamon", "1/2 cup/60 grams finely chopped walnuts", "1/4 cup/70 grams currants or chopped raisins", "1 large egg, beaten", "Demerara or sanding sugar, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: In a stand mixer or in a large bowl, using a handheld mixer, on medium, beat the butter, cream cheese, sugar, vanilla and salt until fluffy, about 2 minutes. Add the flour and beat until just combined. Don’t overwork it. Tip the dough out onto a piece of plastic wrap and press it together into a ball, using the wrap to help. Divide the dough in half. Shape each half into a 6-inch circle and wrap each with plastic wrap. Refrigerate for at least 2 hours and up to 3 days. (Dough can be frozen for up to 3 months.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix together the apple butter, honey, sugar and cinnamon. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a floured surface, roll one slab of dough out to a 11-inch circle with neat edges. (If, at any point, the dough becomes too soft, you can transfer it to a parchment-lined baking sheet and pop it in the fridge for a few minutes.) Spread half of the apple butter mixture on the top of the dough, leaving a 1/4-inch border. Sprinkle with half of the walnuts and half of the currants. With a pizza wheel or sharp knife, cut the dough into 16 equal triangles. Starting from the wide end, gently roll each triangle up and tuck the end under. Transfer to a parchment-lined rimmed baking sheet, at least 1 inch apart. Refrigerate for 15 minutes. Repeat with the remaining dough, apple butter mixture, nuts and dried fruit, and transfer to another prepared sheet. Refrigerate until cold, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Brush each cookie with the egg wash and sprinkle with sugar. Bake until they are puffed and golden brown, 15 to 20 minutes, rotating the sheets once. Transfer the sheets to a rack to cool."}], "link": "https://cooking.nytimes.com/recipes/1019532-apple-butter-rugelach"}