{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato Salad on Cumin-Spiced Yogurt", "description": "This simple tomato salad is ready in minutes, and works best with a mix of ripe tomatoes from the market that are delicious enough to eat raw. Layered on cumin-spiced yogurt, and slathered in a bright herb dressing, it’s hearty enough to have as a late summer meal with a piece of grilled bread. The recipe comes from chef Preeti Mistry, who ran a restaurant in Oakland called Juhu Beach Club, inspired by her unique experience as an Indian-American born in London to Asian parents from East Africa, raised in the American Midwest, who was cheffing in northern California.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/09/30/magazine/30mag-eat-image1/30mag-eat-image1-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "indian", "recipeCategory": "easy, quick, salads and dressings", "keywords": "dill, greek yogurt, tomato, turmeric powder, white wine vinegar, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 197}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 356, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "5 grams", "sodiumContent": "759 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 teaspoon cumin seeds", "1 cup full-fat Greek yogurt, plus 2 tablespoons", "1/4 teaspoon turmeric powder", "1 teaspoon kosher salt, divided", "1 clove garlic", "1 handful scallion greens", "1 handful dill", "1/4 cup mellow white wine vinegar", "Freshly ground black pepper, to taste", "1/2 cup neutral oil, such as grapeseed", "1 1/2 to 2 pounds ripe tomatoes, a variety of sizes and shapes, cut into wedges or halved if small", "Maldon salt, to finish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small, dry saucepan over medium heat, toast the cumin seeds until they are toasted and aromatic (do not let them burn!), about 2 minutes. Use a mortar and pestle or spice grinder to grind into a powder. In a small bowl, mix toasted cumin with 2 tablespoons yogurt, turmeric and 1/2 teaspoon salt, until no streaks remain. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dressing, put the garlic, herbs, yogurt, vinegar, 1/2 teaspoon salt and pepper in a food processor, and purée until smooth. With the machine running, pour the oil into the bowl in a slow steady stream. The dressing will become a thin, light green vinaigrette."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the salad, spread the remaining 1 cup yogurt on the bottom of a large serving dish. Toss the cut tomatoes with the vinaigrette, and pile them on top of the yogurt. Pour any remaining dressing all over the tomatoes and yogurt. Finish with a sprinkle of Maldon or other crunchy salt, and serve, spooning up the yogurt, tomatoes and dressing all together."}]}