{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate-Peanut Butter Swirl Cookies", "description": "These are like those three-ingredient peanut butter cookies everyone loves, but with a little cocoa powder and bittersweet chocolate thrown in to make them fancy. You only need five ingredients and a bit of elbow grease to put them together. While semisweet chocolate (in bar or chip form) would certainly work here, bittersweet chocolate is a better choice. The darker chocolate, along with the cocoa powder, adds a fruity bitterness that contrasts nicely with the sweet peanut butter.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2018/12/06/dining/ss-chocolate-peanut-butter-cookies/merlin_147610656_6885932b-c408-49d8-a373-5d429290e67a-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 2 dozen cookies", "recipeCuisine": "", "recipeCategory": "easy, snack, cookies and bars", "keywords": "bittersweet chocolate, chocolate, peanut butter, dessert, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 841}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 202, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "3 grams", "sodiumContent": "69 milligrams", "sugarContent": "21 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 (16-ounce/455-gram) jar smooth peanut butter (not natural)", "2 cups/400 grams granulated sugar, plus more for assembling", "3 large eggs", "3/4 teaspoon kosher salt", "1/2 cup/85 grams chopped bittersweet chocolate", "3 tablespoons cocoa powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Line two large rimmed baking sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with a whisk attachment, or using a handheld mixer, beat the peanut butter and sugar on high until creamy, about 2 minutes. Add the eggs and salt and beat on medium until well combined, about 1 minute. Transfer half the dough to a bowl or a clean work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chocolate, cocoa powder and salt to the remaining dough in the bowl of the electric mixer and beat on medium until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Portion the peanut butter dough into 1 tablespoon scoops and the chocolate dough into heaping 1 tablespoon scoops. Squeeze together one scoop of peanut butter dough and one scoop of chocolate dough and roll into a neat ball. Transfer the balls to the prepared pans, at least 1 1/2 inches apart. Using the flat bottom of a glass dipped in granulated sugar, press each ball into a flat circle that is 1/2-inch thick. (After pressing the first cookie, the glass will be greasy enough for the sugar to adhere to it.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cookies until set and slightly puffed, 14 to 16 minutes, rotating the sheets halfway through baking. Transfer the baking sheets to wire racks to cool. (Cookies will be quite crumbly and delicate right after baking and need a few minutes to firm up.)"}]}