{"@context": "http://schema.org", "@type": "Recipe", "name": "Garlicky Hasselback Sweet Potatoes", "description": "Tender in the middle, with charred ruffles on top, hasselback potatoes — sliced thinly all the way through so that they fan open like an accordion — are the ultimate treat for people who can’t choose between creamy and crisp. In this recipe, the sweet potatoes are halved first, so they cook faster and so their flat sides sear in the hot pan, leaving a caramelized edge. If your spice cabinet is fully stocked, try adding red-pepper flakes, smoked paprika or dried oregano to your garlic-butter mixture. A sprinkling of chopped parsley, right before you’re ready to eat, would also be welcome. Serve these as you would roasted potatoes, like alongside roast chicken.", "author": {"@type": "Person", "name": "Sarah Jampel"}, "image": "https://static01.nyt.com/images/2018/09/21/dining/sj-hasselback-pots/sj-hasselback-pots-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": " 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, vegetables", "keywords": "fall, winter, garlic, sweet potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 185}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 184, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "3 grams", "proteinContent": "2 grams", "saturatedFatContent": "4 grams", "sodiumContent": "333 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon plus 2 teaspoons olive oil", "2 medium sweet potatoes (about 8 to 10 ounces each), scrubbed and dried", "1 teaspoon kosher salt, plus more for seasoning", "2 tablespoons unsalted butter", "4 garlic cloves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Pour 1 tablespoon olive oil into a large cast-iron skillet, swirl it so it coats the whole pan, then put it in the oven while you cut the potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the potatoes in half lengthwise, place cut side down on a cutting board, then use a knife to make 1/8-inch slices on a slight bias from the top to the bottom of the potato half. Cut almost all of the way through the potato, stopping before you reach the bottom. (A serrated knife makes the job easier. You can also lay chopsticks down on either side of the potato to keep the knife from slipping through the potato.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove the skillet from the oven and nestle the sweet potato halves inside in a single layer. Drizzle the top of each with 1/2 teaspoon olive oil, sprinkle with salt, then bake for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add the butter to a small pot with 1 teaspoon salt. Grate the garlic into the pot with a microplane, then heat over low until the butter is melted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the sweet potatoes out of the oven and, keeping in mind that the pan is hot, use a fork or offset spatula to gently pry the slices apart so that there’s more room between each one. Use a brush to generously coat the potatoes with garlic butter (the more you get inside the slices, the better). Reserve any excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for an additional 10 minutes. For extra crisp edges, broil potatoes for 2 to 4 minutes, until the ruffles are charred. Brush with reserved garlic butter, and serve."}], "link": "https://cooking.nytimes.com/recipes/1019601-garlicky-hasselback-sweet-potatoes"}