{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Bean Stew With Fried Onions and Cilantro", "description": "Based on lobio, a Georgian stew, this is a warming, thick mix of simmered beans seasoned with both raw and fried onions, garlic and plenty of cilantro. In Georgia, the stew is sometimes spiked with a sour plum sauce called tkemali, which you can find at specialty markets or online. But if you can’t get it, pomegranate molasses (or even a good balsamic vinegar) will give the dish a similarly fruity tang. Note that the bean mixture will thicken as it cools, so be prepared to add a bit of water or broth upon reheating.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/02/21/dining/21appetite1/merlin_133673211_d48cb556-18fa-4a34-9c66-93a08ba7bffc-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "kidney bean, summer savory, tkemali, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 343}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 227, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "10 grams", "proteinContent": "13 grams", "saturatedFatContent": "0 grams", "sodiumContent": "185 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 pound dried red kidney beans, rinsed", "3 1/2 teaspoons fine sea salt, more as needed", "3 bay leaves", "4 cloves garlic, peeled", "1 1/2 cups packed cilantro leaves and tender stems, plus more leaves for garnish", "1 1/2 tablespoons chopped fresh summer savory or oregano leaves", "1 teaspoon ground black pepper", "1 teaspoon ground coriander", "1/2 teaspoon dried blue fenugreek (optional)", "1/8 teaspoon cayenne, or to taste", "1 large Spanish or yellow onion, diced", "1 1/2 tablespoons olive or safflower oil", "Tkemali (Georgian plum sauce), pomegranate molasses or balsamic vinegar, to taste", "1 tablespoon fresh lemon juice, more to taste", "Pomegranate seeds, for garnish (optional)", "Suluguni, feta or ricotta salata cheese, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine beans and 1 teaspoon salt. Add enough water to cover beans by 2 inches and let soak for at least 6 hours or overnight. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine beans, 2 teaspoons salt, bay leaves and 6 cups water in a heavy pot or Dutch oven and bring to a simmer. Simmer very gently, partly covered, until beans are quite tender, 1 1/2 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mortar and pestle, blender or mini food processor, grind garlic, cilantro, savory or oregano, pepper, coriander, fenugreek (if using), cayenne, and remaining 1/2 teaspoon salt into a rough paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set 2 tablespoons of chopped onion aside for final garnish. In a large skillet, heat oil over medium-high heat until very hot. Add remaining onions and fry until they turn brown at the edges, 7 to 12 minutes. Season with a pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the beans are done, drain and reserve cooking liquid. Return beans to pot and use a potato masher or sturdy spoon to mash them, gradually adding the cilantro-garlic paste and fried onions. When everything is well incorporated, stir in reserved cooking liquid until soupy. Taste and season with tkemali or pomegranate molasses, lemon juice and more salt, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish each serving with raw onions, cilantro, pomegranate seeds (if using), and a drizzle of tkemali or pomegranate molasses, if you like. Serve cheese on the side or crumbled on top."}], "link": "https://cooking.nytimes.com/recipes/1019186-red-bean-stew-with-fried-onions-and-cilantro"}