{"@context": "http://schema.org", "@type": "Recipe", "name": "Maison Aleph’s Sesame-Halvah 1,001 Feuilles", "description": "This sweet straddles East and West. Its name plays on French mille-feuille (mille-feuille means 1,000 leaves), but its structure follows the lines of Middle Eastern baklava. It’s got layers of buttered and sugared phyllo dough and a filling made with tahini and vanilla halvah. The mixture is similar to frangipane, but not like any I’ve ever tasted — it’s completely original and wonderfully good. A word on the phyllo: If the sheets are smaller than 12-by-17-inches, don’t worry — the dessert will bake the same way, but the middle layer will be slightly thicker and the yield will be less. For the most delicious pastry, use clarified butter: Bring the butter to a boil in a medium saucepan. Lower the heat and simmer until most of the solids fall to the bottom of the pan; the bubbling will have subsided. Slowly pour the butter through a coffee filter or a strainer lined with cheesecloth; discard the solids and reserve the liquid. You can make the butter weeks ahead and keep it refrigerated.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2018/04/08/magazine/08mag-ondessert1/08mag-08ondessert-t_CA0-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "About 35 squares", "recipeCuisine": "french, middle eastern", "recipeCategory": "pastries", "keywords": "dessert, phyllo, tahini, vanilla halvah, white sesame seeds", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 47}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 219, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "8 grams", "sodiumContent": "110 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup/113 grams unsalted butter (1 stick), at room temperature", "2/3 cup/120 grams vanilla halvah", "Scant 1/3 cup/75 grams tahini (stir before measuring)", "1 cup/120 grams confectioners’ sugar", "2 1/2 tablespoons cornstarch", "1/2 teaspoon fleur de sel (or 1/4 teaspoon fine sea salt)", "3 large eggs, at room temperature", "1/3 cup/50 grams toasted white sesame seeds", "28 sheets phyllo dough (12 inches by 17 inches), thawed", "1 1/2 cups/360 milliliters clarified butter (from 4 sticks/452 grams)", "About 1 1/2 cups/180 grams confectioners’ sugar", "2 tablespoons white sesame seeds, for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Working with a mixer (preferably fitted with a paddle attachment), beat the butter, halvah and tahini together on medium speed for about 3 minutes. Add the confectioners’ sugar, cornstarch and salt, and mix on low for 2 minutes more. Add the eggs one by one, beating for a minute after each goes in; you’ll have a thick, smooth, shiny mixture (think mayonnaise). Stir in the sesame seeds. Scrape the filling into a bowl, cover and refrigerate for 1 hour (or for up to 2 days; longer is better than shorter)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Build the layers: Lay the phyllo out on a piece of plastic wrap, and cover with a damp kitchen towel. Always keep the towel moistened: The dough dries in a flash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the interior of a rimmed baking sheet (12 inches by 17 inches) with clarified butter. Place a sheet of dough in the pan, brush with butter and dust lightly with confectioners’ sugar (use about 2 tablespoons of sugar per sheet). Continue until you have made 14 layers. Spread the filling evenly over the top, and then continue making layers with the remaining dough, buttering and sugaring each layer (you’ll have some butter left; hold on to it). Refrigerate the setup for at least 30 minutes (or cover and refrigerate for up to 1 day)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven, and heat it to 350 degrees. Using a pizza cutter (best) or a sharp knife, trim the edges (don’t remove them), then cut as many 2-inch squares as possible, cutting all the way through the layers. Scatter the sesame seeds over the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for about 40 minutes, rotating the pan after 20 minutes, until the top is beautifully golden. Transfer to a cooling rack, and lightly brush with some of the reserved butter. Place a piece of parchment or foil over the surface, top with another baking pan and press evenly and firmly to compact the layers. Recut the squares, so they’ll be easy to lift out. Let sit for 2 to 3 hours before serving (discard or nibble the trimmed edges). Stored tightly covered, the squares will keep at room temperature for about 2 days."}]}