{"@context": "http://schema.org", "@type": "Recipe", "name": "Blond Puttanesca (Linguine With Tuna, Arugula and Capers)", "description": "Garlic, anchovies, capers and tuna come together in this briny, tomato-less take on the classic pasta puttanesca. The sauce is prepared while the pasta cooks, so you can get dinner on the table in no time. If you want to go the extra mile, roughly chopped green pitted olives would be a nice addition, as would topping the dish with toasted panko bread crumbs tossed with lemon zest. Go ahead, drink that glass of falanghina while you’re cooking.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/07/11/dining/colu-blond-puttanesca-horizontal/merlin_140817672_0ede9b64-0930-44cb-bfab-d789f256b6d6-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, weekday, weeknight, pastas, seafood", "keywords": "anchovies, capers, linguine, tuna, dairy-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1394}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 489, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "4 grams", "proteinContent": "26 grams", "saturatedFatContent": "2 grams", "sodiumContent": "573 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Kosher salt", "12 ounces linguine", "3 tablespoons olive oil", "3 garlic cloves, thinly sliced", "1/2 teaspoon red-pepper flakes, plus more for serving if desired", "10 anchovies, roughly chopped", "3 tablespoons capers, rinsed well if salt-packed", "5 ounces baby arugula or other young greens, such as pea shoots or kale", "1 (6-ounce) jar oil-packed Italian tuna, drained and flaked", "1/4 cup chopped Italian parsley, plus more for serving if desired", "Black pepper", "Flaky salt, for serving (optional)", "Lemon wedges, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to a boil. Add pasta and cook until it is just under al dente, about 7 minutes. Drain, reserving 1 1/2 cups of the pasta cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pasta cooks, make the sauce: Heat olive oil in a large skillet over medium-low heat. Add garlic and red-pepper flakes and cook until garlic is pale golden, about 1 minute. Add anchovies and capers and cook until anchovies have melted and capers begin to brown slightly, about 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat to medium. Ladle a 1/2 cup of reserved pasta water into the skillet and bring mixture to a simmer. Cook until mixture is reduced by about half, about 2 to 3 minutes. Add in arugula and ladle in an additional 1/2 cup of pasta water, tossing together until wilted. Increase heat to medium-high and scoop pasta directly in to the skillet tossing with sauce until well coated. Add tuna to pasta and toss again until it is just warmed just through, about 1 minute. Ladle in an additional 1/4 cup pasta water or more, to loosen up sauce and toss again. Sprinkle parsley over pasta and toss again. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve in bowls, with flaky salt, a squeeze of lemon, additional parsley and red-pepper flakes, if desired."}], "link": "https://cooking.nytimes.com/recipes/1019399-blond-puttanesca-linguine-with-tuna-arugula-and-capers"}