{"@context": "http://schema.org", "@type": "Recipe", "name": "Rib-Eye Steak and Potatoes for Two", "description": "For a special occasion with a sweetheart, sharing a simple, luxurious dinner at home is even better than going to a restaurant. Splurge on a cut like rib-eye or tenderloin and open a great bottle of wine. It’s a simple, no-fuss endeavor, yet very special.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/02/14/dining/14Kitchen1/merlin_133154163_ac1cede9-18ea-4811-a543-0a7fa6855b66-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, for two, quick, steaks and chops", "keywords": "main course, rib eye steak, rosemary", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 359}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 850, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "7 grams", "proteinContent": "46 grams", "saturatedFatContent": "27 grams", "sodiumContent": "1153 milligrams", "sugarContent": "2 grams", "transFatContent": "3 grams"}, "recipeIngredient": ["1 large boneless rib-eye steak, cut 2 inches thick (at least 1 1/2 pounds)", "Salt and freshly ground black pepper", "2 cloves garlic, sliced, plus 1 teaspoon minced garlic", "1 rosemary sprig, roughly chopped", "1 pound very small potatoes, rinsed", "2 tablespoons butter", "1/4 cup finely chopped parsley", "Finely grated zest of 1 small lemon", "Arugula or watercress, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season steak generously with salt and pepper. Sprinkle with sliced garlic and rosemary and set aside to marinate, 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Meanwhile, bring a pot of well-salted water to a boil. Add potatoes and cook at a brisk simmer until just done, 10 to 15 minutes. Drain and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a cast-iron or other heavy skillet over high heat. Remove and discard sliced garlic from steak. (If left on, it will burn in the skillet.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When pan is hot, put in the steak and let brown well on one side, 4 to 5 minutes. Wait until steak forms a crust and comes away cleanly from the bottom to move it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flip steak and transfer pan to oven, uncovered. Roast until juices begin to rise on surface of steak (you will see the droplets) and internal temperature is 120 degrees, 8 to 10 minutes. Remove steak from pan and let rest, tented with foil, for 5 to 10 minutes. (Residual heat will continue to cook the meat to medium-rare as it rests.) Warm a serving bowl for the potatoes and plates for the steak."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in a wide skillet over medium-high heat. Add potatoes and toss to coat and heat through. Sprinkle with salt and pepper. Add minced garlic and cook, stirring, until softened but not browned, 1 minute or less. Gently stir in parsley and lemon zest and transfer to serving bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cutting on a slight diagonal, slice steak into 1/2-inch slices, then transfer to plates. If using, place a handful of greens next to the steak. Serve immediately, passing potatoes at the table."}], "link": "https://cooking.nytimes.com/recipes/1019175-rib-eye-steak-and-potatoes-for-two"}