{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Salmon With Kale Chips", "description": "Don’t mask salmon, or cook it to bits in a hot oven. Let it shine by grilling it on a bed of kale. The technique gives you quick, crisp chips, and a soft, perfectly cooked piece of fish that won’t stick to the grill. Then smother it in herbs: basil, mint, dill, cilantro, even sorrel, if that’s what came in your farm box. You can serve this with potatoes, corn, salad or toasted bread, or any simple side you can throw together quickly.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2018/09/16/dining/sc-salmon-kale/sc-salmon-kale-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "seafood", "keywords": "herbs, kale, salmon, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 33}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 244, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "3 grams", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "293 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 (1/4-pound) piece center-cut salmon", "1 medium bunch kale (curly or lacinato)", "5 tablespoons olive oil ", "1 teaspoon salt", "1/2 teaspoon black pepper", "1 lemon, zested, half cut into wedges and half juiced", "1 packed cup roughly chopped mixed herbs, such as parsley, mint, dill, basil, cilantro or sorrel", "1 garlic clove, minced or pressed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a grill or grill pan over medium heat. Toss the kale leaves in 2 tablespoons olive oil, rubbing it into all the leaves. Rub another tablespoon of oil all over the salmon and sprinkle generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the kale in an even layer, leaves overlapping slightly, over the grill pan or grates, avoiding any direct flame. Lay the salmon on top, skin side down, and grill until cooked about halfway through, 3 to 4 minutes. Flip the salmon off the kale. Remove the kale chips to a platter, if sufficiently charred. (If not, flip the kale and allow to cook 1 to 2 minutes more.) Continue cooking the salmon until marked and medium in the center, about 4 to 5 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Move the salmon to a platter. Toss together the herbs, lemon zest, lemon juice, garlic and remaining 2 tablespoons olive oil just before serving and sprinkle all over the top of the fish and drizzle with more olive oil to finish. Serve kale chips alongside, with lemon wedges for squeezing. (Don’t squeeze over the kale in advance, or the kale chips will turn soggy.)"}], "link": "https://cooking.nytimes.com/recipes/1019584-grilled-salmon-with-kale-chips"}