{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Minestrone al Pesto", "description": "Some vegetable soups are complex and long-simmered. This light, brothy one brims with full-flavored summer vegetables for a minestrone that comes together in a half an hour or so. If you don't have a vegetable garden, look to the farmers' market for the freshest, sweetest produce. For a warm-weather lunch or supper, the simplicity of this soup is very appealing.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/07/11/dining/11kitchrex/merlin_140281218_f7a98565-308c-43ae-8ae1-2f81b0125013-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, weekday, soups and stews", "keywords": "green beans, romano beans, tomato, zucchini, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 199}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 789, "unsaturatedFatContent": "44 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "54 grams", "fiberContent": "10 grams", "proteinContent": "16 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1273 milligrams", "sugarContent": "13 grams", "transFatContent": null}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "1 large onion, diced, about 1 1/2 cups", "Salt and pepper", "6 garlic cloves, minced", "1 bay leaf", "1 tablespoon tomato paste", "Pinch of crushed red pepper", "Splash of white wine (optional)", "2 large very ripe sweet tomatoes, chopped (about 2 cups)", "3 or 4 zucchini or summer squash, chopped into roughly 1/2-inch cubes (about 3 cups)", "1/2 pound romano beans, ends trimmed and cut into 2-inch lengths (about 2 cups)", "2 cups small, dry pasta, such as pennette or orecchiette", "1/2 pound small green beans, ends trimmed and cut into 2-inch lengths (about 1 1/2 cups)", "2 medium garlic cloves, coarsely chopped", "Salt and pepper", "2 cups basil leaves, loosely packed, washed and dried", "1 cup parsley leaves, loosely packed, washed and dried", "3/4 cup extra-virgin olive oil", "1/4 cup grated Parmesan, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large, heavy-bottomed soup pot over medium-high heat, and add olive oil. When oil is hot, add onion and season generously with salt and pepper. Cook, stirring frequently, until softened and just beginning to color, 5 or 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic, bay leaf, tomato paste and red pepper. Cook, stirring, for another minute, then add wine, if using, and tomatoes, and bring to a brisk simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 8 cups water and a good pinch of salt and let mixture return to a brisk simmer. Cook for 10 minutes, then taste for seasoning. The broth should be well seasoned before the vegetables go in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pesto: As the broth simmers, pound the garlic and salt to a paste in a large mortar. Beginning with a few basil leaves at a time, pound basil to a paste, then add  parsley leaves and a little salt. Continue to pound until all the basil and parsley have been pounded into a coarse green paste. (Alternatively, many people may wish to make the pesto in a food processor.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a serving bowl and whisk in olive oil and Parmesan. Taste and season with salt and pepper. Set pesto aside covered with a thin layer of oil or with plastic film pressed against its surface to prevent oxidation."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the zucchini, romano beans and pasta to the simmering broth and cook 7 to 8 minutes, until pasta is al dente. Add green beans and cook for a minute or 2."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle soup into bowls, topping each with a dollop of pesto. Pass more grated Parmesan at the table."}], "link": "https://cooking.nytimes.com/recipes/1019396-summer-minestrone-al-pesto"}