{"@context": "http://schema.org", "@type": "Recipe", "name": "Dirty Rice", "description": "Dirty rice gets its color from caramelized sirloin and the roux — flour browned (but not burned) in oil. The New Orleans-based chef Isaac Toups offers a 15-minute roux shortcut in his book “Chasing the Gator,” but you may find your roux browns more quickly in the smoking hot oil. Be sure to stir, stir, stir once you add the flour. You cannot walk away from the pot while making this roux. Prep the “trinity” — bell peppers, onion and celery — in advance as you won't have time to do it while the roux cooks. When the roux turns the color of milk chocolate, toss in the chopped vegetables to stop the roux from cooking any further. Instead of adding rice and the serving components, you could do as Mr. Toups suggests and use the meat gravy as a base for a lasagna ragu. Just throw in some fresh tomatoes and cook it down “until it’s nice and tight” and make it your lasagna filling.", "author": {"@type": "Person", "name": "Sara Bonisteel"}, "image": "https://static01.nyt.com/images/2018/09/26/dining/toup-dirty-rice-horizontal/toup-dirty-rice-horizontal-articleLarge.jpg", "totalTime": "PT1H50M", "recipeYield": "4 to 6 servings", "recipeCuisine": "cajun", "recipeCategory": "grains and rice", "keywords": "amber beer, grapeseed oil, ground sirloin, jasmine rice, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 115}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 456, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "1 gram", "proteinContent": "20 grams", "saturatedFatContent": "7 grams", "sodiumContent": "556 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound lean ground sirloin", "2 teaspoons kosher salt", "1 tablespoon grapeseed oil, or other neutral oil", "1/2 teaspoon ground black pepper", "1/2 teaspoon ground cumin", "1/4 teaspoon cayenne", "1/3 cup amber beer", "1/4 cup grapeseed oil, or other neutral oil", "1/4 cup all-purpose flour", "1/2 cup finely chopped white onion", "1/2 cup finely chopped green bell pepper", "1/3 cup finely chopped celery", "4 cloves garlic, crushed", "1/3 cup amber beer", "1 cup chicken stock, plus more as needed", "1 cup Louisiana jasmine or medium-grain white rice", "1 teaspoon kosher salt", "1 bay leaf", "2 tablespoons unsalted butter", "1/2 bunch scallions (green tops only), chopped", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sear the meat: Season the sirloin — just use it how it comes out of the tray from the grocery store — with 1 teaspoon of salt on each side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat the oil over medium-high heat until it starts to smoke. Place the sirloin in the skillet in one piece and let it sear until it browns and caramelizes, 3 to 5 minutes. Then flip it and repeat, 3 to 5 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the block of sirloin is well browned — nearly caramelized, chop it up in the pan with a metal spatula to sear the inside bits. Add the black pepper, cumin and cayenne and stir well. Cook for a minute. Add the beer to deglaze the pan, and cook 1 minute longer, scraping up any browned bits. Remove from the heat and set aside. At this point, you could freeze the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the gravy: Start by making a dark roux. Heat the oil in a Dutch oven over high heat until it just starts to smoke. Add the flour and immediately start stirring with a long-handled spoon. Stir constantly, scraping the bottom and edges well to keep the flour from burning. Once it’s the color of milk chocolate, anywhere from 4 to 15 minutes (the most important thing to watch is the color of the roux), add the onion, bell pepper, and celery and stir together. Cook for a minute. Stir in the garlic and cook for 1 minute longer. Add the beer and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In 1/3-cup increments, add the stock, stirring well between each addition. Reduce heat to low and stir frequently, but not continuously, until you have a well-emulsified gravy, thick enough to coat the back of a spoon, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the gravy is done, add the cooked beef. Bring the meat and gravy mixture back to a bare simmer. Cover and cook for 1 1/2 hours, or until the sauce has no chalky or floury flavor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the rice: While the gravy is cooking, put rice, 2 cups water, salt and bay leaf in a 4-quart saucepan over medium-high heat and bring to a boil. Reduce the heat and bring to a bare simmer. Stir, cover and simmer for 10 minutes. Remove from the heat and let steam in the covered pan for another 10 minutes, until all water is absorbed. Fluff with fork. Spread it out in a single layer on a baking sheet and refrigerate until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: Add the cooked rice, butter and scallions to the meat gravy in the pot. Stir it all together over low heat, just to warm it all through. Add salt to taste and serve."}], "link": "https://cooking.nytimes.com/recipes/1019610-dirty-rice"}