{"@context": "http://schema.org", "@type": "Recipe", "name": "BLT Tacos", "description": "Without the bread muffling the crunch of bacon and crisp lettuce, BLT tacos are a lot more texturally exciting than the usual sandwich. Here, hot sauce-spiked mayonnaise adds spice; avocado adds creaminess; and chopping the tomatoes into a salsa with jalapeño, lime juice and cilantro makes everything juicy and bright. You can serve these for brunch, lunch or a light, fast dinner.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/08/22/dining/22apperex/merlin_142312344_dfef6831-f89c-499f-8bdf-1fd0836bdf1c-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, weeknight, tacos", "keywords": "bacon, hot sauce, jalapeño, tomato, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 359}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 808, "unsaturatedFatContent": "47 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "69 grams", "fiberContent": "6 grams", "proteinContent": "19 grams", "saturatedFatContent": "19 grams", "sodiumContent": "997 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound thick-cut bacon", "1 pint cherry tomatoes, quartered (mixed colors are pretty here)", "1 small jalapeño, seeded or not, finely chopped", "2 tablespoons cilantro, chopped", "1 1/2 teaspoons fresh lime juice, plus more to taste", "Kosher salt, to taste", "1/2 cup mayonnaise", "1 1/2 teaspoons Cholula or other hot sauce, or to taste, plus more for serving", "8 (6-inch) corn or flour tortillas", "Romaine lettuce leaves, torn into bite-size pieces", "1 avocado, sliced (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Lay bacon in an even layer on a rimmed baking sheet, and bake until browned and crisp, 15 to 20 minutes. Transfer to a paper towel-lined plate and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While bacon is cooking, toss together tomatoes, jalapeño, cilantro, lime juice and a large pinch of salt in a medium bowl. Taste and add more lime juice and salt, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together mayonnaise and hot sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay a clean kitchen towel in a medium bowl. Using the open flame from a stovetop gas burner (or in a skillet placed on an electric burner), warm and lightly char tortillas, 30 seconds to 1 minute per side. Transfer warmed tortillas to a towel-lined bowl, and cover with towel to keep warm while you finish remaining tortillas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve, letting people make their own tacos by layering bacon, salsa, lettuce, spicy mayonnaise and avocado, if using, on tortillas. Top with more hot sauce, if desired."}]}