{"@context": "http://schema.org", "@type": "Recipe", "name": "Garlicky Steak With Carrot, Walnut and Dill Salad", "description": "Any steak benefits from a quick marinade, but especially a flank steak. Fairly tender on its own, it becomes its best self when bathed in oil laced with lemon, garlic and coriander. The trick here is to set aside a teaspoon of this potent marinade to stir into yogurt, to dollop or serve alongside. This marinade and the garlic yogurt also work well on chicken or pork, tossed with almost any grilled vegetable or even drizzled over toast. The salad, made from long strips of carrots, is a light, sophisticated side that's as at home on your Tuesday night table as it is at weekend brunch. ", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2018/09/16/dining/sc-flank-steak/sc-flank-steak-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weekday, weeknight, steaks and chops", "keywords": "carrot, dill, steak, yogurt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 109}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 480, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "3 grams", "proteinContent": "34 grams", "saturatedFatContent": "9 grams", "sodiumContent": "672 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 lemon", "1 1/2 teaspoons kosher salt", "1/2 teaspoon black pepper", "4 garlic cloves, pressed or minced", "1 teaspoon ground coriander", "1/2 cup full-fat plain Greek yogurt", "1/3 cup olive oil", "1 1/4 pounds flank steak", "4 large carrots", "1/3 cup walnuts, toasted", "1/4 cup roughly chopped dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Zest the lemon and combine zest in a bowl with 1 teaspoon salt, the pepper, garlic and coriander, and rub with your fingers to make an even paste. Stir 1 teaspoon mixture into yogurt, and set aside. Pour 3 tablespoons olive oil over the remaining mixture. Rub on both sides of the steak; place the steak in a bowl or a large resealable bag and set aside for 30 minutes, or refrigerate up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the salad: Juice the lemon into a large bowl, and whisk together with the remaining 2 tablespoons olive oil and 1/2 teaspoon salt. Shave the carrots into the bowl with a vegetable peeler or a mandoline, making long, thin shavings (like ribbons). Toss together with the dressing and walnuts and set aside while you grill the steak."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light the grill or heat the broiler. Remove the steak from the marinade and brush off any excess. (A dry steak yields a better, crisper sear.) Grill the meat over direct heat until char lines appear and meat is done to taste, 5 minutes per side for medium-rare, or broil until charred, 3 to 5 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the meat rest for 5 minutes before slicing against the grain. Toss the dill with the carrot salad. Spread a thin layer or a dollop of lemon-garlic yogurt on each plate, and top with the steak and salad."}]}