{"@context": "http://schema.org", "@type": "Recipe", "name": "Gougères With Pancetta and Sage", "description": "What could be better than warm cheese puffs straight out of the oven? How about warm cheese puffs studded with bacon — or in this case, pancetta — and fresh sage? They are salty, brawny and rich; crisp on the outside and soft within. Gougères are best baked just before serving, but if you like you can make the batter ahead, form it into balls, and freeze them, unbaked. Bake while still frozen, adding 5 to 10 minutes onto the baking time.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/12/13/dining/13apperex/merlin_130869086_266abd3c-c09c-48e6-820c-45116aebd3ab-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 5 1/2 dozen", "recipeCuisine": "french, italian", "recipeCategory": "snack, finger foods", "keywords": "appetizer, fall, winter, gruyère, pancetta, sage", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 94}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 39, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "56 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 ounces/170 grams pancetta, cut into cubes, or bacon", "A dozen whole sage leaves", "4 tablespoons/57 grams unsalted butter", "1/2 teaspoon fine sea salt or kosher salt", "1/4 teaspoon cayenne", "1 cup/125 grams bread flour or all-purpose flour (see Note)", "4 eggs, at room temperature", "5 ounces/142 grams shredded Gruyère, or another firm cheese like Manchego or aged Cheddar", "1/3 cup/50 grams grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put pancetta in a large skillet and place over medium heat. Cook slowly, stirring, until fat is rendered and meat is well browned and crispy all over, 12 to 17 minutes. Use a slotted spoon to transfer to a paper towel-lined plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle sage into the hot fat in the skillet and cook until crisp, about 1 minute. Transfer to plate with pancetta. When cool, finely chop pancetta and sage together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees and line two rimmed baking sheets with parchment paper. Have ready an electric mixer fitted with the paddle attachment (or use a sturdy mixing spoon)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, bring 1 cup water, butter, salt and cayenne to a boil. Stir in flour all at once, and cook, stirring continuously with a wooden spoon, until dough forms a mass and pulls away from the sides of the pot, 2 to 3 minutes. The dough will be quite stiff."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape into the mixer and beat until cooled slightly, about 30 seconds. Add one egg at a time, letting it fully incorporate before adding the next. (If you don’t have a mixer, you can do this by mixing dough vigorously with a sturdy spoon.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When eggs are incorporated, add Gruyère and continue to beat until it is mostly melted into batter, then add pancetta and sage and mix until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer batter to a large resealable plastic bag, and snip off 3/4-inch from one corner, or use a pastry bag. Pipe into balls, about 2 teaspoons each, leaving 1 inch of space between them. (Or, use a spoon to form the balls and drop onto baking sheets.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle Parmesan on top, and bake 15 minutes. Reduce oven temperature to 350 degrees, and continue to bake until golden and cooked through, 10 to 15 minutes more. Serve immediately, while still warm."}]}