{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb-Shoulder Mafe With Fonio", "description": "The Senegalese-born chef Pierre Thiam makes this lamb mafe with meat from the shoulder, on or off the bone, which goes tender after a stretch of unattended, gentle simmering. Adapting the dish in New York, Thiam thickened it with jarred peanut butter, which lends the sauce its characteristic creaminess, and Vietnamese fish sauce, for salty depth. Though he leaves the Scotch bonnet whole, if you want a more intense taste of it, crush it apart with a wooden spoon, and you'll tap right into its bright, floral heat. You could serve the stew with rice, or a number of other grains, but Thiam serves his on a heap of warm fonio, a tiny, tender, ancient grain that can be found partly cooked and dehydrated in many West African grocery stores, as well as specialty food stores and health food markets.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/02/18/magazine/18mag-eat1/18mag-18eat-t_CA0-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "african", "recipeCategory": "dinner, grains and rice", "keywords": "fish sauce, fonio, lamb shoulder, peanut butter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 111}, "recipeIngredient": ["2 tablespoons peanut oil", "3 pounds lamb shoulder, trimmed and cut into 2- to 3-inch pieces", "2 tablespoons kosher salt", "1 large onion, finely chopped", "2 garlic cloves, crushed", "2 tablespoons tomato paste", "6 cups chicken stock, or water", "2 bay leaves", "2 sprigs thyme, leaves removed and chopped", "1 cup unsweetened smooth peanut butter", "6 to 8 okra, trimmed and cut into 1-inch pieces", "1 Scotch bonnet pepper, left whole", "2 tablespoons Vietnamese fish sauce", "1 bunch parsley, leaves finely chopped", "3 scallions, finely chopped", "1 garlic clove, crushed", "1/2 of 1 Scotch bonnet pepper, seeded and finely chopped", "Zest of 1 lemon, finely grated", "Kosher salt and freshly ground black pepper, to taste", "2 tablespoons olive oil", "2 shallots, sliced", "1 garlic clove, crushed", "1 large carrot, peeled and diced", "1/2 cup frozen green peas", "1 cup fonio"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a heavy-bottomed pot over medium-high heat. Season the lamb with 1 tablespoon of salt, and brown in batches until all the meat is browned. Set aside the meat, and pour off excess fat, leaving about 1 tablespoon in the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion, using a wooden spoon to scrape up any browned bits from the bottom of the pan, and cook until it turns translucent. Reduce heat to low, then add garlic, and stir well. Cook for a minute or 2, until it is fragrant, then add tomato paste, and cook for 7 more minutes, until the paste is dark in color. If the mixture begins to brown too quickly, lower the heat, and add a splash of water to deglaze the pan. Return the meat to the pot, add stock to cover meat and bring to a simmer. Add bay leaves, thyme and remaining salt, and cover. Cook for 2 hours on low heat, or until the meat is very tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the parsley topping: Combine the parsley, scallions, garlic, Scotch bonnet and lemon zest in a small bowl. Season with salt and pepper to taste, cover and refrigerate until it’s time to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Start the fonio: Heat the oil in a saucepan over medium-high heat. Add the shallots, and cook until soft and translucent. Add the garlic and carrot, and cook for 3 minutes more, until the garlic is fragrant. Add 1/4 cup water along with the peas, and cook covered, on low heat, until the carrot is tender, about 8 minutes, then turn off the heat, and set aside until you’re ready to eat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the mafe: In a large bowl, gradually add a little hot liquid from the lamb to the peanut butter, mixing it with more and more liquid until it’s thick, smooth and pourable. Return it all to the pot with the meat, and mix well. Add the okra, Scotch bonnet and fish sauce, and simmer gently, uncovered, for about 30 minutes or so, stirring frequently to avoid clumps of peanut butter at the bottom of the pot, until the sauce is thick enough to coat a spoon and a little bit of fat has pooled at the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the fonio: In a pot with a tightly fitted lid, bring 2 cups of salted water to a boil, add the fonio, stir, cover and turn off the heat. After 5 minutes, remove the lid and fluff with a fork. Fold fonio into the shallots and peas, season and taste. To serve, pile bowls with fonio, top with lamb and generously sprinkle over the parsley."}]}