{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach Lasagna With Fennel Sausage", "description": "Making lasagna from scratch, including the pasta, is a time-consuming project that is absolutely worth the effort, especially for a holiday dinner. If you have a friend to help you in the kitchen, so much the better; or, spread the work over a couple of days. Of course, you may use store-bought fresh or dried lasagna noodles instead of making the pasta yourself, or use a favorite tomato sauce recipe of your own. This lasagna is delicate and rich, best served in small portions.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/01/13/dining/13kitchen-sub/merlin_130382348_b8e4f5e4-c731-43f9-a9ac-335d1a351163-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "8 to 10 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas, project", "keywords": "basil, fennel sausage, fennel seeds, milk, ricotta, spinach, tomato puree, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 83}, "recipeIngredient": ["3 ounces raw washed and stemmed spinach leaves, shredded (2 cups packed)", "2 eggs", "1/2 teaspoon salt", "2 tablespoons olive oil", "3 cups all-purpose flour", "2 pounds washed and stemmed spinach leaves", "12 ounces fresh ricotta cheese", "1 teaspoon freshly grated lemon zest", "1 teaspoon fennel seed, crushed", "Salt and pepper", "1 1/4 pounds Italian fennel sausage, sweet or hot, removed from casings", "2 1/2 cups grated Parmesan cheese", "4 tablespoons unsalted butter, plus more for pan", "1/4 cup all-purpose flour", "5 cups whole milk or half-and-half, plus more as needed", "1 bay leaf", "Pinch of cayenne", "Pinch of grated nutmeg", "1 tablespoon olive oil", "2 small garlic cloves, grated", "A small handful fresh basil leaves or sprigs, more for garnish", "3 cups tomato purée, preferably Italian", "4 tablespoons unsalted butter, diced in small pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pasta: Combine spinach, eggs, salt and olive oil in a blender or food processor and purée until smooth. Transfer to a mixing bowl and stir in flour. Knead mixture into a soft dough. If sticky, add a little more flour. Form into a ball, wrap in plastic, and set aside to rest while you prepare the other elements."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Bring a large pot of salted water to a boil. Add spinach and let wilt for a few seconds. Drain spinach in a colander and rinse well with cold water. Squeeze spinach dry and chop roughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put ricotta in a mixing bowl and stir in chopped spinach. Stir in lemon zest and crushed fennel seed. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large skillet over medium-high heat and add sausage meat. Cook, breaking up with a spatula, until crumbled. Cook for 3 to 4 minutes, stirring, until just cooked through. Transfer to a bowl and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the béchamel, melt butter in a large saucepan over medium heat. Whisk in flour and let cook for about 1 minute, stirring; do not let mixture brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in milk 1/2 cup at a time, letting sauce thicken after each addition. Add bay leaf, cayenne and nutmeg and continue cooking over low heat, whisking frequently, for about 10 minutes, to create a smooth sauce. Season to taste with salt and pepper. Thin with a little more milk if necessary; consistency should be that of a not-too-thick milkshake. If needed, strain sauce to remove lumps. Keep warm in a double boiler to prevent thickening."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tomato sauce: In a saucepan, heat the olive oil over medium heat. Add garlic and basil and let sizzle without browning, 1 minute or less. Add tomato purée and bring to a simmer. Season to taste with salt and pepper. Cook for about 5 minutes, until slightly thickened. Remove from heat, pull out the basil leaves, and whisk in butter. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the pasta: Set up a pasta machine and divide the dough into 5 roughly equal pieces. Roll each piece into a thin sheet of pasta about 12 inches long. Rolling twice at the second-to-last setting on the machine should give you the right thickness. Set aside on baking sheets, dust lightly with flour and keep covered with a slightly damp kitchen towel to prevent them from drying out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a medium-large baking dish, not larger than 9 by 13 inches. Heat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the pasta: Have a large pot of salted boiling water on the stove and a large bowl of ice water nearby. One by one, place pasta sheets in boiling water to par-cook for about 1 minute, leaving pasta quite firm. Using tongs or a spider, lift pasta out and plunge into ice water. Lift out and lay on a clean kitchen towel to blot. Cut into two pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the pasta is cooked, assemble the lasagna: Place 2 sheets cooked pasta side by side, in the bottom of the baking dish. Spread pasta with 1/2 cup béchamel and dot with one-quarter of the ricotta mixture. Sprinkle over one fourth of crumbled sausage and 1/2 cup grated Parmesan. Repeat process for each layer. You will have 4 layers. Finish with 2 sheets of pasta. Spread top with 1/2 cup béchamel and sprinkle with remaining Parmesan. (The lasagna can be made up to this point up to 1 day in advance, covered and refrigerated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover with foil and bake about 30 minutes, until lasagna is bubbling. (If baking a refrigerated lasagna, this will take longer, up to 60 minutes.) Remove foil and bake uncovered for about 15 minutes, until lightly browned on top. Let lasagna rest for 10 to 15 minutes before cutting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, reheat tomato sauce. To serve, cut lasagna into 3- or 4-inch squares. With a spatula, transfer each serving to individual plates. Spoon about ½ cup tomato sauce around each serving. Garnish with basil leaves."}], "link": "https://cooking.nytimes.com/recipes/1019084-spinach-lasagna-with-fennel-sausage"}