{"@context": "http://schema.org", "@type": "Recipe", "name": "Atlantic Beach Pie", "description": "Like a dreamy mash-up between a Key lime and lemon meringue pie, this surprisingly fast and easy dessert is adapted from Bill Smith, the chef at Crook's Corner, a Chapel Hill, N.C. restaurant that specializes in Southern comfort food. He was inspired by the lemon pies he ate at seafood restaurants in Atlantic Beach, N.C., while vacationing there as a child. While a food processor makes quick work of the saltine cracker crust, you don’t really need any special equipment — you can just as easily make it with your hands. Top it with whipped cream just before serving, and if you’re feeling flush, sprinkle it with flaky sea salt as they do at Crook's Corner, and citrus zest as we do: a lazy summer’s day in pie form.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2018/07/25/dining/25pie1/merlin_141364530_a347f792-5279-4738-9d76-72114e89395d-articleLarge.jpg", "totalTime": "PT4H55M", "recipeYield": "One 9-inch pie", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "dessert, lemon, saltines, sweetened condensed milk, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1360}, "recipeIngredient": ["1 1/2 sleeves saltine (with salt) crackers (about 60 crackers/200 grams)", "3 tablespoons granulated sugar", "1/2 cup/113 grams unsalted butter (1 stick), at room temperature", "4 egg yolks", "1 (14-ounce/396-gram) can sweetened condensed milk", "1/2 cup/120 milliliters lemon or lime juice, or a mix of the two", "Pinch of kosher salt", "Fresh whipped cream, lemon or lime zest and flaky sea salt, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Heat oven to 350 degrees. Using a food processor or your hands, pulse or crush the crackers finely (stop before all the crackers turn to dust; it’s O.K. if you have some little pieces). Add sugar, then butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulse to combine or work the butter in with your hands until the crumbs hold together like dough. Press into and up the sides of a 9-inch pie pan. Freeze for 15 minutes, then bake for 12 to 15 minutes or until the crust gets a little color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: While the crust is cooling (it doesn't need to be cold), in a medium bowl, whisk egg yolks into condensed milk, then whisk in the lemon or lime juice (or both), and salt, making sure to combine them completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour into the shell, and bake for 14 to 16 minutes until the filling has set. Refrigerate until completely cold, 4 hours up to overnight. Serve with fresh whipped cream, lemon or lime zest and a sprinkling of flaky sea salt, if desired."}], "link": "https://cooking.nytimes.com/recipes/1019424-atlantic-beach-pie"}