{"@context": "http://schema.org", "@type": "Recipe", "name": "Konbi’s Egg Salad Sandwich", "description": "This famous egg salad sandwich comes from Konbi, the tiny Los Angeles cafe run by co-chefs Akira Akuto and Nick Montgomery. It’s not always the case that sensational, Instagram-famous dishes are carefully calibrated to taste so good, but this one breaks the mold: It’s as pretty as it is delicious. The egg salad is brightened with a touch of rice wine vinegar and mustard and bound with Kewpie mayonnaise. When making it at home, be careful not to undercook the eggs or you’ll cross that fine line between jammy and runny. At the heart of the sandwich is a perfect hard-boiled egg, and we suggest cooking a couple extra in case they break or you have trouble peeling them. Extra eggs, still warm, with a touch of salt and pepper, make for a great snack while you're assembling.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2019/01/30/dining/30eggrex1/30eggrex1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 sandwiches", "recipeCuisine": "", "recipeCategory": "brunch, lunch, sandwiches", "keywords": "crème fraîche, dijon mustard, eggs, mayonnaise, white bread, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 520}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 202, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "13 grams", "saturatedFatContent": "3 grams", "sodiumContent": "276 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Ice cubes, for ice baths", "1 scallion, very thinly sliced", "1 tablespoon Kewpie mayonnaise, plus more for spreading on bread", "1 tablespoon crème fraîche", "1 1/2 teaspoons rice wine vinegar", "1 1/2 teaspoons Dijon mustard, plus more for spreading on bread", "Kosher salt", "12 large eggs", "Flaky sea salt, such as Maldon", "8 slices <a href=\"https://cooking.nytimes.com/recipes/1016275-japanese-milk-bread\">milk bread</a>, brioche or white sandwich bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot with water, leaving a few inches of space at the top, and bring to a boil over high. Prepare 2 ice baths in 2 medium bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the dressing: In a small bowl, stir together the scallion, mayonnaise, crème fraîche, vinegar and mustard. Season to taste with kosher salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the water reaches a boil, gently drop in all 12 eggs and let the water come back to a boil. As soon as it does so, reduce the heat to medium-low and cook the eggs at a gentle simmer, 8 minutes. Transfer 6 soft-boiled eggs to one ice bath. Continue to cook the remaining 6 eggs until hard-boiled, another 6 minutes, then transfer them to the second ice bath. Let sit, 5 minutes. Crack all cooked egg shells by gently hitting them all over with the back of a spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working directly in the bowl, peel the hard-boiled eggs, keeping them partly immersed (the water helps loosen the shells). Transfer the hard-boiled eggs to a cutting board and chop them into 1/4-inch pieces. Gently fold the chopped eggs into the egg salad dressing using a rubber spatula. Season to taste with kosher salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working directly in the second bowl, carefully peel the soft-boiled eggs. Transfer the peeled eggs to the cutting board and slice them in half lengthwise. The yolks should be creamy but not runny. If the yolks are runny, make another batch of soft-boiled eggs. (You’ll only need 1 soft-boiled egg per sandwich, so snack on any extra or imperfectly peeled pieces with some flaky sea salt, if desired.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slather mustard on 1 side of 4 bread slices and mayonnaise on 1 side of the remaining 4 bread slices. Sprinkle flaky sea salt on the halved soft-boiled eggs. Arrange 2 halves down the center of each slice of mustard-slathered bread, laying them yolk side down, and positioning them so the narrower tips point outward toward the crust of the bread and the wider, rounder portions (with the yolks) are in the middle of the bread. Place both halves close enough so that they touch in the center of the bread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the egg salad among the sandwiches, gently plopping 1/2-cup scoops of egg salad on top of each pair of soft-boiled eggs on each of the 4 bread slices. Using an offset spatula, spread the egg salad evenly toward the crusts in all directions until bread is covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top with the remaining slices of bread, mayonnaise side down. Using a serrated knife, carefully slice the crusts off on the left and the right sides of each sandwich. (These should be the 2 sides that are parallel to the soft-boiled eggs.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rotate each sandwich 90 degrees and cut each sandwich into thirds, cutting parallel to the crust sides of the sandwiches, creating a beautiful exposed cross section. Serve immediately or refrigerate up to 24 hours."}]}