{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Golden Beet and Winter Squash Salad", "description": "Golden beets are more savory and earthy than their sugary ruby counterparts and fare better alongside the caramelized roasted winter squash in this many-textured salad. But red beets will work, too, if you don’t mind a slightly sweeter dish over all. If you can’t find delicata squash, other varieties, such as sweet dumpling (shown here), honey nut or acorn squash, make fine substitutes.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/01/03/dining/03APPE1/03APPE1-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "appetizer, main course, side dish, beets, delicata squash, frisée, pumpkin seeds, radishes, scallions, fall, winter, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 224}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 419, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "6 grams", "proteinContent": "6 grams", "saturatedFatContent": "5 grams", "sodiumContent": "716 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 medium golden beets, peeled and sliced into 1-inch-thick wedges", "5 tablespoons extra-virgin olive oil, more as needed", "2 tablespoons orange juice", "1 1/4 teaspoons fine sea salt, more to taste", "1/4 teaspoon freshly ground black pepper, more as needed", "1 bay leaf, preferably fresh", "3 sprigs thyme", "1 bunch radishes, trimmed and halved if large", "1 large delicata squash (1 to 1 1/4 pounds), halved, seeded and cut into 1/2-inch slices, or substitute sweet dumpling or another winter variety", "1/2 cup cilantro or mint leaves", "2 scallions, white and green parts, thinly sliced", "1/3 cup toasted pumpkin seeds", "1 medium head frisée, torn into bite-size pieces (3 to 4 cups), or substitute arugula", "Shaved Pecorino Toscano, manchego or Parmesan, for serving", "1 tablespoon orange juice", "1 tablespoon lime juice", "1 clove garlic, grated on a Microplane or minced", "2 anchovies, minced (optional)", "1/4 teaspoon kosher salt, more to taste", "1/4 cup extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. On a rimmed baking sheet, toss together beets, 2 tablespoons oil, orange juice, 1/2 teaspoon salt, 1/8 teaspoon pepper, bay leaf and thyme. Cover with foil and bake for 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, toss radishes with 1 tablespoon oil, 1/4 teaspoon salt and a pinch of pepper. Flip beets and scatter radishes around them. Raise the oven temperature to 425 degrees and roast uncovered until everything is golden and tender, 18 to 25 minutes longer, stirring once or twice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, on a separate rimmed baking sheet, toss squash with remaining 2 tablespoons oil and 1/2 teaspoon salt and 1/8 teaspoon pepper. Roast in oven along with beets and radishes, until browned, 15 to 20 minutes, flipping the pieces halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dressing: In a large bowl, whisk together orange juice, lime juice, garlic, anchovies and salt. Let sit for a minute, then whisk in oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As warm vegetables come out of the oven, toss them in the bowl with the dressing and let cool. Once cool, fold in cilantro, scallions and pumpkin seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, toss frisée with olive oil and salt to taste, then transfer to serving plate. Top with roasted vegetables, and cover generously with cheese."}], "link": "https://cooking.nytimes.com/recipes/1019119-roasted-golden-beet-and-winter-squash-salad"}