{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet and Salty Grilled Pork With Citrus and Herbs", "description": "Typically prepared as a long-cooked stew or braise, pork shoulder is remarkably (and perhaps surprisingly) fantastic when treated like a steak. This means cooked hot and fast so it’s charred on the outside and medium-rare on the inside. While a grill is ideal here, it can also be prepared on the stovetop in a very hot cast-iron skillet. The garlicky, salty, sweet marinade also doubles as a dressing to be poured over crunchy leaves of lettuce, fresh herbs and, if you’re looking for something more substantial, some sort of rice noodle or plain cooked rice.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/08/08/dining/08Romanrex1/merlin_141939222_14150261-46bc-4459-96ee-17cdecc7d0bc-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, meat", "keywords": "cilantro, fish sauce, lime, pork shoulder, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 446}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 469, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "2 grams", "proteinContent": "32 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1534 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds boneless pork shoulder", "Kosher salt and black pepper", "1/4 cup fish sauce", "3 tablespoons light brown sugar", "2 tablespoons sambal chile paste (optional)", "2 garlic cloves, finely grated", "1 lime, halved crosswise, plus 1/2 cup fresh lime juice (from about 4 limes)", "1 orange or tangerine, halved crosswise (optional)", "Cooked rice noodles or rice, for serving (optional)", "1 head Boston lettuce or escarole, torn into large pieces", "6 mint sprigs  ", "1/2 bunch cilantro", "1 shallot, thinly sliced into rings"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife, slice pork shoulder crosswise into 1-inch-thick steaks. (Depending on the shape and cut of your shoulder, some pieces may not stay together in a steak shape; this is O.K.) Season pork with salt and pepper and place in a shallow baking dish (a 9-by-13 works best) or resealable plastic bag."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine fish sauce, light brown sugar, sambal (if using), garlic and 1/2 cup lime juice in a medium bowl, stirring to dissolve the sugar. Pour half of the mixture over the pork and let it sit for about 15 to 20 minutes while you prepare the grill, using tongs to turn pork once or twice to make sure all of it is getting enough attention from the marinade. (There’s no need to refrigerate, unless you are working ahead, in which case you should refrigerate until ready to grill.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re using a charcoal grill, build the fire so it’s screaming hot. This pork is to be cooked hot and fast, so the hotter the better. If you’re using a gas grill, heat it on high. Bring a clean baking dish out to the grill for the pork to rest in after cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the grill is sufficiently hot, grill the pork until deeply browned and lightly charred on both sides, 2 to 4 minutes per side (this will happen faster on a charcoal grill), moving the pork around as needed to prevent excessive flare-ups, which, depending on how fatty your pork is, will happen with varying severity. Grill the lime and orange, if using, cut-side down, until lightly charred, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pork and lime from the grill and let rest a minute or two in that same large baking dish to catch the juices. Drizzle the remaining lime dressing over the sliced pork and let it rest for a few minutes so the juices mix with the dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the pork about 1/4 inch thick. Arrange rice noodles or rice, if using, on a large platter and top with lettuce, along with some of the mint, cilantro and shallots. Top with sliced pork and remaining herbs and shallots. Spoon the juices from the bottom of the baking dish over everything, and serve with the grilled citrus for squeezing."}]}