{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach Risotto With Taleggio", "description": "This recipe, based on the nettle risotto from River Café in London, substitutes spinach, which is easier to find and less perilous to work with. It’s best made with mature, crinkly spinach, which has a more robustly mineral flavor than delicate baby leaves, but use whichever you can get. The melting taleggio makes the rice supremely creamy, and adds a funky earthiness. Note that it’s easiest to remove the rind and cut the cheese into cubes when it’s straight-from-the-fridge cold, then let it come to room temperature as you cook the rice. If you'd like to use an equal quantity of nettles here instead of spinach, you can.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/04/18/dining/18apperex/merlin_136610415_37ba3a16-85bb-4223-8769-46d84e1010fb-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, grains and rice", "keywords": "arborio rice, spinach, taleggio cheese, main course, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 810}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 496, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "4 grams", "proteinContent": "16 grams", "saturatedFatContent": "14 grams", "sodiumContent": "901 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces cold taleggio", "10 ounces/8 packed cups spinach, any thick stems removed", "6 tablespoons unsalted butter", "1 medium red onion, finely diced", "3 cups finely diced celery", "2 garlic cloves, finely grated or minced", "1 1/2 cup Arborio rice", "1 teaspoon fine sea salt, more as needed", "3/4 cup dry white wine", "3 1/2 cups good vegetable or chicken stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the rind off the taleggio and discard. Dice the cheese into 1/2-inch pieces. Set aside at room temperature as you prepare the rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a colander with a clean dish towel and place spinach inside. Heat about 8 cups of water until boiling, then pour over spinach; the spinach will wilt. Let spinach sit until cool enough to handle, then use the dish towel to squeeze out the water. Transfer spinach to a food processor and blend with 1 tablespoon butter until smooth. (You’ll end up with about 1 cup of purée.) Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt remaining 5 tablespoons butter in a large skillet over medium heat. Stir in onion, celery and garlic; cook until translucent, about 7 minutes. Stir in rice and 1 teaspoon salt, and cook until toasted and golden, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in wine and cook until it’s absorbed, about 3 minutes. Stir in stock, about 1/2 cup at a time, stirring often but not necessarily continuously, until the stock is finished and the rice is cooked through but not mushy, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in spinach purée, then taste and add more salt, if needed. Add taleggio and stir to melt. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1019267-spinach-risotto-with-taleggio"}