{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef and Broccoli Lo Mein", "description": "This takeout classic is beloved for a reason: It’s mild, satisfying and dependable. The chewy noodles and tender beef make for a weeknight dinner that won’t send you back to the fridge, snooping for a snack before bedtime. What makes this version better than the one from your neighborhood spot? A few things: It’s fresher, hotter and arguably faster. In this version, smaller florets ensure that the beef and broccoli cook quickly, and are easily scooped up with chopsticks. The florets' size also lowers your chances of overcooking them before they're crisp and tender. To finish, add sesame oil, if you have it, but don’t sweat it if you don’t. ", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2018/09/16/dining/sc-beef-broccoli/sc-beef-broccoli-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, quick, weekday, weeknight, noodles", "keywords": "beef, broccoli, lo mein, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 655}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 699, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "8 grams", "proteinContent": "35 grams", "saturatedFatContent": "12 grams", "sodiumContent": "1030 milligrams", "sugarContent": "15 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["1 (8-ounce) package lo mein noodles", "Salt", "3 garlic cloves, pressed or minced", "1/4 cup soy sauce", "1/4 cup dark brown sugar", "2 tablespoons canola or grapeseed oil", "1 pound chuck or rib steak, thinly sliced against the grain", "1 (1-inch) piece of ginger, peeled and cut into rounds", "1/4 teaspoon black pepper", "1/4 teaspoon red-pepper flakes", "1 head broccoli, cut into small florets (about 3 heaping cups)", "2 carrots, shredded", "3 scallions or green onions, thinly sliced", "2 to 3 teaspoons sesame oil (optional)", "1 lime, cut in wedges, for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook noodles in a large pot of boiling, salted water until tender, about 4 minutes, or according to package instructions. Drain and rinse under cold water. Meanwhile, stir together the garlic, soy sauce and brown sugar, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil in a large wok or skillet until hot and shimmering. Add the beef, ginger, black pepper and red-pepper flakes, and cook until crisp on the outside but still pink inside, 2 minutes. Season with salt, and move to a plate. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining oil to the wok and heat until shimmering. Add the broccoli and cook, tossing until crisp-tender, 2 minutes. Add 1/4 cup water and steam the broccoli until bright green and some of the liquid has evaporated, 2 minute more. Add the noodles, beef, ginger, carrots and soy sauce mixture to the pan, and toss over medium heat until coated and thickened a little, about 1 to 2 minutes. Salt to taste. Sprinkle with scallions, and drizzle with sesame oil, if using. Toss to coat and serve warm, with lime."}], "link": "https://cooking.nytimes.com/recipes/1019588-beef-and-broccoli-lo-mein"}