{"@context": "http://schema.org", "@type": "Recipe", "name": "Italian Wedding Soup With Turkey Meatballs", "description": "Classic Italian wedding soup is beloved for its simplicity and satisfaction. This turkey version is lean, while meatballs stay moist by simmering in broth. Start with the most flavorful broth you can get your hands on (homemade is ideal, but store-bought works well too), then pack the meatballs with flavor (garlic and parsley) and staying power (egg, panko and cheese, to gently bind them together). Traditionalists may be tempted to add a small grated onion to the meat mixture, and sweat celery and carrots into the broth, but for a quick weeknight meal, you won’t miss them here. If speed is your game, roll the mixture into 12 large meatballs—or opt for 20 smaller ones if serving kids (mini meatballs will cook through even faster). Either way, finish with a healthy dose of olive oil, lemon, cheese and dill, or any fresh Italian herb you may have on hand.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/01/23/dining/sc-italian-wedding-soup/merlin_149536266_3c7ae6a6-df66-4be9-85b8-b342ddc49038-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, quick, weeknight, soups and stews", "keywords": "chicken broth, ground turkey, orzo, panko, parmesan, spinach, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1350}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 669, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "2 grams", "proteinContent": "51 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1797 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 cups chicken broth", "2 tablespoons olive oil, plus additional for greasing and serving", "1 pound lean ground turkey", "1/2 cup panko bread crumbs", "1/3 packed cup fresh parsley leaves, finely chopped", "1 egg, lightly beaten", "3 to 4 garlic cloves, minced", "1 teaspoon kosher salt", "1/2 teaspoon black pepper", "1/2 cup freshly grated Parmesan cheese, plus more for serving", "3/4 cup orzo, ditalini, acini di pepe or another small soup pasta", "3 packed cups baby spinach or kale, thinly sliced", "1 lemon, zested and halved", "1/4 cup fresh dill, oregano or basil, roughly chopped (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the chicken broth and 2 tablespoons oil in a large pot and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add the turkey, panko, parsley, egg, garlic, salt, pepper and 1/2 cup Parmesan to a large bowl. Mix with a fork or clean hands until combined. Gently roll the mixture into 12 medium (2-inch) or 20 small (1 1/2-inch) meatballs and transfer to a baking sheet lined with lightly oiled aluminum foil or a silicone baking mat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler to high and set an oven rack 6 to 8 inches from the heat. Broil the meatballs until brown on two sides, turning halfway through, about 3 to 4 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta to the boiling broth and cook over medium until al dente, then lower the heat to a low simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the meatballs to the broth and simmer on low until completely warmed through, 3 to 5 minutes, stirring occasionally. Remove from the heat, and add the spinach and lemon zest, stirring well, to wilt. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the soup among four bowls. Drizzle each with olive oil, sprinkle with more Parmesan and squeeze a bit of lemon over the top. Scatter the dill over the top, or stir in."}], "link": "https://cooking.nytimes.com/recipes/1019925-italian-wedding-soup-with-turkey-meatballs"}