{"@context": "http://schema.org", "@type": "Recipe", "name": "Grasshopper Brownies", "description": "The classic grasshopper cocktail is made from equal parts crème de menthe, crème de cacao, and heavy cream. Its mint-chocolatey flavors translate perfectly to all sorts of desserts. These decadent layered bars start with a super fudgy brownie base, which is covered with crème de menthe infused buttercream, and a shell of rich chocolate ganache tops it all off. You could certainly substitute a bit more peppermint extract (about 2 teaspoons) and skip the alcohol in the crème de menthe if you’d like to keep these more family friendly. Peppermint extract varies quite a bit in intensity by brand, which is why a range is given, so taste as you go.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2017/12/13/dining/grasshopper-brownies/grasshopper-brownies-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "One 8-by-8-inch pan, 16 servings", "recipeCuisine": "", "recipeCategory": "candies, cookies and bars", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 465}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 374, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "14 grams", "sodiumContent": "99 milligrams", "sugarContent": "38 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["8 ounces/227 grams bittersweet chocolate, finely chopped", "1/2 cup/113 grams unsalted butter", "2 large eggs", "3/4 cup/165 grams light brown sugar", "1/4 cup/24 grams Dutch process cocoa powder", "2 teaspoons vanilla extract", "1/2 teaspoon kosher salt", "1/3 cup/43 grams all purpose flour", "1/2 cup/113 grams unsalted butter softened", "2 tablespoons cream cheese, at room temperature", "2 tablespoons crème de menthe", "1/2 to 1 teaspoon peppermint extract", "Pinch kosher salt", "2 cups/247 confectioner’s sugar", "6 ounces/170 grams bittersweet chocolate", "1/4 cup/60 milliliters heavy cream", "2 tablespoons unsalted butter", "Pinch kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and line the bottom and sides of an 8-by-8-inch baking dish with parchment paper or aluminum foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the brownies: In a heat-safe bowl set over a pan of simmering water, melt the 8 ounces/227 grams bittersweet chocolate and 1/2 cup/113 grams butter, stirring occasionally until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate large bowl, whisk the eggs and brown sugar together, until the mixture lightens a bit in color and texture, about 1 minute. Whisk in the cocoa powder, vanilla extract and salt, followed by the chocolate and butter mixture. Fold in the flour until just combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan and bake until the brownies are set and a toothpick inserted into the center has a few moist crumbs, 20 to 25 minutes. Set the pan on a rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the buttercream: In the bowl of a stand mixer fitted with the paddle attachment, beat the butter and cream cheese together until smooth. Add the crème de menthe, 1/2 teaspoon peppermint extract, and a pinch of salt and mix until smooth. Lower the mixer speed and slowly add the confectioners’ sugar. Increase the speed and beat until smooth. Taste and add more peppermint extract if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the buttercream over the cooled brownies, then refrigerate the brownies until the buttercream is cold and firm, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the ganache: Combine all of the ingredients for the ganache in a heat-safe bowl set over a pan of simmering water. Warm the mixture, stirring occasionally until it is melted and smooth. Pour the chocolate over the cooled buttercream and smooth the top with an offset spatula. Chill until the topping is set, about 30 minutes. Store the brownies in the refrigerator. For the cleanest slices make sure to remove the brownies from the pan and wipe off your knife in between cuts. "}], "link": "https://cooking.nytimes.com/recipes/1019094-grasshopper-brownies"}