{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Salmon With Fennel and Lime", "description": "Fennel is used several ways to flavor these tender fillets of slow-roasted salmon. The seeds are mixed with lime zest and salt to rub all over the fish before cooking, which perfumes it through and through. Then a shaved fennel bulb is used two ways, both roasted in the pan beneath the fillets and tossed with lime juice into a crunchy, slawlike salad to serve on the side. Elegant yet supremely simple, this is fast enough for a weeknight but special enough to share with friends.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/02/20/dining/20apperex1/20apperex1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weeknight", "keywords": "fall, spring, summer, winter, fennel, fennel seeds, lime, salmon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 473}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 454, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "4 grams", "proteinContent": "42 grams", "saturatedFatContent": "6 grams", "sodiumContent": "723 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["2 limes", "1 teaspoon fennel seeds, lightly crushed using a mortar and pestle or the flat side of a knife", "Kosher salt and freshly ground black pepper", "4 (6- to 8-ounce) skinless salmon fillets", "1 large fennel bulb with fronds", "Extra-virgin olive oil, for drizzling", "6 fresh marjoram or thyme sprigs", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Finely grate the zest from 1 lime into a small bowl, and set aside the zested lime. Add fennel seeds, 1/2 teaspoon kosher salt and 1/2 teaspoon pepper to the bowl and toss to combine. Sprinkle mixture all over salmon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, remove the fennel fronds from the bulb and chop up enough to make 1/4 cup. Trim fennel bulb, discarding stalks, and slice bulb thinly using a mandoline or a sharp knife. Spread half the fennel slices in a baking dish in an even layer and drizzle with oil. Arrange salmon on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the whole, unzested lime into thin rounds and lay the slices on top of the salmon. Tuck marjoram around the salmon and drizzle salmon generously with more olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until salmon is just cooked through, 15 to 20 minutes. (Thinner fillets may take less time, so start checking for doneness at 10 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toss chopped fennel fronds and remaining fennel slices with a pinch of salt in a medium bowl. Juice the zested lime and add some of the juice to the fennel, to taste. Drizzle the sliced fennel with olive oil and set aside to serve with the salmon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the salmon is done, drizzle it with more lime juice and sprinkle with flaky salt. Serve with the fennel salad on top, and the roast fennel on the side, if you like."}], "link": "https://cooking.nytimes.com/recipes/1019950-roasted-salmon-with-fennel-and-lime"}