{"@context": "http://schema.org", "@type": "Recipe", "name": "Provençal Veal Breast Stuffed With Swiss Chard", "description": "This Passover holiday recipe, an ancient jewel of Jewish Provençal cooking, feels modern with our new love of Swiss chard. It is traditional to use a whole veal breast with all the bones, but that makes for a giant roast by today’s standards. For this simplified but magnificent version, have a butcher trim, butterfly and remove the bones -- and save them to cook beside the meat, where they will add flavor and texture to the braise. The dish tastes best cooked a day ahead to allow the flavors to blend.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2018/03/21/dining/21passoverrex1/21passoverrex1-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "french, jewish", "recipeCategory": "dinner, roasts", "keywords": "kosher, main course, matzo, red wine, swiss chard, veal", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 48}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 543, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "4 grams", "proteinContent": "36 grams", "saturatedFatContent": "12 grams", "sodiumContent": "1001 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons olive oil", "3 large onions; 2 diced, 1 cut into 2-inch pieces", "Kosher salt", "Freshly ground black pepper", "3 garlic cloves, finely chopped (about 1 tablespoon) plus 2 cloves, unpeeled", "4 sprigs thyme, leaves removed and chopped (about 1 teaspoon)", "1 sprig fresh rosemary, leaves removed and finely chopped (1 teaspoon chopped)", "2 pounds Swiss chard (2 to 3 bunches), leaves and stems chopped", "1 (15-ounce) can crushed tomatoes", "1 large egg, lightly beaten", "1 square matzo, crumbled into 1/2-inch pieces", "1 boneless breast of veal, about 4 pounds, trimmed, butterflied, bones reserved (a butcher can do this, or order it for you); see note", "1/2 cup Côtes du Rhône or other dry red wine", "3 carrots, cut in half lengthwise and then cut on the diagonal in 1-inch slices"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a large skillet, heat 4 tablespoons of the olive oil over medium heat. Add diced onions, season with salt and pepper and sauté until softened. Mix in the chopped garlic, thyme and rosemary. A few handfuls at a time, stir in the chard and, using tongs to toss, cook with the onion mixture until all the greens are soft, about 10 minutes. Turn off the heat and use a slotted spoon to transfer chard mixture to a large bowl. Stir in tomatoes, egg and matzo pieces, mixing well. You will have at least 5 cups cooked filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Lay the meat flat on a clean work surface, season the top with salt and pepper and spread a thin layer of the filling (about half) evenly over the surface of the meat, leaving a 1-inch border. Reserve and refrigerate the remaining stuffing. Tightly roll the meat and secure it with kitchen twine, making a knot every 1 1/2 inches and tucking the meat in to enclose the ends. Season the outside of the roll with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining olive oil to the skillet, turn the heat to medium-high and brown the stuffed veal on all sides. Transfer to a large roasting pan with a lid. (If your skillet isn’t large enough, brown veal directly in the roasting pan, laid over 2 burners of your stovetop.) To the pan where you browned the meat, add wine and simmer for about a minute, scraping up any browned bits from the bottom of the pan. Spoon liquid over the meat. Scatter the carrots, large onion pieces and whole garlic cloves around the veal, place the bones, and pour in about 8 cups of water or enough to come halfway up the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce oven to 325 degrees and cook, covered, 2 1/2 hours, basting every 20 minutes or so, until veal is cooked through and tender, 165 degrees on a meat thermometer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the meat from the pan, set aside to cool, then refrigerate overnight. Strain the sauce, reserving the carrots and discarding the bones and the onions. Refrigerate sauce and carrots."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day (or when ready to serve), remove and discard the fat from the sauce and simmer sauce in a small pot until reduced by 1/3. Season with salt and pepper. Using a long sharp knife, slice the veal into 1-inch portions. (Pull out kitchen twine as necessary). Carefully transfer slices to a large ovenproof serving dish or roasting pan, scatter the reserved stuffing around the veal and pour the braising liquid and carrots over the top. (You can refrigerate the whole dish at this point, to be reheated just before serving, or proceed to reheat the meat now.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, reheat in a 350-degree oven, covered with foil, about 20 minutes or until heated through. Serve in individual portions or on a platter, with a little chard stuffing and carrots on top of each slice for color, and drizzled with some of the braising liquid."}]}