{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Leg Steak With Olive Relish and Tomatoes", "description": "Most lamb cuts can be made into chops. Some are expensive, like rib chops (from the rack) or loin chops (which look like miniature T-bone steaks), but there are also cheaper shoulder chops and sirloin chops. An easy chop to cook is the meaty, lean center-cut lamb leg steak, a thick slice with a round bone in the center. If you have ever grilled a butterflied lamb leg and found it difficult to cook evenly and carve, a lamb leg steak is a surprisingly easy way to go. Seasoned with salt and pepper, rosemary and garlic, it takes about 10 minutes to cook. Of course, if you’re grilling over coals, it will take time for your grill to be ready, but that gives your steak time to marinate: It tastes best if it is seasoned at least 20 minutes before cooking.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/08/15/dining/15Kitchenrex1/merlin_141877221_ac8e8545-32e5-46e2-a587-219aae891e07-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "meat", "keywords": "lamb leg steak, olives, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 79}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 317, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "1 gram", "proteinContent": "10 grams", "saturatedFatContent": "6 grams", "sodiumContent": "241 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 center-cut lamb leg steak, about 1 1/2 pounds, cut 1 1/2  to 2 inches thick ", "Salt and pepper", "1 tablespoon roughly chopped rosemary", "2 tablespoons extra-virgin olive oil", "4 garlic cloves, thinly sliced", "4 medium tomatoes, halved horizontally (optional)", "Large handful of arugula, for garnish", "3/4 cup roughly chopped pitted olives, a mix of black and green", "1/4 cup extra-virgin olive oil", "1/2 lemon, skin on, seeded and finely chopped (about 2 tablespoons)", "1 garlic clove, smashed", "Red-pepper flakes, to taste", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the lamb: Season lamb generously on both sides with salt and pepper. Sprinkle with rosemary, olive oil and garlic, smearing with hands to coat. Set aside at room temperature. Season cut sides of tomatoes, if using, with salt. (Light the grill now, if using charcoal.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the olive relish: Stir together chopped olives, olive oil, lemon, garlic and red pepper in a small bowl. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Have a charcoal grill ready or heat a ridged stovetop grill or cast-iron pan over medium-high heat. Grill or sear the lamb steak on one side for about 5 minutes, until nicely browned. Flip steak and cook on the other side for about 5 minutes more, until juices appear on the surface. Set aside to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place tomatoes, if using, seasoned with salt and pepper, cut-side-up on grill, pan or broiler, and cook for about 5 minutes, until heated through, but still firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, slice lamb into 1/8-inch slices and arrange on a platter. Surround with tomatoes and arugula. Pass olive relish separately."}], "link": "https://cooking.nytimes.com/recipes/1019455-lamb-leg-steak-with-olive-relish-and-tomatoes"}