{"@context": "http://schema.org", "@type": "Recipe", "name": "Wedge Salad", "description": "Wedge salads are essential steakhouse fare and have been for decades – “iceberg wedges, blue cheese, bacon” was Roger Sterling’s order on “Mad Men” when he and Don Draper saved the Madison Square Garden account in Season 3, set in 1963. But there is no reason not to bring them home: Pale green-white triangles of commodity iceberg drizzled in pale <a href=\"https://cooking.nytimes.com/recipes/1019393-buttermilk-blue-cheese-dressing\">white-blue dressing</a>, with crumbles of bacon and bright red pops of cherry tomato, and pricks of green chive strewn across the top. Serve a wedge and a steak, or a wedge and a hamburger, or a wedge and a roast chicken, or just a wedge and a lot of warm bread and cold red wine, and it’s a pleasant evening you’re having, a retro delight. Wedge is a salad for pleasure.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2018/07/08/magazine/08mag-eat-image1/08mag-eat-image1-articleLarge-v2.png", "totalTime": "PT20M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "bacon, blue cheese, buttermilk, cherry tomatoes, iceberg lettuce, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 332}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 403, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "3 grams", "proteinContent": "17 grams", "saturatedFatContent": "14 grams", "sodiumContent": "1249 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup cherry tomatoes, approximately 12 to 15, cut in half, about a half pint", "1 small shallot, peeled and diced, approximately 2 tablespoons", "2 tablespoons red-wine vinegar", "Kosher salt and freshly ground black pepper, to taste", "2 thick slices bacon", "8 ounces blue cheese, like Roquefort, crumbled", "1/4 cup buttermilk", "2 tablespoons mayonnaise", "1 tablespoon olive oil", "1 teaspoon hot sauce", "1 teaspoon lemon juice", "1 dash Worcestershire sauce, to taste", "1 large head iceberg lettuce, the outer leaves removed, cut into 4 wedges", "2 tablespoons finely minced chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the tomatoes, shallots and vinegar in a small bowl, and shower with salt and black pepper to taste. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the bacon in a sauté pan until crisp on both sides, then drain on a paper towel. Crumble when cool, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing. Put half the cheese into a medium-size bowl, and mash with a whisk. Add the buttermilk, mayonnaise, olive oil, hot sauce, lemon juice and Worcestershire sauce, then mash and whisk the dressing until it is mostly smooth. You may wish for a little more hot sauce, lemon juice or Worcestershire, to taste. Then whisk again, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the salad. Place one wedge of lettuce on each plate, and gently spoon dressing over it. Sprinkle each wedge with crumbled bacon, the dressed tomato halves, the remaining blue cheese and some minced chives."}], "link": "https://cooking.nytimes.com/recipes/1019392-wedge-salad"}