{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Turkey With Orange and Sage", "description": "Roast turkey with white wine and a lot of butter, too, as it happens. The butter, massaged under the bird's skin, does a lot to help keep the breast meat moist, and the juice and wine in the pan below the bird create a deliciously steamy environment for the roasting. The combination leads to an interesting outcome: a bird that crisps up nicely not at the beginning of cooking, but at the end. The sweet-savory drippings make for excellent gravy.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2018/10/23/dining/ss-roast-turkey-with-orange-and-sage/ss-roast-turkey-with-orange-and-sage-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "fall, winter, main course, orange, sage, turkey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 535}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 749, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "2 grams", "proteinContent": "92 grams", "saturatedFatContent": "12 grams", "sodiumContent": "1037 milligrams", "sugarContent": "6 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 12- to 14-pound turkey, giblets removed", "1/2 cup unsalted butter, at room temperature", "Zest of 1 orange", "2 tablespoons chopped fresh sage", "2 cloves garlic, minced", "1 tablespoon kosher salt, plus more to taste", "1 teaspoon freshly ground black pepper, plus more to taste", "1/2 of a 750-milliliter bottle dry white wine", "2 cups orange juice", "10 to 12 fresh sage leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Pat turkey dry with paper towel and place it on a rack in a roasting pan. In a small bowl or on a clean cutting board, mash the butter together with the orange zest, sage, garlic, salt and pepper to create a paste. Lift the turkey’s skin at the neck and gently use your hand to separate skin from breast meat. Rub about half of the compound butter under the skin, covering the breast meat. Rub the rest of the butter over the skin of the turkey and season with a little more salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the wings of the turkey under the bird, and tie its legs together with butcher’s twine. Pour the wine and orange juice into the roasting pan, scatter the sage leaves over the liquid and carefully slide the pan into the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast for about 2 to 3 hours, basting bird every 30 minutes with drippings. Start checking the bird 1 hour and 45 minutes into cooking, and tent it with foil if skin is turning too dark. Cook until an instant-read thermometer inserted into the thickest part of the thigh without touching bone registers 165 degrees. Transfer to a cutting board or platter and allow to rest at least 30 minutes before carving."}], "link": "https://cooking.nytimes.com/recipes/1019011-roast-turkey-with-orange-and-sage"}