{"@context": "http://schema.org", "@type": "Recipe", "name": "Gingerbread House", "description": "Orange and lemon zests make this recipe, from Bill Yosses, the former White House pastry chef, especially delicious, if you plan on eating your gingerbread house (and you can, even weeks after baking). But feel free to leave them out. We strongly recommend using a scale here. It will make it much easier to accurately measure the ingredients and to evenly divide the dough. This recipe, for the house's building blocks, is large, and it makes enough for the project featured in our <a href=\"https://cooking.nytimes.com/guides/47-how-to-make-a-gingerbread-house\">How to Make a Gingerbread House guide</a>. But as the instructions state, you'll want to make it in two batches, since it's too big for the average stand mixer. Note that you'll want to bake your gingerbread at least a few days before assembling the house, to give the slabs time to harden, and set aside a few hours for decoration and assembly.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/12/06/dining/06GINGERBREADnew3/06GINGERBREADnew3-mediumThreeByTwo440-v2.jpg", "totalTime": "PT2H", "recipeYield": "Gingerbread for 1 9-by-9-inch house", "recipeCuisine": "", "recipeCategory": "cookies and bars, project", "keywords": "cinnamon, ginger, molasses, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 72}, "recipeIngredient": ["1 pound/454 grams unsalted butter (4 sticks), at cool room temperature", "2 1/2 cups plus 3 tablespoons/595 grams dark brown sugar", "12 3/4 cups plus 2 tablespoons/1,648 grams all-purpose flour, plus more for dusting ", "2 heaping tablespoons/15 grams ground ginger", "2 heaping tablespoons/15 grams ground cinnamon", "1 1/2 teaspoons baking soda", "1/2 teaspoon baking powder", "1/2 teaspoon salt", "4 eggs, at room temperature", "2 cups molasses", "Zest of 2 lemons (optional)", "Zest of 2 oranges (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make half of the batch: In a mixer fitted with the paddle attachment, cream together half the butter and half the sugar for 5 minutes, until fluffy. Scrape down sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, sift together the dry ingredients — the flour, ginger, cinnamon, baking soda, baking powder and salt — and set aside half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With mixer running at low speed, add two eggs, one at a time. Mix in 1 cup molasses. Scrape down bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In 3 batches, add half the dry ingredients, mixing just to combine. To prevent any flour from flying out, make sure the mixer is off when adding each batch, and drape a towel over it when mixing. Mix in zest of 1 lemon and 1 orange."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull dough out of mixer, and wrap in plastic wrap, or transfer to a resealable plastic bag. Repeat Steps 1 to 5 to make the remaining dough. Refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, heat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out dough: For each square, weigh out about 20 ounces of dough. The goal is to end up with five 9-inch squares, so you’ll roll them out a bit larger, bake them and trim off the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly dust a large piece of parchment paper with flour. Place the chilled dough on top. Roll side to side and up and down to make a rough square shape. While you roll, make frequent quarter-turns so that the dough remains even."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll until dough is about 10 by 10 inches and a generous 1/4-inch thick. Transfer to a baking sheet. Repeat with remaining dough. (Any dough left after the squares have been prepared can be rolled out 1/4-inch thick and used for cookies.) In the oven, the slab will rise to about 3/8- or 1/2-inch thickness, which will make the house extra sturdy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 25 to 30 minutes, until even and firmly set. Place pans on racks to cool. To prevent bending and cracking, carefully transfer to racks by lifting parchment paper. When completely cool, stack the slabs, still on parchment, and set aside to dry out at room temperature for 3 to 7 days. (When ready to assemble, see <a href=\"https://cooking.nytimes.com/guides/47-how-to-make-a-gingerbread-house\">How to Make a Gingerbread House guide</a> for full instructions.)"}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Gingerbread House Recipe", "description": "gingerbread-house", "thumbnailUrl": "https://static01.nyt.com/images/2017/12/06/dining/06GINGERBREADnew3/06GINGERBREADnew3-mediumThreeByTwo440-v2.jpg", "uploadDate": "2017-12-01T19:54:58.000Z", "duration": "PT1M28S"}, "link": "https://cooking.nytimes.com/recipes/1019072-gingerbread-house"}