{"@context": "http://schema.org", "@type": "Recipe", "name": "Sicilian Stuffed Pizza With Ricotta and Arugula", "description": "At a pizzeria in the small Sicilian town of Vallelunga-Pratameno, about a couple of hours' drive from Palermo, you could get nearly any kind of pizza, but the house specialty didn’t look like a pizza at all. To make it, the dough was stretched as usual, then slid naked, with no toppings, onto to the oven’s stone floor. In no time at all, the dough began to puff up until nearly spherical, like a giant pita bread. It was taken from the oven, split open and filled with fresh local sheep’s milk ricotta and a large handful of arugula. To serve, it was cut into wedges, like a heavenly sandwich. My version includes a few anchovies and strips of roasted pepper, but even without them, it is delicious.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/06/06/dining/06kitchenrex/06kitchenrex-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 to 4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, pizza and calzones", "keywords": "anchovies, pecorino, pizza dough, sweet pepper, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 91}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 319, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "16 grams", "saturatedFatContent": "7 grams", "sodiumContent": "772 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["Fine semolina, for dusting", "8 ounces pizza dough (store-bought or homemade), rolled in a ball and held at room temperature (<a href=\"https://cooking.nytimes.com/recipes/1017931-pizza-dough\">see recipe</a>)", "8 ounces very fresh ricotta, drained", "Extra-virgin olive oil", "6 to 8 anchovy fillets, rinsed and blotted", "A few strips of roasted sweet pepper", "A few basil leaves", "Salt and pepper", "Crushed red-pepper flakes", "1/4 cup grated aged pecorino cheese, such as pepato", "2 large handfuls arugula, preferably not too tender"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn oven to 450 degrees and put a pizza stone on the middle shelf to heat for 20 to 30 minutes. (Alternatively, use a heavy-duty baking sheet.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle a clean work surface lightly with semolina. Place the pizza dough on top and push down with your hands, flattening it. Dust lightly with semolina, if it seems sticky. Press down and outward with fingers to a diameter of about 8 inches. (You may use a rolling pin if you prefer.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle more semolina beneath the dough so it will easily slide as you begin to stretch it in all directions to a diameter of about 10 inches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To transfer the dough to the oven, slide a pizza peel (or something similar, like the steel, rimless bottom of a tart pan or a stiff piece of cardboard) under the dough. There should be sufficient semolina on the bottom of the dough to keep it from stickling to the peel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transport the dough to the oven and quickly slip it from the peel onto the pizza stone. In a few minutes it will begin to puff. Let it bake for 8 to 10 minutes, until nicely browned and well puffed. Remove from oven and place on a cutting board."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a knife to cut all the way around at the edge, separating the top half from the bottom. Add the fillings: Spoon the ricotta in blobs to cover the surface, then smooth briefly. Drizzle ricotta with 3 tablespoons olive oil and arrange randomly the anchovy, pepper strips and basil. Season lightly with salt, pepper and crushed red pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover everything with pecorino and arugula and put the top back on the pie. Use a large knife to cut the pie in half, then in wedges of what ever size you with. Serve immediately."}]}