{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Salmon and Brussels Sprouts With Citrus-Soy Sauce", "description": "Roasting vegetables like brussels sprouts, scallions and jalapeño next to salmon fillets as they cook makes for a crunchy, sweet and spicy side that requires very little work on your part. When the salmon and vegetables are done, spoon a lively sauce made of citrus juice (any you choose), rice vinegar and soy sauce over everything. If you like, serve with rice, whole grains, soba or udon — there’s plenty of sauce to go around.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/01/10/dining/sheetpan-sprouts-salmon/sheetpan-sprouts-salmon-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday, weeknight, seafood", "keywords": "brussels sprouts, salmon, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 539}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 476, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "5 grams", "proteinContent": "39 grams", "saturatedFatContent": "6 grams", "sodiumContent": "758 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 pound brussels sprouts, thinly sliced (about 4 1/2 cups)", "3 to 4 scallions, trimmed, white and green parts thinly sliced (about 1/2 cup)", "1 jalapeño, thinly sliced (about 1/4 cup)", "2 tablespoons toasted sesame or extra-virgin olive oil", "Kosher salt and black pepper", "4 (6-ounce) skin-on salmon fillets, about 1-inch thick", "1/4 cup freshly squeezed lemon, lime or tangerine juice", "2 tablespoons rice vinegar", "2 tablespoons soy sauce", "Honey, to taste (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees, and line a baking sheet with parchment paper. In a large bowl, toss brussels sprouts, scallions and jalapeño with the 2 tablespoons oil to coat. Season with salt and pepper, then spread out on the prepared baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the salmon fillets dry, then season with salt and pepper and nestle them, skin side down, among the brussels sprouts. Roast, stirring the brussels sprouts occasionally, until the brussels sprouts are tender and the salmon is cooked through, 12 to 14 minutes. (The salmon is done when a knife slides through it easily and the fish flakes, or when an instant-read thermometer reaches 120 degrees.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the salmon’s roasting, stir together the citrus juice, rice vinegar, soy sauce and 2 tablespoons water. (If you find it too puckery, add a little honey or more water.) Serve the sauce alongside the salmon and brussels sprouts for drizzling and dipping."}], "link": "https://cooking.nytimes.com/recipes/1019900-roasted-salmon-and-brussels-sprouts-with-citrus-soy-sauce"}