{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Minced Shrimp With Rice Noodles", "description": "This is an easy dish to make, but the method is a bit unusual. First, you make what is essentially a flavorful sausage-like mixture of chopped shrimp (which could also be used as a won ton filling), then stir-fry the mixture over high heat until it crumbles, releasing its flavor into the pan. To make it a simple, satisfying meal, this stir-fry is tossed with cooked rice noodles. If you can find it, dried shrimp, available in most Asian or Latin American grocers, add depth: Keep an eye out for some from Louisiana, made with wild shrimp. ", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/08/29/dining/29kitchen2/merlin_142336935_38dfacc4-c102-4a78-a3e5-e7f0ba27d598-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, noodles, seafood", "keywords": "ginger, rice noodles, scallion, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 177}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 607, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "94 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "2 grams", "proteinContent": "23 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1289 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound dry flat rice noodles (sometimes called rice stick noodles)", "About 1 pound wild shrimp, in the shell, fresh, or frozen and thawed (about 24 pieces)", "2 fresh red Fresno chiles or green Serrano chiles, seeds removed, if desired, finely chopped (or substitute 1 teaspoon red-pepper flakes)", "2 tablespoon dried shrimp, finely chopped (optional)", "1 tablespoon rice vinegar", "2 tablespoons soy sauce", "2 teaspoons toasted sesame oil, plus 1 teaspoon for drizzling", "2 tablespoons mirin or sherry (if using sherry add 1 teaspoon sugar)", "1 teaspoon grated garlic (about 2 or 3 cloves)", "1 tablespoon grated ginger", "1 teaspoon kosher salt, plus more as necessary", "3 tablespoons chopped scallions", "3 tablespoons coconut or vegetable oil", "Basil leaves, cilantro sprigs and 2 tablespoons chopped roasted peanuts, for garnish", "Lime wedges, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak noodles in a large bowl of lukewarm water. Leave until softened but still firm, about 15 minutes. Drain and rinse well with cold water. Set aside. (Alternately, boil noodles for 2 or 3 minutes, then drain and rinse well with cold water.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, peel shrimp and make the seasoned shrimp mixture: With a large knife, cut the shrimp crosswise into rough 1/4- to 1/2-inch slices. In a large bowl, combine shrimp, chopped chiles, dried shrimp (if using), rice vinegar, soy sauce, 2 teaspoons sesame oil, mirin, garlic, ginger, salt and scallions. Mix well to distribute ingredients throughout. Refrigerate for at least 20 minutes (or, preferably, up to 24 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put coconut oil in a large wok or wide cast-iron skillet over high heat. When oil looks wavy, add shrimp-sausage mixture, breaking it up with a wooden spoon, until it looks crumbly. Stir-fry until pieces are lightly browned, about 3 or 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add noodles to pan and toss briefly, just to heat through. Drizzle with 1 teaspoon sesame oil. Taste and add a little more salt if necessary. Transfer to bowls and garnish with basil leaves, cilantro sprigs, chopped peanuts and lime wedges, if using."}]}