{"@context": "http://schema.org", "@type": "Recipe", "name": "Moroccan Chicken Pie", "description": "This is a slightly simplified version of Moroccan pastilla (also known as bsteeya or b’stillah), the savory pastry served on festive occasions. Still, there are a lot of steps involved. For ease of preparation, make the chicken filling up to a day in advance of serving — the actual building of the pie takes relatively little time. Or assemble the entire pie and refrigerate, unbaked, up to a day ahead. In Morocco, thin pastry leaves called warqa make the pie’s flaky layers, but elsewhere most cooks use readily available phyllo dough. Dusting the exterior with powdered sugar might sound odd, but this traditional combination of sweet and savory is truly beguiling.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/02/20/dining/20kitchrex1/merlin_150550410_e68503a6-a5ba-4fe1-8fef-80eca36601e0-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "moroccan", "recipeCategory": "dinner, pies and tarts, poultry", "keywords": "chicken thighs, golden raisins, phyllo, preserved lemon, ricotta, saffron, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 295}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 898, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "68 grams", "fiberContent": "5 grams", "proteinContent": "33 grams", "saturatedFatContent": "28 grams", "sodiumContent": "906 milligrams", "sugarContent": "13 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 pounds large skin-on, bone-in chicken thighs (6 to 8 thighs)", "Salt and pepper", "2 tablespoons extra-virgin olive oil", "1 large onion, diced (about 1 1/2 cups)", "4 garlic cloves, minced", "1/2 teaspoon ground turmeric", "1/2 teaspoon crumbled saffron", "1 teaspoon ground ginger", "1/2 teaspoon ground allspice", "1 teaspoon ground cinnamon", "4 cups chicken broth", "1 cup golden raisins, soaked in hot water and drained", "1 pound ricotta", "2 tablespoons chopped mint", "3 tablespoons diced preserved lemon, skin only, rinsed", "2 tablespoons fresh lemon juice", "1 teaspoon grated lemon zest", "1 cup roughly chopped toasted almonds", "1 cup roughly chopped toasted pistachios", "14 (12-by-17-inch) sheets phyllo", "3/4 pound unsalted butter (3 sticks), melted", "Confectioners’ sugar, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chicken filling: Season the chicken thighs generously on both sides with salt and pepper; go heavy on the pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put olive oil in a wide, deep skillet or Dutch oven over medium-high heat. Add onion, season with salt, and cook, stirring, until softened and beginning to brown, 5 to 7 minutes. Add garlic, turmeric, saffron, ginger, allspice and cinnamon, and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place seasoned chicken thighs on top of onion mixture, add chicken broth and bring to a boil. Reduce heat to maintain a brisk simmer, cover with lid ajar and cook until chicken is tender, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove thighs from pot and let cool. Continue to cook onion mixture until all broth has evaporated and only onion remains. Turn off heat and let onions cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and discard skin and bones from chicken thighs. Tear thigh meat into 1-inch strips and add to onion mixture. Add raisins and toss to combine. Taste and adjust seasoning. (Chicken can be prepared in advance until this point.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put ricotta in a bowl and add mint, preserved lemon, lemon juice, lemon zest and a little salt. Stir to combine, and set aside. Heat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove phyllo from package, unroll to make a flat stack and cover with a damp kitchen towel. Assemble the pie: Brush bottom and sides of a 12-inch paella pan or low, round earthenware casserole with warm melted butter. Lay 2 sheets of phyllo side by side in pan, overlapping in the middle by 1 inch, pressing down in the center so phyllo lines bottom of pan, leaving the excess hanging over the sides. Butter the sheets from the center all the way to the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat the process with 2 more sheets of phyllo, set at a slight angle to the first layer. Paint this layer with butter all the way to the edges. Repeat, setting the pastry again at a slight angle to the previous layer, so the overhanging edges make a complete circle by the end of the process. Make 7 buttered layers of 2 sheets each."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the pie: Sprinkle the bottom of the pan with half the almonds and pistachios. Spread the chicken mixture evenly across the pan. Drop spoonsful of the ricotta mixture over the chicken mixture. Top the ricotta layer with remaining pistachios and almonds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Close the pie by folding all the overhanging phyllo sheets gently toward the center of the pan, pressing to enclose the filling. Brush more butter over the top and tuck in and smooth any stray phyllo."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the pie for 35 to 40 minutes, until nicely browned and crisp. To unmold, invert pie onto a cool baking sheet, exposing the flat top (formerly the bottom) of the pie. With spatulas, carefully transfer pie to a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put confectioners’ sugar in a mesh strainer, and shake to cover the pie generously, like a thin layer of fallen snow. Cut into wedges to serve, but for the best experience, forgo the fork, and eat the pie with your fingers."}]}