{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Turkey With Garlic and Anchovies", "description": "In this flavorful recipe, a whole roasted turkey is seasoned like a Provençal leg of lamb, with rosemary, anchovies and plenty of garlic. Cutting tiny slits into the turkey’s legs helps distribute the garlic-anchovy paste, which perfumes the meat. You’ll need to start marinating the turkey at least a day ahead, although, if you have the space in your refrigerator and the time, starting two or three days ahead is even better. Chilling the turkey uncovered helps dry out the skin, yielding a particularly crisp and golden bird.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/11/07/dining/07Turkeyrex1/merlin_144441174_a7ed06ff-a782-4a8a-bb69-c0823b605cf2-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings with leftovers", "recipeCuisine": "", "recipeCategory": "dinner, poultry, roasts", "keywords": "anchovies, capers, chicken stock, garlic, rosemary, turkey, wine, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 334}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 796, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "1 gram", "proteinContent": "87 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1817 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 garlic cloves", "8 to 12 anchovy fillets, to taste", "1 tablespoon fresh rosemary", "1 tablespoon drained capers", "1 tablespoon ground black pepper", "Kosher salt, as needed", "1 (10- to 13-pound) turkey, giblets removed", "1 small onion, thinly sliced", "2 shallots, thinly sliced", "1/2 small fennel bulb, diced", "1/2 lemon, seeded and thinly sliced", "1 cup dry white wine", "1 to 2 quarts turkey or chicken stock, as needed", "Extra-virgin olive oil, as needed", "1/2 cup dry white wine", "5 tablespoons unsalted butter, cubed", "2 tablespoons all-purpose flour", "1 cup turkey or chicken stock, more as needed", "1 tablespoon tarragon leaves (optional)", "Kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender, small food processor or large mortar and pestle, combine garlic, anchovies, rosemary, capers and pepper and 1/2 teaspoon salt per pound of turkey (i.e. 5 teaspoons salt for a 10-pound turkey). Process or pound to a paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a wire rack on top of a rimmed baking sheet. Cut tiny slits all over turkey legs. Rub two-thirds of the paste all over the turkey, under its skin and in the cavity, then stuff remaining paste into holes in the legs. Transfer to the rack on the baking sheet and refrigerate uncovered overnight or for up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove turkey from the refrigerator 1 hour before roasting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Scatter onion, shallots, fennel and lemon in a roasting pan fitted with a rack. Pour in wine and 1 cup water, then add enough turkey or chicken stock so there is 1/4 inch of liquid in the pan. Place turkey on the roasting rack and brush with oil. Roast for 30 minutes, then cover breast with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce oven to 350 degrees and continue to roast until an instant-read thermometer inserted into the thickest part of the thigh reads 165 degrees, 1 1/2 to 2 hours longer. If the bottom of the pan dries out entirely, add a little more stock to keep it from burning. Remove from oven and let rest 10 minutes on the roasting rack. Transfer to cutting board and rest another 10 to 15 minutes before carving and serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the turkey rests, make the gravy: Remove the roasting rack and use a slotted spoon to remove lemon slices, onions, shallots and fennel from the pan. Pour in wine and bring to a simmer over medium heat, scraping up the browned bits on the bottom of the pan. Simmer until liquid is nearly evaporated, then whisk in butter and flour. Let it cook, whisking, until flour mixture turns pale gold, about 3 minutes. Whisk in stock and tarragon, if using. Bring to a simmer and heat until thickened, about 3 to 5 minutes, whisking occasionally. If you want a very smooth gravy you can blend in a blender or pass the mixture through a sieve. Or serve as is. Taste and add salt if necessary."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Roast Turkey With Garlic and Anchovies", "description": "Melissa Clark is roasting her Thanksgiving turkey with garlic and anchovies — a tribute to her late father, who loved cooking the turkey.", "thumbnailUrl": "https://static01.nyt.com/images/2018/11/07/dining/07Turkeyrex1/merlin_144441174_a7ed06ff-a782-4a8a-bb69-c0823b605cf2-mediumThreeByTwo440.jpg", "uploadDate": "2018-10-30T21:42:24.000Z", "duration": "PT2M11S"}}