{"@context": "http://schema.org", "@type": "Recipe", "name": "Cauliflower Gratin With Leeks and White Cheddar", "description": "A sort of cheater's gratin, this cauliflower cooked with leeks and cream doesn’t require blanching or a béchamel, making it a low maintenance, deeply comforting side dish. To skirt the blanching, the cauliflower and cream is covered in foil to give the vegetables a chance to get tender without drying out. The foil then comes off so the top can brown and the cream can reduce, creating a thick, velvety sauce. If your heart desires a crunchier texture, add a scattering of bread crumbs tossed in olive oil and seasoned with salt and pepper when the aluminum foil comes off.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/11/14/dining/14cauliflowerrex3-copy/14cauliflowerrex3-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "cauliflower, cheddar, leek, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1510}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 264, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "3 grams", "proteinContent": "11 grams", "saturatedFatContent": "13 grams", "sodiumContent": "514 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 small-ish head cauliflower (about 2 pounds), green leaves removed", "Olive oil, for drizzling", "1 small leek, white and light green part only, very thinly sliced", "Kosher salt and black pepper", "¾ cup heavy cream", "6 ounces sharp white Cheddar, grated (about 1 1/2 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Slice cauliflower head lengthwise into 1/2-inch thick slices, including the core and leaves. (Some smaller bits will fall away: That’s fine. You’ll use them as well.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle some olive oil onto the bottom of a 2-quart baking dish. (An oval, square or rectangular dish will all work.) Layer about a third of the cauliflower along the bottom, and about a third of the leeks. Season with salt and pepper, and repeat until all of the cauliflower and leeks are used. (Don’t worry about perfectly layering them.) Season with salt and pepper and drizzle cream over. Scatter cheese on top, and season again with salt and pepper. Lightly cover with foil and place in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until cauliflower is nearly tender, 10 to 15 minutes. Remove foil and continue to bake until cream has thickened and reduced nearly completely and the top is golden brown and crisp, 35 to 40 minutes. Remove from oven and let cool slightly before eating."}], "link": "https://cooking.nytimes.com/recipes/1019708-cauliflower-gratin-with-leeks-and-white-cheddar"}