{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Lamb Chops With Fennel and Cucumber", "description": "One of the quickest-cooking cuts out there, lamb loin chops are leaner than a rib chop, with a very mild lamb flavor. Seasoning them simply with salt and pepper would be enough, but a good sprinkle of crushed fennel seed and plenty of black pepper adds excellent crispy, crunchy bits to the seared meat. Serve squeezed with lemon and scattered with herbs alongside a cucumber salad, or with an herby bowl of rice or other grains.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/10/17/dining/17Romanrex2-copy/17Romanrex2-copy-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weekday, meat", "keywords": "cucumber, fennel, lamb chops, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 158}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 230, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "4 grams", "proteinContent": "11 grams", "saturatedFatContent": "5 grams", "sodiumContent": "390 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon fennel seed", "1 1/2 pounds lamb loin chops, about 1-inch thick, or individual rib chops (unfrenched)", "Kosher salt and coarsely ground black pepper", "1 tablespoon canola oil", "1 small fennel bulb, thinly sliced", "1/2 hothouse or 1 Persian cucumber, thinly sliced", "1 small shallot, thinly sliced into rings", "2 lemons", "1/2 cup picked dill or mint leaves", "Cooked couscous, rice, farro or barley, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a knife, mortar and pestle or spice grinder, finely chop or coarsely grind fennel seed. (Just grind it enough to break down the whole seeds: You’re not looking for a powder.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season lamb with salt, pepper and fennel seed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large skillet over medium-high heat. Place lamb fat-side-down in the skillet and cook until it’s a good golden brown, about 2 minutes. (This also renders some of the fat, which you’ll sear the meat in.) Using tongs, turn the lamb and cook until it’s nicely browned on each side, 1 to 2 minutes per side, which will give you medium-rare meat. Transfer lamb to a cutting board to rest for at least 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toss sliced fennel bulb, cucumber and shallot in a medium bowl. Zest and juice 1 lemon and add to the fennel. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve lamb chops whole on a large serving platter, or slice lamb away from the bone or rib about 1/4-inch thick, then transfer to a large serving platter or divide among plates. Cut remaining lemon in half and squeeze over lamb. Scatter with dill or mint and serve alongside fennel salad and cooked grains, if you like."}]}