{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta Tahdig", "description": "Though no Italian would admit it, pasta makes for a great tahdig, the crisp, golden crust that forms at the bottom of every pot of Persian rice. With a shatter, the sweet, crunchy crust yields to a mouthful of perfectly seasoned, perfectly sauced spaghetti. Rotate the pan as it cooks for an evenly brown tahdig, but resist the urge to turn up the heat as the the pasta sizzles. Slice and serve it warm, showered with Parmesan, or alongside meatballs or a bright green salad. Or let it cool to room temperature, wrap it up and take it to a picnic — it will erase every lackluster potluck pasta salad from memory. ", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2018/05/27/magazine/27Eat2/27Eat2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian, middle eastern", "recipeCategory": "noodles", "keywords": "main course, parmesan, spaghetti, tomato sauce", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 794}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 296, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "3 grams", "sodiumContent": "488 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["Salt", "1 pound spaghetti or capellini (angel hair)", "Extra-virgin olive oil", "2 cups tomato sauce", "1 cup finely grated Parmesan, plus more for serving", "Optional: 1 tablespoon Calabrian chile paste or 1 teaspoon red-pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of generously salted water to a boil over high heat. Set a colander in the sink. Cook the pasta, stirring occasionally with tongs to prevent clumping. Taste, and adjust salt as needed. When the pasta is al dente, drain into colander."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pasta to pot, and add 2 tablespoons oil, tomato sauce, 1 cup Parmesan and chile paste or flakes, if using. Stir well with tongs to combine. and taste to ensure that the mixture is well seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a 10-inch nonstick pan over medium heat. Add 3 tablespoons oil. When it shimmers, pile in the pasta, and use a silicone spatula to lightly pat it evenly down into the pan. The pan may seem perilously full, but the cake will condense as it cooks. Use spatula to gently coax the pasta on the edges into a cakelike shape, and reduce heat to medium low. Add oil as needed until you can see it gently bubbling up the sides of the pan — this will ensure that the edges of the tahdig are brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, rotating pan a quarter-turn every 5 minutes to ensure even browning. Periodically run spatula around the edges to prevent sticking. After 20 minutes, carefully tip excess oil into a heatproof bowl, then cover the pan with a pizza pan or large, flat pot lid. Carefully flip tahdig onto pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add oil back into pan, and return to medium heat. If needed, add more oil to coat bottom of the pan. Carefully slide tahdig back into pan, using spatula to coax it back into shape. When oil begins to gently bubble up the sides of the pan, reduce heat to medium low, and cook for 20 minutes, rotating pan a quarter-turn every 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe pizza pan clean, tip out excess oil and flip tahdig onto pan as before. If either side (or both) can use a little more crisping, return tahdig to pan without oil, increase heat to medium high and cook for 60-90 seconds, until sizzling and properly browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dab away any excess grease with a paper towel. Allow tahdig to cool for 10 minutes before using a sharp bread knife to cut into slices. Serve warm or at room temperature with grated Parmesan."}], "link": "https://cooking.nytimes.com/recipes/1019328-pasta-tahdig"}