{"@context": "http://schema.org", "@type": "Recipe", "name": "Linguine With Melted Onions and Cream", "description": "This surprisingly elegant pasta dish is also seriously easy. All you need are pantry ingredients and some patience for slowly cooking down the onions until they turn into a fragrant purée. Add a squeeze of tomato paste and a slosh of heavy cream, taste and done. This recipe comes from a book by two excellent home cooks: “The Good Food: A Cookbook of Soups, Pastas and Stews” by Julie Strand and Daniel Halpern, first published in 1985 and reissued in 2018.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2018/11/21/dining/21leftovers-rex-linguine/merlin_146551128_16a3cdd9-e5e6-4920-9325-dcdb492b29a9-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "american, italian", "recipeCategory": "dinner, pastas", "keywords": "heavy cream, onion, tomato paste, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 414}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 864, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "101 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "7 grams", "proteinContent": "22 grams", "saturatedFatContent": "19 grams", "sodiumContent": "787 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons unsalted butter", "4 tablespoons olive oil", "4 large onions, very thinly sliced (you can do this in the food processor)", "Salt", "1/2 cup heavy cream", "2 teaspoons tomato paste, more to taste", "Ground black pepper", "1 pound linguine or other long, thin pasta", "1/2 cup freshly grated Parmesan cheese, more for serving", "Finely minced parsley, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide skillet with a lid, heat the butter and oil over medium heat. When melted, add the onions in batches, stirring to coat. Reduce the heat to very low, cover and cook, stirring often, until very soft and translucent, about 30 minutes. The onions may turn light gold, but they should not brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with 1 teaspoon salt, cover and continue cooking until onions are golden and melting into a purée, 30 to 60 minutes more depending on the thickness of the onions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a microwave, heat the cream until warm, add the tomato paste, and stir until dissolved."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a large pot of water with 1 tablespoon salt to a boil over high heat for the pasta. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the onions are cooked, stir the cream mixture into the skillet along with a dozen grinds of black pepper. Cook, stirring, until the onion mixture is slightly thickened, 2 to 3 minutes. Turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta to the boiling water and cook until tender, then drain and return to the pot. Immediately add the onion mixture and Parmesan cheese and toss together. Taste and adjust the seasonings with salt and pepper; add a little more tomato paste if the mixture needs sweetness or acidity."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately, sprinkling each serving lightly with parsley, if you’d like. Pass more cheese at the table."}]}