{"@context": "http://schema.org", "@type": "Recipe", "name": "Brown-Butter Salmon With Lemon and Harissa", "description": "More put-together than thrown-together, this weeknight salmon gets an upgrade with a tangy and spicy brown butter-harissa sauce. To make it a complete meal, serve the fish with a simple lemony salad and maybe a bowl of grains or roasted or boiled potatoes. This salmon is meant to be enjoyed on the medium-rare side. If you prefer your fish more well done (or if the fillet is especially thick), increase cooking time by a few minutes.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/12/12/dining/12romanrex1/merlin_143108520_28482b08-47be-4f5a-aa4c-5fc56d261efe-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, weeknight, seafood", "keywords": "dill, harissa, lettuce, salmon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 440}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 545, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "2 grams", "proteinContent": "37 grams", "saturatedFatContent": "13 grams", "sodiumContent": "717 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds skin-on salmon fillet (or use 1 1/2 pounds of individual fillets)", "Kosher salt and black pepper", "4 tablespoons unsalted butter", "4 garlic cloves, sliced", "2 tablespoons olive oil, plus more as needed", "2 tablespoons harissa paste", "4 tablespoons fresh lemon juice, plus more for serving", "1 small shallot, thinly sliced into rings", "2 heads Little Gem lettuce or 1 head butter lettuce, torn into bite-size pieces", "1/4 cup dill leaves, finely chopped, plus more for serving", "4 thick slices of country bread, toasted, or boiled potatoes (optional)", "Aioli or mayonnaise (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Place salmon in a large baking dish skin-side-down and season with salt and pepper. (Alternatively, use a rimmed baking sheet.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat butter in a small pot or skillet over medium heat. Cook, whisking occasionally, until butter foams and browns, about 5 minutes. (The whisking will help release the brown butter bits from the bottom of the pot, and those are the bits you want.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic slices, letting them sizzle and brown in the butter for 30 seconds or so, then add 2 tablespoons olive oil to the pot and whisk in harissa. Give it a minute or two to sizzle and toast a bit in the butter mixture. Add 2 tablespoons lemon juice and 2 tablespoons water to the pot, whisking to incorporate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the brown butter-harissa sauce with salt and pepper and pour over salmon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in oven and roast until the salmon is just cooked through, but still nicely pink and medium-rare in the center, 12 to 15 minutes for a whole fillet, or 8 to 10 minutes for individual fillets. (If you prefer your fish well done, cook the whole fillet for 15 to 18 minutes, or individual fillets for 12 to 15 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toss shallot with 2 tablespoons lemon juice in a medium bowl and season with salt and pepper. Add lettuce and dill and toss to coat; drizzle with a bit of olive oil and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once salmon is just cooked through, remove from oven. Use a large serving spoon to scoop large chunks of salmon onto a serving platter or individual plates, leaving the skin behind in the baking dish. (No need to worry if you get smaller chunks too, but try to get the largest pieces you can.) Spoon any remaining brown-butter sauce from the pan over the fish and squeeze lemon over the top. Sprinkle with a bit more dill, if you have it. Serve with dilly lettuce alongside, and, if you like, potatoes or toast and aioli."}]}