{"@context": "http://schema.org", "@type": "Recipe", "name": "Wine-Braised Duck With Lentils and Winter Vegetables", "description": "These duck legs, prepared in the manner of a classic French coq au vin, are deeply flavored, hearty and rich — a perfect cool weather meal rounded out with earthy lentils and root vegetables. For ease of service, all the components can be prepared well in advance, reheated and combined at the last minute.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/12/27/dining/27kitchen2/merlin_130646345_39229863-7c97-4a61-95db-41a4abd68631-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "french, mediterranean", "recipeCategory": "dinner, soups and stews", "keywords": "celery root, duck leg, lentils, parsnip, red wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 41}, "recipeIngredient": ["6 whole duck legs, about 3 pounds", "Salt and pepper", "1 cup diced onion", "1/2 cup diced celery", "1/2 cup diced carrots", "1 bay leaf", "1 sprig thyme", "1/2 teaspoon fennel seeds, crushed", "6 allspice berries", "2 tablespoons tomato paste", "2 tablespoons all-purpose flour", "4 cups/1 quart chicken broth", "1/2 cup dry red wine", "1 cup small lentils, preferably French du Puy or Italian Castelluccio, picked over and rinsed", "Salt and pepper", "2 whole cloves", "1 bay leaf", "1 small onion, peeled and halved", "1 large sprig fresh thyme", "1/2 pound carrots, peeled and cut into large chunks", "1 pound celery root, peeled and cut into large chunks", "1/2 pound parsnips, peeled and cut into large chunks", "3 tablespoons unsalted butter", "2 tablespoons chopped parsley", "2 tablespoons snipped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Trim the duck legs, keeping the skin intact but removing any extraneous fat. Lay them in one layer on a baking sheet and season generously on both sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large skillet or Dutch oven on the stovetop over medium-high heat. Add duck legs, skin-side down, and cook until nicely browned, about 10 minutes. (The legs will render a fair amount of fat as they cook.) Flip and cook for about 5 minutes more, until lightly browned. Remove legs from pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off all but 3 tablespoons fat from the pan (reserve it for another use). Place pan back on the stove over medium heat. Add onion, carrot and celery, salt lightly, and cook, stirring, until softened, about 5 minutes. Stir in bay leaf, thyme sprig, fennel seed and allspice. Continue to cook, stirring, until vegetable mixture is lightly browned, about 5 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomato paste and flour to vegetable mixture and stir well to coat. Cook for a minute or so, then add chicken broth and wine and bring to a simmer. Return duck legs to pan in one layer, skin-side up. (The liquid will not completely cover the legs.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover pan and bake for about 45 minutes, until legs are tender when probed with the tip of a paring knife. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the lentils: Pick over lentils for rocks and debris, then rinse well. Place in a saucepan with a good pinch of salt. Using the cloves, pin the bay leaf to the onion. Add to the pot along with thyme sprig. Cover lentils with water by about 2 inches and bring to a boil. Reduce heat to a simmer and cook, covered with lid ajar, until tender, about 20 to 30 minutes. Taste often so that lentils are neither under nor over-cooked. Adjust seasonings with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When duck legs are cooked, remove from the oven and reduce the heat to 225 degrees. Transfer duck legs to an ovenproof serving dish, cover, and keep warm in the oven. Pour braising liquid into a saucepan. Spoon off any fat that rises to the surface and discard. Simmer braising liquid over medium heat until slightly thickened. Pour liquid over duck legs in the serving dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the vegetables: Bring a pot of well-salted water to a boil. Add carrots, celery root and parsnips. Simmer until tender, about 8 to 10 minutes, then drain and toss gently with butter. Sprinkle with half the parsley and chives."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a duck leg, some lentils and a spoonful of vegetables on each plate. Spoon sauce over duck leg and finish with more parsley and chives. Alternatively, pass everything on platters, family-style."}], "link": "https://cooking.nytimes.com/recipes/1019110-wine-braised-duck-with-lentils-and-winter-vegetables"}