{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Chickpeas With Cauliflower and Roasted Lemon", "description": "In this hearty, meatless main course, chickpeas and potatoes are coated in a tomato-tinged spice paste and roasted until crunchy and browned. At the same time and in the same oven, cauliflower and tomatoes are cooked along with thinly sliced lemons until soft and caramelized. Just before serving, everything is tossed altogether and drizzled with an herbed, garlicky yogurt sauce. It’s a complete and satisfying meal that’s perfect for vegetable lovers. Meyer lemons work particularly well here because they are milder and sweeter than regular lemons. But use whichever you can find.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/09/26/dining/26apperex2/26apperex2-articleLarge-v2.jpg", "totalTime": "PT1H10M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, vegetables", "keywords": "cauliflower, chickpea, dill, potato, yogurt, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 717}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 595, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "16 grams", "proteinContent": "18 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1493 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Kosher salt, as needed", "1 lemon, preferably a Meyer lemon, thinly sliced and seeded", "1 (2 1/4-pound) head of cauliflower, cut into bite-size pieces (about 8 cups)", "1 1/2 cups cherry tomatoes, halved", "2 jalapeños, seeded and thinly sliced", "1/2 cup extra-virgin olive oil, plus more as needed", "1 teaspoon cumin seeds", "1 teaspoon tomato paste", "1/2 teaspoon Tabasco or other hot sauce", "3/4 teaspoon ground turmeric", "1/2 teaspoon ground cumin", "1/4 teaspoon ground coriander", "1 (14- to 16-ounce) can chickpeas, drained and blotted dry", "1 pound baby or fingerling potatoes, cut into quarters", "2 rosemary sprigs", "3/4 cup plain whole-milk yogurt (or substitute soy, nut or coconut milk yogurt)", "1/4 cup chopped fresh dill or mint, plus more for garnish", "1/4 cup chopped fresh basil, plus more for garnish", "1/4 cup chopped parsley, plus more for garnish", "1 large garlic clove, finely grated or minced", "Fresh lemon juice, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Position racks in the top and bottom thirds of oven and heat to 425 degrees. Bring a small pot of heavily salted water to a boil. Add lemon slices and simmer until softened, about 5 minutes. Drain, pat dry with a clean kitchen towel and cut slices into quarters."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a rimmed sheet pan, toss cauliflower, tomatoes and jalapeños with 1/4 cup oil and 1/2 teaspoon salt. Fold in lemon slices. Place pan on bottom rack of oven and roast, tossing every 10 minutes, until well-browned, about 35 to 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together 1/4 cup oil, cumin seeds, tomato paste, Tabasco, ground turmeric, cumin and coriander."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a separate rimmed sheet pan, toss together chickpeas, potatoes, spice-oil mixture and salt to taste. Top with rosemary sprigs. Roast on top rack until potatoes are golden, 30 to 40 minutes, tossing mixture halfway through. Remove pan and toss with more salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While everything is roasting, make the sauce: In a small bowl, whisk together yogurt, dill, basil, parsley, garlic, 1/2 teaspoon salt and a squeeze of lemon juice. Taste and add more salt or lemon if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, toss roasted chickpeas and potatoes with cauliflower mixture. Drizzle with more oil, yogurt sauce and herbs."}]}