{"@context": "http://schema.org", "@type": "Recipe", "name": "Broccoli With Fried Shallots and Olives", "description": "The fried shallots on top of this dish make it seem a little like a baked green-bean casserole, but with broccoli as the starring vegetable. Olives and thinly sliced garlic give it verve, contrasting nicely with the sweetness of the shallots. You can cook the broccoli and fry the shallots a day ahead. Store the broccoli in the refrigerator, bringing to room temperature before serving; keep the fried shallots in a paper towel-lined container or a jar with an airtight lid. If they wilt, you can crisp them back up by popping them briefly in the oven. Be sure to save the shallot-flavored oil to use for sautéeing the garlic and olives right before serving.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/11/07/dining/07broccolirex1/07broccolirex1-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, vegetables", "keywords": "broccoli, olives, shallot, side dish, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 265}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 160, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "348 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 1/2 pounds broccoli (about 2 bunches), stems peeled and cut into 1/2-inch pieces, florets cut into bite-size pieces", "1/2 cup extra-virgin olive oil, plus more for drizzling", "4 shallots, sliced into rings", "5 fat garlic cloves, thinly sliced", "1/4 cup chopped pitted olives, such as Kalamata, Niçoise or Picholine (a combination of black and green is nice)", "1 1/2 teaspoons kosher salt, or to taste", "2 teaspoons sherry vinegar, or to taste (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Add broccoli and cook until just tender, 1 to 3 minutes. Drain well and transfer to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a small pot over medium heat. In batches, so they don’t crowd the pot, fry shallots until light golden, 4 to 6 minutes, using a slotted spoon to transfer them to a paper towel-lined plate once they've cooked. Sprinkle the fried shallots with salt as you go. If the shallots start to brown too quickly, lower the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Keep the oil in the pot, and carefully stir in garlic and olives. Cook until garlic starts to turn golden, about 3 minutes. Pour the hot oil, including garlic and olives, over the broccoli, then sprinkle with salt and taste. If you'd like it to be brighter, toss in the vinegar. Serve broccoli with fried shallots on top."}], "link": "https://cooking.nytimes.com/recipes/1019567-broccoli-with-fried-shallots-and-olives"}