{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Chicken With Apricot Glaze", "description": "The chef Fany Gerson makes her tangy and sweet roast chicken with an apricot glaze: a mixture of apricot jam, butter and garlic that is applied while the chicken is in the oven, keeping it juicy and flavorful inside and out. The apricot butter is also whisked into the pan drippings, along with shallots and red wine vinegar, to make a vibrant sauce.", "author": {"@type": "Person", "name": "Priya Krishna"}, "image": "https://static01.nyt.com/images/2018/09/05/dining/05fanyrex2/merlin_141928002_5c801177-04ea-4598-88a6-0dade1217c80-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry", "keywords": "apricot preserves, chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 109}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1141, "unsaturatedFatContent": "46 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "75 grams", "fiberContent": "5 grams", "proteinContent": "66 grams", "saturatedFatContent": "23 grams", "sodiumContent": "1983 milligrams", "sugarContent": "32 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 (4-pound) chicken, at room temperature", "Kosher salt and ground black pepper", "1 lemon, halved", "1 small onion, chopped", "8 sprigs fresh thyme", "4 tablespoons olive oil", "3 to 5 cups chicken broth", "5 garlic cloves (4 of them crushed, 1 of them minced)", "4 tablespoons unsalted butter, softened", "4 tablespoons apricot preserves", "1 shallot, finely chopped", "1/3 cup red wine vinegar", "1 cup dried apricots, sliced", "1 cup roasted salted pistachios, whole or coarsely chopped (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees with a rack set in the middle position."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken on a cutting board and pat it dry with paper towels. Cut off and discard any extra fat hanging around the cavity, and season the cavity generously with salt and pepper. Squeeze the lemon all over the outside of the chicken and stuff the cavity with the chopped onion, 4 sprigs of thyme and at least one of the juiced lemon halves (both, if they’ll fit). Tie the legs together with twine. Rub 1 tablespoon oil all over the chicken and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully pour 3 cups chicken broth into a rimmed baking sheet and scatter over the crushed garlic cloves and remaining 4 thyme sprigs. Place the chicken, breast-side up, on a rack set over the baking sheet. Roast the chicken for 15 minutes, then lower the heat to 375 degrees and continue roasting for 1 hour more. Add additional chicken stock to the pan, as needed, to keep it from becoming dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, mash together the butter, 3 tablespoons apricot preserves and the minced garlic clove until smooth and creamy. Season with salt and pepper. Transfer 2 heaping tablespoons of the apricot butter to a small container and refrigerate. Add the remaining 3 tablespoons oil to the apricot butter in the bowl and whisk to thin the mixture into a glaze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Baste the chicken with the glaze and continue roasting for another 30 minutes or so, basting again after 15 minutes. Continue roasting until the chicken is browned and the juices run clear when you insert a knife down to the bone between the leg and thigh. Loosely tent with foil if the skin is getting too brown before chicken is cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the oven and tilt the chicken to release the juices from the cavity into the pan, then transfer the chicken to a carving board and let rest for 15 minutes. Strain the pan drippings, remove the fat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chicken rests, in a small pan over medium heat, cook the shallot and vinegar until the vinegar is nearly all cooked away but the pan is not yet dry. Add the remaining 1 tablespoon apricot preserves and the reserved pan drippings, whisk together and bring to a simmer. Add the remaining cold apricot butter little by little, whisking constantly, and remove from the heat. Taste and season with salt and pepper as needed. Carve chicken and serve with the seasoned jus, sliced apricots and pistachios if desired."}], "link": "https://cooking.nytimes.com/recipes/1019491-roast-chicken-with-apricot-glaze"}