{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Lentil Soup With Sausage and Greens", "description": "The seasonings in Italian sausage — fennel, red pepper, garlic — pair beautifully with lentils, and here, they make for a punchy take on lentil soup. The sausage's flavors are reinforced by adding more garlic and pepper to the soup itself, for pops of flavor. Pleasantly firm but creamy on the inside, Beluga lentils (also known as black lentils) are worth seeking out for this hearty soup because they hold their shape when cooked, adding a lovely texture. But you can absolutely use regular green or brown lentils instead. Just know that they will fall apart, making the soup smoother. This recipe freezes well and is better after it rests in the refrigerator, so make a big batch to eat for days.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2018/10/29/dining/sd-sausage-lentil/sd-sausage-lentil-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "fall, spring, winter, garlic powder, Italian sausage, lentils, onion powder, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1247}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 694, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "10 grams", "proteinContent": "38 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1435 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound hot or sweet Italian pork sausage, loose or removed from its casing", "Olive oil, if necessary", "1 large red or yellow onion, chopped", "Kosher salt", "6 garlic cloves, chopped", "1 teaspoon onion powder", "1 teaspoon garlic powder", "3 thyme sprigs", "2 oregano sprigs, leaves only, or 1 teaspoon dried oregano", "Generous pinch of red-pepper flakes", "Freshly ground black pepper", "3/4 cup dry white wine", "1 bay leaf", "2 cups dried lentils, preferably black beluga", "1 (14-ounce) can whole or chopped tomatoes", "8 cups chicken stock", "5 ounces greens, such as baby spinach or kale, or 1 medium bunch greens, such as chard or kale, stemmed and chopped", "1 tablespoon red-wine vinegar", "Chopped fresh basil, for topping", "Grated Parmesan, for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": " In a large, dry skillet over medium-high heat, cook the sausage, breaking it up with a spatula, until it is in small, coarse pieces, and starts to brown and sizzle in its own fat, about 8 minutes. Using a slotted spoon, transfer the cooked sausage to a 5- to 8-quart slow cooker. There should be a thin layer of fat covering the bottom of the skillet. If there is much more than that, pour a bit of the fat off. If there is not enough fat to cover the bottom of the pan, add a drizzle of olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " Add the onion to the skillet, season generously with salt, and cook, stirring occasionally, until softened and translucent, about 5 minutes. Reduce heat to medium-low, add garlic and cook until softened and fragrant, about 2 minutes. Add the onion and garlic powders, the herbs, red-pepper flakes and several generous grinds of black pepper. Stir to combine. Increase heat to medium-high, pour in the wine and stir well, scraping the bottom of the pot. Let the wine bubble until the pan is almost dry, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " Scrape the skillet mixture into the slow cooker with the sausage. Add the bay leaf and the lentils. Add the tomatoes with their juice. If using whole, crush the tomatoes into pieces using your hands as you add them with their juice. Pour in the chicken stock. Season generously with pepper and add 1/2 teaspoon salt if you are using low-sodium stock or 1 teaspoon salt if using homemade unsalted stock. Do not add salt now if you are using fully salted stock. Stir well to combine all ingredients. Cover and cook on low until the lentils are tender, about 6 to 8 hours. (Taste the lentils to make sure they are firm but creamy on the inside; black lentils can vary in their cooking time depending on their age and the heat of your slow cooker.) The soup holds well on warm for 2 additional hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " Switch the heat to high. Remove and discard the thyme sprigs. Stir in the greens and cook until wilted and tender, about 2 minutes for baby spinach, 10 minutes for kale. Stir in the vinegar. Serve in bowls, topped with chopped basil and grated Parmesan."}], "link": "https://cooking.nytimes.com/recipes/1019697-slow-cooker-lentil-soup-with-sausage-and-greens"}