{"@context": "http://schema.org", "@type": "Recipe", "name": "Lalla Mussa Dal", "description": "This creamy lentil stew — a signature dish of the Indian celebrity chef Sanjeev Kapoor — has a base of urad dal, a slim variety of lentil that turns soft and velvety when cooked. The dal is hearty, with multiple levels of richness from the cream and butter. But its tangy complexity comes from a combination of tomatoes, garlic, coriander and fenugreek. (Look for the dried version of the greens from the fenugreek plant, not the brownish nuggets known simply as “fenugreek” on the spice shelf. You can also use the mixture of fenugreek greens, dried dill and dried leek sold at many Indian grocers.)  Like most dals, this stew is best accompanied by long-grain basmati rice or roti — both excellent vehicles for sopping up the thick gravy.", "author": {"@type": "Person", "name": "Priya Krishna"}, "image": "https://static01.nyt.com/images/2018/03/07/dining/07investrex/merlin_134768649_5ae2e44f-895e-4c99-91e2-0bb789d9764d-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, beans", "keywords": "fenugreek leaves, green chiles, lentils, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 102}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 355, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "22 grams", "sodiumContent": "345 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 cup whole black gram lentils (sabut urad)", "1/8 cup whole green gram lentils (sabut moong)", "2 green chiles (such as Indian harimirch or serrano), cut into thin strips", "1 1-inch piece ginger, cut into thin strips", "1/2 cup melted unsalted butter", "3/4 cup tomato purée", "1 teaspoon Kashmiri red chili powder, or cayenne", "1 teaspoon ground coriander", "3/4 teaspoon crushed dried fenugreek leaves (kasoori methi)", "7 cloves garlic, finely chopped", "1/2 cup heavy cream", "Salt to taste", "1 1/2-inch piece ginger, cut into thin strips, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together both types of lentils and rinse thoroughly in salted water. Drain, add 1 cup water and soak for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain lentils again, add to a small pot with 1 cup water and bring to a boil. Skim the scum and dirt off the top and discard. Strain the lentils and return them to the pot. Add 1 cup water, the green chiles and ginger and simmer, covered, for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/4 cup of the butter and simmer on low heat for 45 minutes, stirring often and mashing with the back of a big spoon as the lentils soften. After about 35 minutes, melt the remaining 1/4 cup butter in a deep nonstick pan; add the tomato purée and sauté on low heat until fat rises to the surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the red chili powder (or cayenne), ground coriander, fenugreek leaves and garlic and cook for a couple of minutes, stirring constantly, until the mixture begins to dry out and stick to the pan. Add the lentils and mix well. Add the cream and mix well. Add 1 cup water and salt to taste, and bring to a boil. Serve hot, garnished with ginger strips."}], "link": "https://cooking.nytimes.com/recipes/1019207-lalla-mussa-dal"}