{"@context": "http://schema.org", "@type": "Recipe", "name": "Molten Chocolate Doughnut Holes", "description": "Reminiscent of churros and chocolate, these fluffy doughnut holes are best served warm because of the molten chocolate filling. You could, of course, use a stand mixer to prepare the dough, but it’s better done by hand since the mixer will have trouble blending such a small amount. Don’t worry when you first add the butter pieces and they smear around without incorporating. The butter will be evenly distributed by the time you finish kneading the dough. Chocolate fèves or discs make easy work of filling the doughnuts, but if you can’t find them, feel free to use your favorite chips or chopped chocolate.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2019/01/30/dining/ss-chocolate-doughnut-holes/ss-chocolate-doughnut-holes-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "14 doughnuts", "recipeCuisine": "american", "recipeCategory": "finger foods", "keywords": "active dry yeast, bittersweet chocolate, butter, flour, milk, sugar, dessert, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 199, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "3 grams", "sodiumContent": "77 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons warm whole milk (about 110 degrees)", "2 teaspoons active dry yeast", "2 tablespoons plus 1/2 teaspoon granulated sugar", "1 3/4 cups/225 grams all-purpose flour, plus more for dusting", "1/2 teaspoon kosher salt", "1 large egg, at room temperature", "3 tablespoons diced unsalted butter, at room temperature, plus more for the bowl", "1/3 cup/55 grams bittersweet chocolate fèves, chips or coarsely chopped chocolate", "1 quart/945 milliliters vegetable oil, for frying", "1/2 cup/100 grams granulated sugar", "1/4 teaspoon ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a small bowl, combine the milk, yeast and 1/2 teaspoon sugar. Set aside until foamy, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together 2 tablespoons sugar with the flour and salt. Stir in yeast mixture and egg, and knead it in the bowl a few times to incorporate the liquid. Tip the dough onto a work surface and knead it until smooth and elastic, about 3 minutes. Add the butter, a bit at a time, and continue to knead the dough until the butter is fully incorporated and the dough is smooth, another 5 minutes. The dough will be sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gather the dough into a neat ball. Grease the inside of a large bowl with butter and add the dough. Cover with plastic and set aside to rise in a warm place until doubled, 1 to 2 hours. (After the dough has doubled, you can punch it down, wrap it well and refrigerate it for up to 2 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tip the dough onto a very lightly floured surface and pat the dough out into a 7-by-4 inch rectangle. (You can work with the dough directly from the refrigerator if it has been chilled.) Divide the dough into 14 even pieces using a bench scraper or a knife and slightly flatten each. Add 1 chocolate fève or about 1 teaspoon of chocolate to the center of each piece of dough, wrap and pinch the dough to enclose the chocolate, and roll it into a neat ball. Transfer the dough pieces to a floured rimmed baking sheet. Cover loosely with plastic wrap and set aside to rise in a warm place until doubled, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a rimmed baking sheet with two layers of paper towels. Clip a candy thermometer to the edge of a large pot. Heat the oil over medium-high until it reaches 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As oil heats, make the cinnamon-sugar mixture: Mix 1/2 cup sugar with the cinnamon in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working one at a time, carefully transfer dough to a spider or slotted spoon without deflating it. Then transfer the dough to the hot oil. Add up to 4 pieces of dough at a time. Maintain the temperature of the oil by increasing or lowering the heat as necessary, and allow the oil to return to temperature between batches. Cook the doughnuts until golden brown, about 2 minutes per side, then using the spider, transfer the doughnuts to the prepared sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat with the remaining dough. Toss the warm doughnuts in the cinnamon-sugar mixture and serve immediately."}]}