{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Pork Chops With Buttered Radishes", "description": "These crisp, panko-crusted cutlets are your weeknight answer to tonkatsu or Milanese with a simplified, one-step breading procedure, no eggs or flour required. Thin pork chops, either bone-in or boneless, are seasoned with salt and pepper, then simply pressed into panko bread crumbs before crisping up in a hot, oiled skillet. While any quick-cooking vegetable could be tossed in the brown butter and spooned over the chops, radishes are especially nice for the way they keep their bite even after a trip to the skillet. Whatever you do, don’t forget the lemon.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/02/06/dining/06romanrex1/06romanrex1-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, for two, weekday, weeknight, meat", "keywords": "main course, panko, pork chops, radish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 883}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1015, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "63 grams", "fiberContent": "6 grams", "proteinContent": "48 grams", "saturatedFatContent": "20 grams", "sodiumContent": "929 milligrams", "sugarContent": "7 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 bone-in or boneless pork chops (rib or loin), cut 1/2-inch thick (about 6 ounces each)", "Kosher salt and black pepper", "1 1/2 cups panko or fresh coarse bread crumbs", "3 tablespoons canola oil, plus more as needed", "4 tablespoons unsalted butter", "2 tablespoons capers", "1 bunch radishes, with tops on if you like, cut into quarters", "Flaky sea salt", "1 lemon, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season pork with salt and pepper. Place panko in a rimmed baking sheet or baking dish and season it with salt and pepper. Working one at a time, firmly press both sides of each pork chop into the seasoned panko until the chops are evenly and well coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large skillet (10 to 12 inches) over medium-high heat; it should evenly coat the bottom of the skillet. If it doesn’t, add a bit more oil. Place the pork chops in the skillet and cook until deeply golden brown, like the color of a well-baked croissant, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs or a spatula, flip pork and continue to cook until well browned on the other side, too, another 2 to 3 minutes. Transfer pork to a plate, platter or cutting board lined with paper towel and season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out skillet and return to the stove over medium-high heat. Add butter, letting it sizzle, brown and foam. Add capers and half of the radishes, seasoning them with salt and pepper. Toss a few times, just to wilt the radish greens, if they’re still on, and to evenly coat the radishes with the brown butter and capers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide pork chops among plates and nestle butter-tossed radishes and capers alongside, plus remaining raw radishes. Sprinkle with a bit of flaky salt and serve with lemon wedges alongside for squeezing over."}], "link": "https://cooking.nytimes.com/recipes/1019958-crispy-pork-chops-with-buttered-radishes"}