{"@context": "http://schema.org", "@type": "Recipe", "name": "Rhubarb Poundcake", "description": "This tender poundcake has slivers of vanilla-poached rhubarb running across the top and shot through the center, adding a tangy sweetness to the buttery crumb. For the most vivid stripes, use the reddest rhubarb stalks you can find. They will fade to hot pink after poaching and baking. Green rhubarb also works; the cake won’t be quite as striking, but it will be equally delectable. This cake is best served within a day of baking. After that, the rhubarb will start to dry out.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/05/16/dining/16Appe1/merlin_137783244_46c80784-6bfd-4513-80b1-16fd5912a88e-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, cakes", "keywords": "dessert, rhubarb, vanilla bean, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 500}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 359, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "10 grams", "sodiumContent": "157 milligrams", "sugarContent": "34 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["8 ounces rhubarb stalks (about 3 to 4 large stalks)", "1 cup/200 grams granulated sugar", "1/2 vanilla bean, split lengthwise, seeds scraped with the tip of a knife and reserved", "1 cup/225 grams unsalted butter (2 sticks), at room temperature, plus more for greasing the pan", "1 2/3 cups/200 grams cake flour, plus more for flouring the pan", "1 teaspoon baking powder", "1/2 teaspoon fine sea salt", "1/3 cup whole milk", "1 teaspoon vanilla extract", "1/2 vanilla bean, split lengthwise, seeds scraped with the tip of a knife and reserved", "1 cup/200 grams granulated sugar", "4 large eggs, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut rhubarb stalks to fit crosswise inside the top of a 9-by-5-inch loaf pan. (They should be about 5 inches, but they could also be a little less.) You’ll need enough rhubarb to cover the top of the cake in the loaf pan, plus a few extra pieces in case any split during poaching."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot, combine sugar, 1 cup water and the vanilla bean and seeds, and bring to a boil. Simmer until the sugar dissolves, about 2 minutes. Stir in rhubarb, simmer for 1 minute, then remove from heat. Cool to room temperature, then slice rhubarb in half lengthwise so you have long, thin pieces. Reserve poaching liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees, and butter and flour the loaf pan. In a medium bowl, whisk together flour, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together milk, vanilla extract and vanilla seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the paddle attachment, beat butter and sugar until light and fluffy. Beat in eggs, one at a time, scraping down the bowl between each addition. Beat in half the flour mixture until just combined, then beat in milk mixture until barely combined, scraping the sides of the bowl. Beat in remaining flour mixture until just combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape half the batter into prepared pan, then lay half of the rhubarb slices in an even layer on top of the batter. Cover with remaining batter, smoothing the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake cake for 20 minutes to set the top, then remove pan from the oven and quickly lay the remaining rhubarb slices next to each other on the top of cake. Return pan to oven and bake until a toothpick inserted in the cake's center comes out clean, another 30 to 50 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While cake is baking, bring rhubarb-poaching liquid to a boil over high heat, then reduce to a simmer; continue to simmer until thickened and syrupy, about 10 minutes. Brush some syrup on top of cake once it comes out of the oven. Let cake cool in pan on a wire rack before serving, at least 2 hours, then carefully remove the cake from the pan and serve."}], "link": "https://cooking.nytimes.com/recipes/1019290-rhubarb-poundcake"}