{"@context": "http://schema.org", "@type": "Recipe", "name": "Lazy Lobster", "description": "A lobster for those who prefer eating lobster without the work and without a bib, this recipe is meant for an intimate supper à deux, whether for Valentine’s Day or not. Freshly cooked lobster is preferred, but some may splurge and buy a pound of preshucked lobster meat. Serve with crusty French bread or toasted thick slices of baguette cut on a long diagonal.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/02/13/dining/13kitchrex1/13kitchrex1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "seafood", "keywords": "chervil, chives, dill, lobster, parsley, tarragon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 82}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 926, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "1 gram", "proteinContent": "132 grams", "saturatedFatContent": "23 grams", "sodiumContent": "3365 milligrams", "sugarContent": "0 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["Salt", "2 live lobsters, about 1 1/2 to 2 pounds each", "6 tablespoons unsalted butter, cut into chunks", "1 tablespoon chopped parsley", "2 teaspoons thinly sliced chives", "1 teaspoon snipped dill", "A few tarragon leaves", "A few chervil sprigs", "Lemon wedges, for serving", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large pot of water on to boil. Salt heavily: 1/4 cup per gallon. When water reaches a rolling boil, add lobsters headfirst, put on the lid and bring back to a boil. Continue boiling with lid slightly ajar, 8 minutes for a 1 1/2 pounder or 10 minutes for a 2 pounder. The lobster will not be fully cooked: It will cook further upon reheating."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove lobsters from pot with tongs, and let cool in the kitchen sink. When lobsters are cool enough to handle, remove tails and claws (with knuckles attached) with a twisting motion. (Reserve bodies for another purpose or freeze for future use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using lobster crackers or mallet and kitchen shears, crack shells and remove meat from tail, knuckles and claws. For presentation, try to keep claw meat intact. Use a paring knife drawn down the middle of the tail meat to remove intestinal vein; rinse meat briefly if necessary. If you wish, wrap and refrigerate for up to 24 hours, or proceed immediately with rest of recipe."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish, put half the butter in a skillet over medium heat. Add room-temperature lobster meat and bring to a low simmer. Turn heat to low, put on lid and cook for 5 minutes. Add remaining butter, turn off heat and cover for 5 more minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide lobster meat into two warmed shallow soup bowls. Spoon butter evenly over each serving. Sprinkle with parsley, chives, dill, tarragon and chervil. Serve with lemon wedges, and dust with black pepper."}], "link": "https://cooking.nytimes.com/recipes/1019894-lazy-lobster"}