{"@context": "http://schema.org", "@type": "Recipe", "name": "Tres Leches Cake", "description": "Tres leches, which means “three milks” in Spanish, refers to the whole milk, condensed milk and evaporated milk that make up a creamy soaking sauce for the baked cake. Over time, it saturates the cake, making it soft and luscious. While a thick garnish of softly whipped cream may seem excessive, it actually tempers the sweetness of the whole confection. Serve with some berries or sliced fruit to complete the presentation.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2018/02/06/dining/06COOKING-TRESLECHESCAKE2/06COOKING-TRESLECHESCAKE2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "condensed milk, evaporated milk, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 548}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 550, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "78 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "1 gram", "proteinContent": "12 grams", "saturatedFatContent": "13 grams", "sodiumContent": "319 milligrams", "sugarContent": "60 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Butter for the pan", "2 1/4 cups/285 grams all-purpose flour", "2 1/4 teaspoons baking powder", "3/4 teaspoon kosher salt", "6 large eggs, separated, at room temperature", "1 cup plus 2 tablespoons/225 grams granulated sugar", "1/2 cup plus 1 cup whole milk", "1 (14-ounce) can sweetened condensed milk", "1 (12-ounce) can evaporated milk", "1 teaspoon pure vanilla extract", "1 1/2 cup heavy cream", "1 tablespoon confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Butter the bottom of a 13-by-9-inch pan lightly, leaving a 1/4-inch border that remains ungreased. Do not butter the sides of the pan; you want the cake to “climb” up the sides of the pan as it bakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the flour, baking powder and salt. In a large bowl, with an electric mixer on medium-high, beat the egg yolks and 1/2 cup/100 grams of the sugar until pale and thick, about 3 minutes. Beat in 1/2 cup of the milk, lower the speed and then mix in the flour mixture just until combined. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another large bowl, with clean beaters, whip the egg whites until foamy and the yellowish color has disappeared, about 1 minute. Slowly add the remaining 1/2 cup plus 2 tablespoons/125 grams sugar while beating. Continue to beat the mixture until you have shiny, medium-stiff peaks, about 2 minutes. Stir a big scoop of the egg white mixture into the batter to loosen it, then, using a spatula, gently fold the remaining whites into the batter without deflating them. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan and smooth the top. Bake until golden brown and a toothpick inserted into the center comes out clean, 25 to 30 minutes. Transfer cake to a rack to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium bowl, whisk together the remaining 1 cup milk, condensed milk, evaporated milk and vanilla. Using a skewer or a toothpick, poke holes about 1/2 inch apart all over the cake. Cut the edges of the cake from the sides of the pan. Pour the milk mixture evenly over the cake, about a cup at a time, allowing 5 to 10 minutes for it to soak in before adding more.  Cover and refrigerate for at least 2 hours (or up to 24 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, whip the cream and confectioners’ sugar to soft peaks. Top the cake with the whipped cream."}], "link": "https://cooking.nytimes.com/recipes/1019181-tres-leches-cake"}