{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Squash With Cheese Fondue", "description": "This autumnal dish turns a classic cheese fondue into a sauce for whole roasted squash. The lightly caramelized squash are filled with the gooey fondue mixture and topped with crunchy, garlicky bread crumbs. When the squash are cut, the cheese sauce runs onto the serving plate, to be spooned back over the soft, amber slices. Serve this as a side dish to roasted meats or fish, or as a rich appetizer on its own. For the best presentation, choose squash that are about the same shape and size.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/12/05/dining/05apperex1/05apperex1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "dips and spreads, vegetables", "keywords": "appetizer, side dish, dry white wine, emmenthaler, gruyère, squash, fall, winter, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 86}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 320, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "2 grams", "proteinContent": "14 grams", "saturatedFatContent": "12 grams", "sodiumContent": "454 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 medium carnival or acorn squash", "Extra-virgin olive oil, for drizzling", "Kosher salt, as needed", "Freshly ground black pepper, as needed", "1/2 cup panko bread crumbs", "1 tablespoon extra-virgin olive oil", "2 to 4 anchovies, minced (optional)", "1 garlic clove, finely grated or minced", "1 teaspoon lemon thyme or regular thyme leaves, finely chopped", "Pinch of red-pepper flakes", "1/2 teaspoon finely grated lemon zest", "6 ounces grated Gruyère", "6 ounces grated Emmenthaler or Swiss cheese", "2 teaspoons cornstarch", "1/2 tablespoon unsalted butter", "1 shallot, minced", "1 garlic clove, minced", "1/2 cup dry white wine", "1/2 cup heavy cream", "1/4 teaspoon mustard powder", "Pinch of freshly grated nutmeg", "Fresh lemon juice, to taste (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Cut the stem ends off the tops of the squash, then cut a small slice from the bottoms, if needed, so they stand up level. If you can’t access the seeds from the top (if there’s still some squash flesh blocking your way), cut a small round in the flesh and scoop out the seeds with a spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle squash with oil and season the insides with salt and pepper. Place squash on a rimmed baking sheet, and roast until tender and edges are golden, 25 to 35 minutes. (Squash can be roasted 8 hours ahead, kept at room temperature and then reheated just before serving.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the bread crumbs: In a medium bowl, stir together bread crumbs, oil, anchovies if using, garlic, thyme and red-pepper flakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a dry small skillet over medium heat, then stir in bread crumb mixture. Cook, stirring frequently, until golden brown, about 5 minutes. Scrape back into the bowl, and stir in lemon zest. (Bread crumbs can be made a day ahead, and stored airtight at room temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, make the fondue: In a large bowl, toss together Gruyère, Emmenthaler and cornstarch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot, melt butter over medium-low heat. Stir in shallot and cook until translucent, about 5 minutes. Stir in garlic and cook for another minute. Pour in wine and cream, and bring to a simmer, then stir in mustard powder, nutmeg and a generous amount of pepper. Reduce heat to medium-low, and add cheese, a handful at a time, stirring occasionally and waiting until melted after each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After cheese has all melted, leave pot on stove over low heat until mixture starts to bubble, stirring occasionally, 3 to 5 minutes. (Resist the temptation to stir too frequently or vigorously, as this can make the fondue grainy.) Taste and add a squeeze of lemon juice, if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place squash on a rimmed serving platter, pour cheese sauce into cavities, and top with bread crumbs. To serve, slice each squash into quarters and scoop onto plates or bowls, spooning up the sauce. "}]}