{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Potato Gratin With Smoked and Fresh Salmon", "description": "Swedish laxpudding, the basis for this brunch-friendly bake, is a dish that lives in the same neighborhood as frittata, potato gratin and quiche. The original is much more restrained than this version, comprised only of potatoes, smoked salmon and dill, held together with an egg custard. My additions include saffron and capers, which I borrowed from Sicily and work surprisingly well here. This can be served for any meal but is an especially impressive brunch dish.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2018/02/21/dining/21ottorex1/merlin_133672959_e9dfb6cf-384d-4d32-9e46-fc254769fe10-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "brunch, casseroles", "keywords": "anchovies, capers in salt, eggs, potato, salmon, spinach, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 187}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 463, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "5 grams", "proteinContent": "24 grams", "saturatedFatContent": "8 grams", "sodiumContent": "848 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["Generous pinch of saffron", "3 large potatoes or 2 celeriac bulbs (about 2.5 pounds/1.2 kilograms total), peeled and cut into 1/2-inch-/1-centimeter-thick half-moons", "1/3 cup/75 milliliters olive oil, more as needed", "Salt and black pepper", "3 oil-packed anchovies, thinly sliced ", "2 cloves garlic, thinly sliced", "About 1 pound/500 grams large leaf spinach, washed, stems and leaves roughly chopped", "1 gently packed cup (about 1 ounce/30 grams) basil leaves, roughly chopped", "1/2 cup/20 grams roughly chopped fresh dill (about 3/4 ounce), more for garnish", "4 tablespoons/50 grams brined baby capers (about 1.75 ounces), drained and patted dry", "About 1 pound/460 grams skinless salmon fillets, cut into 1-inch/2- to 3-centimeter pieces", "About 5 ounces/150 grams thinly sliced cold-smoked salmon, cut into 1-inch/2- to 3-centimeter pieces", "5 egg yolks", "1 1/2 teaspoons cornstarch", "1 teaspoon freshly grated lemon zest", "1 2/3 cups/400 milliliters whole milk", "1/2 cup/100 milliliters heavy cream (double cream)", "1 lemon, cut into wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees Fahrenheit/240 degrees Celsius. In a small bowl, mix 1 tablespoon of boiling water with the saffron and set aside for 20 minutes (longer is fine)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the potatoes: In a large bowl, use your hands to mix the potatoes with 2 tablespoons of the oil, 1/2 teaspoon salt and plenty of pepper. Spread out on 2 large parchment-lined baking sheets (baking trays) and roast for 20 minutes, or until soft and caramelized. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the greens: In a large skillet with a tight-fitting lid, heat 2 tablespoons of the oil over medium-high heat. Once hot, add the anchovy and garlic and fry just until the garlic is starting to brown, 30 seconds to 1 minute. Add half the spinach, stir through for a minute to wilt slightly, and then add the remaining half. Cover for 1 to 2 minutes to wilt some more, then remove the lid and cook for 7 to 8 minutes, stirring frequently, until all the moisture has evaporated and the spinach has begun to dry out. Raise the heat as needed to cook off the liquid. Turn off heat and stir in herbs. Stir in half the capers and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands, mix the fresh and smoked salmon with 1/3 teaspoon of salt in a bowl, separating the layers of smoked salmon in the process. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the custard: In a medium saucepan, whisk together the saffron and its soaking water, egg yolks, cornstarch (cornflour), lemon zest, 1/2 teaspoon of salt and plenty of pepper until smooth. Pour in the milk and cream and whisk until combined. Place over medium heat and cook, whisking continuously to prevent the custard from scorching or sticking to the bottom of the pan.  Cook for 4 to 5 minutes, until steaming and starting to thicken. Remove from the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, heat the oven to 400 degrees Fahrenheit/200 degrees Celsius. To assemble, start by layering half the potatoes at the bottom of a baking dish. (A deep 8-by-8-inch square, 9-inch round, or 20-by-30-centimeter rectangle will all work.) Top with half the spinach mixture followed by all the salmon. Top with the remaining potatoes and then the spinach. Pour the custard over evenly and bake for 25 to 30 minutes, or until the custard has set and is starting to brown. (If your custard seems dangerously close to the top of the pan, place it on a foil-lined baking sheet to catch any drips.) Remove from the oven and set aside for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine remaining capers with the remaining 1 tablespoon oil over high heat. (The oil should just cover the capers, so you may need to add a touch more oil, depending on the size of your pan.) Fry the capers in the oil for 1 to 2 minutes, stirring frequently, until the capers have opened up and become crisp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the fried capers over the gratin, garnish with fresh dill, and serve warm with lemon wedges."}], "link": "https://cooking.nytimes.com/recipes/1019189-creamy-potato-gratin-with-smoked-and-fresh-salmon"}