{"@context": "http://schema.org", "@type": "Recipe", "name": "Roquefort, Leek and Walnut Tart", "description": "The open-face Alsatian tarte flambée can be as versatile as a quiche. Most often it’s given classic treatment, with bacon and onions on a pastry-lined bed of crème fraîche and fromage blanc. But why stick to tradition? You can make it with mushrooms, omit the bacon and dot it with caviar, add smoked salmon, pave it with zucchini slices, and explore other cheeses, including Taleggio and chèvre. Here’s an assertive version that keeps the bacon but opts for Roquefort cheese, leeks and walnuts. And instead of pizza dough, which is a typical underpinning, for a more expedient result, you can make it with pie pastry.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2018/03/14/dining/14pairingrex/14pairingrex-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "brunch, dinner, lunch, pies and tarts", "keywords": "bacon, leeks, roquefort cheese, walnut, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 240, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "5 grams", "sodiumContent": "167 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups/180 grams all-purpose flour, plus more for rolling", "1/2 teaspoon baking powder", "1/2 teaspoon salt", "1 large egg yolk", "1 tablespoon extra-virgin olive oil", "2 strips thick-cut smoked bacon, diced (about 2 ounces)", "1 cup chopped leeks, white part with a little light green", "1/3 cup chopped walnuts", "4 ounces Roquefort cheese, or other blue-veined cheese", "3 tablespoons crème fraîche"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend together flour, baking powder and half the salt in a bowl or a food processor. Beat egg yolk with 5 tablespoons cold water. Stir in olive oil. Pour this mixture over the flour mixture and beat with a fork if using a bowl, or pulse about a dozen times in the processor, until dough starts to come together. Add another teaspoon or two of water if mixture is too dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gather dough together and knead briefly on a lightly floured surface to form into a ball. Roll and trim to make an oblong 9 by 13 inches or a 12-inch round. Place on a parchment-lined baking sheet. Fold up a half-inch border all around either shape. Heat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread bacon in a heavy skillet and cook until very lightly browned. Stir in leeks and remaining salt and cook until softened and translucent. Stir in walnuts, sauté about 30 seconds, and remove from heat. Mash Roquefort and work in crème fraîche. Spread on pastry. Scatter leek, bacon and walnut mixture evenly on top. Bake 20 minutes, allow to cool briefly, cut in squares or wedges and serve."}], "link": "https://cooking.nytimes.com/recipes/1019198-roquefort-leek-and-walnut-tart"}