{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Shakshuka With Avocado and Lime", "description": "This easy twist on classic North African shakshuka (traditionally eggs baked in tomato-pepper sauce, with cumin, paprika and cayenne) starts with an onion-garlic-chard sautéed until gently wilted: a nest of sorts for steam-poaching eggs. Once the eggs go in, be sure to keep the flame low and keep the pan covered while cooking, so the eggs stay soft and almost oozy at their yolk, and the Cotija melts a bit. The chard and the half-and-half create a sort of light broth at the bottom of the shakshuka, which holds so much flavor and is one of the dish’s charms. Lastly, be daring with smoked hot sauce at the end: It’ll push the creamy avocado, cheese and eggs to their peak.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/08/01/dining/sc-green-shakshuka/sc-green-shakshuka-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, weeknight, vegetables", "keywords": "cotija, eggs, half and half, swiss chard, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1507}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 492, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "2 grams", "proteinContent": "26 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1102 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons olive oil", "1 yellow onion, peeled and thinly sliced", "2 garlic cloves, thinly sliced", "1 large bunch/1 1/2 pounds Swiss chard, stems and leaves separated and chopped (about 9 cups)", "1/2 teaspoon salt, plus more as needed", "1/3 cup half-and-half or heavy cream", "8 large eggs", "1/4 teaspoon black pepper, plus more as needed", "3 ounces cotija cheese or queso fresco, crumbled (about 3/4 cup)", "1 avocado, sliced, for serving", "1 small jalapeño, thinly sliced, for serving", "Chopped cilantro, for serving", "Smoked hot sauce, for serving", "Corn tortillas, toasted, for serving", "1 lime, cut into wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large cast-iron skillet over medium-low heat. Add onion and cook until softening, 5 minutes. Add the garlic and cook until fragrant, 5 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise the heat to medium-high, add the chard stems, and cook to release some liquid, 5 minutes. Add the chard leaves, in batches, adding more as they wilt, and continue cooking, stirring occasionally, until completely wilted, 3 to 5 minutes more. Season with 1/2 teaspoon salt, pour in the half-and-half and stir loosely together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make eight small hollows in the cooked chard with the back of a spoon. Gently crack an egg into each hollow. Cover with a lid or foil and cook on medium-low until the eggs are just set, but still soft, about 7 to 9 minutes. Remove the lid, sprinkle with salt, pepper, cotija, avocado, jalapeño and cilantro. Serve with smoked hot sauce, toasted tortillas and lime wedges."}]}