{"@context": "http://schema.org", "@type": "Recipe", "name": "Classic Diner Breakfast", "description": "The beauty of a diner breakfast is that it’s different for everybody, but many consider this the most classic incarnation: eggs, bacon (or sausage) and crisp, salty hash browns. The trick to good hash browns at home: use a very hot, well-seasoned skillet or griddle, since potatoes have a tendency to stick if using stainless steel. Do not worry or fuss over trying to make them too perfect; good hash browns should always look a little unruly —  it’s part of their charm. Here, the eggs here are prepared sunnyside up, but over easy, scrambled or poached would be great, too.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2017/12/20/dining/20COOKING-DINER/20COOKING-DINER-mediumThreeByTwo440.jpg", "totalTime": "PT30M", "recipeYield": "2 servings", "recipeCuisine": "american", "recipeCategory": "breakfast", "keywords": "eggs, bacon, potatoes, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 118}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 676, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "5 grams", "proteinContent": "25 grams", "saturatedFatContent": "14 grams", "sodiumContent": "1133 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 pounds russet potatoes (about 2 smallish-medium potatoes), peeled", "1 small yellow onion, peeled", "Kosher salt and freshly ground black pepper", "8 slices bacon, 4 sausage links or 2 sausage patties", "1 tablespoon vegetable oil, plus more if needed", "2 tablespoons unsalted butter, plus more for toast", "4 slices white, sourdough, whole-wheat or rye bread", "4 large eggs", "Hot sauce or ketchup (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate potatoes on the largest hole on a box grater into a medium bowl. Cover with cold water and drain; repeat once or twice, until water runs nearly clear. Taking small handfuls at a time, squeeze all the water from the potatoes and place in a dry medium bowl. Grate onion on the largest hole on a box grater and toss with potatoes. Season with salt and pepper and let sit while you cook the bacon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook bacon or sausage in a large cast-iron skillet (at least 10 inches) over medium heat until totally crispy, about 3 minutes per side. Drain on a plate lined with paper towels and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain fat from the skillet into a small bowl (you should have 3 to 4 tablespoons; if you don’t, use vegetable oil to make up the difference)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Again taking small handfuls at a time, squeeze all water from the potato-onion mixture. Heat 2 tablespoons reserved bacon fat or vegetable oil in that same skillet over medium heat, add 1 tablespoon butter and swirl together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potatoes and onions and spread into a thin, even layer. Cook, without moving, until the potatoes are nearly cooked through and browned on one side, about 5 to 8 minutes. Using a spatula, flip sections of the potatoes to crisp on the other side. Add 1 tablespoon reserved bacon fat or vegetable oil and remaining 1 tablespoon butter and cook, without moving, until potatoes are browned on the other side, about another 5 minutes. Flip once or twice more (you don’t have to be so careful here; just kind of stir them around) and continue to cook until most of the bits of potato are golden brown and crisped, about another 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer potatoes to a plate and set aside while you fry the eggs. Meanwhile, toast the bread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase heat to medium high and add 1 tablespoon vegetable oil. Crack 4 eggs into the skillet and season with salt and pepper. Cook, rotating skillet occasionally until the whites are cooked through and the yolks are still bright yellow and runny, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place on 2 plates with hash browns, bacon and toast. Serve with hot sauce (or ketchup, if you wish)."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "How to Make a Classic Diner Breakfast", "description": "Eggs, hash browns and bacon: a perfect breakfast.", "thumbnailUrl": "https://static01.nyt.com/images/2017/12/20/dining/20COOKING-DINER/20COOKING-DINER-mediumThreeByTwo440.jpg", "uploadDate": "2018-02-22T20:32:30.000Z", "duration": "PT1M38S"}, "link": "https://cooking.nytimes.com/recipes/1019038-classic-diner-breakfast"}