{"@context": "http://schema.org", "@type": "Recipe", "name": "Linguine With Crisp Chickpeas and Rosemary", "description": "Pasta with chickpeas is a substantial, quickly assembled meal, but what’s alluring about this version is the undercurrent of rosemary. Whole sprigs lightly fried in olive oil provide flavor in two ways: the leaves are crumbled into the pasta for a fragrant punch, and the infused oil slicks the noodles. You could add spinach, arugula or kale when you toss the pasta in the sauce, or simply brighten it with parsley, Parmesan and lemon.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/01/07/dining/as-chickpea-pasta/as-chickpea-pasta-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, weekday, weeknight, pastas", "keywords": "chickpea, linguine, rosemary, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 638}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 914, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "108 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "12 grams", "proteinContent": "24 grams", "saturatedFatContent": "11 grams", "sodiumContent": "664 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup extra-virgin olive oil, plus more for serving", "8 fresh rosemary sprigs", "Kosher salt and black pepper", "1 pound linguine or other long noodle", "3 tablespoons unsalted butter", "3 garlic cloves, peeled and smashed", "1 (14-ounce) can chickpeas, rinsed, drained and patted very dry", "1/2 cup coarsely chopped parsley", "1 lemon, cut into wedges", "Freshly grated Parmesan or pecorino, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of heavily salted water (2 heaping tablespoons kosher salt to about 7 quarts water) to a boil. Meanwhile, make the rosemary oil: Pat the rosemary dry with a kitchen towel. In a large Dutch oven or skillet big enough to hold all the pasta, warm the oil over medium heat. Once shimmering, add the rosemary sprigs and fry, flipping once, until sizzling subsides and leaves are crisp, 3 or 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the sprigs to a paper towel-lined plate, and sprinkle with salt and pepper. Keep the pot with the oil on the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pasta to the boiling water, and cook to al dente according to package directions. Reserve 1/2 cup of the pasta cooking water, and drain the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta cooks, with the rosemary oil over medium-high heat, add the butter. Once melted, add the garlic and chickpeas and fry, stirring occasionally, until the chickpeas are golden brown and crisp, 8 to 10 minutes. If some of the chickpeas explode like popcorn, that’s a good sign."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the chickpeas cook, remove the rosemary leaves from the sprigs (pinch the top of the sprig and swipe downwards). If any do not come off easily, they aren’t fully fried: Throw them back into the oil with the chickpeas and remove them after a quick fry. Crumble the leaves by rubbing them between your fingers, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the chickpeas are crisp, season with salt and pepper, reduce heat to low and stir in the pasta, adding pasta water as needed to form a glossy sauce. Stir in the parsley and crumbled rosemary leaves. Season to taste with salt and pepper. Serve with a lemon wedge for squeezing. Top with grated cheese and a drizzle of olive oil if desired."}], "link": "https://cooking.nytimes.com/recipes/1019901-linguine-with-crisp-chickpeas-and-rosemary"}