{"@context": "http://schema.org", "@type": "Recipe", "name": "Coconut Cream Pie", "description": "This pie recipe comes from the New Orleans restaurant Herbsaint, named for the local anise liqueur, which draws on Louisiana flavors and spices for strength and inspiration. It's rooted in the local sensibility, but it's a well-traveled, well-informed version of New Orleans cooking.", "author": {"@type": "Person", "name": "William Grimes"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "Two 9-inch pies", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "dessert, heavy cream, macadamia nuts, unsweetened coconut, vanilla bean", "aggregateRating": null, "recipeIngredient": ["3 cups heavy cream", "1/2 vanilla bean, split", "1 cup sugar", "1/4 cup cornstarch", "5 large egg yolks", "8 ounces macadamia nuts, toasted and cooled", "1 cup flour", "9 tablespoons butter", "1/2 cup sugar", "1 large egg yolk", "1/2 teaspoon salt", "4 cups heavy cream", "1/2 cup sugar", "2 1/2 cups unsweetened coconut, lightly toasted and cooled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the pastry cream, combine in a medium heavy-bottom saucepan 2 1/2 cups of cream and scrapings from the vanilla bean; discard the bean. In a small bowl, combine sugar and cornstarch. In a medium bowl, combine egg yolks with remaining 1/2 cup of cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the saucepan over medium heat. Whisk sugar and cornstarch mixture into egg yolks when cream is about to boil. (There will be slight movement in the pan.) As it starts to boil, whisk a few hot spoonfuls into the yolk mixture to temper it. Reduce heat under pan to medium-low. Pour yolk mixture into the pan, and stir constantly with a wooden spoon until the mixture is thick. (If mixture separates, transfer it to a mixer with a whisk attachment, and beat until it is blended.) Transfer to a shallow container, and cover with plastic wrap to keep a skin from forming on the surface. Refrigerate until cold and firm, at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare macadamia nut crust, combine nuts and flour in a food processor. Process until nuts are finely ground, pulsing to keep them from becoming pasty. In a mixer with a paddle attachment, cream the butter with sugar. Add yolk, and mix thoroughly. Add nut mixture and salt, and mix until smooth. Wrap in plastic wrap, and refrigerate until chilled, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough in half. Roll out a half between two sheets of plastic wrap to make a 10-inch disk. Repeat with remaining dough. Line two 9-inch tart pans, and chill in freezer until very firm, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Place pie weights in shells, and bake until lightly golden, about 15 minutes. Remove pie weights, and continue to bake until the crust is golden brown, 10 to 15 minutes more. Allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, in bowl of a mixer fitted with a whisk attachment combine heavy cream, sugar and 2 cups of pastry cream. (Reserve any remaining cream for another use.) Whisk at high speed until soft peaks form. Add coconut, and continue whisking mixture by hand until very stiff. Spoon into cooled tart shells. Serve immediately, or refrigerate to chill."}]}