{"@context": "http://schema.org", "@type": "Recipe", "name": "Charred Cauliflower With Anchovies, Capers and Olives", "description": "This deeply versatile recipe is essentially a robust baked cauliflower salad. You can serve it room temperature as an antipasto, as part of a buffet or warm as a nearly vegetarian main course with rice pilaf, roasted sweet potatoes or pasta. It is also a perfect make-ahead side dish to accompany nearly everything from roasted chicken or fish fillets to steaks and chops.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/10/31/dining/31kitchenrex1/merlin_145138014_eb960e85-9b5a-45b1-a753-01376107ded6-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "anchovy, capers, cauliflower, olives, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 209}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 116, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "2 grams", "sodiumContent": "353 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 medium cauliflower (about 1 1/2 pounds)", "Salt", "2 garlic cloves, minced", "4 to 6 anchovy fillets, rinsed, patted dry and finely chopped", "1/2 cup roughly chopped good-quality green or black olives", "1 tablespoon capers, rinsed, patted dry and roughly chopped", "1/4 cup extra-virgin olive oil, plus more for drizzling", "2 tablespoons lemon juice", "1 teaspoon grated lemon zest", "Pepper", "1/2 teaspoon red-pepper flakes, or to taste", "1/2 cup roughly chopped parsley", "3 tablespoons chopped scallions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large pot of water on the stove and bring to a boil. Meanwhile, with a large knife, cut the cauliflower into quarters. Cut off the tough core at the stem end of each piece. Cut cauliflower quarters into rough 1/2-inch slices. Cut larger slices into several pieces, so all the chopped cauliflower is about the same size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Salt boiling water generously and add chopped cauliflower. Cook for 2 minutes, then drain and spread out on a baking sheet to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, put garlic, anchovy, olives, capers, olive oil, lemon juice and lemon zest. Whisk ingredients together and taste. Adjust salt or lemon juice as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add blanched cauliflower to the bowl. Season lightly with salt and pepper. Add a generous pinch of red-pepper flakes, or add to taste, and toss cauliflower with your hands to coat evenly with dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer mixture to a shallow baking dish, small roasting pan or sheet pan. (Recipe may be prepared up to this point several hours ahead of baking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish, heat oven to 450 degrees. Bake cauliflower, uncovered, for about 20 minutes, until top is browned and beginning to char in some places. For extra char, place dish under broiler for 1 to 2 minutes. Remove from oven and let cool for 5 to 10 minutes. Serve at room temperature with a sprinkling of parsley and scallions. Drizzle with a little more olive oil, if desired."}]}