{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Shortcut Chicken Pozole", "description": "Part of the joy of pozole is topping it generously and exactly as you like, and this take on the original dish is no exception. Traditional red pozole often requires toasting and then puréeing dried chiles for a flavorful broth, but this version relies on canned chipotles in adobo sauce. Adjust the chiles to your taste: more if you like it, less if you don’t. This brothy, smoky-spicy chicken soup is sensational with crunchy add-ons like crushed chips, shaved cabbage and red onion.\n\n<p><em>The pressure-cooker version of this recipe is available <a href=\"https://cooking.nytimes.com/recipes/1020110-pressure-cooker-chipotle-chicken-pozole\">here</a>.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2018/10/29/dining/sd-pozole/sd-pozole-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "4 to 5 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, weekday, soups and stews", "keywords": "chicken legs, chipotles in adobo, garlic powder, hominy, lime, onion powder, pozole, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 111}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 894, "unsaturatedFatContent": "37 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "58 grams", "fiberContent": "3 grams", "proteinContent": "65 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1712 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 large red or yellow onion, peeled and quartered", "2 carrots, trimmed and halved", "2 celery stalks, halved", "8 garlic cloves", "1 (7-ounce) can chipotle peppers in adobo sauce", "1 teaspoon onion powder", "1 teaspoon garlic powder", "1 teaspoon ground cumin", "3 to 3 1/2 pounds skin-on whole chicken legs (about 5 legs)", "5 cups chicken broth or stock", "Kosher salt, for seasoning", "1 cup frozen corn", "1 (29-ounce) can pozole (hominy), rinsed and well drained", "Juice of 1 lime, plus more for serving", "Crushed chips, shredded cabbage, diced avocado, minced red onion and-or cilantro, for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the onion, carrot, celery and garlic in a 5- to 8-quart slow cooker. Pull the whole chiles out of the can of chipotles in adobo (use only half if you prefer the finished dish to be medium-spicy), and roughly chop them. Add the chiles and all the adobo sauce to the slow cooker as well as the onion and garlic powders and cumin. Pull the skin from half of the chicken legs and discard it, or save to render the fat at another time. (Start at the thigh and pull the skin off the drumstick as if removing a glove; it should come off fairly easily.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken legs to the slow cooker and stir to combine. Pour in the broth. Add 1/2 teaspoon salt if you are using low-sodium broth or 1 teaspoon salt if using homemade unsalted stock. Do not add salt now if you are using fully salted broth. Cook on low until the chicken is tender and the broth is flavorful, at least 4 hours and up to 6 hours. If it’s more convenient, let the slow cooker switch to warm after 6 hours. The soup will hold on warm for about an additional 2 hours before the chicken dries out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Switch the heat to high. With tongs or a slotted spoon, remove the chicken and vegetables to a bowl. Discard the vegetables and let the chicken cool while you finish the soup. Using an immersion blender (see Tip), purée the broth. (It will be mostly smooth but some small flecks of pepper skin may remain.) Stir in the corn, pozole and lime juice. Shred the chicken meat, discarding the bones and skin, and add it into the soup. Replace the cover, let the ingredients warm through and serve the soup in bowls with the toppings of your choice."}], "link": "https://cooking.nytimes.com/recipes/1019692-slow-cooker-shortcut-chicken-pozole"}