{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Summer Beans With Garlic and Herbs", "description": "Green beans don’t number among the vegetables we normally grill — eggplants, onions, peppers, zucchini — but there’s something about the high, dry heat of the fire and the gentle scent of smoke that heightens their snap and natural sweetness. But how do you grill a vegetable so slender it seems doomed to fall between the bars of the grate? The secret is to use a meshed grill basket, which lets enough fire through to char the beans and enough smoke through to perfume them. The New York chef Missy Robbins grills Romano beans (a.k.a. flat or pole beans), whose shape maximizes the surface area exposed to the fire. If unavailable, substitute conventional green beans or haricots verts. The Italian inspiration for this dish is evident in the garlic, basil, mint and extra-virgin olive oil, but grilling the beans over a wood fire, instead of boiling, is uniquely and distinctly American. If necessary, you can use charcoal rather than wood; a gas grill is fine if that's what you have. ", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2018/07/04/dining/04woodrex2/merlin_139044186_4ab5c93c-4d18-43ec-9974-71a0c5fd35da-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, beans, vegetables", "keywords": "basil, garlic, mint, parsley, romano beans, side dish, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 59}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 162, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "2 grams", "saturatedFatContent": "2 grams", "sodiumContent": "326 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup extra-virgin olive oil", "3 to 5 cloves garlic, finely chopped", "1 teaspoon red-pepper flakes", "Finely grated zest and juice of 1 lemon", "1/2 cup chopped flat-leaf parsley", "2 pounds Romano beans (a.k.a. flat or pole beans) or other summer green beans, ends snapped and strings removed", "Sea salt and ground black pepper", "Leaves from 3 sprigs fresh basil", "Leaves from 3 sprigs fresh mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": " Build a hot wood fire in your grill. (You can do the same with charcoal. If you’re using a gas grill, place a few hardwood chunks under the grate over one or two of the burners. Heat one burner on high heat and additional burners on medium heat, adjusting the heat as necessary.) Brush and oil the grill grate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 1/4 cup oil and the garlic in a small saucepan and cook over low heat until the garlic is fragrant but not browned, 8 minutes. Remove pan from heat and let cool. Stir in red-pepper flakes, lemon zest and parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place beans in a large bowl with the remaining 1/4 cup olive oil. Season with salt and pepper and toss to mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange beans directly on the grill or in a wire grill basket. Grill beans until charred and crisp-tender, 3 to 4 minutes, turning with tongs. (You may need to work in two batches, depending on the size of your grill.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return hot beans to the mixing bowl and stir in garlic-parsley oil. Squeeze in lemon juice. Stir in basil and mint leaves and serve."}], "link": "https://cooking.nytimes.com/recipes/1019322-grilled-summer-beans-with-garlic-and-herbs"}