{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Pot Meatballs and Sauce", "description": "Made with equal parts ground beef (for flavor) and pork (for fat), these meatballs use a time-saving technique involving softening bread crumbs in an egg-ricotta mixture. This keeps them impossibly light and fluffy while forgoing the usual step of soaking bread in milk, which many meatball recipes require. Aside from leaving you one pot fewer to clean, making your tomato sauce in the same dish you’ve seared your meatballs in means you can take advantage of the flavorful bits left behind. Serve these however you see fit (this recipe makes enough sauce to dress four portions of spaghetti), but know that eating them out of the pot with a hunk of bread is also an option.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2017/11/28/dining/meatballs/meatballs-mediumThreeByTwo440.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings (about 12 meatballs)", "recipeCuisine": "", "recipeCategory": "meatballs", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 302}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 573, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "5 grams", "proteinContent": "33 grams", "saturatedFatContent": "14 grams", "sodiumContent": "977 milligrams", "sugarContent": "11 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 large eggs", "1/3 cup finely chopped parsley", "1/3 cups whole-milk ricotta", "1/3 cup grated Parmesan or pecorino", "1/4 cup dry bread crumbs (not panko)", "4 cloves garlic, finely chopped", "1 teaspoon kosher salt, plus more for seasoning", "1/2 teaspoon crushed red pepper flakes, plus more if desired", "1/2 pound ground beef", "1/2 pound ground pork", "Freshly ground black pepper", "2 tablespoons olive oil", "1 medium onion, finely chopped", "1 (28-ounce) can crushed tomatoes in purée", "1/2 cup fresh basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the eggs, parsley, ricotta, Parmesan, bread crumbs, 2 of the chopped garlic cloves, 1 teaspoon kosher salt and ½ teaspoon crushed red pepper flakes. Mix well and let sit for a few minutes to soften the bread crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beef and pork and season with black pepper. Using your hands, gently mix well to evenly incorporate ricotta mixture into the meat, while taking care not to overmix (or meatballs will become dense). Form the meat mixture into rounds slightly larger than a golf ball, about 2 ounces each. Be careful not to pack them too tightly; roll them just so they  barely hold together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large Dutch oven over medium heat. Working in batches, add a few balls at a time, taking care not to crowd the pot. Using tongs, gently rotate the balls every so often to encourage them to keep their rounded shape. Cook until evenly browned on all sides, 6 to 8 minutes per batch. Transfer meatballs to a large plate and set aside. Repeat with remaining balls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once all the meatballs are browned, drain all but 2 tablespoons of fat from the pot, leaving all the good browned bits behind. Return pot to medium heat and add onion and remaining 2 garlic cloves. Season with salt and pepper and cook, stirring frequently until onion is totally softened and translucent (but not browned), about 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomatoes and a pinch of crushed red pepper flakes, if you like. Fill tomato can with water, swirling to get all the remaining bits of tomato, and add to pot, using just enough to thin the sauce without making it overly watery. Season with salt and pepper. Use this tomato can  to hold your spoon or spatula while you cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer the sauce for about 10 minutes, just until the flavors meld and sauce has thickened a bit. Using tongs, return meatballs to the pot, nestling them into the sauce. Scatter basil over and place a lid on the pot. Reduce heat to low and let simmer for 20 to 25 minutes, until meatballs are cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve meatballs on their own, or over garlic bread or  spaghetti."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "One-Pot Meatballs and Sauce", "description": "Alison Roman’s classic Italian-American specialty made in one pan (which means fewer dishes to wash).", "thumbnailUrl": "https://static01.nyt.com/images/2017/11/28/dining/meatballs/meatballs-mediumThreeByTwo440.jpg", "uploadDate": "2018-03-30T16:42:49.000Z", "duration": "PT1M46S"}, "link": "https://cooking.nytimes.com/recipes/1019036-one-pot-meatballs-and-sauce"}