{"@context": "http://schema.org", "@type": "Recipe", "name": "Peppermint Stick Ice Cream", "description": "Making any ice cream at home is simple once you master one very important step: knowing when to stop cooking the custard. It should be thick enough to coat the back of the spoon. Test it by drawing a line with your finger. The edge of that line should stay straight for a few seconds without dripping. If you are at all nervous, keep an ice bath near the stove. That way you can plunge the pot into the water and stop the cooking quickly if it comes close to curdling. The recipe includes an optional bittersweet chocolate swirl that adds a sophisticated edge to this refreshing ice cream, but purists can feel free to leave it out.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2017/12/22/dining/22COOKING-PEPPERMINT-ICECREAM/22COOKING-PEPPERMINT-ICECREAM-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "About 1 1/2 quarts ", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "candy canes, peppermint, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 40}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 318, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "14 grams", "sodiumContent": "59 milligrams", "sugarContent": "22 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 large egg yolks", "1 cup sugar", "1/4 teaspoon kosher salt", "3 cups heavy cream", "1 cup whole milk", "1 1/2 teaspoons peppermint extract", "1/2 cup finely crushed candy canes", "5 ounces bittersweet chocolate, melted", "4 teaspoons vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, whisk together the egg yolks, sugar and salt until pale yellow. While whisking, slowly add the cream and the milk. Heat the mixture over medium-low heat, stirring constantly with a wooden spoon, until the mixture is thick enough to coat the back of the spoon or about 170 degrees on an instant-read thermometer, 10 to 12 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mixture through a fine-mesh sieve into a bowl to cool at room temperature. Stir in the peppermint extract. Cover and chill at least 4 hours or overnight. Set a 9-by-5-inch loaf pan in the freezer to chill. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If adding the chocolate chunks, stir together the chocolate and vegetable oil and set aside. Churn the ice cream mixture in an ice cream machine according to manufacturer’s instructions. During the last few minutes of processing, add the candy cane pieces and very slowly drizzle in the chocolate mixture. (If added too quickly, the chocolate will clump; when the ice cream has been fully churned, use a pair of kitchen shears to cut any pieces that are too large.) Transfer the ice cream to the prepared loaf pan, cover well with plastic wrap and freeze until firm."}], "link": "https://cooking.nytimes.com/recipes/1019105-peppermint-stick-ice-cream"}