{"@context": "http://schema.org", "@type": "Recipe", "name": "Shredded Roast Duck", "description": "Some say roasting a duck is difficult work. It is not. It can be messy, though, so make sure you have a roasting pan that can accommodate the enormous amount that renders out of the bird during its roughly four and a half hours in the oven. (Save it for roasting potatoes!) When the meat has cooked, use a couple of forks to shred it, then moisten it with your favorite barbecue sauce, hoisin sauce, gochujang sauce or gravy, and serve with rice or noodles, on potato rolls or Chinese wheat-flour pancakes, or as the final topping of this maniacal <a href=\"https://cooking.nytimes.com/recipes/1019117-sauteed-scallops-with-shredded-duck-and-hollandaise-sauce\">recipe for scallops with hollandaise sauce and shredded duck.</a>", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/12/24/magazine/24mag-recipecard3-shreddedduck/24mag-recipecard1-shreddedduck-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "roasts", "keywords": "barbecue sauce, duck, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 43}, "recipeIngredient": ["1 4- to 6-pound duck", "Kosher salt and freshly ground black pepper, to taste", "Barbecue sauce or hoisin sauce, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325. Remove giblets and neck from duck cavity, and discard or reserve for another use. Cut off excess fat from duck cavity. Place duck on a rack in a deep roasting pan, breast-side up, and season with salt and pepper. Then slide the pan into the oven and cook, undisturbed, for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove duck from oven, and use the point of a sharp knife to prick the skin of the bird, all over the breasts and thighs. Return bird to oven, and cook for 1 to 2 more hours, or until an instant-read thermometer inserted into the thigh measures around 155 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase oven temperature to 450, and cook until the duck is golden and crisp, 15 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove the roasting pan from the oven, and transfer the duck to a cutting board. (Let the fat in the pan cool, then store it, covered, in the refrigerator. It is an excellent medium for roasting potatoes.) Allow the duck to rest for a few minutes, then shred it, using two forks to pull the meat apart. Add your favorite barbecue sauce, to taste, or your favorite hoisin sauce, to taste. Keep warm."}]}