{"@context": "http://schema.org", "@type": "Recipe", "name": "Peppermint Bark", "description": "You have two choices when it comes to peppermint bark: If you’d like your bark to be shiny and snappy at room temperature, you must temper the chocolate. The process isn’t complicated, but you’ll need an instant-read thermometer and a bit of patience. But you can also leave tempering to the professionals and make the bark without tempering: Simply microwave both chocolates until melted, assemble the bark as instructed then transfer it to the fridge to harden. You may encounter a bit of condensation and melting when you serve it, but it will still taste great. Be sure to use good-quality bar chocolate instead of chips for more reliable results and better flavor. Look for oil-based peppermint extract, as the water in alcohol-based extracts can cause the chocolate to seize.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2018/12/11/dining/ss-peppermint-bark/merlin_147610986_cb95bc1c-6f52-4ee5-b17e-6b012f3febe1-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "About 1 1/2 pounds", "recipeCuisine": "", "recipeCategory": "snack", "keywords": "candy cane, peppermint extract, semisweet chocolate, white chocolate, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 242}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 313, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "11 grams", "sodiumContent": "22 milligrams", "sugarContent": "35 grams", "transFatContent": null}, "recipeIngredient": ["1 pound/455 grams good-quality semisweet chocolate (not chips), chopped", "8 ounces/225 grams good-quality white chocolate (not chips), chopped", "1/2 to 3/4 teaspoon oil-based peppermint extract, such as Simply Organic brand", "1/2 cup/75 grams crushed candy canes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a rimmed baking sheet with parchment paper and set aside. Set 12 ounces/340 grams semisweet chocolate in a microwave-safe bowl and microwave it in 5- to 25-second bursts, stirring occasionally, until it is melted and the temperature registers between 114 degrees and 118 degrees on an instant-read thermometer. Chocolate burns easily in the microwave, so go slowly. Try fewer seconds as the temperature starts getting close so that you don’t overshoot the mark. (If you’re a few degrees over, just keeping stirring the chocolate until it cools to the proper temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bowl from the microwave and gradually stir in the remaining 4 ounces/115 grams semisweet chocolate until the temperature has come down to 88 to 89 degrees. (After a bit of practice you can actually see and feel the chocolate fall into temper. It takes on a slightly looser quality and becomes shinier. Be patient, this can take up to 10 to 12 minutes with some chocolate.) Now quickly pour the chocolate out onto the prepared pan and spread it into an even layer. Let the chocolate stand at room temperature until the layer has set, about 1 hour. (You can also refrigerate until set, about 30 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Now set 6 ounces/170 grams white chocolate in a microwave-safe bowl and microwave it in 5- to 25-second bursts, stirring occasionally, until it is melted and the temperature registers between 105 degrees and 110 degrees on an instant-read thermometer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bowl from the microwave and gradually stir in the remaining 2 ounces/55 grams white chocolate until the temperature has come down to about 85 degrees. Quickly stir in the peppermint extract. Drizzle the white chocolate mixture evenly over the semisweet chocolate. Immediately sprinkle with the candy cane."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let stand at room temperature until completely set, about 4 hours. To serve, break into pieces. Refrigerate leftover pieces as necessary."}], "link": "https://cooking.nytimes.com/recipes/1019826-peppermint-bark"}