{"@context": "http://schema.org", "@type": "Recipe", "name": "Perfect Pie Crust", "description": "This classic dough contains no special ingredients, just flour, salt, butter and water, but it works like a dream. The recipe makes a single crust for a 9-inch pie; simply double it to make a double-crust pie. (If you make it by hand, you can even triple or quadruple the recipe.) If you’d prefer to use a food processor, you can, and it’s a good idea if you have warm hands. To do so, pulse the butter into the flour mixture a few times, until the butter is the size of walnut halves or peas, then transfer the mixture to a medium bowl and proceed with adding the water. (Adding the water in the food processor often leads to hydration problems and overmixing, which is why you should do that part by hand no matter what.) The dough keeps in the refrigerator for up to 2 days and in the freezer for up to 3 months (thaw it overnight in the refrigerator before rolling it out).", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2018/11/14/dining/14Perfect-pie-crust/14Perfect-pie-crust-mediumThreeByTwo440.jpg", "totalTime": "PT30M", "recipeYield": "1 single crust for a 9-inch pie", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 400}, "recipeIngredient": ["1 ¼ cup/160 grams all-purpose flour", "¼ teaspoon fine sea salt", "½ cup/115 grams cold unsalted butter, cut into ½-inch cubes", "3 to 4 tablespoons ice water, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together the flour and salt to combine. Add the butter, tossing the cubes through the flour until the pieces are separated from one another and each piece is coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the butter into the flour by pressing the pieces between your palms or fingertips, flattening the cubes into big shards and continuing to toss them in the flour to recoat the shards. The size of the butter will vary depending on the kind of pie you’re making: For fruit pies, stop when the butter pieces are about the size of walnut halves. For custard pies, stop when the butter pieces are smaller, about the size of peas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a well in the center of the mixture. Add 3 tablespoons ice water and mix it in by tossing the flour in the bowl. (This tossing movement lets the moisture incorporate without allowing too much gluten formation.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue to add ice water 1 to 2 tablespoons at a time until the dough begins to come together. As it comes together, fold it over itself a few times to make sure it’s homogenous. The dough should hold together without noticeable cracks (a sign of underhydration), but it should not be wet or tacky to the touch (a sign of overhydration)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form the dough into a disk about 1-inch thick. Wrap tightly in plastic wrap and refrigerate for at least 1 hour before using, and up to 2 days. (It can also be frozen for up to 3 months, then thawed overnight before using.)"}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Perfect Pie Crust", "description": "Perfect Pie Crust", "thumbnailUrl": "https://static01.nyt.com/images/2018/11/14/dining/14Perfect-pie-crust/14Perfect-pie-crust-mediumThreeByTwo440.jpg", "uploadDate": "2018-11-07T22:45:49.000Z", "duration": "PT4M56S"}}