{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Tart Crust", "description": "This recipe, my trusted go-to, turns out a cookielike crust — sweet, golden and more crisp than flaky. Typically French — it’s a pâte sablée — I use the recipe for my <a href=\"https://cooking.nytimes.com/recipes/1019239-whole-lemon-tart\">whole lemon tart</a> as well as for the less French <a href=\"https://cooking.nytimes.com/recipes/1018826-stephanie-johnstons-bakewell-tart\">bakewell tart.</a> I make the dough in a food processor using very cold butter, and while it sounds like culinary heresy, I roll it out as soon as it’s made. Sandwiched between parchment or wax paper, the dough is a cinch to roll at this point — just make sure to chill it before you bake it (better yet, freeze it once it’s in the pan). I also like to partly bake the crust before I fill it, a step you can skip, but prebaking will give you a crisper bottom crust.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2018/03/25/magazine/25mag-ondessert/25mag-ondessert-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "One 9-to-9 1/2-inch crust", "recipeCuisine": "", "recipeCategory": "", "keywords": "confectioners' sugar, egg, flour, unsalted butter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 104}, "recipeIngredient": ["1 1/2 cups/204 grams all-purpose flour", "1/2 cup/60 grams confectioners’ sugar", "1/4 teaspoon fine sea salt", "4 1/2 ounces/128 grams very cold unsalted butter (1 stick plus 1 tablespoon), cut into small pieces", "1 large egg yolk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the flour, sugar and salt in a food processor, and pulse to blend. Scatter in the butter, and pulse about a dozen times, until the butter is cut in — you’ll have pieces the size of oatmeal flakes and others the size of peas. Stir the yolk to break it up and add it in 3 additions, pulsing after each. Pulse until the dough has curds and clumps; it should hold together when you pinch it. Turn it out onto a counter, knead it into a compact ball and flatten it into a disk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the dough into an 11-inch circle between layers of parchment (or wax) paper. If it’s cold enough, fit it into a 9-to-9½-inch tart pan with a removable bottom, trimming the top even with the pan’s edges; if it’s not, chill it until you can work with it. Refrigerate the crust (in the pan) for at least 1 hour (or cover and freeze for up to 2 months)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400. Place the pan on a baking sheet, and cover with a piece of buttered foil or parchment, pressing it lightly to cover the crust’s bottom and sides; fill with rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 20 minutes. Carefully remove the foil and rice. If you're going to bake the tart again with a filling, bake it uncovered for 5 minutes more. If you'll be using a no-bake filling, bake the uncovered crust for an additional 8 to 10 minutes. Cool for at least 30 minutes before filling."}]}