{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange-Cardamom Pancakes", "description": "It’s no wonder pancakes are a weekend staple: Their batter comes together in just 5 minutes using ingredients you’re likely to have on hand. Here, ground cardamom and fresh orange zest provide an aromatic boost that is sweet and addictive, but subtle enough that you can still pair your pancakes with any typical accompaniments. The recipe is plentiful enough for 12 full-size pancakes, or twice the number of mini pancakes if preparing brunch for a crowd. (As a bonus, the pancake base also doubles as a waffle batter.) A drizzle of maple syrup and a pat of butter are mandatory; a dollop of warmed orange marmalade or chopped Medjool dates would be rousing.", "author": {"@type": "Person", "name": "Klancy Miller"}, "image": "https://static01.nyt.com/images/2019/01/23/dining/KM-orange-cardamom-pancakes/merlin_149290827_6e7cd502-db8a-4008-9395-6e1a3054a5f7-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "12 pancakes (4 to 6 servings)", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, easy, lunch, quick, pancakes", "keywords": "butter, cardamom, flour, maple syrup, orange", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 266}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 281, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "5 grams", "sodiumContent": "308 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups all-purpose flour", "2 tablespoons granulated sugar", "2 1/2 teaspoons baking powder", "2 teaspoons ground cardamom", "1/2 teaspoon kosher salt", "1 1/2 cups whole milk", "2 eggs", "1 teaspoon orange extract", "1 tablespoon fresh orange zest", "3 tablespoons butter, melted, plus more for greasing and serving", "Maple syrup, for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour, sugar, baking powder, cardamom and salt to a large bowl and whisk to combine. In a medium bowl, whisk the milk, eggs, orange extract, orange zest and 3 tablespoons melted butter until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the wet ingredients into the dry mixture and mix to combine using a large spoon or rubber spatula. Using a whisk or a handheld electric mixer on high speed, beat the batter until smooth, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large nonstick skillet or griddle over medium. Add butter for greasing, tilting the pan to coat the bottom. Working in batches, cook the pancakes, using about 1/3 cup batter for each. Cook each batch of pancakes until bubbly on top and golden-brown underneath, 1 to 2 minutes, then flip and cook until golden-brown on the second side, 1 to 2 minutes. Repeat with the remaining batter, adjusting the temperature and adding more butter as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pancakes to serving plates. Drizzle with maple syrup and top with butter, as desired."}]}