{"@context": "http://schema.org", "@type": "Recipe", "name": "Thai Red Curry Noodles With Vegetables", "description": "Think of this dish as red curry noodles, version 2.0. By doctoring up jarred red curry paste with fresh chile, garlic, ginger, lemongrass and spices, this dish gets a much more complex, intense flavor than the usual version. Once you have all the ingredients at the ready, the dish comes together quickly. And you’ll have enough leftover curry paste to make this again, even faster the next time. Omit the fish sauce (use soy instead) and egg to make this a vegan dish.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/01/17/dining/17appetite1/merlin_132007910_c8046af0-7fcc-4132-9680-16acf1c37df9-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, curries, noodles", "keywords": "baby bok choy, lemongrass, shiitake mushrooms, thai fish sauce, main course, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 405}, "recipeIngredient": ["1/4 cup lightly packed cilantro leaves and stems (white roots, too, if available)", "2 cloves garlic, roughly chopped", "1 shallot, sliced", "1 fresh hot red chile, seeded and roughly chopped", "2 tablespoons prepared Thai red curry paste", "1 tablespoon coconut oil", "1 tablespoon grated fresh ginger", "1 lemongrass stalk, tough outer leaves trimmed off, inner leaves finely chopped", "Finely grated zest and juice of 1 lime", "2 teaspoons Asian fish sauce", "1 teaspoon curry powder", "3/4 teaspoon cumin seeds", "1/2 teaspoon ground coriander", "3 tablespoons coconut oil", "5 ounces sliced shiitake mushrooms (about 3 cups)", "6 scallions, thinly sliced", "3 cloves garlic, thinly sliced", "1 fresh hot red chile, seeded and thinly sliced", "Kosher salt", "4 ounces thin dried noodles, such as ramen, egg noodles, rice noodles, etc.", "1 (14-ounce) can full-fat coconut milk", "1 1/2 tablespoons Asian fish sauce, more to taste", "Juice of 1/2 lime, plus more to taste", "1 cup sliced red bell pepper", "1 cup sliced snow peas or green beans", "5 ounces baby bok choy, spinach or tatsoi torn into bite-size pieces", "Lime wedges, for garnish", "Optional garnishes (use all or any combination of the following): 1/2 cup thinly sliced radishes; torn basil, mint, or cilantro leaves; sesame seeds; halved hard-cooked eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the curry paste: In a blender or mini food processor, combine cilantro, garlic, shallot, chile, red curry, coconut oil, ginger, lemongrass, zest and juice of 1 lime, fish sauce, curry powder, cumin and coriander. Blend into a paste, scraping down the sides of the blender as needed. If mixture is too thick to blend, add teaspoon or two of water as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat coconut oil over medium heat. Stir in mushrooms, half the scallions, garlic, chile and a large pinch of salt. Sauté until golden, 10 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the noodles according to package directions. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir 1/4 cup curry paste mixture into skillet and cook until fragrant and darkened, 1 to 2 minutes. Stir coconut milk into skillet along with remaining 1 1/2 tablespoons fish sauce, and juice of 1/2 lime."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add red pepper, snow peas and 1/2 teaspoon salt. Cover and cook, stirring occasionally, until vegetables are softened, 3 to 5 minutes. Stir in bok choy and cook until wilted, 2 to 4 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold in noodles, tossing until coated with sauce and heated through. Add fish sauce or lime juice to taste, and pass lime wedges at the table. Top with remaining scallions and any of the optional garnishes. Serve with lime wedges on the side. Store the extra curry paste in the refrigerator for up to 3 weeks, or freeze for up to 3 months."}]}