{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Artichokes With Ricotta and Peas", "description": "The key to roasting artichokes is to make sure to trim away all of the tough, leathery outer leaves until only the soft pale ones in the center remain. It may seem like you’re throwing a lot away — and you are. But because roasting encourages crispness, any borderline-fibrous bits will toughen up even more, becoming impossible to chew. So for the most tender vegetables, stay on the side of over-trimming, rather than under-trimming. In this recipe, the browned artichokes are tossed with fresh herbs, peas and plenty of olive oil (use your best bottle), then scattered on top of lemony ricotta cheese. Serve this, with or without crostini, as an appetizer or part of a light supper with a salad.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/05/09/dining/09apperex2/merlin_137521020_09345c1a-3bcb-47f2-8030-d5ec108eeb04-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "vegetables", "keywords": "appetizer, main course, artichoke, peas, ricotta, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 42}, "recipeIngredient": ["1 lemon, cut in half", "4 medium artichokes, or 8 to 10 small or baby artichokes", "2 tablespoons extra-virgin olive oil, more for garnish", "1/2 teaspoon kosher salt, more to taste", "1 cup fresh peas (from about 1 pound of peas in the pod) or frozen peas", "2 cups fresh ricotta cheese", "Finely grated zest from 1 lemon", "1/4 cup torn mint or dill, or a combination", "Flaky sea salt, to taste", "Fresh lemon juice, to taste", "Crostini, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze one lemon half into a large bowl of cold water. Pluck off all tough leaves from one artichoke, until you reach leaves that are pale and soft. Using a vegetable peeler or paring knife, peel stem and trim base of artichoke, then dunk it in lemon water to keep it from browning. Cut off the top 1/3 of artichoke and discard. Slice artichoke lengthwise into quarters; remove any inner purple leaves and scoop out the fuzzy choke if there is one. Put the quarters in the lemon water and leave them there as you cut remaining artichokes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the artichokes, shaking them well to remove excess water. On a rimmed baking sheet, toss artichokes with oil and salt. Roast until golden and tender, 25 to 35 minutes, tossing them halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a medium pot of salted water to a boil. Slip in peas; cook for 1 to 2 minutes until tender, then drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, stir together ricotta, lemon zest and kosher salt to taste. Spread out on a plate, and top with peas, artichokes, mint, flaky sea salt and lemon juice to taste. Drizzle generously with olive oil. Serve with crostini if desired."}], "link": "https://cooking.nytimes.com/recipes/1019293-roasted-artichokes-with-ricotta-and-peas"}