{"@context": "http://schema.org", "@type": "Recipe", "name": "No-Bake Cheesecake Bars", "description": "No-bake cheesecake is an excellent dessert for cooks with a lot of friends and not a lot of time. Unlike a traditional cheesecake, the no-bake variety is eggless, making it smooth, light, and all about the dairy. This version includes tangy Greek yogurt and a bit of whipped cream for added loft. Serve big squares with in-season fresh fruit or a dollop of fresh jam.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2018/04/09/dining/09COOKING-NOBAKECHZCAKE1/09COOKING-NOBAKECHZCAKE1-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "24 servings", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "cream cheese, graham cracker, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 387}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 267, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "0 grams", "proteinContent": "4 grams", "saturatedFatContent": "11 grams", "sodiumContent": "179 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["18 whole graham crackers (about 9 1/2 ounces/269 grams)", "8 tablespoons/113 grams unsalted butter (1 stick), melted", "2 tablespoons granulated sugar", "1/4 teaspoon kosher salt", "1 1/2 pounds/678 grams full-fat cream cheese, at room temperature", "1 1/2 cup/185 grams confectioners’ sugar", "1 tablespoon pure vanilla extract", "2 cups (1-17.6 ounce/500 grams container) full-fat Greek yogurt, at room temperature", "1 1/4 cup cold heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 13-inch-by-9-inch baking pan with parchment paper, leaving a 2-inch overhang on two sides. In a food processor, or in a resealable plastic bag, crush the graham crackers until you have fine crumbs (but stop before you have dust). You should have about 2 1/4 cups. Transfer the crumbs to a medium bowl. Add the butter, sugar and salt, and stir until evenly moistened. Tip the crumbs into the prepared pan and press them down into an even layer on the bottom. Transfer to the freezer while you prepare the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat the cream cheese, confectioners’ sugar and vanilla with an electric mixer until fluffy, 3 minutes. Beat in the yogurt just until combined, about 30 seconds. In a separate bowl, beat the cream until you have stiff peaks. With a large rubber spatula, fold the cream into the cream-cheese mixture. Transfer the filling to the prepared crust and spread it out into an even layer. Cover with plastic wrap and refrigerate until very cold, at least 6 hours or up to overnight. Keep the bars refrigerated until serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, cut the bars away from the two exposed edges of the pan with a sharp knife. Use the parchment overhang to very carefully transfer the bar to a cutting board. (Be careful: The crust is tender.) Cut into squares to serve."}]}