{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Sugar Cookies", "description": "These are almost brownie-like in flavor, and remain slightly softer than many traditional sugar cookies. The recipe was developed by Georganne Bell, a professional cookie-decorating teacher in Salt Lake City who doesn’t like traditional vanilla sugar cookies. Unlike many sugar cookies, these don’t need to chill, and can be rolled out immediately after they are mixed. Avoid the temptation to add more flour (unless the dough is really sticky), or to use too much flour while rolling and cutting them, or the cookies will be dry. They don’t spread in the oven, so you can bake them close together. They are sturdy enough to decorate wildly with colored royal icing, but also taste good with just buttercream or a simple glaze of powdered sugar and water flavored with a little lemon juice or vanilla.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2018/12/05/dining/05cookierex1/05cookierex1-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "About 3 dozen 3-inch cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "dessert, unsweetened cocoa powder, vegetable shortening", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 99}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 139, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "4 grams", "sodiumContent": "73 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup/225 grams slightly softened unsalted butter (not quite room temperature)", "1/4 cup/51 grams vegetable shortening", "1 1/2 cup/340 grams granulated sugar", "2 eggs", "1 teaspoon/5 milliliters vanilla extract", "3/4 teaspoon/3 grams baking powder", "1 teaspoon/6 grams fine sea salt", "2/3 cup/95 grams unsweetened cocoa powder", "3 cups/339 grams flour, plus 1/2 cup/56 grams if baking cookies immediately"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees and line baking sheets with silicone baking sheets or parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a stand mixer fitted with the paddle attachment, or by hand, cream together the butter, shortening and sugar at medium speed, about 3 to 5 minutes. (The mixture needn’t be fluffy.) Scrape down the sides with a silicone spatula and mix in the eggs, vanilla, baking powder and salt. Combine well. Scrape down the sides and stir in the cocoa until well blended. Add the flour, and mix until the flour is completely incorporated and the dough comes together into a ball. At this point, you can refrigerate the dough up to 2 days or freeze it up to 3 months, tightly wrapped in plastic. (The dough will seem soft, but that’s O.K. If you are going to roll out the cookies and bake them immediately, mix in the other 1/2 cup of flour.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll out the dough to 1/4-inch thickness and use cookie cutters to cut into shapes, rerolling dough scraps as necessary and arranging shapes 1/4 inch apart on prepared baking sheets. Bake for 7 to 10 minutes. Smaller shapes will cook more quickly. Because these are chocolate, it can be hard to determine when they are done. Err on the side of underbaking. You can tell the cookies are ready when the surface changes from wet- or glossy-looking to dry. Remove cookies to a rack and allow them to cool completely before decorating."}], "link": "https://cooking.nytimes.com/recipes/1019784-chocolate-sugar-cookies"}