{"@context": "http://schema.org", "@type": "Recipe", "name": "Gingerbread Cheesecake", "description": "The warm, spicy flavors of gingerbread are a natural match for cheesecake. I mean, who doesn’t love a slice of gingerbread cake slathered with cream cheese frosting? This dessert is certainly rich, but it is also packed with lots of spices, including a hefty sprinkle of both ground and fresh ginger, classic cinnamon, allspice that lends a slightly peppery note, and a bit of fresh lemon zest to brighten things up. It can be a little tricky to get the batter completely smooth, so make sure all the ingredients are at room temperature before you start mixing, and take care to bake the cheesecake gently to avoid cracks.\nThe cranberry topping here is optional but it is festive and delicious, and a great little cover-up if the cheesecake does happen to crack. Alternatively, this is great with a bit of lightly sweetened whipped cream or crème fraîche. Slice cheesecake with a clean, hot knife for the tidiest servings.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2017/12/11/dining/11COOKING-GINGERBREADCHEESECAKE2/11COOKING-GINGERBREADCHEESECAKE2-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "9-inch cheesecake", "recipeCuisine": "", "recipeCategory": "cakes, custards and puddings", "keywords": "dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 56}, "recipeIngredient": ["1 3/4 cups/210 grams finely ground gingersnap cookie crumbs", "1 tablespoon dark brown sugar", "1/2 teaspoon ground ginger", "pinch kosher salt", "5 tablespoons unsalted butter, melted", "2 pounds/904 grams cream cheese", "2/3 cup/146 grams dark brown sugar", "1 tablespoon ground ginger", "2 teaspoons ground cinnamon", "1/2 teaspoon ground allspice", "1/2 teaspoon ground cardamom", "1/4 teaspoon ground nutmeg", "4 large eggs, lightly beaten", "3/4 cup/170 grams sour cream", "1/3 cup/80 milliliters unsulfured molasses (not blackstrap)", "2 tablespoons dark rum", "2 teaspoons finely grated fresh ginger", "1/2 teaspoon finely grated lemon zest", "2 cups/200 grams fresh or frozen cranberries", "1/2 cup/120 milliliters orange juice", "2 tablespoons dark rum ", "1/3 cup/67 grams granulated sugar", "1 tablespoon chopped crystallized ginger "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the cream cheese, sour cream and eggs to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Wrap the bottom and exterior sides of a 9-inch springform pan with a layer of aluminum foil; make sure to wrap to the top of the sides since the pan will be submerged halfway in a water bath while baking. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the crust: Stir the gingersnap crumbs, brown sugar, ground ginger and a pinch of salt together in a medium bowl. Add the melted butter and stir until well combined. Press the mixture evenly into the bottom of the prepared pan. Bake the crust until golden brown and fragrant, 9 to 11 minutes. Set aside while you prepare the filling. Set a kettle or medium pot of water to boil. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: Add the cream cheese to the bowl of a stand mixer and mix on medium-high, scraping down the sides of the bowl occasionally until very smooth and fluffy, 4 to 5 minutes. Add the brown sugar and spices and mix until well combined and completely smooth, about 2 more minutes. Scrape the bottom and sides of the bowl, then add the eggs a little bit at a time, mixing each bit completely into the mixture before adding the next. Add the sour cream, molasses, rum, fresh ginger, lemon zest and mix until just combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a rubber spatula to scrape down the bottom and sides of the bowl and mix the last few strokes by hand. Make sure the mixture is totally, completely smooth, then pour it into the prepared crust. The mixture will fill the pan almost all of the way to the top. Firmly tap the pan on a countertop to release any air bubbles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a roasting pan on the center rack of the oven and place the cheesecake in the pan. Fill the pan with boiling water about halfway. Bake the cheesecake for one hour, without opening the door. After one hour check for doneness by gently tapping the side of the pan. The cheesecake should look set at the edges but still a bit wiggly, and will be light golden brown on top. If it is not finished baking, check it every 5 to 10 minutes or so until done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cheesecake is finished baking, turn off the oven, prop the oven door open a crack (a wooden spoon works great for this), and let the cheesecake cool in the oven until it is close to room temperature, about an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cheesecake from the oven, remove the foil from the outside of the pan, and transfer to the refrigerator to cool completely, at least 4 hours and up to 2 days. After it has completely cooled, loosely cover the pan with plastic wrap. To slice: run a hot thin knife around the edge of the pan before removing the ring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cheesecake cools make the cranberries: Add the cranberries, orange juice, ¼ cup/60 milliliters water, rum, and sugar to a saucepan. Cook over medium-high heat, stirring occasionally until the cranberries burst and the mixture is slightly thickened, about 10 to 15 minutes. Stir in the chopped crystallized ginger. Serve at room temperature or chilled."}], "link": "https://cooking.nytimes.com/recipes/1019080-gingerbread-cheesecake"}