{"@context": "http://schema.org", "@type": "Recipe", "name": "Causa With Shrimp and Avocado", "description": "A causa is layered potato terrine that is popular in Peru. For this recipe, avocado and shrimp salads are stacked on a base of spicy mashed potatoes. Each layer is simple to make and, together, they add up to an impressive appetizer. You'll need a ring mold about 3 1/4 inches in diameter and about 2 inches in height to shape the causa. Many Peruvians improvise with clean cans of similar dimensions, removing both ends first. Use a soup or bean can, which tend to be a little less than 3 inches in diameter.", "author": {"@type": "Person", "name": "Madhur Jaffrey"}, "image": "https://static01.nyt.com/images/2018/04/18/dining/18potatorex3/merlin_133518630_29f8384e-3357-4dd8-9b94-4b3e5ced2b4d-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "south american", "recipeCategory": "", "keywords": "aji amarillo, avocado, potato, shrimp, appetizer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "recipeIngredient": ["1 1/2 pounds Idaho potatoes (2 to 3 large potatoes)", "1/2 teaspoon salt, or to taste", "2 tablespoons aji amarillo paste (see Tip)", "4 teaspoons lime juice", "1 tablespoon olive oil", "1 teaspoon seeded and very finely diced fresh hot red chile", "1 tablespoon very finely chopped cilantro leaves", "24 medium shrimp (about 3/4 pound), peeled and deveined", "1 clove garlic, minced and mashed", "1/4 teaspoon salt", "1/8 teaspoon ground cumin", "A pinch of cayenne", "1 tablespoon olive oil", "3 tablespoons finely diced inner celery stalks", "1 teaspoon lime juice", "2 tablespoons mayonnaise", "1 tablespoon finely chopped cilantro", "1 avocado, ripe but not mushy", "2 teaspoons lime juice", "1/4 teaspoon salt", "Freshly ground pepper", "2 tablespoons mayonnaise", "A small pat of unsalted butter for greasing ring molds or cans", "Cilantro sprigs, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the potatoes: Heat oven to 400 degrees. Wash and prick the potatoes with a fork. Bake directly on the oven rack for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel potatoes while still warm (hold with a fork, if necessary) and put the potatoes through a ricer 3 times."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the mashed potatoes on a board and treat them like dough. Add the salt and knead it in. Add the amarillo paste and knead it in. Do the same with the lime juice and then the oil, incorporating them in slowly. Add the red chili and cilantro to give flecks of red and green. Knead some more and roll into a smooth cylinder, about 5 inches long and about 3 inches or less in diameter, depending on your mold. Wrap tightly in plastic wrap and refrigerate. This can be done several hours or even a day ahead of time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the shrimp salad: Pat the shrimp dry. Cut each shrimp in half, crosswise, and put in a bowl. Add the garlic, salt, cumin and cayenne. Mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put oil in a medium frying pan and set on medium-high heat. When hot, add the shrimp. Stir and fry until they just turn opaque, about 3 minutes. Remove them to a clean bowl. Add the celery, lime juice, mayonnaise and cilantro. Mix well, taste for balance of flavors, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the avocado salad: Peel the avocado, remove the pit and cut it into 1/2-inch dice. Put in a bowl. Add the lime juice and mix well. Add the salt, pepper and mayonnaise. Mix well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the dish: Grease 4 ring molds or clean soup cans with butter. Cut the cylinder of refrigerated mashed potatoes, crosswise, into 4 parts (about 1 1/4-inch thick each) and make them about the same diameter as your mold. Make sure the edges are clean with no cracks. Drop a patty down each mold and tamp it down gently with the bottom of a glass."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the avocado salad into 4 parts and drop a part down on the top of the mashed potato in each mold, spreading it out evenly. Press down lightly with the glass again. Divide the shrimp salad into 4 parts and drop one part each neatly over the avocados, again, spreading it out evenly. Press down lightly. Lift off the mold or can, garnish with the cilantro sprigs and serve."}], "link": "https://cooking.nytimes.com/recipes/1019145-causa-with-shrimp-and-avocado"}