{"@context": "http://schema.org", "@type": "Recipe", "name": "Tart Crust", "description": "This recipe for the buttery dough, known in French as pâte brisée, comes via the pastry chef Natasha Pickowicz. It makes enough for two 10-inch tarts; divide the dough into two equal-size balls, flatten into discs, wrap well in plastic wrap and keep in the freezer to defrost whenever you need it. It can be used for sweet or savory recipes, like this <a href=\"https://cooking.nytimes.com/recipes/1019281-potato-and-radicchio-tart\">potato-and-radicchio tart.</a>", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/04/22/magazine/22mag-eat4-extra/22mag-eat4-extra-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "2 10-inch tarts", "recipeCuisine": "french", "recipeCategory": "", "keywords": "butter, flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 79}, "recipeIngredient": ["3 cups/425 grams all-purpose flour", "1 tablespoon/20 grams white sugar", "1 teaspoon/4 grams kosher salt", "1 cup/226 grams unsalted butter, cut into 1/2-inch cubes and chilled", "1/2 cup plus 2 tablespoons (130 grams) ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the flour, sugar and salt into the bowl of a food processor, and pulse once or twice to mix. Add the butter, and pulse twice more, so it’s still in very large pieces. Steadily pour the ice water into the machine while pulsing it as quickly as you can, until the butter is still visible in large smears and the dough is pushing up the sides of the bowl and looks like damp bread crumbs (you may not need to add all the water)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the dough crumbs into a bowl, cover and refrigerate for at least 1 hour. (The dough will continue to hydrate, but if it still feels powdery and dry, wet your fingertips and flick a little cold water onto the crumbs.) After 1 hour, divide the dough into two even balls, gently squashing each into a disc, and wrap each in plastic wrap. Put one in the fridge, to roll out for the <a href=\"https://cooking.nytimes.com/recipes/1019281-potato-and-radicchio-tart\">potato-and-radicchio tart</a>, and put the other in the freezer so that you have dough ready to go for another tart."}]}