{"@context": "http://schema.org", "@type": "Recipe", "name": "A Perfect Hard-Boiled Egg", "description": "Master this simple technique and every hard-boiled egg you make from here on out will have a perfectly-cooked, creamy sunshine center. <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/956947-what-to-make-with-all-of-those-hard-boiled-eggs\">Here</a> are loads of recipes to make with them.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/12/29/dining/29EGG3/29EGG3-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Varies", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, easy, lunch, quick, snack, finger foods", "keywords": "main course, side dish, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 165}, "recipeIngredient": ["Eggs", "1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place eggs in a single layer in a heavy saucepan and cover with cold water by at least 1 inch. Add 1 teaspoon salt (Salting the water helps minimize leaks if the eggs crack in the pan; the egg whites coagulate and seal off the crack more quickly). Turn the heat to high. As soon as the water comes to a gentle boil, turn off the heat and cover the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For creamy yolks, remove the lid after 10 minutes and run cold water over eggs for 1 minute. Set aside to cool at room temperature. For firmer yolks, leave the eggs to cool in the cooking water, uncovered, for up to 2 hours. To test if an egg has been cooked, spin it on a counter. A hard boiled egg spins faster than a raw egg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To peel, gently tap a boiled egg against the counter, turning and tapping to make a crackle pattern. Start peeling at the broad end, where there is an air pocket. Running the egg under cold water is not necessary, unless they are too hot to handle."}]}