{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheese Grits With Saucy Black Beans, Avocado and Radish", "description": "Cheesy grits are a filling, versatile vegetarian staple. They can be dressed up or down, and topped with heaps of your favorite things. If you have it, Manchego provides creaminess and rich, salt flavor, but a combination of Cheddar and Parmesan works equally well. If you’re using a vegan cheese, opt for one with the creamiest texture like a soy mozzarella, Cheddar or Cheddar Jack. To finish, let your favorite taco toppings guide you—avocados, radish and scallions are a surefire trifecta, but a spoonful of pico de gallo or salsa would be welcome here, too. You could also amp up the beans big time, adding chopped garlic, ground cumin or oodles more heat, but don’t go so crazy that you can’t pull this off on a weeknight with ease.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/01/15/dining/sc-cheese-grits-with-black-beans/merlin_149231763_c1eecae5-309a-47a3-9811-4362efbca087-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, dinner, easy, lunch, quick, weeknight, beans", "keywords": "avocado, black beans, grits, polenta, radish, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 661}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 567, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "80 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "23 grams", "proteinContent": "21 grams", "saturatedFatContent": "5 grams", "sodiumContent": "833 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["2 3/4 cups vegetable broth or water (or any combination of both), more as needed", "2 cups whole milk or cashew milk", "1 cup grits or polenta", "1 teaspoon kosher salt, plus more to taste", "1 (28-ounce) can black beans, rinsed and drained", "1/2 to 1 teaspoon ground cayenne", "1/2 cup grated Manchego, Cheddar, Parmesan or vegan cheese, plus more for garnish", "2 tablespoons butter, optional", "2 firm ripe avocados, peeled and chopped", "3 small or 1 large radish, thinly sliced", "3 scallions, thinly sliced", "Hot sauce and lime wedges, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pot, combine 2 cups of the broth or water along with the milk, grits and 1 teaspoon salt. Cook over low heat, stirring frequently, until completely tender, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small saucepan, combine the remaining 3/4 cup broth or water with the black beans and cayenne and cook over low heat, stirring occasionally, until warm and saucy. Season to taste with salt and add broth or water by the tablespoon, if desired, for saucier beans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the grits are tender, remove from the heat, and vigorously stir in the 1/2 cup cheese and the butter, if using, until the grits are creamy and almost fluffy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon into four bowls, and top with the bean mixture, avocado, radish and scallion. Finely grate more cheese over the top, if desired, and serve warm, with hot sauce and lime wedges if desired."}], "link": "https://cooking.nytimes.com/recipes/1019926-cheese-grits-with-saucy-black-beans-avocado-and-radish"}