{"@context": "http://schema.org", "@type": "Recipe", "name": "Nem Nuong (Vietnamese Sausage)", "description": "Traditionally grilled over charcoal, these little sausages also cook up beautifully in a cast-iron pan. Serve them in a bowl over rice noodles or steamed jasmine rice with fresh mint and cilantro, cucumbers and pickled carrots. Top with green chiles and toasted peanuts, then drizzle with fish sauce and lime. Or, use to make banh mi sandwiches. Be sure to use ground pork with enough fat or you'll end up with dry, flavorless sausage. Twenty percent by weight is a good ratio, though 25 doesn’t hurt. If the ground pork available to you is too lean, ask the butcher to replace two ounces or so of the lean meat with ground pork belly or bacon.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2017/11/05/magazine/05eat2/05mag-05eat-t_CA0-articleLarge.jpg", "totalTime": "PT55M", "recipeYield": "4 servings", "recipeCuisine": "vietnamese", "recipeCategory": "sausages", "keywords": "fish sauce, ground pork, jasmine rice, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 347, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "0 grams", "proteinContent": "20 grams", "saturatedFatContent": "9 grams", "sodiumContent": "816 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon plus 1 teaspoon jasmine rice", "1 tablespoon sugar", "1/2 teaspoon freshly ground black pepper", "1/2 teaspoon Diamond Crystal kosher salt or 1/4 teaspoon fine sea salt", "1/2 teaspoon baking powder", "2 tablespoons fish sauce", "2 teaspoons pounded or very finely grated garlic", "1 pound ground pork", "Canola, grapeseed or other neutral-tasting oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with parchment paper; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a cast-iron pan over medium heat, and add rice. Cook, swirling and stirring constantly, until rice turns a deep golden color, 5 to 8 minutes. Remove from heat, pour into a small heatproof bowl and allow to cool. Use a spice or coffee grinder to grind cooled rice into a fine powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place rice powder, sugar, pepper, salt, baking powder, fish sauce and garlic in a large bowl, and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pork to the bowl, and using your hands, mix thoroughly for 1 full minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a cast-iron pan over medium heat. Use a heaping tablespoon of pork mixture to make a small, thin sausage patty. Add a teaspoon or so of oil, and cook the patty for 2 to 3 minutes on each side. Taste, and if needed, add salt or any other seasonings to the uncooked sausage mixture, and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide and roll the remaining sausage into 8 3-inch logs, skewering lengthwise and placing on the prepared baking sheet as you go. Cover, and refrigerate for 30 minutes to allow flavors to come together. (Sausages can be made ahead and covered and refrigerated or frozen at this point until ready to use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook, wipe out cast-iron pan, and return to medium heat. Add 1 tablespoon oil. When it shimmers, add sausages in a single layer, leaving space between them. Cook, rotating every 2 minutes, until browned on the surface and just cooked through, 6 to 8 minutes total."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain sausages on paper towels, and serve hot."}]}