{"@context": "http://schema.org", "@type": "Recipe", "name": "Easiest Lentil Soup", "description": "This earthy, simple-to-make lentil soup can be embellished however you please. Leave it plain, and it’s warming and velvety. Or dress it up as you like, either with one or two of the suggested garnishes listed in the recipe (see Tip), or with anything else in your pantry or fridge. If you’d like to make this in a pressure cooker, reduce the stock to 3 1/2 cups, and cook on high pressure for 12 minutes, allowing the pressure to release naturally.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/01/23/dining/30apperex1/23apperex-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, soups and stews", "keywords": "fall, winter, lentils, radicchio, thyme, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 912}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 305, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "4 grams", "proteinContent": "12 grams", "saturatedFatContent": "2 grams", "sodiumContent": "555 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["6 tablespoons extra-virgin olive oil, plus more as needed", "1 large onion, diced", "1 1/2 teaspoons kosher salt, plus more as needed", "1 quart chicken, beef or vegetable stock, preferably homemade", "1 cup brown or green lentils, rinsed", "2 thyme or rosemary sprigs", "1 to 2 garlic cloves, finely grated or pushed through a garlic press", "1 teaspoon white-wine, sherry or cider vinegar, or lemon or lime juice, plus more to taste", "1/2 cup thinly sliced radicchio, or red or green cabbage (optional)", "1/2 cup parsley leaves, chopped", "Toppings (see Tip)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1/4 cup oil in a medium pot over medium-high heat. Stir in onions and 1/2 teaspoon salt, and cook until onions start to brown at the edges, stirring frequently, 6 to 9 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in stock, lentils, thyme and remaining 1 teaspoon salt. Bring to a simmer, cover, and cook until lentils are tender, 30 to 40 minutes. Discard thyme sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in garlic, and remaining 2 tablespoons oil, and use an immersion blender to purée the soup to the desired consistency, keeping it chunky or making it smooth. (Alternatively, ladle it into a blender and blend in batches.) Stir in vinegar, then taste and add more salt and vinegar if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, toss radicchio, if using, and parsley with a drizzle of oil and a sprinkle of salt. To serve, ladle soup into bowls and top with a small mound of radicchio and parsley, and/or any other garnishes you like."}], "link": "https://cooking.nytimes.com/recipes/1019943-easiest-lentil-soup"}