{"@context": "http://schema.org", "@type": "Recipe", "name": "Sabut Raan (Roast Leg of Lamb)", "description": "This recipe for a whole roasted leg of lamb comes from the cookbook author Sameen Rushdie, who wrote \"Indian Cookery,\" the classic published in Great Britain in 1988. On Sundays, after a matinee at the Metro Cub Club in Bombay, the Rushdie family often sat down to a special lunch of roast lamb. In this version, the yogurt marinade turns into a rich sauce as it mixes with the braising liquid in the oven. Ms. Rushdie still turns to the dish as the centerpiece of a dinner party, because it can be set up ahead of time and cooked in the oven. The leg is trimmed of all fat, so it’s important to keep it moist: For the first couple of hours of cooking, keep it covered, with some water in the pan, then uncover and let the surface brown a little at the end.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/05/16/dining/16rushdierex/merlin_137836392_22d8ef4e-9b9a-480e-ad70-64b66cdaee0b-articleLarge.jpg", "totalTime": "PT2H45M", "recipeYield": "6 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, lunch, meat, roasts", "keywords": "leg of lamb, yogurt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 83}, "recipeIngredient": ["1 tablespoon poppy seeds", "1 teaspoon coriander seeds", "10 cloves", "15 black peppercorns", "1 cinnamon stick", "2 cardamom pods", "1 bay leaf", "6 garlic cloves, peeled", "3 inches ginger, peeled", "2 teaspoons salt", "8 ounces full-fat yogurt (1 cup)", "1 leg of lamb (4 pounds), bone-in, all fat trimmed", "1 large white onion, roughly chopped", "4 tablespoons clarified butter", "1/2 cup fried onions, for garnish", "1/2 cup roughly chopped cilantro, for garnish", "1/2 lemon cut into thin slices, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small, dry saucepan over low heat, toast poppy seeds, coriander seeds, cloves, peppercorns, cinnamon, cardamom and bay leaf until they release their aromas. Use a mortar and pestle or spice grinder to process into a rough powder. Add garlic, ginger and salt and grind into a smooth paste. In a small bowl, mix with yogurt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prick deep holes all over the lamb, or make gashes with a knife, then rub marinade all over meat and transfer to a roasting pan. Refrigerate for at least 2 hours, or as long as overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. In a saucepan over medium to low heat, heat butter and sauté chopped onion until light golden. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 cup water to the roasting pan with the lamb, cover tightly with foil and bake for 45 minutes. Gently flip the lamb over and bake for another 45 minutes. Flip the lamb again, pour the onions and clarified butter over the lamb and roast uncovered for about 1 hour, until the meat is tender, cooked through and lightly browned on the surface. If the pan starts to get dry at any time, add 1/2 cup water to it. When ready to serve, garnish the lamb with the fried onions, cilantro and lemon slices."}], "link": "https://cooking.nytimes.com/recipes/1019301-sabut-raan-roast-leg-of-lamb"}