{"@context": "http://schema.org", "@type": "Recipe", "name": "Fabrizia Lanza’s Sicilian Pizza (Sfincione)", "description": "Palermo, the capital of Sicily, is street-food paradise, and among its many offerings is sfincione, a hearty pizza that’s baked in a rimmed sheet pan, allowing the dough to rise to a chewy thickness, and cut into large square slices. Sfincione is smeared with a frugal tomato sauce enhanced with umami from sheep’s milk cheese, onions and anchovy, along with olive oil and a handful of bread crumbs to make the cheese go further. When baked, the top is juicy, while the bottom is crisp from the generously oiled pan. Despite its origins as a street food, it is the perfect pizza to make at home. This easy and authentic recipe is from Fabrizia Lanza, proprietor of the Anna Tasca Lanza Cooking School, on the family’s country estate near Palermo.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/12/05/dining/05kitchenrex1/merlin_147457287_3700e223-72be-4dd8-a70e-275066fd386f-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "italian", "recipeCategory": "brunch, dinner, lunch, pizza and calzones", "keywords": "anchovy, pecorino, tomato puree, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 153}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 319, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "3 grams", "proteinContent": "12 grams", "saturatedFatContent": "3 grams", "sodiumContent": "618 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon dry active yeast", "1/4 cup/45 grams fine semolina", "2 cups/255 grams 00 flour or all-purpose flour, plus more for dusting", "1 teaspoon kosher salt", "2 tablespoons extra-virgin olive oil", "2 tablespoons olive oil, plus more for greasing pan and drizzling", "1 small onion, thinly sliced", "1 1/2 cups plain tomato sauce (look for passata, which is not a thick purée)", "Salt and pepper", "Pinch of red-pepper flakes, or to taste", "1 cup fine dry bread crumbs", "1 cup/85 grams grated pecorino or other sheep’s cheese (3 ounces)", "8 anchovy fillets, cut into 1-inch pieces", "Dried oregano, preferably Sicilian"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a mixing bowl or bowl of a stand mixer, put 1 cup lukewarm water and yeast. Add semolina and stir to make a thin paste. Let sit at room temperature for 5 minutes, until bubbly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add flour, salt and olive oil, and mix until dough becomes a rough mass. Knead dough until smooth, about 5 minutes. Dust with flour as needed, but don’t add much: This is meant to be a soft dough. Put kneaded dough in a resealable plastic bag or a bowl covered with plastic wrap, and refrigerate for at least 2 hours, preferably longer, up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Put 2 tablespoons olive oil in a skillet over medium-high heat. Add onion and cook, stirring, until translucent, about 5 minutes. Add 1/2 cup water, and raise heat to high. Simmer briskly until all the water has evaporated and onions are soft. Add tomato purée and bring to a simmer, then turn off heat. Season with salt and pepper, and add red pepper to taste. Allow mixture to cool, then stir in bread crumbs, grated cheese and anchovies. Let mixture rest for 5 minutes, then taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Drizzle olive oil to coat the bottom of a 9-by-13-inch rimmed baking sheet. Remove dough from refrigerator and press down to deflate. Using a rolling pin, flatten dough to a small rectangle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to oiled baking sheet, and, using the palms of your hands, stretch dough to the edges. If dough is rebellious and resists, let it rest for a few minutes, then stretch again. (It may take 2 or 3 attempts.) Cover dough loosely with plastic wrap or a damp tea towel, and set in a warm place to rise. After 30 minutes or so, dough should have doubled in thickness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the topping evenly over the dough, then use a spatula or the back of the spoon to spread the topping smoothly over entire surface, leaving a half-inch border. Drizzle surface with 2 to 3 tablespoons olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 30 to 35 minutes on the oven’s middle shelf, until nicely browned. Check the underside to make sure it is crisp, and bake for a few more minutes if necessary. (Tent top with foil if top has browned too quickly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from pan to a cutting board. Sprinkle with a little salt and a large pinch of oregano. Cut into 8 square slices. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1019786-fabrizia-lanzas-sicilian-pizza-sfincione"}