{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Cider Whoopie Pies", "description": "Their name may be fun to say, but whoopie pies aren’t really pies at all but rather soft, cakelike cookie sandwiches. These are inspired by a classic apple cider doughnut and, true to form, are dusted with cinnamon sugar. Apple cider that's been reduced and a bit of apple butter work in tandem to subtly flavor the fluffy cakes, and good old cream cheese frosting makes the ideal filling. For beautiful, uniformly sized cakes, use a 2-tablespoon cookie scoop to portion the batter for baking. If you don't have one, they might bake up a little wonky, but they’ll still taste delightful.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2018/10/18/dining/ss-apple-cider-whoopie-pies-horizontal/ss-apple-cider-whoopie-pies-horizontal-articleLarge.jpg", "totalTime": "PT55M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "cakes, cookies and bars", "keywords": "apple butter, apple cider, confectioners' sugar, cream cheese, dark brown sugar, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 504}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 326, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "10 grams", "sodiumContent": "238 milligrams", "sugarContent": "24 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 cup/300 milliliters apple cider", "1 1/2 cups/190 grams all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon kosher salt", "1/4 teaspoon baking soda", "1 1/2 teaspoons ground cinnamon", "1/2 teaspoon ground ginger", "1/2 teaspoon freshly ground nutmeg", "6 tablespoons/85 grams unsalted butter, at room temperature, plus 2 tablespoons melted", "1/2 cup/110 grams packed dark brown sugar", "1 large egg", "1/4 cup/60 milliliters apple butter", "1/4 cup/50 grams granulated sugar", "6 ounces/170 grams cream cheese, at room temperature", "3 tablespoons unsalted butter, at room temperature", "3 tablespoons confectioners’ sugar", "1/2 teaspoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Bring the apple cider to a boil in a small saucepan over medium-high heat. Continue to cook the cider until it has reduced to 1/4 cup/60 milliliters, about 16 to 18 minutes. Let cool completely. (You can pop the reduced cider in the fridge or freezer to cool faster while you continue.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together flour, baking powder, salt, baking soda, 1 teaspoon cinnamon, ginger and nutmeg. In a large bowl, with an electric mixer on medium, beat the room-temperature butter and brown sugar until fluffy, about 3 minutes, scraping the sides of the bowl as necessary. Add egg, apple butter and reduced apple cider, and beat until combined. Your batter may look like it has separated slightly, and that’s O.K. Add the dry mixture and mix just until combined, again scraping the bowl as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Portion the dough into 2-tablespoon scoops on 2 parchment-lined rimmed baking sheets, about 1 1/2-inches apart. Bake, rotating sheets halfway through, until the cakes are puffed and set, 12 to 14 minutes. Transfer sheets to racks. In a small bowl, whisk together the remaining 1/2 teaspoon cinnamon and the granulated sugar. Brush the tops of the warm cakes with a bit of the melted butter and gently toss them in the sugar mixture. Set aside to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, with an electric mixer on medium, beat the cream cheese and butter until smooth. Add the confectioners’ sugar and vanilla and beat to combine. Spread about 2 tablespoons of filling on the flat side of half of the cakes. Top with the other halves."}], "link": "https://cooking.nytimes.com/recipes/1019674-apple-cider-whoopie-pies"}