{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetarian Shepherd’s Pie", "description": "French green lentils (Puy lentils) make a hearty base for this vegetarian shepherd’s pie. They may be slighter harder to find than other lentils, but they’re worth the extra effort. Unlike brown or red lentils, green lentils retain their shape and texture after cooking, which means they stand up well to a long simmer and this rich potato topping. Store-bought vegetable stock can vary greatly so be sure to buy one with a pleasant flavor that isn’t too sweet. (Note: Parmigiano-Reggiano cheese contains rennet, so it is not vegetarian. Use a vegetarian Parmesan or leave it out. If you leave it out, be sure to season the potatoes well with salt and pepper.)", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2018/03/08/dining/08COOKING-VEG-SHEPHERDPIE1/08COOKING-VEG-SHEPHERDPIE1-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "irish", "recipeCategory": "dinner, casseroles", "keywords": "leek, lentils, mushroom, peas, potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1161}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 490, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "8 grams", "proteinContent": "14 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1149 milligrams", "sugarContent": "7 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 tablespoons kosher salt, plus more for seasoning", "2 pounds russet potatoes, peeled and quartered (about 3 large)", "6 tablespoons unsalted butter", "1/2 cup whole milk", "1/2 cup sour cream", "1/2 cup packed grated Parmigiano-Reggiano cheese or vegetarian Parmesan (optional)", "Freshly ground black pepper", "3/4 cup French lentils", "4 sprigs thyme", "3 1/2 cups vegetable broth", "1 teaspoon kosher salt, plus more for seasoning", "4 tablespoons butter", "8 ounces sliced mixed mushrooms, such as button, cremini, and shitaake", "1 large leek, white part only, thinly sliced (about 1 1/2 cups)", "2 medium carrots, peeled and diced (about 1 cup)", "2 cloves garlic, minced", "Freshly ground black pepper", "2 tablespoons tomato paste", "2 tablespoons flour", "1 cup frozen peas, thawed", "1 to 2 teaspoons fresh lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, bring a gallon of water and 2 tablespoons salt to a boil over high heat. Add potatoes to boiling water and boil for about 15 to 20 minutes, until soft; a knife should go in with almost no resistance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the filling: In a 10-inch oven-safe skillet with high sides or an enameled cast-iron braiser over medium-high heat, bring the lentils, thyme and 2 cups of the broth to a simmer with 1 teaspoon salt. Reduce the heat and continue to cook the lentils, partly covered, until they are tender and most of the liquid is absorbed, about 20 minutes. Transfer the lentils to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the topping: In a small saucepan or a microwave oven, heat 6 tablespoons of the butter and milk together until butter melts. Drain potatoes well and return to pot. Using a masher or a ricer, mash hot potatoes until smooth. Mix in the hot butter mixture and sour cream just until blended. Stir in 1/2 of the Parmigiano. Season to taste with salt and pepper. Cover and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the filling: Heat the oven to 375 degrees. Melt the butter in the 10-inch skillet over medium-high heat. Add the mushrooms and cook, stirring often with a wooden spoon, until they are deep golden brown, about 8 to 10 minutes. Reduce the heat to medium and add leeks, carrots and garlic, and continue to cook until tender, another 10 minutes. Season to taste with salt and pepper. Add the tomato paste and stir, cooking until it is well combined, another 2 to 3 minutes. Sprinkle flour over the mixture, stir and cook for 1 minute. Add remaining 1 1/2 cups broth, cooked lentils and peas, and cook until thickened. Remove thyme stems and stir in lemon juice to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top the mixture with dollops of the mashed potatoes, then spread them out over the top. (Or transfer the lentil mixture to a 3-quart casserole dish and spread into an even layer, and top with potatoes.) Sprinkle with the remaining Parmigiano. Transfer to the oven and, if the mixture is at the top edges of your pan, set a foil-lined baking sheet underneath the pan to catch any drips. Bake the pie until the potatoes have begun to brown and the edges are bubbling, about 30 minutes. Let stand at room temperature for 15 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1019221-vegetarian-shepherds-pie"}