{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Chicken Breast With Potatoes and Capers", "description": "Pan-seared chicken is a skill with countless rewards. (If this is your first time making chicken this way, you’ll understand why fast.) You'll want to start the chicken on the stovetop and finish it in the oven. Then, once it's perfectly cooked, you can pair it with almost anything, whether a simple green salad or a side of smashed potatoes loaded with butter, mustard, capers and chopped lemon, as it is here. The trick is to steam, not boil, the potatoes, which gets them soft and smashable quickly. You need very little water (an inch or so), so there’s no waiting around for water to boil, and, best of all, you won’t lose any of that rich potato flavor.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2018/09/16/dining/sc-chicken-breast-potatoes/sc-chicken-breast-potatoes-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry", "keywords": "capers, chicken breast, dijon mustard, potato, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 97}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 497, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "5 grams", "proteinContent": "37 grams", "saturatedFatContent": "8 grams", "sodiumContent": "941 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 boneless, skin-on chicken breasts (6 to 8 ounces each)", "2 teaspoons kosher salt, plus more to taste", "Black pepper", "1 1/2 pound small potatoes, washed and scrubbed (skin on), about 12 potatoes", "1 tablespoon canola oil", "1 lemon", "1 tablespoon Dijon mustard", "2 tablespoons unsalted butter, melted", "1 tablespoon capers, drained", "1/4 cup chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees with the oven rack in the center. Pat the chicken breasts dry and season generously with 1/2 teaspoon salt and 1/2 teaspoon pepper. Set aside for the skin to air dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, steam the potatoes in a steamer set over an inch or two of boiling water, covered, until they are just tender, about 10 to 15 minutes.<strong></strong> Remove from the heat, season well, and set aside, covered, to stay warm and moist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of oil in your largest skillet over high heat. When the oil is shimmering, lay the chicken breasts skin-side down. Cook without moving until the skin is deeply golden brown and releases easily from the pan, 5 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully flip the breasts and transfer the skillet to the oven (or cook the breasts in batches, if needed, and transfer the four breasts to a baking sheet to finish in the oven). Cook until the juices run clear and an instant-read thermometer inserted into the thickest part of the chicken registers 165 degrees, about 7 to 12 minutes, depending on the thickness of each breast. Remove the chicken from the oven and transfer to a cutting board to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chicken cooks, transfer the potatoes to a baking sheet and smash them with a baking sheet of equal size, or the back of a clean pot, to burst their skins and reveal some of the tender flesh. Very thinly slice half of the lemon and chop slices into small pieces; juice the other half and whisk together with the Dijon, 1/2 teaspoon salt and melted butter to make a smooth dressing. Drizzle over the potatoes. Scatter the capers, chopped lemon and parsley all over the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the chicken breasts whole, or slice on the bias and serve with the potatoes."}]}