{"@context": "http://schema.org", "@type": "Recipe", "name": "Thin and Crisp Apple Tart", "description": "This French-style apple tart is topped with nothing but fruit and a squeeze of lemon juice. Make it with homemade rough puff pastry, or a store-bought sheet of puff pastry, and use a mandolin or a sharp knife to slice the apples finely, so they're almost see-through, then crowd the slices on the tart as closely as you can. Don't skip buttering and sugaring the parchment paper in the beginning, which gives the crust a touch of smoky caramel all along the bottom.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/10/29/magazine/29Fondue-recipes2/29Fondue-recipes2-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "apple, lemon, puff pastry, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 190}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 110, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "2 grams", "proteinContent": "0 grams", "saturatedFatContent": "3 grams", "sodiumContent": "55 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 apples", "1 lemon, zest and juice", "1/4 teaspoon salt", "4 tablespoons butter", "4 tablespoons sugar", "1 sheet store-bought puff pastry", "1/4 teaspoon cinnamon powder, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel, core and cut apples on a mandoline, so the slices are extremely thin, without being see-through. In a large bowl, toss the apple slices with lemon zest, lemon juice and salt, and set aside. Heat the oven to 400, and line a sheet pan with parchment paper. Use about 1 tablespoon of butter to grease the parchment. Sprinkle the buttered surface evenly with 2 tablespoons sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the puff pastry to about the size of the sheet pan, using a light dusting of flour if the dough is sticky, then place on top of the parchment. Arrange the apple slices on top of the pastry so that they overlap in rows, crowding as much apple in as you can and going all the way to the edges of the pastry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 25 minutes, then cut remaining butter into 8 or so pieces and scatter over the top of the apples. Mix the remaining sugar with cinnamon, if using, and sprinkle evenly all over the top. Return tart to the oven for 10 to 15 minutes more, or until the apples are tender and just starting to color at their edges and the pastry is brown and cooked through underneath (lift a corner to check). If you want to color the apples more, leave the tart under the broiler for a minute or two. Using the parchment paper to lift the tart out, gently slide it out of the pan and onto a cooling rack. Let it to come down to room temperature before slicing."}]}