{"@context": "http://schema.org", "@type": "Recipe", "name": "Indian-Spiced Eggs With Spinach and Turmeric Yogurt", "description": "In this quick meal, sautéed spinach flecked with ginger, chile and garam masala are paired with eggs and used to top toasted pitas spread with turmeric yogurt. The pitas were chosen for their uniform size, but naan or flatbread would work equally well; you want something sturdy to stand up to the moisture of the yogurt and spinach. An olive oil-fried egg tops this dish, but if you prefer poached have at it — that runny yolk is a key element.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/11/01/dining/CH-IndianSpicedEgg-horizontal1/CH-IndianSpicedEgg-horizontal1-articleLarge-v2.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, quick, weekday, weeknight, vegetables", "keywords": "eggs, garam masala, greek yogurt, pita, spinach, turmeric, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 134}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 430, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "8 grams", "proteinContent": "21 grams", "saturatedFatContent": "6 grams", "sodiumContent": "732 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup full-fat Greek yogurt", "1 teaspoon ground turmeric", "Kosher salt", "4 (6- to 8-inch) round pitas", "3 tablespoons olive oil", "1 tablespoon finely chopped ginger", "2 garlic cloves, thinly sliced", "1 medium fresh chile, such as cayenne or Serrano, thinly sliced (or 1/2 teaspoon red-pepper flakes)", "1 1/2 teaspoons garam masala", "1 pound baby spinach", "4 large eggs", "Black pepper", "1 tablespoon roughly chopped cilantro (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Mix the yogurt and turmeric in a small bowl, season with salt and set aside. Toast the pitas on a sheet pan in the oven until they’re warmed through and beginning to crisp, about 10 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 1 tablespoon of olive oil in a 12-inch skillet over medium heat. Add the ginger, garlic and chile and cook until softened, about 1 to 2 minutes. Stir in the garam masala and cook until fragrant, about 30 seconds more. Begin adding in the spinach by the handful, tossing it frequently to encourage wilting. Gradually add more as it cooks down, about 6 to 8 minutes total. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the spinach cooks, heat the remaining 2 tablespoons oil in a nonstick skillet over medium heat. Crack the eggs into the skillet and season with salt and pepper. Cook until the undersides are crispy and the yolk is still runny, about 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the turmeric yogurt on the toasted pitas and top each with spinach and then a fried egg. Scatter cilantro over the top, if using, and serve."}], "link": "https://cooking.nytimes.com/recipes/1019702-indian-spiced-eggs-with-spinach-and-turmeric-yogurt"}