{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate-Cardamom Pots de Crème", "description": "Rich and creamy with a hit of floral cardamom, these puddings are a perfect make-ahead dessert. For the most flavor, make sure to break open the cardamom pods and crush the seeds using a mortar or pestle or the handle of a wooden spoon. Semisweet chocolate is recommended, as bittersweet will mask the cardamom, but they are interchangeable if you prefer chocolate with a higher cacao percentage. (Accordingly, you may want to use the higher amount of cardamom if cooking with bittersweet chocolate, but do go easy: A little cardamom goes a long way.) You’ll need to use chopped chocolate bars or chocolate fèves for these pots de crème. Chocolate chips are made with stabilizers that inhibit melting, so would result in a pudding that is less smooth and spoonable.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2019/02/01/dining/ya-chocolate-cardamom-pots-de-creme/merlin_149553582_59f1796b-e1e4-483f-8885-b9c789c00f2c-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "custards and puddings", "keywords": "cardamom, chocolate, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 110}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 371, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "19 grams", "sodiumContent": "72 milligrams", "sugarContent": "18 grams", "transFatContent": null}, "recipeIngredient": ["2 cups/480 milliliters heavy cream", "3 to 5 green cardamom pods, crushed, or 1/2 to 1 teaspoon ground cardamom", "1 cup/240 milliliters whole milk", "6 ounces/170 grams semisweet or bittersweet chocolate bars or fèves (not chips), finely chopped", "4 large egg yolks", "1 teaspoon vanilla extract", "1/8 teaspoon kosher salt", "2 tablespoons granulated sugar, plus more for the whipped cardamom cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the heavy cream and cardamom in a medium saucepan. Heat over medium-high until just boiling. Turn the heat off, cover and steep until infused, 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange a rack in the center of the oven and heat oven to 300 degrees. Arrange 6 to 8 (4- to 6-ounce) oven-safe ramekins in a roasting pan or large baking dish at least 2 inches deep."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the infused cream through a fine-mesh sieve to remove the cardamom pods. Wipe out the saucepan. Add 1 cup/240 milliliters of the infused cream to the saucepan along with the whole milk. Chill remaining infused cream in an airtight container in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the cream and milk mixture to a boil, then remove from the heat. Add the chopped chocolate and whisk until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the egg yolks, vanilla, salt and 2 tablespoons sugar and whisk by hand or using an electric mixer until pale yellow, foamy and thickened, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisking constantly, slowly pour the warm chocolate mixture into the egg mixture until well combined. Transfer the custard to a measuring cup or other container with a spout. You should have about 4 cups of custard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the custard among the ramekins and carefully transfer the roasting pan to the oven. Pour hot tap water into the roasting pan until it reaches halfway up the sides of the ramekins. Tent the pan with a piece of aluminum foil and use a fork or paring knife to poke a few holes in the foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the pots de crème until the tops are set but still jiggly, 35 to 45 minutes, depending on the size of the ramekins. The custard will puff up slightly as it bakes, then deflate as it cools. Remove the foil, and let the pots cool in the pan for a few minutes, until they are easier to handle, then transfer them to a rack to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to the refrigerator and chill until completely cool, at least 2 hours. (These can be made up to 2 days in advance.) Cover each ramekin with plastic wrap if you plan to keep them in the refrigerator for more than a couple of hours after they have cooled. To serve, whisk reserved infused cream to soft peaks (it will be loose) with 1 to 2 teaspoons sugar and top each pot de crème with a dollop of cream."}], "link": "https://cooking.nytimes.com/recipes/1019976-chocolate-cardamom-pots-de-creme"}