{"@context": "http://schema.org", "@type": "Recipe", "name": "Shortcut Chilaquiles", "description": "Chilaquiles, a traditional Mexican dish made with fried tortillas simmered in red or green salsa, has become a popular breakfast item because it begs to be topped with a couple of fried eggs. This cheater's version is made with a fresh tomato (or tomatillo) salsa that doesn't require a blender, and tortilla chips or broken tostadas instead of fried tortillas. The perfect texture here is softened but not soggy; you want to make sure the chips are tossed evenly with the sauce, but not so much that they get lost in it. Fried eggs are the perfect complement here, as the crisp-edged white provides texture and the yolk a rich sauciness. But it would be just as delicious served underneath or alongside a pile of soft scrambled eggs.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/01/30/dining/30COOKING-CHILAQUILES-ROJOS/30COOKING-CHILAQUILES-ROJOS-mediumThreeByTwo440.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, lunch, weekday, weeknight", "keywords": "eggs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 236}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 542, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "5 grams", "proteinContent": "16 grams", "saturatedFatContent": "7 grams", "sodiumContent": "815 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 small red or yellow onion, thinly sliced into rings", "2 tablespoons fresh lime juice, plus more if desired", "Kosher salt and freshly ground pepper", "4 tablespoons vegetable oil", "2 garlic cloves, thinly sliced", "1 1/2 pounds tomatoes, cored and sliced into 1-inch wedges", "1 small Serrano or jalapeño chile, seeds removed if you like, finely chopped (optional)", "6 ounces tortilla chips or tostadas, broken up into chip-size pieces", "4 large eggs", "4 ounces queso fresco, crumbled", "1 cup cilantro, tender leaves and stems", "1/2 cup crema (or sour cream, thinned with a bit of water) (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place half the onions in a small bowl and cover with lime juice. Season with salt and pepper, toss and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large skillet (12-inch works well) over medium-high heat. Add remaining onions and garlic and season with salt and pepper. Cook, stirring occasionally until they are tender and starting to brown, about 4 minutes. Add tomatoes and half of chile (if using) and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, stirring occasionally, until the tomatoes have started to burst and simmer in their own juices, 5 to 8 minutes. Add 1 cup of water and continue to simmer until tomatoes are totally softened and melted down, another 5 to 8 minutes; larger bits of the skin are O.K., but they should feel mostly broken down into a nice, thick sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chips and toss to coat evenly. Simmer a minute or two and remove the pan from the heat while you fry the eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining 2 tablespoons oil in another large skillet over medium-high heat. Add eggs and season with salt and pepper. Cook, undisturbed, until the whites of the egg are fried and lightly crisped but the yolks are still bright orange and runny, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide chips among plates and top with fried egg, queso fresco, cilantro, crema, remaining green chile, reserved red onions and a squeeze of lime if you like."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Shortcut Chilaquiles", "description": "Throw together an inauthentic (but still totally delicious) version of the classic Mexican dish.", "thumbnailUrl": "https://static01.nyt.com/images/2018/01/30/dining/30COOKING-CHILAQUILES-ROJOS/30COOKING-CHILAQUILES-ROJOS-mediumThreeByTwo440.jpg", "uploadDate": "2018-03-15T17:40:46.000Z", "duration": "PT1M23S"}, "link": "https://cooking.nytimes.com/recipes/1019044-shortcut-chilaquiles"}