{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Meringue Tart", "description": "The celebrated pastry chef Dolester Miles learned to bake in a small town called Bessemer, outside Birmingham, Ala. She took the tastes of Southern desserts passed down from her mother and her aunt, and elevated them with fine-dining technique she has picked up in her more than 30 years at the Birmingham restaurants Highlands Bar & Grill, Chez Fonfon and Bottega Café. This lemon meringue tart, reminiscent of a Southern icebox cake but with a French feel, is a perfect example. She stirs in white chocolate to give the curd a luscious mouth feel, and finishes it with a drift of soft Swiss meringue toasted with a blowtorch. A few seconds under the broiler will work, too. She cautions cooks never to take their eyes off the tart during that final step. “It’ll get away from you fast,” she said.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2018/05/30/dining/30pastryrex1/30pastryrex1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "dessert, lemon, white chocolate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 326}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 388, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "12 grams", "sodiumContent": "115 milligrams", "sugarContent": "34 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 cups/191 grams all-purpose flour", "2/3 cup/82 grams confectioners’ sugar", "1/2 teaspoon kosher salt", "1/2 cup/113 grams cold unsalted butter (1 stick), cubed", "2 egg yolks", "4 large eggs", "1 1/4 cups/252 grams granulated sugar", "Zest from 2 lemons", "1/2 cup plus 1 tablespoon lemon juice", "1/2 cup/113 grams unsalted butter (1 stick), cut into large pieces", "4 ounces white chocolate, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor, place flour, confectioners’ sugar and salt, and quickly pulse to combine. Add butter and pulse until the mixture resembles coarse bread crumbs, then add egg yolks and pulse until the dough comes together. Form the dough into a disc, wrap in plastic and chill for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out dough on a lightly floured surface to a thickness of 1/8 inch, then transfer it into a 9 1/2-inch tart pan with a removable bottom. Press the dough evenly over the bottom and up the sides of the pan, then trim it by rolling your rolling pin over the top of the tart pan edge. Pierce crust all over with a fork and freeze for 30 minutes. Remove from freezer, place tart pan on a baking sheet, and bake for about 20 minutes until golden. Remove tart from baking sheet and let pan cool slightly on a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the filling: Separate the eggs, saving 3 of the whites to use in the meringue. In a small saucepan, stir together 1/2 cup/101 grams sugar, the lemon zest and juice and the egg yolks. Cook over medium heat, whisking constantly, until quite warm. Stir in butter and continue to cook, whisking to prevent burning, for about 7 to 10 minutes or until the mixture becomes thick. Remove from heat and stir in the white chocolate until it melts into the mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour lemon mixture through a fine-mesh strainer into a medium bowl and use a spatula to press until just the solids remain. Discard the solids. Spoon mixture into the prepared tart shell and chill for 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meringue: Set up a double boiler and bring the water in the bottom pan to a boil over medium-high heat. Combine the 3 egg whites with 3/4 cup/151 grams sugar in the top of the double boiler and whisk constantly until the sugar has dissolved and the mixture is hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the meringue mixture into the bowl of a stand mixer fitted with the whisk attachment. Whip at medium-high speed for about 2 minutes then increase speed to high and whip for about 4 to 6 minutes more or until the mixture is stiff. Spoon meringue over tart and spread with an offset spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a kitchen torch, brown the meringue lightly, holding the torch about 2 inches away from the tart. Alternatively, place tart under a preheated broiler with the oven rack placed 8 inches from the heat source. Broil 30 to 45 seconds, watching carefully so the meringue turns golden brown and does not burn. Remove tart ring and serve immediately."}]}