{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Rice Noodles With Crispy Tofu and Spinach", "description": "Herby noodles, chile oil and crisp tofu come together in this spicy, filling bowl that will disappear before you know it. But the component parts are just as valuable on their own: Make crisp baked tofu once, and you may never pan-fry cubes again. Make a scallion-basil paste on your cutting board, and forget about pesto from the food processor. And make a little extra spicy sesame oil, so that you can swirl it into scrambled eggs and smashed cucumber salads.", "author": {"@type": "Person", "name": "Sarah Jampel"}, "image": "https://static01.nyt.com/images/2018/08/08/dining/rice-noodles/rice-noodles-articleLarge-v2.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, noodles", "keywords": "basil, firm tofu, rice noodles, scallion, spinach, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 450}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 604, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "4 grams", "proteinContent": "19 grams", "saturatedFatContent": "5 grams", "sodiumContent": "512 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["12 to 14 ounces firm tofu", "1/2 to 1 teaspoon kosher salt", "1 tablespoon peanut or vegetable oil", "2 teaspoons sesame oil", "1 tablespoon cornstarch", "1 tablespoon panko (Japanese bread crumbs)", "1 tablespoon sesame seeds (optional)", "8 ounces wide rice noodles", "3 tablespoons sesame oil", "3 tablespoons peanut oil", "1 garlic clove, thinly sliced", "1 (1-inch) piece of ginger, peeled and thinly sliced", "1 1/2 teaspoons to 1 tablespoon red-pepper flakes, to taste", "1 tablespoon sesame seeds, plus more for garnish (optional)", "1 teaspoon kosher salt", "1 cup roughly chopped basil, packed", "3 large or 4 small scallions, roughly chopped", "3 cups baby spinach, packed", "1/2 lime", "Toasted sesame oil, for drizzling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees and line a baking sheet with parchment paper. As the oven heats, press the tofu (you can do this by sandwiching the block in paper towels and placing a cutting board, plus a heavy pot, can or book on top). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tofu into 1/2-inch cubes and place in a medium bowl. Add the salt and oils, and toss to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the cornstarch, panko and sesame seeds, if using, and toss gently so the tofu cubes are coated. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread on the prepared sheet and bake for 30 to 35 minutes, flipping once, until golden-brown and crisp. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the tofu bakes, start the noodles: Put the dry rice noodles in a big, wide bowl. Fill a kettle, bring the water to a boil, and pour the boiling water over the noodles to cover. Set aside for 6 to 10 minutes, until the noodles are fully rehydrated and soft. (Time may vary by brand.) Then drain, rinse with cold water, and drain again. Transfer noodles to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the noodles soak, prepare the spicy sesame oil: In a small pot, combine sesame oil, peanut oil, garlic, ginger, red-pepper flakes and sesame seeds. Bring to a boil, then reduce to a simmer and cook on the lowest heat for 10 to 12 minutes, until the garlic slices turn golden. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, on your cutting board, make a small mound with the teaspoon of salt. Place the basil and the scallions on top, and use your knife to furiously chop and smash until you have a rough paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the basil paste into the bowl of rice noodles. Pile the baby spinach on top. Pour at least half of the hot oil immediately over the spinach, tossing so that the heat wilts the leaves slightly. Then add the juice of the 1/2 lime and toss to combine. Taste for salt and lime juice, and add more oil as you see fit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the tofu on top of the noodles, or mix them in so that the cubes hide like little treasures. For extra flair, garnish with additional sesame seeds and a drizzle of toasted sesame oil."}], "link": "https://cooking.nytimes.com/recipes/1019461-spicy-rice-noodles-with-crispy-tofu-and-spinach"}