{"@context": "http://schema.org", "@type": "Recipe", "name": "Homemade Green Bean Casserole", "description": "If you think you don’t like green bean casserole, withhold judgment until you’ve tried this entirely from-scratch version. It has all the classic elements of the Thanksgiving favorite, but its base is a mushroom gravy amped up with red-wine vinegar, red-pepper flakes and fresh thyme rather than a can of soup. If you don’t want to fry the onions yourself (we understand), you can always substitute 1 1/2 cups store-bought fried onions or even crispier fried shallots.", "author": {"@type": "Person", "name": "Sarah Jampel"}, "image": "https://static01.nyt.com/images/2018/11/13/dining/sj-green-bean-casserole/sj-green-bean-casserole-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "casseroles", "keywords": "fall, winter, green beans, mushroom, thyme, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 319}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 390, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "5 grams", "sodiumContent": "462 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 medium yellow onions (about 14 to 16 ounces), halved and thinly sliced with a sharp knife or mandoline", "1/4 cup all-purpose flour", "2 tablespoons bread crumbs (panko or regular)", "1 teaspoon kosher salt", "High-heat oil, like canola, safflower or vegetable, for frying", "3 tablespoons unsalted butter, plus more for greasing the dish", "1 teaspoon kosher salt, plus more for the blanching water", "1 1/2 pounds green beans, trimmed and halved", "1/2 teaspoon red-pepper flakes", "1 tablespoon fresh thyme leaves", "12 ounces mixed mushrooms (like a mix of cremini and shiitake), trimmed and sliced into 1/2-inch pieces", "2 garlic cloves, thinly sliced", "3 tablespoons all-purpose flour", "1 1/2 cups chicken stock or vegetable broth", "1 1/2 cups milk", "1 pinch ground nutmeg", "1/4 teaspoon black pepper", "1 teaspoon red-wine vinegar or sherry vinegar", "1 teaspoon Worcestershire or soy sauce (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the onions: In a medium bowl, combine the onions with the flour, bread crumbs and salt, and toss to coat the onion pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy skillet with high sides, pour enough oil to reach 1/2-inch up the side. Heat over medium-high until the oil is hot — a drop of water should sizzle and sputter when flicked into the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onions in batches, taking care not to overcrowd them. Fry until golden-brown (they don’t have to be deep brown, as they’ll continue cooking in the oven), about 5 to 6 minutes, then use a slotted spoon or a pair of tongs to transfer to paper towels. Sprinkle lightly with salt. Repeat until you’ve fried all of the onions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a shallow 4-quart baking dish and heat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch the green beans: Bring a large pot of water to a boil with an ice bath nearby. When boiling, salt the water generously, add the green beans, and cook for 4 to 5 minutes, until slightly tender and bright green. Immediately transfer beans to the ice bath. When beans are chilled, drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour water out of the pot, wipe dry and return to the stovetop. Over medium-high heat, melt 3 tablespoons butter. When melted, add the red-pepper flakes and thyme, and stir until fragrant, about 1 minute. Add the sliced mushrooms and cook, stirring occasionally, until they start to brown significantly, 8 to 10 minutes. Add 1 teaspoon salt and sliced garlic and stir until fragrant, another 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the flour all over and stir to coat the mushrooms. Gradually add the stock and milk, and bring to a simmer, stirring all the while. Turn the heat down to medium and continue to stir until the sauce is thick and creamy and coats the back of a spoon, 6 to 8 minutes. Remove from heat. Add nutmeg, black pepper, vinegar and Worcestershire, if using. Taste for salt, pepper and acidity."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the green beans and half of the onions, stir to combine, and transfer to prepared baking dish. Top with remaining onions and bake for 15 to 20 minutes, until bubbling. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1019749-homemade-green-bean-casserole"}