{"@context": "http://schema.org", "@type": "Recipe", "name": "Mango Royale", "description": "For the chef Isa Fabro of IsaMADE in Los Angeles, the use of super-ripe Manila mangoes (native to the Philippines) is central to this no-bake dessert, as the fruit has a unique deep honey taste, a creamy texture with virtually no fibers, and a heavy aroma. If using Kent or Haden mangoes, remove any excess fiber and add lime; the extra acid complements their flavor, but will compete with the Manila mangoes. As long as the mangoes are super-ripe, even over-ripe, the dish will be fine. If not, the mango flavor will become dulled and lost in the cold of the freezer. If ripe mangoes aren’t available, frozen ones can be used once defrosted.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2018/03/14/dining/14filipinorex1/14filippinorex1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "One 9 1/2-inch pie", "recipeCuisine": "filipino", "recipeCategory": "cakes", "keywords": "dessert, graham cracker, mango", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 340}, "recipeIngredient": ["3/4 cups/170 grams unsalted butter (1 1/2 stick)", "2 sleeves/269 grams graham crackers (about 9 1/2 ounces)", "2 cups heavy whipping cream", "1/2 cup sweetened condensed milk", "6 to 8 soft ripe Manila mangoes (a.k.a. Ataulfo or Champagne) or 3 to 4 soft ripe large mangoes (Haden or Kent)", "1 to 2 tablespoons lime juice (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pan, melt the butter over medium heat. Cook the butter, occasionally scraping the pan, until it turns deep golden brown, being careful not to let it burn. Remove from the heat and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulse crackers in a food processor until finely ground. Pour into a medium bowl and add brown butter. Mix until well combined and texture is like wet sand. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously spray a 9 1/2-inch glass pie plate with cooking spray. In a stand mixer fitted with the whisk attachment, pour the cream into the mixing bowl and whip on medium speed. Slowly drizzle in sweetened condensed milk, then beat to stiff peaks. (Beating on medium takes longer, but helps build a stable structure.) Set aside and chill until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut cheeks from mangoes parallel to center pits. Scoop out flesh from cheeks with a spoon and slice flesh from pits. Coarsely purée fruit in a clean food processor. Measure 2 cups (save extra for other uses). If you like, add lime juice so purée tastes sweet-tart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle about 2/3 of the graham crumbs into the pie plate. Using your fingers and the palm of your hand, press to create an even layer on the bottom and sides of the plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dollop half the whipped cream mixture on top, carefully spreading the cream evenly without stirring up crumbs. Spoon half of the mango purée on top and spread evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle all but a few tablespoons of the remaining crumbs on top. Repeat cream and mango layers. Sprinkle top with remaining crumbs but don't smooth down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Loosely wrap dessert with plastic wrap and freeze until firm, about 8 hours, or overnight. Can be made ahead up to this point and kept frozen for 2 weeks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, let thaw in fridge the night before serving, or let stand at room temperature for 45 minutes to 1 hour. Serve in wedges or scoops, making sure to scrape up the crumbs from the bottom of the plate."}], "link": "https://cooking.nytimes.com/recipes/1019214-mango-royale"}