{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta Aglio Olio With Butternut Squash", "description": "Stubborn butternut squash often resists being peeled or even cut. Its eventual smooth sweetness is worth it, but what if you could skip the whole having-to-be-patient part? By sautéeing a big pile of grated butternut squash, you’re on the fast-track to tender squash. From there, you need only some spice, garlic and oil to turn it into a belly-warming pasta sauce that's equally at home spooned onto warm or room-temperature grains — or on its own as a kind of squash purée. But don’t think you’re making baby food: This is a sophisticated pasta, silky but still has some bite, a sneaky heat and brightness from lemony nuts on top, which may just be the dish's secret star.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2018/09/14/dining/as-aglio-olio-2/as-aglio-olio-2-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, weeknight, pastas", "keywords": "butternut squash, cavatappi, nuts, fall, winter, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 586}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1000, "unsaturatedFatContent": "45 grams", "carbohydrateContent": "112 grams", "cholesterolContent": null, "fatContent": "55 grams", "fiberContent": "9 grams", "proteinContent": "20 grams", "saturatedFatContent": "8 grams", "sodiumContent": "841 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup roughly chopped, toasted nuts (preferably hazelnuts, almonds or pecans)", "2 tablespoons freshly squeezed lemon juice (from about half a lemon)", "3/4 cup plus 1 tablespoon extra-virgin olive oil", "Kosher salt and black pepper", "1 pound cavatappi or other curly pasta", "5 garlic cloves, thinly sliced", "1/2 teaspoon chile flakes", "5 packed cups butternut squash, from 1 (2-pound) squash, peeled and grated using the large holes on a box grater or food processor"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of heavily salted water to a boil. Meanwhile, in a small bowl, stir together the nuts, lemon juice and 1 tablespoon olive oil, seasoning to taste with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "  Once the water’s boiling, add the pasta and cook until al dente according to package directions. As the pasta cooks, make the sauce: In a sauté pan or skillet large enough to hold all the pasta,  cook 3/4 cup olive oil, garlic and chile flakes over medium heat until the garlic turns blond, about 2 minutes, adjusting heat as needed to avoid burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " Add the squash and a pinch of salt and pepper and cook, stirring occasionally and pressing down on the mixture so it steams, until softened, about 5 minutes. Remove 1 cup of water from the pasta pot. Add 3/4 cup of the pasta water to the sauce, and let simmer until the water evaporates and a glossy sauce forms, about 2 minutes. Turn the heat to low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pasta is done, drain and immediately dump it into the sauce, tossing to coat. Adjust with salt, pepper and remaining pasta water. Serve with the nuts on top."}], "link": "https://cooking.nytimes.com/recipes/1019553-pasta-aglio-olio-with-butternut-squash"}