{"@context": "http://schema.org", "@type": "Recipe", "name": "Daniel Skurnick’s Franco-Chinese Steamed Ginger Custard", "description": "This custard, a mix of French and Chinese techniques and tastes, comes from the New York pastry chef Daniel Skurnick. Because Mr. Skurnick is responsible for the desserts at the French restaurant Le Coucou and the pan-Asian restaurant Buddakan, this kind of blending comes easily to him. Here, he uses just five ingredients to make a dessert that is packed with the flavor of ginger and has the quintessential jiggle and litheness of custard. It reminds me most of an oven-baked French crème caramel, but it’s steamed, the way many Asian desserts are. If you have a bamboo steamer that fits over a wok, this is the time to use it – its flat bottom is perfect for this job. If all you have is a steamer insert, don’t despair – just make the dessert in two batches. Once chilled, the custards are lovely plain, but for a bit more polish, pour over a few spoonfuls of <a href=\"https://cooking.nytimes.com/recipes/1019460-spiced-caramel-syrup\">spiced caramel syrup</a>.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2018/08/12/magazine/12mag-on-dessert-image1/12mag-on-dessert-image1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "chinese, french", "recipeCategory": "custards and puddings", "keywords": "dessert, egg, ginger, milk", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 143}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 128, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "0 grams", "proteinContent": "5 grams", "saturatedFatContent": "4 grams", "sodiumContent": "42 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["About 3 ounces (85 grams) fresh ginger, peeled and frozen", "4 large egg yolks", "2 tablespoons sugar", "1 1/2 cups (360 milliliters) whole milk", "1/2 cup (120 milliliters) half and half"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up a steamer. The best choice is a large bamboo steamer over a wok. If you have a smaller collapsible steamer insert that fits into a pot, you’ll probably have to make the custard in two batches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add water to the wok or pot, and bring to a boil; keep at a simmer. Set out 6 6-ounce heatproof custard cups, teacups or bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a strainer over a bowl, and using a fine rasp-type grater, grate the ginger into the strainer. Push the ginger through the strainer. You need 2 teaspoons of juice. If some pulp is included, that’s fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, gently whisk the yolks and sugar together until blended. Whisk in the milk, the half and half and the ginger juice. Strain the mixture into the 6-ounce cups or bowls. Seal each with a piece of microwave-safe plastic wrap or foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cups in the steamer, cover the steamer or pot and adjust the heat so that the water is at a steady medium simmer. Steam about 17 to 22 minutes, until the custards are set. Tap the cup lightly to test for doneness; it’s O.K. if you have a small wobbly spot in the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Very carefully transfer the cups to a rack, uncover and let rest for about 15 minutes. Refrigerate for at least 2 hours, or cover and chill for as long as 1 day. Repeat with the rest of the batch, if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve cold, with or without the spiced caramel syrup poured over."}], "link": "https://cooking.nytimes.com/recipes/1019459-daniel-skurnicks-franco-chinese-steamed-ginger-custard"}