{"@context": "http://schema.org", "@type": "Recipe", "name": "Ashure Cereal", "description": "According to legend, when his Ark made landfall, Noah’s family threw whatever was left in the larder into a pot and transformed it into ashure, a celebratory pudding of grains, nuts, seeds and dried fruits. The cereal is eaten throughout the Middle East, but especially in Turkey, where the dish somehow transcends typical religious tensions and holds significance for Jews, Christians and Muslims alike. But according to Sarit Packer, co-chef of London’s Honey & Co. restaurant, “It’s actually quite disgusting.” Ashure is essentially a porridge, so when it cools down, it gets stiff and gloopy, like cold oatmeal. Guided by her memory of the sugary, crisp grain cereals she tasted when she first visited the United States as a child, Ms. Packer tweaked the recipe. She made a honey syrup spiked with all of the classic ashure flavorings, including cinnamon, cardamom and a spice called mahaleb (available at your local Middle Eastern grocery store or online). She drizzled the syrup over a mixture of puffed wheat, nuts and seeds, and baked the whole thing into a gloriously crisp mass. Her version looks like cross between granola and Cracker Jack, with dark, shiny brown clusters of puffed wheat, almonds, pecans and seeds. It’s somehow simultaneously light and rich, sweet and savory, crisp and full of air. Serve it as Ms. Packer does, over yogurt with fresh berries or pomegranate seeds, eat it as her parents do, drowned in a bowl of milk, or just sneak some out of the bag anytime you want a crunchy snack.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2018/12/09/magazine/09mag-eat-image2/09mag-eat-image2-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "About 10 cups", "recipeCuisine": "middle eastern", "recipeCategory": "breakfast, easy, quick, grains and rice, one pot", "keywords": "almond, cardamom, pecans, puffed wheat, pumpkin seeds, sesame seeds, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 226}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 302, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "139 milligrams", "sugarContent": "17 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup/85 grams neutral-tasting oil, such as canola", "6 tablespoons/110 grams honey", "1/2 cup/110 grams dark brown sugar, packed", "1 teaspoon fine sea salt", "1 teaspoon ground cinnamon", "1/2 teaspoon ground mahaleb", "1/2 teaspoon ground cardamom", "10 cups/160 grams puffed wheat", "Scant 3/4 cup/85 grams halved pecans", "1/3 cup/50 grams pumpkin seeds", "3 tablespoons/30 grams sesame seeds", "1/2 cup/85 grams almonds, very roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven racks to lower-middle and upper-middle positions. Heat to 350. Line two baking sheets with parchment paper, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine oil, honey and sugar in a medium saucepan, and set over medium-high heat. Whisk well, and bring to a boil, stirring occasionally to prevent scorching."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine remaining ingredients, and mix well. Once the honey mixture comes to a boil, carefully pour it over the dry ingredients. Working quickly, use a large silicone spatula to stir, turning the contents of the bowl over until everything is coated evenly with the syrup. Transfer mixture to baking sheets, and use spatula to flatten out cereal into an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place baking sheets on prepared oven racks, and bake for 10 minutes. Carefully remove 1 tray at a time, and use spatula to stir cereal around. Rotate trays 180 degrees, and switch oven positions to ensure even baking. Bake for 4 to 6 minutes longer, until golden brown and well caramelized. Remove from oven, and allow to cool entirely on the trays before breaking cereal into large clusters."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Store in an airtight container for up to 2 weeks."}], "link": "https://cooking.nytimes.com/recipes/1019809-ashure-cereal"}