{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Krispies Treats With Chocolate and Pretzels", "description": "Marshmallow treats can skew saccharine, but this slightly more sophisticated version embraces the salty as much as it does the sugary. Sweet marshmallows and chocolate are balanced by plenty of salt: in the butter, on the pretzels and in the flaky sea salt finish. Butter-flavored pretzels (“butter snaps”) have a delicate crunch and a creamy note that work well in this recipe, but any small, thin pretzels are also good. You'll want to use chopped chocolate here instead of chips: They melt faster, so you end up with smeared chocolate bits instead of distinctive chunks.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2019/02/04/dining/gk-marshmallow-treats/gk-marshmallow-treats-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "12 to 36 treats", "recipeCuisine": "american", "recipeCategory": "easy, quick, snack, cookies and bars", "keywords": "chocolate, flaky sea salt, marshmallow, rice krispies, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 337}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 296, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "17 grams", "sodiumContent": "36 milligrams", "sugarContent": "9 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["Nonstick cooking spray", "6 tablespoons salted butter (3/4 stick)", "1 (10-ounce) bag marshmallows", "3 cups Rice Krispies, or other crisp rice cereal", "3 cups butter-flavored or regular mini-pretzels, broken into 1/2- to 1-inch pieces", "3 ounces semisweet chocolate, chopped", "Flaky sea salt, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the bottom and sides of a 9-inch square baking pan with foil, leaving a 1-inch overhang on all sides, then coat with nonstick cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a large saucepan over medium-low heat. Add the marshmallows and stir with a sturdy silicone spatula until smooth and melted, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "3. Remove from the heat, add the cereal and pretzels, and stir until evenly coated. Immediately scrape the mixture into the prepared pan. Using the spatula, press the mixture to evenly cover the bottom of the pan. Working quickly (you want the cereal mixture to still be quite warm so the chocolate will melt a bit and adhere to the the surface), sprinkle the chopped chocolate on top. Press the mixture with the chocolate into a flat, even layer in the pan. Sprinkle with flaky sea salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool to room temperature in the pan on a rack. Lift out of the pan using the foil and cut into squares. Serve immediately or transfer to an airtight container."}], "link": "https://cooking.nytimes.com/recipes/1019978-rice-krispies-treats-with-chocolate-and-pretzels"}