{"@context": "http://schema.org", "@type": "Recipe", "name": "Chickpea Orzo Salad With Harissa-Roasted Eggplant", "description": "Where a typical potluck pasta salad is creamy and mayonnaise-rich, this one is vegetable-forward, crunchy and spicy. The heat comes from harissa, a North African paste typically made with red and hot peppers, and spices like coriander, caraway and cumin, which is used to marinate the vegetables and to dress the salad. Offset some of the intensity with mild mozzarella cheese, deeply toasted walnuts and salty bright-green olives, and no one will miss your great aunt’s bowties.", "author": {"@type": "Person", "name": "Sarah Jampel"}, "image": "https://static01.nyt.com/images/2018/08/08/dining/chickpea-orzo/chickpea-orzo-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday", "keywords": "eggplant, green olives, harissa, orzo, main course, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 118}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 498, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "11 grams", "proteinContent": "21 grams", "saturatedFatContent": "7 grams", "sodiumContent": "666 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["3 tablespoons olive oil, plus more for the pasta", "2 tablespoons harissa, plus more for seasoning", "1 large Italian eggplant, cut into 1-inch cubes", "1 red bell pepper, seeded and cut into 1-inch pieces", "Kosher salt", "Black pepper", "8 ounces orzo (or other small pasta)", "1 cup walnuts", "1 (15-ounce) can chickpeas, drained and rinsed", "1/2 cup pitted green olives (preferably bright green Castelvetranos), roughly chopped or torn", "1/4 cup fresh thyme or fresh oregano, roughly chopped, or a mix of the two", "8 ounces fresh mozzarella, cut into 1/2-inch cubes", "Baby kale or mixed greens, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the eggplant: Heat the oven to 450 degrees. Line two baking sheets with parchment paper. In a large bowl, whisk together the olive oil and harissa, then mix in the eggplant cubes and red pepper to coat. Season with salt and pepper. Transfer vegetables to one of the baking sheets and roast for 25 to 30 minutes, stirring occasionally, until the vegetables are tender and charred in places."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the orzo: Bring a medium pot of heavily salted water to a boil. Add the orzo and cook to al dente according to package instructions. Drain, add to a large bowl, and mix with about 1 teaspoon of olive oil. Set aside to cool slightly while you finish cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the walnuts on the other baking sheet and toast in the hot oven (alongside the vegetables if you have room) for 4 to 6 minutes, until they’re fragrant and the skin is papery. (Watch carefully: These burn easily!) Roughly chop."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the big bowl with the warm orzo, add the roasted vegetables. Then add the chickpeas, walnuts, olives, herbs and mozzarella. Taste for salt and pepper, and adjust as necessary. Stir in an additional dollop of harissa, if you’d like. Serve over a bed of greens for a more traditional salad."}]}