{"@context": "http://schema.org", "@type": "Recipe", "name": "Orecchiette With ’Nduja, Shrimp and Tomatoes", "description": "’Nduja, a chile-spiked, cured pork sausage, lends bold flavor and heat to this arrabiata-style sauce. If you can’t find ’nduja at your local supermarket, feel free to swap in your favorite fresh chorizo or pork sausage and a flurry of red-pepper flakes. Be sure to pick a pasta that can hold this hefty sauce. The deep pockets in orecchiette will do nicely, capturing flavor in every bite. The trick here is to allow the pasta to finish cooking right in the garlicky sauce, which is thickened by the starchy pasta cooking water. A topping of lemony bread crumbs adds texture and brightness.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2018/12/19/dining/YK-orecchiette-with-nduja/YK-orecchiette-with-nduja-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "broccoli rabe, nduja, orecchiette, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 80}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 794, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "81 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "7 grams", "proteinContent": "49 grams", "saturatedFatContent": "7 grams", "sodiumContent": "1123 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Kosher salt", "12 ounces orecchiette", "2 slices day-old Italian bread, cut about 1/2-inch thick and torn into small pieces, or 1/2 cup panko bread crumbs", "5 tablespoons olive oil", "Zest and juice from 1/2 lemon", "2 tablespoons chopped Italian flat-leaf parsley", "2 shallots, sliced", "4 garlic cloves, sliced", "4 ounces ’nduja, or fresh chorizo or pork sausage, casings removed", "1 (14.5-ounce) can whole peeled tomatoes and their juices", "12 ounces shrimp, peeled and deveined, tails removed, meat finely chopped", "2 cups roughly chopped broccoli rabe (about 1/4 pound)", "Red-pepper flakes (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil over high. Cook the pasta, reserving 1 1/2 cups pasta cooking water and draining the pasta about 2 minutes before al dente."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor fitted with a blade attachment, pulse the torn bread until coarsely chopped. Skip this step if you are using panko."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat 2 tablespoons oil over medium. Add the bread crumbs, and toast until golden-brown, about 3 minutes. Transfer to a bowl to cool. Add the lemon zest and parsley, season with salt and toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a paper towel, wipe out the skillet and heat the remaining 3 tablespoons oil over medium heat. Cook the shallots until softened, about 1 minute. Add the garlic and cook until fragrant and golden-brown around the edges, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crumble in the ’nduja and cook, using a spatula to break it up into smaller pieces, until the oil is bright red from the chiles in the pork, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes and their juices, tearing the tomatoes into smaller chunks with your hands as you add them to the skillet. Reduce the heat to medium low and simmer the sauce, scraping the bottom of the pan occasionally, until slightly reduced, about 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the shrimp, broccoli rabe, pasta and 1/2 cup of the reserved pasta cooking water. Cook, stirring occasionally, until the pasta is al dente, about 3 minutes, adding more pasta cooking water as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the lemon juice and season to taste with salt. Top the pasta with the seasoned bread crumbs and a pinch of red-pepper flakes, if using."}], "link": "https://cooking.nytimes.com/recipes/1019862-orecchiette-with-nduja-shrimp-and-tomatoes"}