{"@context": "http://schema.org", "@type": "Recipe", "name": "Caviar Sandwich", "description": "I now prefer the caviar sandwich to all other more classic presentations at the holidays. All that caviar crammed into a sandwich makes me feel giddy and extravagant and very lucky to be alive the second I set eyes on it. Context is everything; what I could reasonably splurge for would feel forlorn if showcased on a proper silver trolley atop a mound of shaved ice with a mother-of-pearl spoon at the ready on its nearby velvet pillow, but here, by contrast, in the context of a lowly sandwich, it feels as decadent as if I were eating caviar straight out of the tin, like a midnight pint of ice cream.\n\nBuy the caviar you most prefer from a retailer you trust the most—the most expensive may by no means necessarily be your favorite-- and see if this luscious sandwich doesn’t make you feel pretty giddy, too.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2018/12/23/magazine/23mag-Eat-image1/23mag-Eat-image1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 to 4 servings", "recipeCuisine": "american", "recipeCategory": "easy, lunch, quick, snack, sandwiches", "keywords": "appetizer, main course, caviar, chives, crème fraîche, white bread", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 336}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 360, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "3 grams", "proteinContent": "15 grams", "saturatedFatContent": "10 grams", "sodiumContent": "569 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup crème fraîche", "3 scallions, thinly slivered on the bias, about 4 tablespoons", "1/4 teaspoon ground black pepper", "1/2 teaspoon kosher salt", "3 eggs", "8 slices white sandwich bread, preferably Pepperidge Farm “Very Thin”", "2 to 3 tablespoons soft butter", "2 ounces caviar", "2 tablespoons chives, minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For scallion crème fraîche:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix the crème fraîche, scallions, black pepper and kosher salt. Stir aggressively with a rubber spatula until the ingredients are fully incorporated and the crème fraîche is smooth and spreadable. Set aside."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For soft hard-boiled eggs:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a small pot of water to boil over medium-high heat. Carefully lower your eggs into the boiling water using a slotted spoon, taking care not to crack the shells. Cook the eggs for 7 minutes, adjusting heat as needed to maintain a gentle boil. Remove eggs to a bowl of ice water, and cool completely. Gently crack eggs all over, peel and roughly chop. Set aside."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To assemble:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast white bread until light golden brown. Remove from toaster, and butter each slice, as we say, wall to wall."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat with the scallion crème fraîche so that both halves of each sandwich have an even schmear."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread an even layer of chopped egg on 4 slices (of the total of 8 slices) of toast."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Evenly dot the caviar on top of the chopped egg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle chives on top of the caviar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the remaining 4 slices of crème-fraîche toast on top of the egg-caviar side. Press down very gently, and slice in half on the bias. Serve at once."}]}]}