{"@context": "http://schema.org", "@type": "Recipe", "name": "Mara’s Tofu With Mixed Grains", "description": "With only a few steps and five main ingredients, this simple dish barely requires a recipe, but the results are simultaneously nourishing and deeply satisfying. Steeped in aminos (soy sauce's unfermented cousin), the semisoft tofu melts away with each bite, leaving behind a steamy, satisfying contrail of salt and umami. The coconut oil lends a trace of its sweet, tropical aroma as it yields a crisp, lacy crust. Mixed with quinoa, the rice becomes nutty and complex, a chewy counterpoint to the tender tofu. Plus, it's healthful enough to justify a little self-righteousness.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2018/01/14/magazine/14mag-eat/14mag-14eat-t_CA0-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "grains and rice, vegetables", "keywords": "bragg's liquid aminos, jasmine rice, quinoa, tofu, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 401}, "recipeIngredient": ["1 1/3 cups Thai jasmine rice", "2/3 cup quinoa", "3 cups water", "3/4 teaspoon fine sea salt", "2 14-ounce blocks medium-firm tofu", "6 tablespoons Bragg’s liquid aminos", "4 to 6 tablespoons coconut oil", "Cilantro leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse and drain rice and quinoa. Cook in a rice cooker with water and salt, or in a heavy-bottomed 2-quart saucepot over medium heat. Cover, and bring to a boil, then reduce to a faint simmer. Cook for 35 to 40 minutes, or until all water has been absorbed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet or large plate with paper towels. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat tofu blocks dry, then halve lengthwise. Cut into 1/2-inch-thick slices. Drizzle 2 tablespoons aminos onto the bottom of a large, shallow glass or ceramic dish, then lay a layer of tofu in it. Drizzle with another 2 tablespoons of aminos, then layer in remaining tofu, and drizzle with remaining aminos. Marinate for 5 minutes, then rotate and flip tofu slices, and tilt dish to coat evenly. Marinate 5 more minutes. Drain away excess aminos."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a 10-inch cast-iron or nonstick pan over high heat. When the pan is hot, add 2 tablespoons coconut oil. Just as oil begins to smoke, carefully lay in pieces of tofu in a single layer, leaving room between each piece."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to medium high, do not touch the tofu and cook 6 to 7 minutes per side until golden brown. Use a thin metal spatula to carefully flip the pieces. Cook the rest the same way, adding more oil as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove cooked tofu to prepared baking sheet, and allow to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a fork to fluff rice and quinoa. Serve tofu with rice. Garnish with cilantro leaves."}]}