{"@context": "http://schema.org", "@type": "Recipe", "name": "Apricot-Noyaux Jam", "description": "Tart and sweet, tinged with the faint scent of almonds and flowers, apricots are ideal for both eating and preserving. But cooked fruit, no matter how expertly preserved, can never measure up to the flawlessness of its fresh counterpart. To be extraordinary, apricot jam must offer something the fruit, out of hand, cannot. The most seductive flavor apricots have to offer is hidden within their pits. While the kernels, or noyaux, taste bland and bitter, they are rife with the sweet aroma of almonds, vanilla, apricots and lilies. Take the time to crack them from their shells. Steep them into the pot of bubbling fruit, where the heat will coax the perfume out of the noyaux and into the preserves (the heat will also disable the small amount of amygdalin the kernels contain, preventing the body from converting it to cyanide). To intensify the noyau flavor even more, add a generous splash of <a href=\"https://cooking.nytimes.com/recipes/1019388-noyau-extract\">homemade extract.</a> The resulting jam is an improbable improvement over the natural perfection of ripe stone fruit. Spread the jam on hot, buttered toast. Swirl it into thick Greek yogurt. Slather it between layers of almond or spongecake. Or sneak spoonfuls of it straight from the jar — no one will fault you.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2018/07/01/magazine/01mag-eat-image1/01mag-eat-image1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "jams, jellies and preserves", "keywords": "apricot", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 46}, "recipeIngredient": ["4 1/2 pounds ripe apricots, preferably Blenheim or Royal variety (about 25 pieces)", "2 1/2 to 3 1/2 cups granulated sugar, divided", "Fine sea salt", "1 to 2 lemons, juiced", "Noyaux extract (optional; <a href=\"https://cooking.nytimes.com/recipes/1019388-noyaux-extract\">recipe here</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The night before you plan to make the jam, pit and quarter the apricots, reserving pits. Trim away any soft or moldy bits. Place fruit in a large bowl or pot, toss with 2 1/2 cups sugar and 1/2 teaspoon salt to macerate, cover with parchment or lid and refrigerate. Place pits on a plate in a single layer, and freeze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The following day, bring fruit to room temperature before beginning jam-making process."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay a kitchen towel across a cutting board. Place frozen apricot pits on the towel in a single layer. Cover with a second towel, and use a hammer to gently crack each pit open, then remove kernels — the noyaux — from each pit (it’s fine if they break into pieces). Discard shells, and place kernels in a jelly bag or tie in a cheesecloth pouch, and secure with kitchen twine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place fruit, liquid and pouch in 6-quart or larger Dutch oven, or similar wide pot, and set over high heat. Set a colander inside a large heatproof bowl, and set aside. Stirring occasionally with a wooden spoon or silicone spatula, bring the jam to a boil, then carefully pour everything into the colander to strain the fruit, and return the syrup and kernel pouch to the pot. Set fruit aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stirring constantly over high heat, bring syrup to 225 degrees, or until the rapid boil slows, the bubbles grow large and the syrup thickens, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return fruit to pot, and allow jam to return to 225 degrees, stirring constantly to prevent scorching. If the temperature gets stuck around 220, the syrup seems to stop thickening or the jam tastes too tart, add up to 1 cup of sugar to balance. Add a pinch of salt if needed to adjust seasoning. The hot jam should taste uncomfortably sweet — once it cools, its flavor will mellow. After about 20 minutes, once most of the fruit breaks down and the jam reaches a slow, thick boil, add the juice of 1 lemon. Taste and adjust sugar, salt and lemon juice as needed — the jam should be mouth-smackingly sweet and tart. Add 1/4 cup <a href=\"https://cooking.nytimes.com/recipes/1019388-noyau-extract\">noyau extract</a>, if using. Remove pot from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pouch, and set aside. When it’s cool enough to handle, squeeze as much liquid (and noyau essence) from the bag, and stir into jam. Divide jam into 4 half-pint jars, and heat-process to seal, or cover and refrigerate for up to 4 weeks. Rinse off noyaux, and use to make extract."}]}