{"@context": "http://schema.org", "@type": "Recipe", "name": "Dolester Miles’ Coconut Pecan Cake", "description": "This is a rich, special-occasion cake that takes the traditional Southern coconut cake to another level, with ground toasted pecans in the batter and an easy-to-make Chantilly cream for frosting. It has become the signature dessert for Dolester Miles, who serves slices over a little puddle of crème anglaise at Chez Fonfon and Bottega, and sometimes at the Highlands Bar & Grill, the Birmingham, Ala., restaurants owned by Frank and Pardis Stitt. Assembly can be a challenge, so she suggests building the cake by stacking the delicate slabs of cake with filling in between each layer into a deep, round cake pan, then slipping it into the refrigerator for about an hour. The filling acts like a delicious glue. When the cake is inverted and unmolded, the edges have an even, professional appearance.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2020/06/14/dining/30pastryrex2/30pastryrex2-articleLarge-v2.jpg", "totalTime": "PT5H30M", "recipeYield": "12 to 14 servings", "recipeCuisine": "american", "recipeCategory": "cakes, dessert", "keywords": "birthday, kwanzaa, mother’s day, coconut extract, coconut milk, cream of coconut, shredded sweetened coconut, sweetened condensed milk", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1825}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 730, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "80 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "30 grams", "sodiumContent": "301 milligrams", "sugarContent": "62 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup/85 grams firmly packed sweetened shredded coconut", "3/4 cup/74 grams pecan halves, toasted", "2 cups/402 grams granulated sugar", "2 1/4 cups/287 grams all-purpose flour, plus more for the pans", "1 tablespoon baking powder", "3/4 teaspoon kosher salt", "3/4 cup/170 grams unsalted butter (1 1/2 sticks), softened, plus more for the pans", "1/4 cup/60 milliliters cream of coconut", "4 large eggs", "1/4 teaspoon coconut extract", "1 cup plus 2 tablespoons/270 milliliters unsweetened coconut milk", "2 large egg yolks, lightly beaten", "3/4 cup sweetened condensed milk", "4 tablespoons/57 grams unsalted butter", "1 tablespoon cream of coconut", "1 cup/85 grams sweetened shredded coconut", "1/2 cup/101 grams granulated sugar", "1 cup/240 milliliters heavy cream", "1/4 cup/31 grams confectioners’ sugar", "1 teaspoon coconut extract", "2 cups/170 grams sweetened shredded coconut, toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Grease two 9-inch round cake pans and line the bottom of each with parchment paper. Grease the parchment paper, then dust with flour, tapping out excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely grind the coconut in a food processor, then transfer to a bowl. Add pecans to the food processor, along with 2 tablespoons sugar, and finely grind them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, sift together flour, baking powder and salt. Stir in coconut and pecans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a mixer fitted with the paddle attachment, beat butter, cream of coconut and the remaining sugar on high speed until light and fluffy, about 4 minutes. Add eggs one at a time, mixing well after each addition and scraping down the bowl as necessary, then beat in coconut extract."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour mixture in 3 batches, alternating with the coconut milk, starting and ending with flour mixture. Divide batter between the pans and smooth the top of each with a spatula. Bake until cakes are golden and a tester comes out clean, 30 to 35 minutes. Let cakes cool in the pans on a wire rack for 30 minutes. Run a knife around the edge of each cake, invert onto rack, and remove the parchment. Let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the filling: Place egg yolks in a small heatproof bowl and set aside. In a saucepan, combine condensed milk, butter and cream of coconut and cook over medium-low heat, stirring constantly, until hot, about 4 minutes. Whisk 1/3 of the hot milk into the egg yolks. Transfer egg mixture to the saucepan of milk and whisk constantly over medium-low heat until mixture has the consistency of pudding, about 4 minutes. Do not let the custard get too thick. Transfer to a bowl and stir in the shredded coconut. Let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the simple syrup: In a saucepan, heat sugar and 1/2 cup water, stirring occasionally, until sugar has dissolved. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the layer cake in a pan: Cut each cake in half horizontally. Place one layer in the bottom of a 9-inch cake pan, moisten the top with 2 to 3 tablespoons simple syrup and spread 1/2 cup of the coconut filling in a thin, even layer with an offset spatula. Repeat to make 2 more layers of cake and filling, then place the last layer on top. Refrigerate cake for about 1 hour. To unmold, run a spatula around the edges, invert a cake plate over the top, and flip the cake over onto the plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the icing: Whip the cream with the confectioners’ sugar and coconut extract until stiff peaks form. Spread on the top and sides of the cake and sprinkle with toasted coconut. Refrigerate until ready to serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1019330-dolester-miles-coconut-pecan-cake"}