{"@context": "http://schema.org", "@type": "Recipe", "name": "Italian Potato-Pasta Soup With Greens", "description": "Some soups are light and refreshing preludes to a meal; others, like this one, are an entire meal in a bowl. Pasta and potatoes, like pasta and beans, are frequently combined in Italian vegetable dishes. The potatoes should be starchy, like Yukon Golds or russets, so that they lend body to the broth. Short pasta shapes add texture; onion, fennel, garlic, tomato paste and fresh herbs and greens add flavor. The soup may be made a day or so before serving: It improves in the refrigerator and reheats beautifully, but don’t add the pasta in this case until serving.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/01/31/dining/31kitchen2/merlin_132835553_cce17a28-4d61-4870-a8ad-2899c4b4b9cc-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, soups and stews, vegetables", "keywords": "kale, pasta, potato, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 873}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 373, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "7 grams", "proteinContent": "18 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1404 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil, more for garnish", "2 cups diced onion", "1 cup diced carrot", "1 cup diced fennel or celery", "Salt and pepper", "1 bay leaf", "1 large thyme sprig", "2 garlic cloves, minced", "2 teaspoons paprika", "2 tablespoons tomato paste", "3 quarts/12 cups chicken broth, vegetable broth or water", "2 pounds medium-size starchy potatoes, such as Yukon Golds or russets, peeled and cut in 1-inch chunks", "8 ounces kale or chard, stems removed, leaves sliced across into 1/2-inch ribbons (about 4 cups total)", "1/2 pound dried pennette, orecchiette or other small pasta", "1 tablespoon finely chopped fresh rosemary or marjoram, for garnish", "Freshly grated Parmesan cheese, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, heavy soup pot or Dutch oven, heat the 3 tablespoons olive oil over medium-high heat. When it shimmers, add onion, carrot and fennel, stir, and sprinkle with salt and pepper. Cook, stirring, until softened and golden, 5 to 10 minutes. Adjust the heat to prevent vegetables from browning or scorching."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in bay leaf, thyme sprig, garlic, paprika and tomato paste and cook, stirring, 1 minute. Add broth, potatoes and a large pinch of salt. Bring to a boil, then reduce heat to a brisk simmer. Cook until potatoes are cooked through but still firm, 12 to 15 minutes. Taste and adjust the seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in kale and pasta and simmer another 10 minutes, or until greens are well cooked and pasta is done. (Soup can be made up to this point, without the pasta, cooled and refrigerated for up to 3 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle soup into bowls, and sprinkle with chopped rosemary and Parmesan. Drizzle each serving with a teaspoon of olive oil. Pass extra Parmesan at the table."}], "link": "https://cooking.nytimes.com/recipes/1019157-italian-potato-pasta-soup-with-greens"}