{"@context": "http://schema.org", "@type": "Recipe", "name": "Roman Breakfast Cake", "description": "Of course this cake is good at lunch, at dinner, after school, afternoon or after midnight, but I call it a breakfast cake because it reminds me of a lemon cake I had with coffee every morning that I was in Rome. The cake is tall and golden, lightly lemony and most like a sponge cake — it’s soft and stretchy: Pull it gently, and it will tug itself back into shape. If you have a tube pan, use it; if you don’t, choose a Bundt pan with as few curves, crannies and crenellations as possible (fewer nooks make unmolding easier). When there are berries in the market, I fold them into the batter at the end. During the rest of the year, I go with straight lemon, although you could certainly make this cake with orange or a mix of citrus. Like so many of my favorite recipes, this is one that you can play with.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2018/07/08/magazine/08mag-OnDessert-image1/08mag-OnDessert-image1-articleLarge.png", "totalTime": "PT3H5M", "recipeYield": "1 cake", "recipeCuisine": "italian", "recipeCategory": "cakes", "keywords": "egg, flour, lemon", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 615}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 581, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "79 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "4 grams", "sodiumContent": "388 milligrams", "sugarContent": "51 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Butter for greasing the pan", "1 1/2 cups (204 grams) all-purpose flour", "2 teaspoons baking powder", "1/2 teaspoon fine sea salt", "6 large eggs, separated and at room temperature", "1 1/2 cups (300 grams) sugar", "Finely grated zest of 2 lemons", "1/2 cup (120 milliliters) neutral oil, like canola", "Juice of 1 lemon (2 to 3 tablespoons)", "2 teaspoons pure vanilla extract", "1/4 teaspoon pure lemon extract or oil (optional)", "About 1 1/2 cups (about 250 grams) blueberries, raspberries and/or blackberries (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven, and heat it to 350. Generously butter a 10-inch tube pan (or use a Bundt pan with minimal crannies), dust the interior with flour and tap out the excess. Be assiduous — this cake is a sticker. Alternatively, use baker’s spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the flour, baking powder and 1/4 teaspoon of the salt; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mixer with a whisk attachment, beat the egg whites and the remaining 1/4 teaspoon salt on medium-high speed until they form firm, glossy peaks. (If you’re using a stand mixer, scrape the whites into another bowl. No need to rinse the mixer bowl.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fit the mixer with the paddle attachment. Put the sugar and lemon zest in the mixer/mixing bowl, and rub them together until the mixture is fragrant. Add the yolks, and beat on medium speed for 3 minutes, scraping the bowl as needed — the batter will be thick, pale and shiny. With the mixer on medium, pour in the oil and continue to beat for another 3 minutes. Mix in the lemon juice, vanilla and lemon oil, if using, then scrape the bowl well. Turn off the mixer, add the dry ingredients and pulse the mixer a few times to start incorporating them. Work on low until the flour is blended into the batter, which will be smooth and thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the whites briskly with a whisk (to restiffen them and incorporate any liquid in the bowl), and scrape a few spoonfuls over the batter. Use a flexible spatula to stir them in and lighten the batter. Turn the rest of the whites into the bowl, and fold them in gingerly. If you’re using the berries, gently fold them in just before the whites are fully incorporated. Scrape the batter into the pan, and level the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cake for 45 to 50 minutes, until lightly browned; a tester inserted deep into the cake should come out clean. Transfer to a rack, and wait 5 minutes. Run a blunt knife around the edges of the pan to loosen the cake (if possible — it’s not easy with a Bundt), invert onto the rack and unmold. Cool to room temperature. Dust with confectioners’ sugar, if you like."}]}