{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Pudding", "description": "Anyone looking to try one’s hand at playing around with a recipe can’t do better than to start with rice pudding. I began making rice pudding with our son’s babysitter, a Frenchwoman named Marie-Cécile, who cooked au pif, meaning she followed her instincts and would riff on just about everything she made. Moi? I followed Marie-Cécile’s lead and have been making my own version of rice pudding regularly, but rarely with the same flavorings. Sometimes I’ll stir chocolate into the pudding right before it’s cooked, and often I’ll top the pudding with roasted fruit. For apples, cut 2 unpeeled apples into 1/4-inch wedges. Cook 1/2 cup sugar in a nonstick skillet until amber (stir only after the sugar starts to color), add 2 tablespoons butter followed by the apples. Cook, turning the wedges, for 6 to 8 minutes, until translucent.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2018/01/14/magazine/14mag-ondessert/14mag-14ondessert-t_CA0-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "custards and puddings", "keywords": "dessert, jasmine rice, milk, vanilla bean", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 286}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 105, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": null, "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "331 milligrams", "sugarContent": "14 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup (100 grams) long-grain rice, preferably jasmine", "1 teaspoon fine sea salt", "1 quart (946 ml.) whole milk", "1/4 to 1/3 cup (50-67 grams) sugar (to taste)", "1 vanilla bean, split lengthwise, or 1 tablespoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the rice under cold running water, then turn it into a medium saucepan, and cover with water. Add the salt, bring to a boil, reduce the heat and simmer for 10 minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the saucepan with cold water, shake out excess (don’t dry) and pour in the milk and sugar. If you’re using a vanilla bean, scrape the pulp into the pan and drop in the pod (if you’re using extract, you’ll add it later). Bring to a boil, stirring to dissolve the sugar. Stay close: Milk is notorious for bubbling over. Lower the heat, stir in the rice and cook at a steady simmer, stirring frequently (especially at the start) for 30-40 minutes, or until the rice is very tender, the pudding feels just a little thick as you stir it and most of the milk has been absorbed (the pudding will have cooked down by about half). It’s hard to give an exact time because it depends on the rice, the size of the pan and the amount of heat beneath it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the pudding into a heatproof bowl, and remove the vanilla bean, if you’ve used it. If you’re using extract, stir it in now. Cover (if you want to avoid a skin, press plastic wrap against the surface of the pudding), and cool to room temperature or refrigerate. Tightly covered, the pudding will keep in the fridge for about four days; serve cold or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1019148-rice-pudding"}