{"@context": "http://schema.org", "@type": "Recipe", "name": "Norwegian Apple Cake", "description": "Though quite straightforward, this recipe for Norwegian apple cake from Nevada Berg's cookbook “North Wild Kitchen” did raise a question. A whole tablespoon of cinnamon? Really? But it was not at all excessive, giving the cake autumnal fragrance and flavor along with a nicely burnished surface. What this recipe also offers is great flexibility. Though it calls for an 8-inch springform, it also worked in a 9-inch and a 10-inch, the latter providing a little less cake in proportion to topping (though no change in cooking time). Larger pans require more fruit. And on that score, in place of apples the recipe works well with fresh figs and peaches. Small purple plums, pears, apricots and even bananas are some other options to consider.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2018/09/26/dining/berg-apple-cake-horizontal/berg-apple-cake-horizontal-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "10 servings", "recipeCuisine": "scandinavian", "recipeCategory": "cakes", "keywords": "apple, sliced almonds, whipping cream, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 373}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 449, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "13 grams", "sodiumContent": "229 milligrams", "sugarContent": "34 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 tart apples, like Granny Smith", "1 cup/227 grams (2 sticks) salted butter, softened, plus more for greasing the pan", "2 cups/255 grams all-purpose flour", "1 1/2 teaspoons baking powder", "1 1/4 cups/250 grams granulated sugar", "3 large eggs, at room temperature", "1/2 cup/4 ounces whole milk", "1/3 cup/32 grams sliced almonds", "2 tablespoons dark brown sugar", "1 tablespoon cinnamon", "Whipped cream or vanilla ice cream for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and core apples; slice 1/2-inch thick. Set aside. Use some of the butter to grease an 8-inch springform cake pan. Dust with a little flour. Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift or whisk flour with baking powder. Set aside. In the bowl of a standing mixer, beat granulated sugar with 3/4 cup (1 1/2 sticks) of the butter for several minutes, until light and fluffy. Beat in eggs, one at a time, then beat mixture about 3 minutes until creamy. Gradually add flour mixture in three batches, alternating with milk, mixing well after each addition. Transfer batter to pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the apple slices on top of batter in tight overlapping concentric circles, gently pressing them in a bit. Scatter almonds on top. Dust with brown sugar and cinnamon. Dot with remaining butter. Place in the oven and bake about 1 hour, until a cake tester comes out clean, the top has browned and feels fairly firm to the touch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow to cool in the pan until just warm. Remove sides of pan and serve with whipped cream or ice cream. If cake has cooled completely it can be warmed before serving."}], "link": "https://cooking.nytimes.com/recipes/1019617-norwegian-apple-cake"}