{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Chicken With Maple Butter and Rosemary", "description": "This simple roast chicken combines the classic fall flavors of maple and rosemary with melted butter, which is basted over the bird as it cooks to keep it juicy. The butter browns slightly and helps caramelize the outside thanks to the sugars in the maple syrup. The result is a fragrant, sweet-and-salty chicken that makes the house smell great. There will be plenty of buttery pan juices left over, which you should most certainly pass around the table, but they would also be delicious spooned over rice pilaf.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/01/12/dining/ch-maple-roast-chicken-horizontal/ch-maple-roast-chicken-horizontal-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry", "keywords": "butter, chicken, maple syrup, rosemary, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1472}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 716, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "1 gram", "proteinContent": "51 grams", "saturatedFatContent": "19 grams", "sodiumContent": "990 milligrams", "sugarContent": "6 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 (3 1/2-pound) whole chicken", "Kosher salt and black pepper", "2 to 3 rosemary sprigs, plus 2 1/2 teaspoons finely chopped rosemary", "4 tablespoons unsalted butter", "2 tablespoons maple syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Pat the chicken dry and season it well with salt and pepper, both inside and out. Place the chicken breast-side up in a 10-inch cast-iron or ovenproof skillet and stuff the rosemary sprigs into the bird's cavity."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, melt the butter over medium-low heat. Add the chopped rosemary and the maple syrup, and cook together until the rosemary is fragrant and the mixture has thickened slightly, about 1 to 2 minutes. Spoon all of the mixture over the chicken, making sure it is evenly covered. A decent amount will end up on the bottom of the pan, and that’s O.K."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the chicken, basting with the pan juices every 15 to 20 minutes or so, until the chicken is glossy and golden brown and registers 165 degrees with an instant thermometer in the thickest part of the thigh, about 55 to 60 minutes. Remove from the oven and baste an additional time, if desired. Allow the chicken to rest for 10 minutes before carving. Whisk remaining juice and pass at the table."}]}