{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey Silog (Garlic Fried Rice With Eggs)", "description": "Silog, rice bathed in lots of garlic and crowned with a runny egg, is a hearty and essential part of any Filipino breakfast, and it comes together very quickly. For Chad and Chase Valencia, brothers and owners of the Filipino restaurant Lasa, in Los Angeles,  the best time to make silog is the morning after Thanksgiving, when they top it with seared leftover turkey (or ham), and gravy to moisten the bits of rice. You're going to have to plan ahead for this recipe, as it’s best made with day-old rice; freshly made rice won't get as crisp in the pan. And don't be intimidated by the amount of garlic here — it all mellows out, while still providing a potent punch. Chad notes that this dish will work in almost any nonstick pan, except for a steel or aluminum-bottomed pan; you could even use a well-seasoned cast-iron pan or wok.", "author": {"@type": "Person", "name": "Priya Krishna"}, "image": "https://static01.nyt.com/images/2018/11/21/dining/21valenciarex1/merlin_146709318_85135471-f0bf-42ad-bef3-e00cc3da2758-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "filipino", "recipeCategory": "breakfast, grains and rice", "keywords": "eggs, ham, rice, turkey, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 104}, "recipeIngredient": ["1/2 cup canola or other neutral oil, plus more as needed", "8 to 12 garlic cloves, to taste, peeled and ends trimmed", "Kosher salt", "8 cups day-old cooked white jasmine rice", "1 to 1 1/2 cups leftover gravy (omit if using ham)", "1 1/2 pounds leftover turkey or ham, sliced 1/4-inch thick", "4 eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the garlic fried rice: Heat a large nonstick pan (preferably 10 inches) over a medium-low flame, then add 6 tablespoons of the oil and garlic cloves. Season the cloves with a pinch of salt. Cook, turning the cloves occasionally, until they are brown and soft, 12 to 14 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove half the oil and half the garlic cloves from the pan and set aside in a small heat-proof bowl. Using a rubber spatula or the back of a wooden spoon, smash the remaining garlic in the pan to an almost rough paste. Before the smashed garlic turns golden, crank up the heat, add half the rice and spread to cover the surface of the pan. It will pop and sizzle — that’s good. Let sit for 30 seconds, then toss and mix the rice in the pan. Spread the rice out, then let sit again for another 30 seconds. Adjust the salt and transfer to a large plate. Lightly cover the plate with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the pan, add the reserved garlic cloves and their oil and repeat with remaining rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using turkey and gravy, warm the gravy in a small saucepan over medium-low heat, stirring occasionally, until it’s hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, reheat the turkey (or ham): Wipe out the pan, return it to medium-high heat and add 1 tablespoon of oil. When the oil starts to smoke slightly, gently lay the meat in pan and sear until golden brown on both sides, about 2 minutes per side. (You may need to do this in batches, adding oil as needed.) Transfer to a plate and season with salt to taste. Cover with foil and wipe out the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pan to medium-low heat and add 1 tablespoon of oil. Break eggs into pan and cook just until egg whites are fully set but the yolks are still runny. Season with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a few scoops of garlic fried rice on each plate. Layer seared turkey or ham slices on top of the rice. If you’re using turkey, sauce the meat with a few spoonfuls of gravy. Top each serving with a fried egg."}], "link": "https://cooking.nytimes.com/recipes/1019755-turkey-silog-garlic-fried-rice-with-eggs"}