{"@context": "http://schema.org", "@type": "Recipe", "name": "Cider-Roasted Pork Loin With Pickled Apples and Chiles", "description": "Roasting a pork loin on a bed of apples, onions and cinnamon moistened with cider gives the meat a caramelized sweetness and spicy perfume. The roast browns on top while the apples and onions collapse into a meltingly tender, golden heap beneath it. Then, to offset all the soft richness, bright and tangy pickled apples and chiles are served alongside. It’s a dish that’s both company worthy and cozy, as perfect for a Sunday supper, spooned over mashed potatoes or polenta, as it is served to guests alongside an elegant gratin. Keep some extra apple cider on hand to add to the pan if it dries out and starts to burn. Just a splash or two should do it.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/12/19/dining/19apperex1/19apperex1-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "boneless pork loin, fennel seeds, hard cider, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 337}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 397, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "3 grams", "proteinContent": "39 grams", "saturatedFatContent": "4 grams", "sodiumContent": "762 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup cider vinegar", "1 tablespoon sugar", "1/4 teaspoon allspice berries", "1/4 teaspoon coriander seeds", "Pinch kosher salt", "1 large tart apple, peeled and cut into 1/4-inch slices", "2 small jalapeños, seeded and thinly sliced", "1 (2 1/2 to 3-pound) boneless pork loin (not tenderloin)", "2 teaspoons chopped fresh rosemary, plus more rosemary sprigs for garnish", "2 teaspoons fennel seeds, coarsely crushed", "2 teaspoons kosher salt", "1/2 teaspoon freshly ground black pepper", "1 large, tart apple, halved, cored, and sliced into 1/4-inch slices", "1 onion, halved and cut into 1/4-inch slices", "3 garlic cloves, smashed and peeled", "1 cinnamon stick, broken in half", "1/2 cup chicken stock, more as needed", "About 1 cup (8 fluid ounces) hard apple cider or chicken stock, more as needed", "1 tablespoon butter, cubed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pickled apples, in a small pot, combine 1/4 cup water with vinegar, sugar, allspice, coriander and salt. Bring to a simmer and cook, stirring, until sugar dissolves, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put apples and jalapeños in a medium heatproof bowl or jar, and pour hot vinegar mixture on top. Let cool to room temperature and let pickle for at least 2 hours. (Mixture can be made up to 1 week ahead and stored in the refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub pork all over with rosemary, fennel seeds, salt and pepper. Refrigerate, fat side up and uncovered, for at least 2 hours and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Place pork on a rimmed 11-by-18-inch sheet pan. Scatter apples, onion, garlic and cinnamon stick in an even layer around pork loin. Transfer baking sheet to oven rack, and add chicken stock, then carefully pour in cider (it’s best to position pan in oven, then pour in liquid). You may not need all of the cider here. You can add more later as it roasts — stop if it threatens to overflow."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until pork reaches 135 degrees internally, 35 to 50 minutes. Keep an eye on the pork. If all the cider evaporates and baking dish starts to burn while the pork is cooking, add a splash more cider."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pork to a cutting board, tent with foil, and let it rest for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, transfer roasted apples, onions and garlic to a serving platter (discard cinnamon sticks). Scrape jus and any golden bits from baking sheet into a small pot, and bring to a simmer (add a little more chicken stock if needed). Whisk in butter and a pinch of salt and cook until the sauce is reduced by about a third (you just want to thicken it up a bit), 3 to 7 minutes. Pour in any juices from the cutting board where the pork loin is resting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice pork and place on a serving platter, along with the roasted apples and onions. Drizzle some of the sauce and also some of the liquid from the pickled apples on top. Garnish with the rosemary, and serve with pickled apples and jalapeños alongside."}], "link": "https://cooking.nytimes.com/recipes/1019835-cider-roasted-pork-loin-with-pickled-apples-and-chiles"}