{"@context": "http://schema.org", "@type": "Recipe", "name": "Scratchy Husband Pasta", "description": "In spite of the very few and very commonplace ingredients in this dish, there is an alchemy of sorts that takes place, transforming them from humble to holy-smokes-delicious in a way you will crave for the rest of your days. Be generous with your pinches, your grinds of the pepper mill, your scatter of cheese, your slivers of garlic and your final portions. It makes the difference. ", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": null, "totalTime": "PT30M", "recipeYield": "2 quite large portions or 4 small portions", "recipeCuisine": "", "recipeCategory": "pastas", "keywords": "main course, pecorino, spaghetti", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 652}, "recipeIngredient": ["3/4 cups extra-virgin olive oil", "1/4 pound unsalted butter", "1 whole head of garlic, or at least 10 cloves, peeled, sliced thin across the grain", "Good quality salt", "1 pound dried spaghetti", "4 teaspoons of chile flakes", "A generous 1/2 cup of grated pecorino or Parmigiano-Reggiano", "Many, many cranks of the pepper mill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring large pot of water to a boil. When water simmers and is about to break to a roiling boil, place a 10-inch deep-sided sauté pan on low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the olive oil and butter and sliced garlic to the pan and let the butter melt, as the garlic begins to warm through. When the pasta water gets roiling, add salt to taste. (As always, like seawater.) Add the dry spaghetti. Add chile flakes to the warming garlic-oil mixture and swirl the pan a bit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the spaghetti and make sure it is cooking evenly and the strands are separated. Swirl the garlic-chile-oil pan smoothly and frequently, and let the garlic soften and start to turn golden as the butter starts to foam and the chile blooms its heat and color into the oil. (On my stove, the burners run quite hot, so I keep it on low the whole time, but if your home burner is weak and you are not getting any foaming or toasting of the garlic by now, tap the heat up a half-step.) At 8 minutes, pull the pasta from the boiling water with tongs, let it briefly drip its excess water above the pasta pot, but then place it right into the garlic-chile-oil pan, letting the last drips of water go right into the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn up the heat under the pasta now and stir vigorously, also tossing the pasta with short sturdy flicks of your wrist, for just about a minute, listening to the water hiss a little as it evaporates in the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat, add cheese and a lot of black pepper. Toss and distribute all the garlic and the cheese and the chile flakes using two forks like you are tossing a salad, making sure every bit is coated and luscious and on the edge even of greasy. (The amount of salt that I put in the pasta water, combined with the salt of the cheese, is enough for us. If you feel it needs it, season with a little more salt, according to your tastes.) Serve immediately."}]}