{"@context": "http://schema.org", "@type": "Recipe", "name": "Raspberry Swirl No-Bake Cheesecake", "description": "This stunning magenta-swirled dessert uses fresh or frozen raspberries to dress up a light and creamy no-bake cheesecake, making it a treat you can enjoy year-round. The recipe calls for straining the raspberry sauce to remove the seeds, but adding a small spoonful of the seeds back to the purée for texture and crunch is a nice touch. Make sure to allow plenty of time (at least 8 hours) for the cheesecake to chill and set before slicing. Even then, this silky dessert will be softer and more pudding-like than a traditional baked cheesecake. That's the beauty of it.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2019/05/09/dining/ya-raspberry-swirled-cheesecake/ya-raspberry-swirled-cheesecake-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "cakes, custards and puddings", "keywords": "cream cheese, graham cracker, heavy cream, lemon, raspberries, sour cream, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 185}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 451, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "18 grams", "sodiumContent": "307 milligrams", "sugarContent": "23 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 to 3 cups fresh or frozen raspberries (from a 12-ounce/340-gram bag)", "1/4 cup/50 grams granulated sugar", "1 teaspoon finely grated lemon zest", "1 3/4 cups/225 grams graham cracker crumbs (from about 15 sheets of crackers)", "6 tablespoons/85 grams unsalted butter, melted", "1 tablespoon granulated sugar", "Pinch of kosher salt", "16 ounces/450 grams cream cheese, softened", "3/4 cup/150 grams granulated sugar", "1 teaspoon finely grated lemon zest", "1 tablespoon lemon juice", "1 teaspoon vanilla extract", "Pinch of kosher salt", "1/2 cup/120 milliliters sour cream or labneh", "1 cup/240 milliliters heavy cream, cold", "Fresh raspberries, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Combine the raspberries, sugar and lemon zest in a medium saucepan over medium heat. Cook, stirring frequently, until the mixture comes to a simmer. Turn the heat to medium-high and continue to cook, while stirring, until it is thickened, 4 to 5 minutes. Pour the mixture into a fine mesh sieve set over a bowl, and press the raspberry purée through with a spatula, scraping the underside of the sieve. If you’d like, add a teaspoon of seeds back to the purée for texture. Discard the remaining seeds. You should have about 3/4 cup/180 milliliters of raspberry purée. Chill the purée while you prepare the rest of the cheesecake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: If making your own graham cracker crumbs, add the graham crackers to the bowl of a food processor fitted with the blade attachment, or to a resealable bag, and pulse or crush until you have fine crumbs. You will have about 1 3/4 cups. Pour the crumbs into a bowl (or leave them in the bowl of the food processor), and add the butter, sugar and salt, and stir or pulse until the butter is evenly distributed and the crumbs are moistened. Spray a 9-inch springform pan with cooking spray, and pour the crumb mixture into the pan. Use a measuring cup or flat-bottomed glass to very firmly press the mixture into the bottom and about 1 1/2 inches up the sides of the pan. Refrigerate while you make the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In the bowl of a stand mixer fitted with the paddle attachment, combine the cream cheese, sugar, lemon zest and juice, vanilla extract and salt. Mix on low speed until combined, then turn the mixer up to medium and beat until smooth and fluffy, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stop the mixer to scrape the bottom and sides of the bowl to ensure even mixing. Add the sour cream and stir until just combined. Switch to the whisk attachment, and with the mixer on low speed, slowly pour in the cream. Turn up to high and whip until thick and fluffy, about 5 minutes. Stop the mixer once or twice to scrape the bottom and sides of the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the mixture into the prepared crust and use an offset spatula to smooth the top. Dot the top with 1/4 cup/60 milliliters of chilled raspberry purée, about 1 teaspoon per dollop. Using a paring knife or offset spatula (for thick swirls) or wooden skewer (for fine swirls), swirl the purée into the cream cheese mixture. Chill at least 8 hours and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To unmold, run an offset spatula or thin knife around the edge of the pan to loosen the crust before removing the ring, and use a clean, hot knife for the smoothest slices. Serve cold, with the leftover raspberry purée and fresh raspberries, if desired."}], "link": "https://cooking.nytimes.com/recipes/1019959-raspberry-swirl-no-bake-cheesecake"}