{"@context": "http://schema.org", "@type": "Recipe", "name": "Grouper Fillets With Ginger and Coconut Curry", "description": "The chef Patrick Jamon applies French cooking techniques to tropical ingredients grown, caught or gathered near his restaurant, Villa Deevena in Los Pargos, Costa Rica. He is particularly fond of grouper, which is often caught by his son Dean and served at the restaurant, but you could substitute red snapper, cod or mahi-mahi. When reducing the coconut milk, be sure to keep it at a simmer rather than a boil, so it doesn’t curdle. Red curry paste can vary in its intensity by brand, so you'll want to adjust the amount to taste.", "author": {"@type": "Person", "name": "John Willoughby"}, "image": "https://static01.nyt.com/images/2019/02/20/dining/20villarex1/merlin_150673179_4dea3e99-91f6-45a5-9f33-f3c4141dfd0a-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, curries, seafood", "keywords": "cilantro, coconut milk, curry paste, ginger, grouper, turmeric, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 170}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 420, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "3 grams", "proteinContent": "37 grams", "saturatedFatContent": "19 grams", "sodiumContent": "749 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 grouper fillets (about 6 ounces each), skin removed", "Kosher salt and black pepper", "4 teaspoons olive oil", "1 spring onion (or the white portion of 1 large leek), trimmed, cut into 2-inch segments and julienned (about 1 cup)", "1 tablespoon minced fresh ginger", "1 tablespoon minced fresh turmeric or 1 teaspoon dried turmeric", "1 small carrot, peeled and julienned", "1/2 cup snow peas, julienned", "1/2 cup fresh or frozen green peas", "1 (13-ounce) can full-fat coconut milk", "1 tablespoon red curry paste, plus more if needed", "1/4 cup cilantro leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 225 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the fish generously with salt and pepper. Heat 2 teaspoons oil in a large skillet over medium-high. When the oil is hot, add the fish and cook until browned on both sides, about 3 minutes per side. Transfer the fish to a baking sheet and place in the oven to keep warm while you prepare the rest of the dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 2 teaspoons oil to the skillet. Add the spring onion and cook, stirring frequently, until lightly browned, 2 to 3 minutes. Add the ginger and turmeric and cook, stirring frequently, 1 minute. Add the carrot, snow peas and green peas and cook, stirring occasionally, until crisp-tender, 3 to 4 minutes. Transfer the vegetables to a bowl and cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the coconut milk and 1 tablespoon curry paste to the skillet, bring to a simmer over medium, then reduce the heat to medium-low and simmer until liquid is reduced by about one-third, about 6 minutes. Whisk in more curry paste according to taste, if desired. Stir in the cooked vegetables and heat until warmed, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the fish among shallow bowls. Spoon the sauce and vegetables over the fish, garnish with cilantro and serve."}], "link": "https://cooking.nytimes.com/recipes/1019967-grouper-fillets-with-ginger-and-coconut-curry"}