{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Berry Stacked Shortcake", "description": "This stacked shortcake gives a classic summer dessert the large-format (think sheet cake and slab pies) treatment with big tender biscuits layered with juicy berries, and tangy yogurt whipped cream. Use any seasonal berries you like, but if you’d like to use strawberries, hull and cut them into halves if they are small or quarters if they are large. (Note that the juiciest summer berries won’t need as much sugar. If the berries leave juices on your hands when you handle them, cut the sugar in the berry mixture to 1 tablespoon.)", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2019/07/29/dining/29cooking/yossy-berry-shortcake-horizontal-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "One 9-inch cake", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "berries, greek yogurt, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 120}, "recipeIngredient": ["3 cups/385 grams all-purpose flour", "3 tablespoons granulated sugar", "1 tablespoon baking powder", "1/2 teaspoon baking soda", "1 teaspoon kosher salt", "1/2 cup/120 milliliters buttermilk, chilled", "1/2 cup/120 milliliters heavy cream, chilled", "1 large egg, cold", "8 tablespoons/115 grams unsalted butter (1 stick), cold and cut into 1/2-inch pieces", "2 teaspoons turbinado sugar", "About 5 cups/700 grams mixed summer berries", "1 to 2 tablespoons granulated sugar (for ripe summer or store-bought berries, respectively)", "1 tablespoon lemon juice", "1/2 teaspoon vanilla extract", "1/2 cup/120 milliliters Greek yogurt", "1/4 cup/30 grams confectioners' sugar (unsifted)", "1 teaspoon vanilla extract", "Pinch of kosher salt", "1 1/2 cups/360 milliliters heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Trace an 8-inch circle onto two pieces of parchment paper. Line two baking sheets with the paper, writing-side down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together flour, sugar, baking powder, baking soda and salt in a large bowl. Whisk together buttermilk, cream and egg in a liquid measuring cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a pastry cutter or your fingers to cut the butter into the flour mixture until it is the size of small peas. Make a well in the center and pour in the liquid. Stir the mixture together until just combined, then use your hands to knead it a few times until the dough comes together. It will be the texture of thick cookie dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into two equal pieces, place each onto one of the prepared baking sheets and use lightly damp hands to press it into a circle just inside the traced line. (Do your best to pat the tops flat while keeping the edges perpendicular to the pan.) Chill the dough on the baking sheets in the refrigerator until firm, about 15 minutes (dough can be chilled up to 4 hours). Just before baking, sprinkle each round with 1 teaspoon turbinado sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the shortcakes until golden and cooked through, 20 to 25 minutes, rotating the pans from front to back and top to bottom halfway through the baking time. Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the shortcakes are cooling, macerate the berries and make the cream: Add berries, sugar, lemon and vanilla to a large bowl. Use a fork to gently mash up to 1/4 cup of the berries. (This doesn’t have to be exact, but you want to create a little bit of liquid if your berries aren’t naturally super juicy.) Stir gently to combine and let sit for about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the cream, add the yogurt, sugar, vanilla and salt to the bowl of a stand mixer fitted with the whisk attachment. Mix on medium speed until combined. Add the heavy cream, and whip until very firm peaks form. (You can complete the shortcakes, cream and berries up to 4 hours in advance, refrigerating the cream and berries until ready to serve.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place one of the cooled shortcakes on a serving plate. Top with half of the cream followed by half the berries. (Don’t spread the cream quite to the edges, as it will spread when you add the other shortcake.) Repeat with the remaining shortcake, cream and berries. If there is a lot of extra berry juice left in the bowl, serve it alongside the cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the cake with a long serrated knife and serve. The shortcake can be layered up to about 1 hour in advance and stored in the fridge. It will soften as it sits."}], "link": "https://cooking.nytimes.com/recipes/1019442-summer-berry-stacked-shortcake"}