{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Chicken With Garlic-Chile Oil", "description": "Jarred chile-garlic oil is available from many brands and in many incarnations, but it’s also extremely easy to make at home. The trick is to cook the garlic in the oil slowly and gently so it doesn’t blacken and burn, which will make the whole thing acrid and unpleasant. This pungent and nutty chile-garlic oil recipe was inspired by one published in David Tamarkin’s wonderful cookbook, “Cook90” (Little, Brown and Company, 2018). Here, some of it is used as a sauce for chicken cutlets with lemon and capers. But keep leftover oil in the fridge to drizzle on hummus, steamed or roasted vegetables, or on top of avocado toast for a nutty, spicy kick.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/02/06/dining/06apperex1/merlin_149894484_8ffebc91-bfeb-4f3a-96af-b4ae0c01a807-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry", "keywords": "capers, chicken cutlet, garlic, low-carb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 251}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 505, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "1 gram", "proteinContent": "24 grams", "saturatedFatContent": "8 grams", "sodiumContent": "399 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup plus 2 tablespoons extra-virgin olive oil", "3 to 4 garlic cloves, finely grated or pressed through a garlic press", "1 1/2 teaspoons red-pepper flakes", "1/2 teaspoon kosher salt, plus more as needed", "1 lemon", "1 pound chicken cutlets, 1/4- to 1/2-inch thick ", "1/4 teaspoon dried oregano, crumbled", "Freshly ground black pepper, as needed", "3 tablespoons drained capers", "Whole cilantro or parsley leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet or nonreactive saucepan, heat 1/2 cup oil, garlic, red-pepper flakes and 1/2 teaspoon salt over low heat. Stir frequently until garlic is lightly golden (but not brown) and fragrant, 10 to 15 minutes. If garlic starts to brown, turn down the heat — you don’t want this to taste burned. Once garlic is golden, immediately transfer oil to a heatproof bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, grate zest from lemon, then cut lemon lengthwise into quarters and scrape out the seeds. Save 2 lemon quarters for squeezing juice over chicken after cooking. Trim ends off remaining 2 wedges, and slice wedges crosswise into thin triangles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 12-inch skillet over medium-high heat. Season chicken with lemon zest, oregano, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 2 tablespoons oil to hot skillet, then lay chicken down in an even layer. Scatter small lemon triangles and capers into pan. Cook until chicken and lemons are golden, 2 to 3 minutes per side. Transfer chicken to a serving platter. Squeeze a little lemon juice onto the bottom of the pan and scrape up all the browned bits with a wooden spoon, then pour all over chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle chicken with chile oil and a squeeze of fresh lemon juice. Serve topped with cilantro or parsley."}], "link": "https://cooking.nytimes.com/recipes/1019956-lemon-chicken-with-garlic-chile-oil"}