{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Chicken With White Beans and Caramelized Lemon", "description": "One of the best parts of cooking skin-on chicken in a skillet, aside from the obvious (crispy skin), is the delicious fat left behind. To maximize the amount of fat yielded, be sure to cook the chicken on the medium side of medium-high heat, which gives the fat plenty of time to render before the skin browns. All this extra time on the stove means you won’t have to finish your chicken in the oven. (The only exception are extra-large pieces, which may need a brief stint in a 350-degree oven to completely cook through.) While just about anything is great tossed in this liquid gold, using it to caramelize thick slices of lemon and wedges of shallot takes the dish to an even more complex, savory, tangy place. You can let the seasons or your pantry dictate what gets added next: hearty leafy greens, chunks of summer squash or a simple can of chickpeas or beans are all welcome to the party.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/07/25/dining/25Roman6-copy/25Roman6-copy-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, weeknight, poultry", "keywords": "chicken thighs, kale, lemon, white beans, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1610}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 822, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "51 grams", "fiberContent": "8 grams", "proteinContent": "57 grams", "saturatedFatContent": "13 grams", "sodiumContent": "1103 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 lemon, thinly sliced, seeds removed", "1 shallot, peeled and cut into thin wedges", "Kosher salt and black pepper", "2 1/2 pounds bone-in, skin-on chicken thighs or breasts (about 4 to 6)", "1 tablespoon canola oil", "1 (15-ounce) can small white beans (such as Great Northern, navy or cannellini) or chickpeas, drained and rinsed", "1 bunch kale, ribs removed, leaves torn into large pieces", "Flaky sea salt", "Olive oil, for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss lemon slices and shallots together in a small bowl and season with salt and pepper; set aside. (This will lightly pickle the shallot and soften the lemon while you cook the chicken.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the chicken with salt and pepper. Heat oil in a large skillet over medium heat and add chicken, skin-side down. Using kitchen tongs or a spatula, press the chicken evenly into the skillet so it makes good contact with the hot surface (which will promote browning). Cook, resisting the urge to check too frequently, until the skin is deeply golden brown (think of the color of a well-baked croissant), 5 to 8 minutes, depending on the size of the chicken pieces. At this stage, most of the fat should be rendered and the skin should be crispy. Flip and continue to cook until pieces are cooked through, another 7 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using kitchen tongs, transfer chicken to a plate to rest, leaving all the fat behind. Add lemon and shallot to the chicken fat, standing back if you need because it will sizzle. Cook, swirling the skillet, until the lemon has started to caramelize and brown, 3 to 5 minutes. (It’ll smell like a mix of lemonade and caramel.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans to the skillet and season with salt and pepper. Cook, tossing occasionally, until the beans have started to brown a bit and soak up all of that caramelized lemon chicken fat, 3 to 4 minutes. Working in batches, add kale and toss to wilt, seasoning with salt and pepper as you go."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the chicken to the skillet, along with any juices that have collected on the plate, and cook for a minute or two, just so everything gets to know each other in there."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the chicken, beans and kale between plates, making sure to top each serving with a few lemon slices. Sprinkle with flaky salt and a final few turns of pepper, and drizzle with olive oil."}], "link": "https://cooking.nytimes.com/recipes/1019382-skillet-chicken-with-white-beans-and-caramelized-lemon"}