{"@context": "http://schema.org", "@type": "Recipe", "name": "Flaky Chicken Hand Pies", "description": "Everyone falls for the homey appeal of chicken potpie. This fold-over version made with buttery puff pastry takes the concept up a notch for an elegant lunch or supper. Store bought pastry makes it easy. You can do the cooking in stages, and even freeze the pies (either baked or unbaked) for a future meal. Serve with a green vegetable or leafy salad.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/02/21/dining/21Kitchen1/merlin_133154091_58e321a2-c262-495f-a779-c70f54613778-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "brunch, dinner, lunch, snack, pies and tarts", "keywords": "appetizer, main course, chicken, mushroom, puff pastry", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 308}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 293, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "2 grams", "proteinContent": "17 grams", "saturatedFatContent": "7 grams", "sodiumContent": "592 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 whole bone-in, skin-on chicken legs with thighs (about 2 pounds)", "Salt and pepper", "2 tablespoons butter", "1 large onion, diced (about 1 1/2 cups)", "2 small cloves garlic, minced", "1 teaspoon chopped fresh thyme", "8 ounces brown or white mushrooms, chopped (about 4 cups)", "2 tablespoons all-purpose flour", "1 cup chicken broth or stock", "1/2 cup crème fraîche", "6 scallions, white and green parts only, chopped", "3 tablespoons freshly chopped parsley", "1 sheet (about 10-by-15 inches) frozen puff pastry, thawed in the refrigerator", "1 egg, beaten with 1 tablespoon water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Season chicken generously with salt and pepper. Roast, uncovered, for 45 minutes to 1 hour, until cooked through. Set aside until cool enough to handle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove skin and meat from bones. Chop meat roughly into 1/2-inch chunks and set aside or refrigerate, covered, for up to 2 days. (If desired, save skin, bones and pan drippings for stock.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make filling: In a large skillet, melt butter over medium-high heat. Add onion and cook until softened, stirring, about 5 minutes. Add garlic, thyme and chopped mushrooms. Season mixture with salt and pepper and reduce heat to medium."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, stirring, until onions have colored slightly and mushrooms are tender, about 5 minutes. Sprinkle with flour and stir to coat. Add broth and cook, stirring, as mixture thickens. Add chicken, turn heat to low and cook 5 minutes more. Stir in crème fraîche, turn off heat, and set aside to cool. Stir in scallions and parsley. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 2 baking sheets with parchment paper. Unfold puff pastry on a lightly floured (or parchment-paper-covered) work surface. Using a rolling pin, roll out into an approximate 15-inch square. Use the tip of a knife to cut into 9 equal squares. Spoon about 3/4 cup chicken mixture into the center of each piece, then divide any remaining mixture evenly on top, so each has the same amount."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick up and fold one corner of pastry over the filling to make a triangular pie. Press and pinch both edges together tightly to seal. Divide on the prepared pans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the tops with egg wash and bake until deep golden brown, about 20 to 25 minutes. Serve warm."}], "link": "https://cooking.nytimes.com/recipes/1019188-flaky-chicken-hand-pies"}