{"@context": "http://schema.org", "@type": "Recipe", "name": "The Fluffiest Royal Icing", "description": "Royal icing is the classic sweet glue that holds together gingerbread houses and provides a glossy medium for elaborate cookie decorations. Many recipes call for egg whites or cream of tartar or both, but meringue powder (available online or at specialty food stores) offers gloss, stability and creaminess without the use of raw eggs or other ingredients. This recipe was developed by Georganne Bell, a professional cookie-decorating teacher in Salt Lake City who doesn’t like traditional vanilla sugar cookies. The icing takes coloring easily, and pipes nicely from an icing bag or even a plastic bag with a corner snipped off.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2018/12/05/dining/05cookierex2/merlin_147384918_6e812ecc-93fe-4757-a2af-c425bb9941f7-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "About 5 cups, enough for about 5 dozen small cookies", "recipeCuisine": "", "recipeCategory": "", "keywords": "confectioners' sugar, meringue powder, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 55}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 385, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "98 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": null, "proteinContent": "0 grams", "saturatedFatContent": "0 grams", "sodiumContent": "7 milligrams", "sugarContent": "96 grams", "transFatContent": null}, "recipeIngredient": ["1/3 cup/47 grams meringue powder", "2/3 cup/158 milliliters warm water", "7 1/2 cups/937 grams confectioners’ sugar", "1 tablespoon/15 milliliters vanilla extract, or other flavoring, like coconut or almond extracts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place meringue powder and water in the bowl of a standing mixer and swirl them together. Using the whisk attachment, mix on high for 3 minutes until the mixture is frothy. Scrape down the sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add confectioners’ sugar and mix for 2 minutes, being careful to start slowly and then gradually increase speed to high so the sugar doesn’t fly all over the kitchen, scraping down the bowl as necessary. Add vanilla or other flavoring (and gel food coloring if desired), and mix on medium speed for about 30 seconds. Transfer to an airtight container until ready to use. The icing will keep, refrigerated, for about 2 weeks."}]}