{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato Aligot", "description": "In a classic French <a href=\"https://cooking.nytimes.com/recipes/1018430-aligot-mashed-potatoes-with-cheese\">pommes aligot</a> potatoes are mashed with butter and enough cheese to turn them into a stretchy purée that’s soft, gooey and eminently comforting. This version, made with sweet potatoes, has a gently caramelized flavor and a deeply satiny texture. Pan-fried sage leaves make a crisp, herbal garnish that’s worth the few extra minutes of work. Note that the bigger the sage leaves, the easier they are to fry. If you can’t find Saint-Nectaire or Tomme de Savoie cheese, you can use fontina or mozzarella. And if you want to make this ahead, or reheat leftovers, let the mixture cool, then store it in the fridge for up to 3 days. Reheat it on low, stirring in a little cream until the mixture is elastic and smooth. Serve this as a side dish to sausages or roasted meats, or as a meatless entree with a fresh, crunchy salad.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/11/14/dining/14apperex1/merlin_146213454_db2f2d3b-9994-496a-9d97-00870eb9c5c0-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "dinner, lunch, vegetables", "keywords": "fall, winter, gruyère, heavy cream, sage, sweet potato, thyme, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 155}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 452, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "2 grams", "proteinContent": "16 grams", "saturatedFatContent": "22 grams", "sodiumContent": "443 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 pound sweet potatoes, peeled and cut into 2-inch chunks", "Kosher salt", "Grapeseed, olive or sunflower oil", "Leaves from 1 small bunch sage", "1 thyme or lemon thyme sprig", "1/4 cup heavy cream", "6 tablespoons unsalted butter, cubed", "1 garlic clove, finely grated or minced", "Large pinch of freshly grated nutmeg", "8 ounces grated Gruyère, Cheddar or Emmentaler cheese", "5 ounces Saint-Nectaire or Tomme de Savoie cheese, rind removed, cubed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot, cover the potatoes and a generous amount of salt with 1 inch of water. Bring to a boil, then simmer until potatoes are tender, 10 to 15 minutes. Drain but don’t wash out the pot. (You’ll need it again later.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, fry the sage leaves: Line a plate with a paper towel. In a small skillet, heat 1/4-inch of oil. Add sage leaves a few at a time, and fry until golden and crisp, usually about 1 minute or so. Use a slotted spoon to transfer fried leaves to the paper-towel-lined plate and sprinkle with salt. Repeat with remaining sage leaves, adding more oil to the pan if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pot over medium heat, add the thyme and cream, and bring to a simmer. Turn off the heat and cover until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cooked potatoes to a food processor, and pulse just until mashed. Or pass potatoes through a food mill or large-holed sieve to mash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return potatoes to their cooking pot and set it over low heat. Using a wooden spoon, stir in butter, garlic and nutmeg until the butter melts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove thyme sprig from the cream. Stir the cream into the potatoes, then stir in the cheese, a handful at a time, until melted and stringy. Serve immediately, topped with the fried sage leaves."}], "link": "https://cooking.nytimes.com/recipes/1019701-sweet-potato-aligot"}