{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Clam Chorizo Pasta", "description": "Clams work their way into plenty of dishes in the Baja Peninsula of Mexico, which is where the chef Pati Jinich picked up this recipe for pasta con salsa picante de chorizo y almejas. The dish, which she featured on an episode of her PBS show, “Pati’s Mexican Table,” is a nod to the prized clams that are harvested in and around the coastal lagoons on Mexico’s Pacific shores. It pays homage to the surf-and-turf dishes in Tijuana, where cooks find seemingly endless ways to mix meat and seafood on a single plate. The dish takes its aggressive heat from chorizo and chiles de arbol, but it can be dialed down by substituting 1/2 teaspoon or less of red-pepper flakes. The beer in the dish is Ms. Jinich’s nod to the craft-beer boom in Baja.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2018/10/10/dining/10jinichrex2/merlin_144843666_2bf75529-706c-4433-ac1b-1dcb95e1e449-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 large servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, weeknight, pastas, seafood", "keywords": "chiles de árbol, chorizo, clams, crushed canned tomatoes, spaghetti, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 71}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1034, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "117 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "9 grams", "proteinContent": "51 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1877 milligrams", "sugarContent": "17 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 to 5 dozen small littleneck clams", "4 tablespoons olive oil", "1/2 pound chorizo sausage, casings removed and filling chopped", "1 cup finely chopped white onion", "5 garlic cloves, pressed or finely chopped", "2 chiles de arbol, stemmed and chopped (keep the seeds), plus more to taste", "1 cup light beer", "1/2 teaspoon kosher or sea salt, or to taste", "1 (28-ounce) can crushed tomatoes", "2 tablespoons tomato paste", "1 teaspoon honey", "1 pound spaghetti", "2 tablespoons chopped cilantro leaves, for garnish", "2 tablespoons chopped parsley leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse and scrub the clams under cold water, making sure they are closed and unbroken. Discard any that aren’t closed. Drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the olive oil in a large pot or casserole with a lid set over medium-high heat. Once hot, add the chorizo, breaking it into smaller pieces with 2 wooden spatulas or spoons, and fry until it begins to crisp and brown, about 4 minutes. Remove the chorizo with a slotted spoon and place in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the 2 remaining tablespoons of olive oil to the rendered chorizo fat and reduce the heat to medium. Add the onion and cook, stirring often, for a couple of minutes until softened. Add the garlic and chile de arbol and cook for a minute, until the garlic is fragrant and the chile de arbol begins to toast. Pour in the beer, add the salt, and once it comes to a simmer, incorporate the drained clams. Let it come to a simmer again, cover with a lid, and cook for 6 to 7 minutes, shaking the pot occasionally to help distribute the clams, until the shells open."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lid and, using a slotted spoon, transfer the clams into a bowl, including the clam meat that may have fallen from the shells, and discarding those with closed shells. Raise the heat to medium-high and continue to cook the beer-clam liquid for 6 to 7 minutes, so it strongly simmers and a lot of the alcohol evaporates. Add the crushed tomatoes, tomato paste and honey. Stir well, reduce the heat to low, cover and cook for 10 to 12 minutes, stirring once in between."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring salted water to a boil in a large pot. Add the spaghetti and cook until al dente, about 9 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove about 3 dozen clams from their shells and discard those shells. Remove the lid from the pot with the sauce and incorporate the cooked chorizo, shelled clam meat and the clams still in their shells. Mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the spaghetti and add it to the sauce. Toss until it is coated. Transfer to a serving platter or individual bowls. Garnish with the parsley and cilantro, and serve."}], "link": "https://cooking.nytimes.com/recipes/1019639-spicy-clam-chorizo-pasta"}