{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Sinigang", "description": "This recipe, adapted from the chef Tom Cunanan of Bad Saint in Washington, D.C., really needs fresh white rice when you serve it. It serves as the plain, blank canvas for all the tartness of the tamarind and the richness of the ribs. At Filipino meals, it’s quite common to have a variety of sawsawan – sauces and condiments on the table at mealtime. The idea is for everyone at the table to customize their dishes exactly to their liking.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2018/03/14/dining/14filipinorex3/merlin_134740575_e8c97f71-75a1-4773-ba55-a56b60557c01-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "filipino", "recipeCategory": "dinner, meat", "keywords": "daikon, eggplant, green beans, okra, ribs, shiitake, tamarind, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 107}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 504, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "8 grams", "proteinContent": "22 grams", "saturatedFatContent": "9 grams", "sodiumContent": "965 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds St. Louis-style pork ribs, separated and cut in half crosswise", "Kosher salt", "Freshly ground black pepper", "3 ounces dried shiitake mushroom caps", "1 1/2 tablespoons whole black peppercorns", "5 dried bay leaves", "3 tablespoons canola oil", "1 large white onion, thinly sliced (about 2 cups)", "2 tablespoons minced garlic", "3 large Roma tomatoes, cut into eighths (about 3 cups)", "1 long pepper or jalapeño, stemmed and halved", "7 ounces tamarind pulp", "2 Thai eggplant, quartered or 1 Baby Italian eggplant, cut into 1-inch pieces", "1/4 pound small whole okra, stems trimmed without cutting into pod", "1/4 pound Chinese long beans or green beans, cut into 2-inch lengths", "2 watermelon radishes or a 4-inch piece of daikon, sliced into 1/8-inch discs", "3 tablespoons fish sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash ribs and pat dry with paper towels. Season generously with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Snap or pinch off any remaining stems of the dried shiitake mushroom caps and discard. Process mushroom caps to a fine powder in a food processor; you should have 1 1/2 cups of mushroom powder. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tie the peppercorns and bay leaves in a sachet made of loose cheesecloth and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven or large heavy-bottomed pot over medium-high heat, add oil and sauté the onion, garlic, tomatoes and long pepper. After the onions have softened and the tomatoes have started to release their juices, reduce heat to medium and stir in the mushroom powder and 1 cup water. Cover and cook for 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pork ribs to the pot and stir to combine with aromatics. Cover and cook for 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 9 cups water and the sachet containing the peppercorns and bay leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put tamarind pulp in a fine mesh sieve and submerge sieve in pot. Cover and bring to a boil. Once the pot has reached a boil, break up the tamarind pulp with a wooden spoon. It should have softened considerably. As you’re breaking it up, take care to keep it contained in the sieve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to a low simmer and cook ribs for about 60 to 75 minutes, or until the meat is soft and pulls easily off the bone. Meanwhile, keep the pot covered, removing cover only to skim foam off the top, as necessary, and to periodically stir the tamarind pulp in the sieve to help release its tartness. To increase the tartness of the broth even more, force pulp through the sieve with the back of a wooden spoon. Once broth has reached the desired level of tartness, remove the sieve from the pot and discard the tamarind solids. (Depending on the taste of the cook, the tamarind pulp may be removed well before the ribs are tender.) Season broth with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add eggplant and okra; cover and cook for 5 minutes. Add long beans and radishes; cover and simmer for 3 more minutes. Check the seasoning of the broth and adjust, if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off heat and discard the sachet. Ladle into bowls, and serve immediately with steamed jasmine rice. Put fish sauce in a small bowl on the table for people to add to their soup, as desired."}], "link": "https://cooking.nytimes.com/recipes/1019216-pork-sinigang"}