{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Squash With Coconut, Chile and Garlic", "description": "Mix dry coconut, dry chile and garlic together, and you can easily brighten a batch of roasted winter squash. But this South Indian home-cooking technique is versatile and works with many kinds of vegetables too. Cut a head of cauliflower into florets, and roast that instead. Or shave brussels sprouts or red cabbage very thinly, and cook it in a skillet, adding the coconut-chile-garlic mixture when the vegetable is cooked. In the spring, try it with fresh peas or fava beans. In the summer, try corn kernels. The variations are endless.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/12/10/magazine/10mag-eat1/10mag-10eat-t_CA1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings as a side", "recipeCuisine": "indian", "recipeCategory": "", "keywords": "chiles de árbol, shredded unsweetened coconut, winter squash, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 114}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 188, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "6 grams", "sodiumContent": "515 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 to 2 pounds mixed winter squash (such as delicata, acorn and butternut)", "2 tablespoons grapeseed oil", "1 teaspoon salt, plus more to taste", "2 to 3 dried chiles de árbol", "1/3 cup unsweetened dried, shredded coconut", "1 small garlic clove, peeled", "1 teaspoon coconut oil", "1/4 teaspoon black mustard seeds (optional)", "1 sprig fresh curry leaves (optional)", "Half a lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a sheet pan with parchment paper, and heat the oven to 400. Wash, slice and seed the squash, cutting it into approximately 1/2-inch-thick rings and wedges. Arrange on a sheet pan, drizzle with oil and season with salt. Roast for 30 to 45 minutes, turning the pieces about halfway through, until the squash is tender and slightly browned in places."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the meantime, put the chiles in a bowl, and cover with very hot water so they soften for about 2 minutes, or longer. In a mortar and pestle or a small food processor, add the coconut and garlic. Grind until the garlic is completely broken down, then fish the chiles out of the water, and add them. Grind, until the chiles are in small but still-visible red pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a sauté pan, heat coconut oil over medium heat. When it is hot, add mustard seeds and curry leaves, if using. When seeds start to pop, add coconut-chile-garlic mixture, and stir well. Cook for about 1 minute, or less if the paste is very dry and starts to brown quickly, then remove from heat. Toss the warm roasted squash into the coconut mixture, along with a generous squeeze of lemon. Taste a piece for salt and lemon, adjust as needed and serve."}], "link": "https://cooking.nytimes.com/recipes/1019086-roasted-squash-with-coconut-chile-and-garlic"}