{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Camembert Salad", "description": "Cheese encased in pastry and baked until brown might seem like an old-fashioned dish, but it’s one of the most reliable ways to please a small group of omnivorous people. Flaky pastry, warm, runny cheese, what’s not to like? Baking is also a great way to turn a mediocre wheel of cheese into something great. Cut the wheel in half, sandwich it with something savory and something sweet and wrap it up tightly with pastry. If you want to replace it with Brie, or another soft cheese with an edible rind, feel free — just make sure there aren’t gaps in the sides of the pastry, or the cheese will leak out in the oven.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2019/02/03/magazine/03mag-eat-slide-SZ33/03mag-eat-slide-SZ33-articleLarge.png", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "brunch, dinner, lunch, salads and dressings", "keywords": "appetizer, side dish, apricot preserves, Camembert cheese, fig preserves, puff pastry, radicchio", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 130}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 273, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "9 grams", "sodiumContent": "452 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 slices bacon, chopped", "1 small white onion, chopped", "2 teaspoons fresh thyme leaves", "Crunchy sea salt, such as Maldon, to taste", "Freshly ground black pepper, to taste", "1 sheet puff pastry, thawed in the fridge per package instructions", "All-purpose flour, for rolling out the dough", "1 egg, lightly beaten", "1 (9-ounce) wheel Camembert, sliced in half horizontally", "2 tablespoons fruit preserves, such as apricot or fig", "1 head radicchio or other juicy, slightly bitter salad leaf", "2 tablespoons extra-virgin olive oil", "1 tablespoon red-wine vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the bacon into a skillet over medium heat, and allow the fat to render, stirring occasionally, about 2 minutes. Add the onion and thyme leaves, reduce the heat to low and let the onion sweat in the bacon fat until it’s totally soft and the bacon is cooked through and lightly browned, stirring occasionally, about 8 minutes. Season with salt and pepper, and remove from heat. Drain excess fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400. Place the puff pastry on a lightly floured sheet of parchment, and use a rolling pin to even out any folds, and roll until it’s about 12 by 12 inches. Brush off any remaining flour, and brush all over with egg. Transfer the parchment and pastry to a baking sheet. Place half of the Camembert at the center, cut side up. Spoon the onion-bacon mixture and the preserves on top of the Camembert, then place the remaining Camembert half on top, cut side down. Season generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the edge of the dough up and over the cheese, working your way around, gently pressing and pinching to seal. Make sure there are no gaps, which could allow the cheese to leak from the puff-pastry parcel. Flip the parcel over, brush the top and sides of the parcel with the remaining egg wash and use a knife to puncture a small hole at the center, and to make a design along the top, if you like. Bake for 20 to 25 minutes, or until the pastry is cooked through and golden brown all over. Allow to cool on the sheet pan for about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to eat, tear the salad leaves in half with your hands, and dress them in a big bowl with some olive oil and vinegar. Taste, adjust if needed and season generously with salt and pepper. Place the pastry on the serving plate, surround it with salad and serve."}], "link": "https://cooking.nytimes.com/recipes/1019949-baked-camembert-salad"}