{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry-Lemon Eton Mess", "description": "This is not a traditional Eton mess, the renowned British dessert usually comprising meringue, whipped cream and strawberries. I made one like that and loved it, but the elements just begged to be played with. For this, my favorite mess for the fall-into-winter season, I’ve added spice-cookie crumbs to the meringue for more flavor and a bit of surprise, made two add-ins — a quick-cook cranberry jam and a lemon curd — and stirred in some fresh raspberries (more tang, more color). Of course, I kept the whipped cream — it’s essential to a mess. Going with cranberries and curd make this a good choice for the holidays. You can serve the mess family style or in bowls, coupes or even canning jars. And if you want a bit more texture and another flavor, speckle the top with chopped pistachios.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2018/11/11/magazine/11mag-dessert-slide-MVM7/11mag-dessert-slide-MVM7-articleLarge-v2.jpg", "totalTime": "PT3H25M", "recipeYield": "6 servings", "recipeCuisine": "british", "recipeCategory": "parfaits and trifles", "keywords": "cranberry, heavy cream, lemon curd, pistachio, raspberries, speculoos, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 134}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 628, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "82 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "7 grams", "proteinContent": "5 grams", "saturatedFatContent": "20 grams", "sodiumContent": "125 milligrams", "sugarContent": "66 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup (100 grams) plus 2 teaspoons sugar", "1 1/2 teaspoons cornstarch", "2 large egg whites, at room temperature", "1/4 teaspoon cream of tartar or 1/2 teaspoon distilled white vinegar", "Pinch of fine sea salt", "1/2 teaspoon pure vanilla extract", "3 tablespoons spice-cookie crumbs, preferably Biscoff/speculoos", "1 12-ounce (340-gram) bag cranberries (if frozen, don’t defrost)", "3/4 cup (150 grams) sugar", "1/2 cup (120 milliliters) freshly squeezed orange juice (or water)", "1 teaspoon minced, peeled fresh ginger", "About 1 1/2 cups (about 360 milliliters) lemon curd, homemade or store-bought (<a href=\"https://cooking.nytimes.com/recipes/1019737-lemon-curd\">see recipe</a>)", "About 3 cups (about 375 grams) raspberries", "1 1/2 cups (360 milliliters) heavy cream, lightly whipped", "Chopped pistachios (optional), for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "To make the meringue:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven, and heat it to 250. Line a baking sheet with parchment paper or a silicone baking mat."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift the 2 teaspoons sugar and the cornstarch together; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mixer with a whisk attachment, beat the whites, cream of tartar or vinegar and salt on medium-high speed until the whites form soft peaks, about 3 minutes. Add the remaining 1/2 cup sugar, 1 tablespoon at a time. It will take about 5 minutes to blend in all the sugar — don’t rush it. When it’s incorporated, add the vanilla, and beat for another 2 minutes or so, until you have stiff, glossy, beautifully white peaks. Switch to a flexible spatula, and fold in the reserved sugar-and-cornstarch mix, followed by the cookie crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop the meringue out onto the baking sheet, and spread it about 1/2-inch thick. Size and shape don’t matter here."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, undisturbed, for 1 1/4 hours. The meringue will puff, and it may crack; it shouldn’t color much, although it might turn beige here and there. Turn off the oven, prop the door open just a crack, to let the hot air out, and leave the meringue to finish drying for another 2 hours, or for as long as overnight. It’s ready when you can easily peel away the paper or mat. Set aside in a dry place until needed. (The meringue can be made up to 2 days ahead and kept loosely covered at room temperature as long as it’s not humid.)"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To make the jam:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put all the ingredients in a medium saucepan, and cook, stirring, over medium heat, until the mixture bubbles, many of the cranberries pop and the sauce starts to thicken, about 10 minutes. The filling will thicken more as it cools. Scrape into a bowl, and cool to room temperature, then cover and refrigerate if you’re not using it immediately. (The filling can be made up to 3 days ahead and kept in the refrigerator.)"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To assemble the dessert:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For each serving, start with a few of spoonfuls each of curd and jam. Add a few spoonfuls of whipped cream, and top with some berries. (You can make the mess up to this point, cover it and refrigerate for up to 1 hour.) Crumble meringue generously over the dessert, and sprinkle over pistachios, if you’d like. You might have some meringue, curd or jam left over — add more to each serving or reserve. Serve immediately, while the meringue is still crunchy."}]}], "link": "https://cooking.nytimes.com/recipes/1019725-cranberry-lemon-eton-mess"}