{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Lamb Meatballs With Yogurt and Herbs", "description": "These spice-loaded meatballs have a Turkish inflection. The warm yogurt sauce adds tang and richness, along with a sprinkling of tart sumac powder and chopped mint. American \"Greek-style\" yogurt is not always tart enough, but it can be thinned with a bit of buttermilk or even lemon juice. Whisking it with cornstarch and egg produces a silky sauce. Though the ingredient list looks long, this is a simple and impressive dish to make.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/02/28/dining/28kitchen1/merlin_133154115_9c2aace7-c4aa-4b6d-9b96-ead8383eef02-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "5 to 6 servings", "recipeCuisine": "mediterranean, moroccan, turkish", "recipeCategory": "dinner, easy, meatballs", "keywords": "lamb, spices, yogurt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 634}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 481, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "1 gram", "proteinContent": "26 grams", "saturatedFatContent": "14 grams", "sodiumContent": "599 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds ground lamb, not too lean (from a cut like shoulder or breast, not leg)", "1/2 cup breadcrumbs", "2 teaspoons kosher salt", "1/2 teaspoon black pepper", "1/2 cup finely diced red onion", "1 teaspoon toasted ground cumin", "1 teaspoon toasted ground coriander", "1/4 teaspoon cinnamon", "Pinch of cayenne", "3 eggs", "Extra-virgin olive oil", "1 cup chicken broth", "1 cup plain, very tart yogurt (if using Greek-style yogurt, thin it with milk and lemon juice)", "1 tablespoon cornstarch, dissolved in 2 tablespoons water", "2 ounces crumbled feta cheese", "1/2 teaspoon sumac", "Crushed red-pepper flakes, to taste", "Turmeric, for garnish (optional)", "3 tablespoons chopped mint", "2 tablespoons chopped dill", "Cilantro sprigs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, use your hands to combine lamb, breadcrumbs, salt, pepper, onion, cumin, coriander, cinnamon and cayenne. Beat 2 of the eggs and add to meat, mixing until incorporated. Cover and refrigerate for 30 minutes to 24 hours to allow the seasonings to permeate the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using wet hands, break off walnut-sized pieces of lamb mixture, roll into spheres and set aside on a baking sheet. You should have about 30 1-ounce meatballs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 225 degrees. In a large skillet, heat 2 tablespoons oil over medium-high heat. When shimmering, add meatballs in one layer and brown for 2 to 3 minutes. Turn and cook for 4 to 5 minutes more. (Work in batches, if necessary, to avoid crowding the pan.) Transfer to a paper towel-lined baking sheet to blot any extra oil, then pile meatballs on a heatproof serving platter and keep warm in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off any excess oil from skillet and turn heat to high. Add broth and bring to a simmer. In a bowl, whisk together yogurt; 1/2 teaspoon salt; remaining egg, beaten; and cornstarch. Pour yogurt mixture in a thin stream into the hot broth, whisking constantly. Turn heat down slightly and continue whisking until yogurt is heated through and slightly thickened, about 1 minute. Do not let mixture boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour hot yogurt sauce over meatballs. Sprinkle crumbled feta, sumac and crushed red pepper on top. Finish with pinches of turmeric, if using, and sprinkle with mint, dill and cilantro. Serve immediately with rice, orzo, pita bread or potatoes."}], "link": "https://cooking.nytimes.com/recipes/1019197-spiced-lamb-meatballs-with-yogurt-and-herbs"}