{"@context": "http://schema.org", "@type": "Recipe", "name": "Curried Swordfish With Tomatoes, Greens and Garlic Toast", "description": "For a decade, swordfish was dangerously overfished. Over time, the North Atlantic swordfish stock has been rebuilt, and swordfish caught by American vessels are now sustainably fished. One thing hasn’t changed: Handled incorrectly, swordfish can be tough or dry. Searing, then steaming with the moisture that comes from braising greens and ripe, on-the-vine tomatoes, yields a moist and succulent steak. Make sure to use small grape or cherry tomatoes. When the tomatoes burst, the juices meld with the curry powder and the fat (ghee or oil) for a flavorful, spoonable sauce. Drizzle any extra over garlicky bread with a generous squeeze of lemon. If you don’t have ghee, cook the fish in a mixture of butter and vegetable oil, which will give you all the high-heat flexibility of ghee with the rich, flavorful finish of butter.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/08/01/dining/sc-Curried-Swordfish-With-Tomatoes--Greens-and-Garlic-Toast/sc-Curried-Swordfish-With-Tomatoes--Greens-and-Garlic-Toast-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, seafood", "keywords": "curry powder, mustard greens, swordfish, tomatoes, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 193}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 630, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "6 grams", "proteinContent": "55 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1025 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons ghee or olive oil", "1 tablespoon Madras curry powder", "2 teaspoons sweet paprika", "1 1/4 teaspoon coarse sea salt", "1/2 teaspoon black pepper", "4 (8-ounce) swordfish steaks", "1 small bunch mustard greens or other braising greens, like kale or chard (about 6 ounces), stemmed and torn into big bite-size pieces", "10 ounces grape or cherry tomatoes", "1 ciabatta loaf or baguette, sliced", "1 large garlic clove, peeled", "1 lemon, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the ghee or oil in a large cast-iron skillet over medium-high heat until melted. Stir together the curry, paprika, salt and pepper. Pat the swordfish dry, and season on both sides with the spice mixture. Cook one side of the fish without moving it, until it is golden and releases easily, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flip the fish, add the greens and tomatoes (on the vine), scattering evenly over the top of the fish. Cover with a lid, reduce the heat and cook over medium heat until greens are wilted, tomatoes have burst and fish is just cooked through but still very moist, 4 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toast the bread: While warm, rub each piece vigorously with the garlic clove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the fish from the heat and serve immediately, with toasted garlic bread, spooning the juices from the pan over each portion. Squeeze lemon over the top."}]}