{"@context": "http://schema.org", "@type": "Recipe", "name": "Han Oak Galbijjim", "description": "This is a home cook’s take on the short-rib stew the chef Peter Cho serves at Han Oak, the beautiful homestyle Korean restaurant in Portland, Ore., that he runs with his wife, Sun Young Park. It is fragrant and sweet, with deep caramelized flavors that come in part from roasting the meat and vegetables separately before combining them in the braising liquid. Cho fries rice cakes before adding them to the stew, but you can just slide them in plain, if you prefer. Either way, the addition of greens at the end gives the dish an exciting brightness, a zip that many galbijjims lack.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/01/20/magazine/20mag-eat-slide-A0VW/20mag-eat-slide-A0VW-articleLarge.png", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "korean", "recipeCategory": "meat, one pot", "keywords": "Coca-Cola, gochugaru, kale, radish, short ribs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 562}, "recipeIngredient": ["3 pounds mixed root vegetables, such as carrots, parsnips, onions and sweet potatoes, peeled and cut into 1-inch pieces", "5 tablespoons neutral oil, like canola or vegetable oil", "Kosher salt", "Freshly ground black pepper, to taste", "4 pounds bone-in short ribs, cut by a butcher into 2-inch pieces", "2 medium-size Asian pears, peeled, cored and diced", "1 large red onion, peeled and diced", "12 cloves garlic, peeled and roughly chopped", "2 tablespoons roughly chopped ginger", "3 cups chicken stock", "1 12-ounce can Coca-Cola", "1/4 cup honey", "1/2 cup soy sauce", "1/4 cup rice-wine vinegar", "2 tablespoons gochugaru (Korean chile flakes), or to taste", "4 cups roughly chopped kale, optional", "1 pound Korean rice cakes, optional", "1 tablespoon toasted sesame oil", "3 scallions, trimmed and both white and green parts thinly sliced", "3 radishes, trimmed and thinly sliced", "Sesame seeds, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425. Toss the root vegetables in a large bowl with 2 tablespoons of oil, and season with an aggressive amount of salt and pepper. Turn the vegetables onto a sheet pan. Put the short ribs in the same bowl, and toss with 1 tablespoon of oil and a lot of salt and pepper, then put the ribs on another sheet pan, bone sides down. Place both pans in the oven and roast, turning the pans once or twice, until the vegetables are soft and caramelized and the ribs are well browned, approximately 40 minutes. Set the pans aside until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the vegetables and ribs cook, place a large Dutch oven over medium-high heat, and swirl into it the remaining 2 tablespoons of oil. When it shimmers, add the pears, onion, garlic and ginger and cook, stirring occasionally, until they are softened and browning, approximately 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat to high, add the stock, Coca-Cola, honey, soy sauce, rice-wine vinegar and gochugaru, and bring the mixture to a lively simmer. Cook until pears are tender, approximately 20 minutes. Transfer to a blender or food processor, and purée the sauce until smooth, then return it to the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cooked short ribs and whatever fat has rendered from them to the pot, cover it and cook over medium-low heat for approximately 90 minutes, or until very tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the meat can be flaked from the bone, add the roasted vegetables to the pot, along with the rice cakes. Cook until the vegetables are hot and the rice cakes (if using) are sticky, then add the greens, and stir them around until they have just started to turn tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle with the sesame oil, top with the scallions, radishes and sesame seeds to taste. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1019918-han-oak-galbijjim"}