{"@context": "http://schema.org", "@type": "Recipe", "name": "Steamed Artichokes With Lemon Butter", "description": "Large, plump artichokes are generally better for steaming than smaller ones. They may take longer to soften, but you’ll end up with plenty of meaty petals to pull off and dip into the lemon butter. This recipe gives instructions for steaming the artichokes in a traditional pot, but a pressure cooker (either electric or stovetop) is a faster option if you have one. See the Note below for instructions.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/05/09/dining/09apperex3/merlin_137521041_baba5015-329e-4275-be3e-1458f73e05dc-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "appetizer, side dish, artichoke, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 46}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 147, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "7 grams", "sodiumContent": "115 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 large artichokes, or 4 medium artichokes", "1 whole lemon, halved, plus 2 tablespoons lemon juice", "1 garlic clove, finely grated or minced", "Large pinch of kosher salt", "4 tablespoons melted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull off any brown or very tough outer leaves from one artichoke. Use a sharp knife to cut off the top 1 inch of artichoke, then rub with the cut side of the lemon. Use kitchen shears or scissors to cut the pointy tops off the remaining outer layer of leaves. Use a vegetable peeler or paring knife to peel the stem down to its tender pale-colored core; immediately rub the stem with a lemon half. Use your fingers to separate the center leaves to expose the fuzzy pale choke sitting on top of the heart. Use a grapefruit spoon (or other spoon) to scoop out the choke, and rub a little lemon juice over the exposed flesh. Repeat with the remaining artichokes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a medium pot with 2 inches of water, place a steamer basket inside, and bring water to a simmer. Place the artichokes bottoms down on the rack, cover with a tight-fitting lid, and simmer over low heat until you can easily pull off an artichoke leaf, 45 minutes to 1 1/2 hours. Remove from the steamer basket and transfer to a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, whisk together the lemon juice, garlic and salt. Slowly whisk in butter. To serve, have everyone pull off the leaves and dunk the meaty bottoms into the lemon butter, swirling to mix butter with each dip (the butter will separate as it sits)."}], "link": "https://cooking.nytimes.com/recipes/1019294-steamed-artichokes-with-lemon-butter"}