{"@context": "http://schema.org", "@type": "Recipe", "name": "Marshmallows", "description": "Homemade marshmallows are a cooking project that sounds totally hard, but with the right equipment (a candy thermometer and high-powered mixer) they are actually pretty simple to make and infinitely more delicious than stale marshmallows from a bag. These mallows are ideal in a cup of hot chocolate. Make them peppermint marshmallows by adding 2 teaspoons of peppermint extract. For festive swirls, add 10 drops of red food coloring at the end of Step 5, and use a toothpick to swirl the food coloring throughout the mixture.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2017/12/18/dining/18COOKING-MARSHMALLOWS2/18COOKING-MARSHMALLOWS2-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "About 36 1 1/2-inch marshmallows", "recipeCuisine": "", "recipeCategory": "candies", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 98}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 69, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "0 grams", "proteinContent": "0 grams", "saturatedFatContent": "0 grams", "sodiumContent": "37 milligrams", "sugarContent": "17 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Neutral flavored oil, for greasing the baking dish", "3 envelopes/2 tablespoons, plus 1 1/2 teaspoons powdered unflavored gelatin", "1 1/2 cups/302 grams granulated sugar", "1 cup light corn syrup", "1/4 teaspoon kosher salt", "1 tablespoon vanilla bean paste or vanilla extract", "1/2 cup/51 grams confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil an 8-by-8-inch baking dish. Combine gelatin with 1/2 cup cold water in the bowl of a stand mixer fitted with the whisk attachment. Set aside while you prepare the syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine the granulated sugar, corn syrup, salt and 1/2 cup cold water. Stir the mixture just enough to combine the ingredients then cook over medium-high heat, swirling the pan occasionally, until the mixture reaches 240 degrees on a candy thermometer, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer on low speed, carefully pour hot syrup into gelatin mixture and mix until gelatin is dissolved. Add the vanilla bean paste or extract."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the mixer to high and whip the batter until it is very thick, stiff and opaque, about 10 minutes. Pour the mixture into the prepared pan and spread it with a knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let sit uncovered until firm, about 4 hours at room temperature or 2 hours in the fridge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift a generous amount of confectioners’ sugar onto a work surface, use a knife to cut around the edges of the pan and unmold marshmallow onto the sugar. You will have to pull it out of the pan with your fingertips; it will be very sticky but will pull out in one piece. Dust the top of the marshmallow with confectioners' sugar and use a long, sharp knife to cut the marshmallow into roughly 1 1/2-inch cubes. Clean and dry your knife periodically throughout this process when it gets too sticky. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the cubes in the confectioners’ sugar to make sure they are coated on all sides and store them in an airtight container for up to 4 days."}]}