{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin Cheesecake Bars", "description": "A simple cheesecake recipe that requires no water bath or springform pan and tastes like a creamy pumpkin pie. Baked in a 9-by-13-inch pan, these are sliced into bars that are easy to serve and eat. If you want to make them a bit fancier, you can reserve some of the plain cheesecake batter to swirl into the pumpkin batter just before baking.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2018/09/05/dining/em-pumpkin-cheesecake-bars-horizontal/merlin_141963804_1c4d6787-02d5-4ed3-b0b1-ca530eb0b3e4-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "About 15 bars", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "dessert, fall, gingersnap cookies, pumpkin purée", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 629}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 419, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "14 grams", "sodiumContent": "329 milligrams", "sugarContent": "29 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 1/2 ounces/300 grams gingersnap cookies (preferably the thin Swedish variety)", "2 tablespoons granulated sugar", "1/4 teaspoon kosher salt", "1/2 cup/115 grams unsalted butter (1 stick), melted", "1 1/2 pounds/680 grams cream cheese, at room temperature", "1 cup/200 grams granulated sugar", "1/2 cup/110 grams light brown sugar", "6 large eggs", "1 tablespoon vanilla extract", "1 1/2 teaspoons pumpkin pie spice", "1 (15-ounce/425-gram) can pumpkin purée (not pumpkin pie filling)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "1. Heat the oven to 375 degrees. Lightly grease a 9-by-13-inch pan and line with parchment paper, leaving a 2-inch overhang on two sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: In a food processor, pulse the cookies until they form fine crumbs (you will have about 2 1/2 cups of crumbs). Transfer the crumbs to a medium bowl, and stir in the sugar and salt. Add the melted butter and mix until evenly incorporated. Press the crust into an even layer in the base of the prepared pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the crust has browned slightly and appears set, 10 to 12 minutes. Cool completely. Reduce oven temperature to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Wipe out the bowl of the food processor, and place the cream cheese, sugar and brown sugar inside. Pulse until the mixture is fully combined. Add the eggs one at a time and pulse until incorporated, scraping down the sides of the food processor bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vanilla and pumpkin pie spice, and pulse until combined. If desired, reserve 1 cup of the cheesecake batter in a small bowl to make a swirl effect later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pumpkin to the remaining cheesecake batter, and pulse until fully incorporated. Pour the pumpkin cheesecake into the cooled crust. If using, slowly pour the reserved white cheesecake batter over the pumpkin cheesecake batter in a slow, thin stream, and use a toothpick or wooden skewer to swirl the two batters together. (If you pour too quickly, the white batter will sink inside the pumpkin.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cheesecake until the edges appear set and the center still appears slightly jiggly, 35 to 40 minutes. Cool at room temperature for 45 minutes, then refrigerate until firm (at least 2 hours, up to overnight). Use a sharp knife to release the edges and use the parchment paper to carefully lift the cheesecake from the pan and transfer it to a cutting board. Slice into 15 even pieces, wiping the knife between cuts for the cleanest edges."}]}