{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Hot Cakes With Cheddar Cream and Salsa Verde", "description": "As comforting and substantial as these potato cakes are when served plain, they also support the theorem that most dishes are improved by the addition of a fried egg. The peppery cream and tangy salsa round out all the flavors and textures for a perfect weekend breakfast. Start with (1 1/4 cups/230 grams) leftover mashed potatoes should you happen to have some.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2017/12/20/dining/20BakingPotatohotcakes1/20BakingPotatohotcakes1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, lunch", "keywords": "cheddar, potato, tarragon", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 132}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 504, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "5 grams", "proteinContent": "12 grams", "saturatedFatContent": "11 grams", "sodiumContent": "629 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 pounds/600 grams (about 6) all-purpose potatoes such as Yukon Gold or Maris Piper, halved lengthwise", "Finely grated zest of 2 lemons", "2 teaspoons freshly squeezed lemon juice", "2 eggs, beaten", "Salt and black pepper", "3 tablespoons/45 milliliters olive oil, more as needed", "4 to 8 eggs at room temperature, for serving", "1 teaspoon black mustard seeds, lightly toasted in a frying pan without oil just until fragrant (optional)", "3 ounces/80 grams Cheddar cheese, preferably aged, freshly grated into shreds (about 1 1/2 cups shreds)", "1/2 cup/100 grams sour cream (soured cream)", "Freshly ground black pepper", "1 1/2 tablespoons/5 grams finely chopped parsley leaves", "1 1/2 tablespoons/5 grams finely chopped tarragon leaves", "2 teaspoons/5 grams capers, finely chopped", "1/4 garlic clove, minced or crushed", "1/3 cup/60 milliliters olive oil", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange potatoes, cut side down, on a large parchment-lined baking sheet. Bake for 35 minutes or until crisp and golden-brown on the outside and soft inside; cooking time will vary depending on the size of your potatoes, but you want the flesh to be soft enough to mash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the Cheddar cream: In a small bowl, combine Cheddar and sour cream. Add freshly ground black pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salsa: In a bowl, mix the herbs, capers and garlic with about 1/3 cup/60 milliliters of oil and a generous pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the potatoes are cool enough to handle (about 15 minutes), peel away and discard (or eat) the skins, being careful not to lose too much flesh. Use a potato masher to mash the flesh until smooth or chunky, as you like. Transfer about 1 1/4 cups/230 grams of the mashed potatoes to a mixing bowl. (Save any extra mash for another use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add lemon zest, beaten eggs, 1/4 teaspoon salt and a few grinds of black pepper and mix until eggs are completely incorporated. Your batter will look like glossy, runny mashed potato."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry the hot cakes: Add 2 tablespoons of oil to a large nonstick frying pan and place over medium-high heat. Spoon about 1/4 cup of batter per hot cake into the pan and fry for 4 to 5 minutes, turning over once, until crisp and golden on both sides. Set aside on a paper towel-lined plate and keep warm. If you have more batter, add a final tablespoon of oil to the pan and fry the remainder in the same way. You may want to turn the heat down for the second batch if the oil is getting too hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, fry the eggs in the same pan, using additional oil if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir lemon juice into salsa. Divide the hot cakes between plates and top with the eggs, the Cheddar cream and then salsa verde; the salsa should cover a bit of the cream but not all of it. Sprinkle with the mustard seeds (if using) and serve."}], "link": "https://cooking.nytimes.com/recipes/1019099-potato-hot-cakes-with-cheddar-cream-and-salsa-verde"}