{"@context": "http://schema.org", "@type": "Recipe", "name": "Butterscotch Blondies", "description": "These rich, chewy bars get their deep caramel flavor from a combination of brown butter, dark brown sugar and an optional sprinkle of flaky salt on top. They're delicious as is, but feel free to add some mix-ins (see note), if that’s more your style. You'll want to keep the amount of extra ingredients, like nuts, chocolate and dried fruits, to 2 cups total, since blondies with a lot of mix-ins may take a few minutes longer to bake. For an especially delicious combination, try a mix of 1 cup chopped bittersweet chocolate or chips, 1/2 cup toasted walnuts and 1/2 cup chopped pitted dates.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2017/12/11/dining/11COOKING-BUTTERSCOTCHBLONDIE2/11COOKING-BUTTERSCOTCHBLONDIE2-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "16 servings", "recipeCuisine": "", "recipeCategory": "cakes, quick breads", "keywords": "dark brown sugar, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 307}, "recipeIngredient": ["1 cup/227 grams unsalted butter, plus more for greasing the pan", "1 1/2 cups/330 grams dark brown sugar", "2 teaspoons vanilla extract", "1 teaspoon kosher salt", "2 large eggs", "1 3/4 cups/224 grams all-purpose flour", "1/2 teaspoon baking powder", "Any mix-ins you like (see note)", "1/4 teaspoon flaky salt (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and butter and line a 9-by-9-inch baking dish with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a saucepan over medium heat. Cook butter, occasionally scraping the bottom and sides of the pan with a rubber spatula, until it turns deep golden brown and smells nutty. Don’t walk away from the pan during this process. The butter can go from brown and nutty to acrid and burnt in mere moments. Transfer the butter and all the brown bits from the pan to a large heat-safe bowl to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the butter is cool (but still melted), add sugar, vanilla extract and salt. Whisk until smooth. Add the eggs and mix until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold in the flour and baking powder along with any mix-ins until well combined and no streaks of flour remain in the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour batter into prepared pan, smooth the top, and sprinkle with flaky salt, if desired. Bake the blondies until set and slightly puffy, 20 to 27 minutes. For gooey blondies, err on the short side of the baking time. Cool before slicing."}], "link": "https://cooking.nytimes.com/recipes/1019068-butterscotch-blondies"}