{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Lasagna With Spinach and Summer Squash", "description": "Lasagna in the summer? It’s fine food for those long, breezy summer days when you need to fill your belly without turning on the oven. This one-pan stovetop lasagna is a true crowd-pleaser, with rich tomato, oozing cheese and just enough squash and spinach to skip salad for the night. Using no-cook lasagna, you can cook this entirely over a low flame, covered. (Use foil if you don’t have a lid that fits your pan.) Be sure to start with a well-seasoned cast-iron pan, and never let the tomato sauce boil, which can be hard on your pan and on the flavor of your sauce. If your cast-iron seasoning isn’t in tip-top shape, try this in a stainless-steel skillet instead; you’ll still get all the depth and aroma, and that same stove-to-table ease that will make this a repeat meal all year long.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/08/01/dining/sc-skillet-lasagna/sc-skillet-lasagna--articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "baby spinach, lasagna noodles, squash, zucchini, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 402}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 579, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "5 grams", "proteinContent": "31 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1158 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons olive oil", "1 medium onion, thinly sliced", "4 garlic cloves, thinly sliced", "1 zucchini, chopped (6 ounces)", "1 yellow squash, chopped (10 ounces)", "2 packed cups baby spinach leaves", "1 (28-ounce) can whole peeled San Marzano tomatoes", "1 teaspoon salt", "1/2 teaspoon black pepper", "8 sheets (half a 9-ounce package) no-cook or oven-ready lasagna noodles", "8 ounces fresh ricotta cheese (about 1 cup)", "1 1/2 ounces finely grated Parmesan, plus more for serving (about 1/3 cup)", "8 ounces fresh mozzarella, thinly sliced", "Handful of small basil leaves, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a well-seasoned large cast-iron skillet over medium-low heat. Add onion and cook until softening, 5 minutes. Add the garlic and cook until fragrant, 5 minutes more. Increase the heat to medium, add the zucchini and yellow squash and cook until soft and lightly golden, 10 minutes more, adding the spinach in the last 2 minutes of cooking. Stir constantly until the spinach is wilted. Transfer the cooked vegetables to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the vegetables cook, crush the tomatoes with a potato masher in a bowl and season with salt and pepper. Spoon a thin layer over the bottom of the pan (about 1/3 of the tomatoes). Add 4 lasagna sheets, breaking off the edges to fit into the curved edges of the pan. Top with half the vegetables, and drop half the ricotta by spoonfuls over the top. Repeat with another 1/3 of the tomatoes, the remaining vegetables and ricotta. Top with another layer of 4 lasagna sheets, the remaining sauce, and layer the Parmesan and mozzarella over the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with salt and pepper, cover and cook over a low simmer until the pasta is soft and the cheese has completely melted, 5 to 10 minutes. Uncover and continue to cook on medium-high until the tomato has thickened, 5 minutes more. Set aside to cool slightly, 5 to 10 minutes, before cutting. Sprinkle basil and more Parmesan over the lasagna and serve."}]}