{"@context": "http://schema.org", "@type": "Recipe", "name": "Gajar Halwa (Carrot and Cardamom Pudding)", "description": "The recipe for this Indian dessert comes from the North Carolina chef Cheetie Kumar, and it instantly transports her to her mother’s kitchen around Diwali, the air rich with the aroma of fragrant carrots, caramelized milk and cardamom. The carrots are cooked down to be incredibly tender, but they still maintain some texture; the milk becomes jammy. If eaten warm, it’s like a really decadent warm cereal or oatmeal; if served cold, it’s like rice pudding, cool and sweet. The crunch of the toasted nuts make it the perfect meal-ender or tea time snack. If your carrots are bland, increase the sugar accordingly; the sweetness of the carrots makes a huge difference in the finished pudding. Some people prefer a looser halwa, but Ms. Kumar loves the caramelized notes that emerge when the pudding is cooked a little longer.", "author": {"@type": "Person", "name": "Brigid Washington"}, "image": "https://static01.nyt.com/images/2018/10/31/dining/31diwalirex2/merlin_145697367_a228c430-4915-40e4-9313-ad78e4bc9e93-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "3 to 4 servings", "recipeCuisine": "indian", "recipeCategory": "custards and puddings", "keywords": "cardamom, carrot, ghee, milk, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 53}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 350, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "11 grams", "sodiumContent": "150 milligrams", "sugarContent": "27 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons plus 2 teaspoons ghee or clarified butter", "8 to 10 large peeled and shredded carrots (about 4 cups/455 grams), prepared with a food processor into long strands or grated on the large holes on a box grater", "3 cups/720 milliliters good-quality whole milk", "1/2 teaspoon green cardamom seeds, removed from several pods or purchased already shucked, crushed lightly in mortar and pestle", "1/4 cup/50 grams granulated sugar, plus more to taste", "1/4 cup/30 grams chopped toasted pistachios, almonds or a mixture"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide, heavy-bottomed skillet (don't use nonstick) over medium heat, melt ghee, then add carrots. Stir until carrots are well coated with ghee. Reduce heat to medium-low and cook until carrots are somewhat dry and caramelized, about 20 to 25 minutes, stirring often so they don’t scorch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the carrots are nice and dried out, stir in the milk and cardamom and simmer, stirring every few minutes, until the milk has reduced and is almost fully absorbed, about 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle in the sugar, mix well to combine, and cook 5 to 8 more minutes until the mixture is almost dry and jammy. Serve warm or cold with toasted nuts sprinkled over the top."}], "link": "https://cooking.nytimes.com/recipes/1019679-gajar-halwa-carrot-and-cardamom-pudding"}