{"@context": "http://schema.org", "@type": "Recipe", "name": "Burekas With Spinach or Eggplant Filling", "description": "These little pocket pastries are adapted from the ones made at Congregation Or VeShalom in Atlanta. The women there make theirs with oil, which is traditional, but this version with butter is more tender. The dough is easy to work with and the fillings are delicious on their own; use any leftovers in eggs for breakfast.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2018/11/28/dining/28burekarex1/merlin_146903526_1d128551-4221-4134-bf21-eb2705b0ce73-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "About 20 burekas", "recipeCuisine": "jewish, turkish", "recipeCategory": "lunch, snack, pastries", "keywords": "appetizer, eggplant, feta, spinach, tomato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 137}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 262, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "9 grams", "saturatedFatContent": "7 grams", "sodiumContent": "446 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 cups all-purpose flour/320 grams, plus more for rolling the dough", "1 teaspoon kosher salt", "1/4 pound/115 grams cold unsalted butter (1 stick), cut into 1/2-inch cubes", "1/2 cup/120 milliliters ice water, plus more as needed", "Egg wash (1 large egg mixed with 1 tablespoon water)", "1 medium eggplant (about 1 pound/455 grams)", "2 tablespoons olive oil", "1 small onion, diced (about 1/2 cup/115 grams)", "Kosher salt and ground black pepper", "1/2 cup/115 grams strained diced tomatoes (from a can)", "1/4 cup/25 grams grated Parmesan, plus more for topping", "1 large egg, beaten", "2 teaspoons all-purpose flour", "1 package frozen chopped spinach (16 ounces/455 grams), defrosted and drained", "3/4 cup/115 grams crumbled strongly flavored feta cheese", "1/2 cup/50 grams grated Parmesan, plus more for topping", "Kosher salt and ground black pepper", "1 large egg, beaten", "1 tablespoon all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using the eggplant-tomato filling, heat the oven to 425 degrees. Pierce the eggplant several times with a knife and roast on a parchment- or foil-lined baking sheet until the eggplant collapses and is completely soft, 35 to 40 minutes. When cool enough to handle, remove and discard the skin; transfer the flesh to a strainer to drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In the bowl of a food processor fitted with the metal blade attachment, add the flour and salt and pulse briefly to combine. Add the butter and pulse just until the butter pieces are the size of peas. Slowly add the ice water and process just until combined. Form the dough into 2 disks about 1 inch thick, wrap in plastic and refrigerate for at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the oven to 350 degrees and line a baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using the spinach-feta filling: In a medium bowl, combine the spinach, feta and Parmesan. Season to taste with salt and pepper, then add egg and flour. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using the eggplant-tomato filling: In a medium-sized frying pan over medium heat, heat the olive oil. Add the onions, season with salt, and cook until beginning to soften but not brown, about 3 to 5 minutes. Stir in the tomatoes and eggplant, breaking them up with a wooden spoon, and cook until the mixture begins to thicken and loses some of its moisture, about 5 minutes. Season to taste with salt and pepper and remove from the heat. When the mixture has cooled, stir in the Parmesan, egg and flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one disk of dough at a time, on a lightly floured surface and using a lightly floured rolling pin, roll out the dough into a circle about 1/8-inch thick or slightly thinner. Using a 3 1/2-inch/9-centimeter circle cutter, cut as many circles as you can from the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Hold a circle in your hand and fill with 1 tablespoon of filling. Fold up the sides into a half-moon shape and pinch the edges closed to seal, crimping them if you like. Place the sealed bureka on the prepared baking sheet and repeat with the remaining dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the tops lightly with the egg wash and sprinkle with a large pinch of grated Parmesan. Bake for 30 to 35 minutes or until the crusts are golden brown."}], "link": "https://cooking.nytimes.com/recipes/1019779-burekas-with-spinach-or-eggplant-filling"}