{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Mint Tart", "description": "This chocolate mint tart is wonderfully reminiscent of a giant, elegant peppermint patty, tucked into a chocolate pastry shell. The mint flavor is subtle thanks to fresh-mint infused cream that is used both in the white chocolate ganache filling and billowy topping. But don’t worry, dark-chocolate lovers: There is plenty here for you, too. The crisp crust is spiked with Dutch-processed cocoa and the middle layer is deep, dark bittersweet chocolate ganache. It’s also very rich; a thin slice alongside a cup of coffee is the perfect after-dinner mint. This recipe has multiple chilling steps, so plan ahead if you're going to make it. It's more of an afternoon project, than a simple weeknight endeavor.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2017/12/18/dining/18COOKING-CHOCOLATE-MINT-TART/18COOKING-CHOCOLATE-MINT-TART-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "One 9-inch tart", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 49}, "recipeIngredient": ["1 1/4 cups/160 grams all-purpose flour", "1/2 cup/62 grams confectioners’ sugar", "1/4 cup/24 grams Dutch-processed cocoa powder", "1/4 teaspoon kosher salt", "1/2 cup/113 grams unsalted butter (1 stick), cold and cut into cubes", "1 egg yolk ", "1 3/4 cups heavy cream", "1 cup/15 grams fresh mint leaves, packed", "10 3/8 ounces/297 grams white chocolate, chopped", "2 tablespoons unsalted butter, softened", "Pinch of kosher salt", "1/2 teaspoon peppermint extract (optional)", "1/2 cup heavy cream", "3 1/2 ounces/99 grams bittersweet chocolate, chopped", "2 tablespoons unsalted butter, softened", "Pinch of kosher salt", "1 cup reserved mint-infused cream", "2 teaspoons confectioners’ sugar", "1/4 to 1/2 teaspoon peppermint extract, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: In the bowl of a food processor, combine the flour, confectioners’ sugar, cocoa powder and salt. Pulse to combine. Add the butter and pulse until the mixture resembles coarse meal.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk the egg yolk with 1 tablespoon cold water. Add the yolk mixture to the food processor and pulse until it is evenly distributed. The mixture will appear crumbly, but should hold together very easily when pressed. Add a bit more water, 1 teaspoon at a time, if necessary. Turn the mixture out onto a piece of plastic wrap and form it into a disc. Wrap the disc in plastic and refrigerate for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll the chilled dough into a circle 1/4- to 1/8-inch thick. Gently fit the dough into a 9-inch tart pan with a removable bottom and trim the top evenly. Repair any cracks or tears in the dough with the trimmings and reserve the trimmings, wrapped in plastic and kept at room temperature, to use later if necessary. Freeze for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the shell is chilling, heat oven to 375 degrees. Just before baking, dock the shell all over with a fork, and line the bottom and sides with aluminum foil. Bake the shell until it is cooked through and crisp, about 25 minutes. Remove the foil and, using the leftover dough, repair any cracks that may have formed. Cool the shell on a rack while you prepare the rest of the tart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the white chocolate ganache: Heat the 1 3/4 cups heavy cream and mint leaves in a saucepan over medium-high until simmering. Turn off heat and let cream steep for at least 30 minutes and up to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the cream through a fine mesh sieve, pressing on the leaves to extract as much cream as possible. Reserve 1 cup of the cream, covered, in the refrigerator. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining 3/4 cup of cream until simmering and pour it over the white chocolate in a large bowl or the bowl of a stand mixer. Whisk the mixture until smooth, then let it cool to room temperature, about 30 minutes. If the chocolate is resisting melting, set the bowl over a pan of simmering water and whisk until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter and a pinch of salt and whip the ganache on high speed for 10 minutes. It will go from slightly translucent to opaque and aerated. Taste and add the peppermint extract if desired. Pour the whipped ganache into the cooled tart shell, smooth the top and refrigerate until firm, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the bittersweet ganache: Bring the cream to a simmer in a small saucepan. Add the chocolate, butter and salt to a heat-safe bowl and whisk in the hot cream until smooth. If the chocolate is resisting melting, set the bowl over a pan of simmering water and whisk until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a spatula to spread the bittersweet ganache over the cooled white chocolate ganache. Refrigerate until firm, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, make the mint cream topping: Whip the reserved 1 cup of infused cream with the confectioners’ sugar to soft peaks. Add peppermint extract, if desired. Spread the whipped cream over the top of the ganache and serve the tart cold. Wipe off your knife in between slices for the cleanest cuts."}], "link": "https://cooking.nytimes.com/recipes/1019103-chocolate-mint-tart"}