{"@context": "http://schema.org", "@type": "Recipe", "name": "Charred Tangerines on Toast", "description": "For an unexpectedly good hors d’oeuvre, char tangerines. Yes, tangerines. Letting the blackened citrus steep in an herby oil yields a sweet, silky and pleasantly bitter result. They’re delicious on baguette toasts with just a spoonful of the oil, flaky salt and cracked black pepper. Or serve them with rich crème fraîche, ricotta, prosciutto or leftover ham, which offsets the sourness of the citrus.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2018/12/06/dining/as-charred-tangerines-horizontal/as-charred-tangerines-horizontal-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "6 to 10 servings (about 2 cups)", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, quick, snack, finger foods", "keywords": "appetizer, baguette, cloves, honey, red pepper flakes, rosemary, thyme, fall, spring, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 241}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 129, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "200 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["7 to 9 tangerines or clementines", "1/4 cup plus 2 tablespoons extra-virgin olive oil (preferably something fruity)", "1 sprig rosemary or thyme", "1 teaspoon honey", "4 cloves", "1/2 teaspoon red-pepper flakes", "Kosher salt and black pepper", "Toasted baguette slices, for serving", "Flaky salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the tangerines or clementines, discarding the skins. Remove any thick pith and strings from the peeled fruit, but leaving the membranes intact, and separate the fruit into segments. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over the lowest possible heat, combine 1/4 cup oil with the rosemary or thyme, honey, cloves and red-pepper flakes. Season with salt and pepper. Simmer until the oil is fragrant and infused with the aromatics, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mixture to a heatproof bowl and return the skillet to the stove. Crank the heat to high and add the remaining 2 tablespoons oil. Once the oil is just smoking, carefully add the fruit segments in a single layer (they may spatter a bit). Season with salt and pepper and cook until deep golden-brown, turning halfway through, about 1 or 2 minutes per side. Gently transfer the fruit to the infused oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top each slice of baguette with charred fruit, a drizzle of the oil and some flaky salt—or let the fruit segments marinate in the oil at room temperature for up to 1 day. (They will keep in the refrigerator for up to 3 days. Allow to come to room temperature before serving.)"}]}