{"@context": "http://schema.org", "@type": "Recipe", "name": "Surnoli (Coconut-Rice Pancakes)", "description": "Surnoli are soft, round and puffy pancakes, about the size of a diner’s silver dollars, and they can be served like them too, as a warm stack with a piece of melting butter on top. But surnoli batter contains no egg and no flour, and it isn't flipped at all but left to cook through on one side. Made from puréed raw and cooked rice, as well as coconut, and fermented with yogurt overnight, the konkani pancake becomes airy and takes on a gentle tang. Have it plain with a drizzle of ghee, or even a little honey. And if you want to try them savory, open a jar of your favorite Indian pickles instead. If you want to skip the longer fermentation, you could add a half teaspoon of Eno — an antacid made from sodium bicarbonate and citric acid, commonly used to fizz batters in Indian kitchens — just before you're ready to start cooking.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/08/26/magazine/26mag-eat-image4/26mag-eat-image4-articleLarge-v2.jpg", "totalTime": "PT8H45M", "recipeYield": "Makes 16 to 20 pancakes", "recipeCuisine": "indian", "recipeCategory": "pancakes", "keywords": "coconut, jaggery, white rice, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 188}, "recipeIngredient": ["2 cups raw white rice (short- or long-grain, jasmine or Basmati)", "1 cup poha or leftover cooked rice", "1 cup (4 ounces) fresh coconut or 1/2 cup (1 ounce) dried, unsweetened coconut", "1 cup full-fat yogurt", "3 tablespoons jaggery, grated if hard", "1/4 teaspoon turmeric powder", "1/2 teaspoon kosher salt", "Ghee, as needed for cooking the pancakes", "Butter or ghee, to serve", "Honey, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the rice several times in warm water until the water runs almost clear, and soak for an hour. Drain the rice. In a blender, combine all ingredients except the salt and ghee, butter and honey with 1 cup water, and mix on high speed. If you need to, add a splash more water, just enough to help the ingredients catch the blade and produce a thick, smooth batter. Scrape batter into a bowl, cover loosely with plastic wrap and leave at room temperature to ferment overnight, or about 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add salt, and give the batter a gentle stir. Add a little water, if needed. It should be thicker than pancake batter but somewhat airy from the fermentation. Heat a nonstick pan over medium heat. When it’s hot, add a half teaspoon of ghee, followed by about 2 ounces surnoli batter. Immediately tilt the pan around to encourage the batter to spread a little, into a small, thick circle. Cover the pan with a lid, and let the surnoli cook gently without flipping it. When the top is pocked all over with holes and cooked through, and the bottom is a golden brown, about 3 to 4 minutes, transfer to a plate and serve with some butter or ghee, and honey. Repeat with remaining batter."}]}