{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Spaghetti With Caramelized Onions and Herbs", "description": "Except perhaps for the fresh herbs, you probably have all the necessary ingredients to make this incredibly flavorful, easy pasta. The caramelized onions add sweetness to the salty olives and Parmesan, while red chile and garlic make the dish's flavors pungent and deep. A squeeze of fresh lemon right at the end brightens everything, adding a mild tang. Feel free to play around with the basic formula, swapping capers or even a small tin of sardines or tuna for olives, vinegar for the lemon, arugula or spinach for the parsley, and other cheeses (feta or pecorino) for the Parmesan.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/10/03/dining/03Appe1/merlin_143727540_b02861fe-df6f-4fc4-8cb4-441940147547-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "3 to 4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas", "keywords": "anchovies, basil, olives, parsley, spaghetti, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 419}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 536, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "73 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "5 grams", "proteinContent": "13 grams", "saturatedFatContent": "6 grams", "sodiumContent": "479 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Kosher salt, as needed", "1/4 cup extra-virgin olive oil", "2 large white or Spanish onions, halved and very thinly sliced", "12 ounces spaghetti", "6 garlic cloves", "1/2 teaspoon chile paste or red-pepper flakes, or to taste", "2 anchovies, chopped (optional)", "1 cup chopped mix of parsley and basil (or use all parsley)", "1/3 cup chopped cured Moroccan or other intensely flavored black olives", "2 tablespoons unsalted butter, cubed", "Lemon wedges, for squeezing", "Grated Parmesan, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large pot of heavily salted water on and let it come to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the onions: Heat 1/4 cup oil in a 12-inch skillet over medium heat. Add onions and cook, stirring occasionally, until tender and pale golden at the edges, 20 to 25 minutes. Lower heat if the edges start to brown too quickly or raise heat if onions aren’t turning golden quickly enough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water comes to a boil, cook spaghetti according to package directions until just al dente. Reserve 1 cup pasta water; drain pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice 4 garlic cloves, and stir into golden onions, along with red-pepper flakes. Continue to cook until onions are a rich brown, about 10 minutes longer. If the garlic starts to burn, lower the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely grate remaining garlic cloves, and mash into anchovies using the flat side of your knife. Move some of the onion mixture to the side of the pan and add anchovy paste to bare spot in the skillet. Cook paste for 1 minute, then add herbs and olives, stir everything together, and cook another 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in cooked pasta, butter, and salt to taste, tossing to coat pasta. Add pasta water if it looks dry. Serve with a generous squeeze of lemon, and sprinkle with Parmesan and more chile on top, if desired."}], "link": "https://cooking.nytimes.com/recipes/1019604-spicy-spaghetti-with-caramelized-onions-and-herbs"}