{"@context": "http://schema.org", "@type": "Recipe", "name": "Galette des Rois", "description": "The <em>galette des rois,</em> celebrating Epiphany, the day the Three Kings (<em>les rois</em>) visited the infant Jesus, is baked throughout January in France. Composed of two circles of puff pastry sandwiching a frangipani filling, each comes with a crown and always has a trinket, called a <em>fève</em>, or bean, baked into it. It’s an invitation to gather, as much party game as pastry – if your slice has the <em>fève</em>, you get the crown and the right to be king or queen for the day. Happily, the galette can be made to fit your schedule. The pastry circles can be cut, covered and refrigerated ahead of time as can the almond filling (it will keep for up to 3 days). And the whole construction can be made early in the day and baked when you’re ready for it. Tuck a bean or whole almond into the filling — warn your guests! — and, if there are children in the house, put them to work crafting a crown. ", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2017/12/24/magazine/24mag-ondessert1/24mag-24ondessert-t_CA0-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "Serves 8", "recipeCuisine": "french", "recipeCategory": "pastries", "keywords": "almond flour, puff-pastry dough, unsalted butter, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 456}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 864, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "61 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "18 grams", "sodiumContent": "385 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons (85 grams) unsalted butter, at room temperature", "3/4 cup (85 grams) confectioners’ sugar", "3/4 cup (85 grams) almond flour", "1/4 teaspoon salt", "2 large eggs, at room temperature", "1 tablespoon rum (optional)", "1 teaspoon pure vanilla extract", "2 9 1/2-inch-diameter circles puff-pastry dough (from a 14- to 17-ounce package; 396-482 grams), cold", "1 whole almond or dried bean, for the charm"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "To make the filling:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with a mixer or by hand, beat the butter and sugar together until creamy and light. Beat in the almond flour and the salt. Mix in 1 whole egg, then the white from the second egg (reserve the yolk). Mix in the rum, if using, and the extract. Cover, and refrigerate for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the yolk with 1 teaspoon cold water; cover, and refrigerate until needed."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To assemble:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one circle of dough on a baking sheet lined with parchment paper. Spread the filling evenly over the dough, leaving a 1-inch border bare. Press the charm into the filling. Moisten the border with cold water, position the second circle of dough over the filling and press around the border with your fingertips to seal well. Using the back of a table knife, scallop the edges by pushing into the dough (about 1/4- to 1/2-inch deep) every 1/2 inch or so. Refrigerate for at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425. Brush a thin layer of the reserved yolk glaze over the top of the galette, avoiding the border (if glaze drips down the rim, the galette won’t rise). With the point of a paring knife, etch a design into the top of the galette, taking care not to pierce the dough. Cut 6 small slits in the top as steam vents."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat down to 400, and bake for 30 to 40 minutes, until the galette is puffed and deeply golden. Check after 20 minutes, and tent loosely with foil if it’s browning too much or too fast. Transfer to a rack, and cool for at least 15 minutes (the galette may deflate — that’s puff pastry for you). Serve warm or at room temperature."}]}], "link": "https://cooking.nytimes.com/recipes/1019114-galette-des-rois"}