{"@context": "http://schema.org", "@type": "Recipe", "name": "Pigs in a Blanket", "description": "For decades, pigs in a blanket have been a staple on the cocktail-party circuit. The little sausages are the easy part. It’s the pastry which, at its finest, should approximate buttery, flaky French puff pastry or pâte feuilletée. Suppose you could make decently flaky puff pastry in minutes? Christian Leue, the manager of La Boîte, a spice emporium in New York, has developed just such a marvel. And it works.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2018/12/12/dining/12burner6/merlin_147951828_0f5638d5-4917-4b93-b556-d3fd23e3ffed-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "48 pieces", "recipeCuisine": "", "recipeCategory": "easy, snack, finger foods", "keywords": "appetizer, fall, spring, summer, winter, sausage, sour cream", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 226}, "recipeIngredient": ["2 sticks salted butter, frozen", "1 1/2 cups all-purpose flour, plus more for kneading", "1/2 cup full-fat sour cream", "48 cocktail franks", "Flour, for rolling", "Mustard, for dipping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the puff pastry:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pastry: Cut each stick of frozen butter into four pieces and grate using a shredding disc in a food processor. Change to the regular blade. Add the 1 1/2 cups flour and pulse 15 or 20 times, until the mixture resembles coarse crumbs. Add the sour cream and pulse until the dough comes together. (This can also be done by hand, using a box grater to shred the butter, working the flour into it with your fingertips or a fork, then mixing in the sour cream.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out on a floured surface and knead briefly to form a smooth ball. Divide the dough in half and flatten each piece. Place each in a zipper-top sandwich bag, press out any air, seal the bag and use a rolling pin to roll the dough until it fills the bag, forming a square. Refrigerate two hours or overnight."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the pigs in a blanket:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pigs in a blanket: Heat a 10-inch skillet, preferably cast-iron, on medium. If your cocktail franks came in a plastic package, pat them dry on paper towels. Place the franks in the pan and cook, turning, frequently, until they’re lightly browned, 6 to 8 minutes. Remove from the pan and drain on paper towels. Let cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove dough from sandwich bags by cutting the bags and peeling them off. Roll each square of dough on a lightly floured board into a 9-by-12-inch rectangle that is about 1/8-inch thick. Cut each into four 9-by-3-inch strips, then cut each strip crosswise into six 1 1/2-inch sections. You should have 48 rectangles that are each 1 1/2 by 3 inches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line a baking sheet with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a cocktail frank on each piece of dough, across the rectangle so the longer side can be wrapped around the frank. Roll the dough around the frank, moisten the edge with water and press closed. Place each wrapped frank seam side down on the baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden, about 25 minutes. Serve at once or let cool and refrigerate or freeze, then let come to room temperature and warm at 250 degrees for 15 minutes. Serve with mustard alongside for dipping."}]}], "link": "https://cooking.nytimes.com/recipes/1019821-pigs-in-a-blanket"}