{"@context": "http://schema.org", "@type": "Recipe", "name": "Poached Eggs in Red Wine (Oeufs en Meurette)", "description": "Oeufs en meurette is a classic French dish of poached eggs covered in a rich red wine sauce filled with lardons, mushrooms and onion. When the writer Michael Harlan Turkell was working on his book “Acid Trip: Travels in the World of Vinegar,” he picked up a tip from the French chef Bertrand Auboyneau of Bistrot Paul Bert in Paris. A generous amount of red wine vinegar, added to the sauce, lightens and brightens the dish, all the while emphasizing the flavors of red wine. Use the best-tasting vinegar you can get your hands on, since there's enough of it here to really redirect the taste of the sauce. To turn the recipe into a full, hearty meal, just poach two eggs for each person, instead of one, and add a side of simply dressed salad greens.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/02/07/dining/07VinegarRex1/07VinegarRex1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 Servings", "recipeCuisine": "french", "recipeCategory": "breakfast, brunch, dinner, lunch", "keywords": "bacon, eggs, mushrooms, red wine, vinegar, high protein, low-carb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 32}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 568, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "3 grams", "proteinContent": "14 grams", "saturatedFatContent": "7 grams", "sodiumContent": "915 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 thick slices bacon, cut crosswise into 1/2-inch-wide strips (lardons)", "10 to 12 pearl onions, peeled and trimmed", "6 ounces button mushrooms, trimmed and thickly sliced", "1 clove garlic, crushed", "3 cups red wine, such as a Burgundy", "1 teaspoon sugar", "1 teaspoon fresh thyme leaves, roughly chopped", "1/4 cup good quality red wine vinegar", "1/4 cup extra-virgin olive oil", "4 slices white bread", "Kosher salt and freshly ground black pepper, to taste", "4 eggs", "2 sprigs parsley, leaves chopped, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the bacon to a large saucepan over medium heat, stirring occasionally until it’s cooked through and browning slightly at the edges, about 6 minutes. Remove from pan and set aside. If a lot of fat has rendered in the pan, pour some out, leaving about 2 tablespoons in the pan. Add onions and mushrooms and cook until the water from the mushrooms has evaporated, about 6 minutes. Add garlic and cook, stirring occasionally, until it no longer smells raw, about 2 minutes. Add red wine, sugar and thyme. Simmer for 30 minutes, or until the wine has reduced by a third. Add red wine vinegar and 1/4 cup water and simmer on low until the sauce has reduced by another third, about 20 minutes. The sauce should taste bright and tangy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a sauté pan over medium heat, add the olive oil. When hot, gently fry the bread on both sides until lightly golden brown, about 2 minutes on each side. (If the pan is small and you’re working in batches, add more oil to the pan as needed.) Cut the bread into strips, lightly season with salt and set aside on a paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a deep saucepan with enough water to completely cover an egg. Bring to a boil, then reduce heat so the water is at a gentle simmer. Working with one egg at a time, break the eggs into a ramekin and gently slide them into the water, using a spoon to direct their shape in the water. Poach for about 3 to 4 minutes, until the whites are set but the yolks are still soft and runny."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill 4 ramekins with the mushrooms, onions and red wine sauce. Add a poached egg to each, sprinkle the bacon and parsley (if using) over the top and serve the fried bread on the side. Top the eggs with freshly ground black pepper."}], "link": "https://cooking.nytimes.com/recipes/1019164-poached-eggs-in-red-wine-oeufs-en-meurette"}