{"@context": "http://schema.org", "@type": "Recipe", "name": "Couscous Salad With Turmeric, Chickpea and Tomato", "description": "Turmeric highlights the golden hue of couscous while adding a welcome bit of flavor. The grains are paired with tomatoes, which have been left to sit in red wine and vinegar, infusing them with flavor and making the dressing even more juicy for the couscous-chickpea mix. If you want the onion to be nice and crisp and to take its raw edge off, put the slices in a bowl of ice and water before you cook the couscous. Drain them right before tossing them in. You can add even more crunch by topping the salad with sliced celery or chiles, if you like your food spicy. Either thinly sliced fresh chiles, such as fresno or jalapeños, or preserved ones, like peppadews or hot cherry, work well.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2018/08/17/dining/turmeric-couscous/turmeric-couscous-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, grains and rice", "keywords": "arugula, chickpea, couscous, feta, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 47}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 341, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "6 grams", "proteinContent": "11 grams", "saturatedFatContent": "3 grams", "sodiumContent": "346 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 teaspoon ground turmeric", "1/4 cup plus 2 tablespoons extra-virgin olive oil, plus more to taste", "1/2 teaspoon kosher salt, plus more for seasoning", "1 3/4 cups couscous (10 ounces)", "1/3 cup red-wine vinegar, plus more to taste", "Black pepper", "3 medium ripe tomatoes, diced (2 1/2 cups)", "1 (15-ounce) can chickpeas, rinsed and drained", "1 small red onion, halved and very thinly sliced", "5 ounces baby arugula", "4 ounces feta cheese, crumbled (1/2 cup)", "Thinly sliced celery, or fresh or jarred chile peppers, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the turmeric, 2 tablespoons oil and 1/2 teaspoon salt with 2 cups water in a large saucepan. Bring to a boil over high heat. Stir in the couscous, cover, and remove from the heat. Let stand for at least 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, whisk the vinegar with the remaining 1/4 cup oil and a generous pinch each of salt and pepper in a very large bowl. Add the tomatoes and chickpeas and stir to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the couscous is ready, scrape with a fork to fluff into bits. Pour into the tomato mixture, along with the onion, arugula and half the cheese. Fold gently until well mixed, then season to taste with salt and pepper, and dress with additional oil and vinegar, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide among dishes and top with the remaining feta and the celery or chile, if using."}], "link": "https://cooking.nytimes.com/recipes/1019496-couscous-salad-with-turmeric-chickpea-and-tomato"}