{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Olive-Oil Ice Cream", "description": "Lemon ice cream may not inspire the same excitement you find with flavors like salted caramel or chocolate chip cookie dough, but you don't want to miss out on it. This ice cream is surprisingly complex: creamy, sweet, tart and a little savory thanks to olive oil and a bit of salt. If you'd like, serve scoops with a drizzle of olive oil and a sprinkle of flaky sea salt and lemon zest.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2018/04/18/dining/18COOKING-LEMONOLIVEOILICECREAM2/09COOKING-LEMONOLIVEOILICECREAM2-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "About 1 quart", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "dessert, lemon juice, lemon zest, olive oil, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 266}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 274, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "11 grams", "sodiumContent": "105 milligrams", "sugarContent": "19 grams", "transFatContent": null}, "recipeIngredient": ["4 large egg yolks", "2 cups heavy cream", "1 cup whole milk", "1 cup/200 grams granulated sugar", "4 teaspoons packed finely grated lemon zest, plus more for serving", "1/2 teaspoon kosher salt", "1/3 cup freshly squeezed lemon juice, from about 4 lemons", "1/4 cup fruity olive oil, plus more for serving", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk egg yolks together in a medium nonreactive bowl; set aside. Combine cream, milk, sugar, 3 teaspoons lemon zest and the salt in a medium nonreactive saucepan. Cook over medium heat, stirring occasionally, until sugar is dissolved and mixture begins to bubble around the edges. Ladle about 1 cup of the cream mixture into the egg yolks and whisk vigorously to temper the eggs. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the egg and cream mixture back into the pan and whisk well to combine. Cook the mixture on medium-low heat, stirring constantly, until it thickens enough to coat the back of a spoon, about 7 minutes. Take care to not let the mixture boil. Strain the mixture through a fine mesh sieve into a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly stream in the lemon juice and olive oil while whisking constantly, then whisk in the remaining 1 teaspoon lemon zest. Chill the mixture in a bowl set over an ice bath until completely cool. Alternatively, cool the mixture completely in the refrigerator, covered, at least 4 hours, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before churning, whisk the mixture thoroughly. Churn in an ice cream machine according to manufacturer’s instructions. Transfer the ice cream to a freezer-safe container, press a piece of plastic wrap against the surface, cover, and freeze until firm. Serve scoops of ice cream with a drizzle of fruity olive oil and a sprinkle of salt and lemon zest, if desired."}], "link": "https://cooking.nytimes.com/recipes/1019274-lemon-olive-oil-ice-cream"}