{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Wine Spaghetti With Pancetta", "description": "An easy pasta, and a good one for every cook’s repertoire, this dish — known as “drunken” pasta, spaghetti ubriachi (or all’ubriaco) or pasta alla chiantigiana — requires few ingredients: red wine, onions, olive oil and grated pecorino. It can be made without meat, but usually it contains a small amount of pancetta, guanciale or Italian sausage. Well-seasoned and hearty, red wine spaghetti makes a fine impromptu meal.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/03/13/dining/08Kitchrex1/08Kitchrex1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas", "keywords": "main course, pancetta, red wine, spaghetti", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 675}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 666, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "3 grams", "proteinContent": "20 grams", "saturatedFatContent": "10 grams", "sodiumContent": "655 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt and pepper", "1 (750-milliliter) bottle medium-bodied, dry red wine, such as merlot, pinot noir or Chianti", "3 tablespoons extra-virgin olive oil", "5 ounces pancetta or bacon, thickly sliced and cut into 1/4-inch lardons, blanched for 1 minute in boiling water and drained", "1 red onion, cut into 1/8-inch-thick half-moons", "4 large garlic cloves, thinly sliced", "Pinch of red-pepper flakes", "1 tablespoon tomato paste", "1 bay leaf", "1 pound spaghetti", "2 tablespoons unsalted butter", "4 ounces finely grated pecorino or Parmesan", "Basil leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large pot of well-salted water over high heat and bring to a boil. Add 1 cup wine and turn heat to low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in a wide skillet over medium. Add pancetta to pan and let sizzle for 2 or 3 minutes, until lightly browned. Remove with a slotted spoon and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise heat slightly and add onion. Season with salt and pepper and stir to coat. Continue to cook, stirring, until softened, about 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic, red-pepper flakes and tomato paste, and stir to distribute. Add bay leaf and all the remaining red wine and turn flame to high. Let wine reduce rapidly by half, about 10 minutes. Turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring pasta water back to a boil, add pasta and cook for about 2 to 3 minutes less than the package directions advise — that is, keep the pasta quite firm and underdone. It will finish cooking in the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve 1 cup pasta cooking water, and drain the pasta. Add pasta to the red wine mixture in the skillet and turn heat to medium-high. Let pasta wilt into the sauce and continue cooking, stirring, as pasta absorbs the sauce. The spaghetti should be correctly al dente within a few minutes and the sauce should coat the pasta. Add a little pasta cooking water if sauce gets too thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the reserved pancetta, the butter and half the grated cheese and toss well. Taste a noodle, and add a sprinkling of salt to the pan if necessary. Toss once more and transfer to a warm serving dish. Garnish with basil leaves and pass remaining cheese at the table."}]}