{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Chinese Broccoli", "description": "Bright broccoli, lightly coated with a rich sauce that conveys a bit of heat, mingles with pasta in this dish from Majordomo, David Chang's first Los Angeles restaurant. There, they make their own thick noodles from scratch, using a combination of wheat flour and cassava starch. You don't have to. The restaurant's executive chef Jude Parra-Sickels suggests bucatini as a substitution. In preparing and serving the dish, do not short change the mixing of the ingredients because the broccoli tends to hide under the pasta. You have to coax it out, especially as you serve it. Vegetarians could use untoasted sesame oil, preferably cold pressed, in place of the pork fat.", "author": {"@type": "Person", "name": "Eric Asimov"}, "image": "https://static01.nyt.com/images/2018/08/08/dining/08pairing1/merlin_141965526_2d4f50f8-c081-44e9-a790-18d0f3da6b9f-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "bucatini, chinese chile oil, fish sauce", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 128}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 474, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "4 grams", "proteinContent": "12 grams", "saturatedFatContent": "6 grams", "sodiumContent": "750 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt", "3 cups Chinese broccoli, broccolini or broccoli (about 12 ounces), sliced in 1 1/2-inch pieces on the bias", "6 tablespoons pork fat, preferably rendered from pork belly; or bacon fat, preferably from unsmoked bacon", "3 tablespoons thinly sliced garlic (about 4 to 6 cloves)", "3 tablespoons Asian fish sauce", "1 pound bucatini", "1/2 tablespoon Chinese chile oil, or to taste", "Ground black pepper", "2 tablespoons Chinese sesame oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of well-salted water to a boil for the pasta. Toss the broccoli into the pot, return to boil and cook 2 more minutes. Use a slotted spoon or a sieve to fish the broccoli out of the boiling water and into a colander. Cover the drained broccoli with ice cubes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the fat in a large skillet on medium-low, add garlic and cook until the garlic is golden. Remove from heat and stir in the fish sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the bucatini to the boiling water and cook until al dente, about 8 minutes. When the pasta is almost done remove 1 cup of pasta water from the pot and add it to the skillet. Reheat the contents of the skillet on medium-high, cooking to reduce the liquid by half. As the liquid cooks, drain pasta and set aside. Remove the ice cubes from the broccoli and transfer the broccoli to the skillet. Add the chile oil. Reduce heat to low and continue simmering the contents of the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cooked pasta to the skillet. Using tongs, toss the pasta with the other ingredients for several minutes until well combined. Season the pasta to taste with salt and pepper. Add sesame oil and toss again. Transfer everything to a wide bowl and serve."}], "link": "https://cooking.nytimes.com/recipes/1019445-pasta-with-chinese-broccoli"}