{"@context": "http://schema.org", "@type": "Recipe", "name": "Classic Chocolate Éclairs", "description": "Master pâte à choux (choux pastry dough) and a world of dreamy, airy desserts opens up to you: éclairs, croquembouches, profiteroles, gougères and even churros. Choux pastry dough is unique in that it is typically prepared in a saucepan over heat, which might sound intimidating, but it is much more approachable than you might think. If you don’t have a pastry bag, you can use a resealable plastic bag to pipe these éclairs — or turn them into cream puffs by simply dropping the dough in 2-tablespoon scoops about 3 inches apart onto a baking sheet. The pastry starts to soften as soon as the éclair is filled with custard, so indulge immediately. It won’t be difficult. Save any leftover chocolate glaze in the refrigerator. Reheated, it makes perfect hot fudge sauce.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2019/02/05/dining/ss-chocolate-eclairs/merlin_149986377_d2b757e6-c28c-43f3-ba35-7790c68bdae2-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "12 to 14 éclairs", "recipeCuisine": "", "recipeCategory": "pastries", "keywords": "bittersweet chocolate, butter, corn syrup, egg, heavy cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 83}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 279, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "11 grams", "sodiumContent": "165 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 large egg yolks", "1/2 cup/100 grams granulated sugar", "1/4 cup/30 grams cornstarch", "Pinch kosher salt", "2 cups/480 milliliters whole milk", "3/4 cup/180 milliliters heavy cream", "1 vanilla bean, split lengthwise and seeds scraped out and reserved", "2 tablespoons unsalted butter", "6 tablespoons/85 grams unsalted butter (3/4 stick)", "2 teaspoons granulated sugar", "1/2 teaspoon kosher salt", "3/4 cup/95 grams all-purpose flour", "3 large eggs", "1/2 cup/120 milliliters heavy cream", "1/2 teaspoon kosher salt", "1 cup/170 grams chopped bittersweet chocolate", "1 tablespoon corn syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the custard: Stir together the egg yolks, sugar, cornstarch and kosher salt in a medium saucepan until smooth. Whisk in the milk and 1/2 cup heavy cream. Add the vanilla bean and seeds and the butter and bring the mixture to a simmer over medium heat. Set a fine-mesh sieve over a large heatproof bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the mixture over medium-low heat, stirring constantly and making sure to get the edges, until the mixture begins to thicken, 2 to 4 minutes. (It's helpful to have both a spatula and a whisk handy while making the custard. Switch between the two.) Let it come up to a very slow boil and cook for 1 minute more. Strain the custard through the sieve into the bowl. Press plastic wrap directly onto the surface of the custard and refrigerate until chilled, at least 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the puffs: Bring the butter, sugar, salt and 3/4 cup/175 milliliters water to a simmer over medium heat in a medium saucepan, stirring with a wooden spoon. As soon as it comes to a boil, add the flour, stirring constantly, until the dough forms a ball and pulls away from the sides of the pan, about 1 minute. Remove the pan from the heat and let the mixture cool for 3 to 4 minutes, stirring the dough occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Add the eggs to the dough in the pan, one at a time, stirring vigorously between each addition with a wooden spoon. The dough will break apart and slide around in the pot before it comes back together. Transfer the dough to a piping bag fitted with a large round or star tip. (The author used Ateco #826.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two baking sheets with parchment paper. Pipe the dough into 4 1/2-inch-by-3/4-inch lengths about 3 inches apart. With a damp fingertip, flatten any points. Bake until éclairs are deep golden brown and puffed, rotating the sheets halfway through, 22 to 25 minutes. They should be very light and crisp. Turn the oven off. Poke each éclair on either end with a toothpick to allow some steam to release. Return the puffs to the oven and prop the door open a crack with a wooden spoon. Allow the puffs to dry out in the oven, about 15 minutes. Transfer baking sheet to a wire rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the glaze: Bring the heavy cream and salt to a simmer over medium heat. Remove from the heat and stir in the chocolate and corn syrup. Let the mixture stand for 1 minute and then whisk to make a smooth sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish the custard, whip the remaining 1/4 cup heavy cream to soft peaks. Whisk the cooled custard to loosen it, then fold in the whipped cream. Transfer the custard to a pastry bag fitted with a fluted tip. Slice the top third off each éclair and fill the bases of the éclairs with custard. Dip the tops of the éclairs in the glaze and set them on top of the custard-filled bases. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1019984-classic-chocolate-eclairs"}