{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Pan Bruschetta Spaghetti", "description": "Spaghetti in the dead of summer, when tomatoes are at peak ripeness and break down quickly to coat any pasta in irresistible flavor, is the best time to eat spaghetti. You won’t need a lot of time to make this, just one big pan (use your largest and deepest) and the resolve not to eat the whole pile of noodles yourself. You'll want a slightly larger cast-iron skillet here — either a 12-inch version, or a deep 10-inch — to avoid spillage. Make sure to cover the pasta with a lid or foil so it cooks faster, and to stir from time to time. Since you’re not draining the noodles as you would in a traditional pasta dish, it’s good to know that different noodle shapes, sizes and brands may soak up liquid differently and that some tomatoes may be juicier than others. Simmer as long as needed get the sauce to a consistency that’s just right for you.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2018/09/11/dining/sc-bruschetta-pasta-horizontal/merlin_143416674_482aeeee-4a7a-40c3-aefb-276c9351e706-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, pastas", "keywords": "main course, parmesan, spaghetti, tomato, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 414}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 505, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "80 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "7 grams", "proteinContent": "19 grams", "saturatedFatContent": "4 grams", "sodiumContent": "687 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons olive oil", "1 yellow onion, thinly sliced", "4 garlic cloves, thinly sliced", "Pinch of red-pepper flakes, to taste", "1 tablespoon cider vinegar", "12 ounces thin spaghetti or linguine, broken in half", "2 pounds Roma or Campari tomatoes, chopped (about 8 to 12 tomatoes)", "1 teaspoon kosher salt", "1/2 teaspoon black pepper", "2 ounces finely grated Parmesan (about 1/2 cup), plus more for serving", "About 1 cup basil leaves, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a very large, deep cast-iron skillet (or a Dutch oven) over medium-low. Add onion and cook until softening, stirring occasionally, about 5 minutes. Add the garlic and cook until fragrant, 3 to 5 minutes more. Add red-pepper flakes and vinegar, and stir until the vinegar evaporates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pasta, followed by the tomatoes, and pour 2 3/4 cup water over the top. Sprinkle with salt and pepper. Cover with a lid and bring to a boil. Simmer over medium-low heat until the pasta is just tender, about 10 minutes, stirring as needed so the pasta doesn’t stick. Uncover, and continue cooking until the liquid has evaporated to a loose sauce, just enough to coat your noodles with flavor, 5 to 8 minutes more. (If there’s still too much liquid at the bottom of your pan for your tastes, simmer a little longer.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste and add more salt and pepper as needed. Toss with cheese and basil to melt the cheese. Serve warm."}]}