{"@context": "http://schema.org", "@type": "Recipe", "name": "Perfect Hash Browns", "description": "When it comes to breakfast potatoes, most people fall into one of two camps: home fries or hash browns. This recipe from Alison Roman shows you how to make an ideal batch of the hashed variety that are aggressively crisp on the outside and creamy tender on the inside. To ensure ultimate crispness, be sure to rinse the grated potatoes with cold water until the water runs nearly clear and to use a very hot, well-seasoned pan. As with all potato dishes, remember to season well.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/02/20/dining/15COOKING-HASHBROWN3/15COOKING-HASHBROWN3-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, vegetables", "keywords": "side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 182}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 516, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "15 grams", "sodiumContent": "821 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 pounds russet potatoes (about 2 smallish-medium potatoes), peeled", "1 small yellow onion, peeled", "Kosher salt", "Freshly ground pepper", "3 tablespoons bacon fat or vegetable oil, plus more if needed", "2 tablespoons unsalted butter", "Hot sauce or ketchup (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate potatoes on the largest hole on a box grater into a medium bowl. Cover with cold water and drain; repeat once or twice, until water runs nearly clear. Taking small handfuls at a time, squeeze all the water from the potatoes and place in a dry medium bowl. Grate onion on the largest hole on a box grater and toss with potatoes. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taking small handfuls at a time, squeeze all water from the potato-onion mixture. Heat 2 tablespoons reserved bacon fat or vegetable oil in skillet over medium heat, add 1 tablespoon butter and swirl together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potatoes and onions and spread into a thin, even layer. Cook, without moving, until the potatoes are nearly cooked through and browned on one side, about 5 to 8 minutes. Using a spatula, flip sections of the potatoes to crisp on the other side. Add 1 tablespoon reserved bacon fat or vegetable oil and remaining 1 tablespoon butter and cook, without moving, until potatoes are browned on the other side, about another 5 minutes. Flip once or twice more (you don’t have to be so careful here; just kind of stir them around) and continue to cook until most of the bits of potato are golden brown and crisped, about another 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer potatoes to a plate. Serve with hot sauce (or ketchup, if you wish)."}]}