{"@context": "http://schema.org", "@type": "Recipe", "name": "Kimchi Rice Porridge", "description": "A combination of pungent chopped kimchi, toasted scallions and ginger, and rice that's been bolstered with a hit of kimchi brine, this porridge is fiery and sinus-clearing. The rice isn’t perfectly fluffy; instead, leftover rice simmers until it breaks down from kernel to stew. (You can, of course, use raw rice, too: Cook it in Step 2 for about an hour, partly covered and stirring occasionally.) You'll want to cook the scallions and ginger until nearly burned, and top the whole thing with a fried egg (or make it soft-boiled). Take note that most kimchi gets its funk from shrimp, anchovies and-or fish sauce, so if you’d like to make this dish vegetarian, make sure to use a vegetarian kimchi.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2018/09/13/dining/AS-kimchi-porridge-horizontal/AS-kimchi-porridge-horizontal-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "korean", "recipeCategory": "breakfast, brunch, dinner, lunch, weekday, grains and rice", "keywords": "ginger, kimchi, scallion, sesame oil, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 169}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 390, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "79 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "0 grams", "sodiumContent": "285 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon vegetable oil", "6 scallions (about 1 bunch), white and pale green parts roughly chopped, plus more for garnish", "2 tablespoons peeled and finely minced ginger", "1/2 cup chopped kimchi, plus 1 tablespoon kimchi brine", "2 cups cooked long- or short-grain rice", "Kosher salt, to taste", "4 eggs, for serving", "Toasted sesame oil, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, heat the oil over medium-high heat. Once shimmering, add the scallions and ginger and sauté until soft and toasted in spots, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the kimchi, the rice, and 3 cups of water. Bring to a boil, then reduce heat and simmer, adding more water if necessary, until the rice is broken down and the porridge is the desired consistency (some like their porridge soupy, others thicker with most of the liquid absorbed), 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat and stir in the kimchi brine. Season with salt and more kimchi brine to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, fry eggs to your liking. Top each bowl of porridge with an egg, chopped scallions and a drizzle of sesame oil."}], "link": "https://cooking.nytimes.com/recipes/1019558-kimchi-rice-porridge"}