{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato-Parmesan Soup", "description": "What if you could have a tomato soup that was as plush as a cream of tomato but tasted like pure tomato? Enter Parmesan. Simmering tomatoes with a Parmesan rind is like seasoning a bowl of soup with a shaving of cheese 100 times over. It gives the soup an undercurrent of savory fat and salt that only bring out tomato's best sides. Many specialty groceries sell containers of rinds, but if you can’t find any, stir ½ cup grated Parmesan into the final soup (or cut off the rind of a wedge you’re working through). Rinds will keep in the freezer for forever, so start saving. Pair the soup with Parmesan toast, for dunking, though it’s in no way needed.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2018/11/27/dining/as-tomato-parmesan-soup/as-tomato-parmesan-soup-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, soups and stews", "keywords": "fall, winter, main course, parmesan, tomatoes, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 431}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1252, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "177 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "15 grams", "proteinContent": "54 grams", "saturatedFatContent": "21 grams", "sodiumContent": "2950 milligrams", "sugarContent": "26 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["6 tablespoons unsalted butter", "1 yellow onion, chopped", "5 garlic cloves, sliced", "1/2 teaspoon red-pepper flakes", "Salt and black pepper", "2 (28-ounce) cans whole peeled tomatoes", "6 ounces Parmesan rind", "4 (about 3/4-inch thick) slices of baguette", "1 garlic clove, peeled", "1/4 cup finely grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan or Dutch oven over medium heat, melt the butter. Once it starts bubbling, stir in the onions and sauté until golden, 5 to 7 minutes. Add the garlic, red-pepper flakes, and generous pinches of salt and pepper, and sauté until fragrant, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the tomatoes and their juices, 1 cup water and the Parmesan rind, and bring to a boil. Turn the heat down to a simmer and cook, stirring occasionally, until the tomatoes are broken down and the mixture has thickened, about 30 minutes. (If you find during your stirring that the Parmesan rind is stuck to the bottom or sides of the pot, pry it off with a wooden spoon.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the rind from the soup, and let cool slightly. If you’re planning to make the Parmesan toast, heat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use an immersion blender to purée the soup. (Alternatively, ladle the soup into a blender, and blend until smooth. For a super-smooth soup, run it through a fine-mesh sieve.) Season to taste with salt, pepper and grated Parmesan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re making the toast, rub 1 side of each slice of baguette with the garlic clove, then place on a parchment-lined baking sheet. Sprinkle cheese over the top, then bake until golden brown, about 10 minutes. Serve the soup with a toast alongside or on top."}]}