{"@context": "http://schema.org", "@type": "Recipe", "name": "Pappardelle With Pancetta and Peas", "description": "The very notion of buttery noodles and fresh sweet peas is enough to make anyone swoon. As a meal, it is the essence of simplicity. But no one will complain if there is also a whisper of new green garlic, a dab of herby pesto and a dollop of ricotta. Oh, and a touch of lemon zest. Add tender mustard greens and a few bites of pancetta or bacon to round it all out.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/04/25/dining/25KITCHEN1/merlin_136309164_43dfa857-cd67-45c3-a6db-8bd901e3b49d-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, pastas", "keywords": "main course, mustard greens, pancetta, pappardelle, peas, ricotta, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 332}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 869, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "112 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "13 grams", "proteinContent": "37 grams", "saturatedFatContent": "11 grams", "sodiumContent": "968 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 thick slices pancetta or bacon, cut crosswise into 1/4-inch lardons (about 2 ounces)", "About 2 tablespoons roughly chopped fresh basil leaves", "About 2 tablespoons roughly chopped fresh flat-leaf parsley leaves", "About 2 tablespoons roughly chopped fresh mint leaves", "Extra-virgin olive oil", "2 or 3 stalks green garlic shoots, white and tender green parts, finely chopped", "4 cups fresh sweet peas, from about 3 pounds in the pod", "Salt and pepper", "2 cups tender mustard greens, chopped, or substitute whole mizuna or arugula leaves", "1 cup fresh ricotta cheese", "Zest of 1 small lemon", "1 pound best-quality egg pappardelle, dried, or fresh homemade egg pasta cut into wide ribbons", "Grated Parmesan cheese, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a small saucepan of water over high heat and bring to a boil. Add pancetta and cook for 1 minute, then drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to a boil on the back burner, for cooking the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put basil, parsley and mint in a mortar or mini food processor and mash to a coarse paste with about 1/4 cup oil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm 2 tablespoons olive oil in a wide skillet over medium-high heat. Add green garlic and peas, and sprinkle with salt and pepper. Allow garlic and peas to sizzle without browning for about 1 minute. Add reserved pancetta and 1/2 cup water, and bring to a simmer for 1 minute more. Stir in mustard greens to wilt slightly, then add herb paste, ricotta and lemon zest. Turn off the heat"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the pasta at a brisk simmer until al dente. Drain and toss gently with ingredients in skillet. Taste and adjust seasoning. Transfer to a warm platter or individual dishes and serve immediately. Pass grated cheese at the table."}]}