{"@context": "http://schema.org", "@type": "Recipe", "name": "Clementine-Pomegranate Jello Salad", "description": "A gelatin salad, or Jell-O mold, may seem retro, but when you make one from scratch, substituting fresh juice and fruit in place of artificial flavoring and color, it can be spectacular, making a great showpiece for a dinner party or buffet. This particular combination of tart clementine and sweet pomegranate is quite refreshing for a very light dessert, but it may also be served as a fruit salad.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/11/14/dining/14kitchenrex1/merlin_146065818_a7c18780-f23e-4431-aba9-015e634d8176-articleLarge.jpg", "totalTime": "PT4H20M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "custards and puddings", "keywords": "clementines, crème fraîche, gelatin, mint, pomegranate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 117}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 82, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "0 grams", "proteinContent": "8 grams", "saturatedFatContent": "0 grams", "sodiumContent": "137 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["About 2 1/2 tablespoons powdered gelatin (3 1/4-ounce packets)", "1/2 cup cold water", "1 cup boiling water", "1/4 cup sugar", "1/2 teaspoon salt", "3 cups clementine juice, freshly squeezed from about 24 small clementines or tangerines", "1/2 cup pomegranate seeds, plus more for garnish", "2 cups clementine segments (from about 4 or 5 clementines), plus more for garnish", "Mint leaves, for garnish", "8 ounces crème fraîche or softly whipped unsweetened cream (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the gelatin in a saucepan and cover with cold water. Leave to soften and swell for about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add boiling water and stir mixture until smooth and free of lumps. (If necessary, set saucepan over low heat for a few minutes until completely dissolved.) Stir in sugar and salt to dissolve. Whisk gelatin mixture thoroughly into clementine juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse a 6-cup bowl or mold with cold water and pour in mixture. Add pomegranate seeds and clementine segments. The pomegranate seeds will fall to the bottom, and the clementine segments will rise to the surface. (If you wish to have the fruit suspended in the gelatin, chill mixture until half-set, then stir in fruit.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and refrigerate for at least 4 hours, preferably 8 to 12 hours. You may prepare and chill the gelatin up to 2 days before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To unmold, set bowl or mold in a container of warm water for 5 minutes, and use a table knife to loosen edges. Remove bowl from water, place a platter over bowl, invert and unmold. Cover with plastic wrap and refrigerate until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, remove plastic wrap. Garnish with mint leaves and reserved pomegranate seeds and clementine segments. If desired, top each serving with a dollop of crème fraîche."}]}