{"@context": "http://schema.org", "@type": "Recipe", "name": "Wild Rice and Mushroom Casserole", "description": "This hearty mix of wild rice, creamy white beans and aromatic vegetables (spinach, leeks, fennel and mushrooms) makes a satisfying meatless main course or a very substantial side dish for Thanksgiving — and beyond. If you want to go all out, use some exotic mushrooms such as chanterelles, maitake (hen of the woods) or black trumpet, but a basic combination of cremini and shiitake mushrooms also works perfectly.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/11/30/dining/mc-mushroom-casserole/mc-mushroom-casserole-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "12 servings", "recipeCuisine": "american", "recipeCategory": "dinner, casseroles, grains and rice", "keywords": "dairy-free, high fiber, vegan, vegetarian, fall, winter, fennel, mushrooms, spinach, wild mushrooms, wild rice, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1939}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 692, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "110 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "23 grams", "proteinContent": "36 grams", "saturatedFatContent": "2 grams", "sodiumContent": "686 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["2 1/4 cups vegetable, mushroom or chicken broth or stock ", "Fine sea salt", "1 1/4 cups wild rice, rinsed", "10 tablespoons extra-virgin olive oil, more as needed", "1 pound sliced mushrooms, preferably a mix of different kinds", "3 leeks, white and light green parts only, thinly sliced", "2 fennel bulbs, trimmed and chopped", "5 ounces baby spinach (about 4 cups)", "7 fat garlic cloves (4 chopped, 3 finely grated or crushed into a paste)", "1/2 tablespoon tomato paste", "1/8 teaspoon red pepper flakes", "4 (14-ounce) cans white beans (7 cups)", "2 tablespoons freshly squeezed lemon juice", "1/3 cup chopped fresh cilantro (or basil)", "1/3 cup chopped fresh parsley", "2 1/2 cups panko or coarse bread crumbs", "1 tablespoon fresh rosemary, chopped", "1 tablespoon finely grated lemon zest", "1/3 cup grated Parmesan cheese (optional)", "Flaky sea salt, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste broth; if bland, season to taste with salt. In a medium pot, bring broth to a boil over high heat. Stir in rice, lower heat, cover and simmer until just tender, about 40 minutes or according to package directions. Fluff rice with a fork, cover and let stand for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, sauté vegetables: In a large, heavy skillet, heat 3 tablespoons oil over high heat. Add half the mushrooms and cook, stirring, until brown and crispy, about 8 minutes. Adjust heat as needed to prevent burning. Transfer cooked mushrooms to a plate and sprinkle lightly with salt. Repeat with remaining mushrooms and another tablespoon oil, adding more oil to the skillet if it looks dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the empty skillet, heat 2 tablespoons oil over medium heat. Stir in leeks, fennel and 1 teaspoon salt; cook, stirring, until soft but not browned, about 8 minutes. Stir in spinach, chopped garlic, tomato paste and red pepper flakes, and cook until garlic starts turning golden, another 2 minutes. Remove skillet from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees, and oil a 9-by-13-inch casserole dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender, purée 2 cans beans with their liquid, 2 tablespoons lemon juice, 1 grated garlic clove, and salt to taste. (If your beans are unsalted, they might need more than you’d think.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir bean purée, remaining whole beans (drained), mushrooms, cilantro, parsley and cooked wild rice into skillet with vegetables. Taste and add more salt or lemon as needed; it should be well seasoned. Scrape into prepared baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine bread crumbs, rosemary, lemon zest, remaining 2 grated garlic cloves and 1/4 teaspoon salt. Stir in 1/4 cup olive oil and Parmesan, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle evenly on top of casserole and bake until golden, 20 to 30 minutes. Let cool slightly before serving, topped with flaky sea salt."}], "link": "https://cooking.nytimes.com/recipes/1019029-wild-rice-and-mushroom-casserole"}