{"@context": "http://schema.org", "@type": "Recipe", "name": "Linguine With Chickpeas, Broccoli and Ricotta", "description": "The broiler is an unsung kitchen hero because it imparts a flavorful char in half the time that grilling takes. In this 20-minute recipe, kale, broccoli and chickpeas crisp under the broiler while the pasta water boils. Make sure to spread out the vegetables and chickpeas so they have room to caramelize properly instead of steaming (the more crunchy bits, the better). Finish by tossing the pasta and vegetables with a quick sauce of butter, lemon zest and fresh ricotta, a rich and creamy complement to the charred vegetables. Enjoy with crusty bread, good wine and a sense of accomplishment — you just got dinner on the table in under a half hour.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/02/24/dining/sc-Roasted-Broccoli--Kale-and-Chickpea-Linguine-with-Fresh-Ricotta/merlin_149536176_2d6b149c-fc46-400d-8f34-e63bbc5efd8f-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weeknight, pastas", "keywords": "broccoli, chickpeas, kale, pasta, ricotta, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 751}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 850, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "105 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "16 grams", "proteinContent": "31 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1132 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Kosher salt", "12 ounces dried linguine or spaghetti", "1 bunch broccoli or broccolini, trimmed and cut into thin florets (about 1 1/2 pounds), stems reserved for another use", "1 (14-ounce) can chickpeas or other white beans, drained and rinsed", "2 large garlic cloves, thinly sliced", "1/2 teaspoon red-pepper flakes", "1/3 cup extra-virgin olive oil, plus more for drizzling", "Black pepper", "1 bunch Tuscan kale (also known as cavolo nero or Lacinato kale), stemmed and cut into bite-size pieces", "1 lemon", "2 tablespoons unsalted butter", "8 ounces ricotta, preferably room temperature", "Flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Add the pasta and cook according to package instructions until al dente. Reserve 1/2 cup pasta cooking water, and drain the pasta. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the broiler and set a rack roughly 8 inches from the heat source. In a large bowl, toss the broccoli, chickpeas, garlic, red-pepper flakes and 1/3 cup oil until evenly coated. Season with salt and pepper. Spread out evenly on one sheet pan. Add the kale to the same bowl, and toss to coat in any residual oil. Drizzle with more oil as needed and toss to coat evenly. Spread out in an even layer on the second sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with 1 sheet pan at a time, broil the broccoli and chickpeas, tossing halfway through cooking, until the chickpeas are toasty and the broccoli is tender and charred, 5 to 7 minutes. Broil the kale until just charred and crisp, about 5 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Zest the lemon, halve it, then cut 1 half into 4 wedges. Squeeze the juice from the lemon half over the roasted vegetables and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pasta to the pot. Add the 1/4 cup reserved pasta cooking water, the ricotta, butter and lemon zest and toss until well combined. Add the roasted vegetables and toss, adding more pasta water as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide among four bowls. Season with flaky sea salt and pepper, and serve with lemon wedges for squeezing on top. Drizzle with more oil, if desired."}]}