{"@context": "http://schema.org", "@type": "Recipe", "name": "Whiskey-Orange Bread Pudding", "description": "A bottle of workmanlike Scotch or other whiskey can be as useful in the kitchen as it is on the bar, contributing alcohol and flavor to a range of recipes. A splash of it can sharpen a pan sauce for steak or pork, it’s excellent flambé material, and it’s especially compatible with dried fruit. I have soaked dried currants in whiskey to add to <a href=\"https://cooking.nytimes.com/recipes/11712-chocolate-whiskey-cake?action=click&module=Global Search Recipe Card&pgType=search&rank=1\">a simple chocolate cake</a>. For this recipe, which takes its cue from the Blood and Sand cocktail made with orange juice and Scotch, I used the spirit to bolster a warm bread pudding laced with orange, both grated zest and candied peel, and finished with a marmalade and whiskey glaze. Supermarkets and fancy food shops, as well as online sources, sell candied orange peel. But absent that ingredient you can substitute slivered dried Turkish apricots.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2018/03/21/dining/21PairingRex1/21PairingRex1-articleLarge-v2.jpg", "totalTime": "PT1H45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "custards and puddings", "keywords": "baguette, candied orange peel, mascarpone, orange, orange marmalade, scotch, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 41}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 473, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "1 gram", "proteinContent": "10 grams", "saturatedFatContent": "10 grams", "sodiumContent": "455 milligrams", "sugarContent": "45 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Unsalted butter for baking dish", "2 cups/480 milliliters whole milk", "1/2 cup/100 grams sugar", "Grated zest of 1 large navel orange", "1/4 teaspoon salt", "6 tablespoons/90 milliliters Scotch whisky", "3 large eggs, beaten", "5 cups baguette (about 235 grams) torn in small pieces", "1 cup/about 6 ounces/160 grams chopped candied orange peel (or slivered dried Turkish apricots)", "1/2 cup/165 grams orange marmalade", "1 8- or 9-ounce container/280 grams mascarpone "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heavily butter a 6-cup square or round baking dish. Place milk and sugar in a saucepan, heat until it is about to simmer and remove from heat. Add orange zest and salt. Set aside until just warm, about 10 minutes. Stir in 4 tablespoons of the whisky. When the milk mixture is no longer hot, beat in the eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Place the bread pieces in a large bowl. Pour milk mixture over them, add candied peel and let soak 15 minutes. Place marmalade in a small saucepan, add remaining whisky and heat to dissolve whisky in the marmalade."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon half the bread mixture into a baking dish and smooth the surface. Cover with dabs of half the mascarpone. Spoon in remaining bread mixture. Place in the oven and bake 15 minutes. Brush with marmalade and whiskey glaze and continue baking until top is lightly brown and starts to become crusty, another 30 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and let cool at least 30 minutes before serving. Beat remaining mascarpone with a whisk or fork for several minutes to smooth and loosen it. Serve alongside."}]}