{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet and Spicy Tofu With Soba Noodles", "description": "If you don’t cook tofu often (or even if you do), this unfussy tofu dish is for you: There’s no flour-dredging or shallow-frying, and no marinating at all. As long as you pat the tofu dry (a bit fussy, but not by much), the vegetable oil’s high smoke point will yield crisp edges, while the sesame oil imparts flavor, putting you well on your way to making tofu taste great. What’s more, a ginger-and-garlic-laced soy sauce coats noodles and tofu alike, giving you chopstick after chopstick of toothsome pleasure. Serve these warm or cold, and be generous with the cool, crispy vegetables on top, especially for summer picnics where you can stretch this to serve 6 or even 8 as a side.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/08/01/dining/sc-Sweet-and-Spicy-Tofu-With-Soba-Noodles/sc-Sweet-and-Spicy-Tofu-With-Soba-Noodles-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "japanese", "recipeCategory": "dinner, weekday, noodles", "keywords": "firm tofu, soba noodles, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 797}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 607, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "5 grams", "proteinContent": "35 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1652 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 (14-ounce) packages firm tofu, drained", "2 tablespoons canola oil", "2 tablespoons sesame oil", "1 (8-ounce) package all-buckwheat soba noodles", "4 garlic cloves, smashed", "1 (1-inch) piece ginger, peeled and thinly sliced", "1 small bunch green onions, white and green parts separated, cut into 2-inch matchsticks", "1/3 cup soy sauce or tamari", "3 tablespoons dark brown sugar", "1 teaspoon black pepper", "Pinch of red-pepper flakes", "4 mini or 1 large, thin-skinned cucumber, thinly sliced", "4 radishes, thinly sliced", "Handful of cilantro leaves, for serving", "1 lime, cut in wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the tofu in a colander, or dry on paper-towel lined plate while you prep the remaining ingredients, about 10 minutes. Meanwhile, bring a small pot of water to a boil for the soba noodles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut tofu into 1-inch cubes. Heat a cast-iron skillet over medium-high heat. Add the vegetable oil and 1 tablespoon of the sesame oil. When the oil shimmers, add the tofu in a single layer, in batches if needed and cook until golden on all sides, turning as needed when the tofu releases easily from the pan, about 8 to 10 minutes total. Lift the tofu out of the pan with a spatula and transfer to a new paper-towel-lined plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the soba in boiling water for 5 to 8 minutes (or according to package directions), until just al dente, stirring frequently. Drain and rinse in cold water until the noodles no longer feel sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic, ginger and whites of the onions to the skillet, along with the remaining tablespoon sesame oil, reduce the heat to medium, and cook until the oil is fragrant, stirring constantly, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cooked and drained soba noodles to the pan, along with soy sauce, sugar, black pepper, red pepper and reserved green onions; toss together until the noodles are coated. Gently toss in the tofu until all the pieces are covered in the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat, and sprinkle cucumber, radish and cilantro on top. Serve warm or at room temperature, with lime."}], "link": "https://cooking.nytimes.com/recipes/1019471-sweet-and-spicy-tofu-with-soba-noodles"}