{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Chicken Thighs With Greens and Olives", "description": "In this quick and comforting one-pot, stove-top meal, chicken thighs are browned, then simmered with sturdy greens. When they're in season, pleasantly bitter dandelion greens are lovely here. But any structured greens with a tendency to wilt when cooked, like escarole, kale and even Swiss chard, will work here, so feel free to use whatever you have on hand. Olives and raisins, tossed in at the very end, add some salty and sweet notes. Round out the meal with a loaf of crusty bread — it's perfect to sop up this brothy braise.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/07/11/dining/colu-chicken-olives-horizontal/colu-chicken-olives-horizontal-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, weeknight, poultry", "keywords": "chicken thighs, greens, olives, raisins, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 224}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 518, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "2 grams", "proteinContent": "32 grams", "saturatedFatContent": "9 grams", "sodiumContent": "745 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds bone-in, skin-on chicken thighs", "Kosher salt and black pepper", "2 tablespoons grapeseed or canola oil", "1/2 red onion or 2 to 3 medium shallots, thinly sliced (about 1 cup)", "2 garlic cloves, thinly sliced", "Pinch of red-pepper flakes (optional)", "1 to 2 bunches sturdy greens, such as dandelion, escarole, Swiss chard or kale, roughly chopped (about 8 cups)", "1 1/2 cups chicken stock, plus more as needed", "1/3 cup green olives, pitted and roughly chopped", "2 tablespoons raisins", "2 tablespoons finely chopped Italian parsley (optional)", "Flaky salt, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken thighs well with salt and pepper. In a large heavy-bottomed skillet, heat oil over medium-high heat. Add the chicken thighs, skin-side down, and cook undisturbed until nicely browned, about 5 to 6 minutes. Flip and brown the other side, about 4 to 5 minutes more. Transfer to a plate and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off all but 2 tablespoons of fat from the pan and return to medium-low heat. Add red onion, and cook until it begins to soften, about 1 to 2 minutes. Add garlic and red-pepper flakes, if using, and cook for 30 seconds more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chopped greens to the pan and stir, tossing to coat in the residual chicken fat. It may seem like a lot of greens, but they will cook down. Add the chicken thighs and any juices that have accumulated back to the pan and lay them on top of the greens. Pour in enough of the chicken stock to come up to the chicken about halfway. Bring the chicken to a gentle simmer. Partly cover and allow the chicken to finish cooking through, about 20 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in olives and raisins and cook uncovered until they are warmed through, and the raisins are nicely plumped, about 1 minute more. Garnish with parsley, if using, and serve. Season with flaky salt, if desired."}], "link": "https://cooking.nytimes.com/recipes/1019405-braised-chicken-thighs-with-greens-and-olives"}