{"@context": "http://schema.org", "@type": "Recipe", "name": "Angel Hair Pasta With Peppers and Tomatoes", "description": "This simple pasta celebrates the end-of-summer harvest and is perfect for a light lunch or supper, or as part of a buffet. Bell peppers and other sweet peppers — like Corno di Toro and many other varieties of peppers of every hue — ripen in late summer, the same time as long-awaited flavorful (and multicolored) tomatoes, making their pairing seem almost preordained.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/09/12/dining/12Kitchen1/12Kitchen1-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, pastas", "keywords": "capellini, cherry tomatoes, ricotta salata, sweet pepper, main course, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 161}, "recipeIngredient": ["2 garlic cloves, smashed to a paste", "2 tablespoons red-wine vinegar, or a bit less, to taste", "3 tablespoons extra-virgin olive oil, plus more for bread crumbs, if using", "Salt and pepper", "Red-pepper flakes, to taste", "1 cup finely diced sweet peppers (a mix of colors, if possible)", "3 to 4 cups halved cherry tomatoes, or larger tomatoes cut into 1-inch chunks", "1 pound angel hair pasta, capellini or spaghettini", "2 ounces ricotta salata or mild feta cheese, roughly crumbled (about 1/2 cup)", "1/4 cup coarse toasted bread crumbs, for garnish (optional)", "1 small bunch basil, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large pot of water over high heat and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a low, wide salad bowl or pasta-serving bowl, combine garlic, red-wine vinegar and 3 tablespoons olive oil. Add a good pinch of salt, black pepper and red-pepper flakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add sweet peppers and cherry tomatoes, season well with salt and toss to coat with dressing. (You may do this up to an hour before cooking the pasta.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Salt the pasta water and cook the angel hair pasta until al dente, usually 4 to 5 minutes. Drain pasta in a colander."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cooked pasta to the bowl and toss well to coat, spooning over juices from bottom of bowl and bringing plenty of tomatoes and peppers to the surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with ricotta salata. If using bread crumbs, season with 1 teaspoon olive oil and a little salt, then sprinkle crumbs over surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish with whole or torn basil leaves. Serve warm or at room temperature."}]}