{"@context": "http://schema.org", "@type": "Recipe", "name": "Curried Shrimp and Crab Gumbo", "description": "Arvinder Vilkhu is chef of Saffron Nola, the New Orleans Indian restaurant he owns with his family. Mr. Vilkhu developed this gumbo recipe over the 30-plus years he’s lived in New Orleans, incorporating curry leaves, fresh ginger and other ingredients and spices from his native India. At the restaurant, Mr. Vilkhu places the black pepper, cilantro and scallions in the bottom of the bowl to serve, and the pours the gumbo over them, which he believes keeps the flavors of the ingredients sharp.", "author": {"@type": "Person", "name": "Brett Anderson"}, "image": "https://static01.nyt.com/images/2019/01/09/dining/09gumborex1/09gumborex1-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "crab, curry leaves, kashmiri chile powder, shrimp, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 184}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 775, "unsaturatedFatContent": "41 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "4 grams", "proteinContent": "35 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1739 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup vegetable oil", "1 cup all-purpose flour", "1 medium white or yellow onion, finely chopped", "1 small green bell pepper, finely chopped", "2 celery stalks, finely chopped", "2 tablespoons minced garlic", "2 tablespoons minced ginger", "6 cups homemade shrimp stock or store-bought seafood stock", "3 medium tomatoes, crushed in a food mill, or 1 cup canned crushed tomatoes", "2 sprigs curry leaves (about 15 leaves)", "2 dried bay leaves", "1 teaspoon ground turmeric", "1/4 teaspoon dried thyme", "1 1/2 teaspoons kosher salt", "1/2 teaspoon Kashmiri chile powder or ground cayenne", "1 pound medium shrimp, peeled and deveined, tails removed", "1/4 pound blue lump crab meat (about 3/4 cup), or use other lump crab meat", "Cracked black pepper, for serving", "1/2 cup chopped cilantro stems and leaves, for serving", "1/2 cup chopped scallions, for serving", "Steamed rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the roux: In a large pot, heat the oil over medium until just short of smoking, 3 to 5 minutes. Using a wooden spoon, stir the flour into the oil, reduce the heat to medium-low and cook, stirring almost constantly, until the roux is the color of milk chocolate, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion, bell pepper and celery to the roux. Cook, stirring frequently, until vegetables are softened, 5 minutes. Stir in the garlic and ginger and cook until fragrant, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the stock, crushed tomatoes, curry leaves (discard the stems), bay leaves, turmeric and thyme, along with 1 teaspoon salt and 1/4 teaspoon chile powder. Bring the gumbo to a boil over high heat. Once the mixture boils, reduce the heat to low and simmer until the flavors meld, skimming the skin that forms on the surface, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the shrimp with the remaining 1/2 teaspoon salt and 1/4 teaspoon chile powder. Stir the shrimp into the gumbo and cook until shrimp is pink and cooked through, about 2 minutes. Stir in the crab meat and adjust the seasoning as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crack black pepper into empty soup bowls, then divide the cilantro and scallions among the bowls. Add a scoop of steamed rice to each bowl then ladle the gumbo on top to serve."}], "link": "https://cooking.nytimes.com/recipes/1019830-curried-shrimp-and-crab-gumbo"}