{"@context": "http://schema.org", "@type": "Recipe", "name": "Sambal Tumis", "description": "The traditional way to make sambal is to grind chiles and other ingredients with a mortar and pestle, as my mother, Rosni Pattilllo, did. The process is said to release intense heat and bold flavors. But my mom now uses a food processor, which works just fine. There are more than 300 varieties of sambal, each serving its own purpose: as a dip, marinade, soup base or condiment. This version uses belacan (sometimes spelled “belachan” or “blachen”), a pungent, hardened block of shrimp paste that adds depth to the sambal. (You can leave it out if you prefer, or can't find it.) Sambal tumis (slow-stirring) is a versatile stir-fried chile paste used in dishes like <a href=\"https://cooking.nytimes.com/recipes/1019458-mee-goreng-southeast-asian-fried-noodles\">mee goreng (fried noodles)</a>, sambal udang (shrimp), sambal telur (eggs) and nasi goreng (fried rice). You can store freshly made sambal tumis in the refrigerator for up to one week and in the freezer for up to 3 months. If you prefer a milder sambal, decrease the number of chiles or use milder ones; for a spicier version, increase the number of chiles or leave in seeds from some or all of the chiles.", "author": {"@type": "Person", "name": "Natalie Pattillo"}, "image": "https://static01.nyt.com/images/2018/08/15/dining/15Sambalrex1/merlin_142135845_e4a77587-414e-43b1-904a-cd8fd1557708-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "1 1/2 cups", "recipeCuisine": "asian, indonesian, malaysian", "recipeCategory": "condiments", "keywords": "lemongrass, red chiles, serrano pepper, thai chile", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 224, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "276 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 dried anchovies, each roughly 2 inches long", "4 to 6 dried red chiles (any variety is fine, except for chipotles, which are smoked)", "3 to 5 Thai bird chiles", "3 to 4 red chiles (such as Fresno or red Serrano)", "1/2 tablespoon belacan (shrimp paste)", "4 small round shallots or 2 regular supermarket shallots (about 3 ounces), diced", "6 cloves garlic, peeled", "1 tomato, diced", "2/3 cup canola oil, plus more if necessary", "1 tablespoon tamarind paste", "2 lemongrass stalks, tough outer layers removed and inner stalks smashed", "Kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the anchovies in a bowl of cold water and soak for 5 minutes. Put the dried chiles in a small pot, add water to cover and boil for 5 minutes or until chiles begin to soften. Drain the chiles, remove stems, slice open lengthwise and scrape out seeds. (Chile seeds can irritate the skin, so wear rubber or plastic gloves.) Remove and discard seeds from the Thai and red chiles and slice. Transfer all chiles to a food processor, pulse to blend and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a ramekin or small bowl, combine the belacan with 1 teaspoon water, mixing and adding more water as needed until there are no lumps. Drain the anchovies and add to the chiles in the food processor, along with the hydrated belacan, shallots, garlic, diced tomato and 1/3 cup of canola oil. Process into a smooth purée. (If the mixture still seems chunky, add more oil, a tablespoon at a time, and process until smooth.) In a separate ramekin or small bowl, mix tamarind paste with 2 teaspoons water until the paste is smooth and loose."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining 1/3 cup of oil in a wok or large skillet over medium heat until shimmering. Add the sambal purée and lemongrass stalks; stir tamarind into the sambal until combined and add salt to taste. Cook over low heat for about 20 minutes, stirring often, until the oil begins to separate and the sambal has thickened and turned brownish-red."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sambal to dish of your liking, such as mee goreng, or serve with fried tempeh. (Once it's added to a dish, remove the lemongrass. If storing the sambal for later use, keep the lemongrass.) When stored in small containers, sambal tumis can last for up to one week in the refrigerator, or in the freezer for up to 3 months."}], "link": "https://cooking.nytimes.com/recipes/1019421-sambal-tumis"}