{"@context": "http://schema.org", "@type": "Recipe", "name": "Migas Breakfast Tacos", "description": "Tortilla chips in tacos may seem like overkill, but they’re not. Set into scrambled eggs that are loaded with onions and poblanos, they soften and enrich the mix while keeping some crispiness. A slice of avocado on top — along with melted cheese — adds a nice creaminess to the mix. These tacos work well with red or green salsa, so use your favorite. While these would impress at a weekend brunch, they also come together quickly on weekday mornings, and can be wrapped in foil to be eaten out of hand.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2018/10/03/dining/gk-migas-tacos-horizontal/gk-migas-tacos-horizontal-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "mexican", "recipeCategory": "breakfast, brunch, dinner, lunch, quick, snack, weekday", "keywords": "avocado, cilantro, eggs, pepper jack cheese, poblano pepper, tortilla, tortilla chips, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 436}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 319, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "4 grams", "proteinContent": "13 grams", "saturatedFatContent": "6 grams", "sodiumContent": "374 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 large eggs", "Kosher salt", "6 corn tortillas", "2 tablespoons vegetable oil", "1 cup tortilla chips, broken if very large", "1/2 cup diced onion", "1 cup diced, seeded poblano pepper", "1/4 cup chopped cilantro", "2 ounces pepper jack cheese, grated (3/4 cup)", "1/2 avocado, pitted, peeled and sliced", "Salsa, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs with 1/2 teaspoon salt in a medium bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large cast-iron or nonstick skillet over medium heat. Put 3 tortillas in it and turn them until warm and pliable, 1 to 2 minutes. Stack on foil and wrap. Repeat with the remaining 3 tortillas, adding them to the same stack and wrapping to keep warm and soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat to medium-high. Add the oil and swirl to coat, then add the chips. Cook, stirring, until sizzling and browned in spots, about 30 seconds. Add the onion, poblano and 1 teaspoon salt. Cook, stirring, until the edges of the onion are just translucent but the vegetables are still crisp, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle the egg over the chips and vegetables. Let stand for 15 seconds until just starting to set, then stir rapidly to scramble until just set but still wet, about 30 seconds to 1 minute. Sprinkle the cilantro on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat and immediately divide among the warmed tortillas. Sprinkle with the cheese and top with the avocado and salsa. Serve immediately or wrap each taco in foil to eat out of hand."}]}