{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Beef Stew With Maple and Stout", "description": "This super-simple beef stew features spoon-tender chunks of beef and a sauce that gets a deep, dark flavor from stout beer and maple syrup. The recipe calls for carrots, parsnips and potatoes, but feel free to swap in similar quantities of other root vegetables, like turnips and rutabaga, cut into large pieces. But do make sure to avoid precut stew meat from the grocery store, which is often unreliable and cut too small. A chuck roast that you cut yourself is a far better option. You can also make this on the stovetop or in the oven: Season the meat with salt, then sear it in 2 tablespoons vegetable oil over high heat in a Dutch oven. Add the rest of the ingredients, stir to combine, cover and simmer on low (or in a 325-degree oven) for 2 to 3 hours until the meat is very tender and move on to step 2.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2018/10/29/dining/sd-beef-stew/sd-beef-stew-articleLarge-v2.jpg", "totalTime": "PT10H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, soups and stews", "keywords": "balsamic vinegar, chuck roast, cloves, maple syrup, stout beer, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1046}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 408, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "5 grams", "proteinContent": "42 grams", "saturatedFatContent": "4 grams", "sodiumContent": "866 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 large carrots, peeled and cut into 1 1/2-inch chunks", "2 large parsnips, peeled and cut into 1 1/2-inch chunks", "2 large russet potatoes, peeled and cut into 1 1/2-inch chunks", "3 thyme sprigs", "2 rosemary sprigs", "3 to 3 1/2 pounds chuck roast, excess fat trimmed, cut into 2-inch chunks", "1/3 cup stout beer", "1/3 cup maple syrup, preferably dark", "4 garlic cloves, chopped", "1 teaspoon onion powder", "1 teaspoon garlic powder", "3 teaspoons balsamic vinegar, preferably aged", "Kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the carrots, parsnips, potatoes, herbs, beef, beer, maple syrup, garlic, onion and garlic powders and 1 teaspoon vinegar in a 5- to 8-quart slow cooker. Season with 2 teaspoons salt and a generous amount of pepper. Mix well to combine (feel free to use your hands). Cook on low until the meat and vegetables are very tender, 10 to 12 hours, stirring the stew once if possible; this helps the beef and vegetables cook more evenly, but if it’s not possible, it will be fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and discard the herb sprigs. Stir in the remaining 2 teaspoons vinegar. Taste and add more salt and pepper if you like. Serve in shallow bowls with the meat, vegetables and some sauce."}], "link": "https://cooking.nytimes.com/recipes/1019691-slow-cooker-beef-stew-with-maple-and-stout"}