{"@context": "http://schema.org", "@type": "Recipe", "name": "Asado", "description": "Asado, a complex, salty-sour dish of pork shoulder slowly cooked in tomato sauce flavored with garlic, soy sauce and calamansi (a small citrus fruit), is a dish frequently eaten in Pampanga, said to be the culinary capital of the Philippines, and it is often served at large gatherings. This recipe comes from Chad and Chase Valencia, brothers and owners of the Los Angeles restaurant Lasa, who serve their mother’s asado alongside turkey and honey-roasted ham at Thanksgiving. The trick to the asado’s rich depths is evaporated milk; for a little extra salt and heft, you can add grated queso de bola, the nutty Filipino cheese served during the holidays. Don’t skip the overnight refrigeration step, which really allows the flavors to deepen.", "author": {"@type": "Person", "name": "Priya Krishna"}, "image": "https://static01.nyt.com/images/2018/11/21/dining/21valenciarex3/merlin_146708919_812155fe-02d9-4e24-b88c-6bcf94ccf8c6-articleLarge.jpg", "totalTime": "PT11H15M", "recipeYield": "6 servings", "recipeCuisine": "filipino", "recipeCategory": "soups and stews", "keywords": "boneless pork shoulder, calamansi, evaporated milk, queso de bola, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 831, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "61 grams", "fiberContent": "2 grams", "proteinContent": "57 grams", "saturatedFatContent": "20 grams", "sodiumContent": "2307 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 pounds boneless pork shoulder", "Kosher salt", "2 tablespoons canola, grapeseed or other neutral oil", "1 medium yellow onion, chopped", "1/4 cup sliced garlic cloves, cut 1/8-inch thick (from about 8 to 10 cloves)", "1 (15-ounce) can tomato sauce", "3/4 cup calamansi or lemon juice", "3/4 cup soy sauce", "1 bay leaf", "1/4 to 1/2 cup grated queso de bola (or Edam cheese), optional", "1/2 cup evaporated milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the pork shoulder into 4 pieces. Pat the pieces dry with paper towels and liberally season all over with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a heavy-bottomed pot (choose one with a lid, such as a Dutch oven) over medium-high heat. Sear the pieces of pork on all sides until brown, working in batches if necessary to avoid crowding the pot. Transfer the pork to a plate and pour off all but 2 tablespoons of fat from the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to medium, add the onions and garlic to the pot, and cook, stirring occasionally, until translucent, about 4 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Deglaze the pot with 4 cups water and the tomato sauce, then add the calamansi juice, soy sauce and bay leaf and stir to combine. Raise the heat to high and bring everything to boil. Add the browned pork and any juices that have accumulated back to the pot, and reduce the heat to medium-low. (You are looking for a gentle simmer, not a rolling boil.) Cover and simmer until the meat is tender, 2 to 2 1/2 hours. Remove the pot from the heat and let the meat cool in the covered pot until it reaches room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the meat to a separate container, leaving the braising liquid in covered pot. Refrigerate both overnight. The next day, skim the fat off the top of the liquid in the pot; discard the fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the braising liquid to a simmer. Add 1/4 cup of the grated cheese, if using, and the evaporated milk, stirring constantly until well incorporated. Taste and add more cheese if desired to add saltiness and thicken slightly. Season with salt, if needed, and keep warm over low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the chilled pork shoulder into 1/4-inch slices, cutting against the grain of the meat. Place pork slices in the asado braising liquid and heat until warmed through. Serve hot."}]}