{"@context": "http://schema.org", "@type": "Recipe", "name": "Italian Fennel Sausage", "description": "Make this simple fennel-scented sausage to toss into pasta or onto pizza. Par-cook large crumbles to fold into Thanksgiving stuffing or a pot of soup. Or fry up patties and serve alongside crusty bread and a bowl of tender white beans doused generously in olive oil.  Be sure to use ground pork with enough fat or you'll end up with dry, flavorless sausage. Twenty percent by weight is a good ratio, though 25 doesn’t hurt. If the ground pork available to you is too lean, ask the butcher to replace two ounces or so of the lean meat with ground pork belly or bacon.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2017/11/05/magazine/05eat3/05eat3-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "american, italian", "recipeCategory": "sausages", "keywords": "fennel seeds, ground pork, white wine, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 80}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 319, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "0 grams", "proteinContent": "19 grams", "saturatedFatContent": "9 grams", "sodiumContent": "275 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2 teaspoons Diamond Crystal kosher salt or 1 teaspoon fine sea salt", "1 1/2 teaspoons coarsely ground fennel seed", "1/2 to 1 tablespoon red-pepper flakes", "1 pound ground pork (20 to 25 percent fat by weight)", "1 teaspoon pounded or very finely grated garlic", "1 teaspoon dry white wine or vermouth", "Extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with parchment paper; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine salt, fennel seed and red-pepper flakes. Add pork to the spice mixture along with the garlic, and wine. Using your hands, mix thoroughly for 1 full minute, until the pork begins to appear tacky and sticks to the palm of your hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a cast-iron pan over medium heat. Use a heaping tablespoon of pork mixture to make a small, thin sausage patty. Add a teaspoon or so of olive oil, and cook the patty for 2 to 3 minutes on each side, or until cooked through. Taste, and if needed, add salt or any other seasonings to the uncooked sausage mixture and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide and form the remaining sausage into 8 2 1/2-inch patties, placing them on the prepared baking sheet as you go. Cover, and refrigerate for 30 minutes to allow the flavors to come together. (Patties can be made ahead and covered and refrigerated or frozen at this point until ready to use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook, wipe out cast-iron pan, and return to medium heat. Add 1 tablespoon olive oil. When it shimmers, add patties in a single layer, leaving space between them. Cook 3 to 4 minutes per side, or until browned on the surface and just cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain sausages on paper towels, and serve hot."}]}