{"@context": "http://schema.org", "@type": "Recipe", "name": "Cauliflower Rice", "description": "Cauliflower is a kitchen chameleon that’s available at most every grocery store year-round. Once pulverized into granules, it becomes a weeknight savior, keeping in the refrigerator for nearly a week and stepping in easily for normal rice. For the most flavorful cauliflower rice, use a little fat; add alliums like onion, garlic and scallions; and roast it instead of steaming or sautéing it, so the raw edges caramelize. Pop the little florets into the oven while you make the rest of dinner, then serve it as you would rice: with curry, a stir-fry, a protein and a vegetable, or just an egg on top. Cauliflower rice is also very amenable to having flavors added before or after roasting (see some ideas in the recipe below), or simply being eaten raw, dressed like a salad.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2018/12/27/dining/as-cauliflower-rice/merlin_148112625_06531f26-fdb9-44ba-a793-b7066fac8acf-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "10 to 12 cups raw; 4 to 5 cups cooked", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "cauliflower, garlic, olive oil, gluten-free, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 271}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 226, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "486 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 medium cauliflowers (about 4 pounds total), cored and cut into florets", "6 tablespoons olive oil", "2 large garlic cloves, finely chopped (about 1 tablespoon), optional", "Kosher salt and black pepper", "1 1/2 tablespoons canola or other neutral oil", "1 (2-inch) piece ginger, peeled and cut into thin matchsticks", "4 garlic cloves, thinly sliced", "1 1/2 teaspoons sesame oil", "1/2 teaspoon red-pepper flakes", "Kosher salt", "3 tablespoons tahini", "2 tablespoons lemon juice", "1/4 cup freshly grated Parmesan", "Black pepper", "1/2 cup red onion or shallots, finely chopped", "1/4 cup scallions, thinly sliced", "1/2 cup cilantro leaves and tender stems, roughly chopped", "1/4 cup mint leaves, roughly chopped", "2 tablespoons fish sauce", "2 tablespoons lime juice", "2 teaspoons red-pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees if you’re serving the rice cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a food processor halfway with cauliflower florets, then pulse  until it breaks down to about 1/4- and 1/8-inch pieces and resembles rice. Transfer to a very large bowl. Repeat with the remaining florets. The rice can be eaten at this point, or stored in an airtight container in the refrigerator for 5 days or in the freezer for 1 month."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve warm, toss the rice with olive oil and garlic (if using), then spread in an even layer on 2 baking sheets. Season with salt and pepper. Roast until dark golden brown at the edges and lightly golden all over, 15 to 20 minutes. Serve plain or with 1 of the sauces below."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the ginger-garlic sauce: Heat oil in a small frying pan over medium heat. Add the ginger and garlic and cook, stirring occasionally, until lightly golden, about 3 minutes. Turn off the heat, then stir in sesame oil, red-pepper flakes and a pinch of salt. Pour over cauliflower rice, toss to combine and serve at once."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the tahini-Parmesan sauce: In a small saucepan over medium-low heat, combine 3 tablespoons water, tahini and lemon juice. Once warm, add grated Parmesan and continue stirring until the cheese has melted and the sauce has come together. Season with black pepper. Drizzle over the cauliflower rice, to taste. Pass extra at the table."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For Thai-style rice: To the cooked rice, add red onion, scallions, cilantro, mint, fish sauce, lime juice and red-pepper flakes. Toss to combine and serve at once."}], "link": "https://cooking.nytimes.com/recipes/1019880-cauliflower-rice"}