{"@context": "http://schema.org", "@type": "Recipe", "name": "Raspberry and Cream Éclairs", "description": "A pretty-in-pink version of the classic favorite, these éclairs are filled with a raspberry cream made with fresh and freeze-dried raspberries for concentrated flavor and a rosy hue. Trader Joe’s and Whole Foods carry freeze-dried raspberries, as do many online stores, but you can leave them out if you can’t find them — the cream will be less intense, but still tasty. These éclairs are a labor of love, best enjoyed the day they’re created.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2019/01/30/dining/ss-raspberry-and-cream-eclairs/merlin_149765565_a2e74bc4-f85d-409b-ab6a-8517b20ec815-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "12 to 14 éclairs", "recipeCuisine": "", "recipeCategory": "pastries", "keywords": "confectioners' sugar, cream cheese, gelatin, heavy cream, raspberries, dessert, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 56}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 285, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "9 grams", "sodiumContent": "157 milligrams", "sugarContent": "25 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon cold water", "1 teaspoon gelatin", "1 1/2 cups/180 grams fresh raspberries", "8 ounces/225 grams cream cheese, at room temperature", "3 tablespoons honey", "2 tablespoons confectioners’ sugar", "1 1/2 teaspoon vanilla extract", "1/2 cup/10 grams freeze-dried raspberries, ground to a fine powder in a spice grinder", "3/4 cup/175 milliliters heavy cream", "6 tablespoons/170 grams unsalted butter (3/4 stick)", "2 teaspoons granulated sugar", "1/2 teaspoon kosher salt", "3/4 cup/95 grams all-purpose flour", "3 large eggs", "1 cup/120 grams fresh raspberries", "2 cups/245 grams confectioners’ sugar", "3/4 teaspoon vanilla extract", "Pinch of kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the raspberry cream: Add 1 tablespoon cold water to a small bowl; sprinkle the gelatin evenly on top. Let the mixture stand for 5 minutes. Meanwhile, smash 1/2 cup fresh raspberries in a large bowl. Add the cream cheese, honey, confectioners’ sugar, vanilla and half the freeze-dried raspberry powder and beat with a wooden spoon until smooth and creamy. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1/4 cup heavy cream in a small saucepan over medium-high. Stir in the gelatin mixture and cook until the gelatin is completely dissolved, about 3 minutes. Set aside to cool slightly, then stir into the cream cheese mixture until combined. Cover and chill for at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the puffs: In a medium saucepan, bring the butter, granulated sugar, salt and 3/4 cup water to a simmer over medium heat, stirring with a wooden spoon to encourage the butter to melt. As soon as it comes to a boil, add the flour, stirring constantly, until the dough forms a ball and pulls away from the sides of the pan, about 1 minute. Remove the pan from the heat and let the mixture cool for 3 to 4 minutes, stirring the dough occasionally to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Off heat, add the eggs to the pan, one at a time, stirring vigorously between each addition with a wooden spoon. The dough will break apart and slide around in the pot before it comes back together. Transfer the dough to a piping bag fitted with a large round or star tip."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two baking sheets with parchment paper. Pipe the dough into 4 1/2-inch-by-3/4-inch lengths about 3 inches apart. With a damp fingertip, flatten any points. Bake until deep golden brown and puffed, rotating the sheets halfway through, 20 to 24 minutes. They should be very light and crisp. Turn the oven off. Poke each éclair on either end with a toothpick to allow some steam to release. Return the puffs to the oven and prop the oven door open slightly with the handle of a wooden spoon. Allow the puffs to dry out completely, about 15 minutes. Transfer to a rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the glaze: Mash the fresh raspberries and run them through a fine-mesh sieve, reserving all the juice and discarding the seeds. Add the confectioners’ sugar, vanilla and salt to the reserved juice and whisk until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely chop the remaining 1 cup fresh raspberries. Whip the remaining 1/2 cup cream to soft peaks. Gently stir the chilled raspberry cream to loosen it, then fold in the raspberries and the whipped cream. Transfer the cream to a pastry bag fitted with a large fluted tip. Slice the top third off each éclair and fill the lower portion with cream. Dip the top of the top piece in the glaze, letting any excess drip off, and replace it. Sprinkle with the remaining raspberry powder. Serve immediately."}]}