{"@context": "http://schema.org", "@type": "Recipe", "name": "Scarlett’s Tuna Salad", "description": "For when it’s too hot to cook, there's the chef Scarlett Lindeman’s tuna salad — the same one she serves at her Mexico City restaurant, Cicatriz. Made with high-quality, oil-packed tuna, the salad is fresh, juicy, bright and summery, composed with cucumbers, avocado, pickled onion and lots of herbs. Don’t be afraid to season the cucumbers generously with salt at the start, and to season more as you build the layers of the salad. The dish is so simple that seasoning it well is key.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/07/22/magazine/22mag-Eat-image1/22mag-Eat-image1-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 4 as a side or 2 as dinner", "recipeCuisine": "", "recipeCategory": "easy, weeknight, salads and dressings", "keywords": "avocado, canned tuna, cucumber, rice-wine vinegar, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 674}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 311, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "6 grams", "proteinContent": "15 grams", "saturatedFatContent": "3 grams", "sodiumContent": "660 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup rice-wine vinegar", "1 tablespoon sugar", "2 teaspoons kosher salt", "1 red onion, peeled, halved and thinly sliced", "3 Persian cucumbers, peeled if skin is thick and waxy, sliced about 1/4-inch thick", "2 spring onions, thinly sliced", "2 limes, juiced, about 1/4 cup", "5 to 7 ounces olive-oil-packed tuna", "1 avocado, peeled and cubed", "1/2 teaspoon or more finishing salt, such as Maldon", "Freshly ground black pepper, to taste", "Handful basil leaves, washed and torn", "Handful cilantro sprigs, washed and torn", "Handful fresh mint leaves, washed and torn", "3 tablespoons extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a clean glass jar with a tightfitting lid, mix vinegar, sugar and 1 teaspoon kosher salt with 1/2 cup hot water. Shake until sugar is dissolved. Bring a pot of water to the boil, and add the onions. Let it sit for just a few seconds in the hot water, then drain well and transfer onions to the jar with the vinegar. The pickled onions will be ready to use in an hour, or can be made ahead and kept in the fridge for up to a week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, dress the cucumber and spring onions with the remaining kosher salt and lime juice. It should be fairly wet. Pour into a deep serving plate or a wide bowl, along with any extra liquid at the bottom of the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon tuna out of the oil, and use your hands to break it into bite-size pieces, directly into the now-empty mixing bowl. Add avocado, 3 tablespoons of pickled red onion and 1 tablespoon of pickling liquid from the jar, and mix gently with your hands to dress. Scatter over the cucumber mixture, and season with finishing salt and black pepper. Cover with torn herbs, and generously drizzle everything with olive oil. Eat right away, with spoons."}], "link": "https://cooking.nytimes.com/recipes/1019422-scarletts-tuna-salad"}