{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemony Pasta With Zucchini and Fresh Herbs", "description": "This simple pasta comes together quickly and makes use of what can sometimes be an overwhelming bumper crop of zucchini and other summer squash come August. Browning the squash in two batches is the only semi-fussy request, and it pays off by giving the squash an almost crunchy texture. Lemon and an abundance of fresh herbs provide brightness to this soon-to-be summer staple. Serve it with a tomato and onion salad dressed with plenty of grassy olive oil.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/08/17/dining/colu-henry-zucchini-pasta-horizontal/colu-henry-zucchini-pasta-horizontal-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, weekday, weeknight, pastas", "keywords": "main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 533}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 421, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "4 grams", "proteinContent": "15 grams", "saturatedFatContent": "3 grams", "sodiumContent": "509 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 pound fusilli or other short curvy pasta", "1 1/2 pounds zucchini or other summer squash, or a combination, halved lengthwise and cut into 1/2- inch thick pieces", "Kosher salt and black pepper", "4 tablespoons olive oil", "2 garlic cloves, thinly sliced", "1/2 teaspoon red-pepper flakes", "Juice and zest of 1 lemon", "1/2 cup grated Pecorino or grated Parmesan cheese, plus more for serving", "1 1/2 cups roughly chopped herbs, such as mint, basil, chervil, Italian parsley, plus more for garnish", "Flaky salt, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water (2 heaping tablespoons kosher salt to about 7 quarts water) to a boil. Add pasta and cook until it is just under al dente, 1 minute less than package directions. Drain, reserving 1 cup of the pasta cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the zucchini or other squash: Season chunks with salt and pepper. Heat 3 tablespoons of olive oil in a large skillet over medium heat and add the squash in one layer (you may need to do this in two batches) and cook undisturbed until it begins to turn golden brown, about 3 minutes. Flip and cook 2 to 3 minutes more. Remove from the pan and set aside. Taste and season again, if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 1 tablespoon oil to the pan. Add the garlic and red-pepper flakes and cook until the garlic becomes translucent, about 30 seconds. Add the squash back to the pan along with the lemon juice and half the lemon zest. Toss to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta to the skillet, and toss to combine. Add 1/2 cup of the pasta water and the grated cheese, and toss until the cheese emulsifies and is silky. If needed, add an additional 1/4 cup pasta water or more to loosen. Add the fresh herbs and toss again. Top with additional herbs and the remaining lemon zest. Serve in bowls, and pass grated cheese at the table. Season with flaky salt, if desired."}], "link": "https://cooking.nytimes.com/recipes/1019490-lemony-pasta-with-zucchini-and-fresh-herbs"}