{"@context": "http://schema.org", "@type": "Recipe", "name": "Silky Eggplant With Almond Salsa and Yogurt", "description": "Eggplant that’s silky-soft and bubbly-brown all over (rather than tough, oily or fossil-like) is a revelation — and, with just a little maneuvering, it’s not that hard. You’ll want to sear the eggplant slices in hot oil, cover them for a minute or two, until they’re soft, and then add a touch more oil until they’re beautifully golden. You could, of course, eat these rounds on their own (and you might!), but spicy almond salsa, cubes of salty, crispy halloumi, and a bed of garlicky yogurt make them a full meal (especially if have warmed pita for swiping everything up). While salting the eggplant slices before you cook isn’t completely necessary, it will help draw out some of the vegetable’s moisture, making it less prone to bitterness and oil saturation.", "author": {"@type": "Person", "name": "Sarah Jampel"}, "image": "https://static01.nyt.com/images/2018/08/08/dining/eggplant-almond-salsa/eggplant-almond-salsa-articleLarge-v2.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, vegetables", "keywords": "almonds, eggplant, halloumi, yogurt, main course, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 254}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 704, "unsaturatedFatContent": "34 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "55 grams", "fiberContent": "16 grams", "proteinContent": "26 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1337 milligrams", "sugarContent": "17 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 small or 2 medium Italian eggplant (about 24 ounces total)", "Kosher salt", "1/2 cup plain, full-fat Greek yogurt", "Juice of 1/2 lemon, plus more for serving", "2 garlic cloves, 1 smashed and 1 minced", "1 teaspoon plus 1/4 to 1/2 cup olive oil", "2 heaping tablespoons torn or roughly chopped mint", "Black pepper", "2/3 cup roughly chopped almonds", "3 tablespoons red-wine vinegar", "1 Fresno or Serrano pepper, minced", "8 ounces halloumi cheese, cut into 1-inch cubes", "Pita bread, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a colander with paper towels or a clean dishcloth. Slice the eggplant into 3/4- to 1-inch rounds, place in the colander and sprinkle with salt. Set aside for 20 to 30 minutes, until water beads on top of the eggplant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the yogurt sauce: In a medium bowl, mix the yogurt with the lemon juice, smashed garlic clove, 1 teaspoon olive oil and 1 tablespoon of the torn mint. Season with salt and pepper to taste and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy pan with high sides over medium heat, toast the chopped almonds until golden brown and fragrant, 4 to 6 minutes, stirring occasionally to avoid burning. Remove pan from the heat and transfer nuts to a medium bowl, then add the red-wine vinegar, 1 tablespoon olive oil, minced garlic clove and Fresno pepper. Mix and season with salt to taste. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up a plate or cutting board lined with paper towels next to the stove. Wipe out the pan you were working with and heat 2 tablespoons of olive oil over medium-high heat until hot. Blot the moisture from the eggplant, and when the oil is hot, add the slices in a single layer (you’ll probably have to work in batches). Cook until brown, then flip, about 3 to 4 minutes per side. While browning, as the eggplant is getting dry, add 1 to 2 teaspoons of olive oil and cover the pan for 1 to 2 minutes. The eggplant will be fork-tender and golden brown on both sides when finished. Transfer to the paper towel-lined surface and sprinkle with salt. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’ve finished cooking the eggplant, add the cubed cheese to the hot pan, leaving any residual oil (add a teaspoon of olive oil if there’s not enough left in the pan). Sauté, stirring frequently, until brown and crisp all over. Remove pan from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the yogurt on a platter. Arrange the eggplant and halloumi on top, then scatter with almond salsa. Garnish with remaining torn mint, then sprinkle with any leftover lemon juice and season with salt and pepper. Serve with pita."}]}