{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Green Beans and Almond Gremolata", "description": "Celery, an underappreciated vegetable relegated to making stocks and mirepoix, rarely gets the attention it deserves. It’s available in the grocery store year-round. Come late summer, it starts popping up in farmers' markets everywhere, and it deserves to shine. In this dish, its pleasantly bitter leaves are used in a unique take on gremolata, a fresh herb condiment traditionally made with Italian parsley (which you can also use here). Snappy green beans, also readily available in late summer, round out this unassuming, but impressive pasta you’ll want to make again and again no matter what the season.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/09/11/dining/CH-pasta-with-green-beans-horizontal/merlin_143375034_7e70da66-c904-430a-89c7-2d9dd42eee5d-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, weeknight, pastas", "keywords": "celery, gemelli, sliced almonds, string beans, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 305}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 453, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "5 grams", "proteinContent": "14 grams", "saturatedFatContent": "7 grams", "sodiumContent": "376 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup sliced almonds", "Scant 1/3 cup finely chopped celery leaves or parsley leaves", "1 tablespoon lemon zest (from 1 medium lemon), plus more for serving", "1 garlic clove, grated", "Kosher salt", "1 pound gemelli, campanelle or cavatappi", "3/4 pound string beans, trimmed and cut into 1-inch pieces", "2 tablespoons olive oil, plus more for drizzling", "2 garlic cloves, thinly sliced", "1/2 teaspoon red-pepper flakes", "4 tablespoons unsalted butter", "1/4 cup grated Pecorino or Parmesan, plus more for serving", "Kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water (2 heaping tablespoons kosher salt to about 7 quarts water) to a boil. Meanwhile, in a large skillet over medium-low heat, toast the almonds, stirring frequently so they don’t burn, about 4 to 5 minutes. Remove from heat. In a medium bowl, combine the almonds, celery or parsley leaves, lemon zest, garlic and a pinch of salt. Set aside and wipe out skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pasta to boiling water and cook until it is al dente, according to package directions. About 2 minutes before it’s done, add the beans to the pasta pot. Reserve 1 cup of the pasta cooking water, and drain the pasta and beans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta and beans drain, make the sauce: Heat the olive oil in the large skillet over medium heat. Add the garlic and red-pepper flakes and cook until the garlic is golden in color, about 1 to 2 minutes. Turn heat to low and add 1/2 cup of the reserved pasta water to the skillet (be careful of splattering) and cook until it is reduced by about half, 1 to 2 minutes more. Turn heat to medium and add the pasta, green beans and butter to the skillet and toss until the butter melts. Add the cheese and an additional 1/4 cup water and toss until the cheese is emulsified and the pasta is glossy with sauce. If needed, add an additional 1/4 cup pasta water to loosen. Season with kosher salt, to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pasta to a large bowl, top with gremolata and drizzle with more olive oil. Pass additional grated cheese at the table, if desired."}], "link": "https://cooking.nytimes.com/recipes/1019488-pasta-with-green-beans-and-almond-gremolata"}