{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Cumin Pork Chops and Brussels Sprouts", "description": "In this convenient sheet-pan supper, bone-in pork chops are coated in a spicy, garlicky cumin rub before being cooked alongside  brussels sprouts and sage leaves. Roasted at high heat, the sprouts get golden at their edges and tender at their cores while the sage leaves turn brown and crisp all over, almost as if you’d fried them. Feel free to double this recipe. Just use large rimmed sheet pans instead of smaller ones.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/02/28/dining/28APPECOV-copy2/merlin_134200121_a691733a-b753-4663-a006-e1220f7c45da-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "3 to 4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, quick, weekday, weeknight, meat, one pot, steaks and chops", "keywords": "brussels sprouts, cumin, pork chops, sage, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1109}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 355, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "8 grams", "proteinContent": "31 grams", "saturatedFatContent": "5 grams", "sodiumContent": "570 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 tablespoon dark brown sugar", "1 teaspoon kosher salt, more as needed", "1 teaspoon whole cumin seeds", "1/2 teaspoon ground cumin", "1/2 teaspoon freshly ground black pepper, more as needed", "1/4 teaspoon crushed red-pepper flakes, or to taste", "2 cloves garlic, grated or minced", "2 large bone-in pork chops, about 1 1/2 inches thick (about 1 3/4 pounds total)", "1 pound brussels sprouts, trimmed and halved through the stem", "1/4 cup whole sage leaves", "2 tablespoons extra-virgin olive oil", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine brown sugar, salt, cumin seeds, ground cumin, black pepper, red-pepper flakes and garlic until mixture resembles wet sand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Smear mixture all over pork and let sit at room temperature for at least 20 minutes, refrigerate, covered, up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. In a bowl, toss brussels sprouts and sage leaves with oil and a large pinch of salt and pepper. Spread out on a quarter-size rimmed baking sheet (or in a 9-by-13-inch baking dish) and place in the oven. Place the pork on a second quarter-size rimmed baking sheet (or use a regular rimmed baking sheet) and place in the oven along with the sprouts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast pork and sprouts for 15 minutes. Flip the chops over and give the sprouts a stir, and continue roasting until the pork is cooked through (135 degrees for medium-rare) and the sprouts are browned and tender, 5 to 10 minutes more. Let pork rest 5 minutes before slicing off the bone as you would a steak. Serve together, with lemon wedges."}], "link": "https://cooking.nytimes.com/recipes/1019196-sheet-pan-cumin-pork-chops-and-brussels-sprouts"}