{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan Pizza", "description": "The pizza authority Anthony Falco, once czar of the oven at Roberta’s in Brooklyn and now (literally!) an international pizza consultant, grew up in Austin, Tex., eating his great-grandmother’s Sicilian grandma pies, which he liked a great deal, and personal pan pizzas from Pizza Hut, which he loved unreservedly. This recipe, he told me in 2018, pays homage to that buttery, high-lofted pie, with a crisp bottom crust, a slightly sweet sauce and an enormous amount of cheese. Slices of pepperoni make a beautiful topping, cupping in the heat of the oven and drizzling crimson oil across the edges of the pie. <a href=\"https://cooking.nytimes.com/recipes/1019336-pizza-dough\">The dough</a> takes a long time to proof and the recipe delivers a lot of it, so making the recipe is a great excuse for planning a pizza party. Cast-iron pans are best for the baking, but square or rectangular baking pans with high sides will do nicely in a pinch.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2018/06/03/magazine/03Eat1/03Eat1-articleLarge-v3.jpg", "totalTime": "PT21H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "pizza and calzones", "keywords": "crushed canned tomatoes, honey, mozzarella, pepperoni, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 978}, "recipeIngredient": ["1000 grams unbleached all-purpose flour, approximately 8 cups", "30 grams kosher salt, approximately 1 1/2 tablespoons", "700 grams lukewarm water, approximately 2 3/4 cups", "60 grams unsalted butter, preferably high-fat European-style, approximately 1/4 cup, melted", "40 grams olive oil, approximately 3 tablespoons, plus more to grease pans", "5 grams active dry yeast, approximately 1 3/4 teaspoons", "2 tablespoons olive oil", "1 clove garlic, peeled and minced", "2 tablespoons tomato paste", "Pinch of chile flakes, to taste", "1 28-ounce can chopped or crushed tomatoes", "2 tablespoons honey, or to taste", "1 teaspoon kosher salt, or to taste", "Olive oil", "Part-skim mozzarella, roughly grated, 525 grams or 4 1/2 cups: 175 grams or 1 1/2 cups per pie", "Fresh mozzarella, cut into cubes, 300 grams or 3 cups: 100 grams or 1 cup per pie", "Sliced pepperoni, to taste", "3 pinches fresh oregano, or 3 teaspoons dried: 1 pinch or teaspoon per pie"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough a day or two before you want to bake; the recipe makes enough for three pies. Combine the flour and salt in your largest mixing bowl. In another mixing bowl, combine the water, butter, olive oil and yeast. Mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a rubber spatula to create a well in the center on the flour mixture, and add to it the liquid from the other bowl, stirring with the spatula and scraping down the sides of the bowl to bring everything together. Mix it all together until it is a large, shaggy ball of wet dough, cover with plastic wrap and allow to sit for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the dough and, with floured hands, knead it until it is uniformly smooth and sticky, approximately 3 to 5 minutes. Move the dough ball into a clean mixing bowl, cover with plastic wrap and allow to rise for 3 to 5 hours at room temperature, then refrigerate, at least 6 hours and up to 24."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The morning you want to make the pizzas, remove the dough from the refrigerator, divide into 3 chunks of equal size (about 600 grams each) and shape them into oblong balls. Use olive oil to grease three 10-inch cast-iron skillets, 8-inch-by-10-inch baking pans with high sides, 7-inch-by-11-inch glass baking dishes or some combination thereof, and place the balls into them. Cover with plastic wrap, and let rise at room temperature, 3 to 5 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce. Place a saucepan over medium-low heat, and add to it 2 tablespoons olive oil. When the oil is shimmering, add the minced garlic and cook, stirring, until it is golden and aromatic, approximately 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomato paste and a pinch of chile flakes, and raise the heat to medium. Cook, stirring often, until the mixture is glossy and just beginning to caramelize."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes, bring to a boil, then lower heat and allow to simmer for 30 minutes, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take sauce off the heat, and stir in the honey and salt, to taste, then blend in an immersion blender or allow to cool and use a regular blender. (The sauce can be made ahead of time and stored in the refrigerator or freezer. It makes enough for 6 or so pies.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 3 hours or so the dough will have almost doubled in size. Stretch the dough very gently to the sides of the pans, dimpling it softly with your fingers. The dough can then be left to rest for another 2 to 8 hours, covered with wrap."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pizzas. Heat oven to 450. Gently pull the dough to the edges of the pans if it hasn’t risen to the edges already. Use a spoon or ladle to put 4 to 5 tablespoons of sauce onto the dough, gently covering it entirely. Sprinkle the low-moisture mozzarella onto the pies, then dot them with the fresh mozzarella and the pepperoni to taste. Sprinkle with the oregano and lash with a little olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pizzas onto the middle rack of the oven on a large baking sheet or sheets to capture spills, then cook for 15 minutes or so. Use an offset spatula to lift the pizza and check the bottoms. The pizza is done when the crust is golden and the cheese is melted and starting to brown on top, approximately 20 to 25 minutes."}], "link": "https://cooking.nytimes.com/recipes/1019335-pan-pizza"}