{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetarian Tortilla Soup", "description": "This vegetarian version of tortilla soup is no less complex than its chicken counterpart, thanks to plenty of vegetables, spices and a secret ingredient: canned chipotles in adobo. Smoked and dried jalapeños softened in a vinegar-tomato mixture, these little powerhouses do much of the heavy lifting in this vegetarian soup, offering depth and a certain meatiness to an otherwise light and tangy broth.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/10/23/dining/ar-vegetarian-tortilla-soup/ar-vegetarian-tortilla-soup-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "soups and stews", "keywords": "appetizer, main course, side dish, chipotles in adobo, corn kernels, corn tortillas, queso fresco", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1517}, "recipeIngredient": ["2 tablespoons vegetable oil", "1 large yellow onion, finely chopped", "4 cloves garlic, finely chopped", "1 jalapeño, seeds removed, finely chopped", "Kosher salt and freshly ground pepper", "1 1/2 teaspoons chile powder", "2 chipotles in adobo, finely chopped", "1 (28-ounce) can whole peeled tomatoes, drained and crushed", "4 cups vegetable broth", "2 cups corn kernels, fresh or frozen and thawed", "2 cups vegetable oil", "8 small corn tortillas, cut into 1/4-inch strips", "Kosher salt", "1 avocado, pitted and cut into 1/2-inch pieces", "3/4 cup crumbled queso fresco or shredded Cheddar or Monterey jack", "3/4 cup sour cream or crema", "1/2 cup chopped cilantro", "1/4 red or yellow onion, finely chopped", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large, heavy-bottomed pot over medium heat. Add onion, garlic and jalapeño and season with salt and pepper. Cook, stirring occasionally, until onion is softened and translucent, 5 to 8 minutes. Add chile powder and stir to coat. Cook a minute or two to toast the spices, then add chipotles and tomatoes. Season with salt and pepper and cook, stirring occasionally, until the tomatoes start to caramelize a bit on the bottom of the pot, concentrating their flavor. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add vegetable broth, corn and 2 cups of water. Bring to a simmer and reduce heat to low. Simmer until flavors meld and broth tastes rich and flavorful, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large cast-iron or stainless-steel skillet or heavy-bottomed pot. Bring oil to 375 degrees and working in batches, fry tortilla strips until light golden brown and crisp, 2 to 3 minutes. Transfer to a paper towel-lined plate and season with salt.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place about 3/4 of the tortilla strips into broth and stir to submerge and soften for a few minutes. Divide soup among bowls and top with avocado, cheese, sour cream, cilantro, onion and remaining fried tortilla strips. Serve lime alongside for squeezing."}], "link": "https://cooking.nytimes.com/recipes/1019107-vegetarian-tortilla-soup"}