{"@context": "http://schema.org", "@type": "Recipe", "name": "Panettone Bread Pudding", "description": "If you’ve bought a loaf of truly fantastic panettone, made in the Italian tradition from a natural starter, the kind that’s airy and melting, we hope you don’t have any leftovers. But if you find yourself with an excess of mass-produced panettone, or simply very old panettone that’s past its prime, here’s how to  transform it into something special. Cut it into thick slices, as the pastry chef Elisabeth Prueitt does with brioche, when she makes her bread pudding at Tartine Bakery in San Francisco. Toast them. Now layer the bread in a wide dish, and pour over a whisked custard of milk and eggs. It will look like too much liquid, but as it bakes, the panettone will soak it all up, becoming moist and tender and impossibly rich. It’s close enough to a casserole of French toast to make it ideal for a special holiday breakfast, but sweet enough to step in as dessert on a cold night. Vanilla would be a classic way to flavor the custard, but panettone tends to be quite sweet and perfumed already, so taste the bread first before adding extras.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/11/29/dining/29PANETTONE/29PANETTONE-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, custards and puddings", "keywords": "dessert, fall, winter, panettone", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 89}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 418, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "14 grams", "saturatedFatContent": "6 grams", "sodiumContent": "373 milligrams", "sugarContent": "23 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 tablespoon unsalted butter", "6 to 8 slices/550 grams panettone", "6 eggs", "1/3 cup/67 grams sugar", "1/2 teaspoon kosher salt", "4 cups whole milk", "Confectioners' sugar, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees and butter a deep baking dish that will fit all the bread slices in a single layer, overlapping slightly, about 9 by 5 inches. Place the sliced panettone on a sheet pan and lightly toast it in the oven so that it’s still flexible, but dry to the touch, about 10 minutes. Arrange toast in the baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, whisk the eggs with the sugar and salt, then add the milk and whisk until smooth. Pour through a fine-mesh strainer over the panettone, allowing the excess mixture to fill up the pan. Cover tightly with aluminum foil and bake for 45 minutes to 1 hour, or until the bread has soaked up all the custard and puffed up, and the custard is no longer runny. Allow to cool at least 30 minutes before serving, then use a fine-mesh sieve to dust all over with confectioners' sugar and serve."}], "link": "https://cooking.nytimes.com/recipes/1019064-panettone-bread-pudding"}