{"@context": "http://schema.org", "@type": "Recipe", "name": "Make-It-Your-Own Udon Noodle Soup", "description": "This incredibly easy soup, which was developed for a special kids edition of The Times, is just the thing to warm you from fingertips to toes on a chilly day. It starts with a simple garlic-ginger broth, to which you add pretty much any vegetable, tofu or cooked meat that you like (meatballs are fun). Just be sure to slice any firm vegetables thinly, so they can cook quickly. Toss a tangle of cooked noodles in to the broth, and add a frenzy of toppings – halved hard-boiled eggs, roasted peanuts, sliced scallions, sprouts, nori (a type of seaweed), a drizzle of sriracha – whatever excites you. As for noodles, we like udon, because they're delightfully soft and chewy, but you can also use spaghetti, bucatini or even ramen. (Fun fact: Udon dough is traditionally kneaded with your feet.)", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2018/05/14/magazine/udon-noodle-soup2/udon-noodle-soup2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 3 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, easy, for two, lunch, quick, weekday, soups and stews", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 117}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 351, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "2 grams", "proteinContent": "15 grams", "saturatedFatContent": "2 grams", "sodiumContent": "568 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 ounces dried udon (2/3 of an 8-ounce package) or 2 7-ounce packages fresh or frozen noodles (spaghetti or bucatini also work)", "1 teaspoon sesame, olive, vegetable or canola oil", "1 tablespoon olive oil", "Fresh ginger, about 1-inch, peeled and finely minced, or grated on the smallest holes of a box grater", "2 to 4 garlic cloves, peeled and finely minced, or grated on the smallest holes of a box grater", "3 cups low-sodium vegetable or chicken broth", "2 cups, total, fresh or frozen vegetables, like thinly sliced carrots, bok choy, mushrooms, snow or snap peas, green beans, baby corn, corn kernels, peas, edamame, fresh spinach", "1/2 cup cubed firm tofu, precooked chicken, pork or beef (optional)", "1 tablespoon white miso paste or 3 to 4 tablespoons soy sauce, plus more soy sauce as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare noodles according to package directions, and drain. Toss with a teaspoon of sesame, olive, vegetable or canola oil to prevent them from sticking together, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan over medium heat, heat 1 tablespoon of olive oil until it shimmers, and sauté the grated ginger and garlic until you smell it (less than a minute). Do your best not to burn it. Add 2 cups of stock to the pot. Be careful – it might splatter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a boil, and lower the heat to a simmer (about medium-low). Add carrots (or any hard, root vegetables, if using), and cook until they are crisp-tender, about 1 to 2 minutes. Add tofu or any vegetables (except spinach), and cook until tender but still bright in color, about 1 to 2 minutes. Turn off heat, and cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pot, heat the remaining 1 cup of stock until it steams. Remove from the heat, and whisk in the miso paste until the miso is completely dissolved, then pour the entire miso mixture into the pot with the soup. (If using soy sauce instead of miso, skip this part and add the rest of the stock and soy sauce.) Stir in the cooked noodles and fresh spinach, if using, and heat through over medium-low, if necessary. Do not bring the soup to a boil with the miso: Some cooks believe this can ruin the miso's delicate flavor. Top as desired and season additionally, if desired, with soy sauce."}], "link": "https://cooking.nytimes.com/recipes/1019279-make-it-your-own-udon-noodle-soup"}