{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Rice With Shrimp, Bacon and Corn", "description": "This one-pan recipe is a great use of leftover rice, though you can also use freshly cooked rice as long it’s no longer hot. The starch in sticky short-grain rice, together with the corn’s starch, caramelize into a nice crust that you can remove in big pieces. Long-grain rice will brown as well, but stay loose when served. Try to get a little of everything in each bite: crisp yet tender rice and corn, savory shrimp, crunchy bacon, juicy tomatoes. This recipe was developed with 16/20-count shrimp in mind, but you can use whatever shrimp you find aside from fancy super-jumbo ones. Serve with hot sauce if you’d like.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2018/07/19/dining/ko-crispy-rice-shrimp/ko-crispy-rice-shrimp-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weekday, weeknight, grains and rice, seafood", "keywords": "corn, rice, shrimp, tomatoes, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 747}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 521, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "4 grams", "proteinContent": "27 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1027 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon vegetable oil", "1 pound peeled and deveined shrimp, patted very dry", "Kosher salt and ground black pepper", "4 strips bacon", "3 ears corn", "6 scallions", "1 cup grape tomatoes, or 1 large chopped juicy tomato", "4 cups cooked rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in large cast-iron skillet or other heavy skillet over high heat. Season shrimp with salt and pepper. Add to the hot oil in a single layer and sear until browned, 1 to 2 minutes per side. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat down to medium-low and add the bacon in a single layer. Cook, turning to evenly brown, until crisp, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the bacon browns, shuck the corn and cut off the kernels. You should end up with about 3 1/2 cups. Thinly slice the scallions and set aside some greens for garnish. Cut the tomatoes in half. (If the bacon is done cooking before you're finished slicing, remove the pan from the heat for a moment.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the bacon on paper towels, leaving as much liquid as possible in the skillet. Turn the heat up to medium-high and add the corn, scallions, and a pinch of salt to the skillet. Cook, stirring, until the scallions just wilt, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice and stir until well-mixed and heated through, about 3 minutes. Press the rice evenly across the bottom and up the sides of the pan. Let cook, without stirring, as the rice and corn begin to crackle, until you smell a toasty scent and the rice browns, about 5 minutes. You can lift up a section of rice to peek and see if a golden brown crust has developed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat and divide the rice mixture among four bowls, scattering the tomatoes, shrimp and accumulated juices on top of each. (Alternatively, serve rice directly from the pan, with tomatoes and shrimp on top.) Season to taste with salt and pepper. Crumble the bacon all over and garnish with the reserved scallions."}], "link": "https://cooking.nytimes.com/recipes/1019434-crispy-rice-with-shrimp-bacon-and-corn"}