{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Tuna, White Bean and Fennel Salad", "description": "Rich tuna and creamy white beans are the foundations of a favorite warm-weather Mediterranean salad, often accented with tomatoes and onion. Here, well-seasoned tuna fillet is instead seared rare in a cast-iron skillet, though it could also be grilled over hot coals. But feel free to use best-quality canned tuna, and skip the cooking altogether. The crisp, thinly sliced fennel adds freshness and mirrors the fennel seed in the seasoning.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/03/28/dining/28kitchrex/merlin_135562968_d7af4baa-a544-47af-8810-2ecc4b6e1f03-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner, lunch, quick, snack, salads and dressings", "keywords": "fennel, tuna fillet, white beans, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 291}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 862, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "131 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "34 grams", "proteinContent": "72 grams", "saturatedFatContent": "1 gram", "sodiumContent": "958 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 to 1 1/2 pounds tuna fillets, in 2-inch-thick slices", "Salt", "1/2 teaspoon coarsely ground black pepper", "1 teaspoon fennel seeds, toasted and coarsely ground", "1 teaspoon dried fennel pollen (optional)", "Extra-virgin olive oil", "1 small to medium red onion", "6 cups cooked cannellini or other white beans", "4 tablespoons fresh lemon juice, more to taste", "1 teaspoon lemon zest", "2 garlic cloves, pressed or minced to a paste", "1/2 teaspoon crushed red-pepper flakes", "2 smooth, pale green medium fennel bulbs", "2 tablespoons freshly chopped parsley", "1 tablespoon chopped fennel fronds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season tuna generously on both sides with salt, then sprinkle with the black pepper, fennel seed and pollen (if using). Drizzle very lightly with olive oil and rub the seasoning into the fillets with your hands. Set aside at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and dice the onion and soak in ice water for 10 minutes (this will tame its bite). Drain the beans and put in a bowl. Add a generous sprinkling of salt and 2 tablespoons lemon juice and stir. Drain onions and add to beans. Stir in 1 tablespoon olive oil and toss to coat. Transfer to a serving platter and set aside at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: In a small bowl, whisk together 2 tablespoons lemon juice, the lemon zest, garlic, a pinch of salt, crushed red pepper and 3 tablespoons olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a wide cast iron pan over high heat. When it is hot, add tuna. Cook for about 2 minutes, until a golden brown crust forms, then flip and cook for 1 to 2 minutes more. Take care not to let the spices scorch; reduce the heat if necessary. The exterior of the fish will be cooked, but the interior will be quite rare. For medium-rare, cook an additional 2 minutes on the second side. Remove from pan and transfer to a cutting board to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a very sharp knife or mandoline, slice fennel crosswise into very thin slices. Salt lightly and toss with dressing. Arrange dressed fennel around the edge of the platter, surrounding the beans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tuna in ½-inch slices and arrange over beans. Sprinkle with parsley and fennel fronds and serve at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1019238-seared-tuna-white-bean-and-fennel-salad"}