{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramel Apples", "description": "An easy recipe for making homemade caramel apples, this can be doubled or tripled easily to make more. Once dipped, the apples can be rolled in chopped nuts, candy, or drizzled with chocolate for a little extra flair. Be sure to start with room temperature apples as cold apples will cause the caramel mixture to harden too quickly making it difficult to work with.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2018/09/05/dining/em-caramel-apple-horizontal/merlin_141963945_a4503817-b319-4956-accd-df0435f5524f-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "snack, candies", "keywords": "apple, corn syrup, vanilla extract, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 55}, "recipeIngredient": ["4 medium apples (about 1 1/2 pounds total), such as Granny Smith, McIntosh or Honeycrisp, preferably organic (see note), washed and dried, at room temperature", "4 (8-inch) sturdy treat sticks", "1 cup/200 grams granulated sugar", "1/3 cup/80 milliliters light corn syrup", "1/2 teaspoon kosher salt", "3/4 cup/180 milliliters heavy cream", "1 teaspoon vanilla extract", "1 tablespoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with a silicone baking mat or a piece of lightly greased parchment paper. Place the apples onto the prepared baking sheet, and press a treat stick firmly into the stem end, into the center of each apple."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot, combine the sugar, corn syrup and 1/3 cup water. Stir the mixture with a silicone spatula or wooden spoon over medium heat until the mixture begins to bubble at the edges. Once it begins to bubble, stop stirring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the mixture (without stirring) until it begins to turn a medium amber color, 10 to 12 minutes. When the desired caramel color is reached, stir in the salt, cream, vanilla and butter — the mixture will bubble up vigorously — stir until it’s combined and smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue to cook the caramel over medium heat, stirring constantly, until the mixture reads 245 degrees on an instant-read thermometer, another 8 to 10 minutes. Leave the syrup mixture in the pot, and allow to cool to 200 degrees. (If the mixture cools too much, it can be reheated until fluid.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, dip 3/4 of an apple into the caramel, tilting the pot as needed to coat. Hold the apple over the caramel, letting the excess drip off, then transfer to the baking sheet. Repeat with remaining apples, reheating the caramel as necessary. Cool completely before serving."}]}