{"@context": "http://schema.org", "@type": "Recipe", "name": "Steak Haché", "description": "Salisbury steak is an instance of an old recipe with enduring value. It is a good idea and a good name, though its reputation as a TV dinner has stained the prettiness somewhat. All that the old recipe — and its many variations — needed was a little updating. Here is a Frenchier and more contemporary version — rich with porcini butter, piquant with salsa verde. It is old-fashioned enough to be fun and elegant enough for a dinner party — and most definitely does not need a hamburger bun.", "author": {"@type": "Person", "name": "Tamar Adler"}, "image": "https://static01.nyt.com/images/2018/03/18/magazine/18mag-eat1/18mag-eat1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "capers, ground sirloin, parmesan, parsley, porcini, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 106}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 570, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "5 grams", "proteinContent": "32 grams", "saturatedFatContent": "18 grams", "sodiumContent": "493 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup dried porcini mushrooms", "1 pound best ground sirloin or chuck", "5 tablespoons butter, at room temperature", "3 tablespoons finely chopped white onion", "1 egg, beaten", "Kosher salt", "3 tablespoons freshly grated Parmesan cheese", "1 tablespoon red-wine vinegar", "1/2 teaspoon capers, finely chopped", "1/2 cup finely chopped fresh parsley", "Olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the mushrooms in enough boiling water to cover them for 20 minutes, then drain through a fine-mesh sieve set over a bowl, and finely chop. (Reserve the liquid if you want to add mushroomy savor to a future soup or pasta sauce. It freezes well as a few ice cubes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, mix the beef, 6 tablespoons of the mushrooms, 1 tablespoon of the butter, 1 tablespoon of the onion, the egg, a large pinch of salt and the Parmesan until well combined. Form into 4 1-inch thick patties."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make porcini butter by combining the remaining mushrooms and 4 tablespoons of butter and a sprinkle of salt. Make salsa verde by soaking the remaining onion in the vinegar with a sprinkle of salt for 10 minutes, then adding the capers, parsley and olive oil to cover and make it a bit swimmy; taste for salt, and adjust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a heavy cast-iron pan, and drizzle with olive oil. Cook the chopped steaks for 4 minutes on the first side, salting them liberally. Flip, and cook for 4 minutes on the second side, salting again. (Cook longer for medium.) Remove the steaks to a waiting hot plate. Top immediately with the porcini butter. Let rest a few moments, then spoon salsa verde over each, and serve."}], "link": "https://cooking.nytimes.com/recipes/1019231-steak-hache"}