{"@context": "http://schema.org", "@type": "Recipe", "name": "Ramen Carbonara", "description": "If you have bacon, eggs and a pack of ramen noodles in the pantry, this quick dinner (or breakfast or lunch) comes together in a snap. The strategy: Cook the noodles in a Parmesan-rich broth in the same pan you use to cook the bacon. The clever cook who invented this is the novelist Stacey Ballis, a regular contributor to the breakfast blog Extra Crispy. Since ramen noodles are parcooked, they quickly soften and soak up the broth. (Stirring in eggs thickens it into a sauce.) If you use pancetta and good Parmesan, it tastes surprisingly like the Roman original. But it is always delicious and filling, and even more unctuous if you add a runny fried egg on top.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2019/01/23/dining/23pantryrex/23pantryrex-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, noodles", "keywords": "bacon, parmesan, ramen, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1040}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1300, "unsaturatedFatContent": "46 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "95 grams", "fiberContent": "3 grams", "proteinContent": "53 grams", "saturatedFatContent": "43 grams", "sodiumContent": "3164 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["6 to 8 slices bacon or pancetta, cut crosswise into 1/2-inch strips or lardons (4 to 6 ounces)", "2 cups boiling water", "3 tablespoons butter, plus more for frying eggs", "1 cup grated Parmesan or pecorino, or a combination (about 4 ounces)", "2 (3-ounce) packages ramen noodles (noodle blocks only; discard the seasoning packs)", "2 eggs, whisked together until smooth", "Kosher salt and black pepper", "2 whole eggs, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet (preferably nonstick), cook bacon over medium heat until fat is rendered and meat is cooked through. Adjust the heat as needed to prevent scorching. When bacon is cooked, use a slotted spoon to transfer it to a paper-towel-lined plate. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off the extra bacon fat in the pan, leaving behind any browned bits stuck on the bottom. Return pan to medium-high heat and add boiling water, butter and half the cheese. Stir, scraping up bacon bits, and bring to a boil. Add noodle blocks and boil, gently separating the strands as they soften, until noodles are almost cooked through, about 3 minutes. The noodles will absorb some of the liquid, and there will be a thick broth in the pan. Keep the heat high; you want most of the liquid to evaporate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to low. Add whisked eggs, stir into noodles very well, and cook, stirring constantly and scraping the bottom of the pan, about 1 minute. The sauce should remain quite runny; the eggs will continue to cook after you remove them from the heat. Mix in cooked bacon, remaining cheese and plenty of black pepper and immediately remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape mixture into 2 large serving bowls. If not making fried eggs, serve immediately, grinding pepper over the top of each bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If making fried eggs, cover the noodle bowls to keep them warm. Return empty pan to medium heat, add a lump of butter, and swirl until melted and foaming. Crack the eggs into the pan and fry until yolks are just set and edges are brown, about 3 minutes. Transfer to noodle bowls, grind on more pepper, and serve immediately."}]}