{"@context": "http://schema.org", "@type": "Recipe", "name": "Poached Chicken Breasts With Parsley-Onion Salad", "description": "Slowly poaching bone-in chicken breasts in a very low oven makes the meat extremely silky, without turning it tough or drying it out. And having the oven on for an extended period allows you to cook other things in the gentle heat. Here, halved cherry tomatoes turn sweet and jamlike. A pan of chicken skin renders and crisps, becoming golden and potato-chip crunchy before getting tossed with a bright parsley-onion salad. If you’d rather skip the chicken skin, you can. This dish is nearly as good without it, though you may want to add some toasted pine nuts or slivered almonds to the parsley salad for texture.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/01/16/dining/16appe4/16appe4-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weekday, poultry", "keywords": "cherry tomatoes, chicken breast, olives, fall, winter, low-carb, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 114}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 511, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "4 grams", "proteinContent": "40 grams", "saturatedFatContent": "7 grams", "sodiumContent": "927 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 quart chicken stock, plus more as needed (or use salted water)", "2 1/2 pounds bone-in, skin-on chicken breasts (3 to 4 split breasts)", "1 bay leaf", "4 garlic cloves", "2 pints cherry tomatoes, halved", "1/2 cup pitted green olives, sliced", "3 tablespoons extra-virgin olive oil, plus more as needed", "1/2 teaspoon kosher salt, plus more as needed", "1/4 teaspoon black pepper, plus more as needed", "1 rosemary sprig", "1 lemon", "1 cup chopped parsley leaves", "Pinch of red-pepper flakes", "1/2 small red onion, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place racks in the top and bottom thirds of the oven, and heat oven to 275 degrees. In the microwave or in a small pot on the stove, heat chicken stock until it comes to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull skin off chicken, keeping the skin in large pieces, and spread out on a rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken breasts in a small baking dish, cover with hot chicken stock and add bay leaf."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice 3 of the garlic cloves. In a 9-by-13-inch baking dish, toss together garlic slices, tomatoes, olives, 3 tablespoons oil, 1/2 teaspoon salt and pepper to taste. Top with the rosemary sprig."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pan with chicken skin on top rack and chicken and tomatoes on bottom rack. Toss the tomatoes occasionally. Bake everything until chicken skin is golden, the chicken breast is cooked through (a thermometer inserted in the center should read 155 degrees), and tomatoes are starting to shrivel. This will take 60 to 65 minutes for chicken skin and tomatoes; 70 to 80 minutes for the chicken. Transfer chicken skin to a paper towel-lined plate and sprinkle with salt to taste, reserving the rendered chicken fat. Transfer chicken breasts to a cutting board to rest for 5 minutes before slicing meat off the bones. (Save stock for another use; it can be frozen for up to 3 months.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate 1/2 teaspoon zest from the lemon, then cut lemon into wedges. Finely grate remaining garlic clove into a medium bowl. Add a squeeze of lemon juice from one of the wedges, and a pinch of salt. Pour some of the reserved chicken fat over garlic, then toss with parsley, lemon zest, 1/4 teaspoon pepper, and red-pepper flakes. Break up chicken skin into bite-sized pieces and toss into parsley mixture along with the red onion. Serve immediately with the tomato-olive mixture and chicken, drizzling with olive oil, if you like."}]}