{"@context": "http://schema.org", "@type": "Recipe", "name": "Grain Frittata With Chile, Lime and Fresh Herbs", "description": "You may think of frittatas as leftovers’ idea of heaven, but is it yours? For a frittata to look forward to, throw in leftover grains: The result is something like a Spanish tortilla, pleasingly dense, but with more bounce. Add an acid, like lime, and umami, like fish sauce, which melts into an underlying savoriness when warmed. Whatever you do, don’t turn on the oven for this. Instead, stir the frittata on the stove and all but the top will set — nothing a few minutes covered can't fix (no precarious flip!). Finally, put a salad on top. The herby one here adds pep to the substantial frittata, as does a final squeeze of lime.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2018/09/13/dining/as-grain-frittata-horizontal/merlin_143375115_909efa8b-0b46-4d32-a320-4810b06613fe-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, for two, lunch, quick, snack, weekday, weeknight, grains and rice", "keywords": "eggs, farro, fish sauce, herbs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 137}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 254, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "14 grams", "saturatedFatContent": "6 grams", "sodiumContent": "307 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["8 eggs", "1 1/2 teaspoons fish sauce", "1 cup cooked farro (or wheat berries, barley, spelt or rice)", "2 tablespoons unsalted butter", "1 shallot, coarsely chopped (about 1/4 cup)", "1 Thai bird chile or 1/2 small jalapeño, thinly sliced (about 1/2 teaspoon)", "1/2 cup loosely packed dill, cilantro and-or mint leaves", "2 tablespoons thinly sliced scallions", "1 lime, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together the eggs and 1/4 cup water until bubbles form, then whisk in the fish sauce until combined. Using a rubber spatula, mix in the farro."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In an 8- or 9-inch nonstick skillet, melt the butter over medium heat. Add the shallot and chile, and sauté until softened, about 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to medium-low, then pour in the egg-grain mixture. Using the rubber spatula, stir the eggs to mix in the shallot and chile. Let sit undisturbed until the edges of the eggs start to bubble and cook, just a minute. Then run your spatula across the bottom of the pan to pull the eggs from the edges to the center. Create holes in the center of the frittata as well, tilting the pan as needed so wet egg runs into the empty space created by your spatula. Continue pulling and agitating the eggs until the surface is wet but mostly set when you tilt the pan, about 7 to 10 minutes, depending on the size of your pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Smooth the top of the frittata, then cover with a lid or foil and let cook until the eggs are just set, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine the herbs and scallions in a small bowl, then squeeze in enough lime to lightly moisten (about 1 tablespoon or 1/4 lime). Toss with your fingers to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the frittata is cooked, loosen the sides with your rubber spatula and slide onto a serving platter. Top with herbs and scallions and serve immediately with extra lime wedges on the side."}], "link": "https://cooking.nytimes.com/recipes/1019560-grain-frittata-with-chile-lime-and-fresh-herbs"}