{"@context": "http://schema.org", "@type": "Recipe", "name": "Grapefruit Crumb Cake", "description": "Tiny bursts of juicy, tart grapefruit mitigate the richness of this moist crumb cake, topped with almond and brown sugar. You can substitute oranges, tangerines or other tangy fruit for the grapefruit; you’re looking for 1 1/2 cup fruit total. Just avoid anything too sweet (like blueberries, peaches and bing cherries). You need the acidity to balance out the sugary crumb topping. (If substituting other fruit, skip the sprinkling of salt.) If you don’t have a springform pan, use a regular 10-inch cake pan that’s at least 1 1/2-inches deep, then serve cake directly out of the pan instead of unmolding.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/04/25/dining/25appetite2/merlin_136926486_beac2021-c91e-49d4-be33-f7e1a2bd7c85-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, cakes", "keywords": "almond, grapefruit, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 153}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 628, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "78 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "3 grams", "proteinContent": "9 grams", "saturatedFatContent": "17 grams", "sodiumContent": "268 milligrams", "sugarContent": "42 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 cups/155 grams all-purpose flour", "2/3 cup/145 grams light brown sugar", "1 teaspoon ground cinnamon", "3/4 teaspoon ground cardamom or ginger", "1/4 teaspoon fine sea salt", "1/2 cup/55 grams slivered almonds", "1/2 cup/113 grams unsalted butter (1 stick), melted", "2 large red or pink grapefruits", "1/2 cup plus 1 tablespoon sour cream", "3 large eggs", "1 tablespoon vanilla extract", "1 1/2 cups/185 grams all-purpose flour", "3/4 cup/150 grams granulated sugar", "3/4 teaspoon baking soda", "3/4 teaspoon baking powder", "1/2 teaspoon fine sea salt, more for sprinkling", "1/2 cup/113 grams unsalted butter (1 stick), cubed, softened, plus more for greasing the pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and butter a 10-inch springform pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crumb topping: In a medium bowl, whisk together flour, sugar, cinnamon, cardamom and salt. Stir in almonds and melted butter until 1/2-inch crumbs form. Store covered in the refrigerator. (You can make the crumb topping up to 5 days in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare grapefruit: Line a baking sheet or plate with a double layer of paper towels. Finely grate 1 tablespoon of zest from the grapefruit; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut top and bottom off grapefruit with a sharp knife, then slice away peel so no white pith remains. Cut out the grapefruit segments by running your knife on the inside edges of each segment, leaving behind the white membranes. Place sections onto the paper-towel-lined pan or plate to dry out slightly. You should have about 1 1/2 cups grapefruit sections. Pull any large sections apart with your hands so they are all in 1-inch or smaller pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: In a medium bowl, whisk sour cream, eggs, vanilla and reserved grapefruit zest. In the bowl of an electric mixer fitted with the paddle attachment, mix together the flour, sugar, baking soda, baking powder and salt. Beat in the softened butter for 10 seconds, then beat in the sour cream mixture until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared springform pan. Spread grapefruit evenly across the top of the cake. Sprinkle the grapefruit very lightly with sea salt, then top with the crumb mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until springy when touched, and a toothpick inserted in the center comes out with just a few crumbs, 50 to 65 minutes. Transfer to a wire rack and cool completely before releasing the sides of the pan and serving (at least 2 hours)."}], "link": "https://cooking.nytimes.com/recipes/1019278-grapefruit-crumb-cake"}