{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramelized-Scallion Noodles", "description": "The key here is <a href=\"https://cooking.nytimes.com/recipes/1019308-caramelized-scallion-sauce\">the scallion dressing</a> for the noodles and the bit of oyster sauce you drizzle on for depth and umami. Feel free to substitute in any meats, fish, tofu or vegetables you like for the toppings; this is just a template for any number of quick, delicious meals.  ", "author": {"@type": "Person", "name": "Francis lam"}, "image": "https://static01.nyt.com/images/2018/05/13/magazine/13Eat/13Eat-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "2 servings", "recipeCuisine": "chinese", "recipeCategory": "weeknight, noodles", "keywords": "chicken, chinese broccoli, egg, ginger, oyster sauce, soy sauce", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 311}, "recipeIngredient": ["Salt", "6 ounces Chinese broccoli (or other cooking greens), cut into 2-inch pieces", "10 ounces fresh noodles (or 6 ounces dry pasta)", "6 tablespoons caramelized-scallion sauce (see recipe), or to taste", "3 to 4 ounces cooked chicken, ham, tofu, mushrooms or whatever meaty thing you like, sliced, warm", "2 soft-boiled eggs, halved", "Oyster sauce, to taste", "Soy sauce, to taste", "Raw ginger or spicy pickles of your choice, julienne, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of water to boil, and salt it well. Cook the Chinese broccoli until tender, about 4 minutes. Scoop the greens out with a skimmer, and dry well. Keep the water boiling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the noodles according to the package directions. As soon as they’re drained, return them to the empty pot, off heat, and dress them with 6 tablespoons of <a href=\"https://cooking.nytimes.com/recipes/1019308-caramelized-scallion-sauce\">the caramelized-scallion sauce,</a> or to taste. Season with salt, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the noodles into bowls, and top with the Chinese broccoli, the chicken (or whatever protein you choose) and the eggs. Drizzle oyster sauce on the Chinese broccoli, and season the eggs with a few drops of soy sauce. Top with a few pinches of julienne ginger or pickles, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1019309-caramelized-scallion-noodles"}