{"@context": "http://schema.org", "@type": "Recipe", "name": "Plum Cobbler Bars", "description": "What's not to love about a juicy plum filling surrounded by plenty of buttery streusel? In this simple recipe, you have to cook down the plums to be thick enough, but the process is relatively hands off, and the flavor of the slow-simmered fruit is well worth it. You can cut the cobbler easily into bars, as the name implies, but the filling stays a bit soft, so you may prefer to eat them with a fork. They're excellent with ice cream, but many like them best topped with a drizzle of cold heavy cream.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2018/08/08/dining/mcdowell_plumbars_horizontal/merlin_141963915_5e6fee1b-577d-406a-b880-8c10b1704c38-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "dessert, plum", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 432}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 673, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "109 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "15 grams", "sodiumContent": "200 milligrams", "sugarContent": "66 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 1/4 pounds/about 1 kilogram red, black or purple plums, pits removed and roughly chopped (about 6 cups)", "1 1/2 cups/300 grams plus 1/3 cup/65 grams granulated sugar", "1/4 cup/30 grams cornstarch", "2 teaspoons vanilla extract", "3 cups/240 grams old-fashioned oats", "2 1/2 cups/320 grams all-purpose flour", "3/4 cup/90 grams whole-wheat flour", "1 1/2 cups/330 grams light brown sugar", "1 teaspoon baking powder", "1 teaspoon coarse kosher salt", "1 teaspoon ground cinnamon", "1 1/2 cups/340 grams unsalted butter (3 sticks), melted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, combine plums and 1 1/2 cups/300 grams granulated sugar. Heat over medium-low heat, stirring occasionally, until fruit releases juices and becomes very tender, 12 to 15 minutes. Meanwhile, place a small plate in the refrigerator to chill. You’ll use this later to check the doneness of the jam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Purée plum mixture in pot using an immersion blender (be careful of splashing), or remove from pot and purée in a blender or food processor until relatively smooth. Return purée to pot if you removed it, and cook over medium-low heat, stirring occasionally, until mixture thickens and reduces by about half, about 10 minutes. You should end up with about 3 1/2 cups/840 milliliters plum jam. (You can test the doneness by spooning a small amount of the jam onto the chilled plate, returning it to the refrigerator and letting it sit for 2 minutes. It should keep a clean line when you run your finger through it.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk remaining 1/3 cup/65 grams granulated sugar with cornstarch to combine. Whisk sugar-cornstarch mixture into jam and cook, stirring occasionally, until it simmers. Simmer for 1 minute, stirring well to prevent scorching. Stir in vanilla extract, and cool plum mixture to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees, and line a 9-by-13-inch pan with parchment paper with overhang on all sides. In a large bowl, combine oats, flour, whole wheat flour, brown sugar, baking powder, salt and cinnamon. Add melted butter and stir until the mixture forms streusel-like crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press 2/3 of crumb mixture into an even layer at bottom of prepared pan. Spread cooled plum jam in an even layer over crust, then sprinkle remaining crumb mixture evenly over top of jam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until jam bubbles at edges and streusel is lightly browned, 45 to 55 minutes. Cool completely before slicing into 12 pieces."}], "link": "https://cooking.nytimes.com/recipes/1019462-plum-cobbler-bars"}