{"@context": "http://schema.org", "@type": "Recipe", "name": "Taramasalata", "description": "While this is a sturdy and reliable recipe for making the greek cod roe spread called taramasalata from scratch, funnily enough it doesn't call for cod roe. I've come to prefer the commonly available and affordable salmon roe instead. If you are putting together a greek meze plate — with feta and kalamata olives, some marinated octopus and skordalia — save the brine from the feta and use it to season the taramasalata instead of lemon juice and see what you think. It lends a great acidity. Be sure to take the extra step of grating the cooked potato instead of more conveniently throwing it into the food processor and whizzing — to avoid a gluey texture. It'll keep in the fridge for a week and can be used a few ways all summer — add a grated white onion and toss with shaved celery and diced tomatoes as a salad dressing. Or thin with a little of the potato cooking water and some good olive oil and consider it as a sauce for whole grilled fish.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2018/07/15/magazine/15mag-Eat-image3/15mag-Eat-image3-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "A generous 3 cups", "recipeCuisine": "greek", "recipeCategory": "dips and spreads", "keywords": "panko, potato, salmon roe", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 101}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 233, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "3 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "76 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["4 ounces salmon roe", "Juice of 1/2 to 1 lemon", "1 clove garlic peeled", "8 ounces panko soaked in water and squeezed", "Olive oil", "8 ounces peeled, boiled Yukon Gold potato (about 2 medium potatoes)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place roe in the food processor with lemon juice. Microplane the garlic, and tap into the container."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Purée until smooth and orangy-pink and “creamy.”"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wet panko and a drizzle of olive oil, and purée until blended, now creamy and viscous."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a bowl, and with a tiny teardrop side of a box grater, grate in the potato. Whisk all together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season with a little salt and more lemon juice to taste."}]}