{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Chile Cheeseburger Deluxe", "description": "In New Mexico, where many traditional dishes contain roasted green chiles, it’s only natural that hamburgers get the chile treatment, too. If you don’t have access to fresh New Mexican green chiles, try fresh Anaheim chiles. Lacking those, use roasted jalapeños that have been peeled and chopped; thinly sliced raw jalapeños; or pickled jalapeños — a compromise perhaps, but better than no chiles at all. As for cheese, any good melting kind of “queso amarillo” will do, but domestic Monterey Jack or Muenster may be even better.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/07/04/dining/04kitchrex/merlin_139481964_1cfcf988-0437-42b1-abf1-30a8a0102cb6-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, burgers", "keywords": "avocado, green chile, ground beef, monterey jack cheese, serrano chile, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 75}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 708, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "8 grams", "proteinContent": "58 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1060 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 medium white onion, diced small, soaked in ice water 10 minutes and drained", "2 medium firm-ripe tomatoes or 6 plum tomatoes, diced", "Salt, to taste", "1 Serrano chile, finely chopped", "Handful of chopped cilantro", "4 to 6 fresh New Mexico green or Anaheim chiles", "24 ounces ground beef or ground buffalo meat", "Salt and pepper", "8 slices Monterey Jack or Muenster", "4 hamburger buns, lightly toasted", "1 or 2 avocados, in thick slices"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salsa: In a medium bowl, mix together onion, tomato, salt, Serrano chile and cilantro. This salsa tastes best when it's fresh, so don't set aside for too long."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a charcoal barbecue or light the broiler. When hot, roast the chiles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chiles on a rack very close to the glowing coals, or on a baking sheet quite close to broiler flames. Using tongs, turn chiles occasionally until they are completely black and blistered all over. Alternatively, roast over stovetop flames. Set roasted chiles aside for a few minutes until cool enough to handle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut each chile in half lengthwise, then scrape away skins and seeds with a pairing knife. Do not rinse: A few bits of char are fine. Wipe chile “fillets” with a paper towel if you wish. Slice cleaned chiles lengthwise into 1/2-inch strips and set aside. (It’s fine to roast chiles in advance, even a day or two ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide ground meat into 6-ounce balls, and press them into 3/4-inch-thick patties. Season patties on both sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If grilling over coals, cook burgers over brisk heat, about 3 minutes per side for medium-rare. Add sliced cheese when the burger's juices start appearing. Move burgers to a cooler spot on the grill and let cheese continue to melt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If cooking on stovetop, heat a cast-iron pan or ridged grill pan over high heat. When hot, cook burgers over brisk heat, about 3 minutes per side for medium-rare. Add sliced cheese when the burger juices start appearing. Turn off heat and let cheese continue to melt, or place pan under broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a cheeseburger on the bottom half of each bun. Adorn each burger generously with strips of roasted chile. Top the burgers with buns and serve immediately, accompanied by avocado slices and tomato salsa."}]}