{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheesy White Bean-Tomato Bake", "description": "For those of you who love lasagna's edges, where sticky tomato meets crisp cheese, this whole dish is for you — even the middle. A tube of tomato paste here mimics the deep flavors of sun-dried tomato. Frying a few generous squeezes caramelizes the tomato's sugars and saturates the olive oil, making a mixture that's ready to glom onto anything you stir through it. Here, it’s white beans, though you could add in kale, noodles, even roasted vegetables. Then, all that’s left to do is dot it with cheese and bake until it’s as molten or singed as you like. Serve with bread and a bitter-green salad.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2018/10/23/dining/as-white-bean-tomato/as-white-bean-tomato-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, weeknight, beans", "keywords": "main course, side dish, mozzarella, tomato paste, white beans, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 4124}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 489, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "11 grams", "proteinContent": "24 grams", "saturatedFatContent": "7 grams", "sodiumContent": "717 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup extra-virgin olive oil", "3 fat garlic cloves, thinly sliced", "3 tablespoons tomato paste", "2 (15-ounce) cans white beans (such as cannellini or Great Northern) or chickpeas, drained and rinsed", "1/2 cup boiling water", "Kosher salt and black pepper", "1/3 pound mozzarella, coarsely grated (about 1 1/3 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 475 degrees. In a 10-inch ovenproof skillet, heat the olive oil over medium-high heat. Fry the garlic until it's lightly golden, about 1 minute. Stir in the tomato paste (be careful of splattering) and fry for 30 seconds, reducing the heat as needed to prevent the garlic from burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans, water and generous pinches of salt and pepper and stir to combine. Sprinkle the cheese evenly over the top, then bake until the cheese has melted and browned in spots, 5 to 10 minutes. If the top is not as toasted as you’d like, run the skillet under the broiler for a minute or 2. Serve at once."}]}