{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Butter Sticky Buns With Pecans and Currants", "description": "These sticky buns are so pillowy and sweet you may want to fall right into them and take a nap. Caramel-drenched currants and pecans blanket the top. Apple butter gives them a pleasant tang, and maple syrup nudges them toward fall. To bake these in the morning with a bit less hassle, make this recipe through Step 5 the night before, cover the buns with plastic wrap and refrigerate. About 2 hours before you plan to eat, remove them from the fridge. Let them stand in a warm place until doubled, then bake as directed.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2019/10/17/dining/ss-apple-butter-sticky-buns/merlin_144807948_dc448e77-4a6e-4ea3-a38e-f98e4a51984c-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 large buns", "recipeCuisine": "american", "recipeCategory": "breads, pastries", "keywords": "apple butter, dark brown sugar, maple syrup, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 99}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 559, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "72 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "12 grams", "sodiumContent": "265 milligrams", "sugarContent": "36 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["6 tablespoons/85 grams unsalted butter, at room temperature, plus more for greasing bowl", "2/3 cup/160 milliliters whole milk, heated to 110 degrees", "3 tablespoons plus 1 teaspoon granulated sugar", "1 3/4 teaspoons active dry yeast", "2 1/2 cups/320 grams all-purpose flour, plus more as needed", "1/2 teaspoon kosher salt", "1 large egg, lightly beaten", "6 tablespoons/85 grams unsalted butter, cut into pieces, plus more for greasing the pan", "1/4 cup/55 grams packed dark brown sugar", "1/4 cup/60 milliliters maple syrup", "1/2 teaspoon kosher salt", "1 cup/100 grams pecans, coarsely chopped", "1/3 cup/45 grams currants or raisins", "1/4 cup/55 grams packed dark brown sugar", "2 tablespoons ground cinnamon", "1/2 cup/120 milliliters apple butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease a large bowl and set it aside. In a small bowl, mix together the milk, 1 teaspoon of the sugar, and the yeast, and set aside until foamy, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the dough hook, combine flour, salt and remaining 3 tablespoons of sugar. Add the milk mixture and egg, and mix the dough on low until almost combined, about 3 minutes. (You may need to help it along with a spatula at first.) Add the 6 tablespoons of butter all at once, and continue to knead until the dough is smooth and elastic, another 3 to 4 minutes. If the dough is very sticky, add up to 1 tablespoon more flour. It should still be very moist but the bottom of the bowl<strong> </strong>should be mostly clean. Transfer dough to the prepared bowl and cover with plastic wrap. Let it stand until it has doubled in size, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the topping: Butter a 9-by-2-inch round cake pan. In a small saucepan, combine the butter, brown sugar, maple syrup and salt. Cook over medium heat, stirring occasionally, until the mixture reaches a full boil and looks foamy with large bubbles. Pour the caramel into the prepared cake pan. Sprinkle with the pecans and currants."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a small bowl, combine the dark brown sugar and cinnamon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the dough has doubled, tip it out onto a very lightly floured surface. Knead it once or twice to expel the air, and then roll it with a lightly floured rolling pin into a 10-inch square. Spread the apple butter evenly over the surface and sprinkle with the sugar-cinnamon mixture. Tightly roll the dough, and pinch the top seam closed. With a serrated knife or using a piece of floss, cut the roll crosswise into 8 pieces. Set them in the prepared pan, spirals facing upward."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover loosely with plastic wrap, and let the rolls rest until the dough has almost doubled again, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Uncover the rolls and bake until deep golden brown and set, 28 to 32 minutes. Let cool on a rack for 5 minutes and then carefully cut around the edge with a paring knife and invert the rolls onto a serving plate."}], "link": "https://cooking.nytimes.com/recipes/1019673-apple-butter-sticky-buns-with-pecans-and-currants"}