{"@context": "http://schema.org", "@type": "Recipe", "name": "Italian Subs With Sausage and Peppers", "description": "<i>This is a no-recipe recipe, a recipe without an ingredients list or steps. It invites you to improvise in the kitchen.</i>\n\nFor these subs, you'll start with the onions, slicing two big sweet ones and setting them in a hot pan with a couple of gurgles of olive oil. Season with salt, black pepper and a shake of red-pepper flakes, then cook over medium heat, stirring and tossing occasionally so that they go golden and soft. This’ll take a while. Add a couple of sliced bell peppers to the pan, and continue cooking, still stirring and tossing, until they begin to wilt. Set the vegetables aside. About halfway through, set some sweet Italian sausages in another hot, oil-slicked pan, and cook them through until crisp and brown on the exterior, turning often.\nSplit your sub rolls (I like the sesame-seeded variety here) and scrape out a little of the interior from each. Load one side of each roll with some of the onions and peppers, the other with a sausage. Top with mozzarella, put the open sandwiches on a sheet pan and slide them all into a hot oven for five minutes or so, until the cheese is melted and the bread is lightly toasted. Fold together and serve.\n\n<i>Sam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. <a href=\"https://www.nytimes.com/newsletters/cooking\">Sign up to receive it.</a> You can find more no-recipe recipes <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/14326423-no-recipe-recipes\">here</a>.</i>", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/02/17/dining/17NORECIPE-ITALIAN-SUBS/merlin_148099983_04698c2d-7d15-4c22-a47d-33c134d7ddb9-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "american", "recipeCategory": "dinner, weekday, sausages", "keywords": "bell pepper, italian sausage, sub rolls, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 140}, "recipeIngredient": [], "recipeInstructions": null, "link": "https://cooking.nytimes.com/recipes/1019994-italian-subs-with-sausage-and-peppers"}