{"@context": "http://schema.org", "@type": "Recipe", "name": "Amalia’s Goat-Cheese Soufflazy", "description": "This recipe offers a clever shortcut for a notoriously finicky dish, yielding an aromatic, billowy cloud of eggs, cheese and herbs. There are two tricks: First, separate and heat both the egg whites and yolks over a water bath before reuniting them. And second, don’t overwhip the whites. Take them to a medium stiff peak — when upturned on a whisk, they should flop over a tiny bit. Serve soufflazy for breakfast, brunch or as a first course at a dinner party, with buttered toast and a salad of bitter greens or arugula.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2018/02/25/magazine/25mag-eat1/25mag-25eat-t_CA0-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "egg, goat cheese, gruyère", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 292}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 410, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "0 grams", "proteinContent": "30 grams", "saturatedFatContent": "17 grams", "sodiumContent": "573 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Butter for greasing pan", "8 large eggs, separated", "6 ounces goat cheese, crumbled (about a heaping cup)", "1 teaspoon finely chopped fresh thyme", "Salt", "Freshly ground black pepper", "3 ounces Gruyère, finely grated on a box grater (about 1 heaping cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust an oven rack to the center position. Heat oven to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease the bottom and sides of a 9-by-12-inch rimmed baking sheet or 10-inch springform pan. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a water bath: Fill a medium pot with 2 inches of water, and bring to a simmer over medium heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large metal bowl, whisk together the egg yolks, goat cheese, thyme, a pinch of salt and black pepper until the cheese breaks down. Reduce the heat so that the water stops simmering but continues to steam, and set the bowl over the pot. Whisk continuously until the mixture lightens in color and begins to thicken slightly. Use a rubber spatula to scrape the bottom and sides of the bowl every minute or so. The bowl should never get so hot that the eggs cook and begin to stick to the sides. When the mixture is thick, foamy and very warm to the touch (about 6 minutes), remove bowl from heat, and stir in Gruyère. Taste, adjust seasoning with salt as needed and set aside in a warm spot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine egg whites and a pinch of salt in another large metal bowl, and set over water bath. Using a clean whisk, whip egg whites over the water until they are very warm to the touch. Alternatively, use an electric hand mixer fitted with whisk attachment set to slow speed to beat whites until they are very warm to the touch. Remove bowl from heat, and continue whipping to silky, medium-stiff peaks, about 4 minutes total by hand or 3 minutes total with electric mixer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a rubber spatula to gently add in half the egg whites to the yolk mixture, and fold until combined. Fold in remaining whites, scraping through to the bottom of the bowl to ensure thorough mixing. Pour mixture into prepared baking sheet (or cake pan), and slide carefully onto center oven rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 11 to 13 minutes (18 to 21 minutes if using cake pan), refraining from opening the oven door, until the soufflé puffs up, turns golden brown and an inserted wooden skewer comes out mostly (but not entirely) clean. If you jiggle the pan, there should be the slightest hint of wiggle left to the soufflé."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a serving spoon to scoop onto plates. Serve immediately with buttered toast and green salad, if desired."}]}