{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Ham, Southern Maryland Style", "description": "There are as many recipes for southern Maryland stuffed ham as there are families in St. Mary’s County. It shows up on Christmas and Easter tables, and at almost every community fund-raising supper. This recipe, compiled from cooks whose families have been making it for generations, uses raw stuffing and is spiced with plenty of black and red pepper. Because the ham boils for so long, the spiciness will mellow. The most challenging part is the finding the ham itself. Corned hams — which are simply fresh hams that have been cured in salt or brine — aren’t usually in the grocery meat case, and butchers will often require advance orders. Corning your own fresh ham is not hard, but it can take several days and turns this into even more of a project.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2018/03/21/dining/21Hamrex/merlin_135440628_f69500db-be20-48fd-9565-3ce6201fd209-articleLarge.jpg", "totalTime": "PT5H30M", "recipeYield": "8 to 12 servings, plus leftovers", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, meat, project", "keywords": "cabbage, ham, kale, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 893, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "6 grams", "proteinContent": "79 grams", "saturatedFatContent": "16 grams", "sodiumContent": "4752 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1/2 of a fresh or corned ham (8 to 12 pounds)", "1 cup kosher salt plus more, if corning", "3 pounds green cabbage", "1 pound curly kale, or a mixture of other greens like mustard greens or watercress", "2 medium yellow onions (about 1 pound)", "1 bunch scallions (about 7)", "1 1/2 tablespoons coarsely ground black pepper", "1 1/2 tablespoons red-pepper flakes", "1 tablespoon mustard seed", "1 tablespoon celery seed", "1 teaspoon cayenne", "1 tablespoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If corning the ham: Cut slits about 3 inches deep in a few places around the bone. Push salt into the incisions and, with a light hand, rub salt all over the surface of the ham. Reserve any remaining salt to rub into the ham as it corns, adding more if needed later in the process. Place the ham in a nonreactive pan, cover tightly with plastic wrap and then aluminum foil and place it in refrigerator for a week. Unwrap and turn it every couple of days, sprinkling with more reserved salt and pouring off any juice that collects each time. Rewrap. The day before you are going to stuff the ham, rinse off the salt and soak the ham overnight in cold water in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the stuffing: The goal is to chop all the vegetables so the pieces are small and relatively uniform in size. Begin by chopping the cabbage. A food processor with a shredding blade is helpful. Place the cabbage in a large pan or bowl. Remove large stems from the kale and other greens, if you are using them, and chop. (Tip: Freeze cleaned, whole kale leaves overnight in plastic bags, then break up the frozen leaves while still in the bag and add to the stuffing mixture.) Chop the yellow onions and scallions, and add them to the cabbage and kale."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the vegetables well and add the spices. Mix again. (Your hands will work best for this, but wear gloves if your skin is sensitive to pepper.) Taste the stuffing and adjust, adding more cayenne or red-pepper flakes for a more intense spiciness. Keep in mind that the long boiling time will soften the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stuff the ham: Remove the bone, or have the butcher remove it for you. The ham should be almost butterflied. Add the bone to a pot large enough to hold the ham, fill with enough water to cover it and begin to heat the water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the water heats, set the ham on a sheet pan and cut slits about 3 inches long and 2 inches deep in a few places to make pockets, being careful not to slice through the meat completely. The number of slits will depend on the size of the ham. The goal is an even distribution of stuffing. Pack the slits tightly with stuffing, and add stuffing to the center of the ham where the bone was. Close the ham and secure it with kitchen string."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a large square of cheesecloth at least 3 layers thick. Spoon a layer of stuffing over the cheesecloth and set the ham on it. Pack more stuffing on the top and sides of the ham. Gather the corners of the cheesecloth to the top and twist tightly to form a compact package. Tie the top tightly with string."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the ham into boiling water, reduce heat to a simmer and add any juice that has collected from the stuffing. Skim any foam that rises. Cook, covered, for about 15 minutes per pound, or until the internal temperature reaches 165 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat and let the ham cool slightly in the water, about an hour. (Old-timers simply put the whole pot on the porch overnight if the weather was cool, or left it on the stove until completely cooled.) Drain the ham in a colander and refrigerate for at least 6 hours or overnight. Remove the cheesecloth and string, and reserve any stuffing around the ham."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, slice the ham across the grain, so each slice contains stuffing and meat. Pile additional stuffing around the slices. The ham can be reheated, but more often it is served cold."}], "link": "https://cooking.nytimes.com/recipes/1019226-stuffed-ham-southern-maryland-style"}