{"@context": "http://schema.org", "@type": "Recipe", "name": "Striped Berry Pie", "description": "You can use three jammy berry fillings — strawberry, raspberry and blackberry — to create a beautiful, naturally colored ombré effect in a pie. Pre-cooking the fillings helps ensure that they’re thick enough to easily slice once they’re baked. You need to keep a close eye on the fruit here, so don’t be tempted to make more than one filling at a time. Berries can vary in juiciness, so it’s very important to make sure you have the right amount of each filling before assembling the pie (see the Note at the bottom of the recipe for how to adjust your filling if it’s too thin or too thick). The pie is best the day it’s baked, but the fillings can be made up to 2 days ahead; stir well before using.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2018/11/11/dining/11Striped-berry-pie/11Striped-berry-pie-mediumThreeByTwo440.jpg", "totalTime": "PT1H45M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "blackberries, raspberries, strawberries, dessert, fall, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 106}, "recipeIngredient": ["<a href=\"https://cooking.nytimes.com/recipes/1019713-perfect-pie-crust\">Perfect Pie Crust,</a> prepared for a fruit pie and chilled", "Egg wash (1 large egg mixed with 1 tablespoon water)", "14 ounces/400 grams blackberries (about 3 cups)", "5 tablespoons/65 grams granulated sugar", "3 tablespoons cornstarch", "1 teaspoon vanilla extract", "3 tablespoons heavy cream", "14 ounces/400 grams raspberries (about 3 cups)", "5 tablespoons/65 grams granulated sugar", "3 tablespoons cornstarch", "1 teaspoon vanilla extract", "3 tablespoons heavy cream", "14 ounces/400 grams stemmed and quartered strawberries (about 3 cups)", "5 tablespoons/65 grams granulated sugar", "2 1/2 tablespoons cornstarch", "1 teaspoon vanilla extract", "4 tablespoons heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface and using a lightly floured rolling pin, roll out a disk of dough into a circle about ¼-inch thick. Starting at one end, gently roll up the dough onto the rolling pin. Unfurl the dough over a 9-inch pie plate, preferably ceramic, and press it in lightly, making sure it’s lining the plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim so that there’s about ½ inch of excess dough hanging over the edge of the pie plate. (If the dough feels warm, refrigerate it for 15 minutes.) Tuck the excess dough under itself so it is flush with the edge of the pie plate; leave the pie like this for a straight-edge finish, or crimp as desired. Dock the base and sides all over with a fork and refrigerate at least 30 minutes, and up to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a rack on the bottom shelf of the oven, and place a baking stone, if you have one, on the rack. Heat the oven to 425 degrees. Use a small brush to evenly paint egg wash on the edge of the crust. Cut a square of parchment paper and use it to line the crust. Fill with pie weights (or dried beans) up to the top edge. Place the plate on a baking sheet lined with parchment or foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the baking sheet to the oven, placing it directly on the baking stone if using. Bake crust until the outer edge is just starting to turn golden brown, 12 to 15 minutes. Remove the parchment and pie weights, and continue to bake until the base appears set, 2 to 4 minutes more. If the dough puffs up anywhere, you can puncture it with a fork. Cool the crust completely. Reduce the oven temperature to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the blackberry filling: Mix the blackberries and 2 tablespoons sugar in a medium pot over medium heat. Cook, stirring occasionally, until the berries begin to break down, 8 to 10 minutes. Mash with a potato masher or large fork until the mixture resembles a coarse purée. You should have 1 ¾ cup (if you have more or less, see Note below). In a small bowl, whisk the remaining sugar and cornstarch to combine. Add to the pot and cook, stirring constantly, until the mixture thickens, 1 to 2 minutes. (The filling should be thick, like jam from a jar at room temperature; it will thicken slightly more when cooled, as will the two other berry fillings below.) Cool completely, then whisk in vanilla and cream. Set filling aside and rinse out the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the raspberry filling: Mix the raspberries and 2 tablespoons sugar in a medium pot over medium heat. Cook, stirring occasionally, until the berries begin to soften and break down, about 3 to 5 minutes. Mash until the mixture resembles a coarse purée. You should have 2 cups of purée (if you have more or less, see Note). In a small bowl, whisk the remaining sugar and cornstarch to combine. Add to the pot and cook, stirring constantly, until the mixture thickens, 1 to 2 minutes. Cool completely, then whisk in vanilla and cream. Set filling aside and rinse out the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the strawberry filling: Mix the berries and 2 tablespoons sugar in a medium pot over medium heat. Cook, stirring occasionally, until the berries begin to soften and break down, 4 to 5 minutes. Mash until the mixture resembles a very coarse purée. You should have 1 ¾ cups of purée (if you have more or less, see Note). In a small bowl, whisk the remaining sugar and cornstarch to combine. Add to the pot and cook, stirring constantly, until the mixture thickens, 1 to 2 minutes. Cool completely, then whisk in vanilla and cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one filling at a time, spoon each filling into the crust in thick stripes: Put the blackberry and strawberry fillings (the two sides) in first, using a little more than half of each. Then spoon the full amount of the raspberry filling into the center. After the raspberry is in, spoon the remaining blackberry and strawberry fillings on top on their respective sides. Take care to fill just to the inner edge of the crust (you may have leftover filling). The fillings should be thick enough that they stay where you put them, but a small amount of spreading is normal. Use the tip of a knife to swirl the fillings wherever they meet, then use a small offset spatula or a silicone spatula to spread them evenly flat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pie plate on a parchment- or foil-lined baking sheet and transfer it to the 400-degree oven, placing directly on top of the baking stone if using. Bake until the crust is golden brown and the filling appears evenly set on the surface, 35 to 40 minutes; start checking the pie after 30 minutes of baking to be sure it doesn’t bubble over. When ready, the surface will form a skin and look set, but it will move slightly when the pie is wiggled. If the crust or the surface of the berries begin to look too dark, tent the pie with foil in the last 5 to 10 minutes of baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let pie cool completely on a rack, at least 5 hours, before serving. The pie is best the day it is baked; store leftovers at room temperature, wrapped tightly in plastic wrap."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Striped Berry Pie", "description": "Striped Berry Pie", "thumbnailUrl": "https://static01.nyt.com/images/2018/11/11/dining/11Striped-berry-pie/11Striped-berry-pie-mediumThreeByTwo440.jpg", "uploadDate": "2018-11-07T19:06:10.000Z", "duration": "PT1M33S"}, "link": "https://cooking.nytimes.com/recipes/1019715-striped-berry-pie"}