{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato Bebinca", "description": "Adapted from Nik Sharma’s first cookbook, “Season,” this lightly sweet pudding cake is an ideal fall dessert — a far less stressful alternative to a more labored pie. Here Mr. Sharma riffs on a traditional dessert from the Indian state of Goa, using a base of coconut milk, eggs and sweet potatoes that are roasted and then puréed, perfumed with nutmeg. Though he sweetens the bebinca with jaggery or muscovado sugar, alternatives like panela or dark brown sugar work too; the addition of maple syrup is a distinctly American touch. (Mr. Sharma likes to make this for Thanksgiving.) Be sure to leave time for the bebinca to cool and set — at least 6 hours in the refrigerator, but preferably overnight.", "author": {"@type": "Person", "name": "Mayukh Sen"}, "image": "https://static01.nyt.com/images/2018/09/26/dining/sharma-bebinca-horizontal/sharma-bebinca-horizontal-articleLarge.jpg", "totalTime": "PT8H30M", "recipeYield": "8 servings", "recipeCuisine": "indian", "recipeCategory": "cakes, custards and puddings", "keywords": "coconut milk, dark brown sugar, jaggery, maple syrup, muscovado, sweet potato, turmeric, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 295}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 450, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "16 grams", "sodiumContent": "170 milligrams", "sugarContent": "33 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 to 3 medium to large sweet potatoes (1 1/4 pounds total)", "6 tablespoons/85 grams unsalted butter, melted, plus more for the pan", "6 large eggs", "1 cup/200 grams grated jaggery, muscovado, panela or dark brown sugar", "1/4 cup/60 milliliters maple syrup", "1 teaspoon freshly grated nutmeg", "1/2 teaspoon ground turmeric", "1/4 teaspoon fine sea salt", "1 (13.5-ounce/400-milliliter) can full-fat coconut milk", "1 cup/130 grams all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Rinse the sweet potatoes to remove any dirt, pat them dry with paper towels and poke several holes in them with a fork. Put the potatoes in a baking dish or on baking sheet lined with aluminum foil. Roast until completely tender, 35 to 45 minutes. Cool completely before handling. Peel the sweet potatoes, discard the skins, and purée the flesh in a food processor. Measure out 1 2/3 cups/400 grams and set aside, saving the rest for another purpose. (The sweet potatoes may be roasted 1 day ahead and stored in an airtight container in the refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the oven temperature to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the bottom of a 9-inch round baking pan with 2-inch sides with parchment paper and grease lightly with butter. Put the pan on a baking sheet. In a large bowl, whisk together the cooled sweet potato purée, melted butter, eggs, sugar, maple syrup, nutmeg, turmeric and salt until smooth. Add the coconut milk and flour and whisk until the mixture is smooth, with no visible streaks of flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan and put the pan, still on the baking sheet, in the oven. Bake for 55 to 60 minutes, rotating the baking sheet halfway through. The pudding should be firm to the touch in the center and light golden brown around the edges. Remove from the oven and cool completely in the pan on a wire rack. Wrap the pan with plastic wrap and refrigerate to set for at least 6 hours, preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the bebinca has set, run a sharp knife around the sides of the pan, flip the pan onto a baking sheet lined with parchment paper, and tap gently to release. Peel the parchment off the top. Invert onto a serving dish, and peel off the second sheet of parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, use a sharp serrated knife to cut the chilled bebinca into wedges. Store the leftover bebinca, wrapped in plastic wrap, in an airtight container in the refrigerator for up to 1 week."}]}