{"@context": "http://schema.org", "@type": "Recipe", "name": "Avocado Toast", "description": "It may seem silly to give a recipe for avocado toast, but there is an art to it, as with most things that are both simple and perfect. Here, you want to make sure of a few things: that the bread you use is sturdy and has some taste; that there's enough salt and citrus to bring out the avocado's flavor; and that you use a good olive oil to bring it all together. These garnishes, from the Australian café Two Hands in Manhattan, are tasty but unnecessary.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2018/07/25/dining/25ausrex2/merlin_141110271_8685e17e-0470-4bab-8fc8-ff7262cc98ec-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "2 servings", "recipeCuisine": "australian", "recipeCategory": "breakfast, brunch, easy, for one, for two, lunch, quick, snack, sandwiches", "keywords": "avocado, sourdough bread, dairy-free, healthy, kosher, low cholesterol, low-sodium, nut-free, raw, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 473}, "recipeIngredient": ["2 large slices crusty, chewy sourdough bread, preferably whole wheat", "1 ripe avocado, halved, pit removed", "Extra-virgin olive oil", "Flaky salt and coarsely ground black pepper", "Half a lemon or lime", "Poached or fried eggs", "Thinly sliced pickled or fresh red chiles, such as Fresno or cherry", "Thinly sliced pickled red onions", "Pepitas (pumpkin seeds) or sesame seeds, or both", "Herbs, such as basil, cilantro, mint or baby arugula"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the bread to your liking. Meanwhile, use a wide spoon to remove the avocado halves from the peel, keeping them in large pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle the hot toast lightly with olive oil and sprinkle with salt. Let cool slightly, then place one avocado half on each slice of toast. Use the back of a fork to roughly mash the avocado into the bread, keeping it as chunky as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with a little more salt, and pepper if desired. Squeeze the citrus over the top and add any garnishes. Cut each piece of toast in half if they're large and serve immediately."}]}