{"@context": "http://schema.org", "@type": "Recipe", "name": "Bittersweet Chocolate-Almond Cake With Amaretti Cookie Crumbs", "description": "Here’s a cake that comes together with the push of a button — butter, sugar, eggs and cocoa as well as dark chocolate, almonds and amaretti cookies are blended in a food processor. Although it looks like a brownie, the cake tilts toward a nut torte. It’s low and sleek, simple, sophisticated and packed with flavor. The original recipe appeared in my debut cookbook, “Sweet Times,” in 1991, and when I made it for Julia Child that year, I got her thumbs up. Over time, I haven’t fiddled much with the recipe’s basics, but these days I finish the cake with a glaze and a sprinkling of crushed amaretti for style and crunch. I prefer amaretti di Saronno by Lazzaroni for the cake, but other amaretti work well too. And don’t be distressed if the cake develops a mound during baking (it happens now and then). Press it down with a spatula — it doesn’t diminish this cake’s deliciousness.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2018/10/14/magazine/14mag-OnDessert-image1/14mag-OnDessert-image1-articleLarge.jpg", "totalTime": "PT1H55M", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "almonds, amaretti cookies, bittersweet chocolate, cocoa powder, sea salt, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 361}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 406, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "14 grams", "sodiumContent": "155 milligrams", "sugarContent": "25 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 stick (113 grams) unsalted butter, cut into chunks, at room temperature, plus more for greasing the pan", "2 tablespoons unsweetened cocoa powder, plus more for dusting the pan", "3/4 cup (75 grams) sliced or slivered almonds", "6 double amaretti cookies (about 72 grams), such as Lazzaroni brand", "1/3 cup (67 grams) sugar", "1/4 teaspoon fine sea salt", "3 large eggs, at room temperature", "4 ounces (113 grams) bittersweet chocolate, melted (it can still be warm)", "2 ounces (57 grams) bittersweet chocolate, finely chopped", "1/4 cup (60 ml) heavy cream", "1 tablespoon sugar", "1 tablespoon water", "2 double amaretti cookies (about 24 grams), crushed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven, and preheat to 350. Butter an 8-inch cake pan, line the bottom with parchment paper, butter the paper and dust the interior with cocoa powder; tap out the excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cake: Put the almonds, amaretti, sugar, cocoa and salt into a food processor, and process in short spurts, until the almonds and cookies are finely ground. Add the butter and eggs, and process, scraping the bowl occasionally, for about 2 minutes, until the mixture is homogeneous. Add the melted chocolate a little at a time, pulsing after each addition. Scrape the bowl, and then pour the batter into the pan. Standing back (to avoid being showered by cocoa powder), rap the pan against the counter a few times, to break the largest bubbles in the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cake for 25 to 30 minutes, or until a tester comes out streaky; the top of the cake will look dry and perhaps cracked. If the top has erupted in a couple of places — it happens — use a spatula to press down the bumps as best as you can. Let the cake rest on a rack for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a blunt knife between the cake and the sides of the pan. Invert the cake onto the rack, peel off the paper and turn right side up; cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to glaze the cake, place the rack over a baking sheet lined with parchment or foil — the drip-catcher."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the glaze: Put the chocolate in a heatproof measuring cup with a spout or in a bowl. Bring the cream, sugar and water to a boil in a saucepan (or do this in the microwave). Pour the cream over the chocolate, and stir gently until you have a smooth glaze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the glaze over the cake, and use an offset spatula or knife to spread it over the top. Sprinkle over the crushed amaretti. Refrigerate for at least 30 minutes to set the glaze (which will always be soft). Serve the cake slightly chilled or at room temperature (my preference)."}]}