{"@context": "http://schema.org", "@type": "Recipe", "name": "Everything-Spice Phyllo Crackers", "description": "Here’s a cracker that bakes up flaky and buttery, no matter how much of a baker you may or may not be. There's no need for a whisk, mixing bowl or even flour: Just layer phyllo sheets with butter, top with everything-bagel seasoning (or other spices, or grated cheese), and slice them into squares or triangles of any size. Each cracker promises a joyful, shattering mess; a companion to wine, beer or something stronger; and the pleasure of knowing it was so easy to make. Each batch yields a bounty of crackers, but this recipe is also easy to scale.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2018/12/18/dining/as-everything-phyllo-crackers/as-everything-phyllo-crackers-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "About 40 to 60 crackers", "recipeCuisine": "", "recipeCategory": "easy, quick, finger foods", "keywords": "appetizer, phyllo, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "recipeIngredient": ["4 sheets frozen phyllo pastry, thawed overnight and kept under a damp towel", "1/4 cup/55 grams unsalted butter (1/2 stick), melted", "1/4 cup/40 grams everything-bagel seasoning (or make your own using 1 tablespoon dried minced onion, 1 tablespoon white sesame seeds, 2 tablespoons poppy seeds, 1 teaspoon fennel or caraway seeds and 1/2 teaspoon garlic powder)", "1 teaspoon freshly ground black pepper", "1 teaspoon flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Place a piece of parchment paper the size of your baking sheet on a work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a sheet of phyllo on the parchment paper and brush the pastry lightly with butter. Top with another sheet of phyllo, and lightly press down to eliminate any air bubbles trapped between the two sheets. Repeat with the next 2 layers of phyllo, then brush the top with the remaining butter. Trim the edges of phyllo, if necessary, to leave a 1/2-inch parchment border, and slide the parchment and pastry onto the baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the everything-bagel seasoning, pepper and flaky salt. Sprinkle evenly over the top of the phyllo, and press gently to adhere. Using your sharpest knife, cut the phyllo into 1 1/2-inch squares (or feel free to cut them into strips or triangles of varying sizes)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden at the edges, 8 to 10 minutes. Let cool on the baking sheet and serve at room temperature."}]}