{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Swordfish Kebabs With Golden Raisin Chimichurri", "description": "Swordfish is the perfect seafood for grilling — the flesh is sturdy and firm, with a mild flavor that readily absorbs the aroma of smoke without losing its own. Most people grill swordfish as steaks; the Miami chef Michael Schwartz cuts it into chunks for kebabs, a format that allows him to intersperse the chunks of fish with lemon slices and bay leaves, and grills them over wood (though you could use charcoal or, if necessary, grill over gas). The tips of the bay leaves char, imparting a fragrant herbal smoke. By way of a sauce, Mr. Schwartz serves a classic Argentine chimichurri with a not-so-classic twist — the addition of yellow raisins, which counter the traditional garlic and vinegar with an unexpected note of sweetness. If swordfish is unavailable, use another sturdy fish, like tuna or mako shark.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2018/07/04/dining/04woodrex1/merlin_139044030_30031ba4-0ee5-4767-b821-c6cb1b2fb6f6-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, seafood, skewers and kebabs", "keywords": "main course, oregano, parsley, raisins, swordfish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 28}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 905, "unsaturatedFatContent": "54 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "69 grams", "fiberContent": "7 grams", "proteinContent": "47 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1012 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds swordfish steaks (at least 1 1/2 inches thick), skinned and cut into 1 1/2-inch chunks", "12 bay leaves (preferably fresh)", "2 lemons, halved lengthwise and then cut crosswise into 1/4-inch slices, seeds removed, plus 1 whole lemon for squeezing", "Coarse sea salt and ground black pepper", "2 tablespoons chopped fresh oregano", "Extra-virgin olive oil", "1/2 cup golden raisins", "1 cup boiling water", "3/4 cup plus 2 tablespoons extra-virgin olive oil", "1 bunch flat-leaf parsley, washed, shaken dry and stemmed", "1/4 cup stemmed fresh oregano", "1 tablespoon fresh thyme leaves", "2 cloves garlic, minced", "3 tablespoons sherry vinegar, or to taste", "2 tablespoons fresh lemon juice", "1/2 teaspoon red-pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the kebabs: Thread the swordfish, bay leaves and lemon slices alternately onto flat bamboo or metal skewers. Arrange in a nonreactive baking dish. Season the kebabs on all sides with salt and pepper. Squeeze the juice from the remaining lemon over them. Sprinkle with oregano and drizzle with olive oil. Turn the kebabs a few times to coat with the flavorings and marinate in the refrigerator for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the chimichurri: Place the raisins in a heatproof mixing bowl. Pour boiling water over them and stir in 2 tablespoons olive oil. Let raisins soak for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely chop parsley, oregano, thyme and garlic in a food processor. Gradually work in 3/4 cup olive oil, sherry vinegar, lemon juice, red-pepper flakes, salt and pepper to taste; the chimichurri should be highly seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain raisins well and add them to the chimichurri. Pulse the processor a few times to mix, but leave the raisins mostly whole. Transfer 3/4 cup of the chimichurri to a small bowl for basting, and transfer the rest to a serving bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, build a wood fire in your grill with a hot zone for searing and a medium zone for cooking. (You can do the same with charcoal. If you’re using a gas grill, place a few hardwood chunks between the Flavorizer bars or over the burners. Heat one burner on high heat and additional burners on medium heat, adjusting the heat as necessary.) Brush and oil the grill grate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the kebabs over the hot fire and grill until the fish is browned and sizzling and cooked through, 2 to 3 minutes per side, 8 to 12 minutes in all. Move kebabs to the medium zone if they start to burn. Baste with a little of the reserved chimichurri as the kebabs cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the kebabs with the remaining chimichurri on the side for spooning over the fish."}], "link": "https://cooking.nytimes.com/recipes/1019320-grilled-swordfish-kebabs-with-golden-raisin-chimichurri"}