{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Tostadas With Black Beans and Peppers", "description": "In this vegetarian sheet-pan meal, crisp tortillas are topped with chile-laced black beans, sweet roasted peppers, avocado and plenty of crumbled queso fresco or grated Cheddar. A cumin salt, flecked with lime zest and sprinkled on right at the end, adds both brightness and a musky spice flavor. You will need 3 sheet pans for this. If you have only 2, crisp the tortillas in a skillet on the stovetop instead of in the oven.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/09/26/dining/26apperex1/26apperex1-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, tacos, vegetables", "keywords": "bell pepper, black beans, chipotles in adobo, tortillas, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 507}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 406, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "16 grams", "proteinContent": "12 grams", "saturatedFatContent": "3 grams", "sodiumContent": "787 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["3 medium bell peppers, thinly sliced (preferably at least one red and one yellow)", "1 medium yellow onion, sliced", "1/2 cup extra-virgin olive oil, plus more as needed", "2 teaspoons kosher salt, plus more as needed", "1 tablespoon chopped fresh sage", "4 thyme sprigs", "2 (14- to 16-ounce) cans black beans, drained", "1 cup canned diced tomatoes with their liquid", "1 chipotle chile in adobo, chopped, plus 1 teaspoon adobo sauce", "2 large garlic cloves, finely grated or minced", "1 teaspoon dried oregano", "3/4 teaspoon ground cumin", "8 (6-inch) corn tortillas", "1 lime", "Sliced avocado, for serving", "Crumbled queso fresco or grated white Cheddar, for serving (optional)", "Chopped cilantro leaves, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees and arrange racks in the top and bottom thirds of oven. On a rimmed sheet pan, toss together peppers, onion, 1/4 cup oil, 1/2 teaspoon salt and sage, then spread vegetables out in an even layer. Top with thyme sprigs, and roast on the top rack until tender and lightly browned, 35 to 45 minutes, tossing every 15 minutes or so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a separate rimmed sheet pan, toss together beans, tomatoes, 1/4 cup oil, chipotle chile and sauce, garlic, oregano, 1/2 teaspoon cumin and salt to taste. Roast on the bottom rack, stirring every 10 minutes, until juices have thickened, 25 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush tortillas on both sides with oil, then arrange in an even layer on a third rimmed baking sheet (it’s O.K. if the tortillas overlap slightly). Bake until crisp, about 5 to 7 minutes. Immediately sprinkle with salt while they are still hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cumin salt, grate the zest from the lime. In a small bowl, stir together lime zest, 1 1/2 teaspoons salt, and remaining 1/4 teaspoon cumin. Cut naked lime into wedges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, top tortillas with beans, peppers, avocado, queso fresco (if desired), cilantro and a squeeze of lime from the wedges. Let people sprinkle on lime-cumin salt to taste."}], "link": "https://cooking.nytimes.com/recipes/1019573-sheet-pan-tostadas-with-black-beans-and-peppers"}