{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Lamb Shanks With Fresh Herbs ", "description": "Bone-in lamb shanks are perfect for braising. The marrow in the bones releases into the sauce, deepening its flavor, while the tough meat softens into perfect tenderness during the long, slow cooking. In this recipe (very loosely based on a Georgian stew called chakapuli) the shanks are cooked with a prodigious amount of fresh herbs, adding fragrance and body. You can braise this several days in advance, then reheat it on the stove. The flavors get even better after having a chance to meld. Just don’t add the final herbal garnish until right before serving. A little bread, polenta or rice would be just the thing to soak up the heady sauce, though a spoon works, too.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/12/20/dining/20appetite1/merlin_131160217_b567e972-0925-4209-b936-f2ec4221a166-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "6 to 8 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, soups and stews", "keywords": "chives, lamb shanks, mint, mustard greens, tarragon, white wine, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 172}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 852, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "57 grams", "fiberContent": "4 grams", "proteinContent": "64 grams", "saturatedFatContent": "24 grams", "sodiumContent": "1184 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon plus 1 teaspoon kosher salt", "2 teaspoons sweet paprika", "1 teaspoon freshly ground black pepper", "5 pounds lamb shanks (5 to 6 shanks)", "Extra-virgin olive oil, as needed", "1 large sweet onion (white or red), peeled, halved and thinly sliced", "8 garlic cloves, roughly chopped", "2 teaspoons coriander seeds, coarsely cracked", "1/4 teaspoon cayenne ", "1/4 teaspoon ground allspice", "1 1/2 cups dry white wine", "2 bunches scallions, finely chopped (white and green parts)", "2 cups chopped spicy greens such as mustard greens, mizuna, arugula, or radish tops", "1 1/2 cups chopped cilantro (tender stems and leaves only)", "1 cup chopped parsley (tender stems and leaves only)", "1 cup chopped mint or dill or a combination (tender stems and leaves only)", "1/2 cup chopped tarragon (tender stems and leaves only)", "1/2 cup chopped chives", "About 1 cup chicken or lamb stock, or water", "2 to 3 tablespoons dried currants (optional)", "3 tablespoons unsalted butter", "Fresh lemon juice, as needed (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl (or covered container) large enough to hold the lamb, mix together salt, paprika and pepper. Add shanks and rub all over with spice mix. Cover and marinate for at least 4 hours (or up to 24 hours) in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. In a large skillet over medium heat, heat a very thin film of olive oil. Sear the lamb in batches to avoid overcrowding the pan, adding more oil as needed. Take your time with this, making sure to brown the lamb all over. Transfer browned lamb to a roasting pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the lamb is cooked, add onion to empty skillet and cook it in the lamb drippings, adding a more oil if pan looks dry, until limp and lightly browned at the edges, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic, coriander, cayenne and allspice and cook until the garlic is very fragrant and opaque, 1 to 2 minutes longer. Pour in wine and bring to a simmer, scraping up the browned bits on bottom of pan. Let mixture simmer until thickened and reduced by about a third (about 5 minutes). Pour over lamb."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, toss together scallions, spicy greens, and herbs. Sprinkle lamb with half the herb mixture and set remaining half aside for serving. Cover pan with two layers of foil (or heavy-duty foil) and bake until meat is falling off the bones, 3 to 3 1/2 hours total, turning shanks every hour so they cook evenly. If the bottom of the pan starts to dry out before lamb is done, add a few tablespoons of the stock or water to moisten it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When shanks are tender, transfer to a heated serving platter and cover with foil to keep warm. If you like, at this point you can tear the meat off the bones; or, serve the shanks bone-in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On top of the stove, heat roasting pan over medium-low heat. If pan is dry, add remaining stock or water and bring to a simmer. (If drippings in pan seem very fatty, spoon off some of the fat.) Add currants and bring drippings to a simmer, scraping up the browned bits on bottom of pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the liquid is reduced to a thin glaze, add butter to pan along with all but 2 tablespoons of the remaining herbs (save those 2 tablespoons for garnish). Whisk sauce until smooth, then taste and add lemon juice as needed. Pour sauce over the lamb and garnish with chopped herbs. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1019087-braised-lamb-shanks-with-fresh-herbs"}