{"@context": "http://schema.org", "@type": "Recipe", "name": "Peach Raspberry Pie", "description": "The character of fresh raspberries can be fleeting when cooked, especially when the berries are mixed with other fruit like ripe, juicy peaches. To deepen the berry flavor in this summer pie, a little raspberry jam is mixed into the filling in place of some of the sugar. Instant (minute) tapioca serves as a clear, flavorless thickener here, with the tiny tapioca pearls echoing the texture of raspberry seeds. For a runny, syrupy pie that leaks when you cut into it, mix in the minimum amount of tapioca. Using all 3 tablespoons yields a pie with a thick, jammy filling. As for the stone fruit, peel the peaches or don't, to taste. Or substitute ripe nectarines, whose peels are less pronounced.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/07/04/dining/04apperex/04apperex-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "dessert, instant tapioca, lemon, nutmeg, peach, raspberries, raspberry jam, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 258}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 525, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "17 grams", "sodiumContent": "347 milligrams", "sugarContent": "28 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 1/2 cups/320 grams all-purpose flour", "1 teaspoon fine sea salt", "Large pinch of sugar", "1 cup/225 grams unsalted butter (2 sticks), cold and cut into cubes", "2/3 cup/158 milliliters ice water, more if needed", "1/4 cup/60 milliliters raspberry jam", "2 tablespoons unsalted butter, melted", "1/4 cup/50 grams granulated sugar", "1/4 cup/55 grams light brown sugar", "1 1/2 to 3 tablespoons minute (instant) tapioca", "1/2 teaspoon freshly ground nutmeg", "1/2 teaspoon finely grated lemon zest", "1/8 teaspoon fine sea salt", "5 cups/770 grams thinly sliced peaches (about 6 to 8 medium peaches)", "1 pint/245 grams raspberries", "1 large egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a large bowl, mix together flour, salt and sugar to combine. Add cubed butter, then pinch and squeeze the butter cubes (or use a pastry blender) until the largest pieces are the size of lima beans. Drizzle in water a little at a time, mixing until the dough starts to come together into a mass, but leaving some floury bits at the bottom of the bowl. You may not need all the water, or you may need to add more water if dough doesn’t come together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to a lightly floured surface and press and lightly knead it together into 2 smooth balls, one slightly larger than the other. Flatten into disks, wrap in plastic wrap, and chill for 1 hour or up to 5 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Place a 9-inch pie pan on a baking sheet. On a floured surface, roll out larger ball of dough to a 12-inch circle, then drape it over the pie pan and press it into the bottom edges and along the sides. Chill in refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll second ball of dough out to an 11-inch circle about 1/4-inch thick. Cut dough into 1-inch strips and reserve. (If it’s cool in your kitchen, leave the strips on the counter. If it’s warm, transfer them to a rimmed baking sheet and chill until needed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together raspberry jam and melted butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, stir together sugars, tapioca, nutmeg, lemon zest and salt. Toss in peaches, then gently fold in raspberries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, lightly beat egg with 1 tablespoon water to make an egg wash. Brush on bottom and sides of pie dough in the pan, then spoon filling into pie pan, mounding it slightly in the center. Drizzle with jam-butter mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use dough strips to create a lattice top, then fold and crimp the edges. Brush with more egg wash, place pie pan on a rimmed baking sheet, and bake until crust is golden and filling is bubbly, 60 to 75 minutes. Let cool to room temperature, at least 4 hours. (If you don’t want to wait, that’s fine, but filling will be runnier.)"}]}