{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Lava Cake for Two", "description": "Chocolate lava cakes gained popularity in the late 1990s thanks to the chef Jean-Georges Vongerichten, and they have stuck around on dessert menus for good reason: They are rich chocolate cake and velvety sauce all in one, and they are surprisingly easy to make in under an hour. If you like to plan ahead, you can prepare the batter a day in advance, refrigerate it, then pop the cake into the oven when you are ready for dessert. This recipe, made in a 10-ounce baking dish, is meant for sharing, but you can also make it in two 6-ounce ramekins. Just cut the baking time to 7 to 9 minutes. Also, be sure to use chopped chocolate bars or chocolate féves rather than chocolate chips here. Chips are made with stabilizers that inhibit melting and will negatively affect the texture of your dessert.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2019/02/11/dining/11molten-lava-cake/ya-molten-lava-cake-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "for two, cakes, custards and puddings", "keywords": "bittersweet chocolate, butter, egg, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1119}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 528, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "20 grams", "sodiumContent": "165 milligrams", "sugarContent": "43 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 ounces/85 grams bittersweet chocolate, 70 to 74 percent cacao (not chips), chopped (about 1/2 cup)", "3 tablespoons unsalted butter, cut into cubes, plus more for the ramekin", "3 tablespoons granulated sugar, plus more for the ramekin", "1 large egg", "1 large egg yolk", "1/2 teaspoon vanilla extract", "1/8 teaspoon kosher salt", "2 tablespoons all-purpose flour", "Confectioners’ sugar, to serve (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees and butter a 10-ounce ramekin. Dust the buttered ramekin with granulated sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "2. Combine the chocolate and 3 tablespoons butter in a heat-safe bowl set over a pan of simmering water. Cook, stirring occasionally, until melted and smooth. (Alternatively, combine in a bowl and microwave in 30-second blasts, stirring in between, until melted and smooth, about 1 minute.) Remove from the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine the 3 tablespoons sugar, egg, egg yolk, vanilla and salt. Whisk vigorously until the mixture is thick, foamy and pale, about 2 minutes. Whisk in the flour until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spatula, add the chocolate to the egg mixture and stir gently until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the mixture into the ramekin. Bake for 12 to 14 minutes or until the edges are set and puffed, but the center is still soft when lightly pressed. (You can also cover and refrigerate the batter up to a day in advance. Add an additional minute or 2 to baking time if you are baking the cake directly from the refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use an offset spatula or small knife to loosen the edges of the cake from the ramekin. Place a plate over the ramekin and carefully invert the warm cake. Use an oven mitt or clean kitchen towel to remove the ramekin, dust the cake with confectioners’ sugar and serve with ice cream or whipped cream."}], "link": "https://cooking.nytimes.com/recipes/1019957-chocolate-lava-cake-for-two"}