{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Kolbasa (Russian No-Bake Fudge Cookies)", "description": "The chef Bonnie Morales Frumkin upgraded this recipe from a treat her Russian family often made during the Soviet era as a way to stretch precious supplies like cookies and cocoa powder. By adding bittersweet chocolate and toasted hazelnuts, she has made it positively luxurious. The treat gets its name from its resemblance to a salami, with bits of nuts and cookies studding each slice.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2018/12/26/dining/26rusrex3/merlin_148266402_13ae3b05-42d4-41cc-be53-3030b49f60fb-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "About 3 dozen cookies", "recipeCuisine": "russian", "recipeCategory": "cookies and bars", "keywords": "bittersweet chocolate, hazelnut, sweetened condensed milk, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 139}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 89, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "42 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["About 4 ounces/110 grams plain cookies, such as shortbread, tea biscuits, chocolate wafers or graham crackers (store-bought is fine), to make 2 cups cookie bits", "2/3 cup/3 ounces/85 grams chopped toasted hazelnuts, walnuts or pecans", "8 tablespoons/120 grams unsalted butter (1 stick)", "3/4 cup/6 ounces/180 milliliters sweetened condensed milk", "4 1/2 ounces/125 grams bittersweet chocolate, in bars or chips", "1 tablespoon unsweetened cocoa powder", "1 teaspoon kosher salt or 1/2 teaspoon table salt", "1/4 cup/30 grams confectioners' sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cookies in a bowl and use a masher to crush them into bits. (The biggest pieces should be no larger than 1/2-inch square.) Dump mixture into a colander and shake to remove most of the tiny crumbs. You should have about 2 cups pieces remaining. Return to bowl and add nuts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, melt butter over low heat. Whisk in condensed milk. If using bar chocolate, break into medium-size pieces. Add chocolate, cocoa powder and salt, and whisk until chocolate is melted and mixture is smooth, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape chocolate mixture into bowl with cookies. Stir together and set aside at room temperature for 15 minutes to firm up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, lay 2 sheets of aluminum foil, each about 18 inches long, on a work surface. Top each with a sheet of waxed or parchment paper. Divide cookie mixture between the two. Using paper and your hands, shape and roll mixture into two cylinders of dough, each about 12 inches long and 1 1/2 inches in diameter. Roll dough up in the paper, then again in foil. Roll on the work surface to make sure the log is even, then twist the ends of the foil to secure."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate the logs until firm, at least 1 hour. After 1 hour, check to make sure they are setting evenly. If necessary, roll on the work surface again until smooth (no need to remove the foil and paper). Refrigerate until fully set, another 2 hours or up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, remove logs from refrigerator and unwrap them on a work surface. Sprinkle confectioners' sugar over them, turning to coat. Shake off excess and use a serrated knife to slice into 1/4-inch rounds. Plate and serve, or refrigerate up to 2 hours."}]}