{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice With Mushrooms (Arroz con Campinones)", "description": "This recipe — adapted from “The New Spanish: Bites, Feasts and Drinks” by Jonah Miller and Nate Adler, the owners of Huertas in the East Village in New York — offers the cook a simple primer on paella. The method is a template best made in a paella pan and, as a bonus, it will free the cook from the notion that paella must be some kind of production number involving a budget-busting and time-consuming load of chicken, pork, seafood, vegetables and the like. This version features mushrooms and not much else. But its largely unadorned canvas will accept embellishments. Some tomato purée in the broth perhaps? Certainly. Seared sea scallops, shrimp, some sausage, pieces of duck confit, chickpeas, grilled peppers, eggplant chunks or baby artichokes? Those, too, but definitely not all at once.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2018/10/17/dining/17Pairingrex1/merlin_145120464_22490d49-7e61-4ddd-817c-ffd83ba9d4d0-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "grains and rice", "keywords": "mushroom, rice", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 471, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1134 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["4 cups mushroom or vegetable stock", "1/2 pound cremini mushrooms, brushed clean, stems removed and reserved, caps chopped in 1/2-inch pieces, preferably by hand", "Salt", "2 cloves garlic", "1/3 cup mayonnaise, store-bought or homemade", "2 teaspoons lemon juice", "3 tablespoons extra-virgin olive oil", "1 cup finely chopped onion", "1 cup finely chopped fennel bulb", "1 teaspoon fresh thyme leaves", "1 cup Spanish short-grain rice (Bomba or Calasparra), or Arborio rice", "1/2 cup dry sherry or white wine", "1/2 cup jarred pickled mushrooms or 1 tablespoon sherry vinegar", "1 tablespoon minced chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the stock in a small saucepan, add the mushroom stems and bring to a simmer. Season to taste with salt. Cook on low for 15 minutes. Grate 1 clove of the garlic and mix with the mayonnaise, lemon juice, 1 tablespoon of the olive oil and salt to taste. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon oil on medium in a 10-inch paella pan or skillet. Add onion, fennel and remaining garlic clove, minced fine. Cook, stirring, about 10 minutes, until vegetables are soft and barely starting to color. Add remaining oil and the mushroom caps, increase heat to medium-high and cook 3 to 5 minutes, stirring on and off, until mushrooms have wilted, start to brown and have released some liquid. Season with salt and add thyme."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice to the pan. Stir for about 1 minute with a wooden spoon. Add the sherry or wine and let reduce until most of it has been absorbed. Use the back of the spoon to spread the rice evenly in the pan. Remove and discard the stems from the stock. Gently add 2 cups of the stock to the pan, taking care not to disturb the rice. Bring to a simmer and cook about 5 minutes on medium-low, until the liquid is absorbed. Add more liquid, in 1/2 cup increments, without stirring the rice until the stock is absorbed after each addition. When the rice is nearly tender let it cook another 5 minutes or so, until there does not appear to be any liquid in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the heat and let rest for 2 to 3 minutes. Scatter pickled mushrooms on top or drizzle on the vinegar. Strew with chives. Dollop the mayonnaise sauce on top, and serve rice directly from the pan."}]}