{"@context": "http://schema.org", "@type": "Recipe", "name": "Moroccan Moufleta", "description": "For Moroccan Jews — and increasingly Israeli and other Jews of all stripes and ancestral origin — the end of the Passover holiday is not complete without a Mimouna feast. And at its center is moufleta, a flat cake that you fry in a pan and assemble into a stack. (If that seems too tricky, we provide a method here for making them individually.) The dough is fairly simple, as are the traditional toppings, soft butter and honey. But if you prefer homemade or Nutella, no one but the staunchest traditionalists is likely to complain.", "author": {"@type": "Person", "name": "Ron Lieber"}, "image": "https://static01.nyt.com/images/2018/04/04/dining/04mimounarex2/merlin_135727107_6100cb28-6b5d-4b22-9018-604e138927d9-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 20 pieces", "recipeCuisine": "moroccan", "recipeCategory": "pancakes", "keywords": "dessert, kosher", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 41}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 286, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "95 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["8 cups/1024 grams all-purpose flour", "1 tablespoon granulated sugar", "1 teaspoon instant dry yeast", "1 teaspoon kosher salt", "1 cup vegetable or canola oil", "Butter and honey, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the flour, sugar, yeast and salt. Make a well in the center, and slowly add 3 to 3 1/2 cups warm water, mixing and kneading gently, at first with a wooden spoon and then with your hands, until a light and elastic dough is formed. (Add a little extra water if dough seems too dry; it should be pretty wet.) Cover the bowl with plastic wrap and let dough rest for about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously coat a baking sheet with oil and set aside. Coat your hands with oil and divide the dough into about 20 balls, each slightly smaller than a tennis ball. Dip each ball in the oil and set on the baking sheet. (Don’t worry if the balls lose their shape). Let rest for another 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil your work surface. Place 1 ball at time on the surface and flatten with your palm. Using your fingers, stretch the dough out, as thin as possible, into a 7- or 8-inch disc. Keep dipping your fingers in the oil as needed to help get the moufleta as thin as possible and to keep it from sticking to the work surface or your hands."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large cast-iron or nonstick skillet over medium-low heat. When the pan is hot, carefully pick up the first moufleta (it will be stretchy and have a hard time holding its shape) and place it on the hot skillet. Cook on one side, about 1 to 2 minutes, until the underside has golden-brown patches. Flip the pancake over, roll out the next ball of dough and place it on top of the first one. When the bottom side has golden-brown patches, flip both pancakes together to cook the new one. Roll out another moufleta and place on top of the moufleta pack in the skillet. Flip to cook. Repeat for all moufletas, starting over again when you have a pack of 7 or 8. Except for the first one, they are all getting cooked only on one side. (Alternatively, the moufletas can be cooked one at a time for about 1 to 2 minutes per side and removed to a plate, each one going underneath the one cooked before it to help keep them from drying out. Cover the plate with a towel as you work.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately, while warm, with butter and honey."}], "link": "https://cooking.nytimes.com/recipes/1019237-moroccan-moufleta"}