{"@context": "http://schema.org", "@type": "Recipe", "name": "Chivichangas de Machaca (Stewed Brisket and Cheese Chimichangas)", "description": "Teo Diaz grew up eating chivichangas, or small burritos typically filled with stewed meat, almost every day in San Luis, Arizona, just miles from the U.S.-Mexico border. His single mother would prepare a dozen or more of them early each morning before heading out to pick and pack produce in the fields of nearby Yuma, wrapping them individually in aluminum foil and leaving them on the counter for her six children to eat throughout the day.\n\nNow the chivi, as he calls it, is one of the most beloved items on the menu at his tiny downtown Los Angeles taqueria, Sonoratown. The kitchen is too small for a stove, so he simmers brisket in an industrial-sized rice cooker before shredding it and cooking it a second time with fire-roasted chilies, tomatoes, and heaps of grated cheese. The result, wrapped in a fragrant, chewy handmade tortilla, is perfectly spiced and mouthwateringly unctuous. Everyone will want seconds.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2018/10/07/magazine/07mag-eat-image2/07mag-eat-image2-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "Makes enough filling for about 12 chivichangas", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, snack, burritos and nachos, project", "keywords": "anaheim chiles, beef brisket, monterey jack cheese, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 175}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 281, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "1 gram", "proteinContent": "18 grams", "saturatedFatContent": "10 grams", "sodiumContent": "309 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds beef brisket, cut into approximately 4-by-3-inch pieces", "1/2 yellow onion, outermost layer peeled", "4 cloves garlic, unpeeled", "2 tablespoons plus 2 teaspoons Diamond Crystal Kosher Salt, or 4 teaspoons fine sea salt", "1 1/4 teaspoons ground coriander", "1 1/4 teaspoons ground cumin", "1 1/4 teaspoons freshly ground black pepper", "1 1/4 teaspoons cayenne powder", "1 1/4 teaspoons garlic powder", "1 1/4 teaspoons onion powder", "4 Roma tomatoes", "4 fresh Anaheim peppers", "3/4 cup (about 2 ounces) finely grated Cheddar cheese", "1 1/2 cups (about 4 ounces) finely grated Monterey jack cheese", "Flour tortillas (<a href=\"https://cooking.nytimes.com/recipes/1019621-sonoran-style-flour-tortillas\">see recipe</a> or use store-bought 8-inch tortillas)", "Sliced radishes and lime wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place brisket, onion, garlic, salt, coriander, cumin, black pepper, cayenne, garlic powder and onion powder in a 4- or 5-quart pot or Dutch oven. Add 3 cups water and cover pot. Bring to a boil, then reduce heat and simmer for 3 hours or until meat is tender when\npierced with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a charcoal grill, fill a chimney starter with charcoal and light. When the coals are white-hot, pour them out of the chimney starter into the grill to form a hot bed of coals. Use tongs to move any flaming coals off to one side of grill. Set grill grates over the coals, and allow them to get hot. If using a gas grill, preheat to medium-high. If using a broiler, turn oven to broil setting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill tomatoes and peppers over medium-high heat (or broil) rotating from time to time, until skins are evenly blistered and charred, about 20 minutes. Place into a metal bowl and seal with plastic wrap. When cooled, peel tomatoes and peppers and discard skin and stems. Use your hands to crush tomatoes and peppers into a rough salsa in the bowl. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When tender, remove meat from pot and set aside. Discard onion, garlic, and all but 1 cup cooking liquid. When meat is cool enough to handle, shred thoroughly, scraping off any fat and setting aside as you go. Finely chop the fat and add back into meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pot to stove and set over medium heat. Add meat, fat, crushed salsa, and grated cheeses. Stir well to combine, then taste and adjust seasoning with salt as needed. Bring to a gentle boil, then reduce heat and simmer uncovered for 30 to 35 minutes until thick and unctuous."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To form chivichangas, spoon a heaping 1/4 cup of machaca mixture into the center of each tortilla and spread into a 3-inch rectangle. Fold the bottom half of the tortilla over the filling, then pull the edge of the tortilla back toward the top of the filling to create a tight cylinder of filling. Fold both sides of the tortilla in, then tightly roll the chivichanga toward the top of the filling to yield a small, rectangular burrito."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stoke grill or preheat griddle or skillet to medium-hot. Cook the chivichangas for about 2 minutes per side until evenly crisp and golden brown. Serve hot with sliced radishes and wedges of lime."}], "link": "https://cooking.nytimes.com/recipes/1019638-chivichangas-de-machaca-stewed-brisket-and-cheese-chimichangas"}