{"@context": "http://schema.org", "@type": "Recipe", "name": "Easy Yogurt", "description": "In many South Asian households, making yogurt is standard practice. The writer Priya Krishna’s father has been making yogurt at the family’s home in Dallas for as long as she can remember, using a yogurt culture he has kept going for more than 25 years. No store-bought yogurt has ever held a candle to the homemade version, which is thick and pleasantly tangy. You can really taste the milk. (Organic milk will often yield a creamier result.) You may have been told that you need special machines and containers to make yogurt, but this recipe, which appears in her 2019 cookbook “Indian-ish,” is quite simple: All that’s required is a heavy-bottomed pot and an oven. You can use one batch of yogurt as the culture for the next, and watch your yogurt evolve over time.", "author": {"@type": "Person", "name": "Priya Krishna"}, "image": "https://static01.nyt.com/images/2019/02/27/dining/27yogurtrex-1/27yogurtrex-1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "1 quart", "recipeCuisine": "", "recipeCategory": "project", "keywords": "milk, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 54}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 63, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": null, "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "45 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["4 cups whole milk, preferably organic", "1/4 cup full-fat yogurt with live active cultures (check the ingredient list)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Evenly coat the bottom of a medium Dutch oven or other heavy-bottomed pot with a thin, 1/4-inch-thick layer of water. (This will prevent the milk from sticking to the bottom of the pot.) Set the pot over high heat. Add the milk and heat until it just comes to a boil, watching closely: As soon as you start to see bubbles forming, take the pot off the heat. Let the milk cool until it reaches 130 degrees, 30 to 35 minutes. If you don’t have a thermometer, the milk should be warm enough that you can comfortably stick your (clean!) finger in it — it should feel hot, but not so hot as to scald your finger (think of a Jacuzzi)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the milk is cooling, smear the bottom of a 1-quart lidded glass, plastic or stainless steel container with 1 teaspoon of the yogurt. (A dab in the center is fine; you needn’t spread the yogurt evenly to coat the bottom.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the milk has cooled to the proper temperature, add the remaining yogurt to the milk and whisk until the yogurt has completely dissolved into the milk, about 3 minutes. Pour the mixture into the prepared container and loosely set the lid on top, leaving a little room for air to get out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the container inside an unheated oven. Shut the oven, turn the oven light on and let sit for 2 hours (see Note). Check the yogurt: When it is done, it will be set (not liquid) but still jiggle like Jell-O. If it’s not yet set, leave it in the oven for 1 hour more. Depending on the temperature and humidity outside, the setting process can take up to 5 1/2 hours, so don’t fret if the yogurt isn’t done the first time you check."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the yogurt is done, top it with the lid to seal, and transfer the yogurt to the refrigerator to chill and fully set overnight before using. The yogurt will keep, covered, for 4 to 6 weeks. (It’ll start to get pretty sour after 2 weeks, which, depending on your tastes, could be a good or bad thing. You can also freeze a few tablespoons to start a later batch.)"}], "link": "https://cooking.nytimes.com/recipes/1019966-easy-yogurt"}