{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Eggs With Zucchini, Feta and Lemon", "description": "This dish is a celebration of zucchini, and it can be served any time of the day, really, either on its own or with some good bread to dip into the runny yolks. Although the zucchini blossoms make this look particularly bright and festive, the recipe would work just fine without them. If your zucchini blossoms come with stems or small zucchini attached, simply slice them up and slow-cook them with the rest of the sliced zucchini.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2018/07/18/dining/18ottolenghirex1/merlin_141025836_101367d4-f607-44d9-a63f-e384b00b45b9-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "3 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dill, feta, rainbow chard, zucchini, zucchini flowers, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 210}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 449, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "4 grams", "proteinContent": "17 grams", "saturatedFatContent": "10 grams", "sodiumContent": "976 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 lemons", "1/3 cup/70 milliliters olive oil", "3 small garlic cloves, crushed with the back of a knife", "1 red chile pepper (such as serrano), roughly chopped (and deseeded if you don’t like heat)", "Flaky sea salt", "1 1/3 pounds/600 grams zucchini, thinly sliced on a mandoline", "2 leaves rainbow chard (about 3 ounces/80 grams), thinly sliced", "2 tablespoons roughly chopped chives", "2 tablespoons dill", "1/3 cup/40 grams roughly crumbled feta", "6 eggs", "6 zucchini blossoms, stemmed, halved lengthwise", "1 tablespoon/15 grams unsalted butter", "1/4 teaspoon Aleppo pepper (or 1/8 teaspoon red pepper flakes) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take one lemon and use a vegetable peeler to remove 4 strips of zest. Squeeze the lemon to get 1 tablespoon juice, then set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the oil, garlic, chopped red chile pepper, lemon zest strips and 3/4 teaspoon salt to a large, preferably nonstick sauté pan (for which you have a lid) set over medium heat. Gently fry for 3 to 5 minutes, stirring often, until the oil begins to bubble. (Turn the heat down to medium-low if the oil bubbles too quickly.) Decrease the heat to low, add the zucchini slices (not the blossoms) and continue to cook for 15 to 20 minutes, stirring often, until the zucchini slices are very tender and beginning to brown. Stir in the chard and cook for another few minutes, until wilted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the zucchini and chard over a saucepan to collect the oil, then return the vegetables to the sauté pan. Stir in the herbs, reserved lemon juice and feta. Create 6 hollows with the back of a spoon and carefully break an egg into each hollow (take care not to break the yolks). Lay the zucchini blossoms around the eggs and drizzle them with a teaspoon of the reserved frying oil. Cover the pan with the lid and cook for 4 to 5 minutes over medium-high heat, until the whites are almost set and the yolks are still runny (the eggs will continue cooking once uncovered and taken off the heat)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the eggs cook, add the butter to the reserved oil and gently heat until beginning to brown and bubble, then drizzle over the eggs when they’re done. Sprinkle with the Aleppo chile and a good pinch of salt and serve hot with juice from the remaining lemon squeezed on top."}], "link": "https://cooking.nytimes.com/recipes/1019417-braised-eggs-with-zucchini-feta-and-lemon"}