{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Vegan Hot Chocolate", "description": "For a vegan hot chocolate that rivals even the creamiest dairy-laden variety, add a few tablespoons of nut butter like almond, sunflower or peanut to the nondairy milk, chocolate chips and cocoa powder. Whisking is also essential here; nondairy products tend to contain stabilizers that keep them emulsified, so they can separate when boiled. If you keep whisking the mix as it heats and remove it from the stove when it’s nice and steaming, but before it boils, you’ll end up with perfectly smooth hot chocolate. Don’t worry if it breaks: You can simply blend it with a whisk or immersion blender over low heat to bring it back together.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2019/02/01/dining/gk-dairy-free-hot-chocolate/gk-dairy-free-hot-chocolate-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "2 cups", "recipeCuisine": "american", "recipeCategory": "non-alcoholic drinks", "keywords": "dairy-free milk, nut butter, vegan chocolate, vegan cocoa powder, dairy-free, vegan, vegetarian, dessert, side dish, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 72}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 239, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "16 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/3 cup vegan semisweet chocolate chips (about 2 ounces)", "3 tablespoons vegan unsweetened cocoa powder", "3 tablespoons creamy nut or seed butter, such as almond, sunflower or peanut", "Pinch of kosher salt", "1 1/2 to 2 cups unsweetened nut or grain milk, such as macadamia, walnut, almond, cashew, hazelnut, oat or rice milk", "1 to 3 teaspoons granulated sugar (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine chocolate chips, cocoa powder, nut butter, salt and 1/2 cup nut or grain milk in a small saucepan. Whisk over medium heat until the chocolate melts and the mixture is smooth, about 1 1/2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in 1 cup nut or grain milk in a slow, steady stream, and continue whisking until cocoa is steaming, about 1 1/2 minutes. Don’t let it come to a boil or the cocoa will separate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste a spoonful. (Be careful: It’s hot.) If you prefer a thinner hot cocoa, add up to 1/2 cup additional milk. If you prefer it sweeter, add a teaspoon of sugar at a time, tasting after each addition. Divide among cups and serve hot."}], "link": "https://cooking.nytimes.com/recipes/1019960-creamy-vegan-hot-chocolate"}