{"@context": "http://schema.org", "@type": "Recipe", "name": "Crunchy Chickpeas With Aleppo Pepper and Lemon Zest", "description": "Zippy lemon zest and mildly spicy Aleppo pepper are tossed together with warm roasted chickpeas for a satisfying snack, which pairs well with everything from a gin and tonic to a cold beer. Tossing the dried, toasted beans in oil after they roast helps gives the pepper and lemon something to adhere to. If you’re not having cocktails, these can be used in a salad in place of croutons or anywhere you want some crunch. If you don't have Aleppo pepper, red-pepper flakes make a fine substitute.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/09/28/dining/ch-chickpea-aleppo-pepper/ch-chickpea-aleppo-pepper-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 1 cup", "recipeCuisine": "", "recipeCategory": "beans", "keywords": "Aleppo pepper, chickpea, lemon zest, appetizer, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 41}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 209, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "7 grams", "proteinContent": "8 grams", "saturatedFatContent": "1 gram", "sodiumContent": "271 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 (15-ounce) can chickpeas, drained and patted very dry", "2 tablespoons olive oil", "1/2 teaspoon Aleppo pepper or red-pepper flakes", "Kosher salt", "1 teaspoon lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Spread chickpeas out evenly on a sheet pan and roast until crisp and golden in spots, shaking the pan occasionally, about 20 to 25 minutes. Turn off the oven and let the chickpeas hang out for another 10 to 15 minutes, checking in occasionally to make sure they do not burn. This will help keep them crunchy for an extended period of time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 10-inch skillet, heat the olive oil over medium-low heat. Add chickpeas and toss to coat in the oil. Stir in Aleppo pepper and season well with salt. Remove from heat and sprinkle with the lemon zest and toss again. Serve warm. Store any leftovers in an airtight container for up to a week."}], "link": "https://cooking.nytimes.com/recipes/1019672-crunchy-chickpeas-with-aleppo-pepper-and-lemon-zest"}