{"@context": "http://schema.org", "@type": "Recipe", "name": "Butcher’s Steak With Leafy Greens Salsa Verde", "description": "Butcher’s steak is the name of a specific cut of steak, also known as hanger steak (and, occasionally, bistro steak). It’s a cut that hangs off the cow’s diaphragm, resulting in a steak that has the beefy flavor of a short rib, the fat marbling of a rib-eye and the tenderness of filet mignon. There is only one per animal, making it somewhat exclusive but not especially expensive. It is also a term used for the secret-ish cuts typically available only to butchers and restaurants; but a good butcher will gladly help you unlock those secrets. Other lesser-known, surprisingly affordable cuts that work well here include boneless short ribs, Denver steaks and center-cut top sirloin. These cuts are great with little more than salt and pepper, so you can truly assess their flavor. But a tangy, garlicky salsa verde made from dark leafy greens doesn’t hurt. Serve with a squeeze of lemon and a bowl of salty potato chips for a truly faux-bistro experience.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/09/05/dining/05Romanrex2/merlin_143028852_04c4c45c-4f4f-4185-bb6c-b116f1967579-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, weeknight, steaks and chops", "keywords": "kale, scallion, steak, low-carb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 301}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 471, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "2 grams", "proteinContent": "36 grams", "saturatedFatContent": "8 grams", "sodiumContent": "579 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 pounds hanger, thick skirt or flat-iron steak", "Kosher salt and freshly ground black pepper", "6 scallions", "1/2 small bunch kale, Swiss chard, collard greens or mustard greens, leaves and stems very finely chopped (about 2 1/2 cups)", "1 garlic clove, finely grated", "1/3 cup olive oil", "1 tablespoon canola or grapeseed oil", "1 lemon or lime, halved", "Flaky salt", "Potato chips (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season steak well with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut 4 of the scallions into 2-inch pieces; set aside. Finely chop remaining scallions and add to a medium bowl with kale, garlic and olive oil; season with salt and pepper. The mixture won’t exactly be saucy yet, but as it sits the kale will soften and loosen up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat canola oil in a large skillet over medium-high heat. Add steak and cook, without moving it, until deeply golden brown on one side, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flip steak and continue to cook until equally browned on that side, another 3 to 4 minutes. Transfer salsa verde to a large plate, and place steak on top. Add remaining scallions to the pan, letting them sizzle in the leftover fat. Season with salt and pepper and cook until they're wilted and lightly charred, 2 or 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let steak sit 5 to 10 minutes to allow it to rest and juices to mingle with the salsa verde."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the steak and return to plate with salsa verde. Top with seared scallions. Squeeze lemon or lime over everything and sprinkle with flaky salt. Serve with potato chips, if you like."}], "link": "https://cooking.nytimes.com/recipes/1019498-butchers-steak-with-leafy-greens-salsa-verde"}