{"@context": "http://schema.org", "@type": "Recipe", "name": "Darina Allen's Shepherd's Pie", "description": "This is an adaptation of an irresistibly homey recipe from the Irish chef Darina Allen's cookbook “Grow Cook Nourish: A Kitchen Garden Companion in 500 Recipes.” She devised it for leftover roast duck and gravy, but here, meaty duck legs are braised especially for the dish (they may be cooked up to 2 days in advance). The topping is an earthy blend of potato and parsnip, a brilliant counterpart to the rich saucy filling. To be true to the spirit of the recipe, you should feel free to replace the duck with other combinations of cooked meats, vegetables or mushrooms. You’ll need 5 to 6 cups of filling in total.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/03/14/dining/14KITCHEN1-copy/merlin_133952328_3538e6d6-4c35-4535-b19c-d2a3039e996f-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 to 8 servings", "recipeCuisine": "british, irish", "recipeCategory": "dinner, casseroles", "keywords": "duck leg, parsnip, potato, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 151}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1060, "unsaturatedFatContent": "46 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "84 grams", "fiberContent": "8 grams", "proteinContent": "28 grams", "saturatedFatContent": "33 grams", "sodiumContent": "1313 milligrams", "sugarContent": "9 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["6 duck legs, trimmed, at room temperature (about 3 pounds)", "Salt and pepper", "1 cup chopped onion", "1 large carrot, diced", "2 celery stalks, diced", "1 thyme sprig", "1 bay leaf", "6 allspice berries", "4 cups hot chicken broth, more as needed ", "1/2 cup red or white wine", "2 tablespoons butter", "1 cup diced onion", "Salt and pepper", "2 tablespoons all-purpose flour", "2 tablespoons chopped parsley", "Salt and pepper", "1 1/2 pounds medium yellow-fleshed (or russet) potatoes, peeled and cut in 1-inch chunks", "1 1/2 pounds medium parsnips, peeled and cut in 1-inch chunks", "6 tablespoons butter, plus 2 tablespoons for dotting the top", "1/4 cup grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the duck: Heat oven to 400 degrees. Season duck generously with salt and pepper. Place in a roasting pan in one layer. Scatter with onion, carrot and celery, thyme sprig, bay leaf and allspice, then add broth and wine (liquid will not cover). Roast, uncovered about 30 minutes, until skin has browned nicely. Turn legs over, cover pan tightly and return to oven. Reduce temperature to 350 degrees. Cook 1 hour, or until meat is quite tender when probed with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove legs from pan and set aside to cool on a baking sheet. Pour liquid from roasting pan into a measuring cup. There should be about 3 cups; add broth if necessary. Spoon off any rising fat (save if you wish for another use). When duck meat is cool enough to handle, pull it off the bones and roughly chop, discarding gristle and skin. (This step may be done up to 2 days in advance, if desired.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a wide, heavy skillet or Dutch oven, melt butter over medium-high heat. Add onion, season with salt and pepper and cook, stirring, until softened and beginning to color, about 5 minutes. Add flour, stir well to coat and continue cooking until mixture is a nutty brown, about 5 minutes more. Slowly whisk in 2 cups of the braising liquid, whisking well as mixture thickens and reducing heat to a simmer. Taste and add more liquid as needed until you have a medium-thick gravy. Adjust the seasonings to taste. Off the heat, carefully fold in chopped duck meat and parsley. Transfer mixture to a 9-by-13-inch baking dish or 4-quart casserole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the topping: Bring a large pot of well-salted water to a boil over high heat. Add potatoes and parsnips. When water returns to the boil, adjust heat to a brisk simmer and cook until completely tender, 10 to 15 minutes. Drain in a colander, reserving 1 cup cooking liquid. Return potatoes and parsnips to pot and mash with 6 tablespoons butter. Season to taste with salt and pepper, thinning with a little cooking liquid if mixture seems dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, heat oven to 350 degrees. Drop large spoonfuls of the mash evenly over filling. Use a knife or spatula to spread mixture until it evenly covers the top. Cut the 2 tablespoons butter into small chunks, dot over the top, and sprinkle with Parmesan. Bake until bubbling at the edges and well browned on top, 30 to 40 minutes. Let cool at least 10 minutes before serving."}]}