{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Pasta With Bacon and Red Cabbage", "description": "Smoky bacon and cabbage are a classic Eastern European combination, but tossing them with pasta and a bit of cream takes them in a heartier direction. Use a short, curvy shape, such as cavatappi or fusilli, that can catch the silky sauce in its crooks. Red cabbage is called for here, but regular green or Savoy cabbage would also work well. Top any leftovers with a fried egg and, of course, extra grated cheese.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/12/27/dining/ch-creamy-pasta-with-bacon-and-red-cabbage/merlin_145792677_63fa31b1-853f-41c3-a21c-2086f955965b-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas", "keywords": "bacon, cabbage, cavatappi, fusilli, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 241}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 664, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "4 grams", "proteinContent": "18 grams", "saturatedFatContent": "16 grams", "sodiumContent": "561 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound cavatappi, fusilli or other short, curvy pasta", "Kosher salt", "2 tablespoons olive oil", "8 ounces thick-cut bacon, sliced into 1/4-inch pieces", "1 medium red onion, thinly sliced", "4 cups thinly sliced red cabbage, from about 1/2 small cabbage, cut into pieces no larger than 3 inches wide", "Black pepper", "1 cup heavy cream", "1/4 cup grated pecorino or Parmesan, plus more for serving", "2 tablespoons mixed chopped fresh herbs, such as Italian parsley, thyme or oregano, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the pasta in a large pot of well-salted boiling water (2 heaping tablespoons kosher salt to about 7 quarts water) according to package instructions until it's just short of al dente. Reserve 1 cup pasta water, and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the olive oil over medium heat in a 12-inch skillet, preferably with sides. Add the bacon and cook until crisp, about 5 to 6 minutes, then remove with a slotted spoon and set aside on a plate lined with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion to the pan, toss to coat in the rendered bacon fat and cook until translucent, about 1 to 2 minutes. Add the cabbage, toss to combine and cook until the cabbage is tender but maintains its vibrant color, about 3 to 5 minutes more. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to low and add the pasta to the skillet along with the bacon, heavy cream and grated cheese tossing to coat until the pasta is glossy with sauce and it thickens slightly, about 1 to 2 minutes. If you want the pasta saucier, add in 1/4 to 1 cup pasta water and toss until the desired consistency is reached. Top with the mixed herbs and pass grated cheese at the table, if desired."}]}