{"@context": "http://schema.org", "@type": "Recipe", "name": "Toasted Coconut Shortbread", "description": "These cookies have the taste and texture of one of those Danish holiday cookies that come in the little blue tins. The coconut in these cookies adds fat for an even more buttery treat with faintly nutty notes and no noticeable tropical flavor. Dipping each cookie into a pile of sanding sugar before baking gives the finished product a sweet and salty balance.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/12/05/dining/05slice2/merlin_146903328_7ae9fcfc-36b5-47f1-b4da-ae60eb1a466d-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "About 24 cookies", "recipeCuisine": "american", "recipeCategory": "cookies and bars", "keywords": "dessert, sanding sugar, unsweetened coconut flakes", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 452}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 157, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "7 grams", "sodiumContent": "73 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup plus 2 tablespoons/255 grams cold salted butter (2 1/4 sticks), cut into 1/2-inch pieces", "1/2 cup/100 grams granulated sugar", "1/4 cup/55 grams light brown sugar", "1 teaspoon vanilla extract", "1 3/4 cups/255 grams all-purpose flour", "1/2 cup/45 grams unsweetened shredded coconut, plus more for rolling", "3/4 teaspoon cinnamon", "1 large egg, well beaten", "Sanding sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer and a medium bowl (or a stand mixer fitted with the paddle attachment), beat butter, granulated sugar, brown sugar and vanilla on medium-high speed until super light and fluffy, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spatula, scrape down sides of bowl. With mixer on low speed, slowly add flour, followed by 1/2 cup coconut and beat just to blend."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough in half, then place each half on a large piece of plastic wrap. Sprinkle each piece of dough with half of the cinnamon, then fold plastic over to cover dough and protect your hands from getting all sticky. Start to form into a log (this will give a subtle cinnamon swirl-like effect — if this idea stresses you out, you can also just add the cinnamon with the flour and coconut in step 2)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands (just like you’re playing with clay), form dough into a log shape; rolling it on the counter will help you smooth it out, but don’t worry about getting it totally perfect. Each half should form logs that are about 1 1/2 to 2 inches in diameter. Chill until firm, at least 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line a rimmed baking sheet (two, if you’ve got ’em) with parchment paper. Brush outside of logs with egg wash. Roll logs in unsweetened coconut."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice each log into 1/4-inch-thick rounds. Dip each round on one side into sanding sugar (no need to egg wash, the sugar should just stick). Arrange on prepared baking sheet, sugar-side up, about 1 inch apart (they won’t spread much). Bake cookies until edges are just beginning to brown, about 10 to 12 minutes. Let cool slightly before eating them all."}], "link": "https://cooking.nytimes.com/recipes/1019805-toasted-coconut-shortbread"}