{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Chops Scottadito With Crispy Kale", "description": "The word scottadito means burned fingers in Italian; these lamb chops are best eaten with one's fingers soon after they come off the grill. The recipe comes from Rachael Ray, who serves these at her homes in upstate New York and Manhattan. The lamb chops are best if they marinate for several hours, but turn out just fine with an hour or two under the anchovy and garlic paste. Ms. Ray's method for preparing kale produces crispy leaves; key elements are the lightest spray of oil, and baking racks to get them really crisp. They need to be made in batches, but a hot oven makes the job quick, and they can also be done a little bit ahead of time and served at room temperature. Don’t skip grilling the lemon: the slightly charred, acidic flavor adds an essential layer. ", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2018/05/09/dining/09rayrex1/09rayrex1-articleLarge-v2.jpg", "totalTime": "PT4H40M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, barbecues", "keywords": "kale, lamb chops, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 63}, "recipeIngredient": ["12 lamb rib chops", "Kosher salt and ground black pepper", "6 anchovy fillets", "1/4 cup capers in brine, drained", "2 lemons, zested and cut in half", "4 cloves garlic, peeled and crushed", "24 fresh sage leaves, coarsely chopped", "1/2 cup plus 2 tablespoons extra-virgin olive oil, plus more as needed", "1 large bunch lacinato or Tuscan kale, stems removed and leaves left whole", "Grapeseed or other oil suitable for high heat, for preparing the grill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mallet, pound each rib chop to 1/4-inch thickness. Season the chops with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor, combine the anchovy fillets, capers, lemon zest, garlic, sage and 1/2 cup olive oil, and pulse the mixture to form a marinade. Using a rubber spatula, transfer mixture to a large plastic food storage bag or shallow dish. Add the lamb and coat evenly in marinade. Seal the bag or cover the dish with plastic wrap, and refrigerate for 4 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 500 degrees and place a rack just above the center. Place the kale leaves in a large mixing bowl and add 2 tablespoons olive oil. With clean hands, toss the leaves, making sure both sides of each piece are lightly coated, adding more oil, about a teaspoon at a time, as necessary. (Alternatively, an oil mister can be used to lightly spray the kale on each side.) Place a large wire rack inside a rimmed baking sheet and arrange half the leaves on the rack in a single layer, not touching one another, and season with salt and pepper. Roast kale to brown and crispy, about 4 to 5 minutes, then repeat with remaining leaves. Loosely arrange a bed of crispy kale on a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat an outdoor grill to high and brush or spray with grapeseed oil. Add the lamb and cook over the high heat for about 4 minutes until charred, then flip and cook until chops are crisp at the edges, another 2 to 3 minutes. (The fire will flare as the fat cooks, so stay close to the grill and shuffle the chops as necessary.) After flipping the lamb to cook on the second side, place the lemon halves on the grill and char until caramelized and browned, about 2 to 4 minutes. (Chops can also be broiled in the oven, on high, about 5 minutes on each side. Lemons can be charred in a grill pan on the stove.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the meat to rest on a plate for a few minutes. Arrange the chops on the bed of kale and douse them with the juice of the charred lemons."}]}