{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn-Seafood Stew With Avocado and Chiles", "description": "The bright, tangy flavors of this colorful seafood dish, adapted from the chef Jose Salazar of Mita’s Restaurant in Cincinnati, are loosely based on Mexican pozole verde, a hominy stew usually made with pork or chicken, or both. But here, the starchy grains are replaced by juicy, fresh corn kernels, and seafood stands in for the meat. Perfect for summer, the stew is herbal and light, with a sweetness from the corn that’s balanced by lime juice and roasted tomatillos, while green chiles give the whole thing a kick. You can use any combination of seafood here, adjusting the cooking times as needed.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/08/15/dining/15apperex1/merlin_142068150_42e87ea0-4876-4fdb-bf40-41e8ac4edf95-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, seafood, soups and stews", "keywords": "jalapeño, poblano pepper, shrimp, squid, tomatillo, white fish fillet, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 298}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 298, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "6 grams", "proteinContent": "30 grams", "saturatedFatContent": "1 gram", "sodiumContent": "895 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 medium tomatillos, husked", "2 medium poblano chiles", "1 large jalapeño", "5 large ears corn, shucked", "1/2 tablespoon grapeseed or olive oil", "4 garlic cloves, sliced", "2 small shallots (or 1 large), halved lengthwise and sliced", "2 packed cups cilantro leaves and stems, plus more leaves for garnish", "1/2 cup packed parsley leaves and stems", "Fine sea salt, as needed", "2 cups vegetable, chicken or seafood stock, preferably homemade", "3/4 pound squid, tentacles separated, bodies cut into 1-inch rings", "3/4 pound shelled shrimp, cut into 1-inch pieces", "1/2 pound firm white fish fillets, cut into 1-inch pieces", "2 limes, cut into wedges", "Diced avocado, for garnish", "Sliced radishes, for garnish", "Shredded green cabbage, for garnish", "Tostadas, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a grill or broiler. If grilling, grill tomatillos, poblanos and jalapeño until well charred all over, 3 to 7 minutes per side. If broiling, spread them out on a large rimmed baking sheet. Broil until charred all over, 3 to 7 minutes per side. Transfer vegetables to a large bowl, cover with a plate or foil, and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill or broil corn until golden brown in spots, 3 to 4 minutes per side. Let cool, then use your heaviest knife to slice two of the cobs crosswise into 2-inch rounds. Cut kernels off remaining 3 ears and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium skillet over high heat, add oil. When hot but not smoking, add garlic and shallots and cook, sautéing, until well browned, 2 to 3 minutes. Transfer to a blender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a kettle of water to a boil. Place cilantro and parsley in a colander in the sink. Pour boiling water over herbs to wilt them, then immediately run cold water over them to cool them down. Press hard on herbs and squeeze to remove excess water. Transfer herbs to blender with shallots."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When chiles are cool enough to handle, remove skins, seeds and stems, and discard. Add peeled chiles and tomatillos to blender along with a large pinch of salt. Purée the mixture, adding a tablespoon or 2 of water if needed to make everything move, until it is thick but pourable. Taste and add more salt, if needed. It should be well seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pot or large skillet, bring the stock to a simmer. Add fish and seafood and cook until it’s just cooked through, 1 to 3 minutes. Stir 1 cup of chile purée into the seafood mixture and season aggressively with freshly squeezed lime juice from some of the wedges, and salt to taste. Taste and add more chile purée if you like. Stir in corn kernels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon stew into bowls and top with rounds of corn on the cob, more lime wedges, avocado, radishes, cabbage and cilantro leaves, with tostadas on the side if you like."}], "link": "https://cooking.nytimes.com/recipes/1019454-corn-seafood-stew-with-avocado-and-chiles"}