{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Pork Chops With Peanuts, Sesame and Cilantro", "description": "Smoke has been called the umami of barbecue, and these pork chops, which the chef Curtis Stone cooks over wood fire at his restaurant Gwen in Los Angeles, possess it in spades. Fish sauce and soy sauce provide the salt in the marinade; hoisin sauce and honey the sweetness. The peanuts and sesame seeds in the topping reinforce the nuttiness of the sesame oil in the marinade. You can use charcoal if wood is not an option, or cook over gas if necessary.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2018/07/04/dining/04woodrex3/merlin_139044039_04783c69-42a7-4f63-a7ef-42d628d3ee56-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, meat", "keywords": "cilantro, hoisin sauce, honey, peanut, pork, scallion, soy sauce, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 81}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1008, "unsaturatedFatContent": "40 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "3 grams", "proteinContent": "60 grams", "saturatedFatContent": "12 grams", "sodiumContent": "2540 milligrams", "sugarContent": "57 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2/3 cup honey", "1/2 cup hoisin sauce", "1/3 cup soy sauce", "1/3 cup sesame oil", "3 tablespoons red wine vinegar", "2 tablespoons chile oil", "2 tablespoons fish sauce", "2 garlic cloves, minced", "1 shallot, minced", "2 teaspoons freshly grated ginger", "4 thick pork rib chops (12 ounces each)", "1/4 cup chopped roasted peanuts", "1/4 cup thinly sliced scallions", "1/4 cup roughly chopped cilantro", "2 tablespoons toasted sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pork chops: Place all the ingredients except for the chops in a mixing bowl and whisk to blend."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the chops in a baking dish. Pour the marinade over the chops, turning them to coat both sides. Marinate the chops in the refrigerator for 4 hours, turning them over a couple of times so they marinate evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, build a wood fire in your grill with a hot zone for searing and a medium zone for cooking. (You can do the same with charcoal. If you’re using a gas grill, place a few hardwood chunks under the grate over one or two of the burners. Heat one burner on high heat and additional burners on medium heat, adjusting the heat as necessary.) Brush and oil the grill grate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the pork chops, allowing some but not all of the marinade to drip off first, until sizzling and browned on the outside and cooked to taste. If you like your pork with a blush of pink, cook until it reads 145 degrees in the center on an instant-read thermometer (about 3 minutes per side); if you like your pork cooked all the way through, look for the meat to reach 155 degrees in the center (about 4 minutes per side). Work mostly over the medium fire, moving chops to the hot fire at the end to sear the crust. Transfer the chops to a wire rack over a sheet pan and let rest for 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish and serve: Combine peanuts, scallions, cilantro and sesame seeds in a bowl and toss to mix. Arrange chops on a platter or individual plates. Sprinkle with peanut mixture and serve."}], "link": "https://cooking.nytimes.com/recipes/1019332-grilled-pork-chops-with-peanuts-sesame-and-cilantro"}