{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Sausage Parmesan With Garlicky Broccoli", "description": "Using quarter sheet pans (small rimmed baking pans measuring about 12 inches by 9 inches) allows you to cook your main course and side dish at the same time in the same oven, but without the mixing of flavors that would happen if you combined everything in one large pan. So the sausage juices can mingle with the tomato sauce and melted cheese, without compromising the roasted garlicky broccoli to serve alongside. You can use hot or sweet Italian sausages here, or a combination – as long as you can remember which is which for serving.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/02/28/dining/28appetite4/28appetite4-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, quick, weekday, sausages", "keywords": "broccoli, mozzarella, ricotta, sausage, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 631}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 517, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "5 grams", "proteinContent": "39 grams", "saturatedFatContent": "12 grams", "sodiumContent": "1211 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 tablespoons extra-virgin olive oil", "1 clove garlic, thinly sliced", "Large pinch crushed red pepper flakes", "1 (14-ounce) can diced tomatoes", "1 large sprig basil", "1/2 teaspoon kosher salt, more to taste", "1/8 teaspoon freshly ground black pepper", "1 small bunch broccoli (about 12 ounces), cut into 1-inch pieces", "2 tablespoons extra-virgin olive oil, more as needed", "1/4 teaspoon crushed red pepper flakes", "1/4 teaspoon kosher salt", "1 1/2 pounds hot or sweet Italian sausage, pricked all over with a fork", "1/3 cup fresh ricotta", "3 cloves garlic, 2 thinly sliced, 1 finely grated or minced", "Freshly ground black pepper", "1/2 cup shredded mozzarella", "2 tablespoons grated Parmesan cheese", "Chopped basil or parsley, for serving", "Italian bread, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Prepare sauce: In a large skillet over medium heat, heat oil until shimmering. Stir in garlic and red pepper flakes, and cook until fragrant, about 1 minute. Stir in tomatoes, basil sprig, salt and pepper, and bring to a brisk simmer. Simmer until sauce is very thick and most of the moisture is evaporated, 15 to 20 minutes. It should be thicker than the usual marinara sauce. Remove and discard basil sprig."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While sauce is cooking, toss broccoli with oil, red pepper flakes and salt on a quarter-size rimmed baking sheet (or use a regular sized rimmed baking sheet), and place in oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange sausage in a single layer on a quarter-size rimmed baking sheet or in a 9-by-13-inch roasting pan, and roast along with broccoli until golden on the bottom, about 15 minutes. Flip sausages over so browned sides are on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you flip the sausages, remove broccoli from oven and toss with sliced garlic. (Reserve grated garlic for later.) Drizzle broccoli with a little more oil. Return pan to oven and continue to roast broccoli and sausages until sausages are cooked through and broccoli is tender and browned, about 5 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, mix ricotta with grated garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When broccoli is done, remove from oven and tent with foil to keep warm. Top sausage with tomato sauce and dollops of ricotta, then drizzle with olive oil and grind pepper generously over top. Sprinkle on mozzarella and Parmesan. Bake until cheese is melted and bubbly, and the garlic is opaque, 3 to 5 minutes. Or if you prefer you can broil the cheese to melt it, 1 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve sausages, sauce and cheeses with broccoli on the side. Pass crusty bread for sopping up the tomato sauce."}]}