{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Scallops With Shredded Duck and Hollandaise Sauce", "description": "This is a hack of an old recipe from David McMillan and Fred Morin of the restaurant Joe Beef in Montreal, who match sea scallops with pulled pork and hollandaise sauce for a delicious dish. For reasons of habit, taste or happenstance, I started making it with duck instead. It seems like a lot of work — two species, a fancy sauce — but a lot of the cooking is unattended, and the sauce, you’ll see, is quite easy to pull off, at least the second time you try. The resulting meal is excessive and fantastic. It begs for a watercress salad with a bright, acidic dressing.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/12/24/magazine/24mag-eat1/24mag-24eat-t_CA0-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "seafood", "keywords": "duck, scallops", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 54}, "recipeIngredient": ["1 4- to 6-pound duck", "Kosher salt and freshly ground black pepper, to taste", "Barbecue sauce or hoisin sauce, to taste", "7 egg yolks, at room temperature", "1 cup unsalted butter", "Pinch cayenne, or to taste", "1 tablespoon lemon juice, or to taste", "Salt, to taste", "3 tablespoons unsalted butter", "1 pound sea scallops, patted dry", "Kosher salt, to taste", "1 tablespoon dry white vermouth or white wine", "1 tablespoon finely chopped parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the duck. Heat oven to 325. Remove giblets and neck from duck cavity, and discard or reserve for another use. Cut off excess fat from duck cavity. Place duck on a rack in a deep roasting pan, breast-side up, and season with salt and pepper. Then slide the pan into the oven and cook, undisturbed, for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove duck from oven, and use the point of a sharp knife to prick the skin of the bird, all over the breasts and thighs. Return bird to oven, and cook for 1 to 2 more hours, or until an instant-read thermometer inserted into the thigh measures around 155 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase oven temperature to 450, and cook until the duck is golden and crisp, 15 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove the roasting pan from the oven, and transfer the duck to a cutting board. (Let the fat in the pan cool, then store it, covered, in the refrigerator. It is an excellent medium for roasting potatoes.) Allow the duck to rest for a few minutes, then shred it, using two forks to pull the meat apart. Add your favorite barbecue sauce, to taste, or your favorite hoisin sauce, to taste. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the hollandaise. Put yolks into a small container into which you can fit an immersion blender, or into the jar of a blender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a small saucepan set over medium heat, then allow it to cool for a few minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Process the yolks for a couple of seconds, then continue to run the blender as you add the melted butter in a slow and careful stream, until you have a thin, emulsified sauce. Add the cayenne, lemon juice and salt to taste, blend again to combine and keep at room temperature until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the scallops. Place a large sauté pan or skillet over medium-high heat, and add to it 3 tablespoons of the butter. When it has melted and started to foam, place the scallops in the pan in a single layer, and season with a pinch or two of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook scallops without moving until the bottoms are golden brown, approximately 2 to 3 minutes, then turn them over, add the wine and cook an additional 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve the dish, spoon hollandaise on a plate or platter, then top with the scallops, brown-side up. Top scallops with shredded duck (you’ll have some leftover for sandwiches tomorrow), and drizzle with hollandaise."}], "link": "https://cooking.nytimes.com/recipes/1019117-sauteed-scallops-with-shredded-duck-and-hollandaise-sauce"}