{"@context": "http://schema.org", "@type": "Recipe", "name": "Gajak (Peanut-Sesame Brittle)", "description": "This recipe for gajak — an Indian treat that’s like a cross between peanut brittle and sesame candy, but with more nuanced flavor — comes from the North Carolina chef Cheetie Kumar, who always had it at Diwali and loves the way the flavors magically coalesce after the mixture sets for 45 minutes. Peanuts and sesame are found together in sweet recipes all through Northern India, and even appear as co-stars in savory dishes in the states of Gujarat and Maharashtra in chutneys and stuffed in eggplant. Jaggery adds some savory undertones that you can't get from regular sugar. You can find it online, at Indian grocery stores or some larger Asian supermarkets (look for blocks or balls, rather than granulated jaggery). It’s crucial to have your ingredients ready before starting; the gajak comes together fairly quickly but the sugar can burn if you don't watch it carefully. Cutting the brittle when it’s warm will yield pretty, uniform pieces, but it can also be broken once it has hardened into uneven, rustic chunks.", "author": {"@type": "Person", "name": "Brigid Washington"}, "image": "https://static01.nyt.com/images/2019/10/26/dining/31diwalirex1/31diwalirex1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 24 pieces", "recipeCuisine": "indian", "recipeCategory": "snack, candies", "keywords": "dessert, jaggery, peanut, sesame seeds", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "recipeIngredient": ["1 teaspoon ghee, plus more for greasing the pan and rolling pin", "9 ounces/255 grams jaggery, grated on the largest holes of a box grater (see note)", "1 1/3 cups/200 grams toasted, skinless unsalted peanuts, chopped coarsely", "1/2 cup/75 grams toasted white sesame seeds", "1/3 cup/50 grams untoasted white sesame seeds, ground into a powder using a spice grinder, small food processor or mortar and pestle", "Pinch of kosher salt", "Pinch of green cardamom powder (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease the back of a sheet pan and a rolling pin with ghee and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wide, heavy-bottomed skillet over medium-low heat for 1 to 2 minutes. Add the ghee, jaggery and 1 tablespoon water and stir well to combine. Cook, stirring occasionally, until the caramel starts to brown and reaches 300 degrees on an instant-read or candy thermometer, about 8 to 10 minutes; you're looking for the “hard crack” stage or the point where a drop of the caramel in cold water hardens into a crunchy toffee. Don’t rush this by turning the heat up too high: The caramel will burn in an instant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as you reach 300 degrees, remove pan from the heat and quickly fold in the peanuts (and any fine powder from chopping), both types of sesame seeds, the salt and cardamom, if using, and stir until well combined. Immediately turn the mass out onto the back of the sheet pan and roll to an even 1/4-inch thickness, keeping the sides as straight as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let set until cool enough to handle but still pliable, about 3 to 4 minutes, and slide onto a cutting board. Cut into 2-by-2-inch pieces. (Alternatively, when fully cool, the brittle can be broken into uneven, rustic chunks.) Let set completely until hard before serving. The flavors start to come together after it's been setting for 30 minutes, but it’s best after 45 minutes, or even 1 hour."}], "link": "https://cooking.nytimes.com/recipes/1019678-gajak-peanut-sesame-brittle"}