{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheese Fondue", "description": "Fondue is a classic, communal, Alpine dish, and one that's easy to put together. Grate the Gruyère, Appenzeller and Vacherin Fribourgeois in advance (either the day before, or in the morning), and wrap it up tightly so it doesn't dry out in the fridge. When you're about ready to eat, everything is ready to go: Melt the cheeses into a simmering slurry of white wine and cornstarch, stirring until the mixture is smooth, and season with ground pepper and a splash of kirsch. Cut bread, small boiled potatoes and cornichons make for a nice accompaniment, as do any other blanched vegetables that can hold up to a dip in hot cheese.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/10/26/dining/26cooking-fondue/26cooking-fondue-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "dinner, dips and spreads", "keywords": "appenzeller, baguette, cornichons, gruyère, kirschwasser, potato, vacherin fribourgeois, white wine, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 53}, "recipeIngredient": ["1 baguette", "1 pound small, bite-size potatoes", "1 garlic clove, halved", "1 cup dry white wine", "1 tablespoon cornstarch", "2 1/2 pounds Gruyère, coarsely grated", "8 ounces Appenzeller, coarsely grated", "8 ounces Vacherin Fribourgeois, coarsely grated (or cut into very small cubes if too soft to grate)", "1 tablespoon kirschwasser", "Freshly ground black pepper, to taste", "1 7 1/2-ounce jar cornichons, drained and transferred to a serving bowl", "1 egg, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the baguette into bite-size pieces, and put in a serving bowl. Scrub the potatoes, and transfer to a pot of water over medium heat; boil until tender, about 20 minutes. Drain, and set aside to cool in a serving bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re about 15 minutes from sitting down at the table, rub the inside of a fondue pot with the cut end of the garlic, then discard the garlic. Whisk together the wine and cornstarch, then pour through a fine-mesh strainer into the fondue pot. Put the pot over medium heat and continue to whisk until the liquid comes to a simmer, then turn down the heat a little and ditch the whisk for a wooden spoon. Add the Gruyère and Appenzeller, gently stirring to help it heat and melt evenly. When it’s almost smooth, turn the heat down to low, and add the Vacherin Fribourgeois. It might look alternately lumpy and oily, but keep stirring, and it will get smooth again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At this point, you may need to adjust the texture of the fondue to make it just right for dipping. If it’s too thick and resisting the wooden spoon, add a splash of white wine to thin it slightly. Season with a tablespoon of kirschwasser and a few grinds of black pepper, and stir well. Take the fondue pot to the table, where you can keep it warm over a lit Sterno, and stir it occasionally to keep the bottom from browning. (If it gets too hot and you have an adjustable lid for the flame, turn it down or off. If it cools too much and solidifies, carry it back to the kitchen and stir it over higher heat.) Serve with bread, potatoes and cornichons on the side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you get down to the bottom of the pot, if you’ve still got an appetite, crack an egg directly into the fondue pot, and let it cook over the last bits of browning cheese. When the white is about set but the yolk is still runny, turn off the heat below the pot, and dip in any remaining bread."}], "link": "https://cooking.nytimes.com/recipes/1019002-cheese-fondue"}