{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Eggplant and Buffalo Mozzarella Pizza", "description": "In Italy, when high-quality buffalo mozzarella is used to top a pizza, it’s often added after baking instead of before. The heat of the just-cooked pizza softens but doesn’t melt the cheese, which retains its milky, sweet flavor and stays supple instead of becoming stretchy. Here, the cheese crowns a pizza topped with tomato, roasted eggplant, chile flakes and fresh basil leaves. If you can’t get good buffalo mozzarella, substitute dollops of fresh ricotta. Or, you could experiment with burrata, draining it first. Save the cream, mix it with olive oil and salt, then use it to top ripe tomatoes instead of dressing. And if you are in a rush, substitute store-bought pizza dough.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/08/01/dining/01Apperex/merlin_141638667_cacfad71-c247-42b0-958d-74c0a60b1331-articleLarge.jpg", "totalTime": "PT19H30M", "recipeYield": "4 12-inch pizzas", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, pizza and calzones", "keywords": "basil, buffalo mozzarella, eggplant, main course, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 122}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 857, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "128 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "12 grams", "proteinContent": "31 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1323 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 teaspoons active dry yeast", "1 3/4 cup/420 milliliters warm, not hot, water", "2 teaspoons extra-virgin olive oil, plus more for the bowl", "4 1/2 cups/575 grams all-purpose flour", "2 teaspoons kosher salt", "2 pounds eggplant, cut into 1-inch cubes (2 medium, or 1 large)", "Extra-virgin olive oil, as needed", "Kosher salt, as needed", "Black pepper, as needed", "1/2 cup canned plum tomatoes, puréed", "4 to 8 garlic cloves, thinly sliced, to taste", "Red-pepper flakes, as needed", "8 ounces fresh buffalo mozzarella", "Basil leaves, torn into pieces", "Flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Mix the yeast, warm water and olive oil in the bowl of an electric stand mixer or food processor, and let the mixture sit until the yeast is foamy, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add in flour and salt, and using the dough hook or food processor blade, beat or pulse it until a smooth, slightly elastic dough forms, 2 to 3 minutes. Lightly coat a bowl with olive oil, place dough in the bowl, and turn the dough to coat it with oil. Cover the bowl loosely with a kitchen towel or plastic wrap, place in the refrigerator and let it sit overnight. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough in quarters, and shape each piece into a tight, compact ball. Place the dough balls on a lightly oiled baking sheet or plate, loosely cover with plastic wrap and let them rise in the refrigerator another 1 to 2 hours (or up to 6 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake the pizzas, place racks in the top third and bottom third of the oven. Put a pizza stone on top rack, and heat oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the toppings: On a rimmed baking sheet, toss the eggplant generously with oil, salt and pepper. Roast eggplant on the bottom rack until caramelized and tender, 40 to 45 minutes, tossing halfway through. Remove from the oven and raise the oven heat to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a piece of parchment paper, stretch out one of the balls of dough to a 12-inch round. Spread 2 tablespoons tomato purée on top, leaving a 1/2-inch border. Scatter on 1/4 of the sliced garlic, a large pinch of red-pepper flakes and drizzle with oil to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange 1/4 of the roasted eggplant on top. Use a pizza peel or cookie sheet to slide the parchment onto the pizza stone. Bake until crispy and golden on the top and bottom, 7 to 10 minutes. Use tongs to pull the pizza out of the oven and onto a wire rack to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately top with chunks of cheese, pulling it apart with your hands into bite-size pieces. Top with basil, more oil to taste and flaky sea salt. Repeat with the remaining dough and toppings."}], "link": "https://cooking.nytimes.com/recipes/1019436-roasted-eggplant-and-buffalo-mozzarella-pizza"}