{"@context": "http://schema.org", "@type": "Recipe", "name": "Mackerel With Pistachio and Cardamom Salsa", "description": "This is a summer starter that works just as well as a main course, served with some herb-filled rice or fried potato slices. Both the cream and the cardamom salsa can be made in advance so you can have this dish on the table in as long as it takes to cook the fish, no longer than five minutes. If you choose to do this, just make sure to add the lime juice to the salsa at the very last minute to prevent the herbs from discoloring.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2018/05/16/dining/16ottorex2/merlin_137834646_e96c852e-90e9-4048-b42b-c7c66aded433-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings as a starter, or 2 as a main course", "recipeCuisine": "", "recipeCategory": "dinner, seafood", "keywords": "cardamom, ginger, mackerel, pistachio, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 29}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 493, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "2 grams", "proteinContent": "25 grams", "saturatedFatContent": "9 grams", "sodiumContent": "450 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1/2 teaspoon ground cardamom", "Salt", "4 mackerel fillets (from 2 roughly 1-pound/500-gram fish), skin on and pin bones removed", "1 fat piece of ginger, 1-inch or 3-centimeters long, peeled", "2 tablespoons/30 grams heavy cream (double cream)", "2 tablespoons/30 grams sour cream (soured cream)", "3/4 cup/30 grams loosely packed finely chopped cilantro leaves (coriander leaves)", "1/2 cup/20 grams loosely packed finely chopped basil leaves", "Heaping 1/3 cup/50 grams pistachios, lightly toasted and roughly chopped", "Finely grated zest and juice of 1 to 2 limes (for 1 teaspoon zest and 2 tablespoons juice), plus 1 additional lime cut into wedges, for serving", "1 green chile pepper (such as serrano), seeded and finely chopped", "4 1/2 tablespoons/65 milliliters sunflower oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix about 1/8 teaspoon cardamom with a pinch of salt. Rub on both sides of the fish and set aside until ready to fry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely grate the ginger and then press the pulp through a sieve or a small strainer (with a bowl underneath): You should get 1 teaspoon of juice. Discard the pulp and set the liquid aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a small whisk to whip the heavy cream (double cream) until stiff. Switch to using a spatula and then fold in the sour cream (soured cream), ginger juice and a small pinch of salt so you have a soft cream. Keep in the fridge until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the herbs with pistachios, remaining cardamom, the lime zest and juice, the chile pepper, 2 1/2 tablespoons oil and 1/8 teaspoon salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, add the remaining 2 tablespoons oil to a large frying pan (nonstick works nicely) and place over high heat. Once very hot, add the mackerel fillets, skin-side down (the skin should sizzle) and fry for 2 minutes. Press the fillets down with a spatula as they cook to prevent the skin from curling up. Once the skin is crisp and golden brown, turn the fillets over and fry for another minute, until golden brown. (You can do this in two batches, if necessary.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mackerel to 4 individual plates. Spoon a quarter each of the ginger cream and the cardamom salsa next to each fillet and serve hot, with a wedge of lime."}]}