{"@context": "http://schema.org", "@type": "Recipe", "name": "Bay Leaf Chicken With Orange Parsley Salad", "description": "In this quick-cooking dinner, boneless chicken thighs are marinated with bay leaves, mustard seeds, orange zest and Worcestershire sauce, and roasted at high heat until golden-edged and juicy. Then, just before serving, it all gets topped with an herb salad flecked with sweet oranges. It’s light, fresh and very savory. You can substitute boneless chicken breasts instead, just halve them crosswise before marinating, and start checking them after 12 minutes of roasting.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/09/12/dining/12apperex1/12apperex1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry", "keywords": "bay leaves, chicken thighs, orange, parsley, worcestershire sauce, low-carb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 205}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 335, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "40 grams", "saturatedFatContent": "3 grams", "sodiumContent": "628 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 fresh bay leaves, torn (or use 3 dried bay leaves)", "2 fat garlic cloves, finely grated or minced", "2 tablespoons extra-virgin olive oil, plus more as needed", "1 teaspoon kosher salt", "1 teaspoon brown mustard seeds", "1 teaspoon finely grated orange zest (reserve orange for salad)", "1 teaspoon Worcestershire sauce", "1/2 teaspoon ground cumin", "1/4 teaspoon ground coriander", "1 3/4 pounds boneless, skinless chicken thighs", "1 orange", "1 bunch parsley, leaves only", "2 scallions, thinly sliced", "1 tablespoon rice-wine vinegar, plus more to taste", "1 small garlic clove, finely grated or minced", "1/2 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mix together bay leaves, garlic, oil, salt, mustard seeds, orange zest, Worcestershire sauce, cumin and coriander. Add chicken and turn to coat, then cover and marinate in the refrigerator for at least 1 hour and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Arrange chicken in a single layer on a rimmed baking sheet, spooning marinade on top. Drizzle with more oil, then roast until chicken is cooked through, 15 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the salad: Cut off top and bottom of the orange so it can stand on a flat side, then cut away the white pith and rind to expose the fruit. Slice away the segments away from the membrane, then chop segments into 1/2-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine orange pieces and any juices from the cutting board, parsley and scallions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together vinegar, garlic and salt. When chicken is done, transfer to a serving plate and scrape all the chicken drippings from pan into the vinegar mixture. Whisk together to combine, then drizzle vinegar over oranges and greens. Toss to combine and add more vinegar and salt to taste. Serve chicken topped with orange-greens mixture."}], "link": "https://cooking.nytimes.com/recipes/1019535-bay-leaf-chicken-with-orange-parsley-salad"}