{"@context": "http://schema.org", "@type": "Recipe", "name": "Polish Cottage Cheese Dip (Gzik)", "description": "This is a simple dip with infinite possibilities. The classic version, called gzik, comes from the Wielkopolska province in Poland. It’s built from a farmer’s cheese called twarog, which is essentially a dry version of what Americans know as cottage cheese. The cheese, which comes molded into a thick disc, is mashed with a fork, then loosened with a few tablespoons (or more, depending on the dryness of the cheese) of yogurt or cream. Radishes and some members of the allium family, most often chives or onions, add flavor; dill or other herbs sometimes make an appearance. The classic way to eat it is on boiled or baked potatoes still in their jackets, but gzik on buttered rye bread is a popular breakfast dish. Although you can use any style of cottage cheese for this recipe, smaller curds work better than large because the dip should be slightly smoother than cottage cheese.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2018/06/27/dining/27cottagerex/27cottagerex-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "About 2 cups", "recipeCuisine": "eastern european", "recipeCategory": "easy, quick, snack, dips and spreads", "keywords": "chives, cottage cheese, radish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 177}, "recipeIngredient": ["1 1/2 cups small-curd cottage cheese", "1 to 3 tablespoons Greek-style yogurt or sour cream, if needed (add if the cottage cheese is not already creamy enough)", "1/2 cup finely chopped radishes, the spicier the better", "1/8 cup finely chopped chives", "1/4 teaspoon salt", "A few grinds of black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mash the cottage cheese in a bowl using a fork, adding a tablespoon or two of yogurt or sour cream, if needed, to create a slightly smoother texture. Mix in the remaining ingredients."}], "link": "https://cooking.nytimes.com/recipes/1019372-polish-cottage-cheese-dip-gzik"}