{"@context": "http://schema.org", "@type": "Recipe", "name": "Mango Pie", "description": "When Hrishikesh Hirway was a kid, his parents, who immigrated to the United States from Maharashtra, in western India, began hosting Thanksgiving. The meal soon evolved into a hybrid of a traditional Thanksgiving and an Indian potluck. “Out of that cultural mash-up, my mom started making this mango pie,” he said. She’d gotten the idea from other Indian aunties in the States, but their versions weren’t as good. “They weren’t making it with the best kind of mango,” Hirway explained. “The Alphonsos have a stronger, more intense flavor.” That Alphonso flavor shines as brilliantly as the pie’s bright filling, made tangy and rich with the addition of cream cheese and whipped cream. And the salty, crumbly graham cracker crust is the perfect foundation for the golden cloud of custard that sits atop it. It’s so satisfying that you'll catch yourself cutting sliver after mouthwatering sliver of pie.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2019/02/10/magazine/10mag-eat-slide-SXXG/10mag-eat-slide-SXXG-articleLarge.png", "totalTime": "PT5H50M", "recipeYield": "2 9-inch pies", "recipeCuisine": "indian", "recipeCategory": "pies and tarts", "keywords": "cardamom, gelatin, graham cracker crumbs, mango purée, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 746}, "recipeIngredient": ["2 1/2 cups (280 grams) finely ground graham-cracker crumbs", "1/3 cup plus 1 tablespoon granulated sugar", "1/4 teaspoon ground cardamom", "1 large pinch sea salt", "9 tablespoons (128 grams) unsalted butter, melted", "3/4 cup cold water", "1/2 cup granulated sugar", "2 tablespoons plus 1/4 teaspoon powdered gelatin (2 1/2 packages at 2 1/2 teaspoons per pack)", "1/2 cup heavy whipping cream, chilled", "4 ounces cream cheese, at room temperature", "1 30-ounce can Alphonso mango purée (3 1/4 cups)", "1 large pinch sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir crumbs, sugar, cardamom and salt together in a medium bowl. Add butter, and stir with a fork until evenly combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour half the crumb mixture into a 9-inch round metal pie pan, and spread evenly. Press down with fingers, a metal measuring cup or a second pie pan to compact the crumbs as much as possible across the bottom and up the sides of the pan into an even crust. (The more compressed the crust, the less it will crumble.) Repeat to form the remaining crumb mixture into a crust in a second pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325. Transfer both crusts to freezer, and chill for 15 minutes. Bake until golden brown, about 12 minutes. Transfer to a wire rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 3/4 cup cold water in a large bowl. In a small bowl, stir together 1/4 cup sugar with the gelatin; sprinkle mixture evenly over the surface of the cold water. Let sit a few minutes to bloom."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the meantime, whip the cream and remaining 1/4 cup sugar together until medium-stiff peaks form. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan over medium-low heat, warm 1 cup of the mango purée to body temperature (stir to make sure you are just warming it and not bringing it to a boil). Pour warmed mango purée over gelatin mixture, and whisk until well combined. Gelatin should dissolve into mango completely. Gradually whisk in remaining mango purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a rubber spatula to beat the cream cheese in a medium bowl until it is soft and smooth, then add to mango mixture along with a large pinch of sea salt. Use an immersion blender to blend until completely smooth, tipping the bowl to make sure you’ve incorporated everything well. Gently tap the bowl on the counter once or twice to pop any air bubbles. Use the spatula to gently fold about 1/4 of the mango mixture into the whipped cream, then fold cream into the larger amount of mixture until no streaks remain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide custard between cooled crusts. Use a rubber spatula to smooth out the filling. Refrigerate 5 hours or overnight until firm and chilled. Serve chilled."}], "link": "https://cooking.nytimes.com/recipes/1019974-mango-pie"}