{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Brownie With Chocolate Ganache Frosting", "description": "This skillet brownie has it all: It’s chewy at the edges, and gooey in the center. (For maximum gooeyness, err on the side of underbaking slightly.) Topped with more chocolate and a sprinkling of flaky sea salt, this easy recipe is a chocolate lover’s dream.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2018/09/26/dining/ed-brownie-skillet-cake/ed-brownie-skillet-cake-articleLarge-v2.jpg", "totalTime": "PT50M", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "cakes, cookies and bars", "keywords": "bittersweet chocolate, heavy cream, light brown sugar, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 363}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 397, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "11 grams", "sodiumContent": "246 milligrams", "sugarContent": "42 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 ounces/170 grams finely chopped bittersweet chocolate", "4 tablespoons/55 grams unsalted butter, cut into pieces, plus more for the pan", "1/2 cup/120 milliliters neutral oil, such as vegetable or coconut", "1 cup/220 grams light brown sugar", "1/2 cup/100 grams granulated sugar", "1 1/3 cup/170 grams all-purpose flour", "1/2 teaspoon baking powder", "1/2 teaspoon fine sea salt", "3 large eggs", "1 1/2 teaspoons vanilla extract", "6 ounces/170 grams finely chopped bittersweet chocolate", "3/4 cup/180 milliliters heavy cream", "Flaky sea salt, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Lightly butter a 10-inch oven-safe skillet. Fill a medium pot with about 1 1/2 inches of water, and bring to a simmer. Place a medium bowl over the pot and add the chocolate, butter and oil. Heat, stirring frequently, until the chocolate and butter are melted. (Alternatively, place the chocolate, butter and oil in microwave-safe bowl, and microwave for 30 seconds, then stir. Continue to microwave in 15-second bursts, stirring after each, until the butter and chocolate are melted.) Remove the bowl from the heat and whisk in the light brown sugar and granulated sugar. (The mixture will be grainy.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together flour, baking powder and salt and set aside. To the chocolate mixture, add the eggs one at a time, mixing well after each addition. Whisk in the vanilla extract. Add the flour mixture and mix until just incorporated. Pour the batter into the prepared skillet and spread into an even layer using a spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the brownie until the surface appears set: A toothpick inserted into the center should come out with a few moist crumbs attached, 30 to 33 minutes. Let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the brownie cools, make the ganache: Place the chocolate in a medium, heat-safe bowl. Bring the cream to a simmer in a small pot over medium heat. Pour the hot cream over the chocolate and let it stand undisturbed for 15 seconds. Stir the ganache until the chocolate is melted and the mixture is smooth. Let cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the brownie is cool, spread the ganache onto the brownie in an even layer. (It will have thickened slightly. If it’s not thick enough, you can refrigerate it for 10 minutes or so; if it thickens too much, you can microwave it in 10-second bursts in a microwave-safe bowl until it’s spreadable again.) Sprinkle with flaky sea salt."}]}