{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoky Braised Kale With Tomato", "description": "This is a hack of a preparation the chef Travis Lett used at his restaurant Gjelina in Venice, Calif., as a pairing for a half-roasted chicken. With its deeply caramelized base of tomato paste and smoked paprika, the kale melts into velvety excellence that can stand on its own with a pile of rice or a baked potato. But it really shines brightly as a supporting player in a feast of poultry, pork or beef. Do two onions seem too many for you? Use one. This is a recipe really to make your own.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/10/26/dining/26COOKING-KALE2/26COOKING-KALE2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "kale, tomato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 325}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 162, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "6 grams", "proteinContent": "8 grams", "saturatedFatContent": "1 gram", "sodiumContent": "581 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup extra-virgin olive oil", "2 Spanish onions, peeled and diced", "8 cloves garlic, peeled and thinly sliced", "1/4 cup tomato paste", "1 teaspoon hot smoked paprika (pimentón)", "Kosher salt and freshly ground black pepper, to taste", "3 cups turkey or chicken stock, ideally homemade or low-sodium", "1 tablespoon red wine vinegar, plus more to taste", "4 (3/4-pound) bunches washed kale (any kind), thick stems discarded or cut into thin strips, leaves cut into thick strips (about 16 packed cups total)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large, heavy-bottomed, high-sided pot or Dutch oven over medium-high heat and add olive oil. When it shimmers, add  onions and garlic and cook until they soften and begin to turn translucent, about 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomato paste and smoked paprika, reduce heat to medium, and cook, stirring frequently, until the paste begins to caramelize, about 5 to 7 minutes. Season with salt and pepper, then add stock and vinegar, and allow to come to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half the kale, cover, and cook for a minute or two, until it wilts. Repeat with remaining kale. Stir to incorporate the onion mixture into the soft kale and simmer until tender, 20 to 30 minutes, partly covered. Season to taste with salt and pepper, drizzle with a little more vinegar, and serve."}]}