{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Carrots With Cilantro Yogurt and Peanuts", "description": "Carrot takes center stage in this easy-to-assemble side dish. Tangy Greek yogurt is combined with cilantro, coriander and lime juice to create a creamy bed for carrots that have been roasted until just caramelized. Salted peanuts finish the dish with a nice little crunch. If you can find rainbow carrots, this dish becomes even more vivid, but straightforward orange ones work just as nicely.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/09/28/dining/ch-carrots/ch-carrots-articleLarge-v2.jpg", "totalTime": "PT35M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "carrot, chili flakes, cilantro, coriander, greek yogurt, lime juice, peanut, scallion, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 324}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 167, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "412 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds medium carrots, peeled and halved lengthwise (quartered lengthwise if large)", "2 tablespoons olive oil", "Kosher salt and black pepper", "1 teaspoon ground coriander", "1 cup full-fat Greek yogurt", "1/2 cup finely chopped cilantro", "1/4 teaspoon ground coriander", "1 tablespoon lime juice, (about 1/2 lime), plus more for serving (optional)", "Pinch of Aleppo pepper or red-pepper flakes (optional)", "Kosher salt", "1/4 cup roughly chopped roasted, salted peanuts", "3 tablespoons scallions, thinly sliced, green parts only", "Flaky salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Make the carrots: In a large bowl, toss the carrots with the olive oil. Season well with salt and pepper, add the dried coriander, and toss the mixture to evenly coat. Place the carrots cut-side down on a rimmed baking sheet and roast, flipping about halfway through, until the carrots are golden brown and tender, about 25 to 30 minutes. Allow to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the carrots roast, make the cilantro yogurt: In a medium bowl, combine the Greek yogurt, cilantro, ground coriander, lime juice and Aleppo pepper or red-pepper flakes, if using. Stir well to combine and salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the cilantro yogurt on the bottom of a plate or platter and arrange roasted carrots on top. Scatter peanuts and scallions on top, and finish with flaky salt and a squeeze of lime juice, if using."}]}