{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Coconut Balls", "description": "During the traditional Mimouna celebration at the end of Passover, many Israeli Jews lay out an elaborate table with sweets. Because dietary rules during the holiday ban flour from the house (including frozen cookies that contain it), the treats are usually flourless. Here, ground coconut turns the texture of these cookies into a soft and pleasantly cloudlike.", "author": {"@type": "Person", "name": "Ron Lieber"}, "image": "https://static01.nyt.com/images/2018/04/04/dining/04mimounarex1/merlin_135727149_b80599e4-3060-4136-9060-62b7fd9ae857-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "About 2 dozen", "recipeCuisine": "moroccan", "recipeCategory": "easy, cookies and bars", "keywords": "apricot jam, coconut, dessert, gluten-free, kosher", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 71}, "recipeIngredient": ["3 cups/255 grams unsweetened shredded coconut, preferably Bob’s Red Mill", "3 tablespoons apricot, raspberry or orange jam, or maple syrup or honey", "1/2 teaspoon baking powder", "3 egg yolks", "1/4 to 1/2 cup/31 to 62 grams confectioners’ sugar", "1/4 cup apricot jam", "Ground pistachios, slivered almonds or rainbow sprinkles"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cookies: Heat oven to 325 degrees. In a medium bowl, add the coconut, jam or syrup or honey, baking powder and egg yolks and beat with an electric mixer on medium speed until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze the mixture together to form small balls, about 1 inch wide, and roll them in confectioners’ sugar to fully coat. Transfer the balls to a parchment-lined baking sheet lightly coated with cooking spray, spacing them 1 inch apart. Bake for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the glaze: In a small pot over medium-low heat, whisk together the apricot jam and 1/4 cup water until warm. Remove from heat and pour into a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the balls cool completely on the sheet pan, then dip one side into the glaze. Return to the pan, glaze side facing up, and sprinkle immediately with the pistachios, almonds, sprinkles or anything else you wish."}]}