{"@context": "http://schema.org", "@type": "Recipe", "name": "Thanksgiving Leftovers Enchilada Pie", "description": "This recipe was developed for a special kids' edition of The New York Times, but we've found that people of all ages love it. It sounds a little strange, but we promise you, it’s surprisingly delicious. It’s easy to make, and anything you don't already have on had can be picked up from the corner store. We used leftover turkey, <a href=\"https://cooking.nytimes.com/recipes/6165-braised-greens\">braised greens</a> and <a href=\"https://cooking.nytimes.com/recipes/6278-maple-whipped-sweet-potatoes\">mashed sweet potatoes</a>, but feel free to experiment with savory dishes like sautéed brussels sprouts, cornbread stuffing or mashed potatoes. Top your slice with <a href=\"https://cooking.nytimes.com/recipes/1019048-cranberry-sauce-salsa\">cranberry sauce salsa</a>, a dollop of sour cream and a scattering of roasted pumpkin seeds. (We used a mix of Velveeta, Cheddar and Monterey Jack cheeses because the Velveeta helps prevent clumping, but, if processed cheese bothers you, leave it out and add a half-cup more Cheddar or Monterey Jack.)", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2017/11/09/dining/09COOKING-ENCHILADA-PIE/09COOKING-ENCHILADA-PIE-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, easy, lunch, burritos and nachos, casseroles", "keywords": "fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 321}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 457, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "4 grams", "proteinContent": "28 grams", "saturatedFatContent": "11 grams", "sodiumContent": "800 milligrams", "sugarContent": "6 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 tablespoons olive oil, plus more for greasing the pie plate (or nonstick cooking spray)", "¼ cup chopped onion", "½ teaspoon cumin", "2 cups leftover cooked turkey, shredded", "Kosher salt and fresh ground pepper", "8 5 ½-inch soft corn tortillas", "1 (10-ounce) can red enchilada sauce", "2 cups Thanksgiving leftovers (used singly or a combination of sweet potatoes, sautéed greens or corn, or canned black beans, drained)", "1 ½ cups shredded Cheddar cheese or any combination of shredded Cheddar and Monterey Jack", "1/2 cup (4 ounces) Velveeta cheese, cut into ½-inch cubes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Lightly oil or spray with non-stick cooking spray a 9-inch pie plate. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large non-stick skillet over medium heat. Add the onion and cumin and cook, stirring often, until the onion is softened, about 5 minutes. Mix in the turkey and heat through. Season with salt and pepper, to taste. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using scissors, cut corn tortillas in quarters. Set aside on a plate. Combine shredded cheese and Velveeta cubes in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour enchilada sauce into a low-sided bowl. Briefly dip each tortilla piece into the sauce, being sure to cover it completely. Cover the bottom of the pie plate with several coated tortilla pieces. It’s O.K. if you can see the bottom of the plate in some places, but try to nestle the tortillas right up to the edge of the pie plate to keep the layers separate and to ensure a clean cut."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Layer half the turkey and onion mixture, half the leftovers or beans and a third of the cheese mixture. Add a second layer of tortillas, the remaining turkey, remaining leftovers and another third of the cheese. Top with a final layer of coated tortillas. Pour any remaining enchilada sauce over the top and sprinkle with remaining cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 25 to 30 minutes. Finish off in the broiler for 1 to 2 minutes, if desired, for a browned and bubbly top. Allow to cool for about 10 minutes before serving, using a serrated knife to cut. Serve with any of the optional toppings or leftover cranberry sauce salsa."}]}