{"@context": "http://schema.org", "@type": "Recipe", "name": "Twice-Baked Potatoes", "description": "At its simplest, a twice-baked potato is creamy, cheesy mashed potatoes cradled in crisp, salty skin. That’s the recipe you see here: comforting, satisfying and pretty much ideal. But if you dream of other flavor combinations, like bacon, scallions and sour cream; blue cheese and chives; or <a href=\"https://cooking.nytimes.com/recipes/1016870-twice-baked-potatoes-with-cauliflower-and-cheese\">cauliflower and Parmesan,</a> just follow the recipe below and stir in any additions (reserving some for garnish) after the dairy in Step 3. Shower the top with more grated cheese if you like, then bake, garnish and dig in.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2018/12/28/dining/as-twice-baked-potatoes/as-twice-baked-potatoes-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, weekday, vegetables", "keywords": "cheddar, potato, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 342}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 590, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "70 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "5 grams", "proteinContent": "13 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1081 milligrams", "sugarContent": "5 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 tablespoons unsalted butter, cubed and softened", "4 large russet potatoes", "2 tablespoons canola or other neutral oil", "Kosher salt", "1/2 cup whole milk", "1/2 cup sour cream", "1/2 cup grated Cheddar cheese (about 2 ounces)", "Black pepper", "2 tablespoons chopped chives (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Position racks in the top and middle of the oven, and heat oven to 400 degrees. Take the butter out of the refrigerator to soften. Scrub the potatoes clean and pat them dry. Poke holes all over them with a fork. In a large bowl, toss them with the oil and 1/2 teaspoon salt. Place the potatoes directly on the top rack, and place a baking sheet or a piece of foil on the middle rack to catch drips. Bake for about 1 hour, until the skin is crisp and potatoes offer no resistance when a knife is inserted in their centers. Remove from the oven and let sit until cool enough to handle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the top third lengthwise off the potatoes. Use a spoon to scoop out the flesh, leaving 1/4-inch border of potato on the skin, and transfer the flesh to a medium bowl. Scrape the potato tops of all flesh, and add the flesh to the bowl. Place the bottoms on a parchment-lined baking sheet. (Snack on the tops — chef's treat — or discard.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mash the potato flesh with a fork or potato masher. Add the butter, and stir until smooth (try not to overwork). Add the milk, sour cream and cheese and stir to combine. (If you want the filling softer, add more milk.) Season generously with salt and pepper. Stir in the chives, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mound each potato skin with a quarter of the filling. Bake the potatoes until warmed through, about 10 minutes. Serve immediately."}]}