{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin-Ginger Oat Scones", "description": "Pumpkin purée softens oats in this hearty mix. Together, they give scones a lasting richness that doesn’t dry out, while more oats sprinkled on top give the crust a nutty crunch. Bits of candied ginger dot the scones, each delivering a hit of chewy heat that livens up pumpkin’s mild sweetness.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2018/10/23/dining/gk-oat-scones/gk-oat-scones-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "12 scones", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 224}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 247, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "5 grams", "sodiumContent": "181 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/4 cups/290 grams all-purpose flour, plus more for sprinkling", "1/2 cup/50 grams old-fashioned oats, plus more for sprinkling", "1/2 cup/100 grams sugar", "1 tablespoon baking powder", "1 teaspoon salt", "2 teaspoons pumpkin pie spice", "1/2 cup/115 grams cold unsalted butter, cut into thin slices", "3/4 cup/90 grams finely chopped crystallized ginger", "3/4 cup/170 grams canned pumpkin purée", "2 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk the flour, oats, sugar, baking powder, salt and spice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter and toss to coat with the dry ingredients. Using your fingers or a pastry cutter, press and cut in the butter until coarse crumbs form and some peanut-size pieces remain. Toss in the ginger until evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the pumpkin and eggs until smooth. Add to the dry ingredients and mix with a fork until no dry bits remain and mixture forms a mass."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large baking sheet with parchment paper and lightly flour. Divide the dough mass into two even pieces in the bowl and dump each piece onto the prepared sheet on opposite sides. Dampen your hands and press each piece into 3/4-inch-thick rounds (about 6 inches in diameter). Refrigerate or freeze until stiff."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. When the oven is ready, take out the dough and cut each round into 6 even wedges using a sharp knife or bench scraper. Nudge the wedges about 1 inch apart. Sprinkle the tops with oats."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden brown and firm when gently pressed, 20 to 22 minutes. To see if they’re cooked through, tear one open immediately to make sure there’s no wetness in the center. If there is, return the pan to the oven for a few minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool on the pan on a rack for 5 minutes. Serve warm or room temperature, wrapped in a napkin to eat out of hand."}]}