{"@context": "http://schema.org", "@type": "Recipe", "name": "Sausages With Apples and Onions", "description": "There are lots of kinds of wurst, or sausage: bratwurst, bockwurst, knackwurst, weisswurst (similar to the French boudin blanc). Bratwurst is popular the United States, and there are some new high-quality packaged supermarket brands now available, or look for other types from a butcher shop. But let’s face it: Nearly any kind of sausage will taste great paired with caramelized onions and apples fried in butter.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/10/24/dining/24kitchenrex1/24kitchenrex1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, sausages", "keywords": "allspice, apple, caraway seeds, sausage, thyme, fall, winter, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 176}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 625, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "6 grams", "proteinContent": "20 grams", "saturatedFatContent": "18 grams", "sodiumContent": "1126 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons unsalted butter", "3 large yellow onions, cut in 1/4-inch half-moons (about 4 cups)", "Salt and pepper", "1 bay leaf", "2 cloves", "3 allspice berries", "1/2 teaspoon caraway seeds", "1 thyme sprig", "4 large tart apples, peeled and cut into 1/2-inch slices (about 4 cups)", "8 bratwurst or other sausages, about 3 to 4 ounces each", "Parsley sprigs, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 tablespoons butter in a large cast-iron skillet or wide, heavy-bottomed pot over medium-high heat. Add onions, season generously with salt and pepper and stir to coat with butter. Add bay leaf, cloves, allspice, caraway and thyme. Cook, stirring frequently, until soft and nicely browned, about 10 minutes. Reduce heat as necessary to keep onions from browning too quickly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove onions from pan and arrange on a platter. Put 2 more tablespoons butter in pan, and add apples. Raise heat to medium-high and brown apples on both sides, using a spatula to turn them, 2 to 3 minutes per side. Remove apples and arrange them on top of onions. Keep platter warm in a low oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Keep stovetop heat at medium and place sausages in pan in one layer. Prick each sausage in several places with the tip of a sharp paring knife or toothpick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let sausages brown slowly on one side (check their progress by turning them over with a fork or tongs) for 6 to 8 minutes. Lower the temperature if they're browning too quickly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn sausages over, and add 1/2 cup water to the pan. Let water evaporate completely, then continue to let sausages brown slowly for about 5 more minutes. (Cooking sausages at too high a temperature will cause them to burst; err on the cooler side.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place cooked sausages in the center of the onion-apple mixture on platter. Garnish with parsley, if desired."}], "link": "https://cooking.nytimes.com/recipes/1019661-sausages-with-apples-and-onions"}