{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork-Shoulder Steaks With Hot Pepper Dip", "description": "This is pork barbecue as you’ve probably never experienced it, with the shoulder cut crosswise into pencil-thin steaks and grilled directly over hickory embers. Note we're saying grilled, not barbecued (smoked), the way most pork shoulder is cooked in the South. But it’s not complete until it's dipped in a fiery bath of vinegar, melted lard or butter, and cayenne. And no one makes it better than Anita Hamilton Bartlett at R&S Barbecue in Tompkinsville, Ky. To be strictly authentic, you’d grill over a wood fire; barring that, add hickory or other hardwood chunks or chips to your charcoal fire, or place wood chunks under the grate and over the burners of your gas grill. An added advantage: this is “barbecue” you can cook in 15 minutes.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2018/10/24/dining/24Porkrex1/merlin_145120956_4b8cdee1-9c46-4665-a190-d36f497968cf-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "southern", "recipeCategory": "steaks and chops", "keywords": "lard, pork shoulder steaks, white vinegar, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "recipeIngredient": ["1 quart distilled white vinegar", "1/2 pound salted butter (2 sticks)", "1/2 pound lard (or butter)", "2 tablespoons kosher salt, or to taste", "2 tablespoons cayenne pepper (3 if you like your dip really fiery)", "2 tablespoons ground black pepper (3 if you like your dip really fiery)", "1 tablespoon yellow mustard (optional)", "1 tablespoon ketchup (optional)", "Vegetable oil, for the grill", "2 pounds bone-in pork-shoulder steaks (3/4-inch thick)", "Kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dip: Place the ingredients in a deep pot along with 1/2 cup water and bring to a boil over medium-high heat until the butter and lard are melted, whisking to dissolve the salt, about 10 minutes. Reduce heat and gently simmer the sauce until richly flavored, about 15 minutes. Correct the seasoning, adding salt, cayenne or black pepper to taste. Transfer 2 cups of the dip to a baking dish large enough to fit the steaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the pork: Set up your grill for direct grilling (see note below), and heat to high. Brush or scrape the grill grate clean, and oil it with a tightly folded paper towel dipped in vegetable oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immerse the steaks in the dip in the baking dish, turning with tongs to coat both sides. Season with salt and pepper. Arrange the steaks on the grill grate. Grill until browned on both sides and cooked to taste, 3 to 5 minutes per side for medium. Baste the steaks with more dip as they grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dunk the steaks in the pot (not the baking dish) of dip before serving. For extra excitement, ladle more dip into small bowls or cups for serving on the side."}]}