{"@context": "http://schema.org", "@type": "Recipe", "name": "Classic Lasagna", "description": "While not a 30-minute meal, this lasagna is quicker and more straightforward than most. If you're in a real time crunch, use your favorite jarred red sauce. For greater success with the lasagna noodles, which have a tendency to stick together, boil them in the largest pot possible or work in batches – they need as much water as possible to move freely so they don’t clump. This lasagna can be assembled, baked and refrigerated up to five days ahead, or frozen up to a month ahead if wrapped tightly.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/01/30/dining/30COOKING-WEEKNIGHT-LASAGNA/30COOKING-WEEKNIGHT-LASAGNA-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, weeknight, casseroles, pastas", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1111}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 938, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "58 grams", "fiberContent": "6 grams", "proteinContent": "44 grams", "saturatedFatContent": "26 grams", "sodiumContent": "1333 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons olive oil", "1 pound Italian sausage, sweet or hot (optional), casings removed", "1 large yellow onion, finely chopped", "2 garlic cloves, finely chopped", "Kosher salt, freshly ground pepper", "2 tablespoons tomato paste", "1 (28-ounce) can whole, peeled tomatoes", "1 (28-ounce) can crushed tomatoes", "Kosher salt", "1 1/2 pounds fresh mozzarella, grated or shredded into small pieces", "16 ounces (2 cups) whole milk ricotta", "1 cup coarsely grated Parmesan, plus more for sprinkling on top (optional)", "1/4 cup heavy cream", "Freshly ground pepper", "1 pound dried lasagna noodles (not the no-boil variety)", "Olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Heat oil in a large, heavy bottomed pot over medium heat. Add sausage, if using, and cook, stirring occasionally, until it’s starting to brown but not yet crisp, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion and garlic and season with salt and pepper. Cook, stirring occasionally, until the onion is totally softened and translucent (without letting it brown), 8 to 10 minutes. Add tomato paste and continue to cook, stirring until the tomato paste has turned a deeper brick red color, tinting the oil and onions a fiery orange color, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands, crush the whole tomatoes into smaller, bite-size pieces and add them and the crushed tomatoes, stirring to scrape up any bits from the bottom of the pot. Fill one of the tomato cans halfway with water and add it to the pot. Season with salt and pepper. Bring to a simmer and cook, stirring occasionally, until the tomato sauce has thickened and flavors have come together, 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the lasagna: Heat oven to 375 degrees and set a large pot of salted water to boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside 1 cup mozzarella. In a medium bowl, combine remaining mozzarella, ricotta, 1 cup Parmesan and cream; season with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook lasagna noodles in the large pot of salted boiling water until just softened (before they are even aldente), about 4 minutes. Drain and separate any noodles that are trying to stick together, slicking them with a bit of olive oil to prevent them from sticking further."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon a bit of sauce on the bottom of a 3-quart baking dish and top with a layer of noodles, avoiding any heavy overlap."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top with about 1 ¼ cups of sauce, and dollop ¼ of the cheese mixture over. Top with another layer of noodles and repeat three more times, ending with the last of the noodles (depending on size of the noodle/shape of the baking dish, you may have a few extra noodles) and the last of the sauce. Top with reserved 1 cup mozzarella and more Parmesan, if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover loosely with aluminum foil and place baking dish on a foil-lined rimmed baking sheet (to prevent any overflow from burning on the bottom of your oven)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until pasta is completely tender and cooked through and sauce is bubbling up around the edges, 30 to 40 minutes. Remove foil and increase temperature to 450 degrees. Continue to bake until lasagna is golden brown on top with frilly, crispy edges and corners, another 15 to 20 minutes. Let cool slightly before eating.  "}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Classic Lasagna", "description": "A quicker and more straightforward version of the traditional Italian-American specialty.", "thumbnailUrl": "https://static01.nyt.com/images/2018/01/30/dining/30COOKING-WEEKNIGHT-LASAGNA/30COOKING-WEEKNIGHT-LASAGNA-mediumThreeByTwo440.jpg", "uploadDate": "2018-04-02T17:47:20.000Z", "duration": "PT1M51S"}}