{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Roasted Cauliflower With Kale Pesto and Feta", "description": "Searing cauliflower in a skillet instead of roasting it in the oven gives it a deeply caramelized exterior, but allows the interior to remain firm and a little crisp. Here, the cauliflower is served on a lemony slick of kale pesto and topped with plenty of herbs and feta. A sprinkle of chile flakes adds heat, while a dash of colatura (an Italian version of fish sauce) or Asian fish sauce gives everything a salty, funky depth. It makes for a particularly complex and sophisticated appetizer or side dish, or even a light main course if you add some crusty bread or grains. The recipe is adapted from the chef Omar Koreitem, who owns the Paris restaurant and cafe Mokonuts with his wife, the pastry chef Moko Hirayama.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/01/23/dining/23mokonutsrex1/23mokonutsrex1-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "almond, cauliflower, feta, kale, pecorino, fall, winter, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 44}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 400, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "7 grams", "sodiumContent": "352 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 teaspoon kosher salt, plus more as needed", "1/3 cup/45 grams raw almonds", "4 cups Tuscan kale leaves, stems removed (from about 1 medium bunch)", "1 packed cup parsley leaves or baby spinach", "1/3 cup grated pecorino Sardo or Manchego cheese (1 1/2 ounces) ", "3/4 cup extra-virgin olive oil", "Fresh lemon juice, to taste", "2 tablespoons extra-virgin olive oil, plus more for serving", "1 small head cauliflower (about 1 pound), trimmed and cut into bite-size florets", "Kosher salt, to taste", "1 1/2 teaspoons finely grated lemon zest, plus more for serving", "1/4 teaspoon colatura (Italian fish sauce) or Asian fish sauce", "Merkén chile blend, Urfa chile flakes or red-pepper flakes, to taste (see note)", "1/3 cup crumbled feta", "Sumac, for serving", "Chopped mint leaves, for serving", "Chopped tarragon, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pesto: Heat oven to 350 degrees, and bring a medium pot of heavily salted water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread almonds in a single layer on a small, rimmed baking sheet and toast until golden, about 10 minutes. Remove and let cool, then transfer to a blender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When water comes to a boil, add kale leaves and blanch until tender, 2 to 3 minutes. Drain well and transfer to blender with almonds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the blender, add parsley, pecorino, 1/4 cup water and 1/2 teaspoon salt. Blend until smooth, adding more water if needed to allow the mixture to move. With blender running, drizzle in oil until mixture is emulsified and smooth. Taste and add more salt and lemon juice, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cauliflower: Add 2 tablespoons oil to a large, cold skillet. Arrange cauliflower in an even layer in skillet and sprinkle with salt to taste. Place skillet over medium-high heat and cook, without moving, until cauliflower is seared and dark brown on one side, 3 to 5 minutes. Flip cauliflower over and briefly cook on the other side until just tender but not mushy, 2 to 5 minutes. Remove from heat and sprinkle with a generous drizzle of olive oil, lemon zest, colatura and merkén."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon pesto onto a large serving platter. Top with hot cauliflower, feta, sumac, mint and tarragon. Sprinkle with more lemon zest and oil, if desired."}], "link": "https://cooking.nytimes.com/recipes/1019898-pan-roasted-cauliflower-with-kale-pesto-and-feta"}