{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Beef Stir-Fry With Basil", "description": "This simple, delicious recipe for a spicy beef stir-fry comes from Leela Punyaratabandhu, a cookbook author who adapted it from Soei, a family-run restaurant in Bangkok. Using thinly sliced beef tenderloin means the dish is ready in just minutes, and you can adjust the heat to taste by reducing or increasing the number of fresh bird's-eye chiles. Made with fresh holy-basil leaves, the classic Thai dish is known as <em>phat ka-phrao</em>. If you can't find holy basil at a Thai market, Indian market or health food store, you could swap in more widely available Thai sweet basil (pictured), and make a dish of <em>phat bai hora-pha</em>. The dish could be one part of a larger meal or stand alone with some jasmine rice and a fried egg.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/01/28/magazine/28mag-eat1/28mag-28eat-t_CA0-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, quick", "keywords": "beef tenderloin, holy basil, lard, makrut lime leaves, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 368}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 522, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "1 gram", "proteinContent": "37 grams", "saturatedFatContent": "13 grams", "sodiumContent": "466 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon Thai thin soy sauce, or light soy sauce", "1 tablespoon oyster sauce", "1 teaspoon fish sauce", "1/4 cup chicken stock", "1 packed teaspoon grated palm sugar, or light brown sugar", "8 large cloves garlic", "4 to 8 fresh bird’s-eye chiles", "1 1/2 tablespoons lard, or neutral oil", "1 1/2 pounds beef tenderloin, sliced against the grain into 2-inch-long, 1/4-inch thick strips", "3 to 4 makrut lime leaves, lightly bruised and torn into pieces (optional)", "1 1/2 cups loosely packed fresh holy-basil leaves or sweet Thai basil leaves, sweet Thai basil leaves or other fragrant basil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re making rice with this dish, get it started. In a small bowl, stir together the soy sauce, oyster sauce, fish sauce, chicken stock and sugar. In a mortar or small food processor, grind together the garlic and chiles into a coarse paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the lard in a wok or large skillet over medium-high heat. Add the garlic-chile paste, and stir until fragrant, about 1 minute. Before the garlic starts to brown, add the beef, and stir-fry to separate the pieces and coat with fat. Add the liquid mixture, making sure not to leave any behind in the bowl, and cook until the beef is only barely pink, about 2 minutes. Add the lime leaves, and continue to cook until no pink remains on the beef, about 1 minute. Add the basil leaves, and stir until they are just starting to wilt, then remove from heat and serve with rice. (You can fish out the large pieces of makrut leaves before serving or put them aside as you eat.)"}], "link": "https://cooking.nytimes.com/recipes/1019160-spicy-beef-stir-fry-with-basil"}