{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Sheet-Pan Sausage and Squash", "description": "Like chicken thighs, whose rendered skin leaves behind a puddle of schmaltz for frying vegetables, bread or beans, sausage yields a delicious fat for cooking. Paired with butternut squash and crisped in a hot oven, its spicy fat slicks the sweet squash, while parsley and lemon cut through all the richness. Feel free to switch up the squash for carrots, broccoli, potatoes: Any vegetables that are good roasted will work well in that liquid gold. If the meal seems light, bulk it up by topping with a cup of feta or rinsed canned chickpeas, adding arugula or watercress to the parsley, or serving it all on a bed of kale or mustard greens, like a warm salad.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2018/09/13/dining/as-sausage-and-squash-bake-horizontal/merlin_143375565_f71200d3-bfbd-427c-895b-b3943c6763f5-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weekday, weeknight, roasts", "keywords": "butternut squash, parsley, sausage, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 614}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 542, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "5 grams", "proteinContent": "20 grams", "saturatedFatContent": "11 grams", "sodiumContent": "886 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 (2-pound) butternut squash, peeled, halved lengthwise and seeded", "1 pound spicy sausage (fresh chorizo, Italian, Andouille or otherwise)", "1/4 cup extra-virgin olive oil", "Kosher salt and black pepper", "1 1/2 cup parsley leaves", "1 tablespoon freshly squeezed lemon juice, plus more as desired", "Flaky salt, as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees and stick a large baking sheet in the oven. Prep the squash and sausage: Cut the squash into 1/2-inch-thick slices, then cut the slices crosswise in half. Transfer to a large bowl. Score the sausages in a few places on both sides, making sure not to cut all the way through. Transfer to the bowl with the squash, then stir to coat with the olive oil and fat pinches of salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oven comes to temperature, carefully dump the squash and sausage mixture onto the hot baking sheet and spread it out into a single layer. Roast, stirring every so often to coat the squash in the rendered fat, until the squash is tender and sausages are crisp and cooked through, 20 to 25 minutes. (To add some color, put them under the broiler for a minute or two.) Let cool slightly while you prepare the parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix together the parsley and lemon juice, and add salt and pepper to taste. Slice the sausage diagonally in thirds. Serve the sausage and squash on a platter with a pile of parsley on top and sprinkled with an extra squeeze of lemon and flaky salt, if desired."}]}