{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Mushrooms, Fried Eggs and Herbs", "description": "This fall-inspired, earthy pasta uses a combination of mushrooms for depth of flavor and is topped with a runny egg, which silkens up the sauce. Supermarkets these days generally have a good selection of different varieties such as cremini and shiitake, but if your standard white-button mushroom is all that’s available, this dish will still be a winner. If you’re not feeling pasta, the mushrooms are equally good served on top of creamy polenta or on their own. Red wine not optional.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/11/01/dining/ch-pasta-mushroom/ch-pasta-mushroom-articleLarge-v2.jpg", "totalTime": "PT35M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, weeknight, pastas", "keywords": "fall, winter, main course, mushroom, parmesan, rigatoni, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 278}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 530, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "6 grams", "proteinContent": "19 grams", "saturatedFatContent": "8 grams", "sodiumContent": "609 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Kosher salt", "1 pound rigatoni or mezzi rigatoni", "3 tablespoons olive oil, plus more for serving", "4 large eggs", "Black pepper", "4 tablespoons unsalted butter", "1 1/2 pounds mixed mushrooms such as cremini, white button and shiitake, trimmed and roughly torn or chopped", "1 large shallot, finely chopped", "2 garlic cloves, finely chopped", "2 teaspoons thyme, finely chopped", "1/2 teaspoon red-pepper flakes", "1/4 cup grated pecorino or Parmesan, plus more for serving", "1/4 cup roughly chopped Italian parsley, leaves and tender stems", "2 tablespoons torn mint, for garnish (optional, but recommended)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to a boil and cook pasta until it's al dente, 1 to 2 minutes less than package directions. Drain, reserving 1 1/2 cups pasta water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 1 tablespoon olive oil in a nonstick skillet over medium heat. Crack the eggs into the skillet and season with salt and pepper. Fry until the undersides are golden and crispy and the yolk is still runny, 2 to 4 minutes. Using a spatula, transfer eggs to a paper towel-lined plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of butter and the remaining olive oil in a 12-inch skillet over medium heat. Once the butter melts, add the mushrooms and sauté until deeply browned, about 12 to 15 minutes. Add the shallots, garlic, thyme and red-pepper flakes, and cook for 1 minute. Season well with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta to the skillet along with the remaining butter, grated cheese and 1 cup of the pasta water, tossing everything together until the butter melts and the sauce is glossy, 1 to 2 minutes. Add the parsley and toss again to combine, adding more of the pasta water as needed to loosen up the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve in bowls with a fried egg on top of each portion and scatter with the mint, if using. Pass additional grated cheese at the table and drizzle with a bit more of the olive oil if desired."}], "link": "https://cooking.nytimes.com/recipes/1019703-pasta-with-mushrooms-fried-eggs-and-herbs"}