{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Asparagus With Buttered Almonds, Capers and Dill", "description": "Cooking asparagus is one of the easiest kitchen tasks around. There is almost no preparation, the asparagus is roasted plain in the oven, and all that's left to do is fry some almonds and capers to spoon on top. This can be served as part of a festive spread of salads and seasonal dips. It also works well as a side for meat, fish or grain dishes.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2018/04/11/dining/11ottorex2/11ottorex2-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 side-dish servings", "recipeCuisine": "french, italian, mediterranean", "recipeCategory": "", "keywords": "almonds, asparagus, capers, dill, side dish, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 192}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 138, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "4 grams", "sodiumContent": "285 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/3 pounds/600 grams asparagus, woody ends trimmed", "3 tablespoons olive oil", "Salt and black pepper", "2 tablespoons/30 grams unsalted butter", "Scant 1/4 cup/20 grams sliced (flaked) almonds", "3 tablespoons/30 grams baby capers, patted dry on paper towels (kitchen paper)", "1/4 to 1/2 cup/5 to 10 grams roughly chopped fresh dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees Fahrenheit/220 degrees Celsius. Line a baking sheet (baking tray) with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl or on a work surface, use your hands or tongs to toss the asparagus with 1 tablespoon oil, a generous pinch of salt and a good grind of pepper. Arrange asparagus in the paper-lined pan, spaced well apart, and roast, shaking the pan occasionally, until asparagus is soft and starting to brown in places, 8 to 12 minutes, depending on thickness. Remove from oven and set aside in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small or medium saucepan, melt the butter over medium heat until foamy. Add almonds and fry, stirring frequently, until golden brown, 1 to 2 minutes (reduce heat as needed to prevent scorching). Pour almonds and butter evenly over asparagus."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 2 tablespoons oil to the pan and heat over high heat. Once hot, add the capers and fry, stirring continuously, until they have opened up and become crisp, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, remove capers from the oil and sprinkle over the asparagus. Add dill. Using tongs or two spoons, mix gently to combine, transfer to a large plate and serve warm."}]}