{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Herb-Marinated Chicken", "description": "Pungent from the fish sauce and garlic, sweet and sour from the honey and lime, and spicy from the jalapeño, the Houston chef Chris Shepherd likes to serve these golden-skinned chicken thighs with a green papaya salad. But anything crunchy and coleslaw-like will fare just as well. The longer you marinate the thighs, the more complex they become; four hours is a bare minimum. If you’d like to use white meat, choose bone-in, skin-on breasts for the juiciest result.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/06/08/dining/08chicken/08chicken-articleLarge.jpg", "totalTime": "PT4H20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry", "keywords": "chicken thighs, cilantro, fish sauce, scallion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 341}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 640, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "1 gram", "proteinContent": "39 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1602 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 bunch scallions, chopped", "1/2 bunch cilantro, plus more for garnish", "5 garlic cloves, roughly chopped", "1 jalapeño, seeded if you like", "1/4 cup fish sauce", "1 1/2 tablespoons honey", "Juice of 2 limes, plus 1 lime for garnish", "3 tablespoons neutral oil, such as sunflower or grapeseed", "2 pounds boneless chicken thighs, preferably with skins attached (ask your butcher)", "Green papaya salad, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place scallions, cilantro, garlic, jalapeño, fish sauce, honey, lime juice and 2 tablespoons oil in a blender. Purée until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape marinade into a large bowl or resealable plastic bag. Add chicken, tossing to coat, and refrigerate for at least 4 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Heat 1 tablespoon oil in a 12-inch skillet over medium-high heat. Use tongs to remove chicken from marinade, letting any excess drip away. Do not pat dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken in skillet skin-side down and sear until golden brown, 3 to 5 minutes (2 to 3 minutes if using skinless chicken), being careful not to let it burn as the sugars from the honey will start to caramelize."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flip chicken, transfer to oven, and continue to cook until it reaches an internal temperature of 165 degrees, 10 to 15 minutes. Transfer chicken to a cutting board and let it rest for 3 to 4 minutes. Serve with more cilantro, limes wedges and green papaya salad if you like."}], "link": "https://cooking.nytimes.com/recipes/1019350-seared-herb-marinated-chicken"}