{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Potato Soup", "description": "If we’re being honest, a baked potato isn’t really about the potato. It’s about the toppings: plush sour cream, butter, cheese, salty bacon, bright scallions. This soup version doesn’t skimp on those extras: The potatoes simmer in milk with garlic and scallions until just tender, then they join sour cream and Cheddar in the pot before the toppings — including potato skins — are added. It’s potatoey, creamy and adaptable. Make it smooth or textured, skip the bacon and serve it with a side salad (though it’s plenty hearty all on its own).", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/01/14/dining/as-baked-potato-soup/as-baked-potato-soup-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, weekday, soups and stews", "keywords": "appetizer, main course, bacon, cheddar, milk, potato, scallions, sour cream, fall, winter, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 638}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 774, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "4 grams", "proteinContent": "24 grams", "saturatedFatContent": "27 grams", "sodiumContent": "1664 milligrams", "sugarContent": "22 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["6 slices bacon, or 3 tablespoons unsalted butter", "1 bunch scallions, white and green parts thinly sliced separately", "4 garlic cloves, minced", "2 pounds russet potatoes, peeled and cut into 1/2-inch cubes, large skins reserved", "6 cups whole milk", "Kosher salt", "1 tablespoon extra-virgin olive oil, plus more as needed", "Black pepper", "1/8 teaspoon cayenne", "1/8 teaspoon garlic powder", "3/4 cup sour cream, plus more for serving", "3/4 cup freshly grated Cheddar (about 3 ounces), plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large soup pot or Dutch oven over medium heat, cook the bacon (if using) until crisp, 12 to 13 minutes. Transfer the bacon to a paper-towel lined plate or cutting board. Return the pot with just 3 tablespoons of the bacon fat to the stove. (If there’s not enough fat, supplement with butter to total 3 tablespoons.) If making the soup vegetarian, melt butter in a large soup pot or Dutch oven over medium heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Over medium-low heat, sauté the white parts of the scallions and the garlic until golden brown, 2 to 3 minutes, stirring frequently and adjusting the heat as necessary to avoid burning the garlic. Add the potatoes, milk and 2 teaspoons salt, and bring to a boil over medium-high heat (resist the urge to heat it faster as this can lead to curdling). Once at a boil, lower the heat and simmer covered until the potatoes are tender, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soup simmers, prepare the potato skins: Warm the olive oil over medium-high heat in a large skillet. Working in batches if needed, add the potato peels in a single layer and cook, flipping once, until crisp and golden-brown, about 3 minutes. Transfer to a paper towel-lined plate or cutting board, then sprinkle with salt, pepper, cayenne and garlic powder. Crumble and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the potatoes are tender, take the pot off the heat, and purée the mixture with an immersion blender if you’d like a smooth soup. (Mash with a potato masher if you’d like a chunkier soup.)  Stir in the sour cream and cheese until combined, then season with salt and pepper. Serve topped with crumbled bacon, more sour cream and Cheddar and the green parts of the scallions. Top with potato peels (eat any extra as chips, dipped in ketchup and mustard)."}]}