{"@context": "http://schema.org", "@type": "Recipe", "name": "Sugarplum Gingerbread Cake", "description": "This deeply spiced gingerbread cake recipe comes from the cookbook author Genevieve Ko, who found inspiration in the light-as-air cakes she tasted from Chinese bakeries in Southern California, as well as the sweets — hot candied ginger and sugared, dried plums (a.k.a. prunes) — that her grandmothers offered her as a child. Ms. Ko's cake uses oil, not butter, which gives the crumb a fluffy, moist texture. The liquid base of rehydrated prunes brings sweetness along with depth of flavor.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/11/19/magazine/19feast-recipe2-bundt/19feast-recipe2-bundt-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "16 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "cinnamon, cloves, cocoa powder, ginger, molasses, prune, spelt flour, whole wheat flour, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 197}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 222, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "160 milligrams", "sugarContent": "28 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup (184 grams) pitted prunes, quartered", "2/3 cup (214 grams) molasses", "1/2 teaspoon baking soda", "Butter or cooking spray, for the pan", "1 cup (137 grams) spelt flour", "3/4 cup (108 grams) white whole-wheat flour", "1 1/2 teaspoons baking powder", "1 tablespoon plus 1 teaspoon ground ginger", "1 teaspoon ground cinnamon", "1/4 teaspoon ground cloves", "1/2 teaspoon salt", "3 large eggs, at room temperature", "1 cup (215 grams) packed light-brown sugar", "1/4 cup (56 grams) grapeseed or other neutral oil", "2 teaspoons cocoa powder (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the prunes along with 1 1/2 cups water in a small saucepan, and bring to a boil. Reduce heat to low, and simmer until the fruit is very soft and starting to break down, about 5 minutes. Remove from heat, and stir in molasses and baking soda, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position a rack in the center of the oven, and heat to 350 degrees. Generously butter or spray, then flour a 12-cup, or 10-inch Bundt pan, and place it on a baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the flours, baking powder, ginger, cinnamon, cloves and salt; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the paddle attachment, beat the eggs and brown sugar on medium-speed until very thick and pale. With the machine running, add the oil in a slow, steady stream down the side of the bowl, beating until incorporated. Scrape down the sides of the bowl, then set speed to low and add the molasses mixture. Beat until just incorporated, then scrape down the sides of the bowl again. Gradually add the flour mixture, mixing only until all traces of flour disappear. Transfer batter to the prepared Bundt pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 50-60 minutes, or until a skewer inserted into the domed part of the cake comes out clean. Cool in the pan on a wire rack for 15 minutes, then carefully invert cake onto the rack, lift away the pan and cool completely to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust the cocoa powder over the cake, using a fine-mesh sieve or tea strainer, then transfer to a serving plate."}]}