{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Trout With Garlicky Broccolini", "description": "The benefits of cooking trout in its whole, butterflied form go beyond visual appeal — the large piece drastically reduces the risk of overcooking, and the longer roasting time gives other vegetables on the pan, like wispy broccolini (or smashed boiled potatoes, or halved cherry tomatoes), a chance to crisp up. Once the pan is out of the oven, spoon over a punchy dressing made from raw garlic, smoky Aleppo pepper and fresh lemon juice, and let the residual heat mellow and meld the flavors before serving. Most grocery stores sell trout already butterflied (it’s the most common ready-to-buy preparation), which saves you the extra step of trying to figure out how to do it yourself. If not, ask and they will happily oblige.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/07/11/dining/11romanrex/11romanrex-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weekday, seafood", "keywords": "broccolini, trout, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 622}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 476, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "9 grams", "proteinContent": "43 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1186 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 garlic clove, finely grated", "2 teaspoons Aleppo pepper (or 1 teaspoon red-pepper flakes)", "1/4 cup olive oil, plus more for drizzling", "2 tablespoons fresh lemon or lime juice, plus 1/2 lemon, thinly sliced", "Kosher salt and black pepper", "2 whole butterflied trout, about 12 ounces each, heads removed if you like", "2 bunches broccolini, ends trimmed", "2 tablespoons capers, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Combine garlic, Aleppo pepper, 1/4 cup olive oil and 2 tablespoons lemon juice in a small bowl and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the trout down flat, skin-side down, on a rimmed sheet pan, fitting the two pieces snugly next to each other. Place lemon slices on top of the trout and scatter broccolini and capers around it. Drizzle everything with olive oil and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in oven and roast until broccolini has started to lightly char around the edges and the trout is opaque and cooked through, 8 to 10 minutes. Remove from oven and immediately drizzle everything with the olive oil-garlic mixture and let the flavors mingle for a minute or two."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve directly from the sheet pan (no shame, just use a trivet). Alternatively, transfer trout to a large serving platter or divide fillets among 4 smaller plates."}], "link": "https://cooking.nytimes.com/recipes/1019381-sheet-pan-trout-with-garlicky-broccolini"}