{"@context": "http://schema.org", "@type": "Recipe", "name": "Orecchiette With Corn, Jalapeño, Feta and Basil", "description": "Sweet, peak season corn is at the heart of this flavorful and simple-to-make summer pasta. The jalapeño offers a pleasant kick, and the feta cheese tossed in at the end melts slightly, giving the sauce a silky texture. It’s worth seeking out orecchiette here, as it nicely catches the corn kernels, creating perfect bites. If you can’t find it, fusilli or farfalle would work in its place. Serve with a bright, simple salad alongside and fresh fruit for dessert.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/08/08/dining/CH_cornpasta_horizontal/CH_cornpasta_horizontal-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, weekday, weeknight, pastas", "keywords": "corn, feta, jalapeño, orecchiette, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 825}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 791, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "113 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "6 grams", "proteinContent": "28 grams", "saturatedFatContent": "17 grams", "sodiumContent": "760 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound orecchiette", "4 tablespoons unsalted butter", "1 jalapeño, finely chopped", "5 ears corn, shucked and kernels removed (about 3 1/2 to 4 cups kernels)", "Kosher salt", "8 ounces crumbled feta cheese", "1/2 cup torn basil leaves, plus more for serving", "Flaky salt, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to a boil. Add pasta, and cook until it is just short of al dente, about 10 minutes. Drain, reserving 1 cup of pasta cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pasta cooks, make the sauce: In a 12-inch skillet, melt butter over medium heat. Add jalapeño, and cook until softened, about 1 to 2 minutes. Add corn, and cook until it begins to brown in spots, about 3 to 4 minutes. Season with salt. Add 1/4 cup of pasta water and bring to simmer and cook until reduced by half, about 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pasta to skillet, tossing to coat with sauce. Add feta cheese and an additional 1/4 cup of pasta water, tossing until pasta is slick and glossy with sauce. If needed, add in another 1/4 cup pasta water. Stir in basil. Transfer to a large bowl and scatter with remaining basil. Season with flaky salt, if desired."}]}