{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Chicken Breasts With Harissa Chickpeas", "description": "Harissa paste, the Tunisian hot chile condiment, is a super versatile pantry item. Keep it on hand for creating quick weeknight sauces that pack a punch. Here, store-bought harissa is reinforced with sautéed onion and garlic, then brightened with lemony coriander and fresh parsley. Mashed chickpeas add texture and balance out the spicy, tangy sauce. Couscous and orzo are simple sides to serve with this meal; if you have extra time, roasted squash or steamed cauliflower are also great accompaniments. Leftover harissa sauce makes a great topping for roasted cod or salmon, or use it as a warm vinaigrette to dress up a simple green salad. If you'd like, you can use boneless breasts or thighs, but keep on eye on them. They'll be cooked through in 20 to 30 minutes.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2018/12/04/dining/kc-Roasted-Chicken-With-Harissa-Coriander-Sauce-and-Chickpeas/kc-Roasted-Chicken-With-Harissa-Coriander-Sauce-and-Chickpeas-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, easy, poultry", "keywords": "chicken breast, chickpea, coriander seeds, harissa, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 39}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 840, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "50 grams", "fiberContent": "8 grams", "proteinContent": "68 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1058 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 pounds bone-in, skin-on chicken breasts", "6 tablespoons extra-virgin olive oil", "Kosher salt and pepper", "1/2 cup finely chopped onion", "1 teaspoon minced garlic", "2 tablespoons harissa paste, more to taste", "1 tablespoon coriander seeds, crushed using a mortar and pestle, or 1 1/2 teaspoons ground coriander", "1 (15.5-ounce) can chickpeas, rinsed and drained", "2 tablespoons fresh lemon juice (from about 1/2 a lemon)", "1/4 cup coarsely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. On a rimmed baking sheet, combine the chicken and 2 tablespoons oil. Season with salt and pepper and toss to coat. Arrange the chicken in an even layer, skin side up, and roast until golden and cooked through, 30 to 40 minutes, depending on the size of the chicken breasts. Transfer to a cutting board and let rest for 10 minutes. Carve the breast off off the bone, then slice to serve. Discard bones or reserve for making chicken stock. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chicken rests, heat 2 tablespoons oil in a small saucepan over medium heat. Add the onion and garlic and cook, stirring occasionally, until softened, 3 minutes. Stir in the harissa and coriander and cook until very fragrant and dark red, about 2 minutes. Add half the chickpeas and lightly mash them using a fork, the back of a spoon or a potato masher. Stir in the lemon juice and parsley along with the remaining chickpeas, 2 tablespoons oil, and 1/4 cup water. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the chicken topped with the sauce."}], "link": "https://cooking.nytimes.com/recipes/1019814-roasted-chicken-breasts-with-harissa-chickpeas"}