{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Alaska", "description": "Baked alaska is a real toil, no doubt — you have to attend to the cake, the ice cream and the meringue, in the same way a mason lays stone. But there is plenty of opportunity for fun and flourish once the foundation is secure: You can divide the meringue among several pastry bags with varying sized tips to make dramatic and interesting variegated patterns of piped meringue. You can play with the shape of the cake by freezing the semifreddo in a coffee drip cone or a large-format flexible ice cube tray. And when you toast the meringue with a kitchen torch, you can hold the flame near and far, lingering in spots and moving briskly in others, to create extra drama and eye appeal. Try spooning flaming kirsch down its slopes. If you want to go even further, try replacing the white sugar with brown sugar in the meringue for a sophisticated pale-beige meringue that contrasts beautifully when toasted just to golden. Or see what you think of the results using other decorative colored sugars — keeping in mind, though, that after all that work down on your knees laying stone, you want to look up at a cathedral, not Fudgie the Whale!", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2017/12/03/magazine/03mag-eat2/03eat2-articleLarge.jpg", "totalTime": "PT9H45M", "recipeYield": "16 servings", "recipeCuisine": "", "recipeCategory": "cakes, project", "keywords": "dessert, heavy cream, pistachio, pistachio paste", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 79}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 429, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "1 gram", "proteinContent": "6 grams", "saturatedFatContent": "11 grams", "sodiumContent": "73 milligrams", "sugarContent": "49 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 1/2 tablespoons (150 grams) butter", "150 grams egg whites (from about 5 large eggs), room temperature", "1/8 cup (25 grams) whole almonds, toasted, cooled, then finely ground", "1/2 cup (80 grams) whole pistachios, toasted, cooled, then finely ground", "1 1/2 cups (160 grams) powdered sugar", "Pinch salt", "1/3 cup plus 1 tablespoon (50 grams) all-purpose flour", "1 1/2 teaspoons (10 grams) unsweetened pistachio paste", "1 cup (198 grams) sugar", "1/2 cup plus 1 tablespoon (133 milliliters) freshly squeezed lemon juice", "2 tablespoons (30 milliliters) water", "6 large egg yolks", "Zest of 3 lemons", "1/2 teaspoon vanilla extract", "1 1/2 cups (355 milliliters) heavy cream", "2 cups (396 grams) sugar", "1 cup (245 grams) egg whites, room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the pistachio cake:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a small skillet over medium heat. Continue to cook, swirling the pan occasionally, until the butter is a toasty brown color and smells nutty. Pour butter into a heatproof bowl; let cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350. Line an 8-inch round cake pan with parchment paper, and coat with nonstick cooking spray; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a stand mixer fitted with a whisk attachment, whip egg whites until tripled in volume. Whites should look like shaving cream and hold a stiff peak. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On slow setting, whisk in the toasted almonds, pistachios, sugar, salt and flour. Whisk in the pistachio paste until fully incorporated, then the browned butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the cake batter into the prepared cake pan, and bake until set, 20 to 25 minutes. Allow the cake to cool completely, then remove it from the pan."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the lemon semifreddo:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a small metal 5- to 6-cup-capacity bowl with plastic wrap; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small, clean and dry nonreactive saucepan, combine sugar, 1 tablespoon lemon juice and the water. Let liquid saturate the sugar before setting on heat. Cook over medium heat until the mixture reaches 250 degrees — hard-ball stage on a candy thermometer, about 10 minutes. Do not stir or swirl the sugar. Cover with a tightfitting lid for a few seconds to create moisture, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk egg yolks in the bowl of an electric mixer at medium speed until they are thick and pale in color, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the sugar reaches 250 degrees, remove it from the heat. With the mixer on low speed, carefully pour the sugar into the yolks, taking care to pour down the inside of the bowl so that the sugar doesn’t hit the moving whisk and spin into a mess of threads. Whisk until fully incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the zest, vanilla and remaining lemon juice, and increase the speed to medium. Continue to beat until the mixture is completely cool; transfer to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the mixing bowl, then whisk the heavy cream until it holds stiff peaks. Gently mix the whipped cream into the lemon-sugar mixture until fully incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the mixture into the prepared bowl, cover tightly with plastic wrap and freeze until firm."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the meringue:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a full inch of water to a boil in a wide pot. In a bowl large enough to sit on top of the pot without touching the water, combine the sugar and egg whites. Place the bowl over the pot of boiling water, and whisk until the sugar dissolves, about 5 minutes. Run your finger across the bottom of the mixture to be sure there are no grains of undissolved sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mixture to the bowl of a stand mixer, and whisk on high speed until the meringue is glossy and holds stiff peaks and is no longer warm at all, about 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the meringue to a piping bag fitted with a large star tip."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To assemble the baked alaska:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut a 6-inch round from the cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the semifreddo from the mold, and invert on top of the cake, creating a dome."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working from the bottom of the cake, pipe the meringue around the entire dome."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Freeze until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a kitchen torch, brown the meringue all over until toasty."}]}]}