{"@context": "http://schema.org", "@type": "Recipe", "name": "Spring Lamb and Chickpea Stew", "description": "Stews and braises are for year-round cooking, but warmer weather calls for a lighter approach. This stew is quite brothy, and full of greens, wilted in olive oil with green garlic, carrots and fava beans or peas. A healthy sprinkling of roughly chopped mint adds brightness. It’s important to use dried chickpeas, because they add flavor to the broth as they slowly cook with the lamb. And an overnight soak is essential: The soaked dried chickpeas will swell to three times their original size, which gives them the proper creamy texture when cooked.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/05/16/dining/16kitchenweb1/merlin_137722986_6163d008-d9a8-4d43-94d1-5c13eb33513a-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "chickpea, fava beans, lamb, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 131}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1070, "unsaturatedFatContent": "37 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "72 grams", "fiberContent": "11 grams", "proteinContent": "63 grams", "saturatedFatContent": "29 grams", "sodiumContent": "1287 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup dried chickpeas, soaked in cold water overnight and drained", "4 pounds boneless lamb shoulder, cut into 3-inch chunks", "Salt and pepper", "4 whole cloves", "1 onion, peeled and halved", "2 tablespoons extra-virgin olive oil", "2 cups chopped leeks or onions", "1/4 cup chopped green garlic shoots, or 2 cloves garlic, minced", "Pinch of red pepper flakes", "1 bunch small carrots, trimmed and peeled", "1 pound chard or other sturdy leafy greens, sliced in 2-inch wide ribbons", "2 cups fava beans, peeled or not, or 2 cups peas", "3 tablespoons roughly chopped mint, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chickpeas in a large soup pot. Season lamb pieces generously with salt and pepper, then add to pot. Stick the 4 cloves into the onion halves, and add them to the pot along with 6 cups water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring pot to a boil over high heat, then reduce heat to a steady simmer. Put on the lid and simmer until lamb is tender, about 1 1/2 hours. Turn off heat. Skim off any rising fat. (At this point, you may set the dish aside at room temperature for up to 2 hours before serving, or refrigerate up to 2 days, though it really tastes best the day it is made.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, reheat lamb and chickpeas in broth. Put olive oil in a wide skillet over medium heat and add leeks. Cook, stirring, until softened, about 2 minutes. Add garlic and sizzle for a minute, add red pepper flakes, then add carrots and a ladle of the lamb broth. Simmer until carrots are done, about 5 minutes. Add the chard, a little salt and another splash of lamb broth. Turn heat to high and cook, stirring, until leaves are tender, a few minutes more. Add fava beans or peas, cover the pan, and turn off heat. They will cook nicely in the residual heat for 4 or 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, mound greens and vegetables on one side of a large serving platter. On the other side, place lamb pieces and ladle over some broth and chickpeas. Sprinkle with chopped mint."}], "link": "https://cooking.nytimes.com/recipes/1019306-spring-lamb-and-chickpea-stew"}