{"@context": "http://schema.org", "@type": "Recipe", "name": "Soba Noodles With Chicken and Snap Peas", "description": "A simple sesame-soy dressing coats chewy soba noodles, tender chicken and crisp sugar snap peas in this dish that's good at room temperature or cold. It’s a great way to use leftover or store-bought rotisserie chicken, but also works well without. You can double up on the snap peas instead or fold in other vegetables, like grated carrots, shredded cabbage or thinly sliced bok choy. The quick daikon pickles add a bright tangy crunch, but you can skip them and still enjoy this one-bowl meal.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2018/10/03/dining/gk-soba-noodles-with-chicken-horizontal-2/gk-soba-noodles-with-chicken-horizontal-2-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "japanese", "recipeCategory": "dinner, lunch, weekday, noodles", "keywords": "chicken, daikon, sesame seeds, snap peas, soba noodles, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 559, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "5 grams", "proteinContent": "38 grams", "saturatedFatContent": "4 grams", "sodiumContent": "761 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons rice vinegar", "3 tablespoons honey", "Kosher salt", "1 cup very thinly sliced peeled daikon radish", "8 ounces sugar snap peas, strings removed (3 cups)", "2 bundles soba noodles (8 to 9 ounces)", "3 tablespoons soy sauce", "2 tablespoons sesame oil", "1/2 teaspoon red-pepper flakes, plus more for serving", "3 cups shredded cooked chicken", "Sliced scallions and toasted sesame seeds, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large saucepan of water to a boil. Meanwhile, mix the vinegar, 1 tablespoon honey and 1 teaspoon salt in a small bowl. Add the daikon and press into the mixture to submerge as much as possible. Let stand until ready to serve, mixing occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/4 cup salt to the boiling water. Add the snap peas and cook just until bright green and tender, about 30 seconds to 1 minute. Using a spider or slotted spoon, transfer to a colander and immediately rinse under cold water until cool. Drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the noodles to the boiling water. Cook, stirring occasionally, until just tender, 4 to 8 minutes. Drain, rinse under cold water until cool and drain again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the noodles cook, whisk the soy sauce, sesame oil, red-pepper flakes and remaining 2 tablespoons honey in a large bowl. Add the chicken, soba and snap peas and toss until evenly coated. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide among bowls. Drain the daikon pickles and arrange on top, then garnish with the scallions, sesame seeds and additional red-pepper flakes."}], "link": "https://cooking.nytimes.com/recipes/1019645-soba-noodles-with-chicken-and-snap-peas"}