{"@context": "http://schema.org", "@type": "Recipe", "name": "My Mother’s Chicken Spaghetti", "description": "In 1975, Craig Claiborne, then editor of The Times' food department, shared his favorite childhood dish with readers.\n“A few weeks ago we were interviewed on the McCanns' At Home Program on station WOR, and when the subject veered around to childhood foods, we described in some detail the dish that had given us most pleasure in early youth and adolescence and still gives us comfort as we approach senility. It was a family creation known as chicken spaghetti. It consisted of spaghetti or spaghettini and sometimes vermicelli baked in a casserole, layered with a tomato and cream sauce, a meat sauce, boneless chicken and two kinds of grated cheese. It was almost always served when large numbers were invited for special occasions. Subsequent to the program we received numerous requests for the recipe and discovered with some astonishment that we had somehow never had occasion to use it in a story.”", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT3H", "recipeYield": "10 to 12 servings", "recipeCuisine": "southern", "recipeCategory": "pastas, poultry", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 12}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 668, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "3 grams", "proteinContent": "38 grams", "saturatedFatContent": "19 grams", "sodiumContent": "863 milligrams", "sugarContent": "6 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 three‐and‐one‐half pound chicken with giblets", "Chicken broth to cover", "Salt to taste", "3 cups canned tomatoes, preferably Italian peeled tomatoes", "7 tablespoons butter", "3 tablespoons flour", "1/2 cup heavy cream", "1/8 teaspoon grated nutmeg", "Freshly ground pepper to taste", "1/2 pound fresh mushrooms", "2 cups finely chopped onions", "1 1/2 cups finely chopped celery", "1 1/2 cups chopped green pepper", "1 tablespoon or more finely minced garlic", "1/4 pound ground beef", "1/4 pound ground pork", "1 bay leaf", "1/2 teaspoon hot red pepper flakes, optional", "1 pound spaghetti or spaghettini", "1/2 pound Cheddar cheese, grated", "2 to 2 1/2 cups grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken with neck, gizzard, heart and liver in a kettle and add chicken broth to cover and salt to taste. Bring to the boil and simmer until the chicken is tender without being dry, 35 to 45 minutes. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken and take the meat from the bones. Shred the meat, cover and set aside. Return the skin and bones to the kettle and cook the stock down 30 minutes or longer. There should be four to six cups of broth. Strain and reserve the broth. Discard the skin and bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the tomatoes in a saucepan and cook down to half the original volume, stirring. There should be one and one‐half cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt three tablespoons of butter in a saucepan and add the flour, stirring to blend with a wire whisk. When blended and smooth, add one cup of the reserved hot broth and the cream, stirring rapidly with the whisk. When thickened and smooth, add the nutmeg, salt and pepper to taste. Continue cooking, stirring occasionally, about 10 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the mushrooms are very small or button mushrooms, leave them whole. Otherwise, cut them in half or quarter them. Heat one tablespoon of butter in a small skillet and add the mushrooms. Cook, shaking the skillet occasionally and stirring the mushrooms until they are golden brown. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat three tablespoons of butter in a deep skillet and add the onion. Cook, stirring, until wilted. Add the celery and green pepper and cook, stirring, about five minutes. Do not overcook. The vegetables should remain crisp‐tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the garlic, beef and pork and cook, stirring and chopping down with the edge of a large metal spoon to break up the meat. Cook just until the meat loses its red color. Add the bay leaf and red pepper flakes. Add the tomatoes and the white sauce made with the chicken broth. Add the mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the spaghetti or spaghettini in boiling salted water until it is just tender. Do not overcook. Remember that it will cook again when blended with the chicken and meat sauce. Drain the spaghetti and run under cold running water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon enough of the meat sauce over the bottom of a five‐ or six‐quart casserole to cover it lightly. Add about one‐third of the spaghetti. Add about one‐third of the shredded chicken, a layer of meat sauce, a layer of grated Cheddar cheese and another layer of spaghetti. Continue making layers, ending with a layer of spaghetti topped with a thin layer of meat sauce and grated Cheddar cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in up to two cups of the reserved chicken broth or enough to almost but not quite cover the top layer of spaghetti. Cover and let the spaghetti stand for four hours or longer. If the liquid is absorbed as the dish stands, add a little more chicken broth. Remember that when this dish is baked and served, the sauce will be just a bit soupy rather than thick and clinging."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, heat the oven to 350 degrees. (One of the stipulations in the original recipe for this dish is that the spaghetti including all the ingredients be combined at least four hours before baking, but it's not necessary.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the spaghetti casserole on top of the stove and bring it just to the boil. Cover and place it in the oven. Bake 15 minutes and uncover. Bake 15 minutes longer or until the casserole is hot and bubbling throughout and starting to brown on top. Serve immediately with grated Parmesan cheese on the side."}]}