{"@context": "http://schema.org", "@type": "Recipe", "name": "Herbed Grain Salad With Mushrooms, Hazelnuts and Pears", "description": "Instead of the usual Mediterranean flavors, this grain salad has a whiff of Eastern Europe, with dill, hazelnuts and mushrooms. Ripe pear adds juicy and sweet notes. It's great for fall and winter parties, and can be prepared well ahead of time, but wait till the last minute to stir everything together.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2018/12/26/dining/26rusrex2/merlin_148266366_240fe05f-8c6c-45dd-b99e-d5faa997ae6a-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 to 10 servings", "recipeCuisine": "russian", "recipeCategory": "grains and rice, salads and dressings", "keywords": "dill, hazelnut, mushroom, pear, pearl barley, main course, side dish, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 200}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 318, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "224 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["Kosher salt", "1 1/2 cups pearl barley or whole grains, like farro", "1 big handful (1 cup packed) fresh sorrel or baby spinach, tough stems removed", "3/4 cup chopped fresh dill, tough stems removed, plus more for garnish", "1 garlic clove, peeled", "1/2 cup toasted hazelnuts or walnuts, plus 1/2 cup chopped toasted hazelnuts or walnuts", "3/4 cup plus 2 tablespoons olive oil, and more as needed", "2 tablespoons white wine vinegar, plus more to taste", "Freshly ground black pepper", "2 cups (about 6 ounces) diced shiitake, maitake or king oyster mushrooms", "1 pear, peeled (if desired), cored and diced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Stir in barley and return to a boil. Reduce the heat and cook at a gentle boil until tender but not mushy, 30 to 40 minutes. (Different grains will cook at different rates.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: In a food processor, combine the greens, dill and garlic and process until finely chopped, scraping down the bowl as needed. Add the whole nuts and pulse a few times to coarsely chop. While the motor is running, add the 3/4 cup oil gradually in a slow stream and process until smooth. Add the vinegar, 2 teaspoons salt, 1/2 teaspoon pepper (12 to 16 grinds), and mix. Taste and adjust the seasonings with vinegar, oil, salt and pepper. It should taste bright and rich."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the mushrooms: In a wide, medium-size pot, combine the mushrooms and 1/2 cup water. Bring to a boil and cook until the liquid evaporates, about 10 minutes. Stir in the 2 tablespoons oil and cook, stirring occasionally, until mushrooms are completely cooked through and well browned, 5 to 10 minutes more. (The mushrooms will shrink quite a bit.) Remove from the heat and sprinkle with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the barley is cooked, drain it well and return to the pot. Let cool until warm, stirring occasionally. (If the dressing is added when the grains are too hot, it will turn brown and taste \"cooked.\") Stir in a little oil if needed to prevent sticking. Stir in dressing and set aside, stirring occasionally, to let the grains absorb the dressing, at least 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, taste the barley and season again. Gently mix in mushrooms, pear and chopped nuts. Transfer to a serving bowl, garnish with lots of dill, and serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1019840-herbed-grain-salad-with-mushrooms-hazelnuts-and-pears"}