{"@context": "http://schema.org", "@type": "Recipe", "name": "Three-Cup Vegetables", "description": "This vegan dish is inspired by <a href=\"https://cooking.nytimes.com/recipes/1017456-three-cup-chicken\">three-cup chicken,</a> a deeply savory Taiwanese specialty that can be traced back to the 13th century, to the execution of Wen Tianxiang, a scholar-general of the Song dynasty who resisted Kublai Khan’s invasion. The night before Wen’s death, a guard is said to have made him the surprisingly pungent chicken dish with the prison’s limited resources. It has many variations, but usually calls for braising chicken in rice wine, soy sauce and sesame oil with plenty of ginger, garlic and basil. Here, root vegetables like carrots, parsnips, sweet potatoes and turnips take the place of the chicken, but feel free to also add tofu and quick-cooking vegetables like broccoli or snap peas with the roots. Serve over rice or ramen noodles to soak up sauce.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/01/17/dining/as-3-cup-roots/as-3-cup-roots-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, easy, for two, lunch, weekday, vegetables", "keywords": "basil, ginger, rice wine, root vegetables, sesame oil, soy sauce, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 938}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 321, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "903 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons canola or other neutral oil", "6 cups root vegetables, such as carrots, parsnips, sweet potatoes and-or turnips, cut into 1/4-inch slices and halved or quartered if large (about 2 pounds)", "1 (1-inch) piece ginger, peeled and thinly sliced", "10 garlic cloves, smashed and peeled", "3/4 cup Chinese rice wine", "6 tablespoons low-sodium soy sauce", "3 tablespoons toasted sesame oil", "2 tablespoons dark brown sugar", "2 dried chiles, like chiles de árbol, or 1/4 teaspoon red-pepper flakes", "2 cups fresh basil leaves, torn if large"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat oil over medium-high heat until it shimmers. Add the vegetables, ginger and garlic, and cook, stirring occasionally, until vegetables are crisp-tender and browned in spots, 7 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the heat to medium and stir in the rice wine, soy sauce, sesame oil, brown sugar and red-pepper flakes. Cook, stirring occasionally, until the vegetables are tender and the sauce has reduced, 10 to 15 minutes. Remove from heat, and stir in the basil."}], "link": "https://cooking.nytimes.com/recipes/1019923-three-cup-vegetables"}