{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Lamb Shanks With Orange and Honey", "description": "There are many ways to cook lamb shanks throughout the year, but these taste like the beginning of spring. The orange fragrance and the honey’s perfume are complemented by the similarly sweet carrots and turnips. A shower of freshly snipped herbs adorns the dish just before serving. The recipe is easy to prepare in two parts: The shanks are simmered to tenderness first, which produces the broth. This can be done several hours ahead or up to 2 days in advance. Then, the bones are removed, and the meat can be finished in the sauce.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/04/04/dining/04Kitchen1/merlin_135562941_5167d051-66ab-4e31-93d9-687c9cebd046-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, meat", "keywords": "arrowroot, carrot, honey, lamb shanks, orange, turnip, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 94}, "recipeIngredient": ["6 meaty lamb shanks (about 6 pounds total)", "Salt and pepper", "1/2 teaspoon cumin seeds", "1/2 teaspoon fennel seeds", "1/2 teaspoon coriander seeds", "1 large onion, cut into thick slices", "2 whole cloves", "1 thyme sprig", "1 bay leaf", "2 tablespoons olive oil", "1 large onion, diced (about 1 1/2 cups)", "Salt and pepper", "1 teaspoon minced garlic", "Pinch saffron", "Pinch cayenne", "1 tablespoon tomato paste", "2 tablespoons honey", "Zest of 1 orange, peeled into wide strips", "1/2 cup orange juice", "1/2 cup white wine", "1 tablespoon arrowroot or cornstarch, dissolved in 2 tablespoons cold water", "2 tablespoons butter", "1 pound carrots, peeled and cut into 2-inch batons", "1 pound turnips, peeled and cut into wedges", "Salt", "2 tablespoons roughly chopped parsley", "2 tablespoons roughly chopped mint", "2 tablespoons roughly chopped dill", "Handful of small basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the lamb shanks: Season shanks generously with salt and pepper. Transfer to a large pot and add cumin seed, fennel seed, coriander seed, onion, cloves, thyme and bay leaf. Pour in enough water to cover shanks, place pot over high heat and bring to a boil. Put on the lid, reduce to a simmer and cook for 1 to 1 1/2 hours, until meat is very tender when probed with the tip of a paring knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove shanks from pot and place on a baking sheet to cool. Strain the broth into a bowl, and skim off any rising fat. Measure 4 1/2 cups broth and set aside. When shanks are cool enough to handle, gently remove the bone from each with your hands, leaving the meat in one or two large pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: In a large, heavy-bottomed pot, warm the olive oil over medium-high heat. Add onion, season with salt and pepper and cook, stirring, until softened and slightly browned. Add garlic, saffron, cayenne, tomato paste and honey and stir to incorporate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add orange zest, orange juice, broth and wine to the pot, and bring to a boil. Turn heat to a brisk simmer and return the meat to the pot. Simmer for 20 minutes, until broth has reduced by an inch or so. Taste broth and adjust seasoning. Add arrowroot mixture and cook for a minute or two, until slightly thickened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the vegetables: In a separate pot, melt butter over medium heat. Fill the pot with 1 inch of water. Add carrots and turnips, salt lightly, cover and turn heat to high. Cook for 10 minutes, or until probed with the tip of a paring knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, transfer meat and sauce to a large, deep platter or serving dish. With a slotted spoon arrange vegetables around the meat. Sprinkle with parsley, mint, dill and basil."}], "link": "https://cooking.nytimes.com/recipes/1019247-spiced-lamb-shanks-with-orange-and-honey"}