{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Broccoli Soup With Cashew Cream", "description": "This nourishing, three-vegetable soup is thick and creamy, even without dairy. It takes very little skill and only 25 minutes to make, but success lies in proper blending: Use a high-powered blender for the creamiest soup, or let it go a few minutes longer in a standard blender. Fennel and celery provide welcome depth, and the quick cashew cream feels luxurious spooned over the top or stirred right in. Save any extra to drizzle on other blended soups or even roasted vegetables. Finish this vibrant bowl with celery leaves, parsley or dill, and two basic but crucial ingredients: an extra drizzle of olive oil and a dusting of freshly ground pepper.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/02/01/dining/sc-broccoli-soup-with-cashew-cream/sc-broccoli-soup-with-cashew-cream-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, for two, lunch, weekday, soups and stews", "keywords": "appetizer, main course, side dish, broccoli, cashew, celery, fennel", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 378}, "recipeIngredient": ["1 1/2 cups raw cashew pieces (or whole raw cashews)", "Fine sea salt", "1 cup boiling water", "1 large head broccoli (about 1 1/2 pounds), florets chopped into bite-size pieces and stems peeled and roughly chopped", "1 small fennel bulb, trimmed, quartered, cored and roughly chopped", "2 large stalks celery, trimmed and roughly chopped, leaves reserved for garnish", "2 tablespoons extra-virgin olive oil, plus more for drizzling", "Torn fresh dill or parsley leaves", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cashews in a blender along with a pinch sea salt. Pour the boiling water on top. Cover and let sit to allow the cashews to soften while you make the soup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the broccoli, fennel, celery, 2 tablespoons oil, 1 teaspoon sea salt and 3 cups water in a pot and cover loosely with a lid, leaving a small opening so steam can escape (this helps the soup keep its bright-green color). Bring to a boil over high, then steam vegetables over medium until they are tender, 8 to 10 minutes. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Purée the cashews and water until completely smooth and frothy (the cashew cream should be the consistency of very loose whipped cream). Add additional water, 1 tablespoon at a time, if desired to thin the mixture. Spoon the cashew cream into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches if necessary, transfer the steamed vegetables and their cooking liquid to the blender and purée on high until completely smooth and frothy. Taste, and add more salt as needed. Divide the soup among bowls and top with cashew cream, celery leaves, dill, pepper and a drizzle of olive oil. Serve warm."}], "link": "https://cooking.nytimes.com/recipes/1019944-vegan-broccoli-soup-with-cashew-cream"}