{"@context": "http://schema.org", "@type": "Recipe", "name": "Niku Jyaga (Japanese Beef and Potato Stew)", "description": "There’s nothing extraordinary about meat and potatoes stewed in a sweet soy broth, and yet it’s easy to find yourself taking just one more taste until half the pot is gone. Patience pays off though: niku jyaga tastes better the second day, when the potatoes are saturated with sauce. Every household makes it a little differently in Japan, and so the flavor is affectionately called “mother’s taste.” Saori Kurioka, a private chef in Brooklyn, cooks hers the same minimalist way her mother and grandmother did in Kobe, with just beef, potatoes, onion and carrot. She uses a wooden otoshibuta, a drop-lid that fits inside the pot, so the vegetables simmer and steam evenly as the broth slowly concentrates, but the same thing can be achieved with parchment paper. Beveling the edges of the potatoes with a peeler keeps them from crumbling as the jostle around the simmering pot, but skip it if you’re rushed or impatient.", "author": {"@type": "Person", "name": "Hannah Kirshner"}, "image": "https://static01.nyt.com/images/2018/07/25/dining/HK-beef-stew-horizontal/merlin_141075267_0c440d4f-8d3e-41a1-a1de-fb7accc83f7b-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "japanese", "recipeCategory": "dinner, lunch, weekday, soups and stews", "keywords": "beef, potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 120}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 281, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "6 grams", "proteinContent": "14 grams", "saturatedFatContent": "1 gram", "sodiumContent": "642 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 medium waxy potatoes, such as Yukon Gold (about 2 1/2 pounds)", "2 medium carrots, peeled", "2 small onions (about 1 pound), peeled", "1 piece dried kombu, about 8 inches by 5 inches, broken in half (optional)", "1/4 cup soy sauce", "3 tablespoons mirin", "3 tablespoons sake", "3 tablespoons raw or turbinado sugar", "8 ounces thinly sliced, well-marbled beef (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel potatoes and cut each into 4 to 6 pieces, so they are relatively uniform in size. Bevel the edges of each piece with a vegetable peeler. Soak in cold water for about 10 minutes to remove some starch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut carrots in rangiri: Hold the knife at a diagonal, and rotate carrot quarter turns to cut irregular, multifaceted chunks. Cut each onion into 6 to 8 wedges, about 3/4 inch wide. Cut beef into 2-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a drop-lid for a 3- or 4-quart heavy-bottomed pot: Cut a circle of parchment paper about 1 inch smaller than the diameter of the pot, and cut a 1/2-inch hole in its center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain and rinse potatoes. Add to pot with carrots, onions and 1 1/2 cups water (it will not fully cover the vegetables). Tuck kombu (if using) into the water. Bring to a boil, then discard kombu. Add soy sauce, mirin, sake and sugar. Add beef, stirring to distribute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place parchment lid directly on top of vegetables and liquid, and simmer — don’t boil — stirring occasionally, for 20 to 25 minutes, until potatoes are very tender. Turn off heat, discard parchment, and rest for at least 30 minutes (overnight is even better) to allow the potatoes to soak up the seasoning. Reheat, and serve with white rice, or a frosty beer."}]}