{"@context": "http://schema.org", "@type": "Recipe", "name": "Bacon Cornbread With Cheddar and Scallions", "description": "This cornbread hits all the notes, but skews particularly salty and savory, thanks to sautéed scallions, extra-sharp Cheddar, and bacon, folded into the batter and crowning the top of the cornbread. You can use fancy, thick-cut bacon or flimsier thin-cut varieties. Each has its benefits: Thinner bacon slices form a light, crunchy layer on the crust, while thick-cut slices have more presence in the cornbread. This cornbread belongs at brunch, where it pairs well with eggs cooked in any style, sautéed vegetables and even breakfast sausages, but it would also be at home next to a bowl of chili. If preparing for a crowd, you can bake this off a day in advance and reheat it in the oven just before serving.", "author": {"@type": "Person", "name": "Klancy Miller"}, "image": "https://static01.nyt.com/images/2019/01/30/dining/KM-BACON-CORNBREAD/KM-BACON-CORNBREAD-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, dinner, lunch, breads", "keywords": "bacon, cheddar, cornmeal, scallion, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 17}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 589, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "2 grams", "proteinContent": "19 grams", "saturatedFatContent": "16 grams", "sodiumContent": "724 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 slices thick-cut bacon (about 1 pound)", "1/4 cup plus 1 teaspoon extra-virgin olive oil", "2 cups chopped scallions (from about 4 bunches)", "Kosher salt", "Butter, for greasing the pan", "1 cup medium-grind stone-ground cornmeal", "1 cup all-purpose flour", "1 tablespoon baking powder", "1 cup whole milk", "1 egg, beaten", "1 tablespoon honey", "8 ounces extra-sharp Cheddar, grated (about 2 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Line a large baking sheet with aluminum foil. Place a wire cooling rack on top of the baking sheet and arrange the bacon on the rack. Bake until the bacon is crisp, 20 to 25 minutes. Remove from oven and let cool. Set 5 bacon strips aside, then chop remaining bacon into small pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 1 teaspoon olive oil in a medium skillet over medium. Add the chopped scallions, sprinkle with a small pinch of salt and cook, stirring occasionally, until the scallions are browned in spots, about 5 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a round 8-inch springform pan or cake pan with butter. In a large bowl, whisk together the cornmeal, flour, baking powder and 1/2 teaspoon kosher salt. Add the milk, egg, honey and 1/4 cup olive oil and whisk until smooth. Stir in the chopped bacon, scallions and cheddar cheese. Pour the batter into the prepared pan; use a spoon to spread the batter into an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the remaining bacon strips on top of the batter, trimming them as necessary, then bake until the cornbread is browned and firm in the center, 40 to 45 minutes. Let cool in the pan for 5 minutes, then run a kitchen knife around the edges of the pan to loosen. Cut into pieces and serve warm."}], "link": "https://cooking.nytimes.com/recipes/1019946-bacon-cornbread-with-cheddar-and-scallions"}