{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry Herringbone Pie", "description": "This pie is both sweet and slightly tart, with deep flavors of citrus and warm spices to complement the cranberries, and a showstopper of a lattice on top. The process for weaving the herringbone pattern looks quite long below, but if you follow the instructions and watch the video here (or check out this <a href=\"https://www.facebook.com/nytcooking/posts/2145990765445379\">photo album</a>), you’ll get the hang of it quickly — and you’ll have a seriously impressive end result. The filling, which comes together easily, can be made up to 2 days ahead, but the pie is best served the day it is baked.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2018/11/14/dining/14Cranberry-herringbone-pie/14Cranberry-herringbone-pie-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "cranberry, orange, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 163}, "recipeIngredient": ["2 ½ pounds/1.2 kilograms cranberries, thawed if frozen", "Zest and juice of 2 oranges (about ½ cup juice)", "1 1/3 cups/265 grams granulated sugar", "1 teaspoon ground ginger", "1 teaspoon ground cinnamon", "½ teaspoon ground cloves", "Pinch of fine sea salt", "1 ½ teaspoons vanilla extract", "¼ teaspoon almond extract", "<a href=\"https://cooking.nytimes.com/recipes/1019713-perfect-pie-crust\">Perfect Pie Crust,</a> doubled, prepared for a fruit pie and chilled", "Egg wash (1 large egg mixed with 1 tablespoon water), for finishing", "Turbinado sugar, as needed for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot over medium heat, combine the cranberries, orange zest, orange juice, sugar, ginger, cinnamon, cloves and salt. Cook, stirring occasionally, until the berries begin to soften and break down, 12 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend the mixture with an immersion blender, or in a blender or food processor, just until it’s a coarse purée. Return the mixture to the heat and continue to cook, stirring often to prevent scorching, until the mixture has reduced slightly and the juices have thickened, 8 to 10 minutes more. Stir in the vanilla and almond extracts and let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface and using a lightly floured rolling pin, roll out a disk of dough into a circle about ¼-inch thick. Starting at one end, gently roll up the dough onto the rolling pin. Unfurl the dough over a 9-inch pie plate, preferably ceramic, and press it in lightly, making sure it’s lining the plate. Trim so that there’s about ½ inch of excess dough hanging over the edge of the pie plate. Pour the cooled filling into the crust and smooth into an even layer. Refrigerate while you prepare the top crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the remaining dough into a rectangle about 9 inches wide and ¼-inch thick. Roll up the dough onto the rolling pin and unfurl it onto a parchment-lined baking sheet. Using a ruler and a pastry wheel or paring knife, trim away the uneven edges. Cut the dough into strips ½-inch wide; you’ll need 18 strips. If the dough becomes warm and difficult to handle, return the whole pie and sheet of strips to the refrigerator once or twice, or keep the strips in the refrigerator, retrieving them one at a time as you weave."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To form the lattice, place 9 strips evenly spaced across the pie vertically. Next, place the first horizontal strip across the center of the pie: Start by folding up the first vertical strip of dough, then skip three strips (do not fold up), then fold up the following three pieces of dough, leaving the final strips untouched. Place the horizontal dough strip across the center. Return the folded back strips back down over the horizontal strip."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the next horizontal strip below the first: Fold up the first two vertical strips of dough. Skip the next three strips (do not fold up), then fold up the following three pieces of dough, leaving the final strip untouched. Place the horizontal strip so it’s spaced evenly from the first one you laid down (they should have the same space between them as the vertical strips have between each other). Return the folded strips back down over the horizontal strip."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the next horizontal strip below the previous one: Fold up the first three vertical strips of dough. Skip the next three strips (do not fold up), then fold up the following three pieces of dough. Place the horizontal strip, and return the folded strips back down over it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the next horizontal strip below the previous one: Skipping the first vertical strip of dough, fold up the next three. Skip the following three strips (do not fold up), then fold up the remaining two strips. Place the horizontal strip, and return the folded strips back down over it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the next horizontal strip below the previous one: Skipping the first two vertical strips of dough, fold up the next three. Skip the following three strips (do not fold up), then fold up the remaining strip. Place the horizontal strip, and return the folded strips back down over it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the next horizontal strip above the first one you placed (in the center): Skip the first three vertical strips of dough (do not fold up), then fold up the next three strips, skipping the final three strips. Place the horizontal strip, and return the folded strips back down over it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the next horizontal strip above the previous one: Skip the first two vertical strips of dough (do not fold up), then fold up the following three pieces of dough. Skip the next three (do not fold up), then fold back the final strip. Place the horizontal strip, and return the folded strips back down over it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the next horizontal strip above the previous one: Fold up the first three vertical strips of dough. Skip the next three strips (do not fold up), then fold up the following three pieces of dough. Place the horizontal strip, and return the folded strips back down over it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the final horizontal strip above the previous one: Fold up the first two vertical strips of dough. Skip the next three strips (do not fold up), then fold up the following three pieces of dough, skipping the last strip. Place the horizontal strip, and return the folded strips back down over it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pinch the edges of the lattice strips and bottom crust together to seal. Trim away any excess with scissors, leaving ½ inch around the outside rim of the plate. Tuck the excess crust up and over to encase the lattice; press firmly to seal them together and make a uniform edge. The pie can be left like this for a straight-edge finish, or crimped as desired. Refrigerate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a rack on the bottom shelf of the oven, and place a baking stone, if you have one, on the rack. Heat the oven to 425 degrees. Line a baking sheet with parchment paper or foil. Transfer the pie to the baking sheet, and brush egg wash on the lattice strips. (Don’t add egg wash to the crimped edges; they’ll brown sufficiently on their own.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the pie with turbinado sugar and transfer the baking sheet to the oven, placing it directly on the baking stone if using. Bake until the top crust is evenly golden and the filling has puffed up slightly, 45 to 50 minutes. Tent with foil in the last 5 to 10 minutes of baking if the crust is becoming too dark."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool on a rack for at least 40 minutes before slicing and serving. The pie is best the day it is baked. Store leftovers at room temperature, wrapped tightly in plastic."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Cranberry Herringbone Pie", "description": "Cranberry Herringbone Pie", "thumbnailUrl": "https://static01.nyt.com/images/2018/11/14/dining/14Cranberry-herringbone-pie/14Cranberry-herringbone-pie-mediumThreeByTwo440.jpg", "uploadDate": "2018-11-07T22:32:45.000Z", "duration": "PT2M47S"}}