{"@context": "http://schema.org", "@type": "Recipe", "name": "Crisp Zucchini Blossoms Stuffed With Goat Cheese", "description": "Zucchini blossoms are a thing of wonder. They are great raw, in a salad, with a drizzle of good olive oil, but when they are coated in a crisp batter and stuffed with a light filling, they are an otherworldly experience. To get a good batter that isn’t too thick or oily, ensure that your sparkling or soda water is very well carbonated and ice cold. Also take your time with the oil, testing it a few times to get the perfect temperature. Adjust the temperature as you go, making sure the flowers don’t color too quickly.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2018/07/18/dining/18ottolenghirex2/merlin_141025776_9c91064a-19e9-4e0c-8869-574358d596ee-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 appetizer servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, ricotta, soda water, sunflower oil, zucchini flowers", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 98}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 282, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "5 grams", "sodiumContent": "289 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 tablespoon ground sumac", "Boiling water", "1/4 cup/50 grams ricotta", "3 tablespoons/50 grams soft goat cheese", "1 teaspoon finely chopped oregano leaves", "2 tablespoons/10 grams chopped walnuts", "1 lemon, finely grated to get 1 tablespoon zest, then cut into wedges", "Flaky sea salt and black pepper", "8 zucchini blossoms", "About 1 1/2 cups/350 milliliters sunflower oil, for frying", "Scant 1/2 cup/60 grams all-purpose flour (plain flour)", "1/8 teaspoon baking soda (bicarbonate of soda)", "1/3 cup plus 1 tablespoon/100 milliliters ice-cold sparkling or soda water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, cover 3/4 tablespoon of the sumac with 1 tablespoon of boiling water and leave to infuse for 5 minutes. Add both types of cheese, oregano, walnuts, lemon zest, 1/4 teaspoon salt and a generous grind of pepper. Mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the flowers by carefully opening them and either spooning or piping about a tablespoon of the ricotta mixture into each, gently pushing the filling all the way to the bottom of each blossom but being careful not to fill them too much; if you can get someone to hold the flower open for you, it would make it much easier. Gently twist the tips of the petals to secure the filling inside and set aside until you’re ready to fry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour enough oil into a medium (about 8-inch/20-centimeter) nonstick frying pan so that the oil rises about 1 inch/2 centimeters up the sides of the pan. Place on a high heat for 5 minutes and then turn the heat down a fraction."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, mix the flour and baking soda together in a medium bowl. Slowly pour in the sparkling water, whisking continuously to form a smooth batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When bubbles start to surface in the oil, test it by dropping some batter into the oil: if it sizzles, you are ready. (The oil should hover between 320 and 350 degrees Fahrenheit/160 and 180 degrees Celsius.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower a zucchini blossom into the batter, turning to coat completely, before carefully placing in the hot oil. Repeat, cooking a few blossoms at a time, adjusting the temperature between batches so they take about 30 seconds on each side to turn a golden brown. Use a slotted spoon to transfer to a paper towel-lined plate and then sprinkle with salt and the remaining 1/4 tablespoon sumac. Serve at once with the lemon wedges alongside."}], "link": "https://cooking.nytimes.com/recipes/1019415-crisp-zucchini-blossoms-stuffed-with-goat-cheese"}