{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Noodles With Chile Oil and Citrusy Cabbage", "description": "While cold chile noodles are often seen as a side dish, here they act as the anchor of the entire meal. They are delicious on their own, and it would be hard to go wrong with any pairing. A salad of fresh herbs (cilantro, dill, mint, parsley) topped by a creamy tahini dressing is a good place to start. From there, feel free to include a mess of citrusy cabbage and whatever blanched, roasted or raw vegetables you may have on hand for texture. While these suggestions are optional (it doesn't have to be vegetarian: shredded rotisserie chicken or last night's pork chop would also be welcome), seek out saucy, herby, crunchy, tangy and spicy ingredients to liven up an already lively bowl of noodles.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/01/02/dining/02Roman-C/merlin_148228458_814e4753-c89a-45ac-a80d-8bd7e484722c-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, noodles", "keywords": "cabbage, scallion, tahini, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 483}, "recipeIngredient": ["1/2 cup canola or grapeseed oil", "1 tablespoon fennel seed", "1 tablespoon red-pepper flakes", "2 garlic cloves, very finely chopped", "1 tablespoon Sichuan peppercorns (optional)", "1 star anise (optional)", "1 pound udon, soba or rice noodles, or spaghetti", "2 tablespoons rice wine vinegar, or fresh lemon or lime juice", "Kosher salt and ground pepper", "1/2 head red cabbage, very thinly sliced", "Kosher salt and ground pepper", "1/4 cup fresh lemon and-or lime juice", "1 tablespoon finely grated lemon and-or lime zest", "2 tablespoons olive oil", "1/3 cup tahini", "1 garlic clove, finely grated", "2 tablespoons fresh lemon or lime juice", "1 tablespoon sesame oil", "1 cup parsley and-or cilantro, tender leaves and stems, very finely chopped", "Kosher salt and ground pepper", "1 bunch scallions, very thinly sliced", "1/4 cup olive oil", "2 tablespoons fresh lemon or lime juice", "1 tablespoon finely grated lemon or lime zest", "1 tablespoon soy sauce", "Kosher salt and ground pepper", "More spicy things: Jarred pickled chiles, pickled jalapeños, Calabrian chiles — anything of the sort that will (lightly) set your mouth on fire are welcomed here.", "Toasted seeds or nuts: Toast sesame seeds, chopped peanuts or almonds in a dry skillet until golden brown and toss with a little oil and salt; sprinkle over everything."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil, fennel seed, pepper flakes, garlic, Sichuan peppercorns and star anise (if using) in a small pot over the lowest heat possible. Cook, swirling occasionally, until you start to hear and see the garlic and spices frizzle and toast in the oil, 5 to 8 minutes. (Every stove is different and sometimes the low isn’t as low as we’d like, so keep an eye on things; it may take less time.) Keep cooking at the lowest heat setting until the spices are toasted and the garlic is golden brown, another 3 to 5 minutes. Remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook noodles in a large pot of salted water until al dente. Drain and rinse under cold water to stop the cooking. (If not using right away, spread onto a rimmed baking sheet and toss with a little canola oil to prevent sticking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If serving the citrusy cabbage, place cabbage in a large bowl and season with salt and pepper. Add citrus juice and zest, tossing to coat. Let sit a few minutes to soften. Drizzle with olive oil before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If serving the tahini sauce, whisk tahini, garlic, lemon juice, sesame oil and 1/4 cup water in a small bowl until a creamy dressing forms. (Tahini thickness varies greatly from brand to brand; if you need more water to achieve a smooth, creamy dressing, add it by the teaspoonful until you get the desired texture.) Add herbs and season with salt, pepper and more lemon juice, if desired. Alternatively, place all ingredients and 1/4 cup water in the bowl of a food processor and process until a smooth, creamy dressing forms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If serving the lemony scallions, combine scallions, olive oil, lemon juice, lemon zest and soy sauce in a small bowl; season with salt and pepper and let sit for at least 5 minutes before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to eat, toss noodles with vinegar and season with salt and pepper. Spoon chile oil over the noodles, tossing to coat; keep adding the oil until your noodles are evenly coated. (Keep in mind you have other sauces for the noodles, so you’re just looking for them to be coated and sufficiently spicy.) Serve any additional chile oil alongside for personal spooning, with the cabbage and other sauces if you like. See the notes for adding more spicy things and blanched or roasted vegetables."}]}