{"@context": "http://schema.org", "@type": "Recipe", "name": "Pastitsio (Greek Baked Pasta With Cinnamon and Tomatoes)", "description": "This comforting Greek baked pasta, which bears a striking resemblance to lasagna, derives its name from the Italian word “pasticcio.” That translates to English as “a mess,” indicating the forgiving, flexible nature of the dish. Many traditional pastitsio recipes call for beef –– which you can certainly use here –– but we use ground lamb for a fresh take on a classic (and many cooks prefer a combination). Because kefalotyri cheese and the long tubular noodles traditionally used in pastitsio can't be found in most American supermarkets, we substituted Parmesan and ziti in their place, but by all means, if you can get your hands on the real things, use them. The noodles and spiced meat sauce are layered in a casserole dish then topped with a creamy béchamel sauce and baked until golden. It’s project cooking that’s perfect for a cold winter’s night.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/12/20/dining/CH-pastitsio/CH-pastitsio-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "greek", "recipeCategory": "pastas", "keywords": "canned tomatoes, cinnamon, ground lamb, pasta, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 64}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 809, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "6 grams", "proteinContent": "39 grams", "saturatedFatContent": "21 grams", "sodiumContent": "1044 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil", "1 medium red onion, finely chopped", "2 garlic cloves, finely chopped", "2 pounds ground lamb", "1 tablespoon roughly chopped fresh oregano", "1 tablespoon roughly chopped fresh thyme", "2 teaspoons ground cinnamon", "Kosher salt and black pepper", "1 (28-ounce) can crushed tomatoes", "1 (14-ounce) can diced tomatoes", "2 1/2 cups whole milk", "4 tablespoons unsalted butter (1/2 stick)", "1/4 cup all-purpose flour", "1/4 teaspoon freshly grated nutmeg", "1 1/2 cups grated Pecorino or Parmesan cheese", "1 pound ziti or penne pasta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: In a large, deep skillet, heat the olive oil over medium. Add the onion and cook, stirring occasionally, until softened, about 5 minutes. Add the garlic and cook, stirring, 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the lamb, breaking up the meat with a spatula or wooden spoon, and cook until the moisture has evaporated and the meat is browned, 12 to 15 minutes. Stir in the oregano, thyme and cinnamon, and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the crushed and diced tomatoes and their juices and bring to a simmer. Cook, stirring occasionally, until the flavors meld, 20 to 25 minutes. Season to taste with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees and bring a large pot of salted water to a boil. Start the béchamel: In a medium saucepan, bring the milk to a simmer over medium. Make the roux: In a small saucepan, melt the butter over medium-low. Whisk the flour into the butter until a smooth, golden paste forms, about 2 minutes. Gradually whisk the warmed milk into the roux and cook, stirring frequently, until the sauce is smooth and thick, about 3 to 5 minutes. Whisk in the nutmeg and 1 cup cheese, season with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the water boils, cook the pasta according to package instructions until 2 minutes short of al dente (the pasta will finish cooking in the oven). Drain and transfer it to a 9-by-13-inch baking dish.<strong> </strong>Drizzle with 1/2 cup béchamel and carefully stir in 2 cups meat sauce. Spoon the remaining meat sauce on top, then drizzle evenly with the remaining béchamel. Sprinkle with the remaining ½ cup cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dish on a parchment-lined sheet pan and bake until the top is golden and begins to bubble, about 25 to 30 minutes. Allow the pasta to stand for 10 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1019858-pastitsio-greek-baked-pasta-with-cinnamon-and-tomatoes"}