{"@context": "http://schema.org", "@type": "Recipe", "name": "Brandy Crusta", "description": "More than most cocktails, a properly made brandy crusta requires a little effort. Achieving an even sugar rim on a glass and paring a long lemon twist (known as a horse's neck) may take a few tries before you get it right. This recipe, to be used at the new New Orleans bar Jewel of the South, is not very far removed from the one first printed by the bartender Jerry Thomas in his seminal 1862 cocktail manual. Thomas credited the drink’s inventor, the New Orleans bartender Joseph Santini, who had his own bar named Jewel of the South. The resulting cocktail may look too beautiful to drink. But that’s what iPhones are for. Take a picture and get to drinking.", "author": {"@type": "Person", "name": "Robert Simonson"}, "image": "https://static01.nyt.com/images/2018/12/05/dining/05jewelrex/05jewelrex-articleLarge.jpg", "recipeYield": "1 drink", "recipeCuisine": "", "recipeCategory": "cocktails", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 22}, "recipeIngredient": ["Lemon juice, for the sugared rim", "Sugar, for the rim", "Peel of 1 lemon, for garnish", "2 ounces Cognac, preferably Pierre Ferrand 1840", "1/2 ounce lemon juice", "1/2 ounce Curaçao, preferably Pierre Ferrand", "1/4 ounce maraschino liqueur", "2 dashes Angostura bitters"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take a small wine glass, wet the rim with lemon juice, then dip in sugar to create an even sugar rim on the glass."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a Y-peeler. begin at the top of the lemon and peel a long, continuous twist, using as much of the skin as possible. Carefully position this twist inside the prepared glass, creating an internal spiral of lemon peel that reaches the top of the glass."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all liquid ingredients in a cocktail shaker filled with ice and shake until cold, about 15 seconds. Strain into the prepared glass."}], "link": "https://cooking.nytimes.com/recipes/1019640-brandy-crusta"}