{"@context": "http://schema.org", "@type": "Recipe", "name": "Karaage (Japanese Fried Chicken)", "description": "At Kunyan, a ramen shop in a mountain hot-spring town near the Sea of Japan, fried chicken is served until 2 a.m., or whenever the last customer leaves. The flesh is firm and flavorful with sweetened soy and garlic, coated in a fox-colored crust of potato starch that stays crisp on the table through a second round of highballs. Kunyan’s “mama,” who presides over pan-frying gyoza and pouring frothy Super Dry beer, would never give up her recipe, but the flavors in this version are awfully similar. To approximate the best Japanese chicken — meatier, fattier, and more flavorful than American supermarket meat — buy your chicken from a farmers' market, and debone it yourself or ask a butcher. Don’t feel pressure to do it perfectly: The pieces will be encrusted in a crisp coating, and the leftover bones make great stock.", "author": {"@type": "Person", "name": "Hannah Kirshner"}, "image": "https://static01.nyt.com/images/2018/07/25/dining/HK-karaage-horizontal/merlin_141075300_74569dec-9fc2-4174-931d-019dddef3bb8-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 to 4 servings", "recipeCuisine": "japanese", "recipeCategory": "poultry", "keywords": "appetizer, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 590}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 458, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "1 gram", "proteinContent": "24 grams", "saturatedFatContent": "6 grams", "sodiumContent": "775 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 teaspoons grated fresh ginger, with its juice", "2 teaspoons grated or smashed garlic (from about 3 cloves)", "2 tablespoons dry sake", "3 tablespoons soy sauce", "2 teaspoons sugar", "4 skin-on chicken thighs (about 1 1/2 to 2 pounds), deboned, cut into 2-inch chunks", "Peanut oil, or a mixture of peanut and canola or safflower, for frying", "1 cup potato starch (katakuriko)", "1/4 teaspoon fine sea salt", "1/2 teaspoon black pepper", "Lemon wedge, for serving", "Lettuce and cucumber slices, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a shallow baking dish large enough to hold the chicken, combine ginger, garlic, sake, soy sauce and sugar. Toss chicken pieces in marinade to coat. Cover and refrigerate for 24 to 48 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill an aluminum or thin stainless steel<strong> </strong>pot (best for quick temperature adjustments), with sides at least 5 inches tall, with about 3 inches of peanut oil. Heat the oil to 350 degrees. Place several layers of newsprint or paper towels on a sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the oil heats, place a wire rack over a second sheet pan. In a bowl, combine potato starch, salt and pepper. Remove one piece of chicken at a time from marinade, and tuck in any jagged bits or skin as you roll it in starch mixture to coat. Rest it on the rack. Repeat with all chicken pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently shake off excess potato starch before cooking each piece of chicken. Fry 3 or 4 pieces at a time, keeping oil temperature around 325 degrees (temperature will fall when you add chicken) and no lower than 300 degrees. Fry for about 3 minutes, or until golden. Remove from oil using a wire-mesh spoon or long chopsticks, and cool on newsprint or paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the chicken has been fried once, increase the oil’s temperature to 375 degrees. Fry chicken pieces a second time, keeping the oil between 350 and 375 degrees, until the crust is deep golden brown, about 1 minute. Drain on newsprint or paper towels. This second frying makes the coating stay extra crisp, even if you don’t serve it immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot or at room temperature, with a lemon wedge, and lettuce and cucumber slices for a cool, fresh contrast, if you like."}], "link": "https://cooking.nytimes.com/recipes/1019428-karaage-japanese-fried-chicken"}