{"@context": "http://schema.org", "@type": "Recipe", "name": "BLT Pasta", "description": "When another summer tomato sandwich just won’t do, try this BLT pasta instead. This clever twist on the classic sandwich substitutes spicy arugula for lettuce and in-season cherry tomatoes for heirlooms, which cook in bacon fat and produce a silky, smoky sauce. If baby arugula is out of reach, baby spinach, watercress or Swiss chard would work well in its place. Serve with a raw, shaved zucchini salad tossed with lemon juice, olive oil and mint.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/08/17/dining/colu-henry-blt-pasta-horizontal/merlin_142422969_b2e26882-221d-44ee-8fd9-efe4ad1d33be-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, weeknight, pastas", "keywords": "arugula, bacon, cherry tomatoes, pasta, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 613}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 502, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "4 grams", "proteinContent": "19 grams", "saturatedFatContent": "7 grams", "sodiumContent": "522 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound paccheri pasta or other tubelike shape, such as penne or rigatoni", "8 ounces bacon, diced into 1/2-inch pieces", "1 pound cherry tomatoes, halved", "Kosher salt and black pepper", "5 ounces baby arugula", "1/2 cup grated Pecorino Romano, plus more for serving", "Flaky salt, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water (2 heaping tablespoons kosher salt to about 7 quarts water) to a boil. Add pasta and cook until it is just under al dente, 1 minute less than package directions. Reserve 1 cup of the pasta cooking water, and drain the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the sauce: Place the bacon in a large skillet and cook over medium-low heat until crisp, stirring occasionally to make sure it does not burn, about 8 minutes. Remove with a slotted spoon and set aside on a plate lined with paper towels. Turn heat to medium and add the tomatoes to the skillet, tossing them to coat in the bacon fat. Season with salt and pepper. As the moisture from the tomatoes releases, scrape any browned bits that have accumulated at the bottom of the pan (add a few tablespoons of the pasta water if you need to) and continue to cook until the tomatoes begin to fall apart, about 5 to 7 minutes more. Add half the cooked bacon back to the skillet and toss to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat to medium-high and add the pasta directly to the skillet tossing to coat with the sauce. Add the arugula and 1/4 cup of the pasta water and carefully toss (you'll have a very full pan) until the arugula wilts. Add the cheese and an additional 1/4 cup pasta water and toss together until the cheese emulsifies and the pasta is glossy with sauce. If needed, add another 1/4 cup pasta water to loosen the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve in bowls and top with remaining bacon. Pass the grated Pecorino Romano at the table and season with flaky salt, if desired."}]}