{"@context": "http://schema.org", "@type": "Recipe", "name": "Simmered Kabocha Squash With Scallions", "description": "When you can’t eat one more roasted winter vegetable, this bright, fragrant soup-stew does the trick. It's from “A Common Table” by Cynthia Chen McTernan, who publishes a food blog called Two Red Bowls. Kabocha, which she calls her “soul-mate squash,” has a special earthy texture and a nutty flavor, but you could also do this with buttercup squash. Serve as a side dish, or as a light dinner with freshly cooked rice and a fried egg.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2018/11/21/dining/21leftovers-rex-squash/merlin_146551059_a5e7676e-8b4d-4cad-b470-2ed9b5029d6f-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 to 8 servings", "recipeCuisine": "american, chinese", "recipeCategory": "dinner, easy, lunch, quick, weekday, weeknight, vegetables", "keywords": "fall, winter, healthy, vegan, vegetarian, kabocha, scallion, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 127}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 231, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "8 grams", "proteinContent": "4 grams", "saturatedFatContent": "0 grams", "sodiumContent": "1220 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons vegetable oil, such as canola or peanut", "8 to 10 cups cubed kabocha squash, skin off or on (from 1 squash, 2 to 3 pounds); see note", "1/2 cup thinly sliced or chopped scallions (6 to 8 scallions), more for serving", "About 1 cup chicken or vegetable broth", "Salt and ground black pepper", "Sriracha, soy sauce or both, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide skillet or wok, heat the oil over high heat until shimmering. Add the squash and toss with a spatula until evenly coated with oil. Cook, stirring occasionally, until lightly caramelized, 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to medium and add the scallions. Stir, then add 1/2 cup of broth and stir again. Adjust the heat to a simmer. If using skin-on squash, turn the pieces so that the skin is submerged; this allows them to cook evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and simmer until squash is tender and skin (if using) is cooked through, 10 to 15 minutes. Check occasionally to make sure the pot isn’t cooking dry; add broth as needed to keep the mixture simmering. The broth will reduce and thicken into a light sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cooked through, sprinkle generously with salt and pepper, stir and taste the squash and the broth. Add salt and pepper as needed. Serve hot, sprinkled with extra scallions. Ladle a little extra hot broth over each serving. "}], "link": "https://cooking.nytimes.com/recipes/1019740-simmered-kabocha-squash-with-scallions"}