{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Vegetable Salad", "description": "This simple salad is seasoned with nothing more than salt, pepper and a drizzle of olive oil. Made with fresh summer produce, it allows the vegetables’ flavor and sweetness to shine through, needing little adornment. But you can also dress the salad with oil and vinegar and garnish with some meaty anchovy fillets, or use an anchovy vinaigrette (see note); these are just as delicious spooned over large spicy arugula leaves. Halved nine-minute eggs would be another nice accompaniment.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/09/05/dining/05kitchenrex1/merlin_142336809_b04c6153-7f27-4348-b508-6e90c5a94a78-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "brunch, lunch, beans, salads and dressings, vegetables", "keywords": "cranberry beans, eggplant, romano beans, tomato, side dish, summer, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 87}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 95, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "6 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "630 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["3 cups fresh coco, cranberry beans or other fresh shelling beans, from about 2 pounds in the pod", "Extra-virgin olive oil", "Kosher salt and black pepper", "1 sprig thyme or rosemary, or 1 bay leaf", "1 pound Romano beans (sometimes called flat beans or runner beans), topped and tailed", "2 medium eggplants (about 1 pound), peeled, if desired", "1 1/2 pounds medium and cherry tomatoes, preferably of different colors, quartered, cut into wedges, or halved, as necessary", "Anchovy fillets or anchovy vinaigrette, optional (see note)", "Basil leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the shelling beans in a pot with water just to cover. Add 1 tablespoon olive oil, a good pinch of salt and herb sprig. Bring to a boil, then reduce to a gentle simmer for about 30 minutes, until beans are tender. Remove from heat, but let beans remain in their broth to stay moist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a pot of well-salted water to a boil. Add the Romano beans and cook for 2 to 3 minutes, leaving them slightly al dente. Drain and spread the beans out on a large plate to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut eggplant crosswise into 1/2-inch slices. Paint each slice lightly with olive oil on both sides, then season with salt and pepper on both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a hot grill, under a hot broiler, or in a dry cast-iron skillet over medium-high heat, cook eggplant slices, in batches, for about 3 minutes per side until softened and lightly browned. With a spatula, transfer slices to a platter in one layer to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the salad, drain the shelling beans (save broth for another use), discarding herb sprig, and place in a wide, deep platter or salad bowl. Season lightly with salt and pepper and a tablespoon of olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the Romano beans and tomatoes lightly with salt and pepper and a tablespoon of olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top shelling beans with Romano beans and tomatoes and toss briefly. Tuck grilled eggplant slices here and there. Garnish with basil leaves and anchovy fillets, if using. Drizzle with vinaigrette, if using. Serve at room temperature."}]}