{"@context": "http://schema.org", "@type": "Recipe", "name": "The Greenest Green Salad", "description": "The cookbook author Jessica Battilana's advice to home cooks is simple: \"If you're going to spend your energy somewhere, spend it somewhere that matters.\" Put her philosophy into practice and make this simple, satisfying salad. All the ingredients can be easily found at any grocery store, and the salad will come together quickly in the kitchen, though it looks and tastes like it requires much more effort and time to prepare. Perhaps most happily, even the most discerning critics — the 4-and-under crowd — will delight in its flavor and crunch and politely ask for seconds.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2018/04/29/magazine/29mag-eat1/29mag-eat1-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "avocado, cucumber, green onion, romaine, snap peas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 752}, "recipeIngredient": ["2 cups snap peas, trimmed", "2 hearts of romaine lettuce, washed and cut into bite-size pieces", "2 Persian or Japanese cucumbers, diced", "2 green onions, thinly sliced", "1 ripe avocado, cubed", "1 recipe <a href=\"https://cooking.nytimes.com/recipes/1019286-green-goddess-dressing\">green goddess dressing</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large plate with paper towels. Set aside. Bring a medium saucepan of generously salted water to a boil over high heat. Add the snap peas, and cook until just tender, about 90 seconds. Use a strainer to remove the peas onto the prepared plate, and spread out in a single layer. Allow to cool and dry completely (the dressing won’t stick to a wet snap pea). Cut each pea in half crosswise on the bias."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the snap peas, romaine, cucumbers and green onions. Mix well to combine. Add the avocado and about half the dressing. Mix gently with your hands until the salad is well coated with dressing, adding more if necessary. Taste, and adjust seasoning with salt and pepper. Serve cold, immediately. Cover and refrigerate remaining dressing for up to 1 week."}], "link": "https://cooking.nytimes.com/recipes/1019284-the-greenest-green-salad"}