{"@context": "http://schema.org", "@type": "Recipe", "name": "Meatloaf Stroganoff", "description": "This meatloaf pays homage to one that was served at the old M. Wells in Long Island City, when the restaurant was in a dodgy old diner where the cooks did prep work on the lunch counters and the vents occasionally caught fire. The chef, Hugue Dufour, folded knuckles of foie gras into this marvelous Stroganoff gravy that he used to nap big loaves of aged-beef meatloaf. I’ve made versions at home with beef and lamb and pork covered in sauce made with mushrooms both wild and supermarket-bland. I’ve spooned canned foie gras into my meatloaf mixture to mimic the original, and I’ve dotted it into the finished sauce as well. That last maneuver was in truth more successful, providing pops of richness against the silkiness of the cream, but I’ve also omitted the foie entirely and no one has been the poorer for it. The adaptations hardly matter. Make a good and juicy meatloaf with the best meat you can find, and cover it with mushrooms and cream. You’ve got a meal to suggest magic.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/02/17/magazine/17mag-eat-slide-Y0D9/17mag-eat-slide-Y0D9-articleLarge.png", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "american, canadian", "recipeCategory": "dinner, lunch, casseroles, meat, times classics, vegetables", "keywords": "chicken-liver pâté, cultivated mushrooms, panko bread crumbs, parsley, sour cream, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 453}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 947, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "77 grams", "fiberContent": "2 grams", "proteinContent": "39 grams", "saturatedFatContent": "38 grams", "sodiumContent": "1167 milligrams", "sugarContent": "8 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["4 tablespoons unsalted butter", "1 large yellow onion, peeled and diced", "1 pound cultivated mushrooms, like button or cremini, cleaned, trimmed and thinly sliced", "Kosher salt and freshly ground black pepper, to taste", "1 cup panko bread crumbs", "1 1/2 pounds ground beef", "1 large egg, beaten", "1 tablespoon plus 1 teaspoon tomato paste", "2 teaspoons smoked paprika", "2 cups chicken stock, homemade or store-bought", "2 teaspoons Worcestershire sauce", "1 1/2 cups sour cream", "1/2 cup heavy cream", "4 ounces chicken-liver pâté or canned cooked foie gras, optional", "3 tablespoons finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350. Melt the butter in a large skillet or Dutch oven set over medium-high heat, and when it foams, add the onion and mushrooms. Stir to coat the vegetables with fat, season with salt and pepper and cook, stirring occasionally, until the onions are translucent and the mushrooms have started to brown, about 15 minutes. Transfer half the mushroom mixture to a large bowl, and set the skillet aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meatloaf: Mix the panko into the mushroom mixture in the bowl, then add the meat, and mix again, making sure not to overhandle the meat. Add the egg, and mix again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a sheet pan, and shape the mixture into a 11-by-8-inch rectangle (it should be about the size of a sheet of paper). Bake until firm and nicely browned, approximately 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the gravy: Return the skillet with the remaining mushroom mixture to the stove, and heat over a medium flame. When the mixture is hot and glistening, stir in the tomato paste and paprika. Cook, stirring occasionally, until the tomato paste just begins to caramelize, about 2 minutes. Stir in the stock and Worcestershire, and cook until it begins to simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the sour cream into a medium bowl, and add to it 1/4 cup of the hot liquid from the mushroom mixture in the skillet. Stir until combined and warmed. Stir the tempered sour cream and the heavy cream into the mushroom mixture, then heat until warmed, about 5 minutes. Taste, and add salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the meatloaf is done, remove it from the oven, and allow to rest for 10 minutes, then place on a serving platter. Add spoonfuls of the pâté or foie gras, if using, to the gravy, then pour the mixture over the meatloaf and shower it with parsley. Serve immediately, perhaps with buttered egg noodles."}], "link": "https://cooking.nytimes.com/recipes/1019988-meatloaf-stroganoff"}