{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Dumplings", "description": "Apple dumplings are a perfect dessert for pie-phobic bakers. All-butter pastry, rolled out and wrapped casually around a brown sugar and currant-stuffed apple, looks rustic and adorable and tastes even better. No pie plates, double crusts, or fancy crimping to worry about. And, they are already portioned perfectly. Serve them warm with scoops of vanilla ice cream or swirls of crème fraiche.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2017/12/12/dining/12COOKING-APPLEDUMPLINGS/12COOKING-APPLEDUMPLINGS-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "pastries, pies and tarts", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 82}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 634, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "23 grams", "sodiumContent": "494 milligrams", "sugarContent": "32 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 cups/256 grams all-purpose flour, plus more as needed", "2 tablespoons granulated sugar", "1 1/4 teaspoons kosher salt", "1 cup/227 grams (2 sticks) cold, unsalted butter, cut into pieces", "6 to 8 tablespoons ice water ", "1 large egg, lightly beaten", "Turbinado sugar, for sprinkling", "1/3 cup/73 grams light or dark brown sugar", "3/4 teaspoon ground cinnamon", "1/4 teaspoon kosher salt", "6 small baking apples (like McIntosh, about 5½ ounces each), peeled", "3 tablespoons unsalted butter, cut into small pieces, plus more for greasing the baking dish", "1/4 cup/35 grams currants or raisins (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor, pulse a few times to combine the flour, sugar, and salt. Add the butter and pulse until the mixture resembles coarse meal. Add 6 tablespoons water and pulse just until the mixture is moistened and holds together. Add up to 2 more tablespoons water if necessary but be careful not to make the dough too wet. Tip the dough out onto a piece of plastic wrap. Use the edges of the plastic wrap to lift and press the dough into a cohesive piece. Wrap with plastic and shape into a flat rectangle. Chill for at least 1 hour and up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together the brown sugar, cinnamon, and salt. Using a melon baller, remove a tiny bit of the root end of each apple. Use the melon baller to core each apple from the stem, leaving about ¾-inch intact at the bottom. Rub the outside of the apples with some of the brown sugar mixture. Toss the remaining brown sugar mixture with the butter and currants and stuff it evenly into the apples. Butter a large baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface divide the dough into 6 equal rectangles. Working with one piece at a time, roll into an 8-inch square between 1/8- and ¼-inch thick. (Keep the other pieces in the fridge while you work.) Place one apple in the center, open side up. Brush the edges with the beaten egg and bring them up and over one apple, pressing the dough gently to adhere it. (If there are any thin spots or holes in the dough, seal them well to prevent the dough from slipping off during baking.) Transfer the wrapped apple to the prepared dish and transfer it to the fridge. Repeat with the remaining dough, egg wash, and apples. Heat the oven to 400 degrees. Chill the apples while the oven is heating. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before baking, brush the apples all over with the egg wash and sprinkle all sides generously with sugar. Bake until the crust is deep golden brown, about 30 to 40 minutes. Insert a small knife in an inconspicuous spot to test the apple for softness and return to the oven for a few minutes more if not done yet. If crust is becoming too dark, tent lightly with foil until apples are cooked through."}], "link": "https://cooking.nytimes.com/recipes/1019095-apple-dumplings"}