{"@context": "http://schema.org", "@type": "Recipe", "name": "Sicilian Pistachio Cake", "description": "Without much prompting, Maria Luca Caudullo, whose in-laws founded the Bronte pistachio company Antonino Caudullo, will reel off any number of pistachio recipes. Filet of beef with a pistachio crust, “olives” made with crushed pistachios and sugar syrup, panettone with pistachio paste, and also for Christmas, a simple pistachio cake. “That one I only make for Christmas,” she said. Her instructions were simple and clear enough, though the baking temperature of around 120 degrees Celsius, or about 260 degrees Fahrenheit, raised some doubts. Baked at 275 degrees, the cake takes longer than the 25 minutes she suggested, but the results are excellent.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2017/12/06/dining/06PistachioREX/merlin_130159280_316da075-da1c-40e9-8a83-f02bafd0b65c-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "12 servings", "recipeCuisine": "italian", "recipeCategory": "cakes", "keywords": "dessert, pistachio, potato starch, strega", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 272}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 260, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "82 milligrams", "sugarContent": "17 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Unsalted butter for pan", "2 1/3 cups/11 ounces/300 grams shelled pistachios, preferably Bronte from Sicily, plus more for decorating", "3/4 cup/151 grams granulated sugar", "3 tablespoons/30 grams potato starch or 3 tablespoons/24 grams cornstarch", "1 1/2 teaspoons baking powder", "6 large eggs, at room temperature", "2 tablespoons Strega, Galliano or green Chartreuse liqueur", "Confectioners' sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 275 degrees. Butter a 9-inch springform baking pan, line the bottom with parchment and butter the parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pistachios in a food processor with 2 tablespoons of the sugar. Process until finely ground, but do not allow to turn into a paste. Transfer pistachios to a bowl, add starch and baking powder and whisk to blend ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat eggs in an electric mixer with a balloon whisk until they start to lighten in color and thicken, a minute or so. Add remaining sugar in 3 portions, beating well after each addition. Beat in liqueur. Continue beating about 6 minutes more until the eggs are very pale in color and as thick as softly whipped cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "By hand, fold in the pistachio mixture in 3 portions. Pour batter into prepared pan. Bake 50 to 55 minutes until a cake tester comes out clean. Turn off oven and open oven door. Leave cake for 10 minutes. Turn it 180 degrees and let it sit in open oven another 10 minutes. Transfer to a baking rack and allow to cool completely. Dust top with sifted confectioners' sugar and decorate, if desired, with whole or coarsely chopped pistachios. Remove sides of pan. Cake is ready to serve. Slices should lift easily off the parchment."}], "link": "https://cooking.nytimes.com/recipes/1019063-sicilian-pistachio-cake"}