{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Crisp Tofu and Sweet Potatoes", "description": "Tossing marinated tofu squares in cornstarch before roasting makes them wonderfully crunchy and brown. Here, the tofu is cooked alongside spears of sweet potato, which are soft and silky against the crisp squares. A tamari-honey dressing spiked with rice wine vinegar acts both as marinade for the tofu and sauce for the finished dish. Then quick-pickled scallions and hot sesame oil make for a bright and spicy garnish.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/09/26/dining/26apperex3/26apperex3-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "fall, winter, hot sesame chile oil, sweet potato, tamari, tofu, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 383}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 298, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "6 grams", "proteinContent": "12 grams", "saturatedFatContent": "2 grams", "sodiumContent": "843 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 (14-ounce) package extra-firm tofu, cut crosswise into 4 1-inch thick slices", "2 tablespoons peanut oil, plus more as needed", "2 tablespoons tamari", "1 1/2 teaspoons honey", "1 tablespoon plus 1 teaspoon rice wine vinegar", "1 tablespoon cornstarch", "4 medium sweet potatoes (about 8 ounces each), cut lengthwise into 3/4-inch wedges", "1/2 teaspoon kosher salt, plus more to taste", "1/4 teaspoon black pepper", "4 scallions, cut into 3-inch pieces and thinly sliced lengthwise", "Large pinch of sugar", "1/2 cup cilantro leaves", "Hot sesame chile oil, or red-pepper flakes, for serving", "Salted, roasted peanuts, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Arrange tofu pieces, cut sides down, on a clean kitchen towel or paper towels. Cover with another kitchen towel, and place a flat cutting board on top. If your cutting board is lightweight, stack a few cans or a skillet on top to weigh it down. Let tofu drain for at least 10 minutes (and up to 30 minutes), then transfer to a cutting board. Cut strips into 3/4-inch pieces (1-inch thick), and transfer to a medium bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together oil, tamari, honey and 1 teaspoon vinegar. Toss half the mixture with the tofu, then toss in cornstarch. Arrange in a single layer on a rimmed sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a separate rimmed sheet pan, toss together potato wedges, 1/2 teaspoon salt and pepper. Arrange in a single layer; do not crowd the pan. If they don’t all fit, arrange extra wedges on the pan with the tofu."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake tofu and potatoes until browned, 35 to 40 minutes, flipping them halfway through. If the tofu sticks (and this is likely), use a thin metal spatula to carefully loosen each one before flipping. A small offset spatula is perfect here."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium bowl, combine scallions, 1 tablespoon vinegar and a large pinch each sugar and salt. Let sit while tofu and potatoes roast."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, toss tofu with some of the reserved tamari sauce, to taste. Serve with potato wedges, topped with scallions, cilantro and a drizzle of hot sesame chile oil or sprinkling of red-pepper flakes, and more tamari sauce. Sprinkle with peanuts if desired."}], "link": "https://cooking.nytimes.com/recipes/1019575-sheet-pan-crisp-tofu-and-sweet-potatoes"}