{"@context": "http://schema.org", "@type": "Recipe", "name": "Clams With Celery and Toasted Garlic", "description": "One of the easiest and most satisfying ways to serve steamed clams is next to thick slices of toast that have been drizzled with olive oil and rubbed with a cut clove of garlic. Another option is to take a slotted spoon and remove all the clams, leaving all the juicy goods behind and using that liquid to heat up a drained and rinsed can of small white beans, or to finish cooking pasta like linguine or spaghetti. Once the beans or pasta are warmed through and have soaked up some of that clammy business, pour it into a large bowl and top with the clams. This recipe uses littleneck clams; look for ones somewhere between the size of a large grape and small apricot. Cockles are an excellent smaller, sweeter substitute; they are extremely similar to clams in anatomy, flavor and texture. Most clams you buy have already been scrubbed and soaked to purge any sediment, mud or sand, but it’s still a good idea to give them another scrub once you’re in your own kitchen. And the chorizo (or bacon, or pancetta) is optional; if you leave it out, the recipe is pescatarian.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/08/22/dining/22ROMANREX-01/22ROMANREX-01-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, seafood", "keywords": "chorizo, clams, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 82}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 203, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "1 gram", "proteinContent": "11 grams", "saturatedFatContent": "5 grams", "sodiumContent": "448 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["3 1/2 pounds relatively small littleneck clams (about 24 to 30 clams), very well scrubbed  ", "2 tablespoons olive oil, plus more for drizzling", "2 tablespoons unsalted butter", "4 ounces dried chorizo, bacon, pancetta or guanciale, chopped (optional)", "4 garlic cloves, thinly sliced, plus another clove for serving", "1/2 cup dry white wine (avoid anything overly oaky, sweet or “creamy”)", "2 large stalks celery, trimmed and thinly sliced on the bias, plus leaves for serving", "Kosher salt and ground black pepper", "1/2 cup parsley, tender leaves and stems", "1/2 cup chopped chives", "1 tablespoon finely grated lemon or lime zest, plus 1 tablespoon fresh lemon or lime juice", "Crusty bread or thick toast, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preferably using a natural bristle kitchen scrubber (a brand new kitchen sponge will work as well), scrub the clams well under running water. After the clams have been scrubbed and scrubbed again, let them hang out in a large bowl of cold water. This will allow any residual sediment or grit to free itself from the shells and settle at the bottom of the bowl while you do everything else."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil, butter and chorizo or other pork product, if using, in a large pot (make sure it has a lid) over medium heat. Cook, swirling the pot occasionally until the butter has started to brown a little and the fat has begun to render from the pork, 3 to 4 minutes. (The pork won’t be crispy, but that’s O.K.; you’re not looking for that.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the garlic and cook, stirring a minute or two until it begins to take on a toasty, light golden-brown color. Add wine and cook, letting it simmer until it’s a little more than halfway reduced, 2 to 3 minutes. Add celery and season with salt and pepper. Cook, stirring occasionally until the celery is bright green and just tender, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add clams and shake the pot so they settle nicely. Place the lid on the pot and give it the occasional shake, letting them steam open and release their juices, 3 to 5 minutes. (Larger clams will take longer.) The shaking of the pot is not only fun to do, but it gives all the clams quality time with the hottest part of the pot, which will encourage them to open around the same time, although there’s always one or two clams late to the party. If there’s one that just never makes it to the party (as in, it never opens), it’s dead and should be thrown away."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the parsley, chives and celery leaves in a small bowl, then add lemon or lime zest and juice, and season with salt and pepper. Serve the clams with a hunk of crusty fresh bread or thick slices of toast that have been drizzled with lots of olive oil and rubbed with a cut clove of garlic, scattering the parsley mixture over everything."}], "link": "https://cooking.nytimes.com/recipes/1019487-clams-with-celery-and-toasted-garlic"}