{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Green Beans With Pork and Chiles", "description": "In this fast, piquant weeknight meal, ground pork and green beans are stir-fried with plenty of ginger, garlic and chiles, and seasoned with soy sauce and coriander seeds. A big splash of rice-wine vinegar right at the end adds a hit of acidity, which balances the pork's richness. Serve this over rice or rice noodles to help absorb all the salty, spicy sauce. Slices of fresh tomato add a sweet juiciness that works well here. But if you don't have a ripe tomato, feel free to leave it out.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/10/31/dining/31apperex1/merlin_145674927_cc697467-90db-4b98-937d-fc5814730277-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weekday, one pot", "keywords": "chiles de árbol, cilantro, ginger, green beans, ground pork, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 434}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 366, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "3 grams", "proteinContent": "23 grams", "saturatedFatContent": "9 grams", "sodiumContent": "514 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons neutral oil, such as peanut, sunflower or grapeseed, plus more if needed", "1 pound ground pork", "1 teaspoon kosher salt", "8 ounces green beans, cut into 1/2-inch lengths", "2 red chiles, seeded or not, thinly sliced", "1 tablespoon freshly grated ginger", "5 garlic cloves, minced", "1 teaspoon coriander seeds, lightly cracked with a mortar and pestle or with the side of a knife", "1/4 cup cilantro leaves and tender stems, chopped, plus more for serving", "3 tablespoons rice-wine vinegar, plus more for serving", "4 teaspoons soy sauce, plus more to taste", "1/2 teaspoon sugar", "Cooked white rice or rice noodles, for serving", "Sliced tomato, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 12-inch skillet or wok over medium-high heat for 1 minute, then add the oil and let heat for another 30 seconds — it should be hot but not smoking. Stir in pork and 3/4 teaspoon salt, and cook, breaking up meat with a spoon, until browned and crisp, 6 to 9 minutes. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to heat and add more oil if it looks dry. Stir in green beans, cook until they are crisp, tender and bright green, 1 to 3 minutes. Stir in chiles, ginger, garlic, coriander seeds and remaining 1/4 teaspoon salt. Cook, stirring frequently, until fragrant, about 1 minute longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pork to skillet, along with chopped cilantro, vinegar, soy sauce and sugar. Stir briefly to combine, then scrape into a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle more vinegar and soy sauce on top to taste, then top with more chopped cilantro. Serve with rice, and sliced tomato, if you like."}]}