{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemony Roasted Chicken Wings", "description": "These meaty out-of-the-ordinary roasted wings are infused with lots of lemon, garlic and rosemary, then roasted on a bed of fingerling potatoes. Use a large roasting pan that's at least 3 inches deep, or a big earthenware gratin dish, or a couple of Pyrex lasagna pans side by side. The lemony chicken and potatoes are delicious hot and crisp, but just as good at cool room temperature.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/05/30/dining/30kitchen1/30kitchen1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, snack, finger foods, poultry", "keywords": "appetizer, main course, chicken wings, lemon, potato, white wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 449}, "recipeIngredient": ["2 pounds very small potatoes, such as fingerlings, whole, or use medium-size yellow-fleshed potatoes, cut in halves or wedges)", "3 pounds chicken wings, preferably drumettes", "Salt and pepper", "Red pepper flakes, to taste", "3 tablespoons extra-virgin olive oil", "6 small lemons, cut into 1/4-inch thick half-moon slices", "6 large rosemary sprigs, leaves stripped", "8 garlic cloves, minced, or 1/2 cup chopped green garlic shoots", "1 cup dry white or rosé wine", "Pinch of dried oregano (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Rinse potatoes with lukewarm water and pat dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread chicken wings out on a baking sheet or cutting board in a single layer. Season both sides of wings generously with salt and plenty of freshly ground black pepper. Sprinkle with red-pepper flakes as desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer seasoned wings to a large bowl. Add olive oil, lemon slices, rosemary and garlic and toss well with (plastic-gloved) hands so everything is evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place potatoes on the bottom of a roasting pan. Arrange seasoned wings over potatoes in a single layer. Add wine and cover pan tightly with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, covered, for about 45 minutes, until potatoes are done. Remove foil and return the pan to the oven and bake about 20 minutes more, until wings are nicely browned. Using tongs, turn wings over and bake for another 20 minutes to brown the wings’ other side. Sprinkle with dried oregano, and serve hot or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1019327-lemony-roasted-chicken-wings"}