{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato Hash Browns", "description": "A riff on Josh Ozersky’s famous minimalist hash browns, these are made by sprinkling grated sweet potato over hot butter in a very thin layer, then waiting patiently for the starch to work its magic. Crisp, salty, buttery and addictive, these hash browns are so good, you could probably eat the entire batch in one sitting (or force yourself to be generous and share with a friend). Serve with a fried or over-easy egg for a complete breakfast.", "author": {"@type": "Person", "name": "Sarah Jampel"}, "image": "https://static01.nyt.com/images/2018/09/21/dining/sj-sweet-pot-hash-browns/sj-sweet-pot-hash-browns-articleLarge-v4.jpg", "totalTime": "PT20M", "recipeYield": "2 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, weekday, vegetables", "keywords": "fall, winter, side dish, sweet potato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 398}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 229, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "2 grams", "saturatedFatContent": "7 grams", "sodiumContent": "414 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 large sweet potato (10 to 12 ounces), scrubbed and dried", "2 tablespoons cornstarch", "2 tablespoons unsalted butter", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the large holes of a box grater, grate the sweet potato onto a paper towel. Use the paper towel to gather the sweet potato shreds, then squeeze to wring out excess moisture (there may not be much). Dump into a bowl, add cornstarch and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set your largest nonstick skillet (cast-iron is also fine, if it’s all you have, though you can expect a bit more sticking) over medium-high heat and add 1/2 tablespoon butter. Swirl the pan to coat it in butter. When the butter stops foaming, sprinkle shredded sweet potato all over the surface in a thin single layer. (The thinner the layer, the more crisp the hash browns.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle all over with salt, then use a spatula, preferably long and thin, to press down so all shreds come in contact with the hot surface. When you see the potato is starting to get really crisp and brown on the bottom, about 3 to 4 minutes, use the spatula to carefully flip small sections over (it’s O.K. if it’s not perfect). Cook until the other side is deeply brown, 3 to 5 minutes more, flipping sections as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unless your pan is really big, you’ll have to cook these in 3 to 4 batches, using 1/2 tablespoon butter for each round. You can keep the cooked hash browns warm in a 300-degree oven as you work."}]}