{"@context": "http://schema.org", "@type": "Recipe", "name": "Rosemary Rack of Lamb With Crushed Potatoes", "description": "Tender rack of lamb, though expensive, makes an elegant roast for a special-occasion dinner, and it’s quite easy to prepare. A brief marinade of pounded garlic and anchovy, Dijon mustard and olive oil heightens the flavor. For a simple accompaniment, roast small crushed potatoes in the same pan. Each eight-bone rack may be sliced into four thick chops, or eight thin chops, if you prefer.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/12/06/dining/06kitchen1/merlin_130382108_ad578bfe-7ac6-45ab-aa20-96b892b4661d-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "french, mediterranean", "recipeCategory": "dinner, quick, meat", "keywords": "fall, spring, winter, lamb rack, mustard, potato, rosemary, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 412}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1165, "unsaturatedFatContent": "49 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "94 grams", "fiberContent": "5 grams", "proteinContent": "42 grams", "saturatedFatContent": "39 grams", "sodiumContent": "1308 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 lamb racks, about 1 1/2 pounds each, preferably frenched (see Note)", "Salt and pepper", "2 tablespoons Dijon mustard", "3 cloves garlic, minced", "4 anchovy fillets, minced", "Extra-virgin olive oil", "1 1/2 to 2 pounds small, round potatoes, scrubbed and left whole", "2 tablespoons roughly chopped rosemary", "2 tablespoons roughly chopped parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Season lamb generously with salt and pepper. In a small bowl, mix together Dijon mustard, garlic and anchovy (or pound together in a mortar for a smoother texture). Stir in 3 tablespoons olive oil. Smear lamb all over with marinade and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, boil potatoes until the tip of a paring knife meets no resistance, 10 to 15 minutes depending on size. When potatoes are done, drain, transfer to a roasting pan large enough to hold them in a single layer, and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. With palms or the back of a wooden spoon, crush potatoes gently to crack open and slightly flatten. Sprinkle with salt, drizzle with about 2 tablespoons olive oil, and turn to lightly coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay lamb racks on top of potatoes, with bones curving downward. Scatter rosemary over meat and potatoes. Roast, uncovered, until a meat thermometer registers 125 degrees (for medium-rare), about 20 minutes. (Cook to 135 degrees for medium.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove lamb to a cutting board and let rest, tented with foil. Return potatoes to oven and leave to roast 10 to 15 minutes more, until nicely crisped."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a large chef's knife to slice the racks by cutting between the bones. (One rack will yield 4 thick chops or 8 thin ones). Transfer chops and potatoes to a warm platter, sprinkle with parsley and serve."}]}