{"@context": "http://schema.org", "@type": "Recipe", "name": "Hawaiian Buns", "description": "Pineapple juice and a bit of sugar give these soft, golden buns a slight sweetness that makes them irresistible: They're as nice with butter and jam as they are hugging a burger or a turkey sandwich. Keep an eye on the dough rather than the clock when assessing the rise. The additional sugar, eggs and butter can slow things down. Give the yeast plenty of time to work, and you’ll be handsomely rewarded with light, pillowy rolls.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2018/04/02/dining/02COOKING-HAWAIIAN-BUNS1/02COOKING-HAWAIIAN-BUNS1-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "16 rolls", "recipeCuisine": "american", "recipeCategory": "breads", "keywords": "flour, pineapple juice, yeast, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 118}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 153, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "125 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup pineapple juice", "1 (1/4-ounce/2 1/4 teaspoons/7 grams) package active dry yeast", "1/4 cup/50 grams granulated sugar", "3 1/4 cup/415 grams all-purpose flour", "1 teaspoon kosher salt", "1 large egg plus 2 large egg yolks, lightly beaten", "4 tablespoons/57 grams unsalted butter (1/2 stick), at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, bring the pineapple juice to a simmer over medium-high heat, and cook it until it has reduced to 3/4 cup, about 10 minutes. Transfer to a liquid measuring cup and let cool until just warm, about 105 to 110 degrees. Stir in the yeast and let the mixture stand until the yeast has bloomed, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in the bowl of a stand mixer with the dough hook attached, combine the sugar, flour and salt. With the mixer on low, add the yeast mixture and the eggs, and knead until the dry ingredients have been incorporated (you may have to help it along with a spatula at first) and dough is smooth and elastic, about 5 to 10 minutes. Add butter in small pieces and continue to knead the dough until smooth, increasing speed to medium, another 5 to 10 minutes. The dough will be shiny, elastic and slightly sticky. Scrape down the sides of the bowl and gather the dough into a neat ball (no need to add extra flour). Cover the bowl with plastic and set aside to rise in a warm place until doubled, about 1 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a 9-inch-by-13-inch baking pan. Gently tip dough out onto a work surface. You shouldn’t need flour at this point. Divide dough into 16 equal pieces. Roll each piece into a tight ball and place in the prepared pan. Repeat with the remaining dough. Cover the tray lightly with plastic wrap and set aside to double again, about 45 minutes to 1 hour. The dough should look puffy and spring back slowly when pressed gently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Bake until puffed and golden, about 20 minutes. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1019259-hawaiian-buns"}