{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Harissa Salmon With Potatoes and Citrus", "description": "In this 30-minute recipe, harissa, ginger and orange are combined to create a vibrant, spicy marinade for rich salmon fillets. The potatoes and red onion get a jump-start roasting, while the fish takes a quick dip in the marinade. Then the salmon is added to the sheet pan so everything finishes cooking together. This meal looks impressive right on the pan, so serve it from there and cut down on cleanup. You’ve got better things to do.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/01/28/dining/ch-sheet-pan-salmon-and-potatoes-with-harissa-and-citrus/merlin_145792857_73898966-f0e3-4c7b-9a7d-4eb024fb5e8f-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weekday, seafood", "keywords": "ginger, harissa, orange, potato, red onion, salmon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1118}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 523, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "3 grams", "proteinContent": "38 grams", "saturatedFatContent": "6 grams", "sodiumContent": "793 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["4 (6-ounce) skin-on salmon fillets, about 1- to 1½-inches thick", "Kosher salt and black pepper", "2 to 3 tablespoons mild or spicy harissa paste, depending on your preference", "2 teaspoons grated fresh ginger", "1 garlic clove, grated", "1/2 teaspoon orange zest", "1/4 cup orange juice (from about ½ orange)", "1 pound small potatoes, such as baby red or fingerlings, cut in half lengthwise", "1 small red onion, peeled, quartered and cut into ½-inch wedges", "2 tablespoons olive oil", "1/4 cup cilantro, roughly chopped, both leaves and tender stems", "3 tablespoons scallions, thinly sliced on an angle, both white and green parts", "Flaky salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Lay salmon on a plate, and season with salt and pepper. In a shallow bowl, whisk together harissa, ginger, garlic, orange zest and juice. Spoon the mixture over the flesh and sides of the fish, and let marinate at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, line a sheet pan with parchment paper (or use a nonstick sheet pan). In a large bowl, toss together the potatoes and onion with the olive oil, and season well with salt and pepper. Arrange them on the sheet pan in 1 layer, leaving 4 spaces for the salmon fillets to be added later. Roast until the potatoes are beginning to brown and are almost cooked through, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the salmon to the sheet pan skin-side down, and roast until the fish is opaque and cooked through and the potatoes are crisp, about 8 minutes more. Scatter cilantro and scallions over everything, and season with flaky salt."}], "link": "https://cooking.nytimes.com/recipes/1019962-sheet-pan-harissa-salmon-with-potatoes-and-citrus"}