{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheddar-Stuffed Turkey Burger With Avocado", "description": "The secret to keeping lean turkey juicy as a burger? Adding fat. The burgers in this recipe, stuffed with cheese and a bit of butter, are moist, flavorful and, best of all, hold together and flip easily. These are best cooked on a flat-top griddle, burger-joint style, or you can use a large, wide skillet (like cast-iron) if that’s what you have. Both give the outside of these burgers an irresistible sear that keeps the juice and flavor inside the burger, not dripping through grill grates. Finally, Hawaiian buns are a must. Their softness and subtle sweetness give these burgers a universal appeal.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2018/09/16/dining/sc-turkey-burger/sc-turkey-burger-articleLarge-v2.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, weekday, burgers", "keywords": "avocado, cheddar, ground turkey, hamburger buns, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 229}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 661, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "6 grams", "proteinContent": "44 grams", "saturatedFatContent": "16 grams", "sodiumContent": "736 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 pounds lean ground turkey", "1 teaspoon kosher salt", "1/2 teaspoon black pepper", "1 teaspoon dried parsley", "1 egg, lightly beaten", "1 tablespoon milk", "2 tablespoons butter, plus more for cooking", "5 (1-ounce) slices sharp Cheddar or horseradish Cheddar", "4 Hawaiian hamburger buns", "1 to 2 firm-ripe avocado, thinly sliced", "Mayonnaise or other burger toppings (pickles, lettuce, tomato, mustard), to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the turkey, salt, pepper and parsley in a large bowl and mix with a fork or clean hands to season evenly. Add the egg and milk and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the meat into four portions with damp hands and gently pack into four round patties, about 3/4-inch thick. (It will feel very sticky because of the egg, which helps burgers hold their shape as they cook.) Place burgers on a parchment-lined baking tray or plate. Cut the butter into slices and 1 slice of the cheese into 4 thin squares, about 1 inch across. (The butter and cheese should be the same size.) Press a piece of each into the center of each burger. Shape the meat around it to cover across the top. Refrigerate for 10 minutes while you prepare the griddle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a flat-top griddle or cast-iron skillet over medium-high heat. Add enough butter just lightly coat the griddle or pan. Add the burgers to the griddle and cook until browned and just cooked through and a thermometer inserted into the meat (not the cheese in the center) reaches 165 degrees, about 4 minutes per side. In the final 2 minutes of cooking, add the remaining 4 cheese slices to the burgers, to melt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the burgers from the heat and layer onto the buns with the avocado and any other burger toppings you desire. Serve warm."}], "link": "https://cooking.nytimes.com/recipes/1019587-cheddar-stuffed-turkey-burger-with-avocado"}