{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon With Crushed Blackberries and Seaweed", "description": "A traditional staple on the Pacific Northwest coast, salmon is considered a sacred food. This dish is often slow-roasted on cedar or redwood spikes near an open fire, giving the fish a beautiful smoky flavor. In the kitchen, searing the salmon in a skillet allows the true flavor of wild-caught fish to shine through. Seaweed harvesting goes back countless generations, and so the salty seaweed is a great accompaniment here, along with the sweet local blackberries, a combination that is natural for the Muckleshoot and other tribes of the region.", "author": {"@type": "Person", "name": "Sean Sherman"}, "image": "https://static01.nyt.com/images/2019/11/06/dining/04NativeAmericanrex7/04NativeAmericanrex7-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weeknight, seafood", "keywords": "blackberries, chives, salmon fillet, wakame seaweed, main course, spring, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 37}, "recipeIngredient": ["2 cups fresh blackberries", "Coarse sea salt", "4 (5- to 6-ounce) skin-on salmon fillets, preferably wild-caught sockeye salmon", "3 tablespoons sunflower oil, plus more as needed", "2 to 3 tablespoons dried wakame seaweed", "Fresh chive stems, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, crush half the blackberries using the back of a fork. Add the remaining whole blackberries, stir to coat and season to taste with salt; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat salmon fillets dry with a paper towel. Season with salt on both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy sauté pan or cast-iron skillet over high. When the pan is hot, add 3 tablespoons oil and carefully swirl it around to coat the bottom of the pan. When the oil begins to shimmer, working in batches if necessary, place the fillets in the pan, flesh-side down, and sear until the salmon picks up some color and releases easily from the pan, 1 to 2 minutes. Flip the fish, reduce the heat to medium and continue cooking until cooked through, about 2 minutes more, depending on the thickness of the salmon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the fillets from the pan to a warm plate and tent with foil until all fillets are cooked, making sure to get any of the salmon skin that may stick to the pan. (If you’re cooking your fillets in multiple batches, you’ll want to add 2 to 3 tablespoons of oil to the skillet before pan-searing the second batch.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the salmon among plates, serving it skin-side up. Top with the blackberries, then garnish each plate with the seaweed and a few chive stems."}]}