{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon Fried Rice", "description": "It’s always a clever idea to cook extra rice so that you can make fried rice the next night, or the one after that, using various bits and bobs in your fridge. Allowing the rice a day or two to dry out makes it doubly flavorful: Since the grains have less moisture, they’ll absorb even more flavor from whatever liquid you add to them. Plus, the dry grains remain separate, which means more surface area to soak up any seasoning. When it comes to fried rice, anything goes — leftover meat or fish, or whatever stray vegetables are lurking in your produce drawer or freezer will do. Just make sure you don’t crowd the pan, or your rice will steam instead of crisp.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/04/05/dining/ss-salmon-fried-rice/merlin_152985264_aba0ad7a-8ed8-4de5-97e6-92fed6effcbd-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, lunch, weekday, grains and rice, seafood", "keywords": "asparagus, broccolini, brown rice, ginger, salmon, scallion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 499}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 549, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "8 grams", "proteinContent": "29 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1103 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 (12-ounce) skinless salmon fillet", "Kosher salt and black pepper", "3 tablespoons vegetable oil", "1 tablespoon finely chopped fresh ginger", "2 garlic cloves, chopped", "1 bunch scallions, thinly sliced, whites and greens separated", "1 bunch broccolini (about 8 ounces), trimmed, cut into 1-inch pieces", "1 bunch thin asparagus (about 1 pound), trimmed, cut into 1-inch pieces", "3 cups cooked brown rice (preferably short-grain)", "2 large eggs, beaten", "2 teaspoons soy sauce", "2 teaspoons dark sesame oil", "Hot sauce or chile-garlic sauce, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the salmon down the middle lengthwise into 2 pieces. Slice against the grain into roughly 1/4-inch-thick slices. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon vegetable oil in a large nonstick skillet over medium-high. Add the salmon in a single layer and cook just until opaque, 1 to 2 minutes per side. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add ginger, garlic and the scallion whites and cook, stirring, until fragrant, about 1 minute. Add the broccolini, asparagus and 2 tablespoons water and cook, stirring occasionally, until crisp-tender, 3 to 4 minutes. Transfer to another plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 2 tablespoons vegetable oil to the pan and heat over medium-high until shimmering. Add the rice, season with salt and cook, stirring occasionally, until rice starts to crisp, 4 to 5 minutes. Reduce heat to medium, push the rice to one side of the skillet and add the eggs to the empty side. Let sit until eggs are just starting to set around the edges, then gently scramble just until set, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the vegetables and most of the reserved scallion greens to the skillet and toss until warmed. Stir in the soy sauce and sesame oil. Gently fold in the reserved salmon and serve immediately. Top with remaining scallion greens and serve with hot sauce or chile-garlic sauce, if desired."}], "link": "https://cooking.nytimes.com/recipes/1020152-salmon-fried-rice"}