{"@context": "http://schema.org", "@type": "Recipe", "name": "Kombucha", "description": "To make this effervescent fermented tea, you will need a symbiotic culture of bacteria and yeast that is known by its acronym, Scoby. Also some already-brewed kombucha that you will most likely receive from the same source as the Scoby — a friend or the Internet. You'll need very clean glass jars in which to brew your sweetened tea and ferment it with your Scoby, and very clean clamp-top bottles into which to funnel it when you’re done. You’ll need flavoring agents for that second fermentation. Start with apple juice, perhaps, and ginger. With later batches you can try turmeric, pomegranate, cayenne, orange, whatever you like. Welcome to the kombucha lifestyle.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/06/23/magazine/23mag-eat/d46b093bc70b4c03a09f5cf29de2b49e-1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "1 gallon", "recipeCuisine": "chinese, russian", "recipeCategory": "non-alcoholic drinks, project", "keywords": "black tea, ginger, kombucha, scoby", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 287}, "recipeIngredient": ["3 1/2 quarts water", "1 cup granulated sugar", "8 bags black tea or 2 tablespoons loose black tea leaves", "2 cups unpasteurized, unflavored store-bought kombucha or kombucha from a previous homemade batch", "1 Scoby", "1 gallon fermented kombucha", "2 to 4 tablespoons orange or apple juice", "1 3-inch piece fresh ginger, peeled and sliced lengthwise into 4 slivers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water to a boil in a pot, then remove from heat, and whisk in the sugar until dissolved."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tea, and allow it to steep on the countertop until the sweetened tea is almost room temperature, at least an hour. Discard the tea bags."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the sweetened tea into a very clean 1-gallon glass or ceramic jar (or 2 half-gallon jars), followed by the kombucha (divided equally if using 2 jars)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using very, very clean hands, gently place the Scoby into the jar (if you’re using half-gallon jars, you can cut your Scoby in two with scissors or a knife that has been thoroughly cleaned and rinsed in hot water). Cover with a clean dish towel, and secure with a rubber band or a length of string."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the jar or jars somewhere dark and cool, and allow to ferment 8 to 14 days, tasting occasionally after 1 week. The longer the tea ferments, the more sugar will be eaten by the Scoby and the less sweet it will be. Aim for a light fermentation and a slightly vinegary taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using very, very clean hands, transfer the Scoby to a jar, then pour 2 cups of the fermented kombucha on top. (You can save this mixture for the first fermentation process of another batch. You could also peel off the newer second layer from the Scoby, separating the “child” from the mother to double your production of kombucha, give it to a friend or discard it, as you like.) Strain the remaining fermented kombucha through a fine-mesh sieve or cheesecloth into a large bowl for use in the second fermentation."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain kombucha again, and whisk in the juice. Pour it through a funnel into 4 very clean quart-size fermentation bottles with swing-top caps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 piece of peeled ginger to each bottle, and seal tight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let sit somewhere dark and cool for 3 to 7 days, checking after 3 to taste how bubbly the kombucha has become, then place in the refrigerator until ready to drink, to stall fermentation."}], "link": "https://cooking.nytimes.com/recipes/1020295-kombucha"}