{"@context": "http://schema.org", "@type": "Recipe", "name": "Cream Cheese Semifreddo", "description": "This simple, refreshing and not-too-sweet frozen dessert is the perfect blank canvas to show off that fancy Italian balsamic vinegar in your cabinet. Natasha Pickowicz, the pastry chef at Café Altro Paradiso and Flora Bar in New York, developed this easy yet sophisticated recipe for the 2019 NYT Food Festival. Ms. Pickowicz also likes this semifreddo with a spoonful of jam, or a drizzle of maple syrup, chocolate syrup or honey. (The photo shows a tart-sweet combination of balsamic vinegar and maple syrup.) Everything seems to shine against the backdrop of this parfait. If you’d like, you can substitute mascarpone for the cream cheese, although the final result might be a bit softer.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2019/09/25/dining/ml-cream-cheese-semifreddo/merlin_161002737_d7f51c81-7b72-467d-867c-803e950475df-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings (One 8-inch loaf pan)", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "cream cheese, egg yolks, heavy cream, rum, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 5}, "recipeIngredient": ["1 cup/240 milliliters heavy whipping cream, chilled", "5 egg yolks, at room temperature", "1/2 cup/100 grams granulated sugar", "1 teaspoon vanilla extract", "3/4 teaspoon kosher salt", "1 teaspoon rum (optional)", "7 ounces/200 grams cream cheese, softened", "Maple syrup and cherry surette or best-quality balsamic vinegar, for serving", "Flaky sea salt, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line an 8-inch loaf pan with plastic wrap and set aside. In the bowl of an electric mixer, beat heavy cream on high until stiff peaks form. Transfer the whipped cream to a bowl and chill in the refrigerator. Wash the mixing bowl and whisk attachment and set aside. (You’ll need them again.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium heat-proof bowl, combine the yolks, sugar, vanilla, salt and rum, if using. Whisk continuously, otherwise the sugar and alcohol will cook the egg, making the mixture grainy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In small saucepan, bring about an inch of water to a very low simmer. Place the bowl with the yolks on top of the saucepan to create a double boiler. (The bowl should not touch the water.) Whisk the yolk mixture continuously until the yolks are glossy, and have lightened in color and doubled in volume, about 5 minutes. The mixture should feel warm to the touch, and the sugar should be completely dissolved."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bowl from the heat and continue to whisk until the mixture cools to room temperature, 8 to 10 minutes. (It will thicken a bit as it cools.) Transfer the yolk mixture and the cream cheese to the bowl of a stand mixer fitted with the whisk attachment. Beat on medium speed, until completely smooth, about 3 to 4 minutes, scraping the sides and bottom of the bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Very gently fold the cream cheese mixture into the chilled whipped cream using a silicone spatula, being careful not to deflate the mixture. Stop earlier than you think because transferring the semifreddo to the loaf pan will continue to mix it together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully pour the semifreddo into the prepared loaf pan. Wrap tightly in plastic wrap and freeze for at least 12 hours and up to overnight. Mixture should be frozen solid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, carefully remove the semifreddo from the mold (you may need to run the base of the loaf pan under warm water for a few seconds to aid removal) and transfer to a chilled cutting board or platter. Peel off the plastic wrap. Using a clean knife that’s been run under hot water then wiped dry, slice the semifreddo into 1-inch-thick slabs. Place onto a chilled plate, top with a spoonful of maple syrup, a drizzle of cherry surette or balsamic vinegar, and a sprinkle of flaky salt."}], "link": "https://cooking.nytimes.com/recipes/1020474-cream-cheese-semifreddo"}