{"@context": "http://schema.org", "@type": "Recipe", "name": "Chia Pudding With Berries and Popped Amaranth", "description": "Based on flavors from the Ohlone tribe, this simple pudding doubles as both breakfast and dessert, and gets its silky texture from chia seeds. Though optional, the wild manzanita berries that grow abundantly throughout California make a wonderful addition to this dish. When the berries are ripe, they turn a burned-red hue and become slightly sticky. The flavor is often likened to sour apple, which adds a nice tang when crushed with milder mixed berries, though any combination of mixed berries lends plenty of acidity. Toasted amaranth seeds gives it all a nutty crunch.", "author": {"@type": "Person", "name": "Sean Sherman"}, "image": "https://static01.nyt.com/images/2019/11/06/dining/04NativeAmericanrex6/merlin_163486041_dda3b9ca-57e1-4033-8c9d-b65c81246b03-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, easy, snack, custards and puddings", "keywords": "almond milk, amaranth, chia seeds, light agave nectar, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 94}, "recipeIngredient": ["1 1/2 cups unsweetened almond milk, plus more if needed", "1/2 cup chia seeds", "1/4 cup light agave nectar", "Pinch of fine sea salt", "1/4 cup amaranth", "1 to 2 cups fresh mixed berries (any combination of blackberries, blueberries and raspberries)", "1/4 cup crushed manzanita berries (optional)", "Small fresh mint sprigs, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a lidded quart container, vigorously whisk together the 1 1/2 cups almond milk, chia seeds, agave and salt. (This ensures the chia seeds are evenly hydrated.) Let the mixture soak in the refrigerator at least 1 hour and up to overnight, so it develops a rich, creamy texture that is similar to that of rice pudding. If the mixture becomes too thick, whisk in more almond milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pudding soaks, heat a small skillet over medium-high. Add the amaranth and cook, shaking the skillet, until the amaranth begins to smell toasty and about half of the seeds have popped, 1 to 2 minutes. Transfer the amaranth to a plate to cool to room temperature. (Popped amaranth can be prepared up to 3 days ahead and stored in a lidded container in a cool, dark place.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, whisk the pudding to incorporate any liquid on top and break up the chia seeds, then spoon pudding into bowls. Top with the berries, popped amaranth and mint sprigs."}]}