{"@context": "http://schema.org", "@type": "Recipe", "name": "White Beans With Radishes, Miso and Greens", "description": "In this 10-minute take on beans and greens, creamy white beans are sautéed in butter and garlic, then crunchy radishes and tender greens are stirred in at the end for texture and crunch. White miso, a fermented soybean paste that’s worth seeking out if it’s not already in your fridge, provides a complex, umami flavor that pairs well with the mild beans. Finish the dish with a good squeeze of lemon to add brightness and balance out the salty miso. Serve these beans on their own, or alongside grilled shrimp or salmon. Any leftover miso paste can be whisked into salad dressings and marinades, or used as a base for a quick weeknight soup.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/04/18/dining/ch-white-beans-with-radishes-and-miso-butter/merlin_152985297_78a5ea88-a25c-4e0a-9be5-b2c28e4db46d-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, for one, for two, lunch, quick, weekday, beans, salads and dressings, vegetables", "keywords": "arugula, miso, pea shoots, radish, white beans, high fiber, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 285}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 369, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "12 grams", "proteinContent": "17 grams", "saturatedFatContent": "8 grams", "sodiumContent": "354 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons white miso", "4 tablespoons unsalted butter", "2 garlic cloves, finely chopped", "2 (15-ounce) cans white beans, like cannellini or butter beans, rinsed and drained", "3 cups pea shoots, arugula or other baby greens", "3 to 4 small radishes, thinly sliced", "Fresh lemon wedges, for squeezing", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk the miso with 1/4 cup water until dissolved. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, melt the butter over medium heat until it foams. Add the garlic and cook, stirring often, until fragrant, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans and toss to coat with the garlic butter. Add the miso mixture and cook, stirring occasionally, until the flavors have melded and the beans are warmed through, about 2 minutes. The beans should be a bit saucy, so thin it out with a tablespoon or so of water if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat and stir in the greens and radishes. Gently toss until the greens are just wilted. Squeeze with lemon juice, season with pepper and gently toss again."}], "link": "https://cooking.nytimes.com/recipes/1020185-white-beans-with-radishes-miso-and-greens"}