{"@context": "http://schema.org", "@type": "Recipe", "name": "Beignets", "description": "The French might have been the first to deep-fry choux pastry, but it’s in New Orleans that beignets became a true mainstay in bakeries and cafes. This version is relatively easy to make at home: The yeast-leavened dough comes together quickly, is very forgiving to work with and fries up light and airy. The yeast must be fresh and active: Once stirred with warm water and sugar, let the mixture stand for 10 minutes. If the yeast is fresh, it will create a foamy, bubbly layer on top. (If this doesn’t happen, you’ll need to start over with new yeast.) You can cook the beignets in a Dutch oven or deep skillet, no deep-fryer necessary. To obtain the perfect puffs, fry the fritters in batches so they have plenty of room to cook evenly on all sides. Beignets are best eaten hot, buried in a blanket of powdered sugar.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2019/03/05/dining/05kc-beignets/merlin_150865437_30e3a845-e17d-4688-a595-ca13cef488bc-articleLarge.jpg", "totalTime": "PT3H45M", "recipeYield": "About 3 dozen", "recipeCuisine": "american", "recipeCategory": "brunch, snack, finger foods, pastries", "keywords": "active dry yeast, confectioners' sugar, milk, sugar, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 228}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 64, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "30 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 teaspoons active dry yeast", "1/4 cup/50 grams granulated sugar", "3/4 cup/180 milliliters warm water", "1/2 cup/120 milliliters whole milk", "1 large egg", "2 tablespoons unsalted butter, melted", "1/2 teaspoon kosher salt", "3 1/2 cups/450 grams all-purpose flour, plus more for dusting", "Vegetable oil, for greasing the bowl and deep-frying", "Confectioners’ sugar, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with a dough hook attachment, combine yeast, 1 tablespoon granulated sugar and warm water; use a fork to mix well. Let stand until foamy, about 10 minutes. Add milk, egg, butter, salt and remaining 3 tablespoons granulated sugar and beat with fork to blend. With machine on low speed, gradually add flour. Increase speed to medium and beat just until a smooth dough forms, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease a large bowl with vegetable oil. Transfer dough to the prepared bowl and turn to coat dough in oil. Cover bowl with plastic wrap and let stand at room temperature until doubled in size and very puffy, about 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a Dutch oven or cast-iron skillet, heat 2 inches of oil over medium to 350 degrees. On a lightly floured surface, turn out dough and cut in half. Working with one piece at a time and using a lightly floured rolling pin, roll dough into a 10-by-8-inch rectangle (about 1/4-inch thick). Cut into 2-inch squares and transfer to a parchment-lined baking sheet. Repeat with remaining dough, transferring to a second parchment-lined sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In batches, fry dough until puffed and golden underneath, about 2 minutes. Flip the beignets and fry until golden on second side, 1 minute more. Transfer beignets to a paper towel-lined baking sheet and let stand for 1 minute. Generously dust with confectioners’ sugar and serve warm."}], "link": "https://cooking.nytimes.com/recipes/1020038-beignets"}