{"@context": "http://schema.org", "@type": "Recipe", "name": "Mashed Cauliflower", "description": "For surprisingly flavorful and creamy mashed cauliflower, cook your florets not in water but in a gently simmering pot of milk seasoned with garlic and thyme. When the cauliflower is mashed (or blended), the pectin in the cauliflower will thicken and smooth the mash. Add the garlic- and herb-infused milk one tablespoon at a time until you reach a light, silky consistency. All that’s needed is a little sour cream for tang. Save the leftover infused milk for braising </span><a href=\"https://cooking.nytimes.com/recipes/1019982-creamy-braised-white-beans\"><span>white beans</span></a><span>, a </span><a href=\"https://cooking.nytimes.com/recipes/1019922-creamed-tomatoes-on-toast\"><span>can of tomatoes</span></a><span>, or for making more mashed cauliflower.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2020/03/09/dining/as-mashed-cauliflower/merlin_170015811_81ff9e2e-3a7d-4df8-8d41-5fe01fcce010-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "easy, quick, weeknight, vegetables", "keywords": "cauliflower, garlic, milk, sour cream, thyme, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 230}, "recipeIngredient": ["1 large (2-pound) cauliflower, cut into small florets and core coarsely chopped", "2 cups whole milk", "2 garlic cloves, smashed and peeled", "4 sprigs fresh thyme, plus more leaves for garnish", "Kosher salt", "3 tablespoons sour cream", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine the cauliflower, milk, garlic, thyme and 1 teaspoon salt; heat over medium-high. When the mixture begins to bubble around the edges (you don’t want it to come to a full boil), reduce the heat to low and let it simmer, stirring occasionally, until the cauliflower is very tender, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a colander over a bowl, then drain the cauliflower, catching the milk in the bowl. Discard the thyme sprigs. Return the cauliflower and garlic to the pot. Mash the cauliflower using a potato masher, or use an immersion blender to purée until smooth. Add the reserved milk 1 tablespoon at a time, mashing or blending in between, until the cauliflower reaches desired consistency. (You’ll use about about 1/4 cup of milk.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the sour cream, then season to taste with salt and pepper. Garnish with additional thyme leaves."}], "link": "https://cooking.nytimes.com/recipes/1020930-mashed-cauliflower"}