{"@context": "http://schema.org", "@type": "Recipe", "name": "Chickpea Salad With Fresh Herbs and Scallions", "description": "A lighter, easier take on classic American potato salad, this version uses canned chickpeas in place of potatoes and favors Greek yogurt over mayonnaise. The trick to achieving the creamy texture of traditional potato salad is to mash some of the chickpeas lightly with a fork. It travels well, so it deserves a spot at your next picnic or desk lunch.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2019/07/03/dining/lh-chickpea-salad/lh-chickpea-salad-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, lunch, weekday, beans, salads and dressings", "keywords": "appetizer, side dish, chickpea, dijon mustard, dill, greek yogurt, parsley, scallion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 912}, "recipeIngredient": ["1/2 cup plain full-fat Greek yogurt", "3 tablespoons mayonnaise", "2 tablespoons lemon juice (from 1 lemon)", "1 1/2 teaspoons Dijon mustard", "1 teaspoon kosher salt", "1/2 teaspoon black pepper", "2 tablespoons minced fresh dill, plus more for serving", "2 tablespoons minced fresh parsley, plus more for serving", "3 (15-ounce) cans chickpeas, rinsed", "1 cup finely diced celery (about 3 stalks)", "1/2 cup thinly sliced scallions, white and green parts (2 to 3 scallions)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the yogurt, mayonnaise, lemon juice, mustard, salt and pepper. Whisk until smooth, then add the dill and parsley and stir to combine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chickpeas in a large bowl and using a fork, lightly mash about 1/3 of them. Add the celery and scallions and toss."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the dressing over the salad, toss well, and set aside at room temperature for at least 30 minutes before serving. Sprinkle with more dill and parsley and serve. (If you’re not serving the dish immediately, you can store it in the refrigerator for up to 2 days. Let sit at room temperature for 30 minutes before serving.)"}], "link": "https://cooking.nytimes.com/recipes/1020335-chickpea-salad-with-fresh-herbs-and-scallions"}