{"@context": "http://schema.org", "@type": "Recipe", "name": "Brown Sugar-Anise Cookies", "description": "This big, irresistible cookie takes almost no time to make, and is great for those occasions when you want a delicious treat, fast. If you think you don’t like anise seeds, you might enjoy their fragrant notes in this recipe, but you can always use sesame seeds instead. Or leave them out altogether — these cookies are still good with just sugar (use turbinado if you don’t have sanding or sparkling sugar). You can keep the rolled-out dough in the freezer, and throw it in the oven for a dinner party. With a little sorbet or ice cream, you have a dessert ready for company.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/11/27/dining/ss-anise-cookie/ss-anise-cookie-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "About 30 cookies", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars", "keywords": "anise, aniseed, brown sugar, butter, flour, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 292}, "recipeIngredient": ["2 cups/255 grams all-purpose flour, plus more for dusting", "1/3 cup/45 grams cornstarch", "3/4 teaspoon kosher salt", "1 cup/225 grams unsalted butter (2 sticks), softened", "1/2 cup/110 grams light brown sugar", "1 teaspoon vanilla paste or extract, or scrapings from 1/2 vanilla bean", "1 egg white", "2 teaspoons anise seeds", "1/4 cup/50 grams sanding or sparkling sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Combine 2 cups flour, the cornstarch and salt in a medium bowl, and whisk to combine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, cream together butter and light brown sugar on medium-high speed until light and fluffy, 2 to 3 minutes. Add vanilla paste and beat on medium speed until well combined, scraping bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour mixture and beat on low speed just until combined. Scrape the bowl and fold a few times to make sure everything is well combined. Divide dough in two, wrap each piece in plastic wrap, and flatten into disks. Chill until firm, at least 1 hour and up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one piece of dough on a lightly floured sheet of parchment, or a silicone baking mat, and flour both sides of the dough and the rolling pin. Roll dough into an oblong oval that is roughly 7-by-10 inches and a generous 1/4-inch thick. Prick all over with a floured fork. Repeat with the second piece of dough. Slide rolled dough on parchment paper onto a baking sheet, and freeze until firm, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly beat the egg white with 1 teaspoon water to thin it out. Lightly brush the top of the dough with the egg white, and sprinkle with the anise seeds, pressing gently to adhere. Sprinkle with the sanding sugar, then bake until turning deeply golden at the edges, 15 to 17 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool on the baking sheet. After about 5 minutes, use a knife, pastry wheel or pizza cutter to cut crosswise into 3/4-inch strips. Alternatively, let cool and serve whole, allowing guests to break into pieces. Cookies will keep in an airtight container at room temperature for 1 week."}], "link": "https://cooking.nytimes.com/recipes/1020654-brown-sugar-anise-cookies"}