{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Chicken Tortellini Tomato Soup", "description": "This comforting soup is a one-pot meal-in-a-bowl. The key to its deliciousness is the way in which the pressure cooker makes the soup taste as though it’s been simmered for hours when, in fact, it’s been only about 30 minutes. (You could also make <a href=\"https://cooking.nytimes.com/recipes/1020481-slow-cooker-chicken-tortellini-tomato-soup\">the slow-cooker version</a> of this recipe, if time is on your side.) Quick-cooking baby spinach works beautifully, but you can choose a different green if you prefer: If you use a heartier green, like chopped kale or chard, give it a few more minutes to get tender before adding the tortellini. If you’re planning for leftovers, add only the tortellini you will eat right away. Left in the soup, they will overcook. Be generous with toppings; they make the soup even more delicious.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/09/18/dining/sd-pressure-cooker-chicken-tortellini-soup/sd-pressure-cooker-chicken-tortellini-soup-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, lunch, quick, weeknight, pastas, soups and stews", "keywords": "basil, chicken thigh, crushed canned tomatoes, spinach, tortellini, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 134}, "recipeIngredient": ["2 tablespoons tomato paste", "4 cups chicken stock or broth", "1/4 cup dry white wine", "1 (28-ounce) can crushed tomatoes, preferably fire roasted", "1 tablespoon balsamic vinegar, preferably aged", "6 garlic cloves, finely chopped", "Roughly chopped leaves from 3 to 4 sprigs fresh oregano (about 2 tablespoons chopped) or 1 1/2 teaspoons dried oregano", "2 teaspoons onion powder", "1/2 teaspoon red-pepper flakes", "1/2 teaspoon kosher salt, plus more as necessary", "1 3/4 to 2 pounds boneless, skinless chicken thighs", "5 ounces baby spinach", "1 (8- to 10-ounce) package refrigerated cheese tortellini", "1 cup grated Parmesan, for serving", "Torn or shredded fresh basil, for serving", "Black pepper, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 6- or 8-quart electric pressure cooker, whisk together the tomato paste, stock and wine until the paste dissolves. Stir in the tomatoes, vinegar, garlic, oregano, onion powder, red-pepper flakes and salt. (If you are using unsalted stock, add an additional 1/2 teaspoon salt.) Add the chicken thighs and stir to evenly combine all the ingredients. Close the lid and cook on high pressure for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the pressure release naturally for 15 minutes, then release remaining pressure manually. Open the lid. Turn on the sauté setting. If you would like a thicker soup (adding Parmesan at the end will thicken the soup as well), remove the chicken with a slotted spoon and allow the soup to bubble until the desired texture is reached, then stir the chicken back in. Stir in the spinach so that it wilts into the soup. Coarsely shred the chicken with two forks, pressing pieces of chicken against the side of the pot to break the thighs apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the tortellini and cook until they are al dente and warmed through, about 3 minutes. Taste the soup and add salt if it tastes flat. Ladle the soup into bowls and top with Parmesan, basil and black pepper."}], "link": "https://cooking.nytimes.com/recipes/1020482-pressure-cooker-chicken-tortellini-tomato-soup"}