{"@context": "http://schema.org", "@type": "Recipe", "name": "Gluten-Free Chocolate Chip Cookies", "description": "Almond flour is the only special ingredient needed to make these cookies, and it can be found in the baking aisle or the health food section of the grocery store. It provides the protein and structure of a classic wheat flour, while keeping the cookie perfectly chewy in the center. If you want a stronger almond flavor, toast the almond flour in a dry skillet over medium-low heat until golden and fragrant, and cool before using. This recipe was adapted from the Times’s famous <a href=\"https://cooking.nytimes.com/recipes/1015819-chocolate-chip-cookies?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=1\">chocolate chip cookie recipe</a>, but unlike that recipe, this dough does not require 36 hours of refrigeration before baking. Chopped chocolate or feves make for a gooier cookie, but classic chocolate chips work here, too. This recipe makes huge, bakery-style cookies, but if you want smaller cookies, use 1/4-cup mounds of dough and bake for 16 to 18 minutes, or a 2-tablespoon scoops and bake for for 10 to 12 minutes.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2020/02/18/dining/em-gluten-free-cookie/merlin_169064667_e3358130-a629-4a37-954d-4bbcd75bd256-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 10 (5-inch) cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "almond flour, butter, chocolate, egg, light brown sugar, sugar, vanilla, dessert, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 449}, "recipeIngredient": ["2 3/4 cups/310 grams finely ground almond flour", "3/4 teaspoon kosher salt", "1/2 teaspoon baking soda", "10 tablespoons/140 grams unsalted butter, at room temperature (1 1/4 sticks)", "1/2 cup/110 grams light brown sugar", "1/2 cup/100 grams granulated sugar", "1 large egg", "1 1/2 teaspoons vanilla extract", "12 ounces/340 grams bittersweet chocolate feves or chips, or coarsely chopped bar chocolate", "Sea salt, for finishing (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Line two baking sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the almond flour, salt and baking soda to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mixer fitted with the paddle attachment, cream the butter, brown sugar and granulated sugar on medium speed until very light, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the egg and mix on medium speed to combine. Scrape the bowl well, then add the vanilla and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the dry ingredients and mix on low speed until just combined, about 10 seconds. Scrape the bowl well and mix on low speed to ensure the mixture is homogenous."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chocolate and gently mix to incorporate it. Scoop the dough into 10 3 1/2 ounce/100-gram mounds of dough the size of generous golf balls, and transfer them to the prepared baking sheets. Stagger the rows to allow the cookies room to spread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently press the cookies down slightly with your fingers until about 1 1/2 inches thick. Sprinkle lightly with sea salt, if using. Bake the cookies, switching racks and rotating the sheets halfway through, until they’re golden brown around the edges and just barely set in the center, 18 to 22 minutes. Transfer sheets to a wire rack for 10 minutes, then transfer cookies with a spatula onto another rack to cool a bit more."}], "link": "https://cooking.nytimes.com/recipes/1020871-gluten-free-chocolate-chip-cookies"}