{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheese Crackers", "description": "Cheddar crackers. Cheese wafers. Coins, biscuits, straws and crisps. Known by many names and claimed by many grandmothers, they are all the same, delicious thing: a savory, addictive, shortbread cookie. The key to any short dough — that distinctive tender sandy crumbly texture — is the high fat-to-flour ratio, and this version not only relies on butter but also counts on the delicious fats that come from sesame seeds, block Cheddar and even the oil from the pecans. For a remarkable distinction among the many, many versions of these to be found, toast them until just passing golden into brown, and see how that in itself sets these apart.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2019/02/24/magazine/24mag-eat-slideshow-slide-5TJ9/24mag-eat-slideshow-slide-5TJ9-articleLarge.png", "totalTime": "PT50M", "recipeYield": "About 6 dozen crackers", "recipeCuisine": "american, south american", "recipeCategory": "easy, quick, snack, crackers and chips", "keywords": "appetizer, cayenne pepper, cheddar, pecorino romano, sesame seeds", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 371}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 31, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "16 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/3 cups all-purpose flour", "1 cup loosely packed grated Cabot Farms Vermont white Cheddar (about 3 ounces)", "2/3 cup loosely packed grated pecorino Romano cheese (about 1 ounce)", "1 teaspoon kosher salt", "1/2 teaspoon cayenne", "8 tablespoons (1 stick) cold unsalted butter, cut into 1/4-inch cubes", "1 large egg yolk", "1/3 cup pecans, finely chopped (about 3 tablespoons)", "3 tablespoons untoasted white sesame seeds", "2 tablespoons ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour, both cheeses, salt and cayenne to the bowl of a food processor, and pulse until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the cold butter chunks on top, and pulse again to form coarse crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add egg yolk, pecans and seeds, and pulse to combine thoroughly, yielding a coarse grainy meal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer mixture to a large stainless-steel bowl. Sprinkle the ice water on top, and knead briefly to bring the dough together, as you would a pie dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into thirds, and roll each into a neat, 8-inch-long cylinder that is about the width of a silver dollar. Wrap each log in plastic wrap, and twist the ends tightly in opposite directions, forming a perfect and compact torchon. Refrigerate until well chilled and completely firm; overnight is ideal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375. Line two large baking sheets with parchment paper or nonstick baking mats. Unwrap the dough, discarding plastic wrap, and slice the logs into thin coins, each about the width of a pencil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the coins in neat rows on the prepared sheets, making sure they’re not quite touching one another. This dough won’t expand or flatten after baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden at their centers and just starting to toast at their edges, about 20 minutes. Check them midway through baking, and rotate sheets if your oven bakes unevenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the baking sheets to wire racks to cool. Once they are fully cooled, transfer coins to an airtight container, where they will keep for up to 3 weeks."}], "link": "https://cooking.nytimes.com/recipes/1020040-cheese-crackers"}