{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon-Soda Buttermilk Parfait", "description": "These seriously elegant and tongue-tingling parfaits are an excellent dessert to have in your year-round repertoire and are as perfect in the formal dining room under the chandelier as they are in the backyard tent on picnic tables under the paper streamers. Alternating thin precise layers of lemon soda gelatin and tangy buttermilk gelatin takes patience and focus, but once built, they can sit, covered, up to a week in the refrigerator. Be sure to pull them twenty minutes before serving to allow the fully chilled and set parfaits to relax a little, tempering to a perfectly jiggly consistency — then try not to giggle as you eat that first zingy lemony spoonful.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2019/09/08/magazine/08mag-eat/08mag-eat-articleLarge-v2.jpg", "totalTime": "PT5H", "recipeYield": "4 parfaits", "recipeCuisine": "american", "recipeCategory": "parfaits and trifles, project", "keywords": "buttermilk, club soda, gelatin, lemon, whipped cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 309}, "recipeIngredient": ["1 3/4 cups club soda", "1 tablespoon plus 1 teaspoon powdered gelatin", "1/2 cup fresh lemon juice (from about 4 lemons), strained", "1/2 cup granulated sugar", "1/4 cup cold water", "1 1/2 tablespoons powdered gelatin", "1 3/4 cups heavy cream", "1 cup buttermilk", "1/4 cup granulated sugar", "Unsweetened whipped cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the lemon gelatin: Pour 1/4 cup club soda into a medium bowl. Sprinkle the powdered gelatin on top, and let the gelatin bloom for 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the lemon juice and sugar in a double boiler or a medium stainless-steel bowl set over a saucepan with an inch of simmering water. Cook over low heat just until the lemon syrup begins to steam, about 3 minutes. You should have a viscous, syrupy liquid with no discernible traces of sugar granules. Pour the lemon syrup into the gelatin mixture, and stir well to combine. (There should be no visible undissolved gelatin, but you could pass the mixture through a fine-mesh strainer, if need be.) Stir in the remaining 1 1/2 cups club soda, and transfer to a bowl set over an ice bath."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the buttermilk gelatin: Pour the cold water into a medium bowl. Sprinkle the powdered gelatin on top, and let the gelatin bloom for 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a double boiler or a medium stainless-steel bowl set over a saucepan with an inch of simmering water, combine the heavy cream, buttermilk and sugar. Scald over medium heat until the sugar is dissolved completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the scalded cream mixture into the gelatin-and-water mixture, then pour into a smaller bowl set over an ice bath. Let cool for 5 minutes, stirring often to prevent the edges from solidifying. Remove the bowl from the ice bath, and let stand at room temperature. After about 5 minutes, once the mixture is the consistency of melted ice cream, start assembling the parfaits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gather four 8-ounce parfait glasses and prepare an ample ice bath that can comfortably and securely fit all four of the glasses without tipping them over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a tablespoon, carefully pour 2 tablespoons of the buttermilk mixture into the bottom of each glass, and place each glass into the ice bath to set for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick up a parfait glass, and give it a little jiggle to confirm the layer has set enough to receive — and support — the next layer. Then repeat Step 7 with the lemon mixture, allowing it to set until firm in the center, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue layering the buttermilk and lemon gelatins alternately, until the glasses are full, allowing each layer to fully set in the ice bath before proceeding to the next. Add more ice to the ice bath as needed, and don’t be tempted to hasten the process. If either mixture begins to firm up while you are working and is no longer spoonable or pourable, gently rewarm it for a few seconds over a pan of simmering water to liquify once more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and refrigerate the parfaits until thoroughly chilled and fully set, or up to 2 days. Before serving, be certain to temper for 20 minutes at room temperature for perfect, tender results. Finish with whipped cream."}], "link": "https://cooking.nytimes.com/recipes/1020440-lemon-soda-buttermilk-parfait"}