{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Chocolate Chip Cookies", "description": "This delightful recipe, a veganized version of the legendary Times’s <a href=\"https://cooking.nytimes.com/recipes/1015819-chocolate-chip-cookies?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=1\">chocolate chip cookie</a>, is the result of hours of research and more than 50 batches of cookies. In place of unsalted butter, this recipe calls for vegan butter, which provides plenty of flavor and just the right amount of spread. Instead of eggs, a combination of flaxseed meal and water provide structure and moisture, while granulated sugar and brown sugar — which are processed using animal products — are replaced with cane sugar and coconut sugar. </span><span><span><span>Be sure to check the ingredient list on the chocolate, too: Sometimes </span><span>even bittersweet bars contain dairy. </span></span></span><span>The resulting cookie looks, bakes and tastes like a classic chocolate chip cookie. <span>This recipe makes huge, bakery-style cookies, but if you want smaller cookies, use 1/4-cup mounds of dough and bake for 16 to 18 minutes, or 2-tablespoon scoops and bake for for 10 to 12 minutes.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2020/02/19/dining/em-vegan-cookie/em-vegan-cookie-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 8 (5-inch) cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "cane sugar, coconut sugar, flaxseed meal, flour, vanilla, vegan butter, vegan chocolate, dairy-free, vegan, vegetarian, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 228}, "recipeIngredient": ["1 3/4 cups/225 grams all-purpose flour", "3/4 teaspoon kosher salt", "1/2 teaspoon baking soda", "5 ounces/140 grams vegan butter or margarine, at room temperature", "1/2 cup/125 grams cane sugar", "1/2 cup/75 grams coconut sugar", "1 tablespoon flaxseed meal", "1 1/2 teaspoons vanilla extract", "12 ounces/340 grams vegan chocolate, chopped, or feves or chips", "Flaky sea salt, for finishing (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Line two baking sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the all-purpose flour, salt and baking soda to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mixer fitted with the paddle attachment, cream the vegan butter or margarine, cane sugar and coconut sugar on medium speed until very light, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk the flaxseed with 2 tablespoons room temperature water to combine. Add this mixture to the mixer and mix well on medium speed to combine. Scrape the bowl well, then add the vanilla and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the dry ingredients and mix on low speed until just combined, 5 to 10 seconds. Scrape the bowl well and mix on low speed to ensure the mixture is homogenous."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chocolate and mix just until incorporated. Scoop the dough into 8 (3 1/2 ounce/100 gram) mounds of dough the size of generous golf balls, and transfer them to the prepared baking sheets. Stagger the rows to allow the cookies room to spread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently press the mounded cookies down slightly using your fingers until about 1/2-inch thick. Sprinkle lightly with sea salt, if using. Bake the cookies, switching racks and rotating the sheets halfway through, until they’re golden brown around the edges and just barely set in the center, 18 to 21 minutes. Transfer sheets to a wire rack for 10 minutes, then transfer cookies with a spatula onto another rack to cool a bit more."}], "link": "https://cooking.nytimes.com/recipes/1020873-vegan-chocolate-chip-cookies"}