{"@context": "http://schema.org", "@type": "Recipe", "name": "Maduros (Fried Sweet Plantains)", "description": "Tender in the middle and crisp at the edges, maduros, or sweet fried plantains, are served as a side dish throughout the Caribbean and Latin America. Plantains change color as they ripen: They are firm when green and unripe, then soften as they turn yellow, and eventually, black. Like bananas, plantains develop more sugar as time passes. For the sweetest maduros, use blackened plantains — they have the most sugar, and will yield a more caramelized result. If you can only find yellow ones at the store, buy them in advance and be prepared to wait over a week for them to fully ripen. They’re worth it.", "author": {"@type": "Person", "name": "Kiera Wright-Ruiz"}, "image": "https://static01.nyt.com/images/2019/10/13/dining/kwr-maduros/kwr-maduros-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "4 servings", "recipeCuisine": "caribbean, latin american", "recipeCategory": "vegetables", "keywords": "appetizer, side dish, plantain", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "recipeIngredient": ["2 very ripe, blackened plantains (about 6 ounces each)", "Neutral oil, such as vegetable or canola oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a paring knife to cut a slit along the length of the plantains, carefully avoiding cutting into the flesh. Remove peels and discard. Slice plantains at an angle crosswise into 1/2-inch-thick pieces (about 12 pieces per plantain)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat about 1/8 inch vegetable oil over medium-high. When the oil shimmers, add half the sliced plantains and fry until golden brown, turning once, 2 to 3 minutes per side. The plantains should be caramelized and slightly crisp at the edges but still tender in the middle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, transfer maduros to a paper towel-lined plate to drain. Repeat with remaining sliced plantains. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020517-maduros-fried-sweet-plantains"}