{"@context": "http://schema.org", "@type": "Recipe", "name": "Almond Cake With Saffron and Honey", "description": "This is a lovely moist cake that keeps well and may be made several days in advance of serving. Stored well wrapped and at room temperature, its flavor only improves. For best results, grind blanched almonds to make your own almond meal. If you wish, accompany with a little whipped cream or vanilla ice cream.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/11/06/dining/01Tanisrex4/merlin_163467624_2499fe91-b117-4d71-b1ad-3252e42b5fb6-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "apricot, cinnamon, honey, lemon, orange, semolina flour, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 115}, "recipeIngredient": ["1/2 cup/115 grams unsalted butter (1 stick), melted, plus more for greasing the pan", "1/2 cup/90 grams fine semolina flour", "3/4 cup/150 grams granulated sugar", "1 cup/95 grams finely ground blanched almonds, or substitute almond meal", "1 1/2 teaspoons baking powder", "Pinch of kosher salt", "4 eggs, beaten", "Zest of 1 orange", "Zest of 1 lemon", "1/2 teaspoon almond extract", "1 cup/240 milliliters orange juice", "3/4 cup/150 grams granulated sugar", "2 tablespoons honey", "6 whole cloves", "6 cardamom pods", "1 (1-inch) piece cinnamon stick", "Pinch of crumbled saffron (optional)", "12 dried apricots, softened in boiling water and drained"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Butter a 10-inch diameter cake pan and line with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mix together the semolina, sugar, almonds, baking powder and salt. Whisk in eggs and melted butter. Add the orange and lemon zests and almond extract and beat well. Pour into prepared pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for about 45 minutes, until an inserted skewer comes out clean. Invert onto a wire rack and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As cake cools, make the syrup: Put orange juice, sugar, honey, cloves, cardamom, cinnamon, saffron and apricots in a saucepan, and bring to a boil. Stir to dissolve sugar, and then simmer gently for about 5 minutes. Set aside. Transfer cake to a serving plate. Use a skewer to poke holes all over and slowly pour syrup evenly over cake. Once the syrup has cooled slightly, arrange the spices and apricots on top of the cake to your liking. Leave cake for at least an hour to fully absorb syrup, or, if possible, wrap and store in a cool place (don’t refrigerate) for up to 5 days."}], "link": "https://cooking.nytimes.com/recipes/1020585-almond-cake-with-saffron-and-honey"}