{"@context": "http://schema.org", "@type": "Recipe", "name": "Frejon (Beans in Coconut Milk)", "description": "A simple dish of cooked beans puréed with coconut milk, frejon is an ode to the coastal city of Lagos and its rich cultural diversity. Typically served with a seafood stew, it is accompanied here by a vibrant, chunky tomato sauce laced with the heat of habanero, the richness of red palm oil and a hit of umami from dried crayfish, which is optional but highly recommended. A garnish of garri (coarsely ground and dehydrated cassava) adds some necessary texture; lime zest and bright green herbs lends freshness.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2019/06/26/dining/24Nigerianrex7/merlin_156460119_aad69999-093c-4b01-ac8f-72da4602aac1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "african", "recipeCategory": "dinner, beans", "keywords": "coconut milk, lime, Nigerian honey beans, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "recipeIngredient": ["2 cups dried Nigerian honey beans or adzuki beans", "10 fresh thyme sprigs", "1 fresh bay leaf", "1 small yellow onion, peeled and halved", "Kosher salt", "3/4 to 1 cup unsweetened, full-fat coconut milk", "2 tablespoons olive oil", "1 red bell pepper, quartered, seeded and sliced crosswise into 1/4-inch-thick strips", "2 garlic cloves, thinly sliced", "1/2 red habanero chile", "1 tablespoon dried crayfish powder or 2 tablespoons tiny dried shrimp (optional)", "1 (14-ounce) can whole peeled tomatoes with their juices", "1 tablespoon red palm oil", "1/4 cup fresh mint leaves", "1/4 cup fresh cilantro leaves and tender stems", "2 scallions, thinly sliced", "1/2 lime, zest removed in strips and julienned, plus lime wedges, for serving", "1/4 cup garri (fermented coarse ground cassava), optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick through the beans for rocks, bad grains or twigs. Transfer the beans to a large bowl and add cold water to cover by at least 2 inches. Allow to soak for 4 hours or up to 12 hours. Rinse the beans and transfer them to a large, heavy-bottomed pot. Add enough water to cover the beans by 2 inches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap the thyme, bay leaf and half the onion in a piece of cheesecloth and tie it with twine. Add to the pot and bring the mixture to a boil over high heat. Reduce to low, partly cover with a lid and simmer until the beans are completely tender, about 1 1/2 hours. Season with salt and allow beans to cool slightly in the cooking liquid. Discard the bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the beans, discarding liquid, and transfer the beans to a food processor. Pour in 3/4 cup coconut milk and purée until smooth. Add more coconut milk for a smoother, thinner purée, if desired. Return the bean mixture to the pot, cover and keep warm on low heat, stirring occasionally to keep the bottom from scorching."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice the remaining onion. Heat the olive oil in a medium skillet over medium-high. Add the sliced onion and bell pepper, and sauté, stirring occasionally, until softened and just beginning to brown around the edges, 4 to 5 minutes. Add the garlic, habanero and dried crayfish powder, if using, and cook until fragrant, about 1 minute. Add the tomatoes and their juices, tearing the tomatoes into large chunks as you add them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/4 cup water, bring to a simmer then reduce heat to low. Cook, stirring frequently, until sauce is slightly reduced and flavors meld together, about 6 minutes. Stir in the red palm oil and cook an additional 2 to 3 minutes. Remove from heat, discard the habanero, and season sauce to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the mint, cilantro, scallions and lime zest in a small bowl. Divide the bean purée among bowls, top with a healthy spoonful of the chunky tomato sauce and garnish with the herb and lime zest mixture. Sprinkle the garri on top, if using, and serve with lime wedges."}]}