{"@context": "http://schema.org", "@type": "Recipe", "name": "Loco Moco ", "description": "This classic Hawaiian dish is similar to Japanese hambāgu, a ground beef patty topped with a ketchup-based sauce, but loco moco is heartier, served atop a pile of white rice, smothered with caramelized onion gravy and topped with a fried egg. People in Hawaii enjoy it for breakfast, lunch, dinner or any time in between. This version is adapted from “Aloha Kitchen: Recipes From Hawai‘i,” by Alana Kysar, a cookbook of Hawaiian classics.", "author": {"@type": "Person", "name": "Kiera Wright-Ruiz"}, "image": "https://static01.nyt.com/images/2019/04/08/dining/kw-loco-moco/kw-loco-moco-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, weekday, meat", "keywords": "egg, ground beef, mushroom, onion, soy milk, worcestershire sauce, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 385}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 730, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "1 gram", "proteinContent": "33 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1043 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 pound ground beef, at least 15 to 20 percent fat", "1 medium Maui or yellow onion, peeled (1/4 of the onion chopped; 3/4 sliced)", "2 garlic cloves, peeled and finely grated", "3 teaspoons Worcestershire sauce", "1 teaspoon kosher salt, plus more as needed", "1/2 teaspoon black pepper, plus more as needed", "2 1/2 tablespoons neutral oil", "8 ounces cremini mushrooms, cleaned and sliced (optional)", "2 cups beef broth", "2 teaspoons soy sauce", "2 tablespoons cornstarch", "4 cups steamed white rice", "4 large eggs, fried, sunny side up or over easy", "2 chopped scallions, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the beef, chopped onion, garlic, 1 1/2 teaspoons Worcestershire sauce, 1 teaspoon salt and 1/2 teaspoon pepper. Mix with your hands or a wooden spoon until just combined, being careful not to overmix. Form into four patties about 1/2-inch thick. Place the patties on a plate, cover with plastic wrap and transfer to the refrigerator for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 1 tablespoon oil in a large 12-inch skillet over medium. When the oil is hot and shimmering, add the sliced onion and sauté, stirring occasionally, until almost translucent, 5 to 7 minutes. Reduce the heat to low and continue cooking, stirring often, until soft and caramelized, about 10 minutes. Transfer to a bowl and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 tablespoon oil to the skillet and heat over medium. When the oil is hot, swirl the pan around to evenly coat it, then gently place the patties in the pan, spacing them out evenly. Cook until browned, about 4 minutes per side. Using a spatula, transfer patties to a clean plate to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 1/2 tablespoon oil to the pan and heat over medium until hot. Add the mushrooms (if using) and sauté until tender, about 10 minutes. Season the mushrooms with salt and pepper, then add the caramelized onions, beef broth, soy sauce and the remaining 1 1/2 teaspoons Worcestershire sauce and bring to a simmer. Reduce the heat to medium-low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cornstarch in a small bowl. Add 2 tablespoons of the broth from the skillet and whisk until smooth. Stir the cornstarch slurry into the skillet and simmer until the sauce has thickened, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1 cup steamed rice on each plate and top each serving with one patty, then the gravy, a fried egg and chopped scallions."}], "link": "https://cooking.nytimes.com/recipes/1020162-loco-moco"}