{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Empanadas", "description": "Filipinos take snacking seriously, so much so that we devote an entire meal to it: merienda, which may take place midmorning or midafternoon, if not both. Empanadas are a great treat for this in-between time, but also keep well at room temperature — the grace of food built for a warm climate — so you can graze all day. (My family used to buy these by the tray for parties, but it’s nice to make your own and store them in the freezer for later.) In these, a ground-beef filling is tucked inside sturdy but flaky dough, with raisins added early in the cooking to plump with the beef juices. There are variations on empanadas all over Latin America; ours rely on the potency of onion and garlic, and exploit it to the hilt.", "author": {"@type": "Person", "name": "Angela Dimayuga"}, "image": "https://static01.nyt.com/images/2019/10/09/dining/08Filipinorex10-empanada/merlin_160617843_14011642-342a-4f0e-93d5-4c962d75621c-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "40 empanadas", "recipeCuisine": "filipino", "recipeCategory": "dinner, lunch, snack, finger foods, meat, pastries, project", "keywords": "appetizer, main course, bell pepper, ground beef, oyster sauce, russet potatoes, soy sauce", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 86}, "recipeIngredient": ["2 eggs", "1/4 cup milk", "1 tablespoon plus 1/2 teaspoon kosher salt", "4 1/2 cups/575 grams all-purpose flour, plus more as needed", "1 cup/225 grams unsalted butter (2 sticks), diced", "2 tablespoons white vinegar", "2/3 cup ice water", "1 tablespoon vegetable oil", "1 tablespoon tomato paste", "1 small yellow onion, finely chopped (about 1 cup)", "1/2 large green bell pepper, stemmed, seeded and cut into 1/4-inch cubes", "1/2 large red bell pepper, stemmed, seeded and cut into 1/4-inch cubes", "3 garlic cloves, finely minced", "1 1/2 teaspoons kosher salt", "1/2 teaspoon coarsely ground black pepper", "1/2 medium russet potato, peeled and cut into 1-centimeter cubes (about 1/2 cup)", "1/4 cup raisins", "3/4 pound ground beef", "1 tablespoon plus 1/2 teaspoon oyster sauce", "1 tablespoon soy sauce", "1/2 cup chicken stock", "1 (48-ounce) bottle neutral oil, such as canola, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the empanada dough: In a medium bowl, beat the eggs with the milk and 1/2 teaspoon salt. In a large bowl, combine the flour and 1 tablespoon salt, and mix well. Add the butter and incorporate it into the flour using your hands or a food processor. Combine until mixture is sandy. Combine the egg mixture, vinegar and 2/3 cup ice water, whisking to break up the egg. Add egg mixture to flour mixture, and beat with a fork to bring dough together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle a light layer of flour over a work surface. Place the dough on top. Bring dough together by pressing and folding dough onto itself a few times with the palms of your hands. Being careful not to overwork, split dough in half and form into two equal logs about the thickness of a small sausage, 1 1/2- to 2-inches thick. Wrap with plastic wrap and refrigerate until firm, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the dough rests, prepare the filling: In a large skillet, heat the oil over medium-high and bring to a shimmer. Add the tomato paste and toast, stirring frequently, until darkened and caramelized, about 3 minutes. Add the onion, bell peppers, garlic, salt and pepper, and cook, stirring occasionally, until slightly softened, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the potato and raisins, and cook, stirring, until mixture starts to caramelize, 8 to 10 minutes. Reduce the heat to medium and cook, stirring occasionally, until softened, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beef, increase the temperature to medium-high and cook, stirring occasionally, until beef is cooked through, about 10 minutes. Stir in oyster sauce and soy sauce until coated, then stir in chicken stock. (Mixture should be glossy but not overtly wet; cook for another 5 minutes or so to reduce liquid, if need be.) Transfer to a sheet pan, dispersing in a thin layer, and refrigerate until chilled, at least 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a small bowl with some cool water for sealing your empanadas, and another small bowl with flour for dusting. Working with one log at a time, remove dough from fridge. Cut each log in half crosswise, then cut each half crosswise into 10 equal pieces, which will be the shape of thick coins. Using a bit of flour, dust your work surface. Round each coin slightly using your thumb and forefinger and on your surface with your hands press each coin lightly to coax it into a flat round shape. Switch to a rolling pin and roll each piece of empanada dough into a 4 1/2-inch circle. You can lightly dust and stack your circles off to the side or transfer them to a parchment lined baking sheet and chill until you are ready to assemble (they are easier to work with when kept cool). Repeat with remaining log. When you have all your pieces rolled out, you are ready to assemble your empanadas. Place about 1 1/2 tablespoons of the meat filling in the center of each circle, leaving at least a 1/2-inch border. Using a brush or your finger, wet the edges of the dough with water and fold the crust over the filling, forming half-moon empanada shapes, sealing out as much air as possible. Crimp the edges of the empanada with the tines of a fork to seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy Dutch oven or pot, heat about 2 inches of oil over medium-high. Heat oil to 365 degrees. Working in batches so as not to crowd the pan, maintaining an even heat, fry the empanadas, turning frequently, until they start to bob, 4 to 5 minutes. (They should be crisp and golden brown, the pastry should be cooked through and the meat should be warmed through.) Transfer to a paper-towel lined baking sheet and fry remaining empanadas. Serve warm."}]}