{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Tart With Goat Cheese and Thyme", "description": "Store-bought puff pastry is the true workhorse in this elegant recipe, which involves three basic components: puff pastry, cheese and potatoes. When cooking with limited ingredients, quality is key, so use puff pastry made with real butter if you can get it — the flavor is better and the puff is, simply put, puffier. The dough is formed by a process called “lamination” in which alternating layers of butter and dough are folded together. As it bakes, the butter creates steam between the layers, providing the puff. Be sure to use the tines of a fork to “dock” the dough before baking; this creates little chutes for steam to escape instead of getting trapped and forming unsightly bubbles. Master the puff pastry part and this tart is easy and versatile: Play around with various spices and top with any fresh herbs you have on hand.", "author": {"@type": "Person", "name": "Sue Li"}, "image": "https://static01.nyt.com/images/2019/02/25/dining/sl-potato-tart/merlin_150673014_e3e876d1-e6a4-4e91-95ca-612830df0ce0-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, pies and tarts", "keywords": "goat cheese, potato, puff pastry, ricotta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 308}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 419, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "2 grams", "proteinContent": "11 grams", "saturatedFatContent": "10 grams", "sodiumContent": "353 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["All-purpose flour, for dusting", "1 (14-ounce) package frozen puff pastry, thawed", "1 pound baby potatoes, preferably in different colors", "8 ounces fresh ricotta", "1 (4-ounce) log firm goat cheese", "2 teaspoons smoked paprika", "Kosher salt and black pepper", "1 tablespoon unsalted butter, melted", "1 teaspoon fresh thyme leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. On a lightly floured surface, roll puff pastry into a 10-by-14-inch rectangle. Place puff pastry on a parchment-lined baking sheet. Using a paring knife, lightly score a border around the perimeter of the puff pastry, about a 1/2 inch away from the edges. Using a fork, prick the pastry every few inches inside the border to prevent puffing, then bake on top rack until puffy and lightly golden, about 15 minutes. Remove from the oven and let cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, fit a large pot with a steamer basket. Add enough water to come just below the steamer basket and bring to a boil. Add the potatoes, reduce the heat to a simmer, cover and steam until potatoes can be pierced with the tip of a knife, but are still firm, about 20 minutes. Transfer steamer basket to a large bowl and allow to cool until you can handle the potatoes. Slice potatoes crosswise 1/4-inch thick and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While potatoes cook, blend ricotta, goat cheese, paprika and 1 teaspoon salt in a food processor until smooth. Working within the border, spread the cheese mixture evenly on the puff pastry. Arrange the potato slices in a single layer on top of cheese mixture and brush the potatoes with the melted butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to the oven and bake until the edges of the cheese are slightly golden, about 20 minutes. Sprinkle with fresh thyme leaves and serve."}], "link": "https://cooking.nytimes.com/recipes/1020058-potato-tart-with-goat-cheese-and-thyme"}