{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Spaghetti Squash", "description": "Once baked and scraped into noodle-like strands, spaghetti squash becomes a frequent pasta understudy, tossed with pesto, tomato sauce or roasted vegetables. But it’s a versatile ingredient, as its mild flavor and gentle crunch also make it a good base for stews or even curries. For a basic roasted spaghetti squash recipe, follow Step 1, scrape the insides into strands, and be on your way. For a complete side dish, proceed with the rest of the recipe and top with herby breadcrumbs and Parmesan. You can also add mozzarella, which will melt into delicious little pools among the squash strands.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/10/29/dining/as-spaghetti-squash/as-spaghetti-squash-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, for two, vegetables", "keywords": "fall, winter, garlic, mozzarella, panko, parmesan, spaghetti squash, thyme, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 390}, "recipeIngredient": ["1 large (3- to 4-pound) spaghetti squash, halved lengthwise and seeded", "3 tablespoons extra-virgin olive oil", "Kosher salt and black pepper", "1 cup freshly grated Parmesan", "1/2 cup panko", "1 garlic clove, grated", "1 teaspoon fresh thyme leaves", "8 ounces mozzarella, cut into 1/2-inch cubes (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. Brush the cut side of each squash half with 1 tablespoon olive oil, then season with salt and pepper. Place squash, cut-sides down, on a parchment-lined baking sheet and roast until the squash is tender when poked with a fork, 35 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, stir together the Parmesan, panko, garlic, thyme and the remaining 1 tablespoon olive oil. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flip the squash and use a fork to scrape the squash into spaghetti strands. Stir in half the mozzarella, if using, then sprinkle the squash with the remaining mozzarella and the panko mixture. Roast until the top is golden brown and mozzarella has melted, 20 to 25 minutes."}], "link": "https://cooking.nytimes.com/recipes/1020577-baked-spaghetti-squash"}