{"@context": "http://schema.org", "@type": "Recipe", "name": "Scorpion Bowl", "description": "Because many tiki recipes were kept secret from even the bartenders assembling them, the original scorpion bowl recipe is difficult to pinpoint. This recipe is an updated take on what many consider to be one of the originals: Trader Vic’s 1946 recipe. The quality of the ingredients is important, but just as important is the garnish. Put edible flowers, chunks of fruit and reusable straws to work. If fire is in your heart, float a flaming lime shell atop the drink (see Tip), taking care to attempt this only in the early stages of the night and to snuff out any lingering flames before serving.", "author": {"@type": "Person", "name": "Rebekah Peppler"}, "image": "https://static01.nyt.com/images/2019/08/14/dining/14scorpionrex01/merlin_159057003_12f6fe2f-6eb0-450b-a1b3-932ddac0913c-articleLarge.jpg", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "cocktails", "keywords": "cognac, gin, lemon, orange, orgeat syrup, rum", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 103}, "recipeIngredient": ["8 ounces dark Jamaican rum", "4 ounces fresh lemon juice (from 2 to 3 lemons)", "3 ounces fresh orange juice (from 1 large orange)", "3 ounces orgeat", "2 ounces Cognac", "2 ounces high-proof gin", "3 cups ice cubes", "Any combination of edible flowers, mint sprigs, maraschino cherries, cinnamon sticks, citrus peels, citrus rounds, pineapple wedges and paper umbrellas, for garnish", "Flaming lime shell (see Tip), optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender, working in batches if necessary, combine the rum, lemon juice, orange juice, orgeat, Cognac and gin. Add the ice, then cover and blend at high speed until the ice is broken into small pieces, 5 to 10 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour into a scorpion bowl, tiki bowl or small punch bowl. Garnish as desired. (If using a scorpion bowl with a volcano, this would be the time to light your flaming lime shell, if desired, taking care to keep garnishes out of the flame’s reach. Snuff out any lingering flames before Step 3.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately, with straws."}]}