{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet and Sour Eggplant With Garlic Chips", "description": "This vibrant eggplant dish relies heavily on simple pantry staples, but gets its complex flavor from the clever use of garlic: First, you make garlic chips, then you fry eggplant in the remaining garlic-infused oil. Since garlic chips can burn easily, the key here is to combine the garlic and oil in an unheated pan for even cooking. As the oil heats up, the garlic will sizzle rapidly as the moisture cooks off. When it slows down, the garlic slices should be crisp. Be sure to remove the chips just as they begin to turn golden, as they will continue to cook after being removed from the oil. The rest is easy: Sauté the eggplant, create a quick soy sauce glaze, sprinkle with herbs and garlic chips, and serve.", "author": {"@type": "Person", "name": "Sue Li"}, "image": "https://static01.nyt.com/images/2019/09/10/dining/sl-eggplant-and-garlic/sl-eggplant-and-garlic-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "2 to 4 servings", "recipeCuisine": "american, chinese", "recipeCategory": "dinner, easy, quick, weeknight, one pot, vegetables", "keywords": "basil, cilantro, garlic, japanese eggplant, rice wine vinegar, soy sauce, main course, side dish, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 243}, "recipeIngredient": ["4 cloves garlic, very thinly sliced", "1/4 cup sunflower oil or other neutral oil", "Kosher salt", "3 medium Japanese eggplants (about 1 pound total), quartered lengthwise then cut into 2-inch pieces", "3 tablespoons low-sodium soy sauce", "2 tablespoons light brown sugar", "1 tablespoon rice wine vinegar", "1/2 to 1 teaspoon red-pepper flakes", "1/2 cup fresh cilantro, roughly chopped", "1/4 cup fresh basil leaves, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a small sieve over a heatproof bowl. Combine garlic and oil in a medium skillet and heat over medium-low. Cook garlic until light golden brown and crisp and the bubbles have subsided, 3 to 4 minutes, then quickly strain the garlic chips into the sieve set over the bowl. Transfer the garlic chips to a paper towel-lined plate, season with kosher salt and set aside. Transfer the garlic oil back to the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the garlic oil over medium-high. Add the eggplant in batches, adding more as they shrink in size and space permits, and cook, stirring occasionally, until cut sides of eggplant are golden-brown and skins are slightly wrinkled, 6 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the soy sauce, sugar, vinegar and red-pepper flakes and reduce the heat to medium-low. Simmer, tossing the eggplant to coat, until sauce thickens, 1 to 2 minutes. Serve topped with fresh herbs and garlic chips."}], "link": "https://cooking.nytimes.com/recipes/1020459-sweet-and-sour-eggplant-with-garlic-chips"}