{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Daurade With Mujadara", "description": "Mujadara, an Israeli and Middle Eastern mixture of seasoned rice and lentils upholsters a plate of seared fish fillet, brightening it with a generous swath of piquillo pepper puree. Mujadara is often served on its own, topped with a tangle of crisply fried onions, perhaps with yogurt on the side. But here, the earthy combination of grain and bean, with the bittersweet addition of the Spanish peppers, brings the fish into focus. You could serve the mujadara and pepper sauce without the fish, but in that case, fried onions are a must.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2019/10/09/dining/07pairrex/merlin_162052665_e6162107-a923-4d30-99f9-794282f2ac7e-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": null, "recipeIngredient": ["1 cup black lentils", "1 cup basmati rice", "1/2 cup extra virgin olive oil", "3 scallions, sliced, white and green parts separated", "4 shallots, diced fine, about 3/4 cup", "2 teaspoons minced fresh ginger", "1 1/2 cups canned piquillo peppers, drained and rinsed to remove any seeds, chopped", "2 tablespoons sliced almonds, toasted", "2 cups sliced onion", "4 cloves garlic, sliced", "2 teaspoons sherry vinegar", "Salt and ground black pepper", "Juice of 1 lemon", "6 (6-ounce) fillets daurade, black sea bass or branzino, with skin", "2 tablespoons chopped flat-leaf parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place lentils in a 2-quart saucepan, add 4 cups water, bring to a simmer and cook until tender, about 40 minutes. Set aside. Bring 1 1/2 cups water to a boil in a 3-quart saucepan, add rice, reduce heat to a simmer, cover and cook 12 minutes. Set aside, covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 4 tablespoons of the olive oil in a medium-size skillet, add white part of scallions, the shallots and ginger. Cook gently until tender and lightly browned, 6 to 8 minutes. Fold into the rice, then fold in 1/2 cup of the piquillo peppers and the almonds. Cover."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the olive oil in the skillet, add the onion and garlic, cook gently until tender but not brown, about 5 minutes. Stir in the remaining piquillo peppers and cook another couple of minutes. Puree this mixture in a food processor. Fold in the vinegar and season with salt and pepper. Return to the skillet and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the mujadara, fold the cooked lentils into the rice mixture. Add in the lemon juice and season to taste with salt and pepper. Gently stir in the green of the scallions and place over low heat, covered, to warm. Place the skillet with the piquillo pepper sauce over low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the fish dry and season with salt and pepper. Heat one or two cast-iron skillets, large enough to hold the fish with a little room to spare, until very hot. Add the remaining 2 tablespoons olive oil, sear the fish on the skin side and cook about 3 minutes, turn and cook another 2 minutes, until just done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread a big circle of the piquillo pepper sauce on each of 6 dinner plates or one large platter. Divide the mujadara rice and lentil mixture among them, or in the middle of the platter. Top the mujadara with the fish, skin side up, add the parsley and serve."}], "link": "https://cooking.nytimes.com/recipes/1020511-seared-daurade-with-mujadara"}