{"@context": "http://schema.org", "@type": "Recipe", "name": "Olive Oil-Roasted Chicken With Caramelized Carrots", "description": "Think of this as a weeknight chicken confit, cooked low and slow in plenty of olive oil along with sweet carrots and tangy lemon slices. Save that leftover oil and use it to roast vegetables, fry eggs, jump-start a pasta sauce or, of course, cook more chicken.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/06/05/dining/03Romanrex/03Romanrex-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry", "keywords": "carrot, chicken legs, lemon, olive oil, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1070}, "recipeIngredient": ["2 pounds whole chicken legs, or bone-in, skin-on drumsticks or thighs", "Kosher salt and black pepper", "1 bunch small, thin carrots, preferably with their green tops", "2 heads garlic, left unpeeled and halved crosswise to expose the cloves", "1 lemon, thinly sliced, seeds removed", "1/2 bunch oregano, plus more leaves, for garnish", "1 cup olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Season chicken with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the carrots have their green tops, trim them so that the stems are about 1/2- to 1-inch long. Save the greens for garnish or for using in salsa verde or pesto. (They can be treated like parsley.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange chicken in a large shallow baking dish or shallow braising pot — about 2 1/2 to 3 quarts — so that the legs are snug and lying flat. Scatter garlic head halves, carrots, lemon slices and oregano sprigs among the chicken pieces, nestling everything in there. (It’s O.K. if the carrots stick out a bit.) Pour the olive oil over the chicken and vegetables. (Yes, you’re using all that oil! Don’t worry, it can be repurposed; see Tip.) Season again with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven, uncovered, and roast until the chicken is so tender it nearly falls off the bone and the carrots and lemons are nicely caramelized, 55 to 65 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and let cool slightly. Divide chicken, vegetables and lemons among plates (or serve straight from the dish it was cooked in). Scatter with carrot tops, if you have them, and more oregano before eating. Reserve the leftover schmaltzy olive oil in the baking dish for another purpose."}], "link": "https://cooking.nytimes.com/recipes/1020260-olive-oil-roasted-chicken-with-caramelized-carrots"}