{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Lasagna", "description": "This classic vegan lasagna replaces ricotta with a homemade cashew-tofu cream that is easy to prepare and strikes the right balance: Cashews provide richness while tofu keeps things light. This recipe can be modified to fit your schedule. If you’re in a hurry, forgo the sauce for three cups of your favorite store-bought marinara, and if you prefer no-boil noodles, they work, too. You could replace the cashew-tofu cream with purchased vegan ricotta, or get ahead on future dinners by doubling the cashew-tofu ricotta and freezing the extra batch. It keeps for up to six weeks in the freezer, and can also be used in stuffed shells and manicotti.", "author": {"@type": "Person", "name": "Gena Hamshaw"}, "image": "https://static01.nyt.com/images/2020/03/09/dining/gh-vegan-lasagna/merlin_170017074_223a2161-e4da-45e6-a390-58247bef06dd-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "dinner, casseroles, noodles, pastas", "keywords": "canned tomatoes, cashew, crushed canned tomatoes, ricotta, tofu, tomato, tomato sauce, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "recipeIngredient": ["1 tablespoon olive oil", "1 small white or yellow onion, chopped (about 1 cup)", "2 garlic cloves, finely chopped", "2 tablespoons tomato paste", "1 teaspoon Italian seasoning (or 1 teaspoon dried oregano)", "1/4 teaspoon red-pepper flakes", "1 (14-ounce) can diced tomatoes with their juices", "1 (14-ounce) can crushed tomatoes", "1 tablespoon vegan sugar (optional)", "Kosher salt, to taste", "2 cups raw cashews", "1 small garlic clove", "3 tablespoons fresh lemon juice", "1 (15-ounce) block extra-firm tofu, lightly pressed between paper towels to remove excess moisture", "2 tablespoons nutritional yeast", "Kosher salt and black pepper", "Olive oil, for greasing", "Kosher salt", "9 to 12 uncooked lasagna noodles", "Fresh basil leaves, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the marinara sauce: Heat the olive oil in a pot over medium-high. Add the onion and cook, stirring often, until the onion is soft and translucent, 4 to 5 minutes. Add the garlic and cook, stirring constantly, for another minute. Stir in the tomato paste, Italian seasoning and red-pepper flakes, then stir in the diced and crushed tomatoes and sugar, if using. Allow the sauce to come to a simmer, then reduce the heat to low and cook for 5 minutes, uncovered. Add salt to taste. You can leave the sauce textured or purée it with an immersion blender, depending on your preference. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the ricotta: Add the cashews and garlic to a food processor and process until the cashews form a coarse meal, about 1 minute. Stop and scrape down the sides of the processor, then turn the processor back on. While it’s running, drizzle in 1/2 cup water and the lemon juice. Process until completely smooth and the texture resembles hummus, another 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crumble the block of tofu into the processor, add the nutritional yeast, and season with salt and pepper. Continue processing until the mixture is smooth and resembles ricotta, stopping to scrape the sides of the processor as needed, about 1 minute. Taste and adjust salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the lasagna: Heat the oven to 350 degrees and lightly oil a 9-by-13-inch casserole dish. Bring a large, salted pot of water to boil. Cook the lasagna noodles according to package instructions, until they’re al dente. (Skip this step if you’re using no-boil noodles.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Layer 1 scant cup marinara sauce at the bottom of your lasagna dish. Cover it with a layer of 3 to 4 lasagna noodles. Cover the noodles with half the vegan ricotta. Cover the ricotta with another layer of noodles, followed by another cup of marinara and the remaining ricotta. Add a final layer of noodles and the remaining marinara sauce. Bake the lasagna for 40 to 45 minutes, or until the marinara on top is dark and the lasagna is bubbling. Top with torn basil leaves, if desired, and serve."}]}