{"@context": "http://schema.org", "@type": "Recipe", "name": "Galettes Complètes (Buckwheat Crepes)", "description": "If you can make pancakes for breakfast, you can certainly make crepes for dinner. These savory ones from Brittany — which use buckwheat flour and are filled with Gruyère cheese, ham and egg — are nutty, earthy and incredibly satisfying any time of day. Loosen the batter, if needed, using beer, water or hard cider; it all works equally well. Once you get the hang of the tilt and swirl, you can have your family fed in minutes, and unlike those nerve-shredded times when you brightly declare “It’s breakfast for dinner, kids!” — which children everywhere know is a sign that something is wrong for Mom — this is one instance where you can announce it, and mean it: Everything is actually alright. Galettes complètes are meant to be a meal.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2020/03/29/magazine/29mag-eat/29mag-eat-articleLarge.jpg", "totalTime": "PT8H30M", "recipeYield": "6 crepes", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, snack, one pot", "keywords": "buckwheat flour, cheese, crepes, egg, flour, gruyère, ham, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 51}, "recipeIngredient": ["3 large eggs", "1 1/4 cups/150 grams buckwheat flour", "1/4 teaspoon kosher salt", "6 large eggs", "6 ounces Gruyère cheese, grated (about 2 cups)", "8 ounces thinly sliced jambon de Paris (or other ham)", "Kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk 3 eggs with 1 cup water until frothy and uniform. Sift in buckwheat flour, and whisk until as smooth as a new can of paint. Season with salt and whisk to combine. Cover batter and refrigerate overnight (at least 8 hours, or up to 24 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 10-inch nonstick skillet over medium-low. Ladle in 1/4 cup of batter, then quickly tilt the pan in a clockwise motion to swirl the batter all the way to the edges into a perfectly round, very thin pancake. The batter should disperse quickly; if it is too thick — and doesn’t swiftly radiate to cover the width of the pan — you’ll need to stir a few extra tablespoons of water into the batter and try again with a second crepe. Expect to lose the first two or three crepes as you get used to the swirling motion, the amount of batter to add and the hotness of the pan. When all three factors align, you can make six savory crepes in about as many minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you feel you have the hang of it and are ready to go live, ladle in 1/4 cup batter, swirl and allow crepe to set for just 10 seconds. Crack an egg in the center, and use the back of a spoon or a small rubber spatula to spread the egg white, which will allow the egg to cook evenly in the amount of time it will take the cheese to melt and the galette to crisp. Sprinkle about 1/3 cup Gruyère across the surface, then tear 2 or 3 pieces of ham and set them flat on top, surrounding the egg yolk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the crepe to crisp up and brown on the bottom while the egg cooks sunny side up, and the ham warms through, 3 to 4 minutes. In Brittany, these are cooked on a large, round cast-iron griddle, and the four sides of the galette are folded in to become a large square before being slid onto a plate. This is harder to do in a slope-sided pan, but try it if it suits you — you’ll want to fold the sides about 1 minute before the egg is done cooking. Otherwise, an open round is just fine. Slide it onto a plate, and repeat with remaining galettes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season with salt and pepper. Drink with hard cider, not too cold."}], "link": "https://cooking.nytimes.com/recipes/1020953-galettes-completes-buckwheat-crepes"}