{"@context": "http://schema.org", "@type": "Recipe", "name": "Lablabi (Tunisian Chickpea Soup)", "description": "There are myriad ways to cook lablabi, the classic, cumin and garlic scented chickpea soup from Tunisia. This version, adapted from Joe Yonan’s cookbook “Cool Beans” (Ten Speed Press, 2020), has crunchy, spice-sprinkled chickpeas garnishing the top, and a creamy, silky broth made from puréeing some of the chickpeas and stirring them back into the pot. It’s earthy and satisfying, with a chile kick from harissa and a bright tanginess from a squeeze of lemon at the end.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/02/19/dining/14apperex/14apperex-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "african", "recipeCategory": "soups and stews", "keywords": "chickpea, harissa, za’atar, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 636}, "recipeIngredient": ["1 3/4 cup cooked chickpeas, or 1 (15-ounce) can chickpeas, drained and rinsed", "2 teaspoons extra-virgin olive oil", "1/2 teaspoon kosher salt, plus more to taste", "1 teaspoon za’atar, plus more to taste", "1 1/2 cups dried chickpeas, soaked overnight and drained", "1/4 cup plus 3 tablespoons extra-virgin olive oil, plus more for serving", "2 bay leaves", "1 1/2 teaspoon kosher salt, plus more to taste", "1/2 loaf hearty rustic bread (about 8 ounces)", "1 cup chopped onion, from 1 medium onion", "6 garlic cloves, minced or finely grated", "1 tablespoon ground cumin, plus more for serving", "1 tablespoon tomato paste", "1 tablespoon harissa paste, plus more for serving", "3 tablespoons fresh lemon juice", "1 tablespoon finely grated lemon zest, for serving", "1/2 cup chopped flat-leaf parsley, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the crispy chickpeas: Transfer chickpeas to a rimmed baking sheet lined with a clean dish towel or paper towels. Cover with another towel (or paper towels) on top, rubbing gently to dry. Remove top towel and let air-dry for at least 30 minutes and preferably 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As chickpeas dry, start preparing the soup: In a Dutch oven or heavy stockpot, combine soaked chickpeas, 5 cups water, 1 tablespoon olive oil, bay leaves and 1/2 teaspoon salt over high heat. Bring to a boil for 2 to 3 minutes, then reduce heat to a simmer, cover and cook until chickpeas are tender, about 1 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. While chickpeas are cooking, cut bread into thick slices, then tear slices into bite-size pieces. Place bread in one layer on large rimmed baking sheet and toast until crisp and light brown, about 10 minutes. Let cool on pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the crunchy chickpeas: Raise oven temperature to 425 degrees. Remove the towels from baking sheet with the chickpeas, and toss the chickpeas with 2 teaspoons olive oil, 1/2 teaspoon salt and za’atar until well coated. Roast until golden and crispy, about 13 to 18 minutes, tossing halfway through. When chickpeas are still hot, sprinkle lightly more salt. Taste and add more salt or za’atar, or both, if you’d like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the chickpeas for the soup are tender, discard bay leaves. Using a slotted spoon, transfer 2 cups of chickpeas, 1/2 cup of chickpea cooking liquid and 1/4 cup olive oil to a blender or food processor, and purée until smooth. (Alternatively, you can use an immersion blender to blitz half the chickpeas into a rough purée. Add the olive oil before puréeing. The broth won’t be as silky as it would be puréed in a regular blender, but it will taste just as good.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over medium-high, heat the remaining 2 tablespoons oil until shimmering. Add the onion and cook, stirring occasionally, until softened, about 5 minutes. Add garlic and cook until golden, about 2 minutes. Add the remaining 1 teaspoon salt, 1 tablespoon cumin and tomato paste and cook, stirring, until fragrant, 1 minute. Add a splash of the chickpea cooking liquid to the pan, and bring to a simmer to deglaze, scraping up the browned bits on the bottom of the pan. Turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chickpea purée and onion mixture to soup, along with harissa and lemon juice, and stir well. Add a little water if soup seems too thick, and more salt, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide toasted bread pieces among soup bowls, then ladle in soup. Garnish with lemon zest, parsley, olive oil, more cumin and some of the crispy chickpeas — you’ll have leftovers. Serve hot, with more harissa on the side."}], "link": "https://cooking.nytimes.com/recipes/1020874-lablabi-tunisian-chickpea-soup"}