{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Curry Mussels and Roasted Sweet Potatoes", "description": "Moules-frites, a hearty bowl of mussels served with fries on the side, is very popular in Belgium and France. This version is seasoned with Thai spices and paired with sweet potatoes — not traditional at all, but totally satisfying. The recipe calls for commercially made red curry paste, which makes this dish quick to prepare. It shouldn't be hard to find at Asian grocers and online, but do try to obtain makrut lime leaves, which impart a lovely floral note.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/05/08/dining/03kitchrex/03kitchrex-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, seafood", "keywords": "coconut milk, mussels, sweet potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 66}, "recipeIngredient": ["6 medium sweet potatoes (about 3 pounds)", "3 tablespoons melted coconut oil or vegetable oil", "Salt and pepper", "1 teaspoon cumin seeds, toasted and ground", "1/2 teaspoon ground cayenne, or less to taste", "2 tablespoons vegetable oil", "1 medium red onion, diced", "4 bird’s-eye chiles, split to the stem, seeds left in", "6 garlic cloves, minced", "1 (2-inch) piece fresh ginger, finely chopped (3 tablespoons)", "2 tablespoons finely chopped lemongrass", "3 tablespoons Thai red curry paste", "1 tablespoon tomato paste", "1 teaspoon fish sauce", "3 or 4 makrut lime leaves", "3 cups thick coconut milk (about 1 1/2 cans, well shaken before opening)", "3 pounds mussels, cleaned", "1 cup roughly chopped cilantro leaves and tender stems, for garnish", "1 Fresno chile, sliced, for garnish", "1 cup Thai basil leaves, or another kind of basil, for garnish", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sweet potatoes: Heat oven to 450 degrees. Peel the sweet potatoes, and cut them lengthwise into slender wedges. Put them in a large bowl, and toss them with coconut oil to coat. Season generously with salt and pepper. Transfer to a rimmed baking sheet and spread out in a single layer. Bake, uncovered for 15 minutes, then reduce heat to 400 degrees. Bake for 30 to 40 minutes until tender with a crisp exterior. Before serving, sprinkle with cumin and cayenne."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While sweet potatoes are baking, make the curry: Put vegetable oil in a Dutch oven or heavy-bottomed pot with a lid over medium-high heat. Add onions and cook until lightly browned and softened, about 8 minutes, stirring frequently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chiles, garlic, ginger and lemongrass and let sizzle for about 1 minute. Then add red curry paste and tomato paste and fry with the onion mixture for 2 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add fish sauce, lime leaves and coconut milk. Bring mixture to a boil, then add mussels and stir to coat with sauce. Cover and cook mussels, stirring once or twice, until all the mussels have steamed open, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle mussels and lots of sauce into deep, wide bowls. Sprinkle with cilantro and Fresno chile slices and top with basil leaves. Serve with a platter of hot sweet potatoes and lime wedges."}]}