{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramel-Apple Dutch Baby", "description": "This recipe makes the perfect breakfast, brunch or sweet treat for a lazy weekend. Any 10-inch ovenproof pan or baking dish will work here, but for the puffiest and crispest pancake, use a cast-iron pan. Don’t skimp on the amount of butter you melt in the pan in the first step; it prevents the pancake from sticking, and helps brown and crisp the Dutch baby while it bakes. The easy, no-fail caramel sauce infuses the apples with brown sugar and vanilla, while also serving as a syrup to drizzle over each slice. For maximum ooh and aahs, spoon the apples, caramel and all, into the center of the Dutch baby and serve it in the skillet. To keep the pancake crisp longer, serve the apples and caramel separately and allow guests to top their own.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2019/10/01/dining/em-caramel-apple-dutch-baby/merlin_161624595_2c1cda7c-3d2b-4b96-8a10-a9d8f83ffff0-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings (One 10-inch pancake)", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, for two, lunch, weekday, pancakes, pastries", "keywords": "apple, butter, cinnamon, dark brown sugar, flour, dessert, main course, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 152}, "recipeIngredient": ["4 tablespoons/55 grams unsalted butter (1/2 stick)", "3 large eggs", "3/4 cup/95 grams all-purpose flour", "2/3 cup/160 milliliters whole milk", "3 tablespoons dark brown sugar", "1 teaspoon vanilla extract", "3/4 teaspoon ground cinnamon", "1/2 teaspoon fine sea salt", "1/4 teaspoon ground nutmeg", "2 tablespoons unsalted butter", "1/4 cup/60 milliliters heavy cream", "1/2 cup/110 grams dark brown sugar", "3 baking apples (about 1 pound), such as Honeycrisp, Jonagold, Gala, or Granny Smith, peeled, cored, and cut into 1-inch slices", "3/4 teaspoon vanilla extract", "Pinch of ground cinnamon", "Pinch of fine sea salt", "Whipped cream or vanilla ice cream, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the Dutch baby: Heat the oven to 425 degrees. Place the butter into a medium (10-inch) ovenproof skillet (preferably cast-iron) and transfer to the oven until melted, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk the eggs, flour, milk, brown sugar, vanilla, cinnamon, salt and nutmeg. Pour the batter into the hot skillet and transfer to the oven. Bake until the pancake puffs up around the edges and turns golden, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the Dutch baby cooks, prepare the topping: Melt the 2 tablespoons butter in a skillet over medium heat, then stir in the cream and brown sugar. Add the apples and cook, stirring frequently, until the caramel thickens and the apples are tender, 8 to 10 minutes. Stir in the vanilla, cinnamon and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, pile the apples on top of the warm Dutch baby, then slice and serve. Serve with whipped cream or ice cream, if desired."}], "link": "https://cooking.nytimes.com/recipes/1020513-caramel-apple-dutch-baby"}