{"@context": "http://schema.org", "@type": "Recipe", "name": "Linguine With Clam Sauce", "description": "Purists may object, but canned clams are a great weeknight pantry stalwart. When fresh ones are out of reach, or when you’ve decided you need a briny fix, the canned clam is reliable no matter the season. This recipe calls for dry vermouth, which adds a subtle herbaceous layer of flavor. (Vermouth has a long shelf life when stored properly, and it’s great to have on hand to make a last-minute pan sauce.) Canned clams are already salty, so be mindful of oversalting the pasta water or the sauce. The dish is finished with lemon zest for brightness and butter for silkiness. The best part? The whole thing can be on the table in the same amount of time it takes to boil water.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/09/25/dining/ch-pasta-with-clams/ch-pasta-with-clams-articleLarge-v2.jpg", "totalTime": "PT25M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, quick, weekday, pastas, seafood", "keywords": "butter, clams, garlic, olive oil, oregano, parsley, pasta, vermouth, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 607}, "recipeIngredient": ["Kosher salt", "1 pound linguine or other long pasta, such as linguine fini or spaghetti", "1/4 cup extra-virgin olive oil, plus more for serving (optional)", "5 garlic cloves, thinly sliced", "1/2 to 1 teaspoon red-pepper flakes", "1/2 teaspoon dried oregano", "1/2 cup dry vermouth or dry white wine", "2 (10-ounce) cans whole baby clams with their juices", "Black pepper", "2 tablespoons unsalted butter", "2 teaspoons lemon zest (from 1 to 2 lemons)", "1/2 cup chopped Italian parsley", "Lemon wedges, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Add the pasta and cook according to package instructions until 2 minutes short of al dente (it will finish cooking in the sauce). Reserve 1/2 cup pasta water, then drain pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta cooks, make your sauce: Heat the oil in a deep-sided 12-inch skillet over medium. Add the garlic, red-pepper flakes and oregano and cook until the garlic is pale golden, 1 to 2 minutes. Add the vermouth and simmer until reduced by half, 3 to 4 minutes. Stir in the clams with their juices and cook until just warmed through, 1 to 2 minutes more. Taste and season with salt and pepper as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cooked pasta directly to the skillet along with the butter and lemon zest and toss until the butter has melted and the pasta is glossy with sauce. If needed, add 1/4 cup reserved pasta water. Stir in half the parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve pasta topped with a drizzle of olive oil, if desired, and the remaining parsley. Serve lemon wedges alongside if you like."}], "link": "https://cooking.nytimes.com/recipes/1020498-linguine-with-clam-sauce"}