{"@context": "http://schema.org", "@type": "Recipe", "name": "Libyan Aharaimi (Fish in Tomato Sauce)", "description": "Traditionally this Libyan Jewish dish is made with tomato paste, water and fish steaks, and served on holidays like Rosh Hashana. This twist on the classic uses the last of the summer tomatoes, reducing their purée into a thick, concentrated gravy. A few added spices make for a tangy sauce in which to poach sea bass or other fish fillets. Be careful to cook the fish just until slightly firm and flaky to ensure it stays tender. Serve it as an appetizer, as Libyans do, or as a main course. A simple bulgur pilaf makes a nice accompaniment.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2019/09/18/dining/16Roshrex/merlin_160015893_b3822410-838a-4573-b62c-4848c684d5e8-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 main course servings or 8 appetizer servings", "recipeCuisine": "jewish", "recipeCategory": "dinner, seafood", "keywords": "appetizer, main course, bell pepper, fish fillets, lemon, sea bass, tomato, fall, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 98}, "recipeIngredient": ["2 large red bell peppers", "3 pounds fresh tomatoes", "1/4 cup extra-virgin olive oil", "1 medium yellow or white onion, diced", "6 to 7 garlic cloves, finely chopped", "1 tablespoon finely chopped small red chile, like cayenne, habanero or Scotch bonnet", "1 teaspoon ground cumin", "1 teaspoon ground caraway", "1/2 teaspoon ground cinnamon", "1 teaspoon sea salt, plus more to taste", "2 teaspoons granulated sugar (optional)", "2 pounds skinless sea bass, black cod, halibut or bonito fillets, cut into 8 portions", "1/4 cup chopped fresh cilantro", "1/4 cup chopped fresh parsley", "2 lemons, quartered", "Harissa paste, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. Roast the bell peppers on a foil-lined baking sheet, turning every 10 minutes or so, until tender and charred, 40 to 45 minutes. Transfer peppers to a paper bag, seal tightly and let steam, 5 minutes. Peel the bell peppers, then remove the stems and seeds. Slice lengthwise into 1/2-inch strips; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the bell peppers roast, blanch the tomatoes: Add enough water to come two-thirds up the side of a large, lidded Dutch oven or pot and bring to a boil. Score the bottom of each tomato lightly with an X. Once the water boils, cook the tomatoes until the skin splits, 1 to 2 minutes, working in batches if necessary. Remove with a slotted spoon and set aside until cool enough to handle. Using your fingers, peel the tomatoes, discarding the skin and stems. Purée the tomatoes in a food processor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse and dry the pot, then warm the oil over medium heat. Add the onion and cook, stirring occasionally, until golden, about 10 minutes. Add the garlic and chile and cook, stirring frequently, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the tomato purée into the pot, then add the cumin, caraway, cinnamon, salt and sugar, if using, and stir to combine. Simmer over medium-low, uncovered, stirring occasionally, until the sauce is reduced by half, about 30 minutes. Season to taste with salt. (Tomato sauce can be prepared one day in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slip the fish into the warm sauce in a single layer and simmer, covered, until the fish is just cooked and feels firm to the touch, 5 to 8 minutes. Remove the pot from heat and carefully spoon some of the sauce onto a serving platter. Using two spatulas, gently transfer each piece of fish to the platter; spoon sauce around the fillets or serve additional sauce on the side. Lay the sliced bell pepper over each piece of fish, then sprinkle with the cilantro and parsley and squeeze with 1 or 2 lemon wedges. Serve hot or at room temperature, with remaining lemon wedges and harissa, if using."}], "link": "https://cooking.nytimes.com/recipes/1020426-libyan-aharaimi-fish-in-tomato-sauce"}