{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Squash Caponata", "description": "Caponata, a sweet and sour vegetable dish of Sicilian origin, is usually made with eggplant, but this version is made with zucchini and yellow squash, and dotted with capers and olives. Served at room temperature, caponata often graces the antipasto table at restaurants, but it can also be a main course or a side dish. At home, it can top crostini, a perfect accompaniment to drinks. For a picnic, serve it with good canned tuna and hard-cooked eggs.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/07/10/dining/05kitchen1/merlin_156916911_d0903ffa-b8cc-47bb-b6ef-bd0270d2eac6-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "brunch, lunch, finger foods", "keywords": "appetizer, main course, capers, green olives, summer squash, zucchini, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 148}, "recipeIngredient": ["Extra-virgin olive oil", "1 1/2 pounds medium green zucchini, cut into 3/4-inch cubes", "Kosher salt and black pepper", "1 1/2 pounds yellow summer squash, cut into 3/4-inch cubes", "1 large onion, diced (about 1 1/2 cups)", "6 celery stalks, diced (about 1 cup)", "Pinch of red-pepper flakes", "1 tablespoon granulated sugar", "3 tablespoons red- or white-wine vinegar", "2 tablespoons medium capers, rinsed, soaked in cold water for 10 minutes and drained", "24 green olives, such as Castelvetrano or Cerignola, for garnish", "6 hard-boiled eggs (9-minute), for garnish", "Italian parsley leaves, for garnish", "Basil leaves, for garnish", "12 (1/2-inch) slices Italian or French bread, toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 1/2 inch olive oil into a large, wide skillet over medium-high heat. When oil is hot, add enough zucchini to cover bottom of pan. Season lightly with salt and pepper. Let zucchini sizzle and brown slightly. Cook, stirring, until softened, about 5 minutes. Remove to a large bowl with a slotted spoon. Continue cooking zucchini and summer squash in batches, adding oil to the pan as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, cook the onions over medium-high heat, stirring, until softened, 5 to 7 minutes. Add celery and cook for 2 to 3 minutes more. Season with salt and pepper and transfer onion mixture to bowl with zucchini."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the bowl, add red-pepper flakes, sugar, vinegar and capers. Toss gently together. Taste and adjust, making sure the seasoning is bright, with a balanced sweet-sour flavor. Leave for 10 to 15 minutes and taste again. (If time permits, let the flavors marry for an hour or more before serving. The caponata may be refrigerated for up to 2 days; bring to room temperature to serve.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer mixture to a large platter. Top with olives and hard-cooked eggs, halved or quartered. Garnish with parsley and basil leaves. Serve at room temperature with toasted bread for making crostini."}], "link": "https://cooking.nytimes.com/recipes/1020320-summer-squash-caponata"}