{"@context": "http://schema.org", "@type": "Recipe", "name": "Miso Chicken in Ginger, Leek and Scallion Broth", "description": "This chicken dish gets most of its flavor from miso, the traditional Japanese paste made from fermented soybeans or other grains, and relies on boneless, skinless thighs, which are nearly impossible to overcook. First simmered in water (or chicken broth for depth), the thighs are then slathered with a seasoned miso mixture and roasted until the miso forms a beautiful glaze. Use light miso (yellow or white) for a mild, nutty flavor, or dark miso (red or brown) for a deeper rustic quality. Both kinds keep up to a year in the refrigerator.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/01/03/dining/03tanisrex2-chicken/merlin_166404972_c5cb4ffd-42c2-4542-90eb-3dc321da4019-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "weekday, poultry", "keywords": "chicken, ginger, gochugaru, leeks, miso, rice wine vinegar, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 213}, "recipeIngredient": ["8 boneless, skinless chicken thighs (about 3 pounds)", "Salt and pepper", "2 large garlic cloves, smashed but not peeled, plus 1/2 teaspoon grated garlic", "1 (2-inch) piece ginger, peeled and thickly sliced, plus 1 teaspoon grated fresh ginger", "1 small onion, thinly sliced", "6 cups chicken broth (optional)", "1/4 cup mirin", "4 tablespoons yellow or red miso", "1/2 teaspoon gochugaru (Korean red-pepper flakes)", "2 tablespoons rice wine vinegar", "2 tablespoons granulated sugar", "2 cups leeks, white and tender green parts, chopped into 1/2-inch pieces", "1/2 cup thinly sliced scallions, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put chicken thighs in a large pot, seasoning well with salt and pepper on both sides. Add smashed garlic cloves, ginger slices, onion, 6 cups water (or chicken broth, if you prefer) and mirin, and bring to a boil. Reduce heat to a simmer and cook, covered, for 30 minutes, until tender. Remove chicken to a baking dish. Strain broth into a bowl. Place back into the pot, and keep warm. Heat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine miso, gochugaru, grated garlic, grated ginger, vinegar and sugar. Add a little hot broth to thin, then smear mixture over chicken and coat well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake chicken until browned and glazed, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While chicken is cooking, bring broth to a simmer, taste and adjust seasoning. Add leeks and cook until just done — soft, but still green, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, slice chicken into 1/4-inch pieces and divide among large soup bowls, then ladle broth on top. Spoon any remaining miso mixture from pan over chicken. Garnish with scallions."}], "link": "https://cooking.nytimes.com/recipes/1020752-miso-chicken-in-ginger-leek-and-scallion-broth"}