{"@context": "http://schema.org", "@type": "Recipe", "name": "Ember-Roasted Slaw With Mint", "description": "Inspired by what is undoubtedly the world’s most ancient method of cooking, ember-roasted cabbage is turning up everywhere, from the charred cabbage with muhammara and hazelnuts at the new Safta restaurant in Denver to the cabbage roasted in the embers and served with yogurt, sumac and lemon zest at Charcoal Venice in Los Angeles. This one features a sweet-sour dressing of sugar, vinegar and caraway seeds, with mint leaves stirred in at the end for freshness. Savoy cabbage is an excellent cabbage for grilling: The smoke circulates freely through its crinkled leaves.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2019/08/07/dining/02Slawrex1/02Slawrex1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "salads and dressings, slaws, vegetables", "keywords": "cabbage, caraway seeds, cider vinegar, mint, mustard, dairy-free, nut-free, vegan, vegetarian, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 32}, "recipeIngredient": ["3 tablespoons cider vinegar, plus more to taste", "3 tablespoons granulated sugar, plus more to taste", "3 tablespoons vegetable oil", "1 tablespoon Düsseldorf or Dijon-style mustard", "1/2 to 1 teaspoon caraway seeds", "Sea salt and freshly ground black pepper", "1 head savoy cabbage (about 2 pounds), quartered lengthwise through core", "1/4 cup thinly sliced fresh mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Light a charcoal or wood-burning grill and let the coals burn down to glowing embers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the dressing: In a large bowl, whisk the vinegar and sugar until sugar dissolves. Whisk in the oil, followed by the mustard and caraway seeds. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the cabbage quarters directly on the coals and roast until all sides are charred, turning with tongs, about 2 minutes per side. Transfer to a sheet pan and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard the tough core of the cabbage then thinly slice the cabbage crosswise. Add the sliced cabbage to the dressing and toss to coat. Season with salt, sugar and vinegar to taste. Refrigerate until serving and serve within a couple hours of mixing. Just before serving, stir in the mint."}], "link": "https://cooking.nytimes.com/recipes/1020310-ember-roasted-slaw-with-mint"}