{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Butternut Squash Bread Salad", "description": "This sheet-pan recipe is an easy way to get a hearty vegetarian meal on the table in under an hour. Inspired by panzanella, which traditionally provides new life for stale bread by tossing it with juicy tomatoes, this bread salad instead gets its moisture from an earthy tahini dressing. The creamy tahini is lightly sweetened with honey, which plays well with the buttery squash, while a flourish of fresh herbs adds a light, springy finish. This makes for a nice supper on its own, but it would also work well as a side to roasted chicken or fish.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/03/05/dining/ch-roasted-squash-panzanella/merlin_151400877_fc916069-a429-4dd6-9819-f30d421a54a8-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings, vegetables", "keywords": "bread, butternut squash, tahini, fall, spring, winter, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 214}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 317, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "6 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "651 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 butternut squash (about 2 pounds), peeled, seeded and cut into 1/2- to 1-inch wedges", "4 tablespoons olive oil", "Kosher salt and black pepper", "1/2 teaspoon red-pepper flakes (optional)", "3 (1-inch thick) slices country bread or round peasant loaf, torn into 1- to 1 1/2-inch pieces", "2 tablespoons tahini", "2 tablespoons lime juice", "1 teaspoon honey", "1/4 cup roughly chopped cilantro, parsley or dill, or a combination of all three (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Line a large sheet pan with parchment paper or foil. In a large bowl, toss the squash with 2 tablespoons olive oil. Season well with salt, black pepper and red-pepper flakes (if using) and toss again. Spread the squash in an even layer on the sheet pan and roast until it begins to brown in spots, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the squash roasts, in the same bowl (no need to wipe it out), toss the bread with the remaining olive oil and season with salt and pepper. After the squash has roasted for 10 to 15 minutes, remove from the oven and turn the squash pieces over. Add the bread to the sheet pan. Roast 10 to 15 minutes more, turning the bread halfway through, until the croutons are golden and crisp and the squash is tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the squash and croutons roast, whisk together the tahini, lime juice, honey and 2 tablespoons water. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the squash and croutons on a platter or in a bowl and drizzle with the dressing. Scatter with the herbs, if using."}], "link": "https://cooking.nytimes.com/recipes/1020077-roasted-butternut-squash-bread-salad"}