{"@context": "http://schema.org", "@type": "Recipe", "name": "Rhubarb Macaroon Tart", "description": "Rhubarb makes any dessert a showstopper, but this tart has more than meets the eye. Under the fruit is a luscious vanilla custard nestled in a chewy macaroon shell. When shopping, look for rhubarb that is about 1/2- to 3/4-inch wide; any bigger and the stalks might start to fall apart in the poaching liquid before the center becomes tender, and any smaller and you’ll need to keep a close eye, since they’ll cook quickly. While the rhubarb topping is a show-stopper, freshly sliced fruit makes a great understudy if you can’t find robust pink stalks.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2020/04/02/dining/ss-rhubarb-macaroon-tart/merlin_171207468_6ed01d71-265c-45ea-863f-900653819f12-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "dessert, heavy cream, rhubarb, shredded coconut, vanilla", "aggregateRating": null, "recipeIngredient": ["1 (14-ounce/400 gram) bag sweetened, shredded coconut (about 5 cups)", "Butter, for greasing", "4 large egg whites", "1/4 cup/50 grams granulated sugar", "1/2 teaspoon kosher salt", "1 3/4 cups/420 milliliters whole milk", "1/4 cup/60 milliliters heavy cream", "4 large egg yolks", "1/2 cup/100 grams granulated sugar", "2 tablespoons cornstarch", "2 tablespoons unsalted butter", "1/2 vanilla bean, split and scraped (or 1/2 teaspoon vanilla extract)", "1/2 teaspoon rose water (optional)", "2 cups/400 grams granulated sugar", "1/2 vanilla bean, split and scraped (or 1/2 teaspoon vanilla extract)", "1 3/4 pounds/800 grams medium rhubarb stalks, cut into 4-inch batons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the crust: Heat the oven to 350 degrees. Spread the coconut in an even layer on a large rimmed baking sheet and toast until deep golden brown, 20 to 25 minutes, tossing occasionally and keeping a close eye in the last 5 minutes to avoid burning. Let cool completely. Using butter, grease an 8 1/2-by-12-inch fluted rectangle or a 10-inch fluted round pan with a removable bottom. Line the bottom with parchment and grease the parchment with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the coconut, egg whites, sugar and salt; press into the prepared tart pan. Bake on a rimmed baking sheet until set, 25 to 30 minutes. Transfer the baking sheet to a wire rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the custard: Set a fine-mesh sieve over a medium bowl. In a separate medium bowl or a large glass measuring cup, whisk together milk, cream and egg yolks. Add sugar and cornstarch to a medium saucepan; gradually whisk in milk mixture until smooth. Add the 2 tablespoons butter and vanilla bean and seeds and cook mixture over medium heat, whisking constantly, until it has thickened and just come up to a low boil, 6 to 7 minutes. Continue to cook, stirring constantly, for another minute. Pour custard through sieve, using a spatula to scrape it through and discarding any solids. Stir rose water into custard, if using, then pour mixture into prepared crust. Let cool slightly, then cover with plastic wrap pressed against the surface of the custard and chill until firm, at least 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the rhubarb: In a medium pot, combine sugar, 2 cups water and the vanilla bean and seeds, and bring to a boil. Simmer until the sugar dissolves, about 2 minutes. Stir in rhubarb and simmer for 1 minute. Remove the rhubarb from the syrup and transfer to a plate to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently remove the rhubarb from the cooled pot, letting the syrup drip back into the pot. Top the chilled tart with the rhubarb in a decorative pattern. Lift the tart out of the rim to serve."}]}