{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Pie Crust", "description": "Shortening replaces butter in this vegan version of traditional pie dough. Because shortening has a higher melting temperature than butter, you can prepare the dough without any sticky disasters. It also bakes into a beautifully tender and not-at-all-soggy crust. When shopping for a shortening, look for one made with coconut oil, palm oil or a combination of the two.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2019/11/05/dining/ejm-vegan-pie-crust/ejm-vegan-pie-crust-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "One (9-inch) pie crust", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "dairy-free, vegan, vegetarian, dessert, flour, sea salt, shortening", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 28}, "recipeIngredient": ["1 1/4 cups/160 grams all-purpose flour", "1/4 teaspoon fine sea salt", "1/2 cup/115 grams shortening, roughly cut into 1/2-inch cubes, chilled (see Tip 1)", "3 to 4 tablespoons ice water, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the flour and salt to combine. Add the cold, cubed shortening and toss with your hands to evenly coat each piece in flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a pastry cutter or your hands to cut the butter into the flour until the pieces are the size of peas. If the shortening feels sticky at any point, refrigerate for 10 minutes before proceeding (see Tip 2)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a well in the center of the flour mixture. Add 2 tablespoons ice water and gently toss with the flour to combine. (Gentle tossing encourages moisture incorporation without allowing for too much gluten formation.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue to add ice water 1 to 2 tablespoons at a time until the dough begins to come together. Once it comes together, fold it over itself a few times to make sure it’s fully combined. The dough should hold together without noticeable cracks (a sign of underhydration), but it should not be wet or tacky to the touch (a sign of overhydration)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form the dough into a disk about 1-inch thick. Wrap tightly in plastic wrap and refrigerate for at least 1 hour before using, and up to 2 days. (It can also be frozen for up to 3 months, then thawed overnight in the refrigerator before using.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to roll out the dough, lightly flour the dough, and roll it out between two sheets of parchment paper to your desired size. (The crumbly shortening has a tendency to stick to a counter or work surface and parchment helps.) Continue to flour the dough as needed while you work. To do this, peel the top parchment back, sprinkle the surface of the dough with flour, then place the parchment back down. Holding the two pieces of parchment together, flip dough so that the side that was the bottom is now on top. Peel back this piece of parchment, and flour the surface of the dough as needed. Replace the parchment and continue to roll."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the prepared pie dough to a pie plate, trim away excess dough, and crimp as desired. The pie is now ready to be par-baked, blind-baked or filled and baked as directed."}]}