{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Garlicky Anchovies and Broccoli Rabe", "description": "Anchovies star in this robust, wintery pasta dish, lending a savory backbone to a pan full of wilted broccoli rabe and fresh tomatoes. Although the anchovies and garlic are sautéed in olive oil, butter is added at the end, giving the sauce some richness and body, and mellowing the bitterness of the broccoli rabe. Note that while the ricotta adds creaminess to the pasta, it is strictly optional. Leave it out for a leaner dish with a more concentrated flavor.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/02/05/dining/31apperex/merlin_167663655_5e396047-c383-4b1e-b794-90ff595b7717-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, pastas", "keywords": "anchovy, broccoli rabe, parsley, pasta, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 257}, "recipeIngredient": ["Kosher salt", "12 ounces short pasta, such as shells, wagon wheels or rigatoni", "2 packed cups parsley, leaves and tender stems", "10 anchovy fillets, preferably packed in olive oil (one 2-ounce tin)", "1 small bunch scallions, white and green parts, chopped", "2 tablespoons capers, drained (optional)", "3 tablespoons extra-virgin olive oil, plus more for drizzling", "4 garlic cloves, finely grated or minced to a paste", "1 (1-pound) bunch broccoli rabe, trimmed and chopped into 1-inch pieces", "1/2 cup chopped fresh tomato (plum, cherry or grape work well)", "2 tablespoons unsalted butter, cut into pieces", "3/4 teaspoon grated lemon zest", "Pinch of red-pepper flakes", "Freshly ground black pepper", "Ricotta, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of heavily salted water to a boil. Cook pasta according to package instructions until 1 minute shy of al dente. Use a coffee cup or measuring cup to save some pasta water, then drain pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta cooks, coarsely chop the parsley, 6 anchovy fillets, scallions, capers (if using) and a pinch of salt. You can chop it all together on a cutting board, or pulse everything briefly together in the food processor; just make sure to keep it coarse."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large skillet over medium. Add oil, remaining 4 anchovies and half the garlic, and let cook, stirring, until anchovies start to dissolve, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in broccoli rabe, tomato, about two-thirds of the parsley mixture and a pinch of salt to the pan. Sauté until the rabe is tender, 5 to 8 minutes, adding splashes of pasta water as the pan dries out. Taste and season with more salt if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pasta to pan along with butter, lemon zest, remaining garlic and red-pepper flakes. Toss until the butter melts and the pasta is combined with the vegetables, adding more pasta water if the mixture seems dry. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide pasta among bowls and sprinkle with remaining parsley mixture. Drizzle with olive oil, and serve with ricotta, if you like."}], "link": "https://cooking.nytimes.com/recipes/1020842-pasta-with-garlicky-anchovies-and-broccoli-rabe"}