{"@context": "http://schema.org", "@type": "Recipe", "name": "Meatless Meatballs in Marinara Sauce", "description": "These “meatballs” use plant-based ground meat, and a combination of onions, garlic and tamari give them a satisfying chew and robust flavor. Because there’s no egg for binding, these are slightly more delicate than other meatballs, so use a light touch when shaping them, and make sure the mixture is very cold. Serve them on their own, covered in marinara sauce, or stuff them into hero rolls for sandwiches. They are also excellent over spaghetti.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/01/01/dining/31lessmeat6/merlin_166142619_44b12c3c-050e-4f97-a129-c86ab8704402-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "weekday, meatballs", "keywords": "main course, marinara sauce, panko, plant-based meat, tamari, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 281}, "recipeIngredient": ["1/2 cup panko bread crumbs", "1/4 cup minced onion", "1/4 cup chopped parsley leaves and tender stems", "3 garlic cloves, grated or minced", "1 tablespoon tamari or soy sauce", "1 1/2 teaspoons kosher salt", "1/2 teaspoon freshly ground black pepper", "1/2 teaspoon dried oregano", "Pinch of red-pepper flakes (optional)", "1 1/2 pounds plant-based vegan ground beef (such as Beyond Meat)", "Extra-virgin olive oil, for drizzling", "3 cups marinara sauce, <a href=\"https://cooking.nytimes.com/recipes/1017173-simple-tomato-sauce\">homemade</a> or store-bought", "Parmesan (optional, or use vegetarian Parmesan if you prefer), for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine bread crumbs, onion, parsley, garlic, tamari, salt, pepper, oregano and red-pepper flakes, if using, and mix well. Add plant-based beef, and blend with your hands until well mixed. Cover mixture and chill for at least an hour or up to 24 hours. (It’s easiest to form the meatballs when the mixture is very cold.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler. Form 28 meatballs, each about 1 1/4 inches in diameter. Transfer meatballs to one or two rimmed baking sheets, and drizzle with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil meatballs until golden and firm, 7 to 10 minutes. Meanwhile, heat marinara sauce in a pot. Serve meatballs with sauce on top, showered with cheese if you like and drizzled with a little more olive oil."}], "link": "https://cooking.nytimes.com/recipes/1020740-meatless-meatballs-in-marinara-sauce"}