{"@context": "http://schema.org", "@type": "Recipe", "name": "Made-in-the-Pan Chocolate Cake", "description": "This surprisingly tender vegan chocolate cake is made entirely in an 8-by-8-inch baking pan: Just toss in the ingredients, stir until you don’t see any flour streaks, then bake. For flourish, add a small handful of chocolate chips before baking or sprinkle the finished cake with a little confectioners’ sugar. Adapted from Mollie Katzen’s “Honest Pretzels: And 64 Other Amazing Recipes for Kids Who Love to Cook,” this recipe was developed for kids, but adults love it, too. It’s an ideal snacking cake, or you could gussy it up with a simple <a href=\"https://cooking.nytimes.com/recipes/1016615-chocolate-ganache\">ganache</a> frosting.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2020/03/18/dining/20KIDs-chocolate-cake/merlin_151400670_a2887ddc-71e8-458b-bfd8-7241a69149db-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "9 to 12 servings", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars", "keywords": "chocolate chips, unsweetened cocoa, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1109}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 174, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "92 milligrams", "sugarContent": "17 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 cups/160 grams all-purpose flour", "1 cup/200 grams granulated sugar", "1/3 cup/30 grams unsweetened cocoa powder", "3/4 teaspoon baking soda", "1/2 teaspoon kosher salt", "1/3 cup/80 milliliters canola oil", "1 teaspoon vanilla extract", "1 teaspoon apple cider vinegar or white vinegar", "2 tablespoons semisweet or vegan chocolate chips (optional)", "Confectioners’ sugar, for dusting on top (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Add the flour, sugar, cocoa powder, baking soda and salt to an 8-by-8-inch square glass or metal baking dish. Whisk the mixture together until uniform in color. Use your fingers to break apart any lumps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 cup water along with the oil, vanilla extract and vinegar. Stir slowly with a fork or a whisk in small circles to blend. Mash, scrape and stir with a fork and spoon until the mixture becomes a smooth and uniform batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the sides of the baking dish with a rubber spatula and spread the batter in an even layer. Sprinkle with chocolate chips, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a damp paper towel to wipe the edges of the baking dish clean. Carefully transfer the dish to the oven and bake until a toothpick inserted into the center of the batter comes out mostly clean, 28 to 33 minutes. (Instead of looking like you dipped the toothpick in chocolate frosting, it should look like it has some chocolate cake crumbs clinging to it.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven, let cool, then cut the cake into squares. If you’re feeling fancy, this tastes good (and looks pretty) with some confectioners’ sugar dusted on top."}]}