{"@context": "http://schema.org", "@type": "Recipe", "name": "Berry Blitz Torte", "description": "Blitz means “lightning” in German, referring to the lightning-quick way this old-fashioned cake comes together, at least compared with the more ornately frosted tortes popular a century ago. Buttery, nutmeg-scented batter is swirled with meringue and sprinkled with pecans before baking. The meringue, which browns on top but stays soft inside, takes the place of icing while the nuts add flavor and crunch. A whipped cream and berry filling makes the whole thing incredibly soft and rich. You can bake the cake layers up to 12 hours ahead, but it’s best to fill them with cream and berries within 3 hours of serving so they don’t get soggy. This recipe is adapted from my friend’s mother, Patricia O’Neal, who got it from her mother, Genevieve Lehmont.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/07/03/dining/28apperex/28apperex-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "dessert, egg whites, heavy cream, pecan, raspberries, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 254}, "recipeIngredient": ["1/2 cup/115 grams unsalted butter (1 stick), softened, plus more for greasing the pans", "1/2 cup plus 2 tablespoons/80 grams cake flour, plus more for dusting the pans", "1 teaspoon baking powder", "1/4 teaspoon fine sea salt", "1/2 cup/100 grams granulated sugar", "4 egg yolks, at room temperature", "1/4 cup/60 milliliters whole milk", "1 teaspoon vanilla extract", "1/4 teaspoon freshly grated nutmeg", "4 egg whites, at room temperature", "1/4 teaspoon cream of tartar", "Pinch of fine sea salt", "6 tablespoons/75 grams granulated sugar", "1 cup/120 grams chopped pecans", "1 1/2 cups/360 milliliters heavy cream", "1 to 3 tablespoons confectioners’ sugar, to taste", "1 1/2 teaspoons vanilla extract", "2 pints/490 grams fresh raspberries or other berries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Grease two round 8-inch cake pans and line the bottoms with parchment paper. Grease the paper, then lightly flour the pans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small mixing bowl, whisk together cake flour, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer fitted with the paddle attachment or electric beaters, beat 1/2 cup softened butter and sugar until fluffy and creamy, 2 to 3 minutes. Add egg yolks one at a time, beating, until well combined. Add half the cake flour mixture, then half the milk to the butter mixture, beating until smooth. Repeat with remaining flour mixture and milk, then beat in vanilla and nutmeg. Scrape batter evenly into prepared pans and smooth the tops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make meringue topping, whip egg whites with cream of tartar and salt in an electric mixer until cloudlike and very foamy. Continue whipping while adding sugar 1 tablespoon at a time. Whip until meringue is smooth and glossy, and stiff peaks form."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover cake batter with meringue, dividing it evenly between pans. Swirl the tops, and sprinkle with pecans. Bake until meringue is golden brown and a toothpick inserted in the center all the way down to the cake emerges clean, about 25 minutes. Remove from oven and transfer pan to a wire rack. Cool for 30 minutes; turn cake out of pan and place on rack right-side up. Let cakes cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, whip the cream with as much of the sugar as you like, and vanilla. Place one cake layer on a serving plate with the meringue side down. Spoon whipped cream on top, then cover with berries. Place second cake layer on top of whipped cream with meringue side up. Serve cake as soon as possible after filling, preferably within 3 hours, and use a serrated knife to cut."}], "link": "https://cooking.nytimes.com/recipes/1020319-berry-blitz-torte"}