{"@context": "http://schema.org", "@type": "Recipe", "name": "Vanilla Marshmallows", "description": "Homemade marshmallows should have their own dreamy name, something that makes it clear that they’re different from the supermarket stuff. When you make this recipe by Christine Moore of Little Flower Candy Co., you get puffs that are soft, tender, languidly stretchy and delicately sweet, and a lesson in the transformative power of heat and air. To make these, you beat together roiling-hot sugar syrup and gelatin, and watch as the mixture goes from murky to opaque, from beige to white, from thin to billowing. For this magic to happen, it takes almost 15 minutes, plus a very large bowl and a sturdy mixer. (I use a 5-quart stand mixer.) You need no special skills, just patience — you have to wait a few hours for the whipped mixture to dry — but you’ll be rewarded with singular sweets good for toasting, s’mores, snacking and wrapping up as gifts.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2020/02/09/magazine/09mag-eat-02/09mag-eat-02-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "48 marshmallows", "recipeCuisine": "", "recipeCategory": "snack, candies", "keywords": "corn syrup, gelatin, vanilla bean, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 248}, "recipeIngredient": ["1 1/2 cups/360 milliliters cold water", "6 (1/4-ounce) packets unflavored powdered gelatin (about 1/4 cup/40 grams total)", "2 1/2 cups/500 grams granulated sugar", "1 cup/240 milliliters light corn syrup", "2 teaspoons pure vanilla extract", "1/2 vanilla bean, split lengthwise and scraped (or 1 more teaspoon vanilla extract)", "Nonstick cooking spray", "1/2 cup/65 grams cornstarch", "1/2 cup/60 grams confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 3/4 cup/180 milliliters cold water into the bowl of a stand mixer. Sprinkle the gelatin on top, and set aside until the gelatin has absorbed the liquid and expanded, 5 to 8 minutes, stirring after 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add the granulated sugar, corn syrup and the remaining 3/4 cup/180 milliliters water to a medium saucepan; bring to a boil over medium-high heat. Clip a candy thermometer to the pan or have an instant-read thermometer at hand. Boil until the syrup reaches 240 degrees, 5 to 6 minutes, then remove the pan from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fit the mixer with the whisk attachment, turn to low and slowly add the syrup, pouring it down the sides of the bowl. Add the extract and the vanilla-bean seeds (or extra extract). When the syrup is fully incorporated, gradually increase the mixer speed to high, and whip until the mixture is thick and cooled to room temperature, about 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the marshmallow mixture is whipping, coat a 9-by-13-inch baking pan with nonstick spray. Combine the cornstarch and confectioners’ sugar in a medium bowl, then generously dust the inside of the pan with some of the cornstarch mixture. (It’s important that the bottom of the pan be very well covered.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coat a plastic bowl scraper and your hand with nonstick spray. Scrape the marshmallow mixture into the pan. Use the flat side of the scraper to get the mixture into the corners of the pan and to even out the surface. Sift some of the cornstarch mixture over the top. Cover the pan with plastic wrap, and let rest for at least 4 hours before cutting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the marshmallows: Dust a chef’s knife with some of the cornstarch mixture; dust a piece of parchment paper, too. Run the knife around the edges of the pan to loosen the marshmallow mixture, then turn it out onto the parchment. Cut the slab into 1 1/2-inch squares. Dust all sides of the marshmallows with the cornstarch mixture by dropping a few marshmallows at a time into the bowl, tossing them around and then tossing each one from hand to hand to shake off the excess. Store in an airtight container for up to 2 weeks."}]}