{"@context": "http://schema.org", "@type": "Recipe", "name": "Egg Curry", "description": "Food has always been politicized in India, a person’s diet often revealing the specifics of her cultural identity. And under the government of Prime Minister Narendra Modi, and the surge of pro-vegetarian Hindu nationalism, even the simple practice of serving eggs at school lunch has become fraught. But eggs have long been an important source of nutrition across the country, and form the base of many classic regional dishes. In Andhra Pradesh, this spicy, tomato-rich egg curry would have firmer, more crumbly yolks (boiled for about 11 or 12 minutes), but I like to cook them a little softer (8 minutes, max).", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2020/03/04/dining/tr-egg-curry/merlin_169211805_227972c0-43d1-4f25-9643-9568331d8adb-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "indian", "recipeCategory": "soups and stews, vegetables", "keywords": "coriander, egg, garam masala, ginger, onion, tomato, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 165}, "recipeIngredient": ["1/4 cup neutral oil, such as grapeseed or canola", "2 medium yellow onions, chopped", "6 garlic cloves, finely chopped", "1 (2-inch) piece fresh ginger, peeled and finely chopped (about 2 tablespoons)", "2 small cinnamon sticks", "6 green cardamom pods", "1 teaspoon ground coriander", "1/2 teaspoon ground turmeric", "1/2 teaspoon whole black peppercorns", "6 Roma tomatoes, finely chopped", "1 teaspoon kosher salt", "1/2 teaspoon garam masala", "6 to 8 hard-boiled eggs, peeled", "Handful of small, tender fresh cilantro stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, heavy skillet, heat the oil over medium. Add the onions and cook, stirring occasionally, until evenly caramelized and light brown, 25 to 30 minutes. Stir in the garlic and ginger, and fry, stirring occasionally, another 4 minutes. Add the cinnamon and cardamom. When the spices start to toast, after about 2 minutes, stir in the coriander, turmeric and peppercorns."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes, salt and 1 cup water. Cook, stirring occasionally, until the mixture thickens and the fat rises to the top, about 15 minutes. Stir in the garam masala and lower the heat. If the sauce isn’t runny, stir in 1/2 cup water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add all but 2 of the eggs and stir gently. Halve the remaining eggs lengthwise and arrange on top, yolk-side up. Heat until the eggs are warmed through, then top with cilantro."}]}