{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Steel-Cut Oats With Nut Butter", "description": "For a simple, filling breakfast, baked steel-cut oatmeal, enriched with almond butter and cinnamon, is a go-to recipe. This version is particularly adaptable: Use peanut butter or almond butter, steel-cut or cracked oats, or any number of warming spices that might be in your cupboard. Then, garnish as you wish.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/03/25/dining/23pantryrex4/merlin_170847771_93a2aabd-5f0a-47ca-b242-4b16269318b2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, grains and rice", "keywords": "almond butter, oats, peanut butter, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 263}, "recipeIngredient": ["1/4 cup peanut butter or almond butter", "1 cup steel-cut or cracked oats", "Pinch of salt", "Cinnamon, nutmeg or cardamom, for sprinkling (optional)", "Sliced bananas, raisins or dried fruit, chopped apple, maple syrup, honey, brown sugar or heavy cream, for garnishing (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and bring a kettle of water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium shallow casserole or baking dish, combine 3 cups boiling water and the nut butter and stir until smooth-ish. (Don’t worry about a few lumps.) Stir in oats. Season the mix with a big pinch of salt, and some cinnamon or nutmeg if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover with foil and bake for 1 hour, stirring halfway through. Taste and if the oats aren’t cooked enough, let it bake for 5 to 10 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish with whatever you like, and serve."}]}