{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Chickpea Salad With Tahini and Pita Chips", "description": "This main-course salad has all the fresh flavors of a great falafel sandwich — tahini, mint, paprika, cucumber, cumin, garlic — plus the crunch of pita and the satisfying heft of chickpeas. The vegetarian cookbook writer Hetty McKinnon created this recipe, and the amount of olive oil she calls for might seem excessive. Don’t hold back: After cooking the chickpeas, the oil becomes part of the garlicky, paprika-warmed dressing for the finished dish. You could make her recipe even easier by using salad greens instead of cooked greens as the base.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2019/05/01/dining/30faqrex1/merlin_153889782_0ac0b415-2667-4236-bb80-3d3b141e43f2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 main-course servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, lunch, weeknight, salads and dressings, vegetables", "keywords": "chickpea, greens, mint leaves, pita, tahini, dairy-free, healthy, high fiber, low cholesterol, vegan, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 487}, "recipeIngredient": ["2 (15-ounce) cans chickpeas, well drained, or 4 cups cooked chickpeas", "3/4 to 1 cup extra-virgin olive oil", "2 garlic cloves, minced", "2 teaspoons ground cumin, or 1 teaspoon each ground cumin and ground coriander", "1 teaspoon sweet paprika", "Salt and pepper", "1/3 cup tahini", "Freshly squeezed juice of 1 lemon, plus more to taste", "1 garlic clove, minced", "Warm water, as needed", "Olive oil, for cooking", "About 10 ounces kale, chard or spinach, well washed and thick stems removed", "3 cups store-bought or homemade pita chips (see Tip)", "Handful of roughly chopped flat-leaf parsley", "Handful of roughly chopped mint", "1 large or 2 small cucumbers, peeled and thinly sliced", "Lemon, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chickpeas: Heat oven to 425 degrees. Pour the chickpeas into a small baking dish, about 6 inches by 8 inches. The chickpeas should be crowded together in a thick layer, not spread out. Pour in olive oil just until chickpeas are covered. (This will look like a lot, but don’t worry: It forms part of the dressing.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic, cumin, paprika, and 2 big pinches each of salt and pepper. Stir gently to combine. Bake until oil is bubbling around the chickpeas and they are turning reddish-brown, 35 to 40 minutes. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make tahini sauce: Pour tahini into a bowl and whisk in lemon juice and garlic. The tahini will thicken and clump. Slowly whisk in warm water, 1 tablespoon at a time, until sauce becomes smooth, creamy and pourable. Taste and season with salt, pepper and more lemon juice, if desired. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the greens: Place a large frying pan over medium heat and drizzle lightly with olive oil. When hot, add the greens in batches, along with a big pinch of salt. Stir until wilted and tender and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, in a large bowl, gently mix chickpeas and their cooking oil with the cooked greens, half the pita chips, and the chopped herbs. Mound chickpea mixture in 4 shallow bowls. Divide cucumber slices around chickpeas. Drizzle thickly with half the tahini sauce and scatter remaining pita chips on top. Place a lemon wedge on the side and serve, passing extra tahini sauce at the table."}], "link": "https://cooking.nytimes.com/recipes/1020187-spiced-chickpea-salad-with-tahini-and-pita-chips"}