{"@context": "http://schema.org", "@type": "Recipe", "name": "Peanut Butter-Miso Cookies", "description": "These cookies were the result of a happy accident. (The best things always are, aren’t they?) When the peanut butter ran out, similarly creamy white miso stepped in. The other ingredients were tweaked to offset the miso’s savory character, and what came out of the oven was salty and sweet, crunchy and chewy. A brief stint in the fridge helps mellow the miso’s bracing brackishness, and a roll in Demerara sugar adds a subtle crunch that pairs well with the tender cookie.", "author": {"@type": "Person", "name": "Krysten Chambrot"}, "image": "https://static01.nyt.com/images/2019/10/16/dining/kc-miso-peanut-butter-cookies/merlin_162369633_695e5669-961b-4a3d-97b3-a3086043edd3-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 18 cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "demerara sugar, miso, peanut butter, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1082}, "recipeIngredient": ["1 3/4 cups/225 grams all-purpose flour", "3/4 teaspoon baking soda", "1/2 teaspoon baking powder", "1/2 cup/115 grams unsalted butter (1 stick), at room temperature", "1 cup/220 grams light brown sugar", "1/2 cup/100 grams granulated sugar", "1/3 cup/80 milliliters white miso paste", "1/4 cup/60 milliliters chunky peanut butter", "1 large egg", "1 1/2 teaspoons vanilla extract", "1/2 cup/105 grams Demerara sugar, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine flour, baking soda and baking powder, and whisk until incorporated. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the paddle attachment, mix butter, light brown sugar and granulated sugar at medium speed until light and fluffy, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add miso and peanut butter to the mixing bowl, and continue to mix at medium speed, about 1 minute. Scrape down sides of the bowl to make sure all of the ingredients are evenly incorporated, and mix a bit more if needed. Add egg and vanilla extract, and mix until just combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/3 of the flour mixture to the mixing bowl, and mix on low speed until flour mixture is incorporated. Repeat with remaining flour mixture in two batches until all of it is incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1/2 cup Demerara sugar into a small bowl. Working with one piece at a time, scoop out about 2 heaping tablespoons of dough (about 50 grams per cookie), and roll each portion between your hands until it is nice and round. (If the dough is too soft to roll, you can pop the mixing bowl in the refrigerator for 5 to 10 minutes to firm the dough up slightly.) Drop the piece of dough into the bowl of Demerara sugar and turn to coat. Transfer each ball to a parchment-lined baking sheet, arranging them about 3 inches apart. Repeat with all of the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate for 2 hours and up to overnight. (Even 15 minutes of refrigerator time will help the dough firm up, and the flavors meld. The longer the dough is refrigerated, the more mellow the flavors will be.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, heat oven to 350 degrees. Bake cookies for about 15 minutes, until crisp at the edges and slightly puffed in the middle. They should still be a bit underdone in the center. Pull out the baking sheet and hit it against a counter. Place back into the oven to finish for about 3 to 4 minutes. When cookies are firm at the edges and slightly puffed in the center, pull them out and again hit the baking sheet against the counter. The cookies should appear flat and crinkly at the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the cookies cool on a baking sheet for a few minutes, then transfer to a cooling rack. Store fully cooled cookies in an airtight container; they should retain their chewy texture for a few days."}], "link": "https://cooking.nytimes.com/recipes/1020538-peanut-butter-miso-cookies"}