{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Turkey With Berry-Mint Sauce and Black Walnuts", "description": "The flavor of heritage turkey breeds is richer and more pronounced than that of commercial turkeys sold at supermarkets nationwide. Put plainly, heritage breeds taste more like turkey. Heritage birds are raised outside, pecking at a varied diet. They tend to have meatier thighs and smaller breasts, and a higher ratio of dark meat to white meat. The Onondaga tribe, among others from the Northeastern United States, would have been able to serve them with forest berries, perking up the rich, dark meat with color and flavor. Sparked with mint, this berry sauce is bright and fruity, with just enough acid to complement the richness of the turkey.", "author": {"@type": "Person", "name": "Sean Sherman"}, "image": "https://static01.nyt.com/images/2019/11/06/dining/04NativeAmericanrex3/04NativeAmericanrex3-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry, roasts", "keywords": "black walnuts, cranberry, leek, maple syrup, mint, raspberry, turkey, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "recipeIngredient": ["1 (10- to 12-pound) turkey, preferably a heritage breed", "Coarse sea salt", "1 bunch fresh sage", "3 cups wild rice cooking liquid (reserved from <a href=\"https://cooking.nytimes.com/recipes/1020564-wild-rice-and-berries-with-popped-rice\">Wild Rice and Berries With Popped Rice</a>, if desired) or turkey stock, plus more as needed", "6 medium leeks, white and pale green portions only, halved lengthwise, cut into 2-inch pieces and rinsed clean", "2 tablespoons sunflower oil", "1/2 cup maple syrup, plus more as needed", "3 cups fresh raspberries or blackberries", "3 cups fresh or frozen cranberries", "2 tablespoons chopped fresh mint, plus more as needed", "1/2 cup black walnuts (see Note), lightly toasted and chopped", "Pea shoots or microgreens, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove giblets from the turkey cavity and discard or reserve for another use. Pat the turkey dry using paper towels. Rub the turkey all over with 1/2 teaspoon salt per pound of turkey. Tuck the sage sprigs inside the turkey cavity."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the turkey on a baking sheet, breast-side up. Place in the refrigerator, uncovered, for at least 4 hours and up to 6 hours to dry out the skin (this will help it crisp when it roasts)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to cook the turkey, remove it from the refrigerator and allow it to come to room temperature, 1 1/2 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. Pour the rice cooking liquid or stock into a large roasting pan and add the leeks. Place a roasting rack on top, then transfer the turkey to the roasting rack, breast-side up, and tuck the wings underneath. Brush the exposed turkey generously with the oil. Transfer to the oven and roast, 30 minutes. Baste the turkey with the pan juices, adding rice cooking liquid or stock as needed to make sure there is a 1/2-inch layer of liquid at the bottom of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the oven temperature to 350 degrees and continue roasting, basting every 30 minutes, until an instant-read thermometer inserted into the thickest part of a thigh reaches 165 degrees, 1 to 1 1/2 hours. If the skin begins to darken too much, tent the turkey loosely with aluminum foil. Brush 1/4 cup maple syrup over the turkey. Transfer turkey to a cutting board to rest for 30 minutes before carving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer 3/4 cup of the turkey pan juices to a heavy-bottomed saucepan. Add the raspberries or blackberries, cranberries and the mint to the saucepan, stir with a wooden spoon to combine, and bring to a boil. Reduce the heat to medium and cook, stirring occasionally, until the cranberries have popped open, the raspberries have fallen apart and the liquid is thick enough to coat the back of a spoon, 10 to 12 minutes. Stir in the remaining 1/4 cup maple syrup, then add maple syrup and mint according to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carve the turkey. Smear some berry sauce on each plate. Top with the leeks then the turkey. Garnish with walnuts and pea shoots or microgreens, and pass more berry sauce alongside."}]}