{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish Pie With a Sourdough Crust", "description": "This British fish pie deviates from the traditional potato topping by using sourdough bread as a crust. The result leaves you with a happy balance of crispy bread bits on top and softer bits where the bread has absorbed some of the creamy sauce. You can easily make this pie your own by swapping out the sourdough for any other good-quality white loaf, using other cuts of fish or seafood, such as cod, trout or baby squid, and playing around with whatever herbs you might have on hand. The English mustard is quite a dominant flavor here, and cuts through the richness of the pie itself. If mustard isn’t your thing, feel free to reduce the amount to 2 tablespoons.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2019/06/26/dining/26OTTO-A/merlin_156111507_1df327aa-325c-4f63-afd7-d22fc4ddbb2f-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, casseroles, seafood", "keywords": "halibut, mustard powder, salmon, shrimp, sourdough, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 258}, "recipeIngredient": ["5 tablespoons/70 grams unsalted butter, melted", "4 slices bacon (about 2 1/2 ounces/70 grams), thinly sliced crosswise", "1 large or 2 small leeks (about 10 ounces/300 grams), trimmed, halved lengthwise, sliced crosswise 3/4-inch/2-centimeters thick and washed well", "4 garlic cloves, finely chopped", "1/4 cup/40 grams all-purpose (plain) flour", "3 tablespoons mustard powder", "1 1/2 cups/360 milliliters whole milk", "1 cup/240 milliliters chicken stock", "Kosher salt and black pepper", "1/4 cup/10 grams roughly chopped fresh tarragon, plus 1 tablespoon reserved for garnish", "1/4 cup/10 grams roughly chopped fresh parsley, plus 1 tablespoon reserved for garnish", "2 tablespoons/5 grams roughly chopped fresh dill, plus 1 tablespoon reserved for garnish", "8 ounces/225 grams boneless, skinless salmon fillets, cut into roughly 1-inch/3-centimeter pieces", "8 ounces/225 grams boneless, skinless halibut fillets, cut into roughly 1-inch/3-centimeter pieces", "6 ounces/170 grams extra-large shrimp (prawns), peeled and deveined, tails removed", "2 teaspoons finely grated lemon zest, plus 2 tablespoons juice (from 1 to 2 lemons)", "8 ounces/225 grams crustless sourdough, cut into 1-inch/3-centimeter cubes", "3 tablespoons extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees Fahrenheit/200 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large sauté pan or skillet, heat 2 tablespoons butter over medium-high. Add the bacon and cook, stirring occasionally, until it starts to take on color, about 5 minutes. Add the leeks and cook, stirring occasionally, until beginning to soften, about 4 minutes. Add the garlic and cook, stirring frequently, until fragrant, about 30 seconds. Stir in the flour and mustard powder, then add the milk, stock, 3/4 teaspoon salt and a good grind of pepper, stirring to get rid of any lumps. Bring to a simmer, then lower the heat to medium and cook until thickened, about 5 minutes. Remove from the heat, stir in the tarragon, parsley and dill, then set aside to cool slightly, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the salmon, halibut and shrimp to a 9-by-13-inch/23-by-33-centimeter baking dish. Sprinkle all over with 1/2 teaspoon salt and plenty of pepper, then top with the lemon zest and juice. Pour the sauce on top, stirring gently to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss the bread with the remaining 3 tablespoons melted butter until well coated. Transfer to the baking dish, gently pressing to submerge the bread cubes halfway into the base. Bake until golden and bubbling, 25 to 28 minutes. Set aside to cool for about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pie is in the oven, combine the reserved chopped herbs and oil in a small bowl. Drizzle this all over the pie right before serving."}]}