{"@context": "http://schema.org", "@type": "Recipe", "name": "Orecchiette With Fennel and Sausage", "description": "Orecchiette pasta, the “little ears” that are typical of the Apulia region in Italy’s heel, is frequently prepared with sausage and broccoli rabe. For this recipe, I’ve swapped the broccoli rabe for a rich fennel component, which adds a distinctive flavor profile to the pasta dish. The preparation goes fairly quickly. And as an alternative to tossing the ingredients together before serving, it can be placed in an ovenproof casserole and baked, shingled generously with shards of pecorino on top. Baking at 350 degrees will take about 20 minutes, if the ingredients are hot.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2020/03/04/dining/27Pairrex/merlin_169350585_b61dae9f-c1cc-4c88-abac-e852b589942f-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "pastas", "keywords": "fennel, mascarpone, orecchiette, sausage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 35}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "1 pound sweet Italian sausage with fennel", "1 teaspoon fennel seeds", "1 large fennel bulb, trimmed, cored and chopped (about 2 cups), fronds reserved", "1 medium onion, chopped (about 1 cup)", "1 tablespoon minced garlic", "Salt", "12 ounces orecchiette", "1/4 cup mascarpone", "Ground black pepper", "3 tablespoons finely chopped flat-leaf parsley leaves", "1 ounce pecorino, grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a 3-quart sauté pan on medium-low. Add the sausages and cook, turning frequently, until browned and cooked through, about 15 minutes. Remove sausages to a cutting board. Add fennel seeds to the pan, cook until fragrant, then add fresh fennel, onion and garlic. Sauté until translucent and just starting to color, 10 to 15 minutes. Season with salt. Turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Add the pasta and cook until al dente, 13 to 15 minutes. As the pasta cooks, quarter the sausages lengthwise, then slice 1/2-inch thick. Add sausage to the sauté pan and heat on medium-low. Stir in mascarpone and season generously with pepper. Add 1/2 cup pasta water. Stir and continue heating gently. Mince 2 tablespoons of reserved fennel fronds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pasta is done, reserve another 1/2 cup pasta water. Drain pasta — you don’t have to be utterly thorough about it — and add it to the sauté pan along with enough additional pasta water for a mixture that’s quite moist but not soupy. Check seasoning, fold in parsley and fennel fronds, and transfer to a serving dish, individual plates or bowls. Serve with pecorino alongside."}]}