{"@context": "http://schema.org", "@type": "Recipe", "name": "Chopped Liver on Matzo", "description": "I’m just guessing here, but I feel like “chopped liver” will never be my most popular recipe. I do love to eat it, and for those who feel the same way, \"Hello, nice to meet you!\" It’s not much to look at, but at least one of you will become a fan after spreading this funky, savory mixture onto a salted matzo with a sprinkle of parsley and lemon juice. (I’m hoping that person is you.) It won’t keep very long (it’s best within 24 hours), but that’s why this version makes the perfect snackable amount.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2020/04/01/dining/30Roman3/merlin_170266164_e898870d-d5be-44be-8cd6-d5c8e76fc024-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 to 8 servings (about 1 cup)", "recipeCuisine": "jewish", "recipeCategory": "poultry", "keywords": "appetizer, chicken fat, chicken liver, shallot", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "recipeIngredient": ["6 tablespoons chicken fat or unsalted butter, melted", "6 ounces chicken livers, rinsed and trimmed of any fat", "Kosher salt and freshly ground black pepper", "4 large shallots (about 6 ounces), thinly sliced", "1/4 cup dry white wine or sherry", "Flaky sea salt", "3 tablespoons coarsely chopped parsley", "Matzo, for serving", "1 lemon, halved, for squeezing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 2 tablespoons chicken fat in a medium skillet over high heat. Add chicken livers, spacing them out so they brown instead of steam, and season with salt and pepper. Cook, without disturbing, until browned on one side, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs or a spatula, flip livers until browned on the other side, another 2 to 3 minutes. Remove from heat and transfer livers to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return skillet to medium-high heat. Add 2 tablespoons chicken fat, along with the sliced shallots. Season with salt and pepper and cook, tossing occasionally, until the shallots are deeply browned and completely tender, 5 to 8 minutes. Add wine and cook until reduced almost completely (shallots will look very jammy), 1 or 2 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely chop livers and shallots and combine in a medium bowl along with remaining 2 tablespoons fat. Season with salt and pepper. Place in a small bowl or serving vessel and top with flaky salt and parsley. Serve with matzo and lemon for squeezing over."}]}