{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Zucchini With Garlicky Bread Crumbs and Mozzarella", "description": "In this highly zesty recipe, thick slices of zucchini are broiled until golden and tender, then topped with milky mozzarella and bread crumbs flecked with anchovy and garlic. While it bakes, the cheese melts, the crumbs crisp and the whole thing becomes vaguely reminiscent of a lighter parmigiana — but without the frying. If you’re feeding more than two, this recipe can be doubled. Just make sure to use two rimmed baking pans so the zucchini doesn't overlap and become soggy. If you have Castelvetrano olives, use them here; they add nice crunch and color.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/08/21/dining/mc-zucchini-planks/mc-zucchini-planks-articleLarge-v3.jpg", "totalTime": "PT25M", "recipeYield": "2 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, weeknight, vegetables", "keywords": "anchovies, basil, olives, panko, parmesan, zucchini, fall, summer, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 477}, "recipeIngredient": ["Extra-virgin olive oil, as needed", "4 medium zucchini, sliced lengthwise into 1/2-inch-thick planks", "Fine sea salt", "1/2 cup panko bread crumbs", "1/2 cup grated Parmesan", "4 anchovy fillets, minced", "1 garlic clove, finely grated or mashed to a paste", "1/2 teaspoon herbes de Provence or dried oregano", "Pinch of red-pepper flakes, plus more for serving", "4 ounces mozzarella, grated (about 1 cup)", "Black pepper", "3 tablespoons chopped, pitted black or green olives", "2 tablespoons torn basil or parsley leaves", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat broiler. Brush a rimmed sheet pan with olive oil, then lay the zucchini out in an even layer. Brush zucchini with more oil and sprinkle generously with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil until golden brown, about 5 minutes. Flip and broil until golden in spots, 4 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, toss together bread crumbs, Parmesan, anchovies, garlic, herbes de Provence or oregano, red-pepper flakes and 1/4 teaspoon salt. Add 2 tablespoons oil and use your fingers to rub oil, garlic and anchovies into the crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When zucchini is browned on both sides, turn off broiler and set oven to 500 degrees. Sprinkle zucchini with mozzarella, then bread crumb mixture; generously drizzle with oil. Bake until cheese melts and bread crumbs turn golden, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grind black pepper over top and drizzle with more oil, if needed. Top zucchini with olives, basil and additional red-pepper flakes, if desired, and serve with lemon wedges for squeezing."}], "link": "https://cooking.nytimes.com/recipes/1020417-roasted-zucchini-with-garlicky-bread-crumbs-and-mozzarella"}