{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheesy Cornbread Muffins With Hot Honey Butter", "description": "Smoky chipotle takes these muffins into savory territory, but this recipe can be used purely as a blueprint: Want them a bit sweeter? Lose the minced chipotle chiles, and increase the sugar by a couple of tablespoons. Need them to hold up to a heavily spiced pot of chili? Double the chipotles en adobo, add 1/4 cup minced red onion and a dash of ground cumin, onion powder or garlic, perhaps. Whatever you add, don’t overmix: Stir the wet ingredients into the dry ingredients until just combined (a few lumps are O.K.) before folding in the cheese for muffins that are rich but not dense.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2020/02/01/dining/aw-cornbread-muffins/merlin_166828473_2710d142-94cd-451b-a259-8ff45b86cf27-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "12 muffins", "recipeCuisine": "", "recipeCategory": "breads, quick breads", "keywords": "appetizer, side dish, cheddar, chipotles in adobo, cornmeal", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 229}, "recipeIngredient": ["1/2 cup/115 grams unsalted butter (1 stick), softened", "3 tablespoons honey", "1 1/2 teaspoons chipotle en adobo sauce", "Unsalted butter, for greasing the pan", "1 1/4 cups/195 grams medium cornmeal", "1 cup/130 grams all-purpose flour", "1/4 cup/50 grams granulated sugar", "2 1/2 teaspoons baking powder", "3/4 teaspoon baking soda", "1 1/4 teaspoons black pepper", "1 teaspoon kosher salt", "1/2 cup/115 grams unsalted butter (1 stick)", "2/3 cup/160 milliliters whole milk", "1/2 cup/120 milliliters sour cream", "2 large eggs", "2 tablespoons minced chiles en adobo (optional)", "1 cup/115 grams grated sharp white Cheddar (about 3 ounces)", "3 tablespoons very thinly sliced scallions or chives", "Sliced jalapeño, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the hot honey butter: In a small bowl, stir 1/2 cup/1 stick softened butter with the honey and chipotle en adobo sauce. Refrigerate while muffins bake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees, and generously grease the cups of a 12-cup muffin tin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together the cornmeal, flour, sugar, baking powder, baking soda, pepper and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, melt the remaining 1/2 cup/1 stick softened butter over low heat. In a medium bowl, whisk together the milk, sour cream, eggs, melted butter and the minced chipotle chiles, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the wet ingredients into the dry ingredients, and stir using a rubber spatula until almost combined but still a little lumpy. Fold in the Cheddar and scallions, and stir until just combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the muffin batter in 1/4-cup portions to the prepared muffin tin. Top each muffin with a jalapeño slice, if desired, and bake until the tops are golden and the muffins are cooked through, about 18 minutes. Let cool 5 minutes in the muffin tins before carefully transferring to a wire rack, running a knife around the rims to release the muffins, if necessary. Serve warm or at room temperature, with honey butter."}], "link": "https://cooking.nytimes.com/recipes/1020775-cheesy-cornbread-muffins-with-hot-honey-butter"}