{"@context": "http://schema.org", "@type": "Recipe", "name": "Wine-Braised Chicken With Artichoke Hearts", "description": "Artichokes become weeknight friendly when they come from a can or a jar. Be sure to buy the unmarinated ones here. The gentle braise in rendered chicken fat and tangy white wine, mixed with onions and herbs, provides all the flavor the artichokes need.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2020/02/12/dining/10Romanrex1/merlin_167078514_a6ea3f09-e8a5-42d5-afaf-8b3433175192-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry", "keywords": "canned artichokes, chicken, dry white wine, thyme, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1134}, "recipeIngredient": ["4 bone-in, skin-on chicken thighs, or a mix of legs and thighs (1 1/2 to 2 pounds)", "Kosher salt and black pepper", "1 tablespoon olive oil, plus more for drizzling", "2 (14-ounce) cans artichoke hearts, drained and halved lengthwise", "1 medium red onion, sliced", "1 1/4 cup dry white wine", "A few sprigs of thyme, oregano or marjoram", "1 cup mint, parsley or dill leaves", "Sumac, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Season chicken on both sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon oil in a large skillet over medium-high, and add chicken, skin-side down. Cook, without flipping, until the skin is deeply golden and much of the fat has rendered, 8 to 10 minutes. (You may need to pour off some of the fat.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, flip the chicken skin-side up. Let the undersides cook for another 5 or so minutes. Set chicken aside. Add artichoke hearts and onions to the pan, letting them sizzle until they get a little color, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wine and thyme, shaking skillet to make sure the wine is evenly distributed and scraping up any golden-brown bits. Add chicken back to the pan, over the artichoke hearts and onions. Bring to a simmer and place in the oven until chicken has finished cooking and sauce is reduced by about half, 10 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken from oven and scatter with herbs. Finish with more pepper, a drizzle of olive oil, and a sprinkle of sumac, if you have it."}], "link": "https://cooking.nytimes.com/recipes/1020861-wine-braised-chicken-with-artichoke-hearts"}