{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Chickpeas and a Negroni", "description": "<em>This is a no-recipe recipe, a recipe without an ingredients list or steps. It invites you to improvise in the kitchen.</em>\nA drink before dinner? Make a Negroni, then pasta with chickpeas and tomato sauce. First, the Negroni: one part gin, one part sweet vermouth, one part Campari, stirred with ice then strained over ice and garnished with orange peel. Sip! Then peel and chop an onion and sauté it in olive oil with a few cloves of smashed garlic and a spray of salt and pepper. Have another hit of Negroni. When the mixture has just started to brown, add a tablespoon of tomato paste and a 28-ounce can of chopped tomatoes, along with a stick of cinnamon. Stir and simmer away for 10 minutes or so, longer if you can, then add enough cream or half-and-half so that the sauce turns softer in color, running to pink.\nMeanwhile, boil some salted water and prepare your favorite pasta (I like shells for this application) until it is just al dente. Drain, then toss in a 14-ounce can of drained chickpeas and stir the whole thing into the tomato sauce, topping with chopped parsley and a sprinkle of red-pepper flakes. Finish that Negroni. Eat.\n<em>Sam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. <a href=\"https://www.nytimes.com/newsletters/cooking\">Sign up to receive it.</a> You can find more no-recipe recipes <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/14326423-no-recipe-recipes\">here</a>.</em>", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/02/17/dining/17norecipe-pastanegroni/17norecipe-pastanegroni-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, cocktails, pastas", "keywords": "canned tomatoes, chickpea, cream, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 306}, "recipeIngredient": [], "recipeInstructions": null, "link": "https://cooking.nytimes.com/recipes/1020019-pasta-with-chickpeas-and-a-negroni"}