{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Ratatouille With Goat Cheese and Olives", "description": "Cooking ratatouille on a sheet pan in the oven isn’t just easier than cooking it in a pot on the stove, it’s also better: richer and more deeply caramelized in flavor. To make it, the vegetables are slicked with plenty of olive oil, then roasted until tender and browned, their juices mingling and condensing. Toward the end of the cooking time, goat cheese and olives are sprinkled on top. The cheese melts and becomes creamy, while the olives heat up and turn plump and tangy. Serve this as a meatless main dish, with crusty bread and more goat cheese, or as a hearty side dish to a simple roast chicken or fish.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/09/04/dining/30apperex/30apperex-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "vegetables", "keywords": "eggplant, goat cheese, olives, tomato, zucchini, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 457}, "recipeIngredient": ["1 large onion, halved and thinly sliced", "1 3/4 pounds zucchini, cut into 1/4-inch slices (about 7 cups)", "1/2 cup plus 1 tablespoon extra-virgin olive oil, plus more for serving", "6 thyme sprigs", "4 rosemary sprigs", "6 garlic cloves, smashed and peeled", "Fine sea salt, as needed", "2 pounds eggplant, cut into 1-inch cubes (about 10 cups)", "2 medium red bell peppers, sliced into 1/2-inch slices (about 3 cups)", "3 cups cherry tomatoes (12 ounces)", "8 ounces goat cheese, crumbled", "3/4 cup Castelvetrano or other good-quality olives, crushed, pitted, and torn into pieces", "Lemon wedges, for serving", "1/2 cup basil leaves, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees, and arrange two racks in the top and bottom thirds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On one rimmed 13-by-17-inch sheet pan, toss together onion slices, zucchini, 1/4 cup oil, 3 thyme springs, 2 rosemary sprigs, 3 garlic cloves and 1/2 teaspoon salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a second rimmed baking sheet, toss together eggplant, red peppers, 1/4 cup oil, 3 thyme sprigs, 2 rosemary sprig, 3 garlic cloves and 3/4 teaspoon salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one tray on the top rack, and a second on the bottom rack of the oven. Roast both for 40 minutes, stirring vegetables two or three times."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomatoes to the baking sheet with eggplant and peppers, then continue to roast until the tomatoes burst and the zucchini turn deeply golden brown, another 20 to 25 minutes. The vegetables will become very caramelized, and that’s a good thing, particularly with the zucchini and onions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer zucchini and onions to the baking sheet with eggplant, mix well, and spread in an even layer (it will just fit). Drizzle vegetables with another 1 tablespoon oil, then sprinkle goat cheese and olives over the top. Roast until goat cheese is soft and warmed through, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer vegetables to a serving platter, drizzle with a little more oil and squeeze juice from the one of the lemon wedges over the top. Garnish with basil leaves. Serve hot or warm, with more lemon wedges on the side."}], "link": "https://cooking.nytimes.com/recipes/1020424-sheet-pan-ratatouille-with-goat-cheese-and-olives"}