{"@context": "http://schema.org", "@type": "Recipe", "name": "Thai-Inspired Coconut Curry Soup With Vegetables", "description": "There are dozens of types of curries in Thailand, but most can be categorized as red, green or yellow; this is a streamlined vegetarian version of a red curry, named after the color of chile  found in the curry paste. This one is spicy, sweet, creamy and adaptable. When the red curry paste is cooked in oil, the blend of chiles and aromatics like galangal and lemongrass come alive and become the curry’s backbone. Because store-bought pastes vary in intensity, this recipe also uses fresh garlic and ginger to ensure a zingy final result. Use any vegetables you like, but it’s nice to have one hearty vegetable (like sweet potato) and one crisp one (like snow peas) for a mix of textures. If you find your curry too spicy, stir in a bit of brown sugar. If it’s feeling a bit flat, squeeze in a little lime juice or add a dash of soy or fish sauce.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/12/23/dining/as-red-curry-soup/merlin_166281879_6762cd46-0bf5-407a-a461-b373634f52a4-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, quick, weekday, soups and stews, vegetables", "keywords": "coconut milk, curry paste, ginger, snow peas, sweet potato, vermicelli, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 496}, "recipeIngredient": ["5 ounces rice vermicelli noodles", "1 tablespoon coconut oil", "1 cup chopped sweet potato, carrots, parsnips, cauliflower or winter squash", "1 (2-inch) piece ginger, finely grated (no need to peel)", "4 garlic cloves, finely grated", "3 tablespoons Thai red curry paste", "Kosher salt and black pepper", "1 (14-ounce) can full-fat coconut milk", "1 cup chopped snow peas, bok choy, snap or frozen peas, edamame or green beans", "1 lime", "Cilantro or basil leaves, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the noodles according to package directions. Drain, rinse and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the noodles cook, in a medium pot, warm the oil over medium heat. Add the sweet potato, ginger, garlic and red curry paste. Season with a pinch each of salt and pepper, and cook, stirring occasionally, until the mixture turns a shade darker and begins to stick to the bottom of the pot, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the coconut milk, snow peas, 1 cup water and 1 teaspoon salt. Bring to a simmer and cook until the snow peas are bright green and the sweet potato is tender, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat. Cut the lime in half; squeeze one half into the curry and cut the other half into four wedges. Divide the noodles among bowls, top with the curry and herbs. Squeeze more lime juice over as desired."}]}