{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Corn on the Cob With Miso Butter and Chives", "description": "Corn slathered in miso butter is special enough, so you’re within your rights to ignore any other ingredients in this recipe. But for lovers of spice, the Japanese spice blend shichimi togarashi is worth seeking out. In English, it translates to “seven-flavor chile pepper,” though not all of those seven flavors are chile: There’s also roasted orange peel, sesame seeds, ground ginger and seaweed in the mix. Add it gradually, so as not to overpower the subtle flavor of the miso butter (and because everyone likes a different amount of spice). If you can’t find shichimi togarashi, substitute crushed red-pepper flakes.", "author": {"@type": "Person", "name": "Emily Fleischaker"}, "image": "https://static01.nyt.com/images/2019/09/14/dining/ef-corn-on-the-cob-with-miso-butter-and-chives/merlin_157388811_fc81b580-7de2-4b21-baf7-12edd388bab8-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "appetizer, side dish, butter, chives, corn, miso, red pepper flakes, shichimi togarashi, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 44}, "recipeIngredient": ["4 ears fresh corn, shucked", "4 tablespoons unsalted butter, at room temperature", "2 tablespoons white miso paste", "2 tablespoons finely chopped fresh chives", "1 teaspoon shichimi togarashi or crushed red-pepper flakes", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your grill to medium-high. Grill corn, turning occasionally, until cooked through and lightly charred, 10 to 12 minutes. (Alternatively, drop corn in a large pot of salted boiling water and cook for 5 to 7 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, mix together butter and miso paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slather hot corn with miso butter. Sprinkle with chives and shichimi togarashi, and serve with lime wedges alongside for squeezing."}], "link": "https://cooking.nytimes.com/recipes/1020340-spicy-corn-on-the-cob-with-miso-butter-and-chives"}