{"@context": "http://schema.org", "@type": "Recipe", "name": "Leg of Lamb With Savory Beans", "description": "In France, gigot d’agneau — leg of lamb — is, well, de rigueur for a proper Easter meal. But it is always appropriate for any special dinner party, or any occasion throughout the year when you want an impressive main course. The technique is simple and requires few ingredients (garlic, thyme and rosemary), but the result is very flavorful. Seasoning the lamb for at least an hour in advance of roasting is essential. Refrigerate it overnight for more intense flavor; it’s also less work to do on the day of the feast. Just remove from the refrigerator, bring it to room temperature, and it’s ready for the oven.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/04/17/dining/12kitchenrex/12kitchenrex-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "french", "recipeCategory": "dinner, roasts", "keywords": "carrot, leg of lamb, white beans, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 109}, "recipeIngredient": ["1 pound flageolet or white beans, such as cannellini (about 2 cups)", "2 whole cloves", "1 medium onion, halved", "2 bay leaves", "1 large carrot, cut into 2-inch chunks", "1 whole head garlic, cut in half horizontally", "1 small fistful of thyme sprigs", "1 teaspoon kosher salt", "2 tablespoons chopped flat-leaf parsley", "1 tablespoon finely cut chives", "1 teaspoon grated lemon zest (from 1 lemon)", "3 tablespoons extra-virgin olive oil", "Black pepper, to taste", "1 (8- to 9-pound) leg of lamb, bone-in, trimmed and tied (a butcher can do this)", "6 medium garlic cloves, cut into quarters lengthwise", "Kosher salt and black pepper", "2 tablespoons extra-virgin olive oil", "4 medium onions, halved crosswise", "2 celery stalks, cut into 3-inch-long pieces", "2 thyme bunches", "2 rosemary bunches", "2 cups dry white wine", "1 1/2 pounds small, young carrots", "2 tablespoons unsalted butter", "Watercress, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the beans in Dutch oven or heavy-bottomed pot. Add 8 cups water and place pot over high heat. Stick 1 whole clove into each onion half. Add onion, bay leaves, carrot, garlic, thyme and salt. Bring to a boil, then turn heat to a bare simmer and cover with lid ajar. (The slow simmer keeps the beans from bursting.) After 30 minutes, taste the bean broth, and add salt as necessary. Cook for about another 30 minutes, but check for tenderness after 15 minutes. Turn off the heat and let beans cool in their cooking liquid. (You may cook the beans several hours, or up to 1 day, in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the lamb: With a sharp paring knife, make 24 small slits over the surface of the lamb. Using your fingers, push a garlic sliver into each slit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the leg generously all over with kosher salt, then sprinkle with about 1 teaspoon black pepper. Drizzle with about 2 tablespoons olive oil, and massage oil and seasonings all over the meat. Leave at room temperature for at least an hour. (Alternatively, wrap and refrigerate the seasoned leg for up to 24 hours. Bring to room temperature before proceeding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 475 degrees. In a sturdy roasting pan, arrange the onions and celery. Lay down the thyme and rosemary branches and set the lamb leg on top. Roast, uncovered, for 20 minutes, then add wine to the pan and turn heat to 350 degrees. Continue cooking, basting the roast occasionally, until the internal temperature reaches 130 degrees for medium-rare or 140 for medium, which will take up to 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the roast to a cutting board and keep warm, tented with foil, for 15 to 20 minutes. Remove the onions, celery, thyme and rosemary from the roasting pan and discard. Skim fat from surface of pan juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set pan over medium-high heat and bring to a simmer, scraping up any browned bits from the bottom of the pan. Taste and adjust with a splash of water if the pan juices are too salty."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While lamb is resting, boil carrots in well-salted water until tender, 10 to 12 minutes. Drain, toss with butter and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat the beans in their broth, then drain reserving bean broth for another use. Remove and discard onion, bay leaves, carrot, garlic and thyme. Put beans in a warm serving dish. Toss beans gently with the parsley, chives, lemon zest, olive oil and pepper. Reheat pan juices, strain and pour into a serving vessel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carve the lamb and arrange on serving platter along with the carrots. Garnish with watercress, if desired."}]}