{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn, Bacon and Cheddar Pie With Pickled Jalapeños", "description": "Corn kernels make this quiche-like pie juicy-sweet. Bacon, jalapeño and quick-pickled onions make it deeply savory, and a custard of sour cream, eggs and Cheddar adds a delightfully gooey texture. A touch of cornmeal in the dough makes the crust extra crunchy, and its corn flavor echoes the filling. You can bake this in the height of corn season with fresh kernels, or in the depths of winter with frozen. It will be just as richly satisfying any time of the year.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/08/14/dining/09apperex-cornpie1/merlin_158856405_d4339f29-4a19-4e95-92f8-1de0d2e48777-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "weekday, pies and tarts", "keywords": "bacon, cheddar, corn, jalapeño, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 532}, "recipeIngredient": ["1 cup/130 grams all-purpose flour, plus more for rolling", "1/4 cup/40 grams cornmeal", "1/4 teaspoon fine sea salt", "1/2 cup/115 grams cold unsalted butter (1 stick), cubed", "3 to 6 tablespoons ice water", "1 small red onion", "1 tablespoon fresh lime juice", "1/2 teaspoon fine sea salt, plus more as needed", "Pinch of granulated sugar", "4 ounces bacon (4 slices), diced", "1 1/2 cups fresh or frozen corn kernels (from 2 small ears if fresh)", "2 tablespoons chopped pickled jalapeño, plus more slices for topping", "1 cup heavy cream", "1/2 cup sour cream or plain Greek yogurt", "3 large eggs", "3/4 cup coarsely shredded sharp Cheddar (3 ounces)", "3 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the crust: In the bowl of a food processor fitted with the blade attachment, or in a large bowl, pulse or mix together flour, cornmeal and salt until combined. Add butter, and either pulse or use your finger to smoosh it in until butter is the size of lima beans. Add ice water, 1 tablespoon at a time, and pulse or mix just until dough comes together. There should still be large flecks of butter left in dough. Shape dough into a disk and wrap in plastic wrap. Refrigerate at least 1 hour before baking. (Dough can be made up to 5 days ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll out dough into a 12-inch circle. Transfer dough to a 9-inch pie plate; trim and crimp edges. Chill for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Prick the bottom of the pie with a fork. Line with foil or parchment paper and fill with pie weights, dried beans or rice. Bake for 15 minutes. Remove foil or paper and pie weights or beans. Bake until pale golden and dry to the touch, about 5 to 7 minutes more. Reduce oven temperature to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While crust is chilling and baking, prepare the filling: Cut red onion in half across the equator (not root to stem), then from the center, cut out two very thin, round slices. Separate onion slices into rings and put them in a bowl with lime juice and a pinch each of salt and sugar. Set aside while you assemble the rest of the tart. Coarsely chop remaining onion and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter bacon in a cold 12-inch skillet. Turn heat to medium, and cook until the bacon is golden and the fat has rendered, 10 to 14 minutes. Using a slotted spoon, transfer bacon to a paper-towel-lined plate. Leave fat in the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir chopped onion into pan with bacon fat and place over medium heat. Sauté until golden-edged and translucent, about 6 minutes. Stir in corn, 1/2 teaspoon salt and chopped pickled jalapeño. Cook until corn is tender, 2 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and scoop 1/2 cup corn mixture into a blender. Add cream, sour cream and eggs. Blend until you get a thick purée. Using a spatula, scrape corn purée back in pan with whole corn kernels, and stir in 1/2 cup Cheddar, the parsley and the cooked bacon. Scrape into baked pie shell."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top filling mixture with pickled red onion slices and jalapeño slices. Sprinkle with remaining 1/4 cup Cheddar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until puffed, golden and just set, 35 to 45 minutes. Transfer to a wire rack to cool slightly. Serve warm or at room temperature."}]}