{"@context": "http://schema.org", "@type": "Recipe", "name": "Pinakbet (Vegetables Stewed in Fermented Shrimp Paste)", "description": "Filipino cooking embraces salt — perhaps the legacy of life in a tropical climate, where, before refrigeration, food had to be preserved. The primary salt in pinkabet, a vegetable stew, is bagoong, a satisfyingly funky paste of fermented shrimp or fish. As with miso, there are many types of bagoong: dry or oily, toasted or raw, bright pink and briny or dark brown and faintly sweet. I like to use the pink variety because of the large formations of salt crystals. Paired with the toasted and caramelized tomato paste, the bagoong achieves a deep, concentrated umami flavor, enough to season all the vegetables.", "author": {"@type": "Person", "name": "Angela Dimayuga"}, "image": "https://static01.nyt.com/images/2019/10/09/dining/08Filipinorex6-Pinakbet/merlin_160617876_49d1459e-ab8f-4b98-9992-73c8d899d26f-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "8 to 12 servings (makes about 12 cups)", "recipeCuisine": "filipino", "recipeCategory": "dinner, one pot, soups and stews, vegetables", "keywords": "bittermelon, japanese eggplant, jasmine rice, kabocha, long beans, okra, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "recipeIngredient": ["2 tablespoons neutral oil, such as canola", "12 garlic cloves, smashed", "3 tablespoons tomato paste", "5 tablespoons bagoong (Filipino fermented shrimp paste), preferably the untoasted pink variety", "3 very ripe tomatoes, halved, then each half cubed into 4 quarters", "2 large yellow onions, halved, then each half cubed into 4 quarters", "10 ounces kabocha squash, peeled and cut into 2-inch pieces (about 3 cups)", "1 1/2 tablespoons kosher salt", "1 pound okra, ends trimmed", "1/2 pound long beans, cut into 2-inch pieces", "2 Japanese eggplants, cut into 1-inch pieces", "1 bittermelon, halved lengthwise, seeds removed, then cut into 1/2-inch moons", "Steamed jasmine rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, heat the oil over medium-high until it shimmers. Add the garlic and cook, stirring until softened, about 3 minutes. Add the tomato paste and cook, stirring, until caramelized, toasted and darkened, about 2 minutes. Add the bagoong and cook, stirring, until superfragrant and aromatic, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes and stir to deglaze, about 3 minutes. Add the onions, squash, salt and 2 cups water and cook over medium-high, stirring occasionally, until vegetables start to soften and liquid reduces slightly and becomes glossy, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the okra, long beans, eggplants and bittermelon, and cook over medium-high, stirring occasionally, 5 minutes. Reduce the heat to medium-low and cook, stirring occasionally, until the squash and other vegetables are soft but retain some bite, and long beans are floppy, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot over rice, or set it on a buffet, where it’s equally good served at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1020495-pinakbet-vegetables-stewed-in-fermented-shrimp-paste"}