{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Potato Kugel", "description": "At its core, kugel is a casserole. It comes in both savory and sweet varieties, often made with egg noodles and vaguely sweetened. This version, made with potatoes, is decidedly salty and savory, with onions in the mixture and chives to finish. It can best be described as something between a Spanish tortilla and a giant latke; the potatoes are shredded, not sliced, there are eggs but no flour, and it’s got crispy edges and a creamy interior. Sounds dreamy, doesn’t it? The most annoying parts of this kugel are also the most important: grating the potatoes (I use a box grater, but you can use a food processor with the shredding blade) and wringing out their moisture. For that, I use my hands and a colander or strainer to save a kitchen towel or a cheesecloth, but you can use those, if you like. Traditionally made in a casserole-style baking dish, this kugel starts off in a cast-iron skillet, but a stainless-steel skillet would do the job, and honestly so would a baking dish, just know you may be sacrificing that crunchy underside.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2020/04/01/dining/30Romanrex5-kugel/30Romanrex5-kugel-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "8 to 10 servings", "recipeCuisine": "jewish", "recipeCategory": "vegetables", "keywords": "chicken fat, egg, potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 269}, "recipeIngredient": ["4 pounds russet potatoes (about 5 to 7 potatoes), peeled ", "1 large yellow onion", "6 large eggs ", "10 tablespoons chicken fat, melted, or use vegetable oil", "Kosher salt and freshly ground black pepper ", "1/3 cup finely chopped chives, for serving", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Using a box grater or the shredding attachment on the food processor, grate the potatoes and onion into a colander fitted inside a large bowl (or in the sink)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands and working with a bit at a time, squeeze as much water from the potatoes and onions as humanly possible and transfer the dry potatoes to a large bowl (you can use that same bowl, just make sure it’s drained and dry). For added insurance, you can also do this with cheesecloth or a porous kitchen towel, if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add eggs and 6 tablespoons chicken fat to the potatoes, and season with salt and plenty of pepper, mixing well. Heat another 2 tablespoons fat in a 9- or 10-inch cast-iron skillet over medium-high. (This recipe will work in a 9- or 10-inch skillet, but the kugel will be slightly taller in a 9-inch.) Delicately place the potato mixture into the skillet, taking care not to pack it in tightly. (You want to keep the kugel light and airy.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the potatoes, rotating the skillet occasionally to promote even browning, until it’s golden brown on the edges and up the sides, 10 to 12 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle the top of the potatoes with the remaining 2 tablespoons fat and place in the oven. Bake until the top of the kugel is deeply golden brown, the edges are wispy and crispy, and the potatoes are completely and totally tender and cooked through, 45 to 50 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and top with more pepper, chives and flaky sea salt. Slice and serve warm. "}], "link": "https://cooking.nytimes.com/recipes/1020959-crispy-potato-kugel"}