{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Dill Salmon", "description": "This oven-roasted salmon is adapted from the cookbook “Bottom of the Pot: Persian Recipes and Stories” (Flatiron, 2018) by Naz Deravian. The dish comes from Ms. Deravian’s stepmother, who likes to combine her native Japanese ingredients with Iranian ones like pomegranate molasses. Get a quick pot of rice started as the salmon marinates and you can have dinner prepped in less than 20 minutes. Serve with <a href=\"https://cooking.nytimes.com/recipes/1020250\">sheveed polo</a> (Iranian dill rice) and make sure to drizzle plenty of the pan juices over the salmon and rice.", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2019/05/22/dining/nd-dill-salmon/nd-dill-salmon-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, quick, seafood", "keywords": "lime juice, rice, saffron, salmon fillet, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 542}, "recipeIngredient": ["1 1/2 pounds skin-on, center-cut salmon fillet", "1 1/4 teaspoons kosher salt", "1/2 teaspoon black pepper", "1/4 cup fresh lime juice or Seville orange juice, plus additional wedges, for serving", "2 tablespoons olive oil", "2 tablespoons soy sauce", "2 tablespoons maple syrup", "1 tablespoon dried dill or 3 tablespoons chopped fresh dill", "1 large garlic clove, crushed", "1/4 teaspoon ground turmeric", "1/8 teaspoon ground saffron (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees with the rack in the center position. Choose a baking sheet or baking dish that fits the salmon snugly (so the juices don’t disperse and burn) and line it with parchment paper. Place the salmon skin-side down on the baking sheet and season well with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the rest of the ingredients in a small bowl and spoon over the salmon. If you have time, flip the salmon and let marinate directly on the baking sheet, flesh-side down, for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the salmon skin-side down until cooked through to your liking, 9 to 12 minutes. Serve with extra lime or orange wedges, and drizzle the pan juices over the salmon and rice."}]}