{"@context": "http://schema.org", "@type": "Recipe", "name": "Cherry Tomato and White Bean Salad", "description": "This simple salad makes a bright, tangy companion to grilled meat or fish. Marinating the red onions and garlic in the vinaigrette for 15 minutes not only diffuses their flavor but also softens their bite. This salad travels well and would be an excellent choice for a potluck or picnic. It’s also supremely versatile, and can be dressed up with any soft herb like basil, tarragon or mint, and chile, in almost any form.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2019/08/06/dining/lh-tomato-and-white-bean-salad/lh-tomato-and-white-bean-salad-articleLarge-v2.jpg", "totalTime": "PT5M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, easy, quick, weekday, beans, vegetables", "keywords": "cannellini beans, dijon mustard, garlic, olive oil, red onion, red wine vinegar, tomatoes, main course, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 547}, "recipeIngredient": ["1/4 cup olive oil", "3 tablespoons red wine vinegar", "1/2 teaspoon Dijon mustard", "3/4 teaspoon kosher salt", "1/2 teaspoon pepper", "3/4 cup very thinly sliced red onion (about 1/2 a small onion)", "1 1/2 teaspoons minced garlic (about 1 large clove)", "2 pints cherry tomatoes, halved", "1 (15-ounce can) cannellini beans, rinsed and drained", "1/3 cup chopped fresh parsley", "1/2 cup shaved Parmesan (about 2 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the olive oil, vinegar, mustard, salt and pepper. Stir in the red onion and garlic and set the dressing aside to marinate for 15 to 30 minutes at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tomatoes, white beans and parsley in a large bowl. Pour the dressing over the salad, toss well, then gently fold in the Parmesan. Serve at room temperature using a slotted spoon."}]}