{"@context": "http://schema.org", "@type": "Recipe", "name": "Sesame-Ginger Chicken Noodle Soup", "description": "This noodle soup is a grown-up riff on an old college favorite: Taiwanese instant ramen. The scent of the simmering, chicken-and-ginger broth conjures vivid memories of late-night instant-noodle snacks. This version has all of the good qualities of the store-bought kind, but it’s richer in flavor thanks to the bone-in chicken breast (bone-in, skin-on chicken thighs would work too). It hits all the comforting notes of a typical chicken noodle soup, brightened by a hint of sesame oil, fresh scallions and a heavy dose of ginger used in the broth and as a garnish.", "author": {"@type": "Person", "name": "Sue Li"}, "image": "https://static01.nyt.com/images/2019/02/12/dining/sl-sesame-chicken-soup/sl-sesame-chicken-soup-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "chicken breast, ginger, rice wine, scallion, sesame oil, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 164}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 682, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "3 grams", "proteinContent": "37 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1665 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons toasted sesame oil, plus more for serving", "2 bone-in, skin-on chicken breasts (about 1 1/2 pounds)", "Kosher salt", "1 (2-inch) piece fresh ginger, sliced, plus extra julienned ginger, for garnish", "1/4 cup rice cooking wine or any type of white wine", "12 ounces fresh ramen noodles or 8 ounces dried ramen noodles", "2 scallions, thinly sliced", "Ground white or black pepper, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons sesame oil in a medium pot over medium. Season chicken with salt and add to pot, skin-side down, along with sliced ginger. Cook, turning, until the chicken skin and ginger slices are golden, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add rice cooking wine and boil until reduced by half, about 2 minutes. Add 6 cups water and bring to a boil over high. Once boiling, partially cover the pot with a lid, reduce the heat to medium-low and simmer until the chicken is tender and the broth is flavorful, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken from the pot and transfer to a bowl until cool enough to handle. Strain the broth, discarding the ginger, then season with salt, cover and set aside. When the chicken has cooled, discard the skin and bones and shred the meat then return it to the broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a saucepan of water to boil and cook ramen noodles according to package instructions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide cooked noodles among bowls and top with the chicken and its broth. Garnish with scallions, julienned ginger, a sprinkle of pepper and more sesame oil."}]}