{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Mashed Potatoes", "description": "If you think cream and butter are required to make amazing mashed potatoes, then this recipe might surprise you. It calls for Yukon Gold potatoes, which are naturally creamier than russets and need only to be mashed with a little of their cooking water to become rich and fluffy. Sizzling shallots in a generous amount of olive oil infuses the oil with flavor before it’s swirled into the potatoes. The finished mash is topped with the crispy shallots for a delightful, savory crunch. You could also <a href=\"https://cooking.nytimes.com/recipes/1019746-roasted-garlic-and-white-bean-dip-with-rosemary\">fry a rosemary sprig</a> in the same oil, or skip it and just add several pats of vegan butter. Whatever you do, remember to season the mashed potatoes generously. Mashed potatoes need lots of salt, especially those without dairy.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/11/05/dining/as-vegan-mashed-potatoes/merlin_163577766_0022d377-9fa7-4e99-8dd8-64cf841bcd0a-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "dairy-free, vegan, vegetarian, olive oil, shallot, yukon gold potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 43}, "recipeIngredient": ["2 pounds Yukon Gold potatoes", "Kosher salt", "1/2 cup olive oil", "1 large shallot, peeled, halved, and thinly sliced lengthwise", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the potatoes and cut them into 1-inch pieces. Put them in a large saucepan, add 2 tablespoons salt, and cover potatoes with water by 1 inch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a boil over high heat, reduce to medium and let cook until piercing with a fork yields no resistance, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the potatoes cook, put the olive oil and shallots in a large skillet, and set up a paper towel-lined plate next to the stove. Heat the shallots over medium-high. When they start to bubble, reduce the heat to medium and cook until golden brown, 5 to 9 minutes. (Lower the heat if they are cooking too quickly). Use a slotted spoon to transfer to the paper towels, and season with salt. Reserve the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve 1 cup of the cooking water, then drain the potatoes and return them to the pot. Mash the potatoes over low heat using a potato masher or wooden spoon until completely mashed. Add the reserved potato water 1 tablespoon at a time, vigorously stirring until the potatoes are smooth and come together. (You will use about 1/2 cup.) Taste, season with salt, then stir in 1/4 cup of the reserved oil. Serve topped with crispy shallots, black pepper and more of the oil, if desired."}]}