{"@context": "http://schema.org", "@type": "Recipe", "name": "Bolitas de Yuca y Queso (Fried Yuca Balls Stuffed With Cheese)", "description": "Yuca, also known as cassava, is a root vegetable used around the world to make many beloved regional dishes as well as flour, tapioca and even laundry starch. It is similar to the potato, but it is harder, has a thicker brown skin and has a tough fiber running through its center. It often has a subtly floral, lightly sweet taste. Here, yuca is boiled, mixed with loads of mozzarella, then fried until golden brown to make bolitas de yuca y queso, a popular dish in Latin America that is also known as yuquitas rellenas or bollitos de yuca. The crunchy panko coating complements the creamy, melty center. For this particular recipe, fresh yuca works best. Frozen yuca retains too much water and could make the bolitas too mushy to hold their shape.", "author": {"@type": "Person", "name": "Kiera Wright-Ruiz"}, "image": "https://static01.nyt.com/images/2019/06/17/dining/kwr-yuca-and-cheese-balls/merlin_156440790_6422724f-7cbc-4670-aafa-4ccf596524d2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "16 balls", "recipeCuisine": "caribbean, latin american", "recipeCategory": "dinner, snack, finger foods, project, vegetables", "keywords": "cream, eggs, mozzarella, panko, yuca, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 51}, "recipeIngredient": ["1 1/4 pounds fresh yuca", "1 cup shredded mozzarella (about 4 ounces)", "1/4 cup heavy cream", "4 eggs", "3/4 teaspoon kosher salt", "1/2 cup all-purpose flour", "1 1/2 cups panko breadcrumbs", "Vegetable oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to boil over high heat. Trim the ends of the yuca and peel thoroughly (see Tip). Cut yuca in half crosswise, then quarter each piece lengthwise. (Do your best to make them the same size to ensure even cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add yuca to boiling water and cook until fork tender, 15 to 20 minutes. Drain yuca, then transfer to a large bowl. Using a fork, remove and discard any hard fibers at the center of each piece. While the yuca is still hot, mash it using a large fork or potato masher until mostly smooth (a few chunks are O.K.). Set aside and cool to room temperature, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cheese, heavy cream, 1 beaten egg and salt, and mix until well combined. Wetting your hands as necessary to prevent sticking, scoop out about 1/4 cup yuca mixture (it will be soft and sticky) and roll between your palms into golf-ball-size rounds. You should have about 16 balls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Separate the flour, panko and the remaining 3 eggs into three shallow containers. Lightly beat the eggs. Working in batches of 2 to 3 balls, dredge each ball in the flour, then the egg, then the panko, making sure it is well coated with each one. Transfer to a large plate and prepare the rest of the balls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat 1/4-inch vegetable oil over medium-high. (The oil is ready when a pinch of flour sizzles when added to the pan.) Transfer half the yuca balls to the pan and fry, rotating frequently, until golden brown all over, 4 to 5 minutes. Using a slotted spoon, transfer yuca balls to a paper towel-lined plate to drain. Repeat with remaining yuca balls and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020302-bolitas-de-yuca-y-queso-fried-yuca-balls-stuffed-with-cheese"}