{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Red Beans and Rice", "description": "This is a pressure cooker spin on the New Orleans classic (though we have a <a href=\"https://cooking.nytimes.com/recipes/1020815-slow-cooker-red-beans-and-rice\">slow cooker version</a>, too, if that’s more your speed). Pressure cookers have a special way with dried beans, cooking even unsoaked beans quickly and evenly, so that the beans become creamy but retain their shape. Here, you want the beans to be very soft, so that the stew is thick, not brothy. “Monday red beans” are traditionally flavored with a leftover pork bone, so you can use one instead of a ham hock, if you like. If you have a favorite Cajun or Creole seasoning blend, use 1 heaping tablespoon of it in place of the sage, cayenne, garlic, onion and paprika, and taste before adding any salt, since seasoning blends vary in salinity.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/01/22/dining/sd-pressure-cooker-red-beans-and-rice/merlin_167526705_ab34b4c5-b8b1-4008-bf6d-5f4b807bcc8e-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "american, southern", "recipeCategory": "dinner, beans, sausages", "keywords": "andouille sausage, bell pepper, celery, garlic, ham hock, kidney bean, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 28}, "recipeIngredient": ["2 tablespoons vegetable oil", "1 large yellow onion, finely chopped", "Kosher salt and black pepper", "3 celery stalks, finely chopped", "1 green bell pepper, finely chopped", "10 garlic cloves, finely chopped", "1 teaspoon garlic powder", "1 teaspoon onion powder", "1 teaspoon sweet paprika", "1/2 to 1 teaspoon ground cayenne, to taste", "1/2 teaspoon ground sage (optional)", "1 pound dried red kidney beans (no need to soak)", "12 ounces smoked pork sausage, preferably Andouille, sliced into 1-inch-thick coins", "1 smoked ham hock (about 10 ounces)", "3 dried bay leaves", "3 fresh thyme sprigs or 1 teaspoon dried thyme", "Cooked rice, for serving", "Sliced scallions, for serving", "Louisiana-style hot sauce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on the sauté setting of a 6- to 8-quart electric pressure cooker and heat the oil. Add the onion, season with salt, and cook, stirring occasionally, until limp and translucent, 6 to 8 minutes. Add the celery and bell pepper, and cook, stirring occasionally, until softened, 5 to 8 minutes. Add the chopped garlic, garlic powder, onion powder, paprika, cayenne and sage (if using); grind in a generous amount of black pepper and add 3/4 teaspoon salt. Stir well to combine all the ingredients, then turn off the sauté setting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans, sausage, ham hock, bay leaves, thyme and 5 1/2 cups water. Scrape the bottom of the pot to loosen any browned bits. Cook on high pressure until the beans are creamy, 50 minutes to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the pressure cooker and allow the pressure to reduce naturally for 10 minutes, then release the remaining pressure manually and open the lid. Taste the beans to make sure they are tender, and add salt and cayenne to taste. Using a fork, mash some of the beans against the side of the pressure cooker to make the mixture creamy; you can turn on the sauté setting and let the mixture bubble for a few minutes to thicken, if you like, but it will also continue to thicken as it sits. Discard the bay leaves and thyme sprigs, and pick the meat off the ham hock if you like. Top the beans with hot cooked rice and scallions; serve with hot sauce."}]}