{"@context": "http://schema.org", "@type": "Recipe", "name": "No-Bake Cookies", "description": "These classic no-bake peanut butter and chocolate treats are also known as cow patties or preacher cookies. The story goes like this: If a housewife looked out the window and saw the preacher coming up the mountain on his horse, she could whip up a batch of these cookies in the amount of time it would take him to reach the front door. True or not, it’s a good story — and a great cookie that’s a cinch to put together. Combine all the ingredients in a pot over medium heat, then drop spoonfuls on a sheet pan and chill until set. Be sure to use quick-cooking oats, not instant, when making these cookies. The less-processed oats provide delightful texture and chewiness.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2019/12/05/dining/ml-no-bake/merlin_165082842_fcfde09d-f764-4d12-b63d-3ec9e0a46e14-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "3 dozen cookies", "recipeCuisine": "american", "recipeCategory": "easy, quick, snack, cookies and bars", "keywords": "cocoa powder, oats, peanut butter, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 187}, "recipeIngredient": ["1 3/4 cups/350 grams granulated sugar", "1/2 cup/120 milliliters whole milk", "1/2 cup/115 grams unsalted butter (1 stick)", "1/3 cup/30 grams unsweetened cocoa powder", "1/2 teaspoon fine sea salt", "3 cups/280 grams quick-cooking oats", "2/3 cup/160 milliliters smooth or crunchy peanut butter (not natural)", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two large sheet pans with parchment paper. In a pot, combine the sugar, milk, butter, cocoa powder and salt. Bring ingredients to a rolling boil over medium heat, stirring constantly and being careful not to let the mixture burn, then cook until the cocoa powder and sugar have fully dissolved, about 1 minute. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the oats, peanut butter and vanilla. Stir until well combined, then let cool for about 15 minutes. Drop heaping tablespoonfuls onto the prepared sheet pans, gently pressing the center to flatten slightly. (You should have about 36 cookies.) Chill for a few hours until firm. Store in an airtight container at room temperature for up to 1 week."}], "link": "https://cooking.nytimes.com/recipes/1020688-no-bake-cookies"}