{"@context": "http://schema.org", "@type": "Recipe", "name": "Jamie Oliver’s Vegetarian Black Bean Burgers", "description": "Beans have been a staple in the human diet for more than 4,000 years, and in recent history, they’ve formed the foundation of countless vegetarian burgers. There are </span><a href=\"https://cooking.nytimes.com/recipes/1012989-white-bean-burgers\"><span>white bean burgers</span></a><span>, </span><a href=\"https://cooking.nytimes.com/recipes/1016668-the-ultimate-veggie-burger?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=8\"><span>kidney bean burgers</span></a><span> and a plethora of other </span><span><a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/16707-veggie-burgers\">veggie burgers</a>.</span> Most have two things in common: beans and binders. This version from the chef Jamie Oliver’s new book “Ultimate Veg” (Flatiron Books, 2020) combines black beans, rye bread, fresh mushrooms and ground coriander. Mr. Oliver tops his burgers with tangy yogurt, mangoes and salsa, but these crisp, oven-roasted patties are equally delicious with just lettuce and ketchup.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2020/01/22/dining/jo-black-bean-burgers/merlin_167531589_227b9414-ffad-4b44-ae53-67483bd2bae5-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, beans, burgers", "keywords": "black beans, bread, cheddar, coriander, mushroom, rye bread, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 350}, "recipeIngredient": ["1 1/2 red onions", "1/2 pound mixed fresh mushrooms", "3 1/2 ounces rye bread, torn into 1/2-inch pieces (about 2 1/2 cups)", "1 (15-ounce) can black beans, drained and roughly mashed with a fork", "1 teaspoon ground coriander, plus more for dusting", "Kosher salt and black pepper", "Olive oil, as needed", "2 ounces sharp Cheddar, grated (about 1 cup)", "4 large brioche rolls, potato rolls or burger buns", "4 ounces cherry tomatoes, chopped (about 1 cup)", "1 lime", "Chipotle hot sauce, as needed", "1 ripe mango", "1 ripe avocado", "1/4 cup plain yogurt", "4 fresh cilantro sprigs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Peel and roughly chop 1 onion, then place it in a food processor. Add the mushrooms and pulse until just finely chopped. (Be careful not to overprocess into a paste.) Transfer mixture to a large bowl and wipe out the bowl of the food processor. Add torn bread to the processor, pulse until it forms fine crumbs, then transfer crumbs to the mushroom mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add black beans and coriander, season well with salt and pepper, then mix together until thoroughly combined. Divide into 4 equal portions and shape into 1-inch-thick patties. Rub all over with oil and dust with ground coriander, then place on an oiled baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast patties until dark and crisp, 35 to 45 minutes. Sprinkle the burgers with the Cheddar. Let burgers cool slightly to firm up. While the burgers cool, transfer the buns to the hot oven and heat for a few minutes until toasted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, peel and very finely chop the remaining 1/2 onion. Transfer to a medium bowl. Add the tomatoes. Zest the lime on top, then halve the lime and squeeze lime juice on top, to taste. Add a few shakes of hot sauce and season with salt and pepper to taste. Pit, peel and finely slice the mango and avocado."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the yogurt on the bases of the rolls or buns, then top with half the salsa, the mango and the avocado. Add the burgers, the remaining salsa, extra Tabasco and cilantro leaves, then pop the lids on, press down lightly and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020827-jamie-olivers-vegetarian-black-bean-burgers"}