{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Roasted Duck With Mashed White Beans, Sizzled Herbs and Olives", "description": "Slow-roasting duck legs in the oven, uncovered, yields tender meat, similar to duck confit, and lovely crispy skin. Look for large moulard legs, available at some butcher shops and online. Here, they are served with savory mashed white beans. The beans are best cooked from scratch, but, if desired, they can be made a day or two in advance. A topping of sizzled rosemary, sage and olives brings it all together. It’s a delicious dish, though somewhat rich, so a simple salad of arugula or some steamed broccoli rabe are nice as side dishes.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/03/04/dining/28Tanisrex-duck/merlin_169404567_7c011438-ab70-49bc-9f6e-bebd787cf599-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, beans, poultry", "keywords": "duck leg, olives, rosemary, sage, white beans, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 40}, "recipeIngredient": ["1 pound dry white beans, such as cannellini", "1 large onion, peeled", "2 bay leaves", "2 whole cloves", "1 head garlic (not peeled)", "Kosher salt and black pepper", "6 large duck legs, trimmed and oven ready (about 12 to 14 ounces each)", "3 tablespoons extra-virgin olive oil", "Handful of sage leaves (from 1 small bunch)", "Handful of rosemary leaves (from 2 large sprigs)", "2 garlic cloves, minced", "Pinch of red-pepper flakes, to taste", "3/4 cup pitted green and black olives, halved or roughly chopped", "Arugula and lemon wedges, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the beans: Rinse beans and put them, along with the onion, bay leaves, cloves and garlic, in a large heavy-bottomed pot with a lid. Add enough water to cover by 2 inches and bring to a boil over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 teaspoons salt, reduce heat to low, and bring beans to a bare simmer. Cover, but leave lid ajar. Cook very slowly, adding water as needed, for about 1 1/2 hours, or until beans are soft. Taste broth and adjust seasoning. Remove onion, bay leaves, cloves and garlic, and discard. Let beans cool uncovered in the cooking liquid. (They may be cooked up to 2 days in advance and refrigerated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As beans cook, prepare the duck legs: Lay them on a cutting board skin-side up, and use a skewer or the tip of a knife to prick the skin of each leg all over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Season each leg generously on both sides with salt and pepper — don’t go crazy, but don’t be meek."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place legs in a roasting pan, in a single layer skin-side up. (Take care that the roasting pan is high-sided enough, as a fair amount of fat will be produced as legs cook.) Roast, uncovered, for 1 1/2 to 2 hours, until the meat is quite tender, nearly falling off the bone. At this point, check to see the skin is crisp and nicely browned.If not, raise oven temperature to 400 degrees, and roast for another 10 minutes, or perhaps more, until skin is crisped. Remove legs from roasting pan and keep warm. (An inch or more of liquid fat will have accumulated in the roasting pan. Let it cool a bit before pouring it into a jar for future use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring beans to a boil in a pot over medium-high heat. Pull them off the heat, and drain in a colander, reserving liquid. Put three-quarters of the beans in a mixing bowl and use a potato masher to mash them. (Alternatively, you can purée the beans in a food processor.) Add bean broth as needed to loosen the mixture to the consistency of soft mashed potatoes. Stir in the reserved whole beans. Adjust the seasoning. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare sizzled herbs: Add 3 tablespoons olive oil to a skillet over medium-high heat. When oil is hot, add sage and rosemary until they’re coated with oil. When all the sage leaves have wilted, keep stirring until the herbs begin to fry and crisp, 2 to 3 minutes. Turn heat to low, then swirl in the garlic and red-pepper flakes. Immediately add olives and warm through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, pair one duck leg with a spoonful of mashed beans. Spoon some of the olive mixture over the duck and beans. If desired, dress crisp green arugula with just a few drops of lemon juice and a little salt, and serve alongside for a refreshing counterpoint to the rich, salty duck and beans."}], "link": "https://cooking.nytimes.com/recipes/1020890-slow-roasted-duck-with-mashed-white-beans-sizzled-herbs-and-olives"}