{"@context": "http://schema.org", "@type": "Recipe", "name": "Salad-e Shirazi (Persian Cucumber, Tomato and Onion Salad)", "description": "Named for the city in southwestern Iran, salad-e Shirazi is found on practically every Iranian table at practically every meal. Think of it as an herbier, juicier, more acidic version of Greek salad, Israeli salad or Indian kachumber. It should be bright, crunchy and tart, a nice counterpoint to rich, buttery rice and unctuous stews. Toss the cucumbers, onion, herbs and tomatoes with the lime vinaigrette just before serving to preserve their crunch. In Iran, dining companions usually fight over the leftover juice at the end of a meal.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2019/05/14/dining/14Iranianrex8/merlin_154113735_00a90a0e-5bb6-4242-89e4-f4fe259545bd-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 to 8 servings (about 5 cups)", "recipeCuisine": "middle eastern", "recipeCategory": "salads and dressings, vegetables", "keywords": "cucumber, herbs, lime, red onion, tomato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 356}, "recipeIngredient": ["3 to 4 Persian cucumbers (about 3/4 pound)", "1/2 red onion, diced into 1/4-inch pieces", "2 tablespoons any combination of finely chopped fresh parsley, cilantro, basil or dill", "1 teaspoon dried mint", "2 to 3 medium tomatoes (about 1 pound)", "1/4 cup freshly squeezed lime juice (from about 2 limes), plus more as needed", "3 tablespoons extra-virgin olive oil", "Fine sea salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove alternating stripes of peel on cucumbers and trim ends. Dice cucumbers into 1/4-inch pieces and place in a large bowl with onion and fresh herbs. Using your fingers to break up any large pieces, gently grind the dried mint into the bowl. Remove tomato cores, dice remaining tomatoes into 1/4-inch pieces and add to bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, make a vinaigrette by whisking together 1/4 cup lime juice, oil, 3/4 teaspoon salt and 1/4 teaspoon pepper. Just before serving, dress vegetables with vinaigrette and stir to combine. Taste and adjust seasoning with salt and lime juice as needed. This salad should be bright, crunchy and tart, a nice counterpoint for rich, buttery rice and unctuous stews. Serve at room temperature or lightly chilled. Cover and refrigerate leftovers for up to 2 days."}], "link": "https://cooking.nytimes.com/recipes/1020212-salad-e-shirazi-persian-cucumber-tomato-and-onion-salad"}