{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggplant and Zucchini Pasta With Feta and Dill", "description": "This simple yet hearty weeknight pasta is packed with two whole pounds of vegetables. Meaty eggplant makes this vegetarian meal satisfying, while zucchini adds texture and a touch of natural sweetness. Since eggplant tends to absorb oil like a sponge, the key here is to sauté it slowly in a nonstick skillet until it softens and caramelizes without adding too much oil. The feta does double duty, adding bright tang to the dish and creating a creamy sauce. Fragrant dill is a natural pairing for eggplant and zucchini, but fresh parsley or basil would also be great.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2019/08/30/dining/kc-eggplant-zucchini-pasta/kc-eggplant-zucchini-pasta-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, quick, pastas, vegetables", "keywords": "dill, eggplant, feta, rigatoni, summer squash, zucchini, fall, summer, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 312}, "recipeIngredient": ["6 tablespoons extra-virgin olive oil", "1 pound eggplant (about 2 small eggplants), cut into 1-inch cubes (about 7 cups)", "Kosher salt and black pepper", "1 pound green zucchini or yellow squash, halved lengthwise and sliced into 1/4-inch-thick half-moons (about 5 cups)", "1 pound mezze rigatoni or any short pasta", "8 ounces crumbled feta (about 1 1/2 cups)", "1/4 cup chopped fresh dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons oil in a large nonstick skillet over medium heat. Add eggplant, season with salt and pepper and cook, stirring occasionally, until golden and tender, about 10 minutes. Transfer to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 tablespoons oil and zucchini to skillet and season with salt and pepper. Cook, stirring occasionally, until tender but not mushy, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the vegetables cook, boil the pasta in a pot of salted water until al dente. Reserve 1 1/2 cups cooking water and drain pasta. Return pasta and reserved cooking water to pot over medium heat. Add remaining 1 tablespoon oil and 1 cup of cheese and cook, stirring, until the cheese melts and forms a sauce, about 2 minutes. Stir in zucchini, eggplant and dill; season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve pasta in bowls and top with remaining cheese."}], "link": "https://cooking.nytimes.com/recipes/1020441-eggplant-and-zucchini-pasta-with-feta-and-dill"}