{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Artichokes With Anchovy Mayonnaise", "description": "You may see artichokes in the supermarket year-round, but in the spring, they are at their peak, freshly harvested and full of flavor. This is an easy method for roasted artichokes. After trimming and par-cooking them, they are drizzled with olive oil and roasted until crisp without and tender within. Serve them as a first course, or alongside a meaty piece of fish, such as monkfish, swordfish or halibut. The zesty, lemony anchovy mayonnaise is a perfect foil for the artichokes’ sweetness, and goes well with fish, too. You can use any size artichoke for this recipe, but medium is best.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/05/15/dining/10kitchen1/10kitchen1-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "lunch, vegetables", "keywords": "anchovy, artichoke, mayonnaise, appetizer, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 196}, "recipeIngredient": ["1 large lemon", "4 medium artichokes (about 2 pounds)", "Salt and pepper", "1 large bunch thyme sprigs", "Extra-virgin olive oil", "2 tablespoons roughly chopped parsley, for garnish", "1 cup mayonnaise, preferably <a href=\"https://cooking.nytimes.com/recipes/2650-basic-light-mayonnaise\">homemade</a>", "6 anchovy fillets, rinsed, blotted and finely chopped", "1 teaspoon capers, rinsed, blotted and finely chopped", "1/2 teaspoon grated lemon zest and 2 tablespoons juice (from 1 lemon)", "1/2 teaspoon grated garlic (from about 2 medium cloves)", "Pinch of ground cayenne", "Salt and pepper, to taste", "Lemon wedges (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the artichokes: Fill a large bowl with cold water. Cut the lemon into quarters, and squeeze the juice from each quarter into the water. (This acidulated water will keep the artichokes from discoloring.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Snap off a few of the tough outer leaves (bracts) near the stem of each artichoke. Cut each artichoke in half from top to bottom, and lay the halves cut-side down on a cutting board."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp vegetable peeler and working one half at a time, trim the rough edges and the stems. Cut 1/4 inch from the bottom of the stem and 1/2 inch from the top of each half. Turn the halves over and use a teaspoon or melon baller to remove the hairy “choke.” Place trimmed artichoke halves in the lemon water. Leave them in the lemon water until ready to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Bring a large pot of well-salted water to a boil. Add drained artichoke halves and simmer for 10 minutes. Remove and place artichoke halves cut-side up in a stainless steel roasting pan or ceramic baking dish, in one layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tuck thyme sprigs under artichokes, and sprinkle artichokes with salt and pepper. Drizzle generously with olive oil, about 1 1/2 teaspoons per halved artichoke. Bake, uncovered and brushing with oil from the pan occasionally, until nicely browned, 30 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As artichokes roast, make the anchovy mayonnaise: Put mayonnaise in a bowl and stir in chopped anchovies and capers, lemon zest and juice, garlic, cayenne and a little salt and pepper. Let sit for 5 minutes, then taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When artichokes are ready, transfer to a serving platter or individual plates. Brush lightly with oil from the pan. Sprinkle with parsley and serve anchovy mayonnaise and lemon wedges, if you like, on the side."}], "link": "https://cooking.nytimes.com/recipes/1020194-roasted-artichokes-with-anchovy-mayonnaise"}