{"@context": "http://schema.org", "@type": "Recipe", "name": "Somen Noodles With Poached Egg, Bok Choy and Mushrooms", "description": "The perfect salve for cold winter days, this vegetarian noodle soup can be cobbled together in an instant from the contents of a well-stocked kitchen. It takes its flavor from a quick bouillon using just four ingredients: soy sauce, sesame oil, scallions and shiitakes, which deliver a hefty, flavorful dose of glutamate. Poached eggs add richness to the clean and comforting broth. Fresh eggs have stronger, firmer albumen (egg whites) and will thus hold their shape better than older eggs, which have a tendency to unfurl. The main key to achieving that teardrop shape during poaching is allowing the eggs to simmer without disturbance until cooked.", "author": {"@type": "Person", "name": "Sue Li"}, "image": "https://static01.nyt.com/images/2019/02/22/dining/sl-somen-noodle-soup/merlin_150549918_35657d55-ee09-4a20-9a9f-467176c9e5fa-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "2 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, easy, for two, quick, weeknight, soups and stews", "keywords": "bok choy, noodles, scallion, sesame oil, shiitake, soy sauce, fall, spring, winter, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 273}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 400, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "4 grams", "proteinContent": "13 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1458 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons vegetable oil", "3 scallions, trimmed, whites and greens separated and thinly sliced", "8 ounces fresh shiitake mushrooms, stems discarded and caps thinly sliced (about 3 cups)", "Kosher salt", "1 medium bok choy (about 4 ounces), cut into bite-size pieces", "3 tablespoons soy sauce", "2 teaspoons toasted sesame oil, plus more for serving", "2 bundles (about 7 ounces total) somen noodles, or any thin wheat or rice noodles", "2 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large saucepan of water to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat vegetable oil in a pot over medium. Add scallion whites and sliced mushrooms, season with salt and cook until browned, stirring occasionally, 5 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 3 cups water to the pot and bring to a simmer over medium-high. Add bok choy and cook until crisp-tender, about 1 minute. Stir in soy sauce and 2 teaspoons sesame oil and season to taste with salt. Turn off heat and cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook somen according to package instructions in the simmering water in the saucepan. Using a slotted spoon or spider, divide the noodles among bowls, leaving the simmering water in the saucepan. Crack each egg into its own small bowl, discarding the shells. Swirl the simmering water in the saucepan, creating a vortex by stirring with a wooden spoon. Add the eggs, one right after another, and cook over medium-low until the whites are set, about 3 minutes. Transfer eggs to noodle bowls using a slotted spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the reserved shiitake broth into the bowls. Top with sliced scallion greens, drizzle with sesame oil and serve."}]}