{"@context": "http://schema.org", "@type": "Recipe", "name": "Madhur Jaffrey’s Pressure Cooker Dal (Dal Makkhani)", "description": "In many ways, the electric pressure cooker’s moist environment was <a href=\"https://www.nytimes.com/2018/10/05/dining/instant-pot-indian.html\">meant for Indian food</a>: It cooks dried beans quickly, sometimes without even a soak, and is conducive to saucier dishes like this dal. Adapted from “Madhur Jaffrey’s Instantly Indian Cookbook” (Knopf, 2019), this recipe is a relatively fast way to a rich, satisfying dish. You can make your own garam masala (see Tip), or simply use store-bought. Don’t skip the tarka: Thinly sliced onions are cooked in ghee until deep in color and then tossed with paprika and chile powder, adding a bright flavor that cuts through the rich dal. Serve it with Indian flatbreads, like naan, roti or parathas, though Ms. Jaffrey also recommends whole-wheat pita.", "author": {"@type": "Person", "name": "Krysten Chambrot"}, "image": "https://static01.nyt.com/images/2019/09/25/dining/kc-buttery-dal/merlin_161002911_021cc13f-b34d-4748-a06a-4026265dea68-articleLarge.jpg", "totalTime": "PT9H15M", "recipeYield": "6 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, beans, soups and stews", "keywords": "garam masala, ginger, heavy cream, red kidney beans, tomatoes, urad, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 190}, "recipeIngredient": ["1 cup whole urad with skin (sabut ma)", "1/2 cup dried red kidney beans (rajma)", "1 cup puréed or strained tomatoes, or passata", "1 (2-inch) piece fresh ginger, peeled and grated (about 4 teaspoons)", "1 large garlic clove, crushed", "1/4 to 1/2 teaspoon chile powder, such as ground cayenne, to taste", "Kosher salt", "1/2 cup heavy cream", "1 teaspoon garam masala (see Tip)", "1 tablespoon unsalted butter, plus more as needed", "2 tablespoons peanut oil or ghee", "1/2 small onion, halved lengthwise and thinly sliced", "1/4 teaspoon ground paprika", "1/4 teaspoon chile powder, such as ground cayenne"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the beans: Wash urad and beans, and soak them overnight at room temperature, in water that covers them generously. Drain them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the beans into an electric pressure cooker. Add tomatoes, ginger, garlic, chile powder, 1 teaspoon salt and 4 cups water. Close and seal the lid, then set to cook on high pressure for 30 minutes, before letting the pressure release naturally. (If pressure still hasn’t released naturally after 15 minutes, quick-release the pressure.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As pressure releases, prepare the tarka: Put the oil or ghee in a small frying pan over medium heat. When hot, arrange the onions in a single layer. Stir and fry them, turning now and then, until they turn reddish gold and crisp, 5 to 7 minutes. Sprinkle with paprika and chile powder, and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the pressure has released, hit cancel to reset the pressure cooker. Open the lid carefully, venting the steam away from you. Stir the dal. Using a potato masher, crush the dal as much as you can. Taste, adding salt as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Select the sauté setting, and set to normal. Add the cream, garam masala and 1 tablespoon butter, and stir until dal reaches desired consistency. Transfer dal to a serving dish and add another dollop of butter on top. Top with tarka."}], "link": "https://cooking.nytimes.com/recipes/1020469-madhur-jaffreys-pressure-cooker-dal-dal-makkhani"}