{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Miso Chicken With Radishes and Lime", "description": "This vibrant dish is adapted from “Keeping It Simple” (Hardie Grant, 2020), a book of weeknight recipes by the food writer Yasmin Fahr. Miso and ghee are tossed with radishes and rubbed underneath the skin of chicken thighs before both are roasted on the same sheet pan. Fresh scallions, sesame seeds and lime juice provide a bright finish. If you don’t have ghee, regular unsalted butter will do just fine. And if you’ve never had roasted radishes, you’re in for a treat: High heat eliminates the vegetable’s bitterness, coaxes out its sweetness and leaves the lovely pink color behind.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2020/09/27/dining/20cookbookrex4/merlin_171384615_f5635e5e-6c32-4c35-962a-8782cc72f547-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weeknight, one pot, poultry, vegetables, main course", "keywords": "chicken, chicken thigh, ghee, miso, radish, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1107}, "recipeIngredient": ["4 bone-in, skin-on chicken thighs (about 1 1/2 pounds total)", "2 tablespoons olive oil", "Kosher salt and black pepper", "1 tablespoon ghee or unsalted butter, at room temperature", "1 1/2 teaspoons white miso paste", "1 pound trimmed radishes, halved, if large", "1 lime, cut in half", "2 scallions, light green and white parts only, thinly sliced", "Black or white sesame seeds, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Place one rack in the middle of the oven and another about 6 inches from the broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a large baking sheet, drizzle the chicken all over with 1 tablespoon oil, then season all over with salt and pepper. In a medium bowl, mash together the ghee and miso until combined. Lift up the skin on one chicken thigh, carefully creating a space between the skin and meat, and place about 1/2 teaspoon miso-ghee mixture inside. Close the pocket, then lightly press on top of the skin to spread it around. Repeat with remaining chicken thighs, adding 1/2 teaspoon miso-ghee mixture to each. Massage another 1 1/2 teaspoons mixture all over the chicken, leaving about 1 teaspoon miso-ghee mixture remaining in the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the chicken skin-side up, evenly spaced apart, and roast on the middle rack for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same mixing bowl, toss the radishes with the remaining miso-ghee mixture and the remaining 1 tablespoon oil. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the chicken has roasted for 15 minutes, scatter the radishes around the chicken and cook until radishes are tender and lightly browned and chicken is cooked through (the temperature in the thickest part of the thigh should reach 165 degrees), another 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the chicken skin is not as browned as you’d like, broil on the rack near the broiler until the skin is crispy and golden, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze the lime juice over chicken and radishes, then garnish with the scallions and sesame seeds, if using. Divide among plates and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1020988-sheet-pan-miso-chicken-with-radishes-and-lime"}