{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Eggs With Crème Fraîche and Smoked Salmon", "description": "Runny-yolked eggs baked in individual ramekins or custard cups make for a very elegant brunch or light supper. These are bathed in a shallot-steeped crème fraîche and topped with smoked salmon for an especially rich result. Serve them with toast, croissants or crusty bread — something to mop up the last bits of yolk and cream at the bottom of the ramekins. You won’t want to leave behind a single drop.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/12/25/dining/20apperex1/merlin_166142583_57e01a37-7d9c-440f-b06f-61d9a5946db9-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, seafood", "keywords": "crème fraîche, egg, heavy cream, salmon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 182}, "recipeIngredient": ["2 tablespoons unsalted butter, plus more for greasing the ramekins", "2/3 cup thinly sliced shallot (2 to 3 shallots)", "1/2 teaspoon fine sea salt", "3/4 cup heavy cream", "1/3 cup crème fraîche", "1 tablespoon chopped fresh dill, plus more for serving", "1/2 teaspoon finely grated lemon zest", "12 large eggs, at room temperature", "Freshly ground black pepper", "4 ounces smoked salmon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees, and brush six 8-ounce ramekins or ovenproof custard cups with butter. Place the ramekins or cups on a rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 2 tablespoons butter in a medium skillet over medium heat. Stir in shallots and 1/4 teaspoon salt, and cook until very soft, 7 to 10 minutes, reducing heat if necessary to prevent browning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in 6 tablespoons cream, the crème fraîche, dill, lemon zest and remaining 1/4 teaspoon. Remove from heat. Divide mixture among the ramekins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crack 2 eggs into each ramekin and float 1 tablespoon of cream on top of each, then sprinkle tops with salt and pepper. Bake until egg whites are just set, and yolk is still runny, 12 to 16 minutes. (The eggs will look slightly puffed at the sides of the ramekins, but still jiggly in the center and that’s O.K. The eggs will continue to cook once out of the oven.) Remove from oven and transfer ramekins onto individual plates for serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, top each ramekin with some of the smoked salmon and a little more dill. Serve warm."}], "link": "https://cooking.nytimes.com/recipes/1020722-baked-eggs-with-creme-fraiche-and-smoked-salmon"}