{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Roasted Oregano Chicken With Buttered Tomatoes", "description": "There are about a million ways to roast a chicken, and people will always tell you that theirs is the best way. Here is the truth: If you smear a good, high-quality chicken with enough fat, season it with plenty of salt and roast it until the skin is brown, it will always be excellent. But it’s slow-roasting that gives you golden skin, tender meat and plenty of salty, savory chicken juices to serve as a sauce. From the simple assortment of ingredients to the ridiculously hands-off preparation, this recipe from Alison Roman's cookbook \"Nothing Fancy\" (Clarkson Potter, 2019) is casual in a way that feels almost lazy (but isn’t), with make-sounds-after-you-take-a-bite levels of deliciousness. To truly put it over the edge, add a few anchovies to the tomatoes.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/10/09/dining/07Romanrex3/07Romanrex3-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry", "keywords": "chicken, oregano, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 423}, "recipeIngredient": ["1 (3 1/2- to 4-pound) whole chicken", "Kosher salt and freshly ground black pepper", "1/4 cup olive oil", "1 1/2 tablespoons fennel seeds, crushed in a mortar and pestle or spice mill, or chopped with a knife", "1 bunch fresh oregano", "1 1/2 pounds small vine-ripened tomatoes (about 6), halved lengthwise", "2 heads of garlic, halved crosswise (it's fine to leave the skin on)", "2 tablespoons unsalted butter, cut into pieces", "2 tablespoons red wine vinegar or white wine vinegar", "4 to 6 (1-inch-thick) slices of good country bread, such as country loaf or sourdough, toasted (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees. Season the chicken with salt and pepper. (If you can do this in advance, please do.) Drizzle it with the olive oil and sprinkle with the fennel seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stuff the cavity with half the oregano and place in a large baking dish. Scatter the tomatoes, garlic, butter and remaining oregano around the chicken. Roast until the chicken is golden brown and completely cooked through, and the tomatoes are nice and jammy, 2 1/2 to 3 hours. Add the vinegar to the tomatoes and let the chicken rest in the baking dish for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place toast, if using, on serving platter and spoon the jammy tomatoes over or around the toast. Carve the chicken and place on top of the toast to catch the juices."}], "link": "https://cooking.nytimes.com/recipes/1020519-slow-roasted-oregano-chicken-with-buttered-tomatoes"}