{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Refried Beans With Avocado and Radish", "description": "This hearty vegetarian mash-up of burritos and seven-layer dip is a crowd favorite for good reason: It’s easy, it’s fast and it encourages diners to gather around the table and fill their tortillas however they wish. Canned refried beans seasoned with a dash of cayenne are heated through on the stovetop, then topped with a generous sprinkling of cheese. Before serving, lots of cool, crunchy toppings like avocado, grated Cotija cheese, snap peas, radishes and romaine lettuce are piled on top. The toppings make it feel like a proper meal, though you could serve it with tortilla chips as a snack or with eggs for brunch.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/03/18/dining/sc-skillet-refried-beans-with-avocado/merlin_151400892_f50a092d-62f7-4c78-9c2b-df27aa0a9f8b-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american, mexican", "recipeCategory": "dinner, easy, lunch, weekday, beans", "keywords": "avocado, cheese, cilantro, refried beans, tortilla, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 258}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 307, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "10 grams", "proteinContent": "17 grams", "saturatedFatContent": "7 grams", "sodiumContent": "817 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 (15-ounce) cans vegetarian refried beans (pinto or black bean)", "1/2 to 1 teaspoon ground cayenne, to taste", "1 heaping cup finely shredded Oaxacan-style cheese, Monterey Jack, Cheddar or a blend (6 ounces)", "Flour or corn tortillas, for serving", "1 firm ripe avocado, sliced", "3 small or 1 large radish, thinly sliced", "3 scallions, thinly sliced on the bias", "1 cup sliced snap peas or shredded romaine lettuce", "1/4 cup grated Cotija, queso fresco or other crumbly Mexican cheese, or ricotta salata", "1/4 bunch cilantro leaves and tender stems", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat an 8-inch skillet over medium-high. Combine the beans, 1/2 cup water and ground cayenne in the skillet and whisk until smooth. Reduce heat to low and cook until warmed through and just starting to bubble. Sprinkle the Oaxacan-style cheese on top and warm until melted, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the tortillas one-by-one over an open flame (or in a hot skillet, if you don’t have a gas stove). Wrap them tightly in a clean kitchen towel, stacking and rewrapping as you go to keep them warm as you heat each one."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the beans from the heat and garnish with the avocado, radish, scallions and snap peas in even layers. Sprinkle with grated Cotija and cilantro. Serve with warm tortillas and lime wedges for squeezing over the tacos."}], "link": "https://cooking.nytimes.com/recipes/1020106-skillet-refried-beans-with-avocado-and-radish"}