{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Pudding With Blackberries and Peaches", "description": "Constructed from layers of soft, spongy sliced bread and tons of juicy, just-cooked fruit, this British dessert gets an update with a layer of barely sweetened whipped cream. It is the best thing since, well, sliced bread. Think of it as somewhere between a layer cake (where you don’t have to bake any cake) and a tiramisù (where the coffee and chocolate is replaced by burst berries and juicy peaches). While the assembly should be a relaxed, messy affair, just be sure to adequately soak the bread so it reads as custardy, not dry.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/08/14/dining/13Romanrex5/13Romanrex5-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 to 12 servings", "recipeCuisine": "british", "recipeCategory": "custards and puddings", "keywords": "blackberries, brioche, nectarine, peaches, pullman bread, raspberries, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 271}, "recipeIngredient": ["2 pounds/900 grams peaches or nectarines (about 5), pitted and sliced 1-inch thick", "2/3 cup/140 grams granulated sugar, plus more for serving", "1 tablespoon finely grated ginger (optional)", "1 1/2 pounds/680 grams blackberries or raspberries, plus an extra handful for garnish", "2 cups/480 milliliters heavy cream", "1/4 cup/35 grams confectioners’ sugar", "1 cup/240 grams labneh, mascarpone or full-fat Greek yogurt", "1 loaf brioche, pain de mie or Pullman bread (about 1 1/4 pounds), crusts removed, bread sliced 1-inch thick", "Pinch of kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine peaches, 1/3 cup sugar and the ginger, if using, in a medium pot over medium heat. Bring to a simmer and cook, swirling occasionally, until the peaches have started to release their juices (but are not falling apart into mush), 8 to 10 minutes. Remove from heat and transfer to a medium bowl; set aside to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Without rinsing out the pot (there’s no need), combine the berries and remaining 1/3 cup sugar. Bring to a simmer and cook, swirling occasionally, until the berries have started to release their juices (but are not falling apart into mush), 8 to 10 minutes. Remove from heat and transfer to a medium bowl, separate from the peaches; set aside to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, using an electric mixer or a whisk, beat cream and confectioners’ sugar until spreadable, pillowy, medium peaks form, 3 to 4 minutes. Whisk in labneh until well blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 9-inch springform cake pan with plastic wrap so that there is ample overhang. (A regular cake pan will also work; just make sure it has high sides or you might need to make the pudding in two vessels.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one layer of sliced bread on the bottom. Cut the bread to fit as needed to make sure there is an even layer with no obvious gaps (aesthetics don’t matter here, as it’ll be covered up)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon 1/3 of the berry juices onto the bread to thoroughly soak, followed by half of the berries themselves. Spoon 1/3 of the peach juices onto the bread and berries, followed by half of the peaches themselves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread 1/3 of the cream mixture onto the fruit and top with another layer of bread, making sure to fill any obvious gaps with bread that’s cut to fit. Top bread with another 1/3 of the berry juices and all of the remaining berries, followed by 1/3 of the peach juices and all of the remaining peaches. Top with 1/3 of the cream mixture, setting the remaining cream mixture aside in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place another layer of bread on top, making sure to fill any obvious gaps, especially around the edges, with bread that’s cut to fit. Spoon remaining 1/3 of the blackberry and peach juices on top, making sure to stain the entire surface. Place a piece of plastic wrap on top and then place a plate on top of the plastic. Rest a heavy can (or another medium-sized, relatively heavy, food-safe object) on top to lightly compress the whole shebang. Refrigerate for at least four hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to serve, crush a handful of berries with a sprinkling of sugar; let sit for a few minutes. Remove springform sides and plastic wrap. (If using a regular cake pan, lift the pudding out by the excess plastic and transfer the entire pudding to a plate, platter or cake stand, removing plastic wrap.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the remaining heavy cream mixture and top the pudding, swirling in the crushed berries to create streaks and swirls. Slice (or spoon) the pudding and serve. Pudding can be assembled three days ahead, stored tightly wrapped and refrigerated."}], "link": "https://cooking.nytimes.com/recipes/1020394-summer-pudding-with-blackberries-and-peaches"}