{"@context": "http://schema.org", "@type": "Recipe", "name": "Sous-Vide Cheesy Mashed Potatoes", "description": "Savory Cheddar and Parmesan, along with sour cream for tang, are the keys to this rich, flavorful mash. If you have a vacuum sealer, you can use it to seal the potatoes into their sous-vide bags before cooking; this makes them easier to weigh down so they stay submerged. Once the potatoes are done, you can also keep them warm alongside the <a href=\"https://cooking.nytimes.com/recipes/1020597-sous-vide-turkey-breast-with-maple-and-rosemary\">sous-vide turkey breast</a>, if you’re making it: 145 degrees, the temperature at which the turkey breast is cooked, is the perfect temperature to hold the potatoes. If you don’t have a sous-vide machine, you can boil the potatoes in salted water until tender, then drain and mash them, and proceed with Step 2. You might not need the milk since boiled potatoes will have a higher moisture content than those cooked by sous vide.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/11/13/dining/08sousviderex2/merlin_163923624_ce92a852-c56a-4680-abfa-65f68eea01f8-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "vegetables", "keywords": "cheddar, parmesan, potato, sour cream, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 27}, "recipeIngredient": ["4 pounds Yukon Gold potatoes, peeled and thinly sliced", "1 1/2 teaspoons kosher salt, plus more as needed", "7 tablespoons unsalted butter, cubed and at room temperature", "12 ounces mild Cheddar, coarsely grated (3 cups)", "2/3 cup sour cream, at room temperature", "1/2 cup grated Parmesan", "1/2 teaspoon freshly ground black pepper", "1/4 teaspoon freshly grated nutmeg", "1/4 cup hot milk, plus more as needed", "1/2 cup chopped chives (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot or heatproof container, use a sous-vide machine to heat water to 194 degrees. Evenly divide potatoes and 1 1/2 teaspoons salt between two large reusable silicone sous-vide bags or resealable plastic bags. Slowly lower the bag into the water, allowing any air to escape. Weigh down the bags; an upside-down metal steamer basket or a metal bowl work well for this, topped with a metal spoon or tongs for extra weight, if needed. Cook until potatoes are completely tender, poking them several times to make sure, 1 1/2 to 2 hours. (Check the bag after 15 minutes; you may have to let out some steam.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As potatoes cook, add butter, Cheddar, sour cream, Parmesan, pepper and nutmeg to a large bowl. Add the hot potatoes and milk, and mash until the cheese melts and the mixture is as smooth as you like it, adding more hot milk if the potatoes seem dry. You can also use a potato ricer to rice the potatoes into the bowl before mixing with the cheese. Just make sure the potatoes and milk are hot, or the cheese might not melt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste and add more salt, if you like. Serve immediately, or transfer potatoes back to sous-vide bag to keep warm. Fold in chives just before serving."}]}