{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Brie With Quick Cranberry Jam", "description": "Likely to be a hit at any party, this recipe updates the classic brie en croute with a sweet and savory cranberry jam that’s simple to put together. The trick here is to trim the dough as you wrap the brie: Too many layers of overlapping dough and the pastry won’t cook through. This is an excellent make-ahead appetizer since the puff pastry-wrapped brie can be assembled up to a day in advance and stored in the refrigerator. Brush the exterior with egg wash just before baking, for best results, and serve warm.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2019/11/15/dining/lh-baked-brie/merlin_164331324_42a115ee-58e2-49d6-96b4-5196d5171f7b-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "finger foods, pastries", "keywords": "appetizer, brie, cheese, cranberry, honey, orange juice, pistachio, puff pastry, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 285}, "recipeIngredient": ["1 tablespoon unsalted butter", "1/2 cup thinly sliced shallots (about 2 shallots)", "1 cup whole fresh cranberries or frozen cranberries", "1 teaspoon freshly grated orange zest and 1/4 cup freshly squeezed orange juice (from about 1 orange)", "3 tablespoons granulated sugar", "Pinch of kosher salt", "1 sheet puff pastry (about 8 ounces), defrosted and chilled", "1 (8-ounce) wheel of brie", "1 large <strong></strong>egg", "Honey, for serving (optional)", "Finely chopped pistachios, for serving (optional)", "Baguette slices or crackers, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, melt the butter over medium-low heat. Add the shallots and cook, stirring occasionally, until tender and lightly caramelized, 4 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cranberries, orange juice, sugar and salt, then stir and bring to a boil over medium heat. Reduce heat to low and simmer for 10 to 15 minutes, stirring occasionally, until the mixture is very thick and the liquid in the pan has completely evaporated. Stir in the orange zest and transfer to a small bowl to cool completely. (The jam may be made up to 1 day in advance. Store it in an airtight container in the refrigerator until ready to use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to bake the brie, heat the oven to 400 degrees. Working quickly, unfold the sheet of puff pastry on a lightly floured piece of parchment. Using a lightly floured rolling pin, roll it out to an 11-by-11-inch square (the pastry should be about 1/8-inch thick). Place the brie in the center of the pastry. Use a paring knife, and leaving a 3 to 3 1/2-inch border, trim the pastry to form a circle around the brie. Discard the scraps or save them for another use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the reserved cranberry jam on top of the brie, spreading it into an even layer about 1/4-inch thick. (You might not use all the jam.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, beat the egg with 1 tablespoon water. Brush the pastry border lightly with egg wash, then lift the puff pastry to wrap the brie snugly, one side at a time, trimming the pastry so you don’t have too many overlapping layers. Press all sides of the brie firmly, making sure to tightly seal any seams in the pastry with your hands. Transfer the puff-pastry wrapped brie and the parchment to a sheet pan. At this point, if the pastry has warmed up considerably, place the brie in the freezer for 10 minutes to chill slightly before baking. (You can assemble the brie up to this point and refrigerate for up to 24 hours before brushing on the egg wash and baking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the whole exterior of the pastry generously with egg wash, then bake until the pastry has puffed and is golden brown, 25 to 35 minutes, rotating the pan halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle the brie with honey and sprinkle with pistachios, if using. Allow to cool for about 15 to 20 minutes before cutting into it, so the cheese has time to firm up slightly. Serve warm with baguette slices or crackers."}], "link": "https://cooking.nytimes.com/recipes/1020635-baked-brie-with-quick-cranberry-jam"}