{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Chip-Chocolate Chip Cookies", "description": "A mix of salty potato chips and chocolate chips gives these shortbread cookies a playful, sweet and savory appeal. Adapted from Shauna Sever’s cookbook, “Midwest Made,” these cookies taste best one day after baking, when the flavors have had a chance to meld. They will last for 3 to 4 days stored airtight at room temperature. Bring them to your next bake sale and watch them sell out in a flash. If you don’t have European-style cultured butter on hand, regular unsalted butter will also work.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/12/04/dining/03bakingbookrex1/merlin_164785287_d20b82ca-eb3f-48ac-8b8e-3a0a1e0576b0-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 dozen cookies", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars", "keywords": "chocolate chips, european-style cultured butter, potato chips, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 215}, "recipeIngredient": ["8 ounces/225 grams unsalted European-style cultured butter, at room temperature", "1 teaspoon vanilla extract", "1/4 teaspoon fine sea salt", "1/2 (packed) cup/110 grams light brown sugar", "1/4 cup/30 grams confectioners’ sugar", "2 cups/255 grams unbleached all-purpose flour", "2 cups/190 grams finely crushed thin potato chips, such as Lay’s Classic", "1 cup/175 grams semisweet chocolate chips", "1 large egg", "A few pinches granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a rack in the center of the oven and heat to 375 degrees. Line 2 baking sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the paddle attachment, beat butter, vanilla and salt on medium-high speed until creamy, about 1 minute. Add brown sugar and confectioners’ sugar and beat until fluffy, about 2 minutes more. Scrape down sides of the bowl with a rubber spatula, then add flour. Mix on low speed until a smooth dough forms. Add 1 cup/95 grams crushed potato chips and all the chocolate chips, then beat until blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a work surface, spread about half the remaining crushed potato chips out into a 10-by-12-inch rectangle. Turn dough out onto chips and pat it somewhat flat. Cover surface of dough with parchment paper or plastic wrap. Using a rolling pin, roll dough into a 7-by-11-inch rectangle (about 1/2-inch thick). Remove parchment or plastic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, beat egg, granulated sugar and 1 tablespoon water until very smooth. Lightly brush surface of dough with egg wash, then sprinkle evenly with remaining crushed potato chips. Roll the rolling pin over the top of dough to encourage chips to adhere. Use a bench scraper or knife to cut dough into 4 dozen 1 1/4-inch-square cookies. Transfer cookies with bench scraper or small offset spatula to the prepared baking sheets, spacing them about 1 1/2 inches apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 1 sheet of cookies at a time until set and golden, about 15 minutes. Let cookies cool for 3 minutes on the baking sheets before transferring them to a wire rack to cool completely. They will crisp up as they cool."}]}