{"@context": "http://schema.org", "@type": "Recipe", "name": "Pistachio Green Mole (Mole Verde de Pistache)", "description": "Many Mexican moles require hours of cooking and a laundry list of ingredients, but this green mole does not. This vibrant vegan version is made with herbs, baby spinach and pistachios, and the sauce comes together in about 30 minutes. This recipe calls for zucchini or summer squash, but feel free to swap in another roasted vegetable, depending on the season. The chef Enrique Olvera included it in his “Tu Casa Mi Casa” cookbook to show how fresh and seasonal a mole can be.", "author": {"@type": "Person", "name": "Sara Bonisteel"}, "image": "https://static01.nyt.com/images/2019/04/08/dining/sb-pistachio-mole/sb-pistachio-mole-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 to 6 servings", "recipeCuisine": "mexican", "recipeCategory": "tacos, vegetables", "keywords": "cilantro, pistachio, poblano chile, squash, tomatillo, zucchini, fall, spring, summer, gluten-free, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 143}, "recipeIngredient": ["3 to 4 zucchini or any variety of summer squashes, cut into 1-inch pieces", "Extra-virgin olive oil, for drizzling", "Kosher salt and black pepper", "4 tablespoons grapeseed oil", "1/4 small white onion, roughly chopped", "1 small garlic clove, sliced", "1 poblano chile, sliced", "1 güero chile, banana pepper or New Mexico yellow chile, sliced", "1 cup finely diced tomatillos", "1 cup roasted shelled pistachios", "1 cup fresh cilantro leaves", "2 fresh or dried hoja santa leaves", "1/2 cup baby spinach", "1 cup assorted greens, such as cilantro leaves, amaranth leaves or purslane", "2 cups cooked white rice", "Corn tortillas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Place the squash on a baking sheet. Drizzle with olive oil, season with salt and pepper and toss to coat. Roast until lightly brown, about 15 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the mole: In a pot, heat the grapeseed oil over medium heat. Add the onion and garlic and cook, stirring occasionally, until translucent, about 5 minutes. Add the chiles and cook, stirring occasionally, until soft, about 5 minutes. Add the tomatillos and cook, stirring occasionally, until soft, 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2/3 cup water and the pistachios and simmer for 5 minutes. Remove from the heat and transfer to a blender along with the cilantro, hoja santa and spinach. Blend until smooth, about 3 minutes. Season with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the mole warm, with the roasted zucchini. Top with greens and serve rice and tortillas alongside."}]}