{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetarian Meatballs", "description": "Seasoned with Parmesan, ricotta, fennel seeds and oregano, these meat-free Italian meatballs capture all the flavors of the classic. Cremini mushrooms and chickpeas mimic the texture of ground beef, bulgur helps bind the mixture together, and ricotta keeps it tender. The balls are rolled in a light coating of bread crumbs and Parmesan that crisps as it bakes, but if you prefer a saucy meatball, skip the coating and simply bake until firm, then simmer in marinara. Any extra coating mixture can be toasted in the oven and sprinkled over roasted veggies or creamy pastas. Leftover meatballs can be frozen and reheated in a 425-degree oven until warmed through, about 15 minutes.", "author": {"@type": "Person", "name": ""}, "image": "https://static01.nyt.com/images/2020/02/13/dining/kc-vegetarian-meatballs/kc-vegetarian-meatballs-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "24 meatballs", "recipeCuisine": "american", "recipeCategory": "dinner, snack, finger foods, meatballs, vegetables", "keywords": "appetizer, main course, side dish, bread crumbs, bulgur, chickpea, cremini, marinara sauce, mushroom, parmesan, ricotta, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "recipeIngredient": ["2 tablespoons bulgur wheat", "1/4 cup extra-virgin olive oil", "1/2 cup plus 1/3 cup seasoned Italian bread crumbs", "1/2 cup grated Parmesan cheese (about 2 ounces)", "2 garlic cloves, peeled", "4 medium cremini mushrooms, stemmed and quartered", "1 (15-ounce) can chickpeas, rinsed and drained (about 1 1/2 cups)", "1 large egg", "1/4 cup ricotta (about 2 ounces)", "1 teaspoon fennel seeds", "1 teaspoon dried oregano", "1/2 teaspoon kosher salt", "1/2 teaspoon black pepper", "1 cup marinara sauce, warmed, for dipping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Bring 1/4 cup water to a boil in a small saucepan. Add the bulgur, remove from heat, cover and let sit until tender, about 15 minutes. Drain, pressing to remove excess water, then let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the coating: In a shallow bowl, combine the oil, 1/2 cup bread crumbs and 1/4 cup Parmesan; mix until well blended and crumbly. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the meatballs: In a food processor, pulse garlic until finely chopped. Add mushrooms, and pulse until chopped, with pea-size pieces remaining (do not purée). Transfer to a large bowl. Add the chickpeas to the food processor, pulse, then add them to the mushrooms. Add the remaining 1/3 cup breadcrumbs and 1/4 cup Parmesan, plus the bulgur, egg, ricotta, fennel seeds, oregano, salt, pepper and 1 tablespoon water; mix until well blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form the meatball mixture into 1 1/2-inch meatballs (you should have about 24). Roll meatballs in the coating, pressing gently to adhere, then arrange on a greased baking sheet. Bake, turning halfway through, until golden, 18 to 20 minutes. Serve with marinara sauce, for dipping."}], "link": "https://cooking.nytimes.com/recipes/1020852-vegetarian-meatballs"}