{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Cauliflower Pasta With Pecorino Bread Crumbs", "description": "Equal parts cauliflower and pasta, this one-skillet dinner is a vegetable-forward version of macaroni and cheese. A whole head of cauliflower browns and caramelizes in a skillet before being simmered with heavy cream, pecorino cheese and a bit of lemon zest, breaking down into a special (and yes, decadent) sauce to coat the pasta shape of your choosing. For those looking to make it their own, this pasta could absolutely handle a bit of chopped bacon sautéed with the cauliflower, or handfuls of leafy greens tossed in at the end to wilt. Whatever you do, do not skip the bread crumbs — they are a not-so-stealthy vehicle for more cheese, and also add much-needed texture to the finished dish.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/04/17/dining/15romanrex/15romanrex-mediumThreeByTwo440.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, pastas", "keywords": "bread crumbs, cauliflower, pasta, pecorino, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1723}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 775, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "8 grams", "proteinContent": "20 grams", "saturatedFatContent": "20 grams", "sodiumContent": "976 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["Kosher salt and black pepper", "8 ounces rigatoni, ziti or campanelle", "6 tablespoons olive oil", "3/4 cup fresh coarse or panko bread crumbs", "1/2 cup finely grated pecorino cheese, plus more for serving", "1 large shallot, finely chopped", "1 medium head cauliflower (about 2 pounds), outer leaves and stem removed, sliced about 1/2-inch thick (it’s O.K. if it crumbles)", "1 cup heavy cream", "1 tablespoon finely grated lemon zest, plus more for serving", "1/2 cup finely chopped chives", "Red-pepper flakes (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pasta pot filled with salted water to a boil. Cook the pasta until al dente; drain and reserve about 1 cup of the cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 3 tablespoons olive oil in a large skillet over medium heat. Add bread crumbs and season with salt and pepper. Cook, stirring occasionally, until they’re evenly toasted and golden brown, 4 to 6 minutes. Add 1/4 cup pecorino and toss to coat, letting the cheese melt and clump among the bread crumbs (think granola-like clusters). Remove from heat and transfer to a small bowl or plate; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the skillet and heat remaining 3 tablespoons oil over medium heat. Add shallot and cauliflower and season with salt and plenty of black pepper. Cook, tossing occasionally, until the cauliflower has completely softened and both the cauliflower and shallots are beginning to caramelize and brown, 12 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add heavy cream and 1 tablespoon lemon zest and bring to a simmer, then let the cream reduce and thicken, 2 to 4 minutes. Season with salt and plenty of pepper; if pasta is still cooking, remove from heat and set aside until pasta is ready."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the skillet to medium heat and add the pasta to the cauliflower, along with the remaining 1/4 cup pecorino and 3/4 cup of the pasta water. Cook, tossing to coat the pasta and thicken the sauce until it’s thick and glossy, and almost resembles macaroni and cheese, adding more pasta water by the tablespoon as needed, 4 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat. Divide pasta among bowls and top with pecorino bread crumbs, chives, more lemon zest, red-pepper flakes (if using) and more cheese if you like."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Alison Roman’s Cauliflower Pasta", "description": "Learn to make creamy cauliflower pasta with pecorino bread crumbs from the recipe’s creator, Alison Roman.", "thumbnailUrl": "https://static01.nyt.com/images/2019/04/17/dining/15romanrex/15romanrex-mediumThreeByTwo440.jpg", "uploadDate": "2019-04-18T21:30:48.000Z", "duration": "PT10M"}, "link": "https://cooking.nytimes.com/recipes/1020173-creamy-cauliflower-pasta-with-pecorino-bread-crumbs"}