{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Lentil Soup With Sausage", "description": "An electric pressure cooker makes quick work of this Italian-style lentil soup, which tastes like it has simmered away on the stovetop for hours. (If time is on your side, g<span>et the slow cooker version of this recipe </span><a href=\"https://cooking.nytimes.com/recipes/1019697-slow-cooker-lentil-soup-with-sausage-and-greens\">here</a><span>.) </span>You could use any brown or black lentils, but beluga lentils are ideal because they get creamy on the inside while retaining their shape. (Other lentils may fall apart, but the soup will be no less delicious.) Determine your leafy green selection by what the market has to offer, keeping in mind that heartier types will retain more bite. Finish the soup with a hit of red-wine vinegar and a sprinkle of fresh basil for bright, fresh flavor.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/03/05/dining/sd-pressure-cooker-lentil-soup/sd-pressure-cooker-lentil-soup-articleLarge-v2.jpg", "totalTime": "PT50M", "recipeYield": "6 servings", "recipeCuisine": "american, italian", "recipeCategory": "dinner, lunch, weekday, soups and stews", "keywords": "Garlic Powder, Italian Sausage, Lentil, Onion Powder, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 694}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 594, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "11 grams", "proteinContent": "38 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1438 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["Olive oil", "1 large red or yellow onion, chopped", "Kosher salt and black pepper", "1 pound hot or sweet Italian sausage (pork, chicken or turkey), casing removed", "6 garlic cloves, chopped", "1 teaspoon onion powder", "1 teaspoon garlic powder", "3 fresh thyme sprigs or 1 teaspoon dried thyme", "2 tablespoons fresh oregano or 1 teaspoon dried oregano", "Generous pinch of red-pepper flakes", "3/4 cup dry white wine", "1 (14-ounce) can whole or chopped tomatoes", "8 cups chicken stock", "2 cups dried lentils, preferably black beluga", "1 bay leaf", "5 ounces delicate leafy greens, such as baby spinach or baby kale, or 8 ounces hearty greens, such as chard or collards (stemmed and chopped), fresh or frozen", "1 tablespoon red wine vinegar", "Chopped fresh basil, for serving", "Grated Parmesan, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the bottom of a 5- to 8-quart pressure cooker with a thin layer of olive oil. Add the onion and season lightly with salt. Using the sauté setting, cook until the onion is softened and translucent, stirring constantly, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sausage. Cook, breaking the sausage into small pieces with a spatula or a wooden spoon, until it starts to brown, about 5 minutes. Add the fresh garlic, onion and garlic powders, thyme, oregano, red-pepper flakes and several generous grinds of pepper. Stir to combine and cook until fragrant, about 1 minute. Add the wine and stir, scraping the bottom of the pot to remove any browned bits. Simmer until reduced by half, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes and their juices (if using whole tomatoes, crush them into pieces with your hands as you add them), followed by the chicken stock, lentils and bay leaf. Season generously with pepper and stir to combine. Cover and set steam valve to sealed position. Cook on high pressure for 10 minutes. Let the pressure release naturally for 5 minutes, then release the remaining pressure manually."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the lid. Remove and discard the thyme sprigs and bay leaf. Using the sauté setting, stir in the greens and cook until wilted and tender, 2 to 5 minutes, depending on the type of green. Stir in the vinegar and season to taste with salt and pepper. Divide among bowls and top with basil and Parmesan."}]}