{"@context": "http://schema.org", "@type": "Recipe", "name": "Soba Noodle and Steak Salad With Ginger-Lime Dressing", "description": "Soba, which are buckwheat noodles common in Japanese cooking, work well for a weeknight meal: They take just a few minutes to cook and can be served warm or at room temperature (which means they make great leftovers). Hanger steak is quickly seared in a drizzle of oil, and once done, the bok choy is cooked in the residual fat left behind, leaving you with one less pan to wash. This flexible dish also works well with seared or grilled shrimp or chicken. Shredded cabbage or tender broccolini could also be swapped in for the bok choy. Soft herbs like basil or cilantro would also be nice. The only thing you need to round out this meal is wine, preferably chilled and pink.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/08/28/dining/aw-soba-noodle-and-steak-salad/aw-soba-noodle-and-steak-salad-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, for two, lunch, weekday, meat, noodles, salads and dressings, vegetables", "keywords": "bok choy, carrot, ginger, lime, mint, scallion, sesame oil, soba noodles, soy sauce, steak, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 321}, "recipeIngredient": ["8 ounces soba noodles", "1/4 cup soy sauce", "1/4 cup lime juice (from 2 limes)", "2 teaspoons finely grated fresh ginger", "1 teaspoon sesame oil", "1/2 teaspoon light brown sugar", "1 pound hanger or skirt steak, at room temperature", "Kosher salt and black pepper", "1 tablespoon canola or grapeseed oil, plus more as needed", "8 ounces baby bok choy, halved lengthwise if large", "1 cup julienned or thinly sliced carrots", "3 to 4 radishes, thinly sliced (optional)", "1/2 cup thinly sliced scallions (2 or 3 scallions)", "1/4 cup fresh mint, torn", "Flaky salt, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook soba noodles according to package instructions. Rinse under cold water, drain well and set aside. Meanwhile, in a medium bowl, whisk together the soy sauce, lime juice, ginger, sesame oil and brown sugar; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the steak well with salt and pepper. Heat a large cast-iron pan over medium-high until very hot, 2 to 3 minutes. Add the canola oil and when it shimmers, add the steak and cook, undisturbed, until it begins to get crisp and golden on the outside, 3 to 4 minutes. (If you are using skirt steak, you may need to cut it into 2 or 3 pieces to fit in the pan, then cook for 2 to 3 minutes.) Flip and finish cooking, about 3 minutes more for medium-rare. Set aside and allow the steak to rest while you prepare the rest of the salad."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat to medium and add the bok choy. Season with salt and pepper and cook, stirring frequently, until it begins to brown and char in spots, 2 to 3 minutes, adding another teaspoon or so of oil if needed to help if the pan is too dry. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss the soba noodles, carrots, radishes (if using) and half the scallions. Drizzle with the ginger-lime dressing to taste and divide among plates or in serving bowls. Thinly slice the steaks against the grain and top each portion with some of the steak and the bok choy. Scatter the remaining scallions and the mint over top and season with flaky salt, if desired. Serve with any leftover dressing in a small bowl to be passed at the table."}], "link": "https://cooking.nytimes.com/recipes/1020435-soba-noodle-and-steak-salad-with-ginger-lime-dressing"}