{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Paillard With Black Olive Tapenade", "description": "Paillard is the French word for a thin slice of meat that cooks quickly. (Sometimes, a thicker piece of meat is pounded with a mallet to make it thinner.) This recipe is an easy way to make a chicken paillard without much pounding. Essentially, you butterfly a boneless, skinless chicken breast, slicing horizontally to make a flat, heart-shaped breast, then pound it lightly. Unfortunately, a chicken breast is often dry and tasteless, but it doesn’t have to be. Seasoned and cooked correctly, it should be tasty and moist. A dab of tapenade, a traditional Provençal black olive paste, makes a perfect accompaniment.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/04/03/dining/29kitchrex1/merlin_152372379_fc23c1f9-9852-485b-92de-2a69904e4558-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry", "keywords": "anchovies, arugula, capers, chicken breast, lemon, olives, parmesan, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 238}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 635, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "2 grams", "proteinContent": "56 grams", "saturatedFatContent": "7 grams", "sodiumContent": "759 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup pitted Niçoise olives", "4 anchovy fillets", "3 garlic cloves, grated", "1 tablespoon capers, well rinsed", "3 tablespoons roughly chopped parsley", "1/2 teaspoon orange zest", "1/2 teaspoon lemon zest", "Pinch of red-pepper flakes", "1/2 cup extra-virgin olive oil", "4 boneless, skinless chicken breasts, about 8 ounces each", "Salt and pepper", "Extra-virgin olive oil", "1 tablespoon roughly chopped thyme, plus a few sprigs", "8 wide strips of lemon zest, from 1 medium lemon", "5 ounces wild arugula (about 4 handfuls)", "A piece of Parmigiano-Reggiano or pecorino Romano, for shaving", "Lemon wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tapenade: In the bowl of a food processor, place olives, anchovy, garlic, capers, parsley, orange zest, lemon zest, red-pepper flakes and olive oil. Pulse several times to make a rough paste, then scrape down sides of the bowl and purée for about 30 seconds more. Alternatively, use a knife to finely chop ingredients, transfer them to a bowl and stir in the olive oil. You should have about 1 cup of tapenade, more than you need for this recipe. (Refrigerate the remainder for up to 2 weeks.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chicken: Working one at a time, lay chicken breast on a sturdy cutting board. With a sharp, thin-bladed knife, cut breast horizontally in half, almost, but not completely. Open the breast like a book; it will be a heart-shaped piece of meat. Lay the breast between two resealable plastic bags and lightly pound the breast to 3/8- to 1/2-inch thickness. Don’t pound too hard, or the meat may tear. When all breasts are ready, transfer them to a rimmed baking sheet in one layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season each breast on both sides with salt and pepper and drizzle with 1 teaspoon olive oil. Sprinkle with chopped thyme, and rub seasoning into meat, coating evenly with oil. Scatter thyme sprigs and lemon zest strips over. Leave to marinate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set oven to 400 degrees. Put a large skillet over medium-high heat, and lightly coat bottom with olive oil. When oil is hot, lay two chicken breasts top-side down in skillet. Cook for 2 minutes, until lightly browned. Turn over and cook 1 minute more. Transfer breasts to a clean baking sheet, browned-side up. Repeat with the other breasts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, uncovered, for 5 minutes, until firm to the touch. Remove from oven, keep warm and let rest 5 minutes. Remove and discard thyme sprigs and lemon zest strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put arugula in a bowl, and dress very lightly with olive oil and a pinch of salt. Place a handful of dressed greens on each of four plates. Place cooked paillards alongside. Smear 1 tablespoon tapenade across the surface of each breast. With a vegetable peeler, shave some cheese over arugula. Garnish with lemon wedges and serve."}], "link": "https://cooking.nytimes.com/recipes/1020082-chicken-paillard-with-black-olive-tapenade"}