{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn on the Cob With Old Bay and Lemon", "description": "If you’ve had the pleasure of eating your way through a bucket of Maryland blue crabs poured out onto newspaper, you’ve probably had Old Bay seasoning. It’s a blend of celery salt, black pepper, crushed red-pepper flakes and paprika, and any member of its fiercely loyal mid-Atlantic fan base will tell you that it should be present at any proper crab or shrimp boil. In this recipe, you get lots of that seaside flavor without having to source fresh blue crab.", "author": {"@type": "Person", "name": "Emily Fleischaker"}, "image": "https://static01.nyt.com/images/2019/07/09/dining/ef-grilled-corn-with-old-bay-and-lemon/ef-grilled-corn-with-old-bay-and-lemon-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "vegetables", "keywords": "appetizer, side dish, corn, lemon, Old Bay seasoning, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 40}, "recipeIngredient": ["4 ears fresh corn, shucked", "4 tablespoons unsalted butter, at room temperature", "1 lemon, zested and cut into wedges, for serving", "1/4 teaspoon Old Bay seasoning, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your grill to medium-high. Grill corn, turning occasionally, until cooked through and lightly charred, 10 to 12 minutes. (Alternatively, add corn to a large pot of salted boiling water and cook for 5 to 7 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, mix together butter, half the lemon zest and 1/4 teaspoon Old Bay seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slather hot corn with butter mixture. Sprinkle with the remaining zest and Old Bay seasoning, to taste. Serve with lemon wedges alongside for squeezing."}]}