{"@context": "http://schema.org", "@type": "Recipe", "name": "Peanut Shortbread With Honeycomb", "description": "A giant crumbly peanut cookie topped with airy honeycomb and lashed with dark chocolate, this recipe is especially good if you love salty-sweet flavors, and fun to eat too, since you break off shards to serve. Honeycomb candy is one of the easiest confections to make, but, like any candy, it requires careful attention to timing and safety. It’s helpful to have a clip-on candy thermometer to tell you when the sugar is at the right temperature, and you’ll want to transfer the hot sugar mixture to a large bowl. Doing so not only ensures that there is plenty of room for the dramatic billowing that occurs when the baking soda is added, but it also slows the cooking, to avoid burning.  This recipe yields quite a lot of pieces, making its perfect for packing into tins for gifts.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/11/27/dining/ss-peanut-shortbread/merlin_163732203_8ebf5eb4-4341-4586-9248-f59d3f9a58c6-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "One 9-by-13-inch pan (about 3 to 4 dozen pieces)", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars", "keywords": "butter, chocolate, dark chocolate, honey, peanut, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 389}, "recipeIngredient": ["1 cup/225 grams unsalted butter (2 sticks), softened, plus more for greasing the pan", "1/2 cup/110 grams light brown sugar", "1/2 cup/100 grams granulated sugar", "1 teaspoon vanilla paste or extract, or scrapings from 1/2 vanilla bean", "1/2 teaspoon kosher salt", "2 1/2 cups/320 grams all-purpose flour, plus more as needed", "1 cup/140 grams whole salted, roasted peanuts, finely ground, plus about 1/2 cup/70 grams roughly chopped salted, roasted peanuts", "1 tablespoon baking soda", "1 1/2 cups/300 grams granulated sugar", "1/4 cup/60 milliliters honey", "4 ounces/115 grams dark chocolate, chopped (about 2/3 cup)", "1/2 teaspoon vegetable shortening", "Flaky sea salt, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Butter a 9-by-13-inch metal pan, and line with parchment paper, leaving plenty of overhang on the long sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cookie layer: Combine 1 cup butter, the light brown sugar and the granulated sugar in the bowl of a stand mixer fitted with the paddle attachment. Cream together on medium-high speed until light and fluffy, 2 to 3 minutes, scraping bowl as needed. Add vanilla and salt; beat to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 1/2 cups flour and all peanuts, and beat until crumbly. Transfer the dough to the pan. Using floured hands, pat out the dough evenly but lightly, without compacting. Prick surface all over with a floured fork, and freeze until firm, about 10 minutes. Bake until firm at the center and golden brown all over, 35 to 40 minutes. Remove from oven, set pan on a wire rack, and cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the honeycomb layer: Have a large metal bowl, a whisk, the measured baking soda and the baked peanut cookie layer ready by the stove. In a wide, shallow saucepan, combine granulated sugar, honey and 1/4 cup water, and whisk to combine. Cook over medium-high heat until the mixture comes to a boil, gently swirling the pan without stirring, and using a wet pastry brush to wash down any sugar crystals clinging to the sides of the pan. Clip on a candy thermometer, and cook the mixture until the thermometer reads 300 degrees, 5 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Quickly and carefully pour and scrape the honey mixture into the metal bowl, then immediately whisk in the baking soda. (The mixture will puff up quite a bit.) Briefly whisk to dissolve the baking soda, but don’t overbeat. Immediately pour the hot mixture on top of the peanut cookie layer. Aim to cover the shortbread while pouring, then tip the pan around a little to distribute the honeycomb as much as possible. (Resist the urge to spread it out with a spatula, which will knock the air out of the honeycomb, making it hard instead of airy.) Cool completely. Run a small sharp knife around the edges of the pan to loosen. Using the overhanging parchment, lift and transfer to a work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the point of a small, sharp knife to break the cookie into 2- to 3-inch shards and arrange them on a parchment- or wax paper-lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a metal bowl set over a small saucepan filled with an inch of simmering water, combine the dark chocolate and the shortening, and stir until smooth and melted. Remove from heat. (You can also melt the chocolate in the microwave instead: Transfer the chocolate and shortening to a microwave-safe glass bowl and microwave for 30 seconds. Whisk to combine, then heat in 20-second increments, whisking between each, until melted.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a small spoon, drizzle the chocolate over the cookie shards. Sprinkle with sea salt. Pop into the freezer to harden the chocolate, about 5 to 10 minutes. Cookies will keep in an airtight container at room temperature for 3 days."}], "link": "https://cooking.nytimes.com/recipes/1020656-peanut-shortbread-with-honeycomb"}