{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheesy Cauliflower Toasts", "description": "Trust Ina Garten to take two big food trends — cauliflower and toast — and combine them into something completely fresh. This recipe, adapted from her 2018 cookbook, “Cook Like a Pro,” is a bit like an open-face grilled cheese sandwich with a nutty layer of roasted cauliflower, and spiked with nutmeg and paprika. We made it vegetarian by leaving out the prosciutto, and also lightened up on the cheese. It makes a vegetarian dinner with soup and salad, or a good snack with drinks.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2019/04/25/dining/cheesy-cauliflower-toasts/merlin_153889836_1aece37c-9dc2-47e8-9ccc-c7da857d6b9f-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weeknight, finger foods, sandwiches", "keywords": "appetizer, main course, cauliflower, cheese, gruyère, toast, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 506}, "recipeIngredient": ["1 head cauliflower, leaves and thick core removed", "1/4 cup olive oil", "1/4 teaspoon red-pepper flakes", "Kosher salt and freshly ground black pepper", "8 ounces whole-milk ricotta or mascarpone", "4 ounces Gruyère cheese, grated", "1/4 teaspoon ground nutmeg ", "6 slices rustic sourdough-type bread", "Freshly grated Parmesan, for topping", "Sweet paprika, for topping", "Finely chopped chives or parsley, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Cut the cauliflower into 1/2-inch clusters. Transfer to a sheet pan and toss with the oil, red-pepper flakes, 1 teaspoon salt and 1/2 teaspoon pepper. Spread florets out into a single layer and roast, stirring every 10 minutes, until tender and browned in spots, 25 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, stir ricotta or mascarpone in a large bowl until smooth and fluffy. Mix in Gruyère, nutmeg, 1 teaspoon salt and 1/2 teaspoon pepper and set aside. In a toaster, toast the bread until golden."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cauliflower is done, remove from the sheet pan and set aside to cool. Line the pan with foil and reduce the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the toasts on the lined sheet pan. Stir the cauliflower into the ricotta mixture, then divide among the toasts, spreading to the edges. Dust with Parmesan and paprika. (Recipe can be made up to this point and held at room temperature for up to 2 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until toast edges and topping are browned, 10 to 15 minutes. (If desired, broil 2 to 3 minutes to brown and melt the top.) Let cool slightly. Sprinkle with herbs, if using, then cut into halves or quarters and serve immediately."}]}