{"@context": "http://schema.org", "@type": "Recipe", "name": "Indian Butter Tofu (Tofu Makhani)", "description": "This recipe is a vegetarian riff on <a href=\"https://cooking.nytimes.com/recipes/1016754-butter-chicken\">butter chicken</a>, or murgh makhani, a classic Indian dish in which chicken simmers in a rich, dairy-laden tomato sauce that’s seasoned with heady spices like turmeric, cumin, garam masala and cardamom. This weeknight-friendly version has a toned-down ingredient list, and the tofu doesn’t require hours of marinating, which means you can get everything on the table in under an hour if you start the rice as the tomatoes are cooking down. Heavy cream gives this dish a rich finish, but full-fat coconut milk makes a fine substitute. Whatever you do, don’t substitute anything for the butter or ghee (sorry, vegans) — it’s the signature ingredient.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/03/11/dining/sc-butter-tofu/merlin_151400949_506842b1-ded5-442e-88b5-4f1e13be071e-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, lunch, weekday, curries", "keywords": "cumin, ginger, heavy cream, tofu, turmeric, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1314}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 592, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "50 grams", "fiberContent": "8 grams", "proteinContent": "25 grams", "saturatedFatContent": "25 grams", "sodiumContent": "783 milligrams", "sugarContent": "7 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 tablespoons fresh lemon juice", "1 tablespoon ground cumin", "1 heaping tablespoon plus 1 teaspoon ground turmeric", "2 (14-ounce) packages firm tofu", "8 tablespoons ghee or unsalted butter (1 stick)", "2 yellow onions, peeled and diced", "1 teaspoon ground chile powder, such as cayenne", "3 tablespoons peeled and minced fresh ginger", "4 garlic cloves, minced", "1 (28-ounce) can whole peeled tomatoes", "1 cinnamon stick", "1 teaspoon paprika", "1 1/2 teaspoons fine sea salt", "1 1/2 cups heavy cream or full-fat coconut milk", "3 scallions, thinly sliced on the bias", "1/4 cup cilantro leaves and tender stems", "Naan, basmati rice, yogurt and quartered cucumbers, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk the lemon juice, cumin and 1 heaping tablespoon turmeric with 1 tablespoon water to make a thin paste. Drain and pat the tofu dry then cut it into 1-inch cubes. Add it to the turmeric marinade, gently stirring to coat. Set aside at room temperature while you prepare the remaining ingredients, or cover and refrigerate for up to 1 day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot over medium heat, melt the butter. Add the onions and chile powder, and cook, stirring frequently, until onions are translucent, about 5 minutes. Lower the heat, add the ginger and garlic and cook, stirring occasionally, until the onions are starting to brown, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes and their juices, gently crushing the tomatoes with your hands as you go. Add the cinnamon stick, paprika and sea salt along with the remaining 1 teaspoon turmeric. Cook until the tomatoes and onions break down and the sauce is the consistency of a thick ragù, about 10 minutes. Blend with an immersion blender, or transfer to a blender and purée until smooth. Return to the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently stir in the cream and the tofu and its marinade. Simmer over low heat, uncovered, until the tofu has taken on the color of the sauce and is flavored all the way through, about 5 minutes. Stir occasionally but gently, so the tofu doesn’t fall apart. Transfer the tofu and sauce to a deep platter or large shallow serving bowl and sprinkle with scallions and cilantro. Serve with warm naan, rice, yogurt and cucumbers."}]}