{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetable Dumplings", "description": "The Polish have pierogi, the Japanese have gyoza: Many of the world’s cultures have some version of dumplings, whether they’re filled with meat, cheese or vegetables, and baked, steamed, fried or boiled. This recipe is adapted from the children’s cookbook “Around the World: Delicious Dishes from Across the Globe,” from the American Girl cookbook series, and was inspired by the dumplings you might get at your local Chinese takeout spot. They’re not necessarily authentic, but they are delicious, and folding and frying them is a fun weekend project for kids of all ages. You can use round or square wonton wrappers for this project, but don’t forget the sauce: It’s what makes these dumplings great.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2019/03/20/dining/18kidsrex3/18kidsrex3-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 24 dumplings", "recipeCuisine": "", "recipeCategory": "dinner, easy, snack, dumplings, finger foods, project", "keywords": "appetizer, main course, cabbage, carrot, ginger, mushroom, wonton wrappers, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 94}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 39, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "164 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup low-sodium soy sauce", "1 tablespoon rice vinegar", "1 teaspoon packed light brown sugar", "1/2 teaspoon peeled and grated fresh ginger", "1/4 teaspoon toasted sesame oil (optional)", "2 scallions, thinly sliced", "2 teaspoons low-sodium soy sauce", "2 teaspoons hoisin sauce", "1 teaspoon peeled and grated fresh ginger", "6 teaspoons canola oil, plus more as needed", "1 cup finely shredded green cabbage", "1/2 cup finely chopped cremini mushrooms", "1/3 cup peeled and shredded carrot", "Pinch of salt", "Cornstarch, for dusting", "24 round or square wonton wrappers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dipping sauce: In a small bowl, whisk the soy sauce, vinegar, brown sugar, ginger and sesame oil (if using) until the sugar dissolves. Cover and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling for the dumplings: In another small bowl, stir together the scallions, soy sauce, hoisin sauce and ginger. Add 2 teaspoons canola oil to a large nonstick frying pan. Turn the heat to medium and warm up the oil for 2 minutes. Carefully add the cabbage, mushrooms and carrot and sprinkle with a pinch of salt. Cook, stirring often, until the vegetables are slightly softened, about 3 minutes. Add the scallion mixture and stir to combine. Transfer the dumpling filling to a medium bowl and let cool to room temperature. Wipe out the pan or clean it if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the filling has cooled, assemble the dumplings: Put 1 cup water in a medium bowl. Sprinkle a large rimmed baking sheet with 2 to 3 tablespoons cornstarch, using your fingers to evenly distribute it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay 1 wonton wrapper on a clean work surface. Spoon 1 teaspoon of the dumpling filling in the center of the wrapper. Dip your fingers in the water and lightly moisten the edges of the wrapper. Fold the wrapper in half (if using squares, fold the wrapper in half diagonally to form a triangle) and press the edges together to seal. Place the dumpling on the prepared baking sheet. Repeat with additional wrappers and the remaining filling until you’ve used up all the filling. (At this point, you can freeze some of the dumplings in a single layer on the baking sheet. Once they are frozen, transfer them to a resealable plastic bag and freeze for up to 3 months. Don’t thaw them before cooking, but add a few minutes to the cooking time.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the dumplings: Brush the same frying pan with 2 teaspoons canola oil, set the pan over medium heat and warm up the oil for 2 minutes. Adding one dumpling at a time but working quickly, dust off excess cornstarch and add as many dumplings as will comfortably fit in a single layer in the pan (don’t crowd them or they won’t cook evenly). Let cook (no stirring!) until browned on the bottom, 2 to 3 minutes. Using tongs, gently flip the dumplings. Carefully pour about 1/2 cup water into the pan (it will bubble up and steam!). Cover and cook until the water is mostly absorbed, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dumplings to a serving platter and cover lightly with aluminum foil to keep warm. Repeat to cook the remaining dumplings, brushing the pan with 2 teaspoons canola oil before each batch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve dumplings warm, with the dipping sauce."}], "link": "https://cooking.nytimes.com/recipes/1020064-vegetable-dumplings"}