{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Mustard Chicken With Spinach and Carrots", "description": "In this one-skillet meal, mustard-coated chicken thighs are nestled on a bed of butter-sautéed scallions and carrots before the whole pan is popped into the oven to roast until golden. Just before serving, baby spinach and loads of fresh dill are tossed with the pan drippings, wilting slightly and absorbing all of the rich flavors. Serve this over rice or polenta, or with bread for mopping up the drippings. That’s all you’ll need to make it a satisfying meal.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/08/29/dining/mc-chicken-and-carrots/mc-chicken-and-carrots-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, one pot, poultry, roasts, vegetables", "keywords": "carrot, chicken thighs, coriander, dill, mustard, scallion, spinach, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 303}, "recipeIngredient": ["2 garlic cloves, finely grated or mashed to a paste", "1 1/2 teaspoons kosher salt, plus more as needed", "1 1/2 teaspoons ground coriander", "3/4 teaspoon black pepper", "2 1/2 pounds bone-in, skin-on chicken thighs (6 or 7 thighs)", "1 bunch scallions, trimmed", "3 medium carrots (about 6 ounces)", "4 tablespoons/60 grams unsalted butter (1/2 stick)", "1 sprig fresh oregano, marjoram or rosemary", "2/3 cup chicken stock", "1/2 cup good dry white wine", "2 tablespoons Dijon mustard", "5 ounces baby spinach", "1 cup chopped fresh dill", "Fresh lemon juice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees and position a rack in the center. In a small bowl, stir together garlic, salt, coriander and pepper. Rub all over chicken, then set aside to rest at room temperature while you prepare vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice the scallions. Peel carrots if you like, and cut into 1/2-inch pieces (about 1 cup)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 12-inch ovenproof skillet over high. When hot, add 2 tablespoons butter. When the butter is melted, place chicken skin-side down in skillet. Cook, without moving, until skin has browned, about 4 minutes. Transfer chicken, skin-side up, to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to medium-high and stir in remaining 2 tablespoons butter, along with scallions, oregano sprig and a pinch of salt. Cook until softened and lightly browned, 3 minutes, then stir in stock, wine and carrots. Bring liquid to a simmer. Cover pan and cook, 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, brush the chicken all over with the mustard. Nestle chicken into skillet skin-side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer skillet to oven and cook, uncovered, until chicken is cooked through, about 20 minutes. Remove pan from oven and transfer chicken to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If pan juices are watery, bring to a simmer over high heat and cook until thickened. Pluck out the oregano sprig and discard. Stir spinach, dill and a pinch of salt into pan, tossing to coat with pan juices and wilt greens. Spoon spinach, carrots, and pan juices over the chicken, drizzle with lemon juice, and serve."}], "link": "https://cooking.nytimes.com/recipes/1020305-skillet-mustard-chicken-with-spinach-and-carrots"}