{"@context": "http://schema.org", "@type": "Recipe", "name": "Coconut Shrimp", "description": "No one really knows the origins of fried coconut shrimp, the crunchy, breaded kind that’s served in chain steakhouses and beachfront restaurants, but its roots are likely found in the tiki bar culture, which was all the rage in the United States after World War II, when access to tropical produce like coconuts and pineapples became an everyday thing. Using egg whites instead of whole eggs and cornstarch instead of flour yields shrimp that are simultaneously crunchy yet light, and go just as well with piña coladas as they do with Champagne. We paired ours with a simple spicy-sweet dip made with marmalade, Dijon mustard and Sriracha, but you can also serve them with store-bought sweet chile sauce.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2019/12/12/dining/ml-coconut-shrimp/ml-coconut-shrimp-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 24 shrimp", "recipeCuisine": "american", "recipeCategory": "easy, quick, snack, weeknight, seafood", "keywords": "appetizer, main course, coconut, coconut flakes, orange marmalade, panko, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 71}, "recipeIngredient": ["1/2 cup orange marmalade or apricot preserves", "1 tablespoon Dijon mustard", "1 teaspoon Sriracha or other chile sauce (optional)", "1 teaspoon fresh lime juice, plus more as needed", "Pinch of salt", "1/2 cup cornstarch", "1 tablespoon fresh lime zest (from 2 to 3 limes)", "1 1/2 teaspoons fine sea salt", "1/8 teaspoon ground cayenne (optional)", "4 large egg whites", "1 cup finely shredded unsweetened coconut", "1/2 cup panko bread crumbs", "Kosher salt and black pepper", "1 pound large raw shrimp (21 to 25 count), peeled and deveined, with tails attached", "4 to 5 tablespoons coconut or canola oil, for frying, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dip: In a small bowl, combine marmalade, mustard, Sriracha (if using), lime juice and salt. Stir until fully incorporated. If it’s too thick, add a touch more lime juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the shrimp: Place the cornstarch, lime zest, salt and cayenne (if using) in a shallow bowl. Whisk the egg whites in another bowl until frothy. Toss the coconut and panko in another shallow bowl; season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one shrimp at a time, holding it by its tail, coat the shrimp (but not the tail) in the cornstarch mixture then shake off excess. Dip in the egg whites, then shake off excess. Dredge in coconut-panko mixture, pressing to coat. Set aside on a large plate. Repeat with the remaining shrimp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat enough oil to cover the bottom of a large skillet in a thin layer. Heat over medium until oil shimmers. (A pinch of the coconut-panko mixture added to the oil should sizzle and brown easily. If the oil isn’t hot enough, the shrimp will stick to the pan.) Working in batches if necessary, add shrimp in a single, even layer (do not crowd the pan), and cook until golden brown on the bottom, about 2 minutes. Adjust the heat as necessary if the shrimp is browning too quickly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, grab the shrimp by the tail (so as not to disturb the crust) and flip over. Cook until golden brown underneath, about 2 minutes more. Remove the shrimp by the tail from the pan to a plate lined with paper towels. Repeat with the rest of the shrimp, adding additional oil as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately with dip."}], "link": "https://cooking.nytimes.com/recipes/1020717-coconut-shrimp"}