{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn Soup With Red Pepper Swirl", "description": "Late summer is when corn and ripe peppers collide in the market. A well-seasoned purée of roasted red pepper swirled into this luscious soup makes a dramatic contrast to the corn’s sweetness.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/09/04/dining/30kitchenrex/merlin_159744849_108a8744-488c-4acc-8f63-aaac3ac81b70-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "soups and stews, vegetables", "keywords": "corn, red pepper, fall, summer, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 263}, "recipeIngredient": ["1 large red bell pepper", "1 or 2 fresh Fresno chiles, seeds removed, chopped", "1 teaspoon pimentón (smoked paprika) or 1/4 teaspoon chipotle chile", "2 tablespoons extra-virgin olive oil", "Salt and pepper", "4 tablespoons unsalted butter", "1 large onion, diced", "3 cups corn kernels (from 4 large ears) or 3 cups frozen corn kernels", "6 garlic cloves", "4 cups water, corn-cob broth (see Tip) or chicken broth", "Lime wedges, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place bell pepper over an open flame or under broiler and roast, turning frequently with tongs, until blackened and blistered all over, about 5 minutes. Remove from heat and let cool to room temperature. Cut in half vertically. With a paring knife, remove seeds from each half, then turn over and scrape away the blackened skin. Do not rinse; a little remaining char is fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer roasted pepper to a blender or food processor and add Fresno chiles, pimentón, olive oil, and salt and pepper to taste. Blend to a smooth thick purée. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt butter in a heavy-bottomed soup pot over medium-high heat. Add onions and corn kernels. Season well with salt and pepper and reduce heat to medium. Cooking, stirring, until onions are softened and beginning to color, 7 to 8 minutes. Add garlic and cook for 1 minute more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 3 cups water or broth and salt to taste. Simmer for 15 minutes, until corn is well cooked. Transfer to a blender and whiz to a smooth purée. Thin with water or broth to the consistency of heavy cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pass soup through a fine mesh strainer, pressing with the back of a large spoon or ladle to extract every drop of liquid. (This step is important to guarantee a velvety texture.) Discard any fibrous remains. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, reheat and ladle into shallow soup bowls. Swirl about 2 tablespoons pepper purée into the center of each bowl. Pass lime wedges at the table."}], "link": "https://cooking.nytimes.com/recipes/1020425-corn-soup-with-red-pepper-swirl"}