{"@context": "http://schema.org", "@type": "Recipe", "name": "Herby Farro With Butternut Squash and Sour Cream", "description": "The herb and chile paste that seasons rice in <a href=\"https://cooking.nytimes.com/recipes/1019201-green-rice-arroz-verde\">arroz verde</a> is also a great match to nutty farro and sweet butternut squash. As everything bakes in the oven, the garlic and onion lightly steam, the herbs wilt, and the farro tenderizes while maintaining its signature chew. Fresh lime zest and juice perk everything up. This dish is great with salmon, pork or chicken — or, skip the sour cream and this becomes a hearty, vegan main that partners well with black beans.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2020/02/18/dining/as-herby-baked-farro/merlin_168265317_613964aa-d127-4f9c-94cc-07938ad45d43-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "grains and rice", "keywords": "butternut squash, cilantro, farro, garlic, jalapeño, lime, onion, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 174}, "recipeIngredient": ["1 1/2 cups chopped cilantro leaves and tender stems, plus more for garnish", "1 cup chopped parsley leaves and tender stems, plus more for garnish", "1/2 large yellow onion, coarsely chopped", "4 garlic cloves, peeled", "1/2 jalapeño, seeded (if desired) and coarsely chopped", "Kosher salt and black pepper", "1 tablespoon extra-virgin olive oil", "1 1/2 cups farro", "1 pound peeled butternut squash, cut into 3/4-inch pieces (about 3 cups)", "1/2 cup sour cream", "1 teaspoon lime zest plus 2 tablespoons juice (from 1 lime)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. In a blender, combine the cilantro, parsley, onion, garlic, jalapeño, 1 teaspoon salt and a few grinds of pepper on low speed until a wet, coarse paste forms, stirring and scraping the sides of the blender as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven, heat the olive oil over medium-high, then add the farro, season with 1 teaspoon salt, and cook, stirring, until the farro smells toasty, about 2 minutes. Add the herb paste and 3 cups water. (Pour the water into the blender to get every last bit of herb paste, then pour the water into the pot.) Bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the squash on top, cover, and bake until the farro and squash are tender, 35 to 40 minutes. (All the water may not be absorbed)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, stir together the sour cream, lime zest and 1 tablespoon lime juice in a small bowl. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the farro sit 5 minutes, season to taste with salt and pepper, then stir in the remaining tablespoon of lime juice. Serve the farro with a drizzle of sour cream and top with fresh parsley and cilantro leaves."}], "link": "https://cooking.nytimes.com/recipes/1020885-herby-farro-with-butternut-squash-and-sour-cream"}