{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Okonomiyaki", "description": "Okonomiyaki are savory, fried Japanese pancakes that are crisp on the outside and custardy at their core. They traditionally feature cabbage and pork, but this meatless version opts for spinach, zucchini and Napa cabbage. You’ll want to visit a Japanese market for the more unusual ingredients like Hondashi, Kewpie mayo, okonomiyaki sauce and dried shaved bonito, though truthfully you can pick and choose your preferred toppings (Hondashi and shaved bonito contain fish, so skip them if you’re serving vegetarians). The vinegary okonomiyaki sauce combines with the creamy mayo and umami-rich bonito for a playful topping that makes these pancakes truly unique. Leftovers make a great breakfast sandwich filling or snack; reheat at 375 degrees until warmed through, about 15 minutes.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2019/03/14/dining/kc-green-okonomiyaki/kc-green-okonomiyaki-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 pancakes", "recipeCuisine": "japanese", "recipeCategory": "dinner, snack, finger foods, vegetables", "keywords": "dashi, napa cabbage, nori, spinach, zucchini, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 324}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 531, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "4 grams", "proteinContent": "15 grams", "saturatedFatContent": "4 grams", "sodiumContent": "858 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 teaspoon instant dashi powder, such as Hondashi", "2 large eggs", "3/4 cup all-purpose flour (3 1/2 ounces)", "2 teaspoons kosher salt", "1/2 teaspoon baking powder", "1/4 teaspoon baking soda", "10 ounces Napa cabbage, finely shredded (about 4 cups)", "1 medium zucchini (6 ounces), grated on the large holes of a box grater and squeezed dry", "2 ounces baby spinach (2 packed cups), coarsely chopped", "1 tablespoon drained pickled red ginger (or finely chopped pickled sushi ginger)", "1/4 cup safflower or canola oil", "Okonomiyaki sauce and Kewpie mayo, for drizzling", "Dried shaved bonito (optional) and shredded nori, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk 1 cup water with dashi powder (if using) until dashi is dissolved. (If you’re not using dashi, you can simply use plain water.) Whisk in eggs until well blended, then add flour, salt, baking powder and baking soda and whisk until smooth. Fold in cabbage, zucchini, spinach and ginger until well incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In an 8-inch nonstick skillet, heat 2 tablespoons oil. Add half the batter, spreading cabbage mixture into an even 6-inch round about 1-inch-thick (avoid the urge to push down on the cabbage, which would prevent fluffier pancakes). Cook over medium-low heat until pancake is set and golden-brown underneath, 8 to 10 minutes. Reduce heat to low and carefully flip pancake. (You might want to put a plate on top of the pancake, flip to invert the pancake onto the plate, then slide it back into the skillet.) Cook until golden-brown on second side and cooked through in center, about 8 minutes. Flip pancake over onto a fresh large plate. Wipe out skillet and repeat with remaining oil and batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle pancakes with okonomiyaki sauce and Kewpie mayo, and top with a handful of shaved bonito, if using, and nori. Serve warm."}]}