{"@context": "http://schema.org", "@type": "Recipe", "name": "Jerusalem Grill", "description": "This recipe for griddled chicken thighs with chicken livers and hearts comes from Mike Solomonov and Steven Cook, the Philadelphia restaurateurs whose cookbook, “Israeli Soul,” is an invaluable guide to making Israel’s most beloved street foods and restaurant dishes at home. But you don't need to make it with the livers and hearts. “I like a little funk in there,” Solomonov told me, “but I get it if you don’t like that, if it freaks you out.” So omit the offal if you want. “The dish is as much about the spicing, anyway,” Solomonov said. Serve the meat mounded onto a drift of hummus, as you might spoon a thick ragù on top of polenta, or alone beside a salad. Solomonov likes it as a sandwich. “Eat mixed grill in a pita,” he said. “Eat it with some onion and tehina and a pickle, and it’s so satisfying. It’s a taste of Jerusalem at the end of the night.”", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/03/24/magazine/24mag-eat-slideshow-slide-U42I/24mag-eat-slideshow-slide-U42I-articleLarge.png", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, lunch, poultry", "keywords": "baharat, boneless chicken thighs, cumin, fenugreek, turmeric, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 175}, "recipeIngredient": ["1/4 cup olive oil", "1 large red onion, peeled, halved and thinly sliced", "2 teaspoons plus a pinch of kosher salt", "2 teaspoons ground turmeric", "1 teaspoon ground cumin", "1 teaspoon ground fenugreek", "1 teaspoon baharat", "1 teaspoon ground cinnamon", "2½ pounds boneless, skinless chicken thighs, or a combination of 1½ pounds boneless, skinless chicken thighs, ½ pound chicken hearts and ½ pound chicken livers, trimmed and cut into nickel-size pieces", "1 lemon, halved", "Cooked Basmati or other long-grain rice", "Israeli salad, pita bread, sliced pickles and <a href=\"https://cooking.nytimes.com/recipes/1019619-5-minute-hummus\">hummus</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make caramelized onions: Swirl 2 tablespoons oil into a medium skillet set over medium heat. When it shimmers, add the sliced onions and a pinch of salt. Cook, stirring, until the onions begin to soften and turn translucent, about 7 minutes, then lower the heat, and continue to cook, stirring every few minutes, until the onions are deeply caramelized. This could take up to 45 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large bowl, combine the turmeric, cumin, fenugreek, baharat, cinnamon and the 2 teaspoons salt. Add the chicken pieces — including the hearts and livers, if you’re using them — and toss with the spices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large skillet over high, and swirl into it the remaining 2 tablespoons oil. When it shimmers, add the spiced chicken mixture, and spread it out in an even layer. Let the meat sear, undisturbed, for about 2 minutes, then lower the heat to medium-high, and cook, stirring once or twice, until chicken is cooked through, about 5 minutes. Add a squeeze of lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken mixture from the heat, and stir in the caramelized onions. Serve with rice and Israeli salad or, better yet, with pita bread, sliced pickles and plenty of hummus."}]}