{"@context": "http://schema.org", "@type": "Recipe", "name": "Boiled Whole Artichokes With Mayonnaise", "description": "This method for preparing artichokes is so simple and so effective because it does one important thing: It accepts the bitter, thorny truth of the artichoke and doesn’t try to fight against it. Instead of wrestling with the thing in order to prepare it for cooking, by trying to trim those tightly closed petals that stab your fingertips and leave them coated in a wretchedly bitter film, just leave the artichoke alone. Slice off the domed top, then drop the artichoke, stems and all, right into the boiling salted water and cook until tender. Once done and cool enough to handle, the artichoke is effortless to peel, revealing sweet flesh at the base of each leaf, and her large tender heart is yours for the taking.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2019/05/26/magazine/26mag-eat/c0c098d89240406ca80dc198fb69028d-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, vegetables", "keywords": "appetizer, main course, side dish, artichoke, egg, lemon, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 148}, "recipeIngredient": ["Kosher salt", "4 whole globe artichokes, each about the size of a fist (8 to 10 ounces)", "1 whole egg, plus 2 egg yolks", "2 garlic cloves, peeled", "2 lemons — 1 juiced, 1 quartered", "1 1/2 cups neutral oil, like sunflower", "1 to 2 tablespoons cold water", "Extra-virgin olive oil, for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to boil — large enough to submerge all four artichokes. Once the water is boiling, season it with salt to taste. Slice off the domed top quarter of the artichokes, remove the black tip of the stem and immediately place the artichokes in the boiling water. To cook the artichokes evenly and prevent them from bobbing at the surface, place a lid one size smaller than the pot you are using directly on top of the artichokes, weighing them down so they are submerged. Reduce the heat until the water is at a hard simmer, and cook the artichokes until you can easily pierce the bottom choke (where the stem meets the base) with a cake tester or the sharp tip of a thin knife with no resistance, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While artichokes cook, prepare the mayonnaise: Place the egg, egg yolks, garlic, lemon juice and two healthy pinches of salt in a food processor fitted with a steel blade. Whiz for 5 seconds, then, with the machine on, slowly add about half the neutral oil in a thin, steady stream. Turn the machine off, and add 1 tablespoon cold water. Turn the machine back on, and finish adding the neutral oil in a steady stream. If mayonnaise is thick, blend in the remaining 1 tablespoon cold water. Mayonnaise should be light, satiny and silken. Taste the mayonnaise, and add salt as needed. Set aside at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cooked artichokes to a wire rack set over a rimmed baking sheet, positioning them upside down to drain. Let stand at room temperature until they are cool enough to handle, about 15 minutes. Then remove the stems in an even cut, leaving the artichokes with a flat base. Peel the fibrous outer layer (and any strings) off the stems, cut the stems into 1/4-inch coins and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the artichokes, stem side down, on a clean work surface. Gently open up the artichokes to reveal the inner leaves, using your fingers a little like the way you might open your own eye to receive drops, or even resembling the gesture you use to enlarge an image on your iPhone screen. Then pinch the whole purple and spiky choke at the center in one handful, and pluck it out, revealing the fuzzy hair that sits firmly attached in the cup of the heart. Remove this fuzz with your fingertip, or use a small spoon to scrape it away, taking care not to gouge or dig too deep into the goose-pimpled flesh."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, place a healthy dollop of mayonnaise in the very center of each artichoke. Spoon in a few of the stem coins, then drizzle artichoke and mayonnaise with olive oil. Serve with additional mayonnaise and lemon wedges. (Any leftover mayonnaise will keep, refrigerated, up to 1 week.)"}], "link": "https://cooking.nytimes.com/recipes/1020248-boiled-whole-artichokes-with-mayonnaise"}