{"@context": "http://schema.org", "@type": "Recipe", "name": "Papadzules (Rolled Tortillas With Pumpkin Seed Sauce)", "description": "In 1970, Craig Claiborne took a Mexican cooking class at the New York City home of Diana Kennedy, where he learned how to make these papadzules, a Yucatecan dish of rolled tortillas with pepitas (pumpkin seeds). After the death of her husband, Paul Kennedy, a reporter for The New York Times, and with encouragement from editors in New York to write a book, Ms. Kennedy moved to Mexico to record its culinary diversity. As Mr. Claiborne noted in his 1970 article, a coffee grinder works best for puréeing the pepitas here, but the best way to coax the rich oil out of the seeds is by hand. (Tejal Rao)", "author": {"@type": "Person", "name": "The New York Times"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "mexican", "recipeCategory": "", "keywords": "corn tortillas, eggs, lard, pepitas, main course", "aggregateRating": null, "recipeIngredient": ["1 tablespoon salt, plus 1/2 teaspoon", "2 large, unpeeled tomatoes (about 1 pound)", "2 fresh green chiles", "2 tablespoons lard", "1/3 cup finely chopped onion", "1/4 teaspoon sugar", "2 large sprigs epazote, optional", "8 ounces unsalted pepitas (about 1 2/3 cups, see note)", "12 corn tortillas", "5 hard-cooked eggs, peeled and chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 3 cups water in a saucepan and bring to a boil. Add 1 tablespoon salt and the tomatoes. Let simmer until tomatoes are soft, about 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the tomatoes and reserve the water in which they cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the tomatoes are cool enough to handle, remove and discard the skins. Carefully scoop out the seeds and squeeze them to extract the juice. Discard the seeds. Add the juice to the tomato pulp, and mash or blend to make a purée. Set this aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the chiles on a piece of aluminum foil and broil under a flame, turning frequently, until they are lightly toasted all over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the lard and add the chopped onion. Cook slowly, stirring, until onion is translucent. Add the tomato mixture, the sugar, 1/2 teaspoon of salt and toasted chiles. Do not split open the chiles, as the seeds add heat. Simmer the mixture over low heat for about 15 minutes. Set the sauce aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the epazote, if available, to the water in which the tomatoes cooked. Simmer 3 minutes and set aside. Let it cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pepitas in a skillet and cook over low heat, stirring constantly, until they are lightly toasted. Do not let them burn (the seeds pop explosively as they cook). Set the pepitas aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grind the pepitas until fine — the finer the better — or blend them (see note). Place them in a shallow dish and add a little of the warm epazote water, stirring with fingers to make a stiff paste. Continue kneading and squeezing the mixture with your fingers while adding about 1/4 cup of the warm liquid, until the paste becomes shiny and a dark color. Continue working and squeezing the paste between your fingers, and you will note that drops of oil accumulate from the paste. Once this state is reached, the oil accumulates quickly. If you tip the plate, the oil can be scooped out. About 2 tablespoons of the green oil should be separated from the paste and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly stir the remaining epazote liquid into the paste with a wooden spoon. Stir constantly until the sauce is smooth and creamy. Add salt to taste. At this point the sauce may be warmed over very low heat, but it is important that papadzules are served lukewarm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the dish, dip the tortillas, one at a time, into the pumpkin seed sauce. Spoon chopped egg down the center of each tortilla as each is prepared. Roll the tortillas loosely and arrange the rolls side by side in a serving dish. Pour the remaining pumpkin seed sauce over all. Spoon the tomato sauce across the center of the dish, and sprinkle the 2 tablespoons green oil over the top. Serve lukewarm."}]}