{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Parmesan Roast Chicken With Lemon", "description": "Sprinkling grated Parmesan over a whole chicken as it roasts yields extra-crisp, extra-savory skin in this recipe, while chopped fresh rosemary and lemon zest perfume the meat through and through. Be sure to serve this with the lemony pan drippings, which make a bright, rich sauce for the tender meat. Heat lovers should feel free to add plenty of red-pepper flakes to the drippings  —  or serve red pepper on the side for individual spicing.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/01/15/dining/10appe3/10appe3-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, poultry", "keywords": "chicken, lemon, parmesan, rosemary, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 860}, "recipeIngredient": ["1 small lemon", "2 teaspoons kosher salt, plus more to taste", "1 teaspoon black pepper", "1 teaspoon chopped rosemary, plus 4 sprigs", "Large pinch of red-pepper flakes, plus more for serving (optional)", "1 (3 1/2- to 4-pound) whole chicken, patted dry", "Extra-virgin olive oil, for drizzling", "1/3 cup finely grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely grate 1 teaspoon zest from the lemon and place it in a small bowl. (Save the zested lemon for the drippings.) Stir in 2 teaspoons salt, pepper, chopped rosemary and red-pepper flakes, if using. Season the chicken inside and out with salt mixture. Let sit at room temperature for 20 minutes or refrigerate uncovered for up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Place chicken, breast-side up, in a large skillet, sheet pan or roasting pan. Stuff cavity of chicken with rosemary sprigs. Drizzle breast with a little olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast chicken for 30 minutes. Sprinkle chicken all over with Parmesan, then continue roasting until bird’s juices run clear when skin is pierced with a knife and the skin is golden, 25 to 30 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let chicken rest for 10 minutes. Squeeze juice from the zested lemon, to taste, into the pan drippings and season with more salt and red-pepper flakes if you like. Carve and serve with drippings spooned over the meat."}], "link": "https://cooking.nytimes.com/recipes/1020770-crispy-parmesan-roast-chicken-with-lemon"}