{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Chicken With Lemon and Za’atar", "description": "This plump and juicy roast chicken benefits from tenderizing in a yogurt-lemon-garlic marinade for as long as 24 hours, but if you don’t have a lot of time, slathering it with the mixture before sliding it into the oven will still add flavor, and give the spices something to stick to. Za’atar, a Middle Eastern herb-and-spice blend, can still be hard to find in the supermarket, so make your own by combining sumac, sesame seeds, thyme, coriander, oregano and cumin. You can buy sumac, a garnet-colored lemony spice, in Middle Eastern markets or online, but the rest of the ingredients are most likely already on your spice rack, and leaving out one or two of them is perfectly O.K. If you have a premade za’atar blend on hand, you’ll need about 1/2 cup to coat the chicken.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/05/09/dining/ss-zaatar-chicken/ss-zaatar-chicken-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "4 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, poultry, roasts", "keywords": "chicken, coriander, greek yogurt, lemon, sesame seeds, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 236}, "recipeIngredient": ["1 cup plain full- or reduced-fat Greek yogurt", "3 lemons (1 lemon zested and juiced; 2 lemons, halved)", "2 large garlic cloves, finely grated", "3 tablespoons olive oil", "1 (4- to 5-pound) whole chicken", "Kosher salt and black pepper", "2 tablespoons toasted white<strong> </strong>sesame seeds (see Tip)", "2 tablespoons sumac (optional)", "1 tablespoon dried thyme", "1 tablespoon ground coriander", "2 teaspoons dried oregano", "2 teaspoons ground cumin", "3 medium shallots, peeled and halved lengthwise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a shallow bowl, stir together yogurt, zest and juice of 1 lemon, garlic and 2 tablespoons olive oil. Season the chicken inside and out with 1 teaspoon each salt and pepper. Add the chicken to the bowl and coat with the yogurt mixture inside and out. Cover and refrigerate until cooking, up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Make the za’atar: In a small bowl, mix sesame seeds, sumac (if using), thyme, coriander, oregano, cumin and 1 tablespoon salt. Remove chicken from marinade and gently scrape off excess yogurt while leaving a nice coating. Transfer chicken to a sheet of parchment or wax paper. Coat chicken all over with the za’atar blend. Scrape up any spices that fall off and pack them on. Drizzle with remaining tablespoon oil and pat gently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 1 lemon half in the cavity of the bird. Tie legs together using butcher’s twine, if desired, and place chicken in a small roasting pan. Arrange remaining 3 lemon halves and shallots cut-sides down in the pan surrounding the chicken. Add 1/4 cup water to the pan and roast on the middle rack for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the oven temperature to 350 degrees, gently baste the chicken and add another 1/4 cup water. Roast for an additional 60 to 75 minutes, rotating the pan periodically. Turn the lemon and shallots occasionally, basting once or twice and add 1/4 cup water whenever the pan juices dry out. Cook until until the legs wiggle easily and the chicken reaches an internal temperature of 165 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let chicken rest 10 to 15 minutes before carving. Pour the pan juices (add a few tablespoons of water first, if they are very reduced) into a small gravy boat, degreasing or skimming some fat, if desired. Serve the chicken with the juices and the roasted shallots."}], "link": "https://cooking.nytimes.com/recipes/1020225-roast-chicken-with-lemon-and-zaatar"}