{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemony Cauliflower With Garlic and Herbs", "description": "There aren’t many cauliflower salads as vivacious as this one, which is zipped up with plenty of lemon, herbs, garlic and one minced jalapeño. It is best made a day or two ahead, which gives all the ingredients a chance to mingle, and the raw cauliflower time to soften and absorb all of the dressing's bright, complex flavors. Although this salad needs no other seasonings, you can add capers, sliced olives or crumbled feta here for even saltier tang. The pinch of red-pepper flakes here is optional, but especially good.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/11/20/dining/15apperex1/merlin_163923729_8984dd56-317c-4936-bfe0-7fc77380e8c0-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "cauliflower, dill, jalapeño, parsley, scallion, fall, winter, side dish, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 359}, "recipeIngredient": ["1 lemon, plus more lemon juice to taste", "1 1/4 teaspoons fine sea salt, plus more to taste", "1 large head cauliflower (about 1 3/4 pound), trimmed and cut into bite-size florets (about 8 cups)", "1 jalapeño, finely chopped", "2 scallions, whites and greens thinly sliced", "1/2 cup chopped fresh dill or basil", "1/2 cup chopped parsley, leaves and tender stems", "3/4 cup extra-virgin olive oil", "2 fat garlic cloves, finely grated or minced", "2 teaspoons whole cumin or cracked coriander seeds", "Large pinch of red-pepper flakes (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely grate the zest of the lemon into a large heatproof bowl, then halve the lemon and squeeze in juice. Stir in salt to dissolve it. Add cauliflower, jalapeño, scallions, dill and parsley and toss to combine. In a large skillet, heat olive oil until hot, but not smoking. Add garlic and cumin, and cook until fragrant, about 1 minute. Stir in red-pepper flakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour mixture over cauliflower and toss well. Let cool completely, then cover and refrigerate for at least 8 hours and up to 48 hours to let the flavors mingle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss well before serving, adding more salt or a squeeze of lemon to taste. For the best flavor, serve at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1020617-lemony-cauliflower-with-garlic-and-herbs"}