{"@context": "http://schema.org", "@type": "Recipe", "name": "Freekeh With Chicken, Almonds and Yogurt", "description": "Freekeh is unbelievably delicious. Just a bowl of it with a dab of yogurt would suffice, but for the full effect it should be topped with a savory stew of chicken or lamb. Freekeh is made from wheat that is harvested when the berries are still green and then burned to remove the chaff. It is often described as roasted, but when I say smoky, it really is. Use cracked freekeh as the whole-grain version takes longer to cook.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/08/28/dining/23kitchenrex/merlin_158850912_6c0355af-9058-407c-90f6-e0167806f665-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "poultry", "keywords": "blanched almonds, chicken legs, freekeh, yogurt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 159}, "recipeIngredient": ["2 cups cracked freekeh", "3 tablespoons extra-virgin olive oil", "1/2 cup blanched almonds", "2 tablespoons unsalted butter", "1/4 teaspoon allspice", "1 (1-inch) stick of cinnamon", "1/4 teaspoon black pepper", "1 teaspoon salt", "5 cups unsalted chicken broth or water", "6 large chicken thighs, whole legs or a cut-up bird, about 3 pounds", "Salt and pepper", "1 teaspoon cinnamon", "1/2 teaspoon allspice", "2 tablespoons extra virgin olive oil", "2 tablespoons unsalted butter", "4 cups unsalted chicken broth or water", "A few sprigs flat leaf parsley", "2 cups plain yogurt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick over freekeh and rinse in cold water until water looks clear. Soak grain in cold water for 30 minutes, then drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a heavy-bottomed large saucepan or Dutch oven over medium-high heat. Add almonds and fry, stirring, until golden, 3 to 4 minutes. Remove almonds and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter to oil. When hot, add freekeh and stir to coat. Add allspice, cinnamon stick, pepper and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add broth, turn heat to high and bring to a boil. Cover and turn heat to low. Cook for 20 to 25 minutes, until tender. (Whole-grain freekeh will take 40 to 45 minutes.) From time to time, give freekeh a stir and make sure it isn’t sticking. All liquid should be absorbed, as it would in cooking rice, and freekeh should be tender. If not, add a little water and cook for a few minutes longer. Taste for salt and adjust. Turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the chicken: Season the meat on both sides generously with salt and pepper. Sprinkle with cinnamon and allspice and rub over chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil and butter in a large deep skillet over medium-high heat. Gently fry chicken on both sides until nicely browned. Add broth and bring to a boil. Cover, turn heat to low and simmer for 35 to 40 minutes, until the chicken is tender. Turn off heat and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon freekeh onto a warm platter. Lay chicken on top and ladle remaining cooking liquid over. Top with reserved fried almonds. Garnish with parsley sprigs. Pass a bowl of yogurt."}], "link": "https://cooking.nytimes.com/recipes/1020420-freekeh-with-chicken-almonds-and-yogurt"}