{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Corn and Avocado Salad With Feta Dressing", "description": "This lively salad of corn, scallions, jalapeño and avocado tossed with a tangy buttermilk-feta dressing is like summer on a plate. The sweetness of peak-summer corn and the richness of creamy avocado balance out the tartness of the dressing. To choose the perfect corn, make sure that the corn husk is bright green and slightly dewy to the touch, and that the silks peeking out at the top are yellow, not browned. Finally, the corn should be heavy for its size: the heavier the corn, the plumper the kernels.", "author": {"@type": "Person", "name": "Sue Li"}, "image": "https://static01.nyt.com/images/2019/08/14/dining/sl-corn-and-avocado-salad/merlin_159056649_e9aed760-37ec-4a54-bdfa-6d0f3f4459af-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, weeknight, salads and dressings, vegetables", "keywords": "avocado, buttermilk, corn, feta, jalapeño, romaine, scallion, main course, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 411}, "recipeIngredient": ["6 ears corn (about 3 pounds), shucked and silk removed", "1 bunch scallions (about 6), trimmed", "1 jalapeño, stemmed and halved lengthwise", "3 tablespoons olive oil", "Kosher salt and black pepper", "4 ounces feta cheese, crumbled (about 3/4 cup)", "1/3 cup buttermilk", "1 teaspoon freshly grated lemon zest plus 1 tablespoon lemon juice", "1 small garlic clove, grated", "1/4 cup sliced fresh chives", "1/4 cup finely chopped fresh parsley", "1 medium head romaine lettuce, torn into bite-size pieces (about 8 cups)", "2 avocados, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a grill or grill pan over medium-high. Brush corn, scallions and jalapeño with the oil and season with salt and pepper. Arrange on the grill and cook, turning occasionally, until corn kernels are browned in spots, 6 to 8 minutes, and the scallions and jalapeño are charred all over and tender, 9 to 10 minutes. Transfer vegetables to a cutting board and let cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, using a whisk, mash the feta into a coarse paste. Whisk in buttermilk, lemon zest and juice and garlic, then stir in chives and parsley. Finely chop the charred jalapeño and stir it into the feta dressing; season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss lettuce with half the feta dressing and arrange on a platter. Cut corn kernels off the cob and slice scallions into bite-size pieces. Arrange avocado slices, corn and scallions on top of the lettuce. Serve with remaining dressing."}], "link": "https://cooking.nytimes.com/recipes/1020403-grilled-corn-and-avocado-salad-with-feta-dressing"}