{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy and Saucy Cherry Tomato Pasta", "description": "In this incredibly easy weeknight pasta, red-pepper flakes, capers and tomato paste turn a simple cherry tomato sauce into something hearty enough for cold weather. Sautéeing tomato paste until it caramelizes develops deep flavor, while pan-fried capers add crunch and red-pepper flakes provide heat. For smokier undertones, you can use dried ancho chile or chile de arbol, chipotle powder or Aleppo pepper in place of the red-pepper flakes. A dollop of ricotta, freshly grated pecorino or Parmesan, or shaved ricotta salata is not necessary, but takes the dish up a notch.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/12/04/dining/aw-cherry-tomato-pasta/aw-cherry-tomato-pasta-articleLarge-v2.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, pastas", "keywords": "basil, capers, cherry tomatoes, garlic, pasta, red pepper flakes, tomato paste, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 399}, "recipeIngredient": ["Kosher salt and black pepper", "4 tablespoons olive oil", "3 tablespoons drained jarred capers", "3 tablespoons tomato paste", "3 garlic cloves, thinly sliced", "1 to 2 teaspoons red-pepper flakes (optional)", "16 ounces orecchiette or other shaped pasta", "1 1/2 pounds cherry tomatoes, halved", "1/2 packed cup thinly sliced fresh basil, plus small whole leaves, for garnish", "Fresh ricotta, shaved ricotta salata, or grated pecorino or Parmesan, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonstick skillet, heat 2 tablespoons oil over medium-high. Pat the capers dry, then add them to the skillet and cook, stirring frequently, until crisp, 3 to 4 minutes. Using a slotted spoon, transfer the capers to a paper towel-lined plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomato paste to the skillet and cook over medium-high, stirring frequently, until tomato paste darkens in color and deepens in flavor, about 2 minutes. Reduce the heat to medium, add the remaining 2 tablespoons oil, the garlic and red-pepper flakes, if using, and cook, stirring frequently, until garlic is softened and fragrant, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta to the boiling water and reduce heat to medium. Cook according to package instructions until al dente."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta cooks, add the cherry tomatoes to the skillet, season with salt and pepper and cook over medium-high, stirring, 5 minutes. Add 2/3 cup pasta cooking water from the pot and cook, stirring occasionally, until the tomatoes start to fall apart and the liquid becomes saucy, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the pasta, and transfer it to the skillet with the sauce to combine. (If your skillet is too full to accommodate the pasta, you can transfer the cooked pasta back to the pot, then add the sauce to combine.) Stir in half the basil and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide among plates or bowls and top with capers and remaining basil, plus cheese and whole basil leaves. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020690-spicy-and-saucy-cherry-tomato-pasta"}