{"@context": "http://schema.org", "@type": "Recipe", "name": "Mini Apple Tartes Tatin", "description": "The pastry chef Claudia Fleming is known for her work with fruit desserts, and this recipe, adapted from her cult-classic cookbook, “The Last Course,” is an easy version of the classic caramelized apple tart. If you have large apples (or like large desserts), make this in a jumbo muffin tin; you’ll need more puff pastry, but everything else remains the same.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2019/11/06/dining/05Claudiarex/merlin_163577679_9ad52bec-a11a-4399-add3-6d0489437cd9-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "pies and tarts", "keywords": "apple, puff pastry, dessert, fall, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 138}, "recipeIngredient": ["1 cup/200 grams granulated sugar", "1 teaspoon light corn syrup", "4 tablespoons/55 grams unsalted butter (1/2 stick), cut into 1-inch pieces", "3 medium Granny Smith or other tart, firm apples, peeled", "8 ounces/225 grams puff pastry, preferably all-butter, thawed in the refrigerator"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1/4 cup water in a medium saucepan over low heat. Add sugar and corn syrup, increase heat to high, and cook, swirling the pan occasionally, until the mixture caramelizes into a deep amber brown, 7 to 10 minutes. Once it starts turning brown, swirl often and keep a close eye on it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat, and whisk in butter until melted and smooth. Divide among six 4-to 6-ounce ramekins, or among the cups of a nonstick 6-muffin tin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the apples in half from top to bottom. Use a melon baller or the tip of a knife to core the apple halves. Trim off any remaining peels and stems, and cut around the edges so each apple half is about the same diameter as each ramekin. Place the apple halves face down on a work surface, then slice into 1/2-inch-thick pieces, keeping the slices together so the shape of the apple half stays intact. Tuck each apple half into a ramekin or cup, with the flat side facing up and the curved back nestling into the caramel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. On a floured surface, roll out or unfold the pastry and prick all over with a fork. Using a biscuit cutter or a knife, cut out six pastry rounds that are slightly larger than the ramekins (about 1/2 inch of dough all the way around). Keep pastry rounds chilled until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pastry rounds on top of the ramekins or cups. Working your way around, use forefingers and thumbs to turn the pastry edges up and away from the apples, as if making a little round stand for each tart. Crimp the edges a bit. Tuck the pastry rounds slightly down into the ramekins; do not seal. Place the ramekins or muffin tin on a baking sheet lined with a nonstick liner or parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 15 minutes, then lower the oven temperature to 375 degrees and bake until the puff pastry is golden brown, the apples are fork-tender but not mushy, and the caramel is thick and bubbling, about 10 minutes more depending on the apples. To test, after 10 minutes, remove from the oven and slip a fork into one tart. The apples should be cooked through. Let cool in the ramekins or cups for at least 1 hour, to allow the apples to absorb the caramel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, heat oven to 350 degrees. Reheat the tarts for 3 minutes (to soften the caramel) before inverting onto individual dishes. If using a muffin tin, cover the tin with a baking sheet and use both hands to flip the pans over, so the tarts fall out onto the baking sheet. Don’t worry if some of the caramel runs out."}], "link": "https://cooking.nytimes.com/recipes/1020580-mini-apple-tartes-tatin"}