{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Slaw With Ginger and Sesame", "description": "Napa makes an excellent cabbage for grilling. Its elongated shape provides greater surface area to char — and thus smoke — over a hot fire than a round cabbage. Its leaves are less tightly packed than conventional cabbage, allowing for deep penetration of the smoke flavor. Also known as Chinese cabbage, napa cabbage is native to China and pairs well with Asian seasonings, such as sesame oil, rice vinegar and ginger. To notch up the heat, add a spoonful of Asian chile paste.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2019/08/07/dining/02slawrex2/02slawrex2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "salads and dressings, slaws, vegetables", "keywords": "fall, summer, ginger, napa cabbage, pear, rice vinegar, scallion, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "recipeIngredient": ["Canola or grapeseed oil, for brushing the grate", "1 head napa cabbage (about 2 pounds)", "1 Asian pear", "2 scallions", "2 to 3 tablespoons sesame oil, plus 3 tablespoons for the dressing", "Sea salt and freshly ground black pepper", "1 red bell pepper", "2 jalapeños", "2 tablespoons granulated sugar, plus more to taste", "1 tablespoon minced fresh ginger", "1 garlic clove, minced", "2 tablespoons rice vinegar, plus more to taste", "2 tablespoons black or toasted white sesame seeds (optional)", "1 teaspoon Chinese or Vietnamese chile paste (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Light your grill, building a hot fire and set it up for direct grilling. Brush or scrape the grill grate clean and grease it with a tightly folded paper towel dipped in canola oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut the cabbage lengthwise into quarters through the core. Cut the pear in half lengthwise and scoop out the seeds. Lightly brush the cabbage, pear and scallions all over with 2 to 3 tablespoons sesame oil and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the cabbage until darkly charred on all sides, 2 to 3 minutes per side. Char just the outside; the inside should remain cool, firm and crisp. Transfer to a sheet pan to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the cut sides of the pear until grill-marked, 2 to 3 minutes per side. Grill the scallions, bell pepper and jalapeños until grill-marked, turning halfway through, about 4 minutes. Transfer to the sheet pan. Let the vegetables cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: In a large bowl, mash together the sugar, ginger and garlic with 1/2 teaspoon each salt and pepper. Add the rice vinegar and whisk until the salt and sugar are dissolved. Whisk in the remaining 3 tablespoons sesame oil, plus the sesame seeds and chile paste, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away and discard the core of each cabbage quarter, then thinly slice the charred cooled napa cabbage crosswise, and add it to the dressing. Julienne the pear, bell pepper and jalapeño and add them to the slaw, discarding the bell pepper and jalapeño seeds. Thinly slice the scallions crosswise, discarding the root ends, and add them as well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the slaw for seasoning, adding more vinegar, sugar and salt to taste. Refrigerate until serving and serve within a couple hours of mixing."}], "link": "https://cooking.nytimes.com/recipes/1020311-grilled-slaw-with-ginger-and-sesame"}