{"@context": "http://schema.org", "@type": "Recipe", "name": "Mandarin Pancakes", "description": "These thin pancakes are typically used for wrapping <a href=\"https://cooking.nytimes.com/recipes/1020817-moo-shu-mushrooms\">moo shu pork</a> or <a href=\"https://cooking.nytimes.com/recipes/1019963-peking-duck-with-honey-and-five-spice-glaze\">Peking duck</a>. They’re made with a hot water dough, which makes them very easy to roll out. Stacking two disks of dough, rolling them out, cooking them, then carefully peeling them apart lets you make pancakes that are half as thin as a single pancake would be — and prepared in nearly half the amount of time.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2020/01/29/dining/28Kenjirex2/28Kenjirex2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "12 large pancakes or up to 20 smaller pancakes", "recipeCuisine": "chinese", "recipeCategory": "finger foods, pancakes", "keywords": "flour, sesame oil, vegetable oil, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "recipeIngredient": ["2 cups plus 2 tablespoons/280 grams all-purpose flour, plus more for dusting", "1/3 cup plus 2 tablespoons/100 milliliters boiling water", "1/3 cup plus 2 tablespoons/100 milliliters cold water", "Vegetable oil or roasted sesame oil, for brushing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place flour in a medium bowl. Add the boiling water in a thin stream while stirring with chopsticks or a wooden spoon. It helps to set the bowl in a heavy saucepan lined with a dish towel to keep it stable, or a friend stabilize the bowl as you do this. Add the cold water in a thin stream, continuing to mix the whole time. Stir the mixture until it turns into a shaggy ball, then dump the ball out onto a lightly floured work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Knead the dough with your hands until it forms a smooth ball, about 5 minutes. Cover the dough ball with a damp dish towel and let rest at room temperature for at least 30 minutes or up to a couple hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the dough into a log roughly 10 inches long, then cut it in half crosswise. Line up the two small logs, then section each one in 6ths to form 12 pieces (for approximate 8-inch pancakes); in 8ths for 16 pieces (for approximate 7-inch pancakes) or in 10ths for 20 pieces (for approximate 6-inch pancakes)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll two pieces into smooth balls between your hands, working with one piece at a time. Then, using a rolling pin or wine bottle, gently roll each of the two pieces into circular disks about 1/4-inch thick. (You’ll cook two pieces at a time and proceed through the end of Step 7 before rolling out the remaining balls.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the top of one disk with a thin, even layer of oil, then stack the second disk on top. Using a rolling pin, roll the stacked disks into a 6- to 8-inch circle. The size will depend on the number of balls you made in Step 3."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a cast-iron, carbon steel, or nonstick skillet over medium until a drop of water flicked onto the surface immediately bubbles and evaporates (about 2 minutes), then add the rolled, stacked disk. Let cook on one side until blistered and browned in spots, about 1 minute. Flip and cook until second side is blistered and browned. Sometimes the pancakes will bubble up with steam as they cook, preventing the second side from making good contact with the pan. You can gently press down on them with a flat spatula if this happens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cooked disk, then carefully peel it apart into two thin pancakes while still hot. Transfer to a plate and cover with a clean dish towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat Steps 4 through 7 for the remaining dough balls, adjusting heat as necessary to make sure the pancakes brown in spots but don’t blacken. Finished pancakes should be served while still warm. To store leftovers, place the pancakes on large squares of plastic wrap or aluminum foil, then roll them up like a jelly roll and refrigerate. Reheat covered in the microwave, or briefly heat one at a time in a hot, dry skillet."}]}