{"@context": "http://schema.org", "@type": "Recipe", "name": "Sous-Vide Turkey Breast With Maple and Rosemary", "description": "Cooking a turkey breast using sous vide makes for especially tender meat that’s never dried out. You’ll want to bring the meat to 145 degrees, which leaves it delicately pink, very juicy and perfectly safe because the long, steady heat of the sous vide machine pasteurizes the meat. That said, if you like your turkey slightly firmer and well done — more like a traditional roast bird — cook it to 152 degrees. Lastly, make sure to take the skin off the meat before cooking; the moist environment of the sous-vide bag makes it irreversibly soggy. Fans of crisp, golden skin can bake it separately instead.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/11/13/dining/08sousviderex1/merlin_163964520_0b11e0ed-3723-49db-927a-4416408e5bbe-articleLarge.jpg", "totalTime": "PT3H15M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "poultry", "keywords": "fall, main course, maple syrup, rosemary, turkey breast", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 83}, "recipeIngredient": ["1/4 cup maple syrup", "2 tablespoons unsalted butter", "3 large rosemary sprigs", "1 tablespoon kosher salt", "3 pounds boneless, skinless turkey breast, cut into halves, skin reserved if desired (see Note)", "Crisp turkey skin, optional (see Note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, simmer maple syrup, butter, rosemary and salt until the butter melts and the maple syrup thickens slightly, about 5 minutes. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the turkey in a large bowl and pour the cooled maple mixture over it, turning to coat pieces with syrup. Cover and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sous-vide machine, heat a large pot or heatproof container of water to 145 degrees. Transfer turkey to a reusable silicone sous-vide bag or resealable plastic bag, laying breasts end-to-end so the thin side of one is against the thick side of the other. Discard marinade. Slowly lower the bag into the water, allowing any air to escape. Weigh down the bags; an upside-down metal steamer basket or a metal bowl work well for this, topped with a metal spoon or tongs for extra weight, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook until the turkey reaches 145 degrees when checked in the center with a meat thermometer, 2 1/2 to 3 hours. Once the turkey is at 145 degrees, leave it in the bag in the water for an additional 15 minutes to pasteurize it. Serve immediately with crisp turkey skin, if you like, or leave turkey breast in the water at 145 degrees for up to 12 hours total."}]}