{"@context": "http://schema.org", "@type": "Recipe", "name": "Celery Salad With Apples and Blue Cheese", "description": "Celery is perhaps at its best in salad: Its flavor is at its brightest and its crunch is unapologetically assertive. Celery root complements the chopped stalks, apples add sweetness and blue cheese — celery’s classic cohort — provides punch. Flavorful enough to stand on its own, this salad isn’t so striking that it doesn’t play well with others. Celery salad makes a welcome addition to the Thanksgiving table, particularly since the crunchy salad ingredients are strong enough to stay sturdy if refrigerated overnight.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/11/20/dining/19celeryrex3/19celeryrex3-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, quick, weeknight, salads and dressings, vegetables", "keywords": "blue cheese, celery, celery root, mustard, parsley, fall, spring, summer, winter, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 134}, "recipeIngredient": ["5 tablespoons extra-virgin olive oil", "1/4 cup finely chopped shallot", "4 teaspoons coarse mustard", "1 teaspoon finely grated fresh lemon zest, plus 4 teaspoons lemon juice (from 1 lemon)", "1 teaspoon granulated sugar", "Kosher salt and freshly ground black pepper", "1 head celery, trimmed, stalks peeled and thinly sliced on the diagonal, leaves reserved", "2 tart red apples, such as Pink Lady", "1 small celery root (about 12 ounces)", "1 packed cup fresh parsley leaves, plus more for garnish", "1/2 cup coarsely chopped roasted, salted almonds", "1 cup crumbled bold, creamy but firm blue cheese (4 to 5 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the vinaigrette: In a large bowl, whisk together the olive oil, shallot, mustard, lemon zest and juice, and sugar; season to taste with salt and pepper. Add the sliced celery and toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Core the apples, then slice them lengthwise into very thin wedges using a knife or mandoline. Add to the sliced celery and toss to coat. Peel or slice off the outer skin and layers of the celery root until no brown skin remains. Cut the celery root in half lengthwise, then slice into very thin half-moons using a knife or a mandoline. Add to the celery and apple mixture and toss to coat. (The salad will hold up fairly well refrigerated for 1 to 2 hours — or even overnight — from this point.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, add the parsley, almonds and half the cheese, and toss to combine; season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a shallow serving bowl or platter; top with the remaining cheese, the reserved celery leaves and fresh parsley leaves. Serve immediately."}]}