{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Tenderloin With Red Wine, Anchovies, Garlic and Thyme", "description": "“How To Eat” by Nigella Lawson is a cookbook, but one of its great joys is its narrative form: Very few of the recipes are written in standard recipe format. This recipe, from the Dinner chapter, is an exception. “This, to me, is the perfect dinner,” Ms. Lawson writes, “simple, impeccable, beautiful.” She suggests serving it with a pea and avocado salad, and adding arugula leaves not only for decorative reasons but also because “its pepperiness perfectly offsets the salty pungency of the anchovy-red-wine sauce.”", "author": {"@type": "Person", "name": "Besha Rodell"}, "image": "https://static01.nyt.com/images/2019/02/20/dining/20nigellarex-horizontal/merlin_150586146_70e47f46-ab23-4191-ba03-c1f0b34a6e47-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "meat", "keywords": "anchovies, arugula, beef tenderloin, red wine, shallot, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 150}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 599, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "2 grams", "proteinContent": "36 grams", "saturatedFatContent": "16 grams", "sodiumContent": "682 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons unsalted butter (1/2 stick), 2 tablespoons cut into small dice and chilled", "2 tablespoons extra-virgin olive oil", "8 shallots, sliced or minced", "Kosher salt", "2 teaspoons fresh thyme leaves or 1 scant teaspoon dried thyme", "8 garlic cloves, peeled and crushed with the flat side of a chef’s knife", "12 anchovy fillets packed in olive oil, drained and minced", "2 pieces beef tenderloin, 1 1/2 pounds each, trimmed and cleaned", "Freshly milled black pepper", "2 teaspoons sugar", "1/4 cup brandy", "1 1/4 cups good red wine", "Fresh arugula, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, heavy-bottomed Dutch oven or pot in which the beef will fit comfortably (the two pieces mustn’t touch each other, and no scrunching at the ends), heat 2 tablespoons butter and 1 tablespoon oil over lowish heat. Add the shallots, sprinkle with a little salt, and sauté until soft and transparent but in no way coloring, about 5 minutes. Add the thyme and give 2 more minutes, stirring, then add the garlic and push about the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the anchovies and cook until they’ve started fusing with the oniony, buttery, oily mess in the pot. Transfer this shallot mixture to a bowl for a minute so you can brown the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 1 tablespoon oil to the pot and turn up the heat. Pat the beef dry and season it all over with salt and pepper. Sear the beef on all sides, sprinkling with the sugar as you do so, till you’ve got a good crusty exterior. Add the brandy, let it bubble up a bit, then pour in the wine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the shallot mixture to the pot. Lower the heat and turn the meat over. Give everything a good stir to make sure the shallots, garlic and so on are not burning or sticking. Cover and cook for 10 minutes — the meat is braising, frying and steaming all at the same time; as it cooks it breathes in flavor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover, peek in, prod or poke. If the meat is springy, it’s rare; springy but with some resistance, medium-rare to medium. Turn the meat over, cover again, and leave for another 5 to 10 minutes, depending on your findings and taste. When the meat is almost as you like it, transfer it to a cutting board (it will cook a little more as it rests) and get on with the sauce. And you can do all this before you sit down for the first course."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fish out the garlic from the pot with a spoon. Then turn up the heat and let the sauce bubble up a good bit, and taste, adding salt, if needed, and pepper. You may want to add some water. Take off the heat, but warm up before serving, at which time you should first pour into it the meat juices that have run out of the cooked beef as it stands and whisk in the remaining chilled, diced butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carve the beef, arrange on a large, warmed platter, and surround with arugula. Drizzle over some of the sauce, leaving the rest in a sauce boat or pitcher for people to pour for themselves."}]}