{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Salsa Verde Chicken", "description": "This warming, satisfying stew takes about 30 minutes from start to finish, thanks to the pressure cooker, which makes quick work of braising chicken and melding flavors. Use your favorite jarred green salsa as a shortcut: The salsa mingles with the chicken juices to make a thick, tangy sauce that tastes like more than the sum of its parts. (Jarred salsas vary in heat levels, so be sure to taste yours first. Make the dish spicier by leaving some of the jalapeño seeds in.) Serve the chicken over rice or whole grains, which soak up the sauce, or use the chicken in tacos, burritos or enchiladas. You can also add one cup of frozen or fresh corn, or a drained 15-ounce can of black or pinto beans to the cooked chicken and simmer until just warmed through. Pass around toppings like crunchy pepitas, tortilla chips, crumbled queso fresco or avocado, to customize at will.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/11/25/dining/sd-pressure-cooker-salsa-verde-chicken/sd-pressure-cooker-salsa-verde-chicken-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry", "keywords": "chicken thigh, chili, cilantro, cumin, garlic, jalapeño, lime, salsa verde, scallion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 296}, "recipeIngredient": ["1 1/2 pounds boneless, skinless chicken thighs", "1 1/2 cups jarred salsa verde", "1 (4-ounce) can mild chopped green chiles", "8 garlic cloves, finely chopped", "1 jalapeño, stemmed, seeded and diced", "1 teaspoon garlic powder", "1 teaspoon onion powder", "1 teaspoon ground cumin", "3 scallions (green and white parts), thinly sliced", "1 small bunch cilantro, leaves and tender stems finely chopped (about 1 heaping cup)", "Kosher salt, to taste", "Fresh lime juice, to taste", "Any combination of cooked rice, tortillas, pepitas, queso fresco, diced avocado and crushed tortilla chips, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken, salsa verde, canned chiles, chopped garlic, jalapeño, garlic powder, onion powder and cumin to a 6- to 8-quart electric pressure cooker; stir to combine. (Don’t add salt yet, as many jarred salsas are high in sodium.) Close the lid and turn the pressure knob to sealed. Cook on high pressure for 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the pressure cooker and allow the pressure to release naturally for 10 minutes, then release the remaining pressure manually. Open the lid. If you would like to reduce the sauce, remove the chicken with a slotted spoon to a bowl and turn on the simmer function; let the sauce bubble for about 5 minutes, stirring occasionally, to thicken. Add the chicken back into the pot if you have removed it. Use two forks to coarsely shred the chicken. Stir in the scallions and cilantro. Taste, and season with salt and lime juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve in bowls, alone or with rice, or in tortillas, with desired toppings."}], "link": "https://cooking.nytimes.com/recipes/1020670-pressure-cooker-salsa-verde-chicken"}