{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Clams With Garlicky Toasts", "description": "There’s nothing more satisfying than a big potful of steamed clams. To say they practically cook themselves is perhaps a slight exaggeration. Yet if your fish cooking skills are wanting, know this: Making clams really is dead simple. Here, they’re paired with lots of herbs and split baguettes. The toasts might seem large, but it’s all part of their appeal. Display them dramatically atop each bowl, before using them to sop up the broth.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/08/16/dining/16kitchrex-clams01/merlin_158850465_d261a4df-5bb7-4470-8025-26c0198fd054-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, quick, weekday, seafood", "keywords": "baguette, basil, cilantro, clams, parsley, scallion, serrano pepper, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 98}, "recipeIngredient": ["5 tablespoons extra-virgin olive oil", "1 cup chopped scallions, trimmed, white and green parts (from 2 bunches)", "3 garlic cloves, minced, plus 2 whole garlic cloves, peeled", "2 serrano peppers, finely chopped", "1 cup dry white wine", "1 cup chicken broth", "4 pounds littleneck or Manila clams, scrubbed", "1 baguette, split lengthwise, then halved crosswise ", "½ cup roughly chopped parsley (from 1 small bunch)", "1 cup roughly chopped cilantro leaves and tender stems (from 2 bunches)", "1 packed cup small basil leaves (from 1 bunch), preferably Asian basil but Genovese basil is fine", "Lemon or lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a heavy-bottomed soup pot or Dutch oven over medium-high heat and add 2 tablespoons olive oil. When oil is hot, add scallions and let sizzle for a minute without browning. Add garlic and peppers, stir and let sizzle for 15 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wine and broth, and turn heat to high. Add clams, and clamp on lid. Cook for 7 or 8 minutes, stirring once or twice, until all clams have opened. Turn off heat and keep pot covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As clams cook, prepare the baguette: Under the broiler, toast the bread cut-side up until it’s golden. Rub the cut side of baguette with a peeled garlic clove and and drizzle each of the four pieces with about 1/2 tablespoon olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, throw parsley, cilantro and basil into the pot and stir well to distribute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle clams and broth into big soup bowls. Serve with garlic toasts for sopping and lemon wedges. For a dramatic presentation, set a single long toast atop each bowl."}]}