{"@context": "http://schema.org", "@type": "Recipe", "name": "Tangerine Sorbet With Sake", "description": "Even people who don’t want dessert can manage a bowl of fruit sorbet. This one is exceedingly easy, and makes a perfect ending to any meal. Made with fresh tangerine juice and a small amount sugar, the sorbet mixture needs a bit of alcohol to keep it from freezing solid. A little sake does the trick here, while a splash of sake at serving time adds interest. If you’re not a fan of sake, use flavorless vodka in the base, and a citrus-infused vodka or citrus liqueur to finish. The alcohol gives the sorbet a softer consistency, but you can omit it if you wish.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/01/03/dining/03tanisrex3-sorbet/merlin_166405122_0e7a5915-0f6c-4960-8d8f-ba57f7d11607-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "easy, ice creams and sorbets", "keywords": "confectioners' sugar, sake, tangerine juice, dessert, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 144}, "recipeIngredient": ["3 cups freshly squeezed tangerine juice, with pulp, from about 4 pounds tangerines (about 12 large)", "3/4 cup confectioners’ sugar", "1/2 cup sake, plus more for serving", "Citrus leaves, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put tangerine juice, confectioners’ sugar and 1/2 cup sake in a blender and whiz briefly to combine. Transfer to the bowl of an ice cream machine, and churn according to manufacturer’s instructions. (It should be about 20 to 30 minutes, until mixture thickens and holds its shape in a spoon.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to an airtight container and keep in freezer compartment for at least 2 hours. (Sorbet will keep in the freezer up to two weeks.) To serve, put scoops in small, chilled bowls. Add 2 tablespoons of sake to each bowl. Garnish each with citrus leaf."}]}