{"@context": "http://schema.org", "@type": "Recipe", "name": "Pistachio and Cherry Bombe", "description": "This bombe was born of an accident and requires a little patience, lots of ice cream and a willingness to get crafty. Don’t be afraid to mix the biscotti dough by hand and play around when you are shaping it into your bowl. It won’t look perfect, but the bombe will be pristine. Confectioners’ sugar, cherries and grated pistachios are your allies to make this dish scream of delight. This bombe is frivolity at its finest, so don’t take the process of making it too seriously.", "author": {"@type": "Person", "name": "Clare de Boer"}, "image": "https://static01.nyt.com/images/2019/08/29/dining/Clare-de-Boer-Bomb/merlin_158698995_49437d7a-57bb-45da-82e1-837375b1ec9f-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "16 to 20 servings", "recipeCuisine": "", "recipeCategory": "cakes, ice creams and sorbets, project", "keywords": "cherries, honey, pistachio, vanilla ice cream, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 144}, "recipeIngredient": ["5 cups/750 grams shelled, raw unsalted pistachios", "1 1/2 cups/300 grams granulated sugar", "3 lemons, zested (about 2 1/2 tablespoons)", "2 tablespoons honey", "6 egg whites", "1/2 pound sweet cherries, pitted (about 1 1/2 cups)", "2 tablespoons granulated sugar", "3 1/2 pints vanilla ice cream, softened", "Confectioners’ sugar, for serving", "Shelled, raw unsalted pistachios, for garnish", "Cherries, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, grind the pistachios and granulated sugar into a fine meal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pistachio meal to a medium bowl; add the zest, honey and egg whites and combine the ingredients using your hands until fully integrated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a parchment-lined baking sheet, pressing evenly until about 1/3-inch thick, and bake at 350 degrees for 25 to 30 minutes. The mixture should still be soft and pliable, like the center of a chewy cookie, with some color on top. When you poke it with your finger, the dent should remain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 10- to 12-inch, freezer-proof bowl (about 4 quarts) with parchment paper and plastic wrap, allowing enough overhang to cover the top of the bowl. Set aside about one-third of the biscotti dough (this will form the bombe’s base later) and press the remaining dough into the bowl while the dough is still warm. (The layer should be as even and thin as possible, ideally about 1/3-inch thick.) Set aside until completely cooled to room temperature, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, roll out the remaining biscotti dough into a rough circle between two pieces of clean parchment paper. It should be about 1/3-inch thick. Trim it to fit the opening of the bowl. Set aside to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: In a medium saucepan, cook the cherries with the granulated sugar over medium heat for 10 minutes; they should be sweet and soft with a good amount of liquor. Set aside to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove 2 pints of ice cream from the freezer to soften slightly, about 10 minutes. When the biscotti bowl has cooled and the ice cream is easily scoopable but not at all runny, spoon 2 pints of ice cream into the center of the pistachio bowl and spread evenly with a spatula in the bottom and up the sides, about 1-inch thick. Place a nesting bowl or any smaller bowl in the center and use the bowl to tamp the ice cream down. Transfer the large bowl to the freeze to chill until firm, 2 to 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove another pint of ice cream from the freezer and let soften 10 minutes at room temperature. In a medium bowl, fold the cooled cherries and their juices into 1 pint of ice cream, leaving some pockets of vanilla. Spoon this mix into the center of the biscotti bowl (which is now covered with a frozen layer of plain vanilla ice cream). Freeze until firm, 2 to 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the remaining 1/2 pint vanilla ice cream on top of the cherry layer. Cover the top of the bowl with the rolled-out remaining biscotti and tamp down. Freeze at least 8 hours, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, turn the bombe out onto a plate. Sift confectioners’ sugar on top. Using a Microplane, grate pistachios all over the top of the bombe. More cherries are a lovely garnish. Slice and serve immediately."}]}