{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom-Farro Soup With Parmesan Broth", "description": "This dish is layered in earthiness and umami thanks to its ingredient list: farro, dried and fresh mushrooms, shallots and <a href=\"https://cooking.nytimes.com/recipes/1020934-parmesan-broth\">Parmesan broth</a>. Farro is a rustic grain, hearty enough to maintain its integrity and stand up to a long simmer. Similar to arborio rice, pearled farro readily releases its starch as it cooks, thickening the broth and marrying the ingredients in a blissful union. A pinch of fennel pollen at the end is a classy move, though absolutely not mandatory.", "author": {"@type": "Person", "name": "Julia Sherman"}, "image": "https://static01.nyt.com/images/2020/03/18/dining/13Parmrex2/merlin_170016963_2dc24af0-de4a-4520-82c0-b8aaf88b9dc5-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, grains and rice, soups and stews, vegetables", "keywords": "dried mushrooms, farro, parmesan, shallot, sherry vinegar, thyme, white wine, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 138}, "recipeIngredient": ["1 cup pearled farro", "1 ounce dried mixed mushrooms or dried porcini mushrooms, roughly torn or chopped", "1 tablespoon unsalted butter", "4 tablespoons extra-virgin olive oil", "1 cup minced shallots (from about 5 medium shallots)", "Kosher salt and freshly ground black pepper", "3 garlic cloves, minced", "5 cups <a href=\"https://cooking.nytimes.com/recipes/1020934-parmesan-broth\">Parmesan broth</a>", "1/3 cup dry white wine", "5 fresh thyme sprigs", "2/3 cup finely grated Parmesan (about 1 ounce), plus more for garnish", "1 pound mixed fresh mushrooms (such as beech mushrooms, hen of the woods or oyster mushrooms), roughly torn", "2 teaspoons sherry vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees and bring a small saucepan of water to a boil. Spread farro out on a baking sheet in a single layer and toast for 20 minutes, stirring once or twice to toast the grains evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While farro toasts, place dried mushrooms in a small bowl and cover completely with 1 1/2 cups hot water from the saucepan. Cover the bowl and set aside to hydrate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large Dutch oven over medium-high heat and add the butter and 1 tablespoon olive oil. Once the butter has melted, add the shallots and 1/2 teaspoon salt and sauté until translucent, 3 to 5 minutes. Add the garlic and sauté for 2 minutes, adding a splash of water if necessary to prevent it from scorching."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the toasted farro. Carefully scoop the dried mushrooms from their soaking liquid and add them to the pot. Strain their soaking liquid through a fine-mesh sieve into the pot as well, discarding any grit left in the sieve. Add Parmesan broth, white wine and thyme to the pot and bring to a boil over high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once liquid boils, lower to a simmer and cook, covered, for 25 minutes. Uncover the pot and continue to cook at an active simmer until the farro is al dente, swimming in a lightly creamy broth, another 25 minutes. Remove from the heat, discard thyme stems and stir in the grated Parmesan. Season with black pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the farro is almost done, cook the fresh mushrooms: Heat 1 1/2 tablespoons olive oil in a large (12-inch) skillet over medium-high. Add half the torn fresh mushrooms, stir to coat, then cook, undisturbed, for 2 minutes. Season with salt and pepper, then cook until the mushrooms are golden and caramelized, 1 to 2 minutes. Transfer the mushrooms to a medium bowl. Repeat with remaining 1 1/2 tablespoons oil and remaining fresh mushrooms, transferring cooked mushrooms to bowl. Stir 2 teaspoons vinegar into cooked mushrooms; season to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle soup into shallow bowls. Top with seared mushrooms and extra Parmesan, to taste."}], "link": "https://cooking.nytimes.com/recipes/1020933-mushroom-farro-soup-with-parmesan-broth"}