{"@context": "http://schema.org", "@type": "Recipe", "name": "Buttermilk Banana Pudding With Salted Peanuts", "description": "Banana pudding typically sits on the sweeter side of the dessert spectrum. Despite layers of instant pudding, vanilla cookies, sliced bananas and meringue or whipped cream, the sweet snack can feel a little one-note. But with a few simple tweaks and some new ingredients, it can feel fresh. The addition of buttermilk gives the custard a tangy zip of acidity, and tossing the Nilla Wafers with salted brown butter imparts a nutty, caramel-like flavor. Sour cream is incorporated into the whipped-cream topping, which helps the heavy cream stay firm while refrigerated and turning this into a fail-proof make-ahead dish. Garnishing the top with some more crushed cookies and chopped salted peanuts provides the pudding with crunch.", "author": {"@type": "Person", "name": "Grant Melton"}, "image": "https://static01.nyt.com/images/2019/06/26/dining/gm-banana-pudding/gm-banana-pudding-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "snack, custards and puddings", "keywords": "banana, buttermilk, heavy cream, peanut, vanilla, dessert, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 128}, "recipeIngredient": ["2 cups whole milk", "1/2 cup heavy cream", "1 teaspoon vanilla extract", "3/4 cup granulated sugar", "4 egg yolks", "2 tablespoons cornstarch", "1/2 teaspoon kosher salt", "1 cup buttermilk", "4 tablespoons salted butter (1/2 stick)", "1 (11-ounce) box vanilla wafer cookies, such as Nilla Wafers", "1 1/2 cups heavy cream", "1/2 cup sour cream", "1/2 cup confectioners’ sugar", "4 large bananas, sliced", "1/2 cup salted peanuts, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pudding: Add milk, heavy cream and vanilla extract to a medium saucepan and heat over medium. Meanwhile, whisk together sugar, egg yolks, cornstarch and salt in a medium heatproof bowl. Once the milk begins to bubble slightly around the edges, remove from heat. Slowly pour a ladleful of the warm milk into the yolk mixture, whisking constantly. Continue to slowly incorporate the rest of the warm milk, ladle by ladle, into the yolk mixture until thoroughly combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the mixture back into the saucepan and heat over medium. Whisk until the mixture begins to bubble and is thick enough to coat the back of a spoon, 2 to 3 minutes. Pour the warm pudding into a large heatproof bowl and let cool for 5 minutes before whisking in the buttermilk. Place plastic wrap over the pudding, gently pressing the wrap to touch the top of the pudding. Refrigerate for at least 3 hours before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cookie layer: Add the salted butter to a large sauté pan or deep skillet and melt over medium-low. Cook, stirring often, until the butter begins to foam. Once the butter gives off a nutty scent and darkens to a caramel-like color, about 4 minutes, remove the pan from the heat and add the wafers. Toss the Nilla Wafers to coat them with butter. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the whipped cream: Whip 1½ cups heavy cream in a stand mixer fitted with the whisk attachment or with a hand mixer on medium-high until it forms soft peaks, about 3 minutes. Turn off the mixer and add the sour cream. Turn the mixer on low and gradually add the confectioners’ sugar. Once incorporated, whip on high until the cream has formed soft peaks again. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve 12 Nilla Wafers for garnish. Pour the rest of the cookies into a 9-by-13-inch baking dish and arrange in an even layer. Scatter the sliced bananas evenly on top. Pour the chilled pudding over the bananas and spread the pudding in an even layer to coat. Top with the whipped cream mixture. Cover and refrigerate overnight (or at least 4 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the remaining Nilla Wafers in a plastic bag and crush them with a rolling pin. Remove the pudding from the refrigerator and garnish with crushed cookies and chopped peanuts just before serving."}], "link": "https://cooking.nytimes.com/recipes/1020277-buttermilk-banana-pudding-with-salted-peanuts"}