{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy White Bean and Fennel Casserole", "description": "This one-pan recipe melds roasted fennel, creamy white beans and salty Parmesan, and tops it with crunchy lemon-zested panko. Fennel is often dismissed because of its perceived licorice notes, but the anise flavor is significantly muted after the vegetable is cooked. Tuck fresh, sliced sausages into the mixture before baking to imitate a simplified cassoulet, turn it into a side dish by pairing it with meat or let the dish live as a main, served with a simple green salad and some rustic bread to sop up the sauce. Reserve the fresh fennel fronds for garnish, which add concentrated fennel flavor and a pop of green.", "author": {"@type": "Person", "name": "Aaron Hutcherson"}, "image": "https://static01.nyt.com/images/2019/03/06/dining/ah-fennel-casserole/merlin_151073283_9551fdf3-732d-47ba-9d8a-5b8022cb32db-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "easy, casseroles, vegetables", "keywords": "fall, winter, fennel, heavy cream, panko, parmesan, white beans, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 703}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 426, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "11 grams", "proteinContent": "14 grams", "saturatedFatContent": "7 grams", "sodiumContent": "766 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["6 tablespoons olive oil", "2 large fennel bulbs (about 2 pounds)", "Kosher salt and black pepper", "2 garlic cloves, minced", "2 (14-ounce) cans white beans, such as cannellini, great Northern or navy", "1/2 cup heavy cream", "1 teaspoon fresh lemon zest plus 2 tablespoons juice (from 1 lemon)", "1/2 cup panko", "1/2 packed cup finely grated Parmesan (about 1 ounce)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Trim the fennel. Cut it in half lengthwise and slice it crosswise, about 1/4-inch thick (reserve about 1/4 cup roughly chopped fennel fronds). Heat 2 tablespoons oil in a large cast-iron skillet over medium. Add the sliced fennel, season with salt and pepper and cook, stirring occasionally, until softened but still retaining a little bite, about 12 minutes. Stir in the garlic and cook until fragrant, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, pour 1 can white beans and its liquid into a blender. Add the heavy cream, lemon juice and 2 tablespoons olive oil and purée until smooth. Drain and rinse the remaining can of beans and transfer it to the skillet along with the bean purée. Season generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the panko with the remaining 2 tablespoons olive oil in a small bowl. Add the Parmesan, lemon zest and 1/2 teaspoon pepper and toss to coat. Sprinkle evenly over the fennel-white bean mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until bubbly and lightly golden on top, about 15 minutes. Broil until topping is browned in spots, 1 to 2 minutes, if desired. Top with reserved fennel fronds and serve."}]}