{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Irish Oatmeal With Cream and Crunchy Sugar", "description": "A shower of heavy cream and plenty of caramelized Demerara sugar may make these Irish oats seem more like dessert than something you’d serve first thing in the morning, but that’s all the more reason to bake them up for a special occasion breakfast or brunch. Cardamom and cinnamon give them an especially earthy, perfumed aroma, and toasting the oats in butter before baking them lends nuttiness and depth. They’re also extremely easy, and you can assemble the dish the night before, then bake them in the morning. Just add about 10 minutes to the baking time if you’re starting them cold from the fridge.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/12/25/dining/20apperex3/merlin_166104195_4045c81d-9fb8-4a6a-bf71-cbea868ba894-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, grains and rice", "keywords": "demerara sugar, heavy cream, steel-cut oats, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 329}, "recipeIngredient": ["6 tablespoons unsalted butter, plus more for greasing the pan", "2 cups steel-cut oats", "1 teaspoon ground cardamom", "1 teaspoon ground cinnamon", "6 1/2 cups boiling water", "1/2 cup heavy cream, plus more for serving", "1/2 teaspoon kosher salt", "1/2 cup Demerara sugar, plus more for serving", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Butter a 2-quart shallow gratin or baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut 2 tablespoons butter into small cubes, and put them in the refrigerator until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, melt remaining 4 tablespoons butter. Add the oats and sauté until they smell nutty and toasted, 2 to 4 minutes. Stir in the cardamom and cinnamon, and sauté for another minute, until fragrant. Scrape oats into the buttered baking pan and stir in the boiling water, cream and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake oats for 40 minutes, then give them a stir. Sprinkle sugar all over the oats, and scatter reserved cubed butter on top. Continue to bake for 15 to 20 minutes longer, until the top is glazed and bubbling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle oatmeal with flaky sea salt, if you like. Serve oats with more cream and sugar on the side."}]}