{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramelized Onion and Poppy Seed Hamantaschen", "description": "Traditionally filled with apricot, prune or poppy seed jam, triangular hamantaschen cookies are a prized treat for the Jewish holiday of Purim. This dessert serves as a reminder of the Jewish people’s deliverance from Haman, who sought to exterminate Persia’s Jews in the fifth century B.C. This recipe is fully savory, tucking crumbled feta under thyme-scented caramelized onions, but you could just as easily fill the buttery dough with sweet jam to please traditionalists. When forming hamantaschen pastries, make sure to leave an opening wide enough for the filling to be visible but small enough to retain moisture.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2019/03/13/dining/13purim-A1-ref/merlin_151680807_a7c32aeb-94d0-45a8-b0a2-16b0cb62b9ae-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "About 36 hamantaschen", "recipeCuisine": "jewish", "recipeCategory": "snack, finger foods, pastries", "keywords": "feta, honey, onion, poppy seed, thyme, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 69}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 72, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "2 grams", "sodiumContent": "49 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups/255 grams unbleached all-purpose flour", "2 tablespoons granulated sugar", "1 teaspoon baking powder", "Kosher salt", "10 tablespoons/140 grams cold unsalted butter, cut into cubes", "1 1/2 teaspoons balsamic vinegar", "1 large egg, yolk and white separated", "Ice water, as needed", "1 tablespoon extra-virgin olive oil", "1 large onion, halved and very thinly sliced", "2 fresh thyme sprigs", "1 fresh or dried bay leaf", "1 teaspoon honey", "Freshly ground black pepper", "1 tablespoon poppy seeds", "3 ounces good-quality feta or goat cheese, crumbled (about 1/2 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the flour, sugar, baking powder and 1 teaspoon salt in the bowl of a food processor. Add 9 tablespoons butter and pulse until coarse crumbs form. Add 1/2 teaspoon balsamic vinegar and the egg yolk and pulse, adding 2 to 3 tablespoons or so of ice water if needed to form a soft dough. Wrap the dough in waxed paper or plastic wrap and refrigerate, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the oil and the remaining 1 tablespoon butter in a medium nonstick pan over medium-low. Add the onion, thyme, bay leaf and honey, season with salt and pepper and cook, stirring occasionally, until caramelized, about 20 minutes. Discard the thyme sprigs and bay leaf. Stir in the poppy seeds and the remaining 1 teaspoon balsamic vinegar and season to taste. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the dough from the fridge, heat the oven to 375 degrees and cover 2 large baking sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the dough onto a floured surface until 1/8 inch thick. Using a 2 1/2-inch round mold or glass, cut the dough into rounds. Top each round with a hefty pinch of cheese in the center, then a heaping teaspoon of the cooled onion mixture. Working with one round at a time, dip a pastry brush or your finger into the egg white and moisten the edges of the excess dough surrounding the filling. Fold up 3 sides of the round to form a triangle, partly covering the filling with the dough, and pinch the dough firmly at all 3 tips of the triangle. Transfer to the parchment-lined baking sheets and repeat to make about 36 hamantaschen."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden, rotating midway through baking, 15 to 20 minutes, then serve warm."}], "link": "https://cooking.nytimes.com/recipes/1020075-caramelized-onion-and-poppy-seed-hamantaschen"}