{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Chocolate Chip Pancakes", "description": "Here’s a clever trick for making a big batch of pancakes that will save you from spending all morning at the stove: Bake them all at once on a sheet pan. In this recipe, the batter comes together like biscuit dough by cutting the cold butter into the flour before adding the liquid. This cuts down on gluten production, which means fluffier pancakes. For wonderfully crisp edges, heat the sheet pan in advance, so the batter starts cooking as soon as it’s poured into the pan. If you like, you can stir a teaspoon of vanilla extract into the batter, sprinkle it with finely chopped fruit, or mix and match toppings to please the crowd.", "author": {"@type": "Person", "name": "Jerrelle Guy"}, "image": "https://static01.nyt.com/images/2019/08/14/dining/jg-sheet-pan-pancakes/jg-sheet-pan-pancakes-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, easy, pancakes", "keywords": "butter, buttermilk, chocolate chips, maple syrup", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 872}, "recipeIngredient": ["3 tablespoons unsalted butter, softened, plus 8 tablespoons/115 grams unsalted butter (1 stick), cut into 1/2-inch cubes and chilled", "1 1/2 cups/360 milliliters cold buttermilk", "1 1/2 cups/360 milliliters cold whole milk", "3 cups/385 grams all-purpose flour", "1/4 cup/50 grams granulated sugar", "1 tablespoon baking powder", "1 teaspoon baking soda", "3/4 teaspoon kosher salt", "3/4 cup/125 grams mini chocolate chips", "Maple syrup, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. Grease a 13-by-18-inch sheet pan using 1 tablespoon softened butter, then line it with parchment paper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large measuring cup, combine the buttermilk and milk; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, add the flour, sugar, baking powder, baking soda and salt, and blend until combined, about 30 seconds. Sprinkle the chilled butter cubes on top and pulse the mixture until the butter is coarse and sandy, and some pieces are the size of peas. Transfer the mixture to a large bowl and pour the buttermilk mixture on top. Whisk to combine, then let stand for 5 minutes. Place the prepared sheet pan in the oven on the middle rack to heat while the batter sits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the hot pan from the oven, add the remaining 2 tablespoons softened butter to the pan and return to the oven until the butter is melted and bubbling, about 1 minute. Remove the pan and carefully tip to spread the melted butter around. Working quickly, stir the risen batter one final time and pour it into the center of the pan, tipping the pan again to spread the batter evenly. Sprinkle the chocolate chips evenly over the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pan to the oven and bake until cooked through, 13 to 15 minutes. Broil until the top turns golden brown, 1 to 2 minutes. Let cool slightly then cut into squares. Serve warm, with maple syrup, if desired."}], "link": "https://cooking.nytimes.com/recipes/1020402-sheet-pan-chocolate-chip-pancakes"}