{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Artichoke Pasta With Creamy Goat Cheese", "description": "This cheese-filled pasta bake gets its sweet and crunchy topping from a layer of canned fried onions and Parmesan cheese sprinkled on top. Canned artichokes give it a savory depth, while a combination of goat cheese, cream cheese and mozzarella make it wonderfully gooey. Make sure to use plain — not marinated — artichokes, which will be too sharp and acidic here. You’re looking for a mellow richness in this comforting casserole.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/09/25/dining/20canrex1/merlin_160763187_bd4b82e1-8ff7-4614-ae45-1c4cf4c92a76-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, pastas", "keywords": "artichoke hearts, cream cheese, fried onions, goat cheese, mozzarella, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 734}, "recipeIngredient": ["Salt, as needed", "1 pound fusilli, farfalle or other short pasta", "2 tablespoons extra-virgin olive oil, plus more for serving", "1 large bunch scallions, thinly sliced, whites and greens separated", "4 fat garlic cloves, thinly sliced", "1/4 teaspoon red-pepper flakes, plus more for serving", "8 ounces cream cheese (1 cup), cubed", "6 ounces goat cheese, cubed", "2 (14-ounce) cans artichoke hearts (not marinated), drained and cut into 1-inch pieces", "2 cups canned fried onions", "6 ounces shredded mozzarella cheese (1 1/2 cups)", "1 cup chopped parsley", "1 cup chopped fresh dill", "1 teaspoon ground black pepper", "1/2 cup grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees and bring a large pot of heavily salted water to a boil. Cook fusilli according to package directions until 3 minutes shy of al dente. Reserve 3 cups pasta water, then drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large oven-proof skillet, heat oil in a large skillet over medium heat. Cook scallion whites until softened, about 5 minutes, then add garlic and cook another 1 minute. Stir in red-pepper flakes, and cook another 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in 1 1/2 cups pasta water, cream cheese and goat cheese, and simmer, whisking, until smooth. Stir in artichokes, 1 cup fried onions, the mozzarella, the parsley, the dill and the reserved scallion greens, then stir in cooked pasta and black pepper. Add more pasta water if it seems too dry; you want this to be fairly liquid, because the pasta will soak up the sauce as it bakes. Taste and add some salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top pasta with remaining cup of fried onions and the Parmesan. Bake until filling is bubbly and onions are browned, about 10 to 20 minutes. Serve drizzled with olive oil, and with more red-pepper flakes on the side if you like."}]}