{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Pork With Whole Spices and Garlic Bread", "description": "Deeply flavored from a rub of fennel, coriander, caraway and cumin, and crisp-edged from the grill, this pork feeds a crowd, and most of the work can be done in advance. You can use either boneless loin or shoulder here: The shoulder is chewier, brawnier and more irregular in shape, while the loin is neater to slice and softer to eat. But both are delicious, especially when showered with fresh lemon or lime juice at the end to cut the richness. You don’t have to make the buttery garlic bread, but its herbal flavors go well with the smoke and char of the meat. If you do skip it (your loss), serve the pork strewn with plenty of fresh, bright herbs. If you’re not grilling, you can roast the pork in a 500-degree oven for 20 to 30 minutes, flipping it halfway. Then run it under the broiler at the end to sear the fat.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/05/29/dining/24apperex/merlin_154665933_7c505765-cddd-4137-bcb7-42eb68d7d1a9-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "12 to 16 servings", "recipeCuisine": "", "recipeCategory": "dinner, barbecues, meat, project", "keywords": "bread, butter, garlic, pork shoulder, thyme, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 210}, "recipeIngredient": ["1/4 cup fresh thyme leaves, plus more for serving", "4 teaspoons coarse kosher salt", "1 tablespoon cumin seeds", "1 tablespoon coriander seeds", "1 1/2 teaspoons fennel seeds", "1 1/2 teaspoons caraway seeds", "1 1/2 teaspoons black peppercorns", "1/2 teaspoon red-pepper flakes, plus more for serving", "12 garlic cloves, finely grated or minced", "3 tablespoons extra-virgin olive oil", "1 1/2 teaspoons red-wine vinegar", "5 to 6 pounds boneless, skinless pork shoulder or loin, butterflied (see Note)", "Lemon or lime wedges, for serving", "3/4 cup unsalted butter (1 1/2 sticks)", "1/2 cup extra-virgin olive oil", "1/3 cup finely minced parsley", "2 tablespoons chopped fresh basil", "5 garlic cloves, finely grated or pounded into a paste", "1 teaspoon kosher salt, plus more to taste", "1/2 teaspoon freshly ground black pepper", "3/4 teaspoon dried oregano", "1/4 teaspoon red-wine vinegar", "Pinch of red-pepper flakes, plus more to taste", "2 (12-inch) loaves French or Italian bread, halved lengthwise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pork: Using a mortar and pestle, pound together the thyme, salt, cumin, coriander, fennel, caraway, peppercorns and red-pepper flakes until the spices are well cracked but not ground. (Or do this in a spice grinder, but take care not to grind the spices.) Add garlic, oil and vinegar, and pound into a paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread paste all over pork, covering the meat thoroughly and evenly. Place the meat on a rimmed baking sheet, cover with plastic wrap or an overturned rimmed baking sheet, and marinate in the refrigerator for at least 6 hours or up to 48 hours (the longer, the better)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the butter for the garlic bread: In a small saucepan, melt the butter with the olive oil. Add the parsley, basil, garlic, salt, pepper, oregano, vinegar and red-pepper flakes, and simmer until fragrant, 1 to 2 minutes. Taste and add more salt if needed. Set aside until ready to grill. If the butter solidifies, place it back on the heat until it liquefies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the grill or light the coals. Lay the pork out on the grill so it is as flat as possible. Cover grill and let the meat cook until char marks appear on one side, 7 to 12 minutes. Use tongs and a large spatula to flip the meat. Continue to grill on the other side until cooked to taste, 135 degrees for medium, about 5 to 12 minutes longer. (It will continue to cook as it rests.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer meat to a cutting board, cover loosely with foil and let rest for at least 10 minutes before slicing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pork is resting, grill the garlic bread: Place the halved loaves, cut side down, on the grill, and lightly toast on one side, 1 to 2 minutes. Flip bread and drizzle garlic butter over the toasted side. Let the unbuttered sides of the bread toast, another 1 to 2 minutes. Flip bread and grill once more on the buttered side for about 10 to 20 seconds to sear (take care not to let it burn). Transfer bread to a cutting board and slice into pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carve pork into slices, and squeeze the lemon or lime wedges over the meat. Serve the pork slices garnished with red-pepper flakes and thyme leaves, with the garlic bread on the side."}], "link": "https://cooking.nytimes.com/recipes/1020242-grilled-pork-with-whole-spices-and-garlic-bread"}