{"@context": "http://schema.org", "@type": "Recipe", "name": "Milk and Honey Cake", "description": "The flavor of this ultrabuttery layer cake, adapted from Odette Williams’s “Simple Cake” (Ten Speed Press, 2019), can be as mild or pronounced as you like, depending on the variety of honey you use. Clover honey will give you something gentle and mellow, while more assertive buckwheat or chestnut honey have more depth. You can serve the cake plain, with dollops of the whipped cream on the side, for a casual gathering, or frost and fill it, adding berries or other fruit, for a more celebratory affair. It makes an excellent birthday cake.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/12/04/dining/03bakingbookrex4/03bakingbookrex4-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "berries, butter, buttermilk, honey, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 367}, "recipeIngredient": ["12 tablespoons/170 grams unsalted butter (1 1/2 sticks), at room temperature, plus more for greasing", "2 1/4 cups/290 grams all-purpose flour", "2 teaspoons baking powder", "1/2 teaspoon baking soda", "1/4 teaspoon fine sea salt", "3 large eggs, at room temperature", "1 cup/240 milliliters buttermilk (shake carton before measuring)", "3/4 cup/180 milliliters honey, plus more for whipped cream and serving", "1/2 teaspoon vanilla extract", "3/4 cup/150 grams granulated sugar", "1 cup/240 milliliters heavy cream", "Fresh berries, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Grease two 8-inch round cake pans, line the bottoms with parchment paper and grease the parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift flour, baking powder, baking soda and salt into a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, beat eggs until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, stir together buttermilk, honey and vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer fitted with the paddle attachment, beat butter on medium speed to break it up, then gradually beat in sugar, continuing to beat until very light and fluffy, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer on medium speed, add eggs, 1 tablespoon at a time. If the mixture looks curdled at any point, add 1 tablespoon of the flour mixture to bind it back together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce mixer to low and mix in a third of the flour mixture. Scrape down sides of bowl with a rubber spatula, then mix in half the buttermilk mixture. Mix in another third of the flour mixture, scraping down sides of bowl, then mix in remaining buttermilk mixture followed by remaining flour. Scrape down bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape batter evenly into prepared pans and smooth tops with a spatula. Bake until the cake springs back when lightly pressed, and a toothpick inserted into center of the cake comes out clean, 30 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a wire rack to cool for 10 minutes. Run an offset spatula or butter knife around edges of pan to loosen cakes, then unmold onto the rack, remove parchment and allow to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, whip the cream with a drizzle or two of honey, to taste (up to 2 tablespoons if you like it sweet). Frost the top of one cake, top with the remaining cake then frost the top of the stacked cake. Drizzle with additional honey and garnish with berries, if you like."}]}