{"@context": "http://schema.org", "@type": "Recipe", "name": "Speculoos Cookie Butter Pie", "description": "Traditionally served on St. Nicholas Day in Belgium and the Netherlands, crisp, gingerbread-like speculoos cookies have risen in popularity after airlines began offering them as mid-flight snacks. Cookie butter, a creamy spread, incorporate that cookie’s flavors. This easy pie uses crumbled speculoos (also known as <a href=\"https://cooking.nytimes.com/recipes/1015652-speculaas\">speculaas</a>) in its crust and the cookie butter in its filling, doubling up on the flavor of warm spices like cinnamon and ginger. The whole thing comes together in about 30 minutes. The pie is perfect all on its own, but if you want to dress it up, add some unsweetened whipped cream and a sprinkle of cookie crumbs. Avoid sweetened whipped cream, which would take this pie from sweet to cloying.", "author": {"@type": "Person", "name": "Erin McDowell"}, "image": "https://static01.nyt.com/images/2019/03/28/dining/em-cookie-butter-cream-pie/merlin_152025021_0161c8fa-4764-4738-b7a8-8c8a435c7998-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "confectioners' sugar, cookie butter, cream cheese, graham crackers, heavy cream, speculoos, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 226}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 336, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": null, "proteinContent": "2 grams", "saturatedFatContent": "19 grams", "sodiumContent": "145 milligrams", "sugarContent": "13 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["Nonstick cooking spray", "30 speculoos cookies or about 10 graham crackers (8 ounces/227 grams), plus more for garnish (optional)", "4 tablespoons/55 grams unsalted butter, melted", "8 ounces/230 grams cream cheese, at room temperature", "1 cup/280 grams speculoos cookie butter", "1 cup/125 grams confectioners’ sugar", "1 1/4 cups/300 milliliters heavy cream, plus 3/4 cup/180 milliliters heavy cream for topping (optional)", "1 teaspoon vanilla extract", "1/4 teaspoon fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly spray a 9-inch pie plate with nonstick spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor, pulse the cookies into fine crumbs, about 1 minute. (You should have about 1 1/2 cups.) Add the melted butter and pulse until the mixture is uniformly combined and sticks together when pressed, 15 to 20 seconds. Press the crust evenly into the base and up the sides of the pie plate. Freeze the crust while you heat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the chilled crust until it appears set and the edges start to darken slightly, 8 to 10 minutes. Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the whisk attachment, beat the cream cheese and cookie butter on medium speed, 1 to 2 minutes. Scrape down the sides of the bowl, then add the confectioners’ sugar and mix on low speed until fully incorporated, 1 to 2 minutes. Scrape down the sides of the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a liquid measuring cup with a spout, mix the 1 1/4 cups cream with the vanilla and salt to combine. Increase the mixer speed to medium and gradually add the cream mixture to the cream cheese mixture in a slow, steady stream. Continue to mix just until the mixture has thickened and holds medium peaks, 30 seconds to 1 minute. Do not overwhip, which could cause the mixture to separate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the filling into the cooled pie crust and smooth into an even layer. Freeze the pie for 20 minutes to set the filling, then transfer to the refrigerator to chill until the filling is firm, about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the whipped cream, if using: In the bowl of an electric mixer fitted with the whip attachment, whip the remaining 3/4 cup cream to medium peaks. Spread in an even layer on top of the chilled pie and garnish with a sprinkling of cookie crumbs, if desired. Refrigerate until ready to serve."}]}