{"@context": "http://schema.org", "@type": "Recipe", "name": "Spring Vegetable Ragoût With Brown Butter Couscous", "description": "The amazingly flavorful couscous here is the result of a trick from the chef Mourad Lahlou, whose San Francisco restaurants, Aziza (currently closed) and Mourad, feature a modernist approach to Moroccan cuisine. Freshly steamed couscous is tossed with sizzling brown butter, lots of chopped preserved lemon and a splash of saffron. It is seriously good with just about anything, especially seasonal vegetable ragoûts. (Saucy braises of lamb, chicken or fish also pair well with it.) The recipe below uses spring vegetables, but you can substitute others throughout the year.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/03/27/dining/22kitchrex/22kitchrex-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, grains and rice, vegetables", "keywords": "asparagus, couscous, fava beans, peas, zucchini, main course, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 276}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 556, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "11 grams", "proteinContent": "16 grams", "saturatedFatContent": "9 grams", "sodiumContent": "948 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 teaspoon kosher salt", "2 cups fine quick-cooking couscous", "6 tablespoons cold unsalted butter, cut into small pieces (3/4 stick)", "1 small preserved lemon, rinsed, peel and pulp chopped fine, seeds discarded", "1 large pinch of saffron, crumbled into 1/2 cup warm water and left to steep at least 5 minutes", "2 cups roughly chopped cilantro leaves and tender stems, plus a few sprigs for garnish (from about 2 bunches)", "1/2 teaspoon kosher salt", "1 large Serrano chile, cut into 1/4-inch chunks", "1/4 cup extra-virgin olive oil", "2 tablespoons lime or lemon juice (from 1 lime or lemon)", "2 tablespoons extra-virgin olive oil", "1/2 teaspoon coriander seeds", "1/2 teaspoon cumin seeds", "1 medium onion, diced (about 1 cup)", "1 medium leek, white and tender green parts, diced (about 1 cup)", "Kosher salt and black pepper", "3 medium zucchini, cut into 1-inch pieces (about 3 cups)", "1 pound asparagus, tough ends discarded and cut into 1-inch pieces (about 3 cups)", "1 pound fresh peas in the pod, shucked (1 1/2 cups)", "3 pounds fresh fava beans in the pod, shucked and peeled (about 1 cup), optional", "10 ounces baby spinach or mizuna greens (about 10 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, bring 2 1/2 cups water to a rapid boil. Add salt and couscous, stirring as water returns to boil. Turn down heat to a bare simmer, cover and cook for 5 minutes. Turn off heat and leave covered for 10 minutes. Dump couscous on a baking sheet or large platter, and spread out. Taste for salt and add more if necessary. Fluff, smash any large clumps and leave to cool, uncovered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up a steamer with a fine mesh basket, with water simmering on low heat, for eventual steaming of couscous. About 30 minutes before serving, put couscous in the steamer basket and raise heat to maintain a rapid simmer. Do not cover. (This extra steaming step produces lighter, fluffier couscous.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the green sauce: Put cilantro, salt, Serrano chile and olive oil in a blender or food processor. Pulse briefly, then purée into a paste. Add 1/4 cup water, and purée again. Taste and adjust seasoning. Transfer to a small bowl and stir in lime juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the ragoût: Put 2 tablespoons olive oil in a deep, wide skillet or Dutch oven over medium-high heat. When oil is hot, add coriander and cumin. Let sizzle for a few seconds, then onions and cook, stirring, until beginning to soften, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add leeks and season well with salt and pepper. Stir and cook onion-leek mixture until leeks are soft but still bright green, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add zucchini, season with salt and stir to coat. Add 3 cups water, raise heat to a boil, cover and cook for 2 minutes. Add asparagus and peas, cover and cook for another 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add favas, if using, and spinach, cover and cook 1 minute. Turn off heat. (Spinach will continue to cook.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the couscous: Set a wide skillet over high heat. When pan is hot, add cold butter and let it sizzle and foam, turning rust-brown but no darker. Add preserved lemon and the saffron and its water to stop the browning. Turn off heat. Add hot couscous to pan and stir to incorporate all elements. Transfer to a warm serving bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently fold vegetables together, then lift from pot and transfer to a deep serving platter, using tongs or slotted spoon. Stir 2 tablespoons green sauce into liquid remaining in pot, then spoon liquid over vegetables. Garnish with cilantro sprigs. Pass remaining green sauce at the table."}], "link": "https://cooking.nytimes.com/recipes/1020069-spring-vegetable-ragout-with-brown-butter-couscous"}