{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Lamb Skewers With Lemony Onions", "description": "This is the type of scalable recipe that is ideal for feeding large groups of people in a short period of time. More snack than a meal, the idea is to build a table of these lightly spiced, grilled skewers (if you don't like lamb, then pork, beef or chicken all work) and fill out the rest of your table with store-bought ingredients like pickles, olives, yogurt and flatbread for sopping it all up. ", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/07/03/dining/01Roman1/merlin_157085166_9eb86bcb-a02c-4bdb-ac67-50de1be9aec0-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, weekday, meat, skewers and kebabs", "keywords": "appetizer, main course, black olives, greek yogurt, lamb, lavash, sumac, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 274}, "recipeIngredient": ["1 1/2 to 2 pounds boneless lamb leg or shoulder, excess fat trimmed, meat cut into 1 1/2-inch pieces", "Kosher salt and black pepper", "1 tablespoon plus 1 teaspoon ground cumin", "2 teaspoons ground turmeric", "1 small red onion, thinly sliced", "1 teaspoon ground sumac (optional)", "5 tablespoons fresh lemon or lime juice", "1 cup full-fat Greek yogurt", "Olive oil, for drizzling", "1 cup cilantro, tender leaves and stems", "1/2 cup pitted black olives, finely chopped", "Lavash, pita or flatbread, for serving", "Pickled cabbage, cucumbers, peppers or a mix, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season lamb with salt and pepper. Add cumin and turmeric and toss to coat. (This can be done up to 24 hours ahead, if you like.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re using a charcoal grill, build the fire so it’s screaming hot. This lamb is to be cooked hot and fast so it can stay nicely medium-rare, so the hotter the better. If you’re using a gas grill, set it on high. Bring a clean platter, cutting board or baking dish out to the grill for the skewers to rest in after cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine onion, sumac (if using) and 3 tablespoons lemon juice; season with salt and pepper and toss to combine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine yogurt and remaining 2 tablespoons lemon juice; season with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skewer the lamb onto wooden or metal skewers, 2 to 4 pieces per skewer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the grill is hot, cook the skewers on all sides until deeply browned and lightly charred all over, 2 to 3 minutes per side (less time for smaller pieces), moving the skewers around as needed to prevent excessive flare-ups. (If you’ve trimmed most of the fat away from the lamb, the flare-ups shouldn’t be too bad.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the skewers to the platter, cutting board or baking dish to rest for a few minutes and drizzle with olive oil. Serve with the dressed onions, lemony yogurt, cilantro, olives, lavash and any pickled vegetables or peppers you like."}], "link": "https://cooking.nytimes.com/recipes/1020316-spiced-lamb-skewers-with-lemony-onions"}