{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Goddess Pasta Salad", "description": "Cheese-filled tortellini serve as a soft, plush base for this comforting pasta salad, which is studded with sweet sugar-snap peas and sliced fennel. The herb-flecked green goddess dressing is creamy and rich, with a tartly pungent edge from garlic and lemon juice. Like all pasta salads, this benefits from being made a few hours ahead, so the pasta can absorb most flavor from the dressing. But don’t add the vegetables until just before serving so they maintain their crunch.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/06/12/dining/07apperex2/merlin_155266893_3780fb73-591f-412a-bb00-0ae73341aea3-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "pastas, salads and dressings", "keywords": "arugula, fennel, peas, tortellini, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 267}, "recipeIngredient": ["Fine sea salt, as needed", "2 (9- to 10-ounce) packages cheese tortellini", "1 fennel bulb with fronds, tough outer layers removed (see Note)", "1 cup sour cream or plain full-fat Greek yogurt", "1 packed cup basil leaves", "2 tablespoons coarsely chopped chives", "2 packed tablespoons parsley leaves", "2 garlic cloves, peeled", "3 scallions, white and green parts", "1 tablespoon fresh lemon juice, plus more to taste", "1/4 teaspoon black pepper, plus more for serving", "2 tablespoons extra-virgin olive oil, plus more for drizzling", "2/3 cup sliced sugar-snap peas", "1 cup baby arugula"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pot of heavily salted water, cook the tortellini according to the package directions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: While the water comes to a boil, chop enough of the fennel fronds to equal 1/4 cup. Put the fronds in a blender. Thinly slice enough of the fennel bulb for 3/4 cup, and set it aside. (Reserve any remaining fennel for another use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add sour cream, basil, chives, parsley, garlic, 1 scallion, lemon juice, 1/2 teaspoon fine sea salt and 1/4 teaspoon black pepper to the blender with the fronds and purée until smooth. With the blender running, slowly drizzle in olive oil. Taste and add more salt or lemon juice, or both, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as the tortellini is done, drain it well and put it in a large mixing bowl. Immediately, while it’s still hot, toss in enough of the dressing to coat. Let pasta cool in the dressing, at least 20 minutes and up to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice remaining 2 scallions and add to bowl with tortellini. Toss in sliced fennel and sugar-snap peas. Drizzle with more dressing, tossing if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, transfer to a serving bowl, gently toss in arugula, drizzle with more olive oil and grind more fresh pepper over."}]}