{"@context": "http://schema.org", "@type": "Recipe", "name": "Reuben Sandwich", "description": "The original Reuben’s Delicatessen no longer exists in New York City, but its legend lives on in the form of this classic sandwich. The deli's owner, Arthur Reuben frequently named sandwiches after the actors that would frequent his deli and created a special for Annette Seelos — one of Charlie Chaplin’s leading ladies — in 1914. Mr. Reuben’s version called for ham and coleslaw but morphed into today’s Reuben, which sandwiches corned beef, sauerkraut, Swiss cheese and a healthy smear of Russian dressing between two slices of buttered rye bread. Homemade Russian dressing has a brighter, fresher flavor than the bottled variety, and comes together in just a few turns of a whisk. The best part of this toasted sandwich is the crispy crust and gooey cheese, so keep the heat low enough to allow the buttered bread to toast while the cheese melts.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2019/03/15/dining/kc-reuben/kc-reuben-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 sandwiches", "recipeCuisine": "american", "recipeCategory": "dinner, easy, lunch, quick, weeknight, sandwiches", "keywords": "corned beef, rye bread, sauerkraut, swiss cheese, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 179}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 254, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "1 gram", "proteinContent": "10 grams", "saturatedFatContent": "7 grams", "sodiumContent": "704 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup mayonnaise", "5 tablespoons ketchup", "3 tablespoons dill pickle relish (not sweet)", "1 tablespoon minced onion", "1 teaspoon yellow mustard", "1 teaspoon Worcestershire sauce", "8 slices rye sandwich bread", "4 tablespoons unsalted butter, at room temperature", "1 pound thinly sliced corned beef", "1 cup drained sauerkraut (about 6 ounces)", "8 slices Swiss cheese (about 6 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the Russian dressing: In a small bowl, combine all ingredients and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sandwiches: Spread one side of each bread slice with 1/2 tablespoon butter. In a large nonstick skillet, arrange 2 slices of bread, buttered side down, over medium-low heat. Spread 2 tablespoons of Russian dressing on each slice of bread, then top each with 1/4 pound corned beef, 1/4 cup sauerkraut and 2 slices cheese. Top each with 1 slice of bread, buttered side up. Cook until golden and crispy underneath, about 5 minutes. Flip the sandwiches and cook, pressing down gently with a spatula, until second side is golden and cheese melts, about 3 minutes more. Transfer sandwiches to plates and wipe out skillet. Repeat with the remaining bread, sauce, corned beef, sauerkraut and cheese. Serve warm."}], "link": "https://cooking.nytimes.com/recipes/1020100-reuben-sandwich"}