{"@context": "http://schema.org", "@type": "Recipe", "name": "Dirty Chai Earthquake Cookies", "description": "In case you’re wondering about the name of this cakey, chewy-edged cookie, which nearly explodes through its sugary crust, it’s a nod to a coffee bar creation in which a shot of espresso tops off a cup of masala chai, the Indian spiced tea. It’s right at home on a traditional holiday cookie plate, thanks to its festive cinnamon, cardamom, ginger and cloves. Feel free to add a little freshly grated nutmeg, if you’re so inclined. A strong coffee flavor adds nuance; black pepper lends a spicy kick; and malted milk powder, browned butter and brown sugar all contribute toasty warm notes to this craveable treat.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/11/27/dining/ss-earthquake-cookies/ss-earthquake-cookies-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 dozen cookies", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars", "keywords": "brown sugar, cardamom, cinnamon, cloves, coffee, espresso coffee powder, ginger, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 780}, "recipeIngredient": ["1 tablespoon finely ground espresso (not instant espresso) or finely ground coffee", "1/2 cup/115 grams cold unsalted butter (1 stick)", "2 cups/255 grams all-purpose flour", "2 tablespoons malted milk powder, such as Carnation brand", "1 teaspoon baking powder", "1 teaspoon ground ginger", "1 teaspoon ground cinnamon", "1/2 teaspoon ground cardamom", "1/8 teaspoon ground cloves", "1/2 teaspoon kosher salt", "1/2 teaspoon finely ground black pepper", "2 large eggs", "3/4 cup/165 grams light brown sugar", "2 teaspoons vanilla extract or paste", "1/4 cup/50 grams granulated sugar, for rolling", "1/2 cup/50 grams confectioners’ sugar, sifted, for rolling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put espresso or coffee in a small metal bowl. Put butter in a small saucepan, and cook over medium-high heat, swirling and stirring occasionally with a rubber spatula, until nutty brown, 5 to 6 minutes. Add the butter to the bowl with the espresso and stir to combine. Set aside to cool, stirring occasionally, while you prepare the rest of the cookie."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the flour, malted milk powder, baking powder, ginger, cinnamon, cardamom, cloves, salt and pepper in a medium bowl. Whisk to combine thoroughly and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine eggs and light brown sugar in the bowl of a stand mixer fitted with the paddle attachment. Beat on medium speed until well combined and slightly paler, about 3 minutes, scraping bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vanilla and the butter mixture, then mix on low speed until combined. Add the flour mixture, then mix again on low until combined. Transfer dough to a resealable glass or plastic container, and chill thoroughly, at least 2 hours and up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Put granulated sugar and confectioners’ sugar into two separate bowls. Use a small cookie scoop to portion dough into heaping tablespoons (about 25 grams each). Roll into smooth balls and drop a few at a time into the bowl of granulated sugar, rolling to coat. Transfer to the bowl with the confectioners’ sugar. Roll gently, coating well, then transfer to a parchment- or silicone mat-lined baking sheet, leaving at least 2 inches between cookies. Place in freezer until firm, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until cookies are golden underneath but still quite tender (they will firm up as they cool), 12 to 14 minutes. Let cool a few minutes on the baking sheets and transfer to wire racks to cool completely. Cookies will keep in an airtight container at room temperature for 1 week."}], "link": "https://cooking.nytimes.com/recipes/1020652-dirty-chai-earthquake-cookies"}