{"@context": "http://schema.org", "@type": "Recipe", "name": "Mojo Chicken With Pineapple", "description": "This simple, bright chicken dinner will transport you to a sunnier place, no matter what color the sky may be where you are. It starts with a citrusy, garlicky Cuban mojo. Instead of marinating the chicken in the mojo before cooking, you marinate it afterward: As the warm, broiled chicken sits in the mojo (for up to an hour), it soaks up the lively flavors.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/12/30/dining/as-mojo-chicken-with-pineapple/merlin_166281849_067efd06-67cf-4fc7-b6b7-cb6390406d16-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry", "keywords": "chicken, cilantro, cumin, garlic, jalapeño, lime, orange, oregano, pineapple, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 333}, "recipeIngredient": ["1 1/2 to 2 pounds boneless, skinless chicken thighs", "Kosher salt and black pepper", "1/2 pineapple, cut into 1 1/2-inch chunks (about 3 cups)", "1 orange, zested, then quartered", "1/4 cup extra-virgin olive oil", "4 garlic cloves, peeled", "1 jalapeño, stemmed", "A few cilantro sprigs, leaves removed, then stems finely chopped", "2 large limes, zested and juiced", "1 teaspoon dried oregano", "1/2 teaspoon ground cumin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the chicken dry and season all over with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler with a rack 6 inches from heat source. On a foil-lined quarter sheet pan (or half sheet pan), drizzle the pineapple chunks and orange quarters with 1 tablespoon olive oil and season with salt and pepper. Toss to coat, then broil until charred in spots, 8 to 13 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the mojo: On a cutting board, coarsely chop the garlic and jalapeño. Add the chopped cilantro stems, orange zest, lime zest, dried oregano and 1 teaspoon salt. Chop and smash the mixture until a coarse paste forms. Transfer the mixture to a large bowl, then stir in the lime juice, ground cumin and 2 tablespoons olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the charred fruit to the mojo and transfer the chicken to the sheet pan. Coat with remaining 1 tablespoon olive oil and broil until cooked through and charred in spots, 15 to 20 minutes (no need to flip)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cooked chicken to the mojo, pineapple and orange wedges, and toss to coat. Let sit 5 minutes or up to 1 hour. Slice the chicken and serve on a platter, with the sauce poured over top and the charred pineapple and orange wedges alongside. Season to taste with salt and pepper, and sprinkle with cilantro leaves. Squeeze orange wedges over top as desired."}]}