{"@context": "http://schema.org", "@type": "Recipe", "name": "Bison Steaks with Smoky Wild Rice", "description": "I seared a couple of boneless bison strip loin steaks in a cast-iron skillet, which gave me pan juices so I could produce a bit of intense sauce to drizzle on the meat. Because bison has a slightly sweeter finish than beef, I combined a tart pomegranate molasses with red wine for deglazing. A few dollops of good butter compensated for the leanness of the meat and turned the pan juices into a dark, syrupy finishing sauce. Bison is less marbled than beef cuts like rib roast, rib-eye or strip loin, so it should be cooked no more than medium-rare. Alongside the bison I served a wild rice pilaf infused with double-smoked bacon, rendered fragrant with ground cloves and steeped in beef stock that had been sharpened with a little of the pomegranate molasses.", "author": {"@type": "Person", "name": ""}, "image": null, "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "meat", "keywords": "bacon, bison, clove, dry red wine, pomegranate molasses, red onion, main course", "aggregateRating": null, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "3 ounces double-smoked slab bacon, diced", "1/2 cup red onion, finely diced", "1/2 teaspoon ground cloves", "1 cup wild rice", "2 1/2 tablespoons pomegranate molasses", "2 1/2 cups beef stock", "Salt and freshly ground black pepper", "4 boneless bison strip loin steaks, well trimmed, each about 10 ounces", "3/4 cup dry red wine", "1 tablespoon unsalted butter, preferably high-fat"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1/2 tablespoon oil in a 3-quart saucepan. Add bacon and sauté until lightly browned. Remove, leaving fat in pan. Add onion and sauté until beginning to brown. Stir in cloves. Add wild rice. Stir. Add 1 1/2 tablespoons molasses and the beef stock. Stir to blend. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and simmer about 45 minutes, until liquid has been absorbed. Set aside, covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slick remaining oil in a large, heavy skillet. Place over high heat. Season steaks with salt and pepper. Place in pan and sear to medium rare, about 3 minutes on each side. Remove steaks to a warm platter and tent with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wine to skillet and cook over medium heat, scraping pan, until reduced by half. Whisk in remaining pomegranate molasses, then, off heat, whisk in butter bit by bit, until pan sauce turns syrupy. Taste and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mound rice on 4 plates. Slice steaks and arrange alongside rice. Spoon sauce on meat and serve."}], "link": "https://cooking.nytimes.com/recipes/1020587-bison-steaks-with-smoky-wild-rice"}