{"@context": "http://schema.org", "@type": "Recipe", "name": "Classic Eggnog", "description": "Aaron Goldfarb, a liquor writer who was raised Jewish, was not introduced to the joys of eggnog until he married a woman who loved Christmas. Making a batch of homemade eggnog became his self-designated duty at their annual Christmas party in Park Slope, Brooklyn. For the spirits, Mr. Goldfarb prefers Maker’s Mark or another bourbon with a heavy wheat content, which lends sweetness. He also cautions against using spiced rum, as he feels the spirits involved already possess enough intrinsic baking-spice qualities. Mr. Goldfarb loves a slightly aged nog; see Tip for his advice.", "author": {"@type": "Person", "name": "Robert Simonson"}, "image": "https://static01.nyt.com/images/2019/12/04/dining/02eggnogrex/02eggnogrex-articleLarge.jpg", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "cocktails", "keywords": "bourbon, cognac, egg, nutmeg, rum, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 71}, "recipeIngredient": ["8 large eggs", "4 cups whole milk", "2 cups heavy cream", "2/3 cup granulated sugar", "4 ounces bourbon", "4 ounces dark rum", "4 ounces Cognac or apple brandy", "Whole nutmeg, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Separate the egg yolks from the whites. In a stand mixer, beat the whites on high speed until transformed into a meringue-like consistency with soft peaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk the egg yolks with the milk, cream, sugar, bourbon, rum and Cognac or brandy until a smooth texture is achieved. Gently fold in the beaten egg whites until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer eggnog into a large serving bowl. Chill overnight in the refrigerator before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle a few ounces into a mug or glass and grate fresh nutmeg over the surface. For ideal flavor, mix will keep in the refrigerator up to two weeks, but can last longer."}], "link": "https://cooking.nytimes.com/recipes/1020662-classic-eggnog"}