{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Seared Ranch Chicken", "description": "In this recipe, <a href=\"https://www.nytimes.com/2018/09/18/dining/ranch-dressing-history.html\">America’s favorite salad dressing</a> serves double-duty: as a creamy, herbaceous sauce and as a marinade. But don’t reach for bottled ranch. Instead, make your own brighter, tangier version using Greek yogurt. Unlike lemon or vinegar-based marinades, which can toughen meat, yogurt tenderizes even the leanest of chicken breasts. When the chicken is seared in a hot pan, the yogurt-mayo coating forms a flavorful, caramelized crust. (It also makes an excellent marinade for fish, pork, shrimp or sturdy vegetables.)", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/11/21/dining/as-ranch-chicken/as-ranch-chicken-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, quick, weeknight, poultry", "keywords": "chicken, chicken breast, chives, dill, garlic, greek yogurt, mayonnaise, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 202}, "recipeIngredient": ["3/4 cup Greek yogurt", "1/4 cup mayonnaise", "3 tablespoons finely chopped fresh chives, or 1/2 teaspoon dried, plus more for serving", "3 tablespoons finely chopped fresh dill or parsley (or 1/2 teaspoon dried), plus more for serving", "3/4 teaspoon garlic powder", "Kosher salt and black pepper", "1 1/2 to 2 pounds boneless, skinless chicken breasts or thighs", "2 tablespoons extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a measuring cup or small bowl, stir together the yogurt, mayonnaise, chives, dill and garlic powder; season with 1 1/2 teaspoons salt and a few grinds of pepper. Transfer half the ranch to a medium bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the chicken dry. If thickness varies greatly, pound to an even thickness of about 1/2 inch. Season both sides with salt and pepper, then transfer the chicken to the medium bowl with the ranch and toss to coat. Let sit at least 15 minutes, or refrigerate overnight. (Let it come to room temperature before cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large (12-inch) nonstick skillet over medium-high. Working in batches if necessary, cook the chicken (with the marinade still on it) until deeply caramelized on the outside, chicken releases from the pan, and its juices run clear, 4 to 6 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the ranch in the measuring cup is too thick, add a little bit of water to loosen it. (You should be able to drizzle it easily.) Serve chicken with the ranch passed at the table, and more herbs as desired."}], "link": "https://cooking.nytimes.com/recipes/1020660-pan-seared-ranch-chicken"}