{"@context": "http://schema.org", "@type": "Recipe", "name": "Maple-Roasted Tofu With Butternut Squash and Bacon", "description": "A small amount of bacon adds a lot of smoky flavor to sweet maple-roasted vegetables and glazed tofu. It’s a colorful, cozy sheet-pan meal for tofu lovers who also eat meat, or bacon eaters who are trying to eat less meat. To make this dish vegan, skip the bacon, and add 1/2 teaspoon smoked paprika to the maple syrup mixture. Dicing the squash into small cubes helps it roast at the same rate as the brussels sprouts, so be sure to keep the pieces around 1/2 inch in size.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/01/01/dining/31lessmeat5/merlin_166281756_b48cdffd-e37c-430e-839a-edfb9bbe70c3-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, vegetables", "keywords": "bacon, brussels sprouts, extra-firm tofu, fish sauce, squash, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 271}, "recipeIngredient": ["1 (14- to 16-ounce) package extra-firm tofu, drained and patted dry", "1/4 cup maple syrup", "2 teaspoons peeled and grated fresh ginger", "1/4 teaspoon red-pepper flakes", "1/4 cup extra-virgin olive oil, plus more for drizzling", "12 ounces butternut squash (1 small to medium squash), peeled, trimmed, seeded and cut into 1/2-inch cubes", "1 pound brussels sprouts, trimmed, small ones left whole, large ones halved", "1 medium red onion, cut into 1/2-inch wedges", "Kosher salt and freshly ground black pepper", "3/4 teaspoon ground coriander", "1 tablespoon finely chopped fresh sage leaves", "2 ounces bacon, diced into 1-inch pieces", "1 1/2 tablespoons soy sauce", "3 teaspoons fresh lime juice, plus more for drizzling", "1 teaspoon Asian fish sauce", "1/2 cup sliced scallions (white and green parts), for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Slice tofu into 1-inch-thick slabs. Pat them dry with paper towels and arrange in single layer on a plate. Cover tofu slabs with more paper towels and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine maple syrup, ginger and red-pepper flakes. Simmer until syrup thickens slightly, about 1 minute, then stir in 1/4 cup olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place squash, brussels sprouts and onion in a bowl. Toss with salt, pepper, coriander, sage and half of the maple syrup mixture. Spread vegetables in an even layer on a rimmed baking sheet and sprinkle bacon on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add soy sauce and 2 teaspoons lime juice to remaining maple mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove paper towels from over tofu, and sprinkle salt on tofu slabs. Tuck tofu onto the baking sheet with squash and brush half of the soy-maple mixture over the slabs. Roast for 40 minutes, tossing the vegetables occasionally. Halfway through roasting, flip the tofu slabs, and brush with remaining soy-maple mixture. Turn oven off and heat broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil tofu and vegetables for 1 to 2 minutes to crisp up the bacon and the edges of the tofu. When vegetables are still hot, toss with remaining 1 teaspoon lime juice and the fish sauce. Garnish with sliced scallions and drizzle with more olive oil and a little more lime juice if you like."}], "link": "https://cooking.nytimes.com/recipes/1020742-maple-roasted-tofu-with-butternut-squash-and-bacon"}