{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoked Cabbage Slaw With Creamy Horseradish", "description": "This slaw acquires its smoke flavor not through grilling the greens, but by cold smoking. The advantage is that you flavor the leaves with smoke without cooking them, so the cabbage remains audibly crisp. Cold smoking can be done on a grill or in a smoker, or even in your kitchen using a stove-top smoker or hand-held smoker. The secret is to smoke the shredded cabbage over a pan of ice to keep it from cooking. Horseradish and mustard fire up the traditional creamy mayonnaise dressing.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2019/08/07/dining/02slawrex3/merlin_158645790_af947f47-c4a3-4fcd-84bc-65f277e34e18-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "salads and dressings, slaws, vegetables", "keywords": "apple, carrot, celery seeds, cider vinegar, green cabbage, horseradish, mayonnaise, fall, summer, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 15}, "recipeIngredient": ["1 Honey Crisp or other firm apple", "1 small head green cabbage (about 1 1/4 pounds), quartered through the core", "1 small white onion, peeled and quartered", "2 carrots, trimmed and peeled", "1/2 cup yellow raisins", "Ice, for smoking", "1/2 cup mayonnaise", "3 tablespoons prepared horseradish", "2 tablespoons cider vinegar, plus more to taste", "2 tablespoons granulated sugar, plus more to taste", "1 tablespoon Dijon mustard", "1/2 teaspoon celery seed", "Sea salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up your smoker following the manufacturer’s instructions and heat to 225 degrees. Add applewood or hickory wood as specified by the manufacturer. If using a charcoal grill, set it up for indirect grilling, using half a chimney starter of coals instead of a full chimney. Add wood chips or chunks to the coals following the manufacturer’s instructions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, peel and core the apple, then cut the cabbage, onion, apple and carrots into thin shreds on a mandolin, in a food processor fitted with a shredding or slicing disk, or with a chef’s knife. Stir the raisins into the slaw. Working in batches if necessary, divide the mixture among 2 disposable 9-by-13-inch aluminum foil drip pans; spread in a loosely packed even layer. (Cabbage mixture should be no deeper than 1 inch.) Place each pan over another 9-by-13 aluminum pan of ice so the vegetables smoke without cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pans to the smoker or grill, cover and smoke until lightly bronzed with smoke but still raw, 10 to 15 minutes. Transfer smoked slaw mixture to a large bowl and repeat as necessary to smoke any remaining slaw."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the dressing: Combine the mayonnaise, horseradish, vinegar, sugar, mustard and celery seed in another large bowl and whisk until the sugar is dissolved. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the smoked vegetable mixture into the dressing; season to taste with salt, sugar and vinegar. Serve right away, or refrigerate, covered, up to a few hours before serving."}]}