{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Shrimp With Blistered Cucumbers, Corn and Tomato", "description": "When warm weather arrives, the best recipes are the simple ones that allow seasonal produce to shine. In this recipe, shrimp gets a quick marinade in lime juice, ginger and garlic while the rest of the salad is assembled. Pan-searing cucumbers and corn deepens their flavor and adds a pleasant contrast to the fresh tomatoes. The Thai-style vinaigrette adds zingy brightness. Serve this salad over rice studded with mint and scallions, or as a side dish to grilled steak or pork. The shrimp and the dressing (minus the chives) can be made ahead and stored in the fridge for a day or so in advance, just be sure to bring them to room temperature before tossing everything together.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/06/17/dining/ch-shrimp-cucumbers-corn-and-tomato-salad/merlin_155855547_eacc347c-889b-4fe1-988f-4ab12f23465b-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, weekday, salads and dressings, seafood, vegetables", "keywords": "corn, cucumber, fish sauce, serrano pepper, shallot, shrimp, tomato, main course, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 319}, "recipeIngredient": ["1/2 cup fresh lime juice (from 3 to 4 limes)", "3 tablespoons olive oil", "2 teaspoons grated ginger", "1 large garlic clove, grated", "Kosher salt and black pepper", "1 pound jumbo shrimp, peeled and deveined, tails removed", "1 serrano or Fresno chile, thinly sliced, plus more to taste", "2 tablespoons finely chopped chives or scallions, plus more to taste", "1 tablespoon fish sauce, plus more to taste", "1 teaspoon light brown sugar, plus more to taste", "2 medium tomatoes, cored and cut into 1/2-inch wedges", "1 medium shallot, thinly sliced into rings", "1 1/2 cups roughly chopped seedless cucumber (such as English or Persian), cut into 1/2-inch pieces", "1 1/2 cups raw corn kernels (from about 2 ears of corn)", "1/4 cup cilantro (optional), leaves and tender stems, roughly chopped", "Flaky sea salt (optional), for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together 1/4 cup lime juice, 1 tablespoon olive oil, plus the ginger and garlic; season well with salt and pepper. Add the shrimp, toss to coat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: In a medium bowl, whisk together the remaining 1/4 cup lime juice with the chile, chives, fish sauce and brown sugar until it dissolves. Taste and adjust seasonings accordingly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, gently combine the tomatoes and shallot and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large cast-iron skillet over medium-high until very hot, about 2 minutes. Add the remaining 2 tablespoons oil and when it shimmers, add the cucumbers and corn. Season with salt and pepper. Allow the vegetables to cook, undisturbed, until they begin to brown and caramelize in spots, 2 to 3 minutes. Cook, stirring occasionally, until golden all over, 4 to 6 minutes. Remove from heat and allow to cool slightly, then toss with the tomato-shallot mixture and half the dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the pan and heat over medium-high. Leaving the marinade behind and discarding it, add shrimp to the pan and sear until just cooked through, 1 to 2 minutes each side. Alternatively, grill over medium heat, 2 to 3 minutes a side. Add the shrimp to the salad, gently toss to coat and serve on a large platter or in a large bowl. Drizzle with remaining dressing and scatter with cilantro and flaky sea salt, if using."}], "link": "https://cooking.nytimes.com/recipes/1020303-spicy-shrimp-with-blistered-cucumbers-corn-and-tomato"}