{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Wellington", "description": "In this British classic, tender beef fillet is blanketed with browned mushrooms and shallots, then wrapped in layers of prosciutto and buttery puff pastry before being baked until golden and flaky on the outside, juicy and rare within. Worthy of the most elegant, blow-out meal, save this one for Christmas, New Year’s Eve or your next big birthday. One thing to note: You really do need a full pound of puff pastry here to cover all the meat, so if your package weighs less (some brands weigh 12 ounces), you’ll need to supplement with another package.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/12/13/dining/mc-beef-wellington/mc-beef-wellington-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "british", "recipeCategory": "roasts", "keywords": "beef tenderloin, mushroom, pancetta, puff pastry, thyme, vermouth, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 258}, "recipeIngredient": ["3 pounds center-cut beef tenderloin", "2 ounces pancetta or bacon, finely chopped (1/4 cup)", "2 tablespoons unsalted butter", "12 ounces mushrooms, preferably a mix of different kinds, such as cremini, white, shiitake, chanterelles or oyster, very finely chopped (4 cups)", "1 shallot, diced", "2 tablespoons extra-virgin olive oil, plus more for drizzling", "2 garlic cloves, minced", "2 teaspoons fresh thyme leaves", "1 tablespoon dry sherry or dry vermouth", "Kosher salt and black pepper", "2 tablespoons Dijon mustard", "10 to 12 thin slices prosciutto", "1 large egg", "16 ounces puff pastry, thawed (see Tip)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using kitchen twine, tie the tenderloin into a 12-inch log, folding the thinner end onto itself. (Use your hands to squeeze the meat into a log. You can be aggressive here.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pancetta in a cold 12-inch skillet. Cook over medium heat, stirring occasionally, until pancetta starts to brown, 6 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter, raise heat to high, and stir in mushrooms and shallot. Cook until the liquid released by the mushrooms has cooked off, 4 to 7 minutes. Reduce heat to medium and continue to cook until mushrooms are browned, stirring frequently, another 18 to 23 minutes. (Take your time here, you want a deep golden color for the best flavor.) Scrape bottom of the skillet as necessary to prevent burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the pan looks dry, drizzle in a little olive oil, then stir in garlic and thyme leaves. Cook until fragrant, another 1 to 2 minutes. Stir in sherry, scraping up the browned bits on the bottom of the pan. Scrape mixture into a medium bowl to cool. (Do not add salt at this point.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, heat 2 tablespoons olive oil over medium-high. Season beef generously with salt and pepper, then sear on all sides until browned, 1 to 2 minutes per side. Transfer to a plate, and cool slightly. Remove any twine. Brush meat all over with mustard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a clean work surface, overlap long sheets of plastic wrap (about 15-by-15 inches). Place prosciutto slices on top to make about a 14-by-7-inch rectangle, arranging them in an even layer and overlapping the pieces slightly. Spread cooled mushroom mixture on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place beef along one long end of the prosciutto slices, and roll prosciutto tightly around beef. Wrap tightly with plastic wrap, twisting both ends like a candy wrapper. Chill in the refrigerator for at least 30 minutes and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat oven to 400 degrees, and line a rimmed baking sheet with parchment paper. In a small bowl, whisk together egg and 1 teaspoon water. Lay puff pastry out on the prepared baking sheet, lightly draping over edges. (The pastry needs to be at least 14-inches long and 13-inches wide to cover the beef; if not, roll it out as needed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully unwrap and place chilled log along the edge of one long side of puff pastry. Roll beef up tightly, then place it seam-side down on the baking sheet. Tuck puff pastry over the ends of the beef to cover them, pinching to seal and folding underneath. Brush top and sides of pastry with egg wash, and use a small sharp knife to cut a few slits into the top of the pastry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until a thermometer inserted in the center reads 115 degrees for rare, 25 to 35 minutes. (This timing will yield rare pieces at the thicker end and medium done pieces at the thinner end of the loin.) Remove from oven and let rest for 10 minutes, then slice and serve while warm."}]}