{"@context": "http://schema.org", "@type": "Recipe", "name": "Golden Ginger Cake", "description": "Not your traditional gingerbread, this cake is flavored with familiar spices and enhanced with freshly grated ginger. (And yes, of course, there is still molasses.) Unlike a brittle cookie or dense loaf, this cake has the texture of what can only be described as a very good cake doughnut, crunchy on the outside and delightfully fluffy on the inside. It’s best served just warmed, with a generous helping of whipped cream or vanilla ice cream.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/12/18/dining/17Romanrex3/merlin_162383772_d1e931a2-acf1-402a-ba48-77c3b8b0004a-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 to 10 servings ", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "dessert, ginger, molasses, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 453}, "recipeIngredient": ["Nonstick cooking spray ", "Demerara sugar", "2 3/4 cups/350 grams all-purpose flour ", "1 tablespoon turmeric ", "1 1/2 teaspoons kosher salt ", "1 teaspoon ground cinnamon", "1 1/2 teaspoons baking powder", "1 teaspoon baking soda", "3/4 cup/170 grams unsalted butter (1 1/2 sticks), at room temperature ", "1 cup/220 grams light brown sugar", "1/4 cup/60 milliliters molasses ", "3 tablespoons finely grated fresh ginger ", "2 large eggs", "1/2 cup/120 milliliters buttermilk ", "1/4 cup/60 milliliters vegetable or coconut oil, melted ", "Whipped cream or ice cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Spray a 9-inch springform pan, cake pan or tart pan with nonstick cooking spray (or grease with softened butter) and sprinkle with a bit of Demerara sugar to coat the interior of the pan; tap out excess and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together flour, turmeric, salt, cinnamon, baking powder and baking soda; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a stand mixer or an electric mixer and a large bowl, beat together butter, brown sugar and molasses until the mixture is light, fluffy and the color of a very pale latte, 3 to 4 minutes. (Feel free to periodically scrape down the sides of the bowl with a spatula to make sure all the ingredients are mixing properly.) Add fresh ginger and beat to blend."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add eggs, one at a time, until they are totally incorporated and the mixture looks extremely light and fluffy, almost like cake frosting, 5 or so minutes. (Be sure to wipe off any ginger that may have stuck to the beaters.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine buttermilk and oil in a bowl or a measuring cup. With the mixer on low, beat 1/3 of the dry ingredients into the cake batter, followed by 1/2 of the buttermilk mixture. Repeat with 1/3 of the dry ingredients and the remaining buttermilk mixture. Finish by adding the remaining dry ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour cake batter into prepared pan and scatter with more Demerara sugar. Bake, rotating once or twice if your oven has hot spots or tends to be uneven, until the cake has started to pull away from the sides of the pan, it’s evenly golden brown on top and it springs back ever so slightly when pressed, 45 to 50 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and let cool on a wire rack if you have one. (If not, just let it cool away from the oven.) Do not remove cake from the pan until it is 100 percent cool. Serve with lightly whipped cream or the ice cream of your choice.  "}], "link": "https://cooking.nytimes.com/recipes/1020710-golden-ginger-cake"}