{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Cassoulet", "description": "This recipe came to The Times in 2001 from Joël Chapoulie, the executive chef at L’Express. At the Montreal restaurant, he made it with a cut of lamb called souris, nuggets from the knuckle that are exceptionally flavorful and gelatinous (and that American butchers never bother with, instead selling whole shanks). The cassoulet can be made ahead, and reheated just before serving.", "author": {"@type": "Person", "name": "Regina Schrambling"}, "image": null, "totalTime": "PT5H", "recipeYield": "6 servings", "recipeCuisine": "canadian, french", "recipeCategory": "", "keywords": "cannellini beans, duck fat, lamb shanks, salt pork, slab bacon, main course, winter", "aggregateRating": null, "recipeIngredient": ["3 cups dried cannellini or other white beans, picked over", "8 ounces salt pork", "8 ounces slab bacon, cut in thin strips", "4 onions: 1 whole, 3 finely chopped", "8 to 10 cloves", "1 carrot, peeled", "1 bay leaf", "1 teaspoon dried thyme", "4 cloves garlic: 2 peeled but uncut, 2 finely chopped", "3 lamb shanks, about 3 pounds total", "Salt", "2 cups duck fat", "3 tablespoons tomato paste", "8 ounces saucisson d’ail (French garlic sausage)", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse beans under running water. Place in large pot with salt pork and bacon; add cold water to cover. Bring to boil and cook 3 minutes. Strain through colander and rinse."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return beans, salt pork and bacon to clean pot. Add 6 cups cold water. Stud whole onion with cloves and add to beans. Add carrot, bay leaf, thyme and 2 cloves peeled garlic. Cover and simmer very gently until beans are tender, about 1 to 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove carrot, onion and garlic from beans and discard. Set pot aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season shanks with salt. Heat duck fat in casserole or Dutch oven and brown meat on all sides. Remove from pan with slotted spoon; set aside. Add chopped onions, chopped garlic and tomato paste to pan, mixing well. Return shanks to pan and fit saucisson, salt pork and bacon around them. Pour beans and their liquid over. Cover partway and cook over low heat for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Remove meats from beans. Discard salt pork. Cut lamb and bacon into chunks and slice saucisson into 6 thick pieces. Season well with pepper. Season beans with salt as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using slotted spoon, remove half the beans from the casserole. Arrange meats over beans remaining in pan. Spread remaining beans over the meats."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover casserole and bake 1 1/2 hours. Uncover casserole, raise oven setting to 450 degrees and cook until a crust forms on top of the beans, about 20 minutes."}], "link": "https://cooking.nytimes.com/recipes/1020745-lamb-cassoulet"}