{"@context": "http://schema.org", "@type": "Recipe", "name": "Gyudon", "description": "A popular fast-food dish in Japan, gyudon is a quick-simmered mixture of thinly sliced beef and crisp-tender onions cooked in a sweet soy broth that’s seasoned with fresh ginger. It’s perfectly suited to weeknight cooking because it requires minimal prep, a short ingredient list and less than 30 minutes of active cooking. Gyudon owes its popularity to Yoshinoya, Japan’s first fast-food chain, which was founded in Tokyo in 1899 and became wildly successful in the 1960s serving just this dish. Variations abound — this recipe borrows heavily from the chef Ivan Orkin’s recipe, as well as one featured in “Simply Bento” by Yuko — and while some skip the use of dashi, a Japanese stock using bonito flakes and seaweed, the ingredient gives the dish a slight funk that offsets the sweetness of the mirin, sake and ginger. The flavor is subtle, but it’s missed when absent.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2020/02/25/dining/aw-gyudon/aw-gyudon-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "japanese", "recipeCategory": "dinner, weekday, grains and rice, meat, soups and stews", "keywords": "beef, dashi, ginger, mirin, onion, sake, soy sauce, sugar, dairy-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 185}, "recipeIngredient": ["1 pound boneless beef rib-eye, excess fat trimmed", "1 1/4 teaspoons instant dashi granules, such as Hondashi", "1/4 cup soy sauce", "1/4 cup sake", "3 tablespoons mirin", "3 tablespoons granulated sugar", "1 medium yellow onion (about 9 ounces), halved, then thinly sliced from stem to stem", "1 1/2 teaspoons finely grated fresh ginger", "Cooked sushi rice (or other white rice), for serving", "Pickled red ginger and togarashi, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut beef crosswise into 2 pieces, then set your beef in the freezer for at least 1 hour to freeze until firm. Once the beef is very firm, slice it very thinly against the grain, ideally about 1/8-inch thick. Set aside at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 1 1/4 cups water to a boil in a large skillet. Whisk in instant dashi until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the soy sauce, sake, mirin and sugar, stir to combine, and boil over high until flavors meld and mixture starts to reduce, about 8 minutes. Add the sliced onion and cook over medium until onion just starts to soften, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the beef and cook, turning the sliced beef frequently using tongs, until beef is just barely cooked and loses any traces of pink, about 3 minutes. Stir in the fresh ginger and cook for 1 more minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide rice among bowls and top with beef mixture and any juices. Serve with pickled ginger and sprinkle with togarashi, if desired."}]}