{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Ricotta With Rhubarb, Ginger and Cardamom", "description": "Inspired by the Mediterranean treat of fresh ricotta drizzled with regional honey, this really is one the simplest and best desserts imaginable. The main challenge is to find good fresh ricotta. You want the kind that is delicate and custardlike, so avoid the commercial, grainy supermarket kind. <a href=\"https://cooking.nytimes.com/recipes/1015560-fresh-ricotta\">You can, of course, make your own,</a> though if you find fresh ricotta sold in little plastic basket molds, it makes a lovely presentation, unmolded onto a plate, cut into wedges at the table and served with a refreshing rhubarb sauce. You'll have plenty of the sauce left over: Save it for spooning over plain yogurt, ice cream or pound cake.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/03/04/dining/28Tanisrex-rhubarb/merlin_169404474_63f21c53-19fd-4df9-892f-e479a5ff2453-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 servings, plus extra sauce", "recipeCuisine": "", "recipeCategory": "easy, parfaits and trifles", "keywords": "cardamom, ginger, rhubarb, ricotta, dessert, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "recipeIngredient": ["1 1/4 cups granulated sugar", "1/4 cup finely slivered or grated fresh ginger (from a 3-inch piece)", "12 cardamom pods", "1 pound rhubarb, cut into 1/2-inch (or slightly smaller) pieces", "3/4 pound fresh ricotta", "Handful of toasted pine nuts or chopped pistachio (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put sugar, ginger, cardamom and 1 cup water in a nonreactive saucepan or skillet, and bring to a boil over medium-high heat. Turn heat to low and let syrup simmer for 5 minutes. Do not strain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add rhubarb and stir to incorporate syrup, then continue to simmer for another 5 minutes or so. Set aside and let cool. (The rhubarb syrup can be made a day or two in advance, and becomes more intense.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve a large spoonful or wedge of ricotta on a small plate. Spoon at least 2 tablespoons of rhubarb sauce over the cheese. Garnish with pine nuts or pistachio, if using."}], "link": "https://cooking.nytimes.com/recipes/1020891-fresh-ricotta-with-rhubarb-ginger-and-cardamom"}