{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Fried Eggplant With Chile, Honey and Ricotta", "description": "For the crispest, most burnished pieces of eggplant, nothing beats frying, and it’s worth every last splattered drop of oil to get there. This dish pairs the golden spears of fried eggplant with milky ricotta cheese, fried garlic slices, red-pepper flakes and a generous drizzle of honey. You can serve it as a first course, a substantial side dish or a light main course with a green salad on the side. Note that tender, young eggplant cook a lot more quickly than denser, larger ones, and are worth seeking out here.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/10/09/dining/04appe1/merlin_161591136_8f385ead-5f37-42f7-a114-7e557670ad26-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weekday, vegetables", "keywords": "appetizer, eggplant, garlic, honey, ricotta, fall, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 242}, "recipeIngredient": ["1 1/2 pounds Japanese or other slender eggplant, cut into 3-inch-by-1-inch spears", "Fine sea salt, as needed", "1/4 cup extra-virgin olive oil, plus more as needed", "5 garlic cloves, thinly sliced", "12 ounces whole-milk ricotta ", "1 tablespoon honey, or to taste", "Red-pepper flakes, to taste", "Flaky sea salt, to taste", "1/3 cup torn fresh basil leaves", "Lemon or lime wedges, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle eggplant lightly with fine sea salt, and let sit while you heat the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 12-inch skillet over medium. When hot, add oil and heat until shimmering. Pat eggplant dry if necessary, then arrange in a single layer in the skillet (cooking them in batches if necessary to prevent crowding). Fry until softened and golden brown on all sides, turning them often, about 9 to 15 minutes total."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer eggplant as it cooks to a paper towel-lined plate, and sprinkle very lightly with more fine sea salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the eggplant is cooked, reduce heat under pan to low and add garlic and a little more oil; cook until just golden, 1 to 2 minutes. Use a slotted spoon to transfer to the paper towel-lined plate next to the eggplant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread ricotta on a serving plate. Top with fried eggplant and garlic. Drizzle with honey, sprinkle with red pepper flakes, flaky sea salt and basil. Serve immediately, with lemon or lime wedges on the side if you like."}]}