{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Pressure Cooker Red Beans and Rice", "description": "Here’s a vegan version of the classic New Orleans dish that uses smoked paprika, miso paste and soy sauce to add a savory notes. Pressure cookers are ideal for preparing dried beans; even unsoaked beans cook quickly and evenly, so that the beans become creamy but still keep their shape (though we’ve got instructions for a <a href=\"https://cooking.nytimes.com/recipes/1020816-vegan-slow-cooker-red-beans-and-rice\">slow cooker approach</a>, too). Here, you want the beans to be very tender, so that the stew is thick — with a few beans that have slightly broken down — and not soupy. This vegan version of “Monday red beans” is not as creamy as the one made with pork, so smashing a few beans against the side of the pot at the end of cooking is particularly important. Louisiana-style hot sauce is key as well.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2020/01/22/dining/sd-pressure-cooker-vegan-red-beans-and-rice/sd-pressure-cooker-vegan-red-beans-and-rice-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "american, southern", "recipeCategory": "beans, sausages", "keywords": "bay leaves, bell pepper, celery, garlic, kidney bean, miso, onion, smoked paprika, soy milk, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 22}, "recipeIngredient": ["1/4 cup vegetable oil", "1 large yellow onion, finely chopped", "Kosher salt and black pepper", "3 celery stalks, finely chopped", "1 green bell pepper, finely chopped", "10 garlic cloves, finely chopped", "1 heaping tablespoon white or yellow miso paste", "2 teaspoons smoked paprika", "1 teaspoon sweet paprika", "1 teaspoon onion powder", "1 teaspoon garlic powder", "1/2 to 1 teaspoon ground cayenne, plus more to taste", "1/2 teaspoon ground sage (optional)", "1 pound dried red kidney beans (no need to soak)", "3 dried bay leaves", "3 fresh thyme sprigs or 1 teaspoon dried thyme", "1 teaspoon soy sauce", "Cooked rice, for serving", "Sliced scallions, for serving", "Louisiana-style hot sauce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on the sauté setting of a 6- to 8-quart electric pressure cooker and heat the oil. Add the onion, season with salt, and cook, stirring occasionally, until limp and translucent, 6 to 8 minutes. Add the celery and bell pepper, and cook, stirring occasionally, until softened, 5 to 8 minutes. Add the chopped garlic, miso paste, smoked paprika, sweet paprika, onion powder, garlic powder, cayenne and sage (if using). Grind in a generous amount of black pepper and add 3/4 teaspoon salt. Stir well to combine all the ingredients, then turn off the sauté setting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans, bay leaves, thyme and 5 1/2 cups water. Scrape the bottom of the pot to loosen any browned bits. Cook on high pressure until the beans are creamy, 50 minutes to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the pressure cooker and allow the pressure to reduce naturally for 10 minutes, then release the remaining pressure manually and open the lid. Add the soy sauce, and season to taste with salt and cayenne. Using a fork, mash some of the beans against the side of the pressure cooker to make the mixture creamy. It will continue to thicken as it sits, or you can turn on the sauté setting and let the mixture bubble for a few minutes to thicken. Discard the bay leaves and thyme sprigs. Top the beans with hot cooked rice and scallions; serve with hot sauce."}]}