{"@context": "http://schema.org", "@type": "Recipe", "name": "Thai-Inspired Coconut Chicken Breasts With Vegetables", "description": "This fast but fabulous chicken dish pairs Thai-inspired flavors with French technique. Boneless, skinless chicken breasts have weeknight appeal, largely because they cook so quickly, but that also means they can dry out and become tough if you’re not careful. Here, the chicken is gently cooked for about 10 minutes, then simmered in a ginger-scented coconut sauce studded with green beans and corn, resulting in tender and juicy chicken. Slicing the breasts before serving allows the sauce to coat each piece, adding more moisture and flavor. If you want more heat, sprinkle thinly sliced serrano chile over the top before serving. The best part is the entire meal comes together in about a half-hour: If you’re quick, you can get all the vegetable prep done while the chicken cooks.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/10/04/dining/ss-thai-chicken/ss-thai-chicken-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weeknight, grains and rice, poultry, vegetables", "keywords": "chicken, chicken cutlet, cilantro, ginger, green beans, serrano chili, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 674}, "recipeIngredient": ["4 boneless, skinless chicken breasts (6 to 8 ounces each)", "Kosher salt", "2 tablespoons neutral oil, such as vegetable, canola or grapeseed oil", "1 large shallot, peeled and thinly sliced into rings", "1 large or 2 small garlic cloves, finely grated", "1 (2-inch) piece fresh ginger, finely grated (about 1 1/2 tablespoons)", "1 small serrano chile or jalapeño, finely chopped, or more to taste", "1/2 cup chicken stock", "1 (14-ounce) can unsweetened, full-fat coconut milk", "6 ounces green beans, trimmed and halved crosswise", "1 ear fresh corn, kernels removed, or 1 cup frozen corn kernels", "1/4 cup chopped fresh cilantro, plus more for garnish", "2 limes (1 zested and juiced; 1 cut into wedges)", "Fish sauce (optional)", "Jasmine rice, for serving", "16 Sungold or other cherry tomatoes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken breasts on both sides with salt. In a large (12-inch) lidded skillet, heat the oil over medium-low. Add the chicken, turn to coat with the oil, cover and cook until the thickest part feels springy to the touch, 4 to 5 minutes per side. (For best results, try not to let the chicken brown, and do not overcook; you’ll be cooking it more later.) Set the chicken aside on a warm plate, leaving any liquid in the skillet, and cover the chicken with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the skillet over medium. Add shallot and cook until softened, 2 to 3 minutes. Add garlic, ginger and chile, and cook for 1 minute. Add stock, raise heat to high and cook, scraping the bottom of the skillet with a wooden spoon, until thick and syrupy, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the coconut milk and 1/2 teaspoon salt and bring to a boil. Stir in green beans and corn, and lower heat to medium-high for a steady simmer. Cover and cook until beans are crisp-tender but still bright, and coconut milk is slightly reduced, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chopped cilantro and grated zest of the lime (saving a bit for the top), then season to taste with fish sauce, if using, and salt. Return chicken to the sauce, turning to coat, cover and cook until warmed and cooked through, 2 to 3 minutes. Add 1 tablespoon of the lime juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice each chicken breast. Serve over jasmine rice, then spoon the vegetables and sauce on top. Sprinkle with remaining lime zest, and garnish with tomatoes and cilantro leaves. Serve with lime wedges."}], "link": "https://cooking.nytimes.com/recipes/1020521-thai-inspired-coconut-chicken-breasts-with-vegetables"}