{"@context": "http://schema.org", "@type": "Recipe", "name": "Steamed Clams With Garlic-Parsley Butter and Leeks", "description": "These beautiful clams are strongly flavored with the same kind of garlicky emerald-green butter that’s used on escargots, also known as snail butter. It’s just three ingredients — butter, garlic and parsley — so how you handle them matters: For an intense green color, use a food processor to chop the parsley as finely as possible. This is meant to be a small first course, just four or five clams per person, but feel free to increase the quantities for larger servings or to serve as a main course.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/03/04/dining/28Tanisrex-clams/merlin_169404546_96f59cb0-b531-4e19-b8d5-7e81ed8e3e7e-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, seafood", "keywords": "appetizer, dry white wine, leek, lime, littleneck clams, parsley", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 10}, "recipeIngredient": ["1/2 cup unsalted butter (1 stick), softened", "1 cup roughly chopped parsley, leaves and tender stems", "1 or 2 small garlic cloves, grated or minced", "Kosher salt and black pepper", "1 tablespoon extra-virgin olive oil", "1 cup chopped leeks (from 2 medium leeks), white and light green parts only", "24 littleneck clams, scrubbed and rinsed (about 2 to 3 pounds)", "1 1/2 cups dry white wine", "1/2 teaspoon grated lime zest", "2 tablespoons lime juice", "Lime wedges, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the garlic butter: Combine butter, parsley and garlic in a food processor. Whiz until bright green and well incorporated, about 1 minute. Season lightly with salt and pepper. (You may make the garlic butter in advance and refrigerate it for up to 2 days or freeze for up to 2 weeks, but it tastes best freshly made.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a wide, deep skillet or Dutch oven over medium-high heat, add olive oil and swirl to coat. Add leeks, stir to coat, and cook for 30 seconds, then add clams and wine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat to high, cover and cook for 5 to 8 minutes, until all clams have opened. With a slotted spoon or tongs, transfer clams to individual bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, over medium heat, add lime zest, lime juice and butter, and let simmer briefly, about 30 seconds, until warmed through. Pour sauce over clams, garnish with lime wedges and serve."}]}