{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan ‘Queso’", "description": "This recipe is for “queso,” and yes, the dish name is in quotation marks. That’s because it’s a dairy-free version of the familiar bright-orange cheesy dip. The recipe is adapted from the cookbook “Amá: A Modern Tex-Mex Kitchen” by the chef Josef Centeno, whose Los Angeles restaurant serves Tex-Mex classics and modern variations. Though the texture of processed cheese is impossible to replicate, this cashew dip is delightfully creamy with layers of complex flavor. For best results, make sure to thoroughly toast the cashews, char the vegetables and blend until the dip is completely smooth.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2019/09/11/dining/tr-cashew-queso/merlin_160427208_4d6b367b-aeea-4850-a891-098560678505-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 cups", "recipeCuisine": "american", "recipeCategory": "snack, burritos and nachos, condiments, dips and spreads, finger foods", "keywords": "almond milk, cashew, chipotles in adobo, cilantro, tomatillo, turmeric, appetizer, dairy-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 222}, "recipeIngredient": ["6 ounces tomatillos, husked and rinsed", "1 serrano chile", "1 shallot", "3 garlic cloves", "Fine sea salt", "1/2 bunch cilantro, coarsely chopped", "1 cup raw cashews", "1 chipotle pepper in adobo", "3/4 cup to 1 1/4 cups unsweetened almond milk", "1/2 teaspoon ground turmeric", "1 teaspoon kosher salt", "1 tablespoon finely chopped red onion, for garnish", "1 tablespoon finely chopped cilantro, for garnish", "Tortilla chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salsa: Put the tomatillos, chile, shallot and garlic on a foil-lined baking sheet and sprinkle with salt. Broil until the vegetables are charred and soft, turning halfway through, about 10 minutes. Once slightly cooled, transfer to a blender or food processor, add the cilantro and purée until smooth. (Reserve a few tablespoons salsa for garnish and leave the remaining salsa in the blender, as you’ll add more queso ingredients to it in a few minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the queso: Toast the cashews in a large skillet over medium heat, shaking the pan occasionally, until the cashews are a light golden brown and fragrant, about 10 minutes. Remove from heat and set aside to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cooled, add the cashews, chipotle pepper, 3/4 cup almond milk, turmeric and salt to the tomatillo mixture in the blender, and purée until smooth. Add more almond milk as needed to get a smooth consistency, but be careful not to add too much or the dip will be too thin. Taste and adjust seasoning with salt, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cashew queso to a bowl, drizzle with the reserved tomatillo salsa and garnish with chopped onion and cilantro. Serve warm with tortilla chips."}], "link": "https://cooking.nytimes.com/recipes/1020460-vegan-queso"}