{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick Ragù With Ricotta and Lemon", "description": "Meat ragù traditionally requires a long simmer over low heat, but this 45-minute version owes its slow-cooked flavor to a hefty dose of red-pepper or chile paste, which yields a complex, hearty sauce. (This recipe calls for sambal oelek, which is easy to find, but Calabrian chile or Hungarian paprika paste would work well, too.) Spoon the ragù over cooked, broken lasagna noodles and top it with a dollop of creamy ricotta, a sprinkle of toasted fennel and a few curls of lemon zest. This recipe uses beef, but you could also prepare it with spicy Italian sausage, or ground pork or turkey — though you may want to amplify the flavor by tossing in a little fennel seed and red-pepper flakes with the onion and garlic in Step 1.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/05/14/dining/sc-weeknight-beef-ragu/merlin_154348221_ba4c3b05-1ecb-4420-8967-1ec0c6fea5fe-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, weekday, pastas", "keywords": "fennel seeds, ground beef, lemon, red wine, ricotta, sambal oelek, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 400}, "recipeIngredient": ["1/4 cup extra-virgin olive oil, plus more for drizzling", "1 medium onion, thinly sliced", "2 garlic cloves, peeled and smashed", "Fine sea salt and black pepper", "1 pound ground beef", "2 heaping tablespoons sambal oelek (or any spicy red-pepper paste)", "1/4 cup full-bodied red wine, like cabernet or merlot", "1 (28-ounce) can whole peeled tomatoes, with their juices", "8 ounces plain or whole-wheat lasagna noodles (not no-cook), broken in 1- to 2-inch pieces", "1 teaspoon fennel seeds", "1 cup fresh ricotta", "1 lemon, zested", "Flaky salt, like Maldon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven or pot, heat 1/4 cup oil over medium. Add the onion and garlic, season with salt and cook until just beginning to soften, about 5 minutes. Add the ground beef and cook, breaking it apart with the edge of a spoon, until nicely browned but not completely cooked through, about 6 minutes. Stir in the sambal oelek. Add the wine and stir to release any brown bits from the bottom of the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes and their juices, crushing completely between your hands or with a potato masher. Cook over medium-low, stirring occasionally, until the tomatoes begin to break down and the beef is cooked through, about 30 minutes. Season with salt and pepper halfway through cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a large pot of generously salted water to a boil. Boil the broken lasagna noodles according to package directions until al dente."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet, toast the fennel seeds over medium until fragrant, 2 to 3 minutes. Remove and crush on a cutting board with the flat end of a large knife or the bottom of a skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the pasta, add to the ragù and toss to coat. Divide among four bowls and dollop each generously with ricotta. Sprinkle with lemon zest, cracked fennel, flaky sea salt and pepper. Drizzle with olive oil as desired. Serve warm."}], "link": "https://cooking.nytimes.com/recipes/1020236-quick-ragu-with-ricotta-and-lemon"}