{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Corned Beef and Cabbage", "description": "Corned beef is really just brisket that’s been cured in salt and spices. Historically, this was done for preservation, but the method of “corning” has remained because it transforms the meat into a bold, aromatic and salty treat. You can <a href=\"https://cooking.nytimes.com/recipes/1018642-homemade-corned-beef\">corn your own brisket</a> if you have a week to spare, or you can buy one that’s brined but uncooked, which is what is used here. Each one comes with a little sachet of pickling spices, usually coriander and mustard seeds, allspice and crumbled bay leaf. Make sure to fish it out of the package and save it, because those spices perfume the beef as it braises. Get a corned beef made from flat-cut brisket, if you can, as it will be easier to slice into neat, uniform slabs. (The point cut has more striations of fat and may fall apart when sliced.) Serve this satisfying one-pot meal with mustard and beer. (If you have more time, or you don't have a pressure cooker, here are <a href=\"https://cooking.nytimes.com/recipes/1020070-slow-cooker-corned-beef-and-cabbage\">slow cooker</a> and <a href=\"https://cooking.nytimes.com/recipes/1020074-corned-beef-with-cabbage-potatoes-and-carrots\">oven</a> versions of the recipe.)", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/03/15/dining/15-pressure-cooker-corned-beef/merlin_150865539_151b1efa-0dc5-468b-926c-3fd4c41dc53a-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "american, irish", "recipeCategory": "dinner, lunch, meat, vegetables", "keywords": "cabbage, carrot, corned beef, potato, white wine, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 261}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 972, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "8 grams", "proteinContent": "60 grams", "saturatedFatContent": "18 grams", "sodiumContent": "4684 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 to 3 1/2-pound ready-to-cook corned beef, preferably flat-cut", "1 1/4 cups semi-dry white wine, such as Riesling", "1 pound red or Yukon gold potatoes, cut into 1- to 2-inch pieces", "2 to 3 large carrots (about 1/2 pound), peeled and cut into 1- to 2-inch pieces", "1/2 small head green or savoy cabbage (about 1 pound), core left intact, cut into 4 wedges", "3 tablespoons Dijon mustard, plus more for serving", "2 tablespoons honey", "Flaky sea salt, if necessary", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the corned beef from its packaging in the sink and reserve the spice packet. Rinse the beef well under cold running water and pat it dry with paper towels. (If you don’t rinse the brine off the meat, it will be too salty.) If there is a substantial fat cap on top of the beef, you can place the beef on a cutting board and trim most of it, if you’d like. (The fat will not completely render away during cooking.) Be sure to leave at least a thin layer of fat on top, about 1/8- to 1/4-inch thick, to keep the meat moist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the corned beef into the pressure cooker with the fat cap facing up. Add the wine and the spices from the packet. Cover and set steam valve to sealed position. Cook on high pressure for 60 minutes. Let the pressure release naturally for 15 minutes, then release the remaining pressure manually."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the lid. Drop the potatoes and carrots into the liquid that surrounds the beef. Lay the cabbage wedges on top. Cover and set steam valve to sealed position. Cook on high pressure for 15 more minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the pressure release naturally for 10 minutes, then release the remaining pressure manually. Open the lid. Using tongs, remove the cabbage wedges, potatoes and carrots to a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler to high. Stir together the mustard and honey in a small bowl. Using tongs, remove the corned beef from the pressure cooker and put it on a foil-lined sheet pan. Spread the honey-mustard all over the top and sides of the beef and place it under the broiler; cook until the glaze bubbles and caramelizes in spots, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the corned beef rest for 5 to 10 minutes then slice it against the grain into 1/2-inch slabs. Place the beef slices on the serving platter alongside the vegetables and drizzle everything with a little bit of the cooking liquid. Taste the vegetables, and season them with flaky sea salt, if necessary. (The beef will not need to be seasoned with salt.) Season the beef and vegetables to taste with black pepper. Serve with Dijon mustard."}], "link": "https://cooking.nytimes.com/recipes/1020057-pressure-cooker-corned-beef-and-cabbage"}