{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato Rice With Crispy Cheddar", "description": "I could use all sorts of fancy words to explain this dish, but the best description is this: pizza in rice form. The inspiration for the recipe, though, is oddly enough not Italian — it’s a hybrid of a classic South Indian tomato rice with onions and a shockingly fantastic Spanish rice recipe my mom and I photocopied out of my seventh-grade Spanish textbook for a school project. The crispy, bubbly, broiled Cheddar topping (use the sharpest white Cheddar you can find!) adds a little something something, making it a worthy dinner party dish.", "author": {"@type": "Person", "name": "Priya Krishna"}, "image": "https://static01.nyt.com/images/2019/03/29/dining/ml-tomato-rice-with-crispy-cheddar/merlin_152030091_45da5b3f-20fa-43a6-9107-35e86c348e73-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "american, indian", "recipeCategory": "grains and rice", "keywords": "basmati rice, cheddar, green chili, onion, plum tomato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 712}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 377, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "3 grams", "proteinContent": "12 grams", "saturatedFatContent": "7 grams", "sodiumContent": "665 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil", "1 small yellow onion, finely chopped (about 1 cup)", "1 small Indian green chile or Serrano chile, finely chopped", "10 plum tomatoes (about 2 pounds), cut into 1/2-inch pieces", "1 teaspoon kosher salt", "3 cups cooked basmati rice (from about 1 cup dry rice)", "1 cup shredded sharp white Cheddar cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust an oven rack to the highest position and heat the oven to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot or Dutch oven, heat the oil over medium-high. When the oil begins to shimmer, add the onion and chile, spread them out in an even layer and cook, stirring occasionally, until the onion becomes translucent and starts to lightly char, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat to high and add the tomatoes, using the back of a wooden spoon to lightly crush them. Cook, stirring occasionally, until the tomatoes break down into a chunky sauce, 5 to 6 minutes. Add the salt and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the cooked rice and transfer to an 8-inch square (or similar size) baking dish. Sprinkle the grated cheese on top in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Switch the oven to broil and place the baking dish on the oven rack closest to the broiler. Broil until the top bubbles and turns golden brown, about 3 minutes. Serve immediately."}]}