{"@context": "http://schema.org", "@type": "Recipe", "name": "Marsala-Marinated Chicken With Roasted Vegetables", "description": "Marsala and chicken don’t always have to perform the same scaloppine routine, where you sauté the pounded breast and deglaze it with the wine to make a sauce, perhaps adding some mushrooms and cream. You’ll get so much more flavor if you use chicken thighs and let them marinate in the fortified wine with some Dijon and shallots before cooking. Transfer the poultry with mushrooms, carrots and more shallots to a sheet pan, roast them and dinner is done. This Marsala marinade is generous and versatile: It’s veal, pork and lamb-friendly. Set some aside before it touches the meat and you can even turn it into a salad-friendly vinaigrette.", "author": {"@type": "Person", "name": "Charlotte Druckman"}, "image": "https://static01.nyt.com/images/2019/04/23/dining/23marsalarex1/merlin_153567093_192490e2-6964-48d7-916a-45da90cacffc-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, poultry, roasts, vegetables", "keywords": "chicken thighs, dijon mustard, marsala, mushroom, oregano, shallot, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 482}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 615, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "8 grams", "proteinContent": "23 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1096 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 large shallots", "3 tablespoons Dijon mustard, plus more to taste", "1 tablespoon honey", "Kosher salt and black pepper", "2 cups dry Marsala", "1/4 cup plus 6 tablespoons extra-virgin olive oil, and more to taste", "6 bone-in, skin-on chicken thighs (about 2 pounds)", "2 fresh oregano sprigs plus 2 tablespoons chopped fresh oregano leaves", "4 large carrots (about 3/4 pound)", "3/4 pound mixed mushrooms, such as cremini and shiitake (or fancier chanterelle, maitake, or morel mushrooms)", "3 tablespoons apple cider vinegar", "10 ounces salad greens"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the marinade: Finely chop 2 shallots. In a large bowl, stir the chopped shallots with 3 tablespoons mustard, the honey, 2 1/2 teaspoons salt and 1 teaspoon pepper. Whisk in the Marsala then 1/4 cup oil. Refrigerate 1/4 cup marinade to use for the vinaigrette."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken and oregano sprigs in a large zip-top bag and add the remaining marinade. Seal the bag and turn it over a few times before laying it flat in the refrigerator for at least 3 hours or, ideally, overnight, turning it once or twice while it marinates. (If you’re in a rush, marinating it at room temperature for 30 minutes is a quick shortcut.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Peel the carrots, halve them lengthwise if thick, then chop them into 1 1/2-inch-long pieces. Clean the mushrooms and remove any tough stems. Quarter the whole shallots from root to stem and discard the skins. Place the prepped vegetables in a large bowl and toss with 3 tablespoons oil, 1 teaspoon salt and 1/2 teaspoon pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken from the marinade and place each piece skin side up on a large rimmed sheet pan. Scatter the vegetables around the chicken, arranging them in an even layer. Discard the marinade in the zip-top bag."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until the chicken is cooked through and its juices run clear, 35 to 40 minutes. Transfer the chicken to a serving platter to rest. Stir the remaining vegetables and return the pan to the oven to cook until the carrots are starting to brown and become tender, the mushrooms are golden and beginning to crisp, and the shallots have caramelized, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the vinaigrette: Whisk the refrigerated 1/4 cup marinade with the vinegar, then the remaining 3 tablespoons oil. Season to taste with salt and pepper. Adjust the flavor as desired, adding more olive oil for a less acidic vinaigrette or more Dijon for something a bit sharper and creamier."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the vegetables to the serving platter, scattering them around the chicken, and pour any cooking juices left in the pan over the top. Garnish with the chopped oregano. Toss salad greens with just enough vinaigrette to coat. Season the salad to taste and serve with the chicken and vegetables."}], "link": "https://cooking.nytimes.com/recipes/1020131-marsala-marinated-chicken-with-roasted-vegetables"}