{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Cod and Scallions With Cucumber Yogurt", "description": "You can use any mild, flaky fish for this quick, weeknight-friendly recipe. The scallions add sweetness and crunch to the delicate fish, flavored with soy sauce and fish sauce for an extra salty depth. Then it’s all dolloped with a tart, creamy yogurt sauce that’s both pungent from the garlic and cool and crisp from the chopped cucumber. Serve this dish with more sliced cucumber on the side and some pita bread or a baguette to soak up any remaining sauce. You won’t want to waste even a drop.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/07/01/dining/mc-roast-cod-and-scallions/merlin_156441195_1bbf3660-b61f-4dd1-945a-a01990ecdc31-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 152}, "recipeIngredient": ["1 bunch scallions, green and white parts separated", "3 tablespoons extra-virgin olive oil, plus more for drizzling", "Fine sea salt and freshly ground black pepper", "4 (6- to 8-ounce) boneless, skinless cod fillets ", "1 1/2 teaspoons soy sauce", "1 teaspoon fish sauce", "2/3 cup plain Greek yogurt", "2/3 cup finely chopped Persian or English (hothouse) cucumber", "1 tablespoon minced fresh dill or mint", "2 teaspoons fresh lemon juice, plus more for serving", "1 garlic clove, finely grated or mashed to a paste", "Red-pepper flakes, preferably Urfa or Espelette", "Flaky sea salt, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Mince enough of the scallion greens to equal 2 tablespoons and reserve. Halve remaining scallion whites and greens lengthwise to make ribbons. Place scallion ribbons in a bowl and toss with 1 tablespoon oil and a pinch of salt; set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season cod with salt and pepper, and place on a rimmed baking sheet. Drizzle cod with a little oil, soy sauce and fish sauce. Transfer to the oven and roast, 2 minutes. Add scallion ribbons to the baking sheet, spreading them out in one layer around the fish, and roast until the fish is opaque in the center and golden at the edges, and scallions are browned in spots, 6 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While fish roasts, make the sauce: In a small bowl, mix together remaining 2 tablespoons olive oil with 1 tablespoon minced scallion greens, the yogurt, cucumber, dill, lemon juice, garlic and salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, arrange cod and scallions on serving plates and squeeze lemon over the top. Dollop yogurt sauce over with cod and garnish with remaining scallion greens, red-pepper flakes, more black pepper, and sea salt, if you like."}]}