{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick Lamb Ragù", "description": "A simple sauce made mostly with pantry staples, this spicy, tomatoey take on a ragù, which is traditionally long-cooked, is unapologetically lamb-forward. If you prefer, you could use pork, beef or a mix of all three. Whatever you do, try not to skip the anchovies — they add a depth of flavor typically achieved by a long simmer, and anchovy-haters won't even know they are there.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/02/20/dining/20Romanrex/merlin_147497019_27213a02-49d8-48e8-94c8-e5ecb5894970-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas", "keywords": "anchovy, crushed canned tomatoes, ground lamb, pasta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1592}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 312, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "3 grams", "proteinContent": "15 grams", "saturatedFatContent": "8 grams", "sodiumContent": "555 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons olive oil, plus more for drizzling", "1 medium yellow onion, finely chopped", "4 garlic cloves, finely chopped", "Kosher salt and black pepper", "Pinch of red-pepper flakes (optional)", "2 anchovy fillets (optional)", "2 tablespoons tomato paste", "1 pound ground lamb", "1 (28-ounce) can crushed tomatoes", "12 ounces cooked pasta, noodles or tubes, for serving", "A good hunk of Parmesan or pecorino, for serving", "A small handful of marjoram, oregano or thyme, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil in a large Dutch oven or heavy-bottomed pot over medium heat. Add onions and garlic, and season with salt and pepper. Cook, stirring occasionally, until the onions have become translucent and have totally softened, 5 to 8 minutes. Add a pinch of red-pepper flakes and anchovies, if using, and cook for a minute or two, just to toast the spices and melt the anchovies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomato paste and continue to cook, stirring occasionally so it has a chance to stick to the bottom of the pot and caramelize a bit, 2 or 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add lamb and season with salt and pepper. Using a wooden spoon or a spatula, stir lamb until the fat starts to soften and the meat begins to break down. Continue to cook, stirring rather frequently until the lamb begins to brown and sizzle in its own fat, 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add crushed tomatoes, stirring to scrape up any bits on the bottom of the pot. Fill the tomato can halfway with water and swirl around to get all the remaining tomato, then add to the pot. Season with salt and pepper and bring to a simmer. Reduce heat to medium-low and continue to cook until sauce is thickened and insanely flavorful, 25 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve sauce mixed into and over pasta with plenty of cheese for grating over the top, scattered with a small handful of marjoram, oregano or thyme leaves if you like."}], "link": "https://cooking.nytimes.com/recipes/1020022-quick-lamb-ragu"}