{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Hot Honey Ribs", "description": "These simple, snackable ribs are slow cooked until they are very tender. Then the ribs are brushed with spicy honey, and broiled for 2 minutes to caramelize. Don’t worry that the ribs go into the slow cooker without liquid; the heat is gentle enough that the ribs do not burn, and the meat releases liquid as it cooks, so it braises in its own spiced juices. (You could also make these ribs in a pressure cooker by following <a href=\"https://cooking.nytimes.com/recipes/1020483-pressure-cooker-hot-honey-ribs\">this recipe</a>.) One thing to note: Red chiles taste best in this recipe because green chiles are less sweet and can taste grassy. Any spicy red chile will work beautifully, and red-pepper flakes work in a pinch. If you prefer green chiles, however, you can use them.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/09/18/dining/sd-slow-cooker-hot-honey-ribs/sd-slow-cooker-hot-honey-ribs-articleLarge.jpg", "totalTime": "PT6H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, finger foods, meat", "keywords": "appetizer, main course, baby back ribs, honey, lime, paprika, thai chile", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 175}, "recipeIngredient": ["2 tablespoons sweet paprika", "1 tablespoon hot smoked paprika", "1 tablespoon mustard powder", "2 teaspoons garlic powder", "Black pepper", "2 racks baby back ribs (about 4 pounds total)", "2 tablespoons kosher salt, plus more as needed", "Vegetable oil or cooking spray, for greasing", "2/3 cup honey", "5 red Thai chiles or 2 red jalapeño or serrano chiles, stemmed and thinly sliced (or 2 tablespoons red-pepper flakes)", "3 (1-inch) strips lime peel and the juice of 1/2 lime (about 1 tablespoon juice)", "1 tablespoon apple cider vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sweet and hot smoked paprika, mustard and garlic powders and several generous grinds of black pepper to a small bowl; mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the ribs from the packaging and pat them dry with paper towels. (The easiest place to do this is the sink.) Turn the ribs over to remove the membrane that covers the back of the ribs: Grasp one end of the membrane with paper towels to keep your hands from slipping and pull; the membrane should pull right off in one or two sheets. (If it is not easy to pull off you can skip this step.) Season the ribs all over, front and back, using about 1 tablespoon of salt per rack of ribs. Coat the ribs in the spice mixture, patting it all over both sides of the ribs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly coat a 6- to 8-quart slow cooker pot with oil or cooking spray. With the meaty sides facing out and the bones pointing up, coil the ribs into the pot, standing them up in a circle. (You do not need to add liquid.) Cook on low until the meat is very tender when flaked with a fork, but the ribs are not quite falling apart, 6 to 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the hot honey: Combine the honey, chiles and lime peel in a small saucepan over medium heat. Let the mixture get very hot, until it simmers and then starts to foam, about 2 minutes. Remove it from the heat, pour it into a small heatproof bowl and set aside. (The honey can be made several days in advance. When it cools, cover it, and store it at room temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a sheet pan with foil. Using tongs, transfer the ribs to the sheet pan, meaty side up. Heat the broiler. Remove the lime zest from the honey (leave the chiles in) and stir the lime juice and apple cider vinegar into the honey. Using a spoon, drizzle the honey all over the ribs, using about half the honey, but leaving the chiles in the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil the ribs until they are caramelized, sizzling and lightly charred in spots, 2 to 3 minutes. (Check the ribs every 30 seconds or so to prevent burning, and rotate them to make sure that all the surfaces get caramelized.) Season the ribs with salt then drizzle more of the hot honey and chiles this time over the ribs, to taste. Serve with any remaining hot honey on the side."}], "link": "https://cooking.nytimes.com/recipes/1020484-slow-cooker-hot-honey-ribs"}