{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Rice Bowl With Bok Choy and Mushrooms", "description": "A bowl of rice with vegetables makes a healthy and delicious meal, especially if the rice is whole grain. Whole-grain rice comes in many colors, from golden amber to rusty red to purplish black. This recipe calls for Thai black sticky rice (also called sweet or glutinous rice), which is pleasantly chewy. In Thailand, black sticky rice is most often used to make sweet rice pudding with coconut milk, but it tastes very good in combination with savory ingredients. If sticky rice is not your thing, you could use Chinese black “forbidden rice,” or any other whole-grain rice. With stir-fried greens and shiitake mushrooms, this visually stunning dish is full of goodness, kissed with ginger, garlic and sesame.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/04/24/dining/19kitchrex/merlin_153211740_4baf2274-e0f5-4c1a-bbd3-d18323ec9a47-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "weekday, grains and rice", "keywords": "black rice, bok choy, chiles de árbol, shiitake, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 188}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 105, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "6 grams", "proteinContent": "5 grams", "saturatedFatContent": "0 grams", "sodiumContent": "644 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups black glutinous (sticky) rice, or other whole-grain rice (soaked in cold water for 1 hour, if possible)", "2 tablespoons vegetable oil", "4 ounces shiitake mushrooms, thickly sliced (about 3 cups)", "Salt", "3 dried red Chinese peppers or 3 dried chiles de árbol", "2 teaspoons minced ginger", "1 teaspoon minced garlic", "1 tablespoon soy sauce", "Pinch of sugar (optional)", "2 pounds bok choy or other sturdy Asian greens, such as gai lan or mizuna, leaves cut crosswise into 2-inch pieces, ribs cut into 1/2-inch pieces (about 8 cups)", "1 teaspoon toasted sesame oil", "1/4 cup thinly sliced scallions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the rice: Rinse rice well and drain. Put rice in a 2-quart saucepan and cover with 3 1/2 cups water. Bring to a boil over high heat, then turn heat to low. Cover and cook for 30 minutes. Turn off heat and let the rice sit, covered, for 15 minutes, to continue steaming off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As rice rests, cook the mushrooms: Put 1 tablespoon oil in a wide wok or heavy, deep-sided skillet, and place over medium-high heat. When oil shimmers, add mushrooms, sprinkle with a little salt and stir-fry for about 1 minute, letting mushrooms brown a bit. Remove mushrooms from pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 1 tablespoon oil to the pan. When oil is hot, add peppers, ginger and garlic, and let them sizzle for 30 seconds or so, without browning. Add soy sauce, sugar (if using) and 1/2 cup water and turn heat to high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add greens and stir-fry, mixing well and allowing greens to wilt. The greens should be done in about 2 minutes, but still firm and bright. Add reserved mushrooms and toss to incorporate. Drizzle with sesame oil and turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mound a cup of rice in each serving bowl. Surround rice with the greens mixture and sprinkle with scallions."}]}