{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato Casserole Pie", "description": "This showstopping dessert, which is inspired by the classic Thanksgiving side dish, is really a pie baked in a springform pan. (Don’t try it in a pie pan because the filling will likely overflow.) What makes this dessert a winner is the textural contrast between the creamy sweet potato filling, the crisp pecan crust and the gooey marshmallow topping. Here are a few tips for best results: Roast the sweet potatoes instead of boiling them because it enhances their flavor, and use smaller sweet potatoes because they are naturally sweeter than larger varieties. Also, it may seem fussy, but chilling the cooked potatoes, then aggressively whipping them, aerates them, resulting in a silkier texture. Once baked and cooled, refrigerate the pie until right before it’s time to serve.", "author": {"@type": "Person", "name": "Jerrelle Guy"}, "image": "https://static01.nyt.com/images/2019/10/29/dining/jg-sweet-potato-pie/merlin_162370008_82cfc608-d37c-4ebb-b60b-7f9938f06521-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": " One 9-inch deep-dish pie (about 12 servings)", "recipeCuisine": "american", "recipeCategory": "snack, pies and tarts", "keywords": "cinnamon, evaporated milk, marshmallow, pecan, sweet potato, vanilla, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 286}, "recipeIngredient": ["2 pounds/900 grams small sweet potatoes, unpeeled", "1 1/2 cups/150 grams pecan halves", "1/2 cup plus 2 tablespoons/140 grams packed light brown sugar", "4 tablespoons/60 grams unsalted butter (1/2 stick), softened", "1 teaspoon kosher salt", "1 teaspoon ground cinnamon", "1/2 teaspoon ground nutmeg", "1/4 teaspoon ground ginger", "1 (12-ounce) can evaporated milk", "2 teaspoons vanilla extract", "3 large eggs, at room temperature", "6 ounces marshmallows (about 27) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees and line a baking sheet with parchment; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the tines of a fork, carefully poke holes into the surface of each sweet potato. Place the sweet potatoes on the prepared baking sheet and bake until fork-tender and the skins are crisp, 45 to 50 minutes. Lower the oven to 350 degrees, remove the sweet potatoes and let sit until cool enough to handle, 15 to 20 minutes. Peel them, discarding the skins, and transfer peeled sweet potatoes into a large bowl; mash until creamy (you should have about 2 generous cups). Place the bowl into the refrigerator to chill while you make the crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the bottom of a 9-inch springform pan with a piece of parchment. In a food processor, combine the pecans, 2 tablespoons light brown sugar, 2 tablespoons butter and 1/2 teaspoon salt; blend on high until the mixture looks like coarse bread crumbs, about 20 seconds. Sprinkle the mixture into the bottom of the pan and press down firmly to compact the crust. (If using a pie plate, press up the sides as well.) Bake until deep golden brown and fragrant, 18 to 20 minutes. Let the crust cool while you make the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the oven to 325 degrees. Into a stand mixer fitted with a paddle attachment, add the chilled potatoes and beat on medium for 3 minutes, scraping the sides of the bowl and beater as you go. Add the remaining 1/2 cup light brown sugar, 2 tablespoons butter and 1/2 teaspoon salt, along with the cinnamon, nutmeg and ginger. Beat on medium speed to combine for 2 to 3 minutes, again stopping to scrape down the sides of the bowl and beater as you go. Reduce the speed to low and add the evaporated milk and vanilla, beating until combined. Add the eggs, one at a time, beating until fully incorporated, then turn the speed to medium-high and beat for another 45 seconds before pouring the mixture into the cooled crust. Set the pie on top of a baking sheet, then bake until set around the edges but just slightly jiggly in the center, 60 to 70 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the pie to cool for 10 to 15 minutes, then carefully arrange the marshmallows on top in an even layer. (If you set the marshmallows on the hot pie as soon as it comes out of the oven, they’ll melt into a flat layer. Allowing the pie to cool a bit first helps them retain their shape.) Once the pie cools to room temperature, cover it with foil and transfer it to the fridge to chill, at least 4 hours or up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, heat the broiler and position an oven rack close to the broiler. Place the pie under the broiler until marshmallows are browned in spots, 1 to 3 minutes, depending on how charred you prefer your marshmallows, watching closely. Remove from the oven and let the pie rest for 10 minutes to allow the marshmallows to set and harden before running a knife around the edges of the pan and releasing the ring. Slice and serve immediately."}]}