{"@context": "http://schema.org", "@type": "Recipe", "name": "Bakewell Tart With Cranberry Sauce", "description": "A layer of cranberry sauce below orange-scented almond frangipane is the perfect balance of tart and sweet. It’s a holiday play on Britain’s beloved Cherry Bakewell tart that gives you a reason to make extra sauce — or a good excuse to use up leftovers. Temperatures are key to the result: The cranberry sauce needs to be slightly warm to spread over the prebaked pie crust, and the frangipane must be fridge-cold to prevent it from splitting in the oven.", "author": {"@type": "Person", "name": "Clare de Boer"}, "image": "https://static01.nyt.com/images/2019/11/20/dining/15pierex2/merlin_164213190_3e74742f-1bc4-4f76-90f6-ecb5a5a601eb-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "One 11-inch tart (about 10 servings)", "recipeCuisine": "american, british", "recipeCategory": "pies and tarts", "keywords": "almond meal, butter, cranberry, crème fraîche, orange, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "recipeIngredient": ["Shortcut Pie Crust (<a href=\"https://cooking.nytimes.com/recipes/1020632-shortcut-pie-crust\">see recipe</a>)", "Crème fraîche", "1 1/4 cups/285 grams unsalted butter (2 1/2 sticks), at room temperature", "1 1/2 cups/300 grams granulated sugar", "1 teaspoon fresh orange zest (from 1/2 navel orange)", "3 large eggs", "2 1/2 packed cups/285 grams fine almond meal", "7 ounces/200 grams fresh or frozen cranberries", "1/2 cup/100 grams granulated sugar", "1 tablespoon fresh navel orange juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the <a href=\"https://cooking.nytimes.com/recipes/1020632\">Shortcut Pie Crust</a> through Step 3."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the almond frangipane: In a food processor, cream together the butter, granulated sugar and orange zest until pale and fluffy, about 30 seconds. With the machine running, add eggs one at a time, emulsifying each one fully before adding the next, and scraping down the sides of the work bowl as needed. Fold in the almond meal and chill until firm, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working over an 11-inch fluted tart shell, prepare the Shortcut Pie Crust through Step 4, then chill, at least 30 minutes or up to 2 days. (This can be done ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Bake the chilled crust until just cooked but not browned, about 15 minutes. (The crust will continue to cook while the tart bakes, so expect it to darken in color when it bakes the second time.) Set aside to cool completely, about 1 hour, while you make the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you are making your own cranberry sauce, combine cranberries, granulated sugar and 2 tablespoons water in a small saucepan, and cook over low heat, stirring occasionally, until the berries fully break down, 20 to 25 minutes. Add orange juice near the end of cooking. Set aside. (You should have about 3/4 cup sauce.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the cranberry sauce in an even layer over the base of the cooled crust. It is easiest to do this when the cranberry sauce is slightly warm. (If you are using chilled sauce from the refrigerator, warm it slightly first before spreading.) Scoop the almond frangipane on top of the cranberry sauce. (Don’t try to spread it; it will distribute itself evenly as it cooks.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the tart on a baking sheet at 350 degrees until it’s golden brown and fully set in the center, 60 to 75 minutes. Cool completely, then remove from the pan and serve with crème fraîche."}], "link": "https://cooking.nytimes.com/recipes/1020610-bakewell-tart-with-cranberry-sauce"}