{"@context": "http://schema.org", "@type": "Recipe", "name": "Veal Chops in Cherry-Pepper Sauce", "description": "You can use this sauce — spicy and fragrant and slightly syrupy, what the Italians call agrodolce — on veal chops as I call for here, or on <a href=\"https://cooking.nytimes.com/recipes/1020701-pork-chops-in-cherry-pepper-sauce\">pork chops</a>, on steaks, on chicken. I bet it’d be good on grilled seitan or drizzled over tofu. The recipe is reminiscent of the cooking at red-sauce emporia like Bamonte’s in Brooklyn, Rao’s in Manhattan, Dominick’s in the Bronx and, I hope, <a href=\"https://www.nytimes.com/2013/06/05/dining/reviews/restaurant-review-carbone-in-manhattan.html\">Carbone</a> in Greenwich Village, where I first learned how to put it together at the elbow of the chef Mario Carbone. Serve with spaghetti dressed in butter and Parmesan, with garlic bread, with a spoon so you can slurp what’s left on the plate. “It’s a flavor that’s purely Italian-American,” Carbone told me. “You won’t find it in Italy, no way.”", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/12/15/magazine/15mag-eat-image/15mag-eat-image-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "easy, meat, one pot, steaks and chops", "keywords": "cherry peppers, parsley, veal chop, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 234}, "recipeIngredient": ["1 (16-ounce) jar pickled hot cherry peppers", "3 tablespoons olive oil", "3 garlic cloves, peeled and thinly sliced", "1 cup dry white wine", "Kosher salt and freshly ground black pepper, to taste", "4 bone-in veal chops, cut about 1-inch thick (approximately 10 ounces each)", "1 tablespoon neutral oil, like canola or grapeseed", "2 tablespoons cold salted butter", "2 tablespoons chopped flat-leaf parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Drain the cherry peppers, reserving 1 cup brine, then stem, halve, core and seed them. Place a large skillet over medium-high heat, and swirl the olive oil into it. When the oil begins to shimmer, add the garlic, and sauté, stirring frequently, until it begins to color, 1 to 2 minutes. Add the peppers, the reserved brine and the white wine, and bring to a boil over high heat. Cook until the liquid has reduced by slightly more than half, 10 to 15 minutes. Season to taste with salt and pepper, and remove from the heat. (The sauce can be made a few hours ahead of time.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to cook the meat, season it aggressively with salt and pepper. Place a large, heavy-bottomed skillet over medium-high heat, and swirl the neutral oil into it. When the oil begins to shimmer, place the meat in the pan, working in batches if needed, and sear until the meat has browned, formed something of a crust and cooked through to medium-rare, 5 to 6 minutes on each side. Transfer the chops to a warmed platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sauce to the large, heavy-bottomed skillet in which you seared the meat, and warm over medium-low heat. Whisk the butter into the sauce until evenly distributed and the sauce develops a velvety sheen. Spoon sauce over chops, and garnish with parsley."}], "link": "https://cooking.nytimes.com/recipes/1020700-veal-chops-in-cherry-pepper-sauce"}