{"@context": "http://schema.org", "@type": "Recipe", "name": "Deep-Dish Honey Apple Galette", "description": "Like a pie but with only one crust, like a galette but thicker, this deep-dish number is the best of all worlds. The buttery crust (made by hand for flakiest results) dramatically envelopes apples that are sweetened mostly with honey. A splash of vinegar is added for acidity, and, of course, there’s a little cinnamon (if you like). Truthfully, any apple is good here, but the tart baking varieties tend to hold their shape and give a bit more structure to the finished dish. Bake in a 9-inch springform pan for tall, festive sides, or a deep-dish 9-inch pie plate for a more rustic feel. ", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/11/13/dining/11Romanrex6/merlin_161933682_c2bd8537-de78-4ada-bea6-920a330971a5-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "10 to 12 servings ", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "apple, honey, sesame seeds, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 734}, "recipeIngredient": ["3 cups/385 grams all-purpose flour", "2 tablespoons granulated sugar", "1 1/2 teaspoon kosher salt ", "1 1/2 cups/340 grams unsalted butter (3 sticks), chilled, cut into 1-inch pieces ", "1 tablespoon apple cider vinegar ", "1/3 cup ice water, plus more as needed ", "2 1/2 pounds firm, tart baking apples, cored and thinly sliced (about 8 cups)", "3/4 cup/180 milliliters mild-flavored honey", "1/2 cup/100 grams granulated sugar, plus 2 tablespoons for sprinkling", "2 tablespoons all-purpose flour, plus more for dusting  ", "1 tablespoon apple cider vinegar or fresh lemon juice", "1 teaspoon ground cinnamon", "1 large egg", "3 tablespoons raw white sesame seeds (optional)", "Flaky sea salt ", "Vanilla ice cream, for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Combine flour, sugar and kosher salt in a large bowl, and use your hands to mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter to the bowl, and use your palms and fingertips to smash the pieces into the flour until you’ve got large, flat butter pieces that are evenly distributed among the flour. Pop the bowl into the freezer for 5 or so minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine vinegar and 1/3 cup water, and drizzle over the flour-butter mixture. Like you’re running your hands through sand, deliberately yet delicately mix the water into the flour/butter mixture. Resist the urge to add more water until you see that it’s absolutely necessary, and even then, use only an additional tablespoon or two."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out onto a work surface, and use your palms to knead it lightly until the shaggy ball transforms into a slightly-less shaggy ball of dough. (It should still be relatively shaggy.) Pat the dough into a disc about 1 inch thick, rotating it to create a nice circle. Wrap in plastic or place in a resealable plastic bag and chill until firm, at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Remove dough from refrigerator, and let it soften slightly at room temperature, about 10 minutes or so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As dough rests, make the filling: Combine apples, honey, 1/2 cup sugar, the flour, the vinegar and the cinnamon in a large bowl. Toss the ingredients so every slice of apple is evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured work surface, roll the dough into a circle about 18 inches in diameter. Transfer dough to a lightly greased 9-inch springform pan, or a 9-inch deep-dish pie plate, letting it slump to meet the bottom of the pan and letting the overhang remain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the apple mixture and any juices that have accumulated to the crust. Drape the excess dough over the filling, covering the apples by about 1 1/2 to 2 inches. (Feel free to trim any dough that feels truly excessive.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the egg with a teaspoon of water and use it to brush the exposed crust. Sprinkle with sesame seeds, if using, the remaining 2 tablespoons of sugar and a little flaky salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place galette on a rimmed baking sheet (for easy cleanup should anything bubble over) and bake until the crust is deeply golden brown (about the color of a well-baked croissant), the apples are tender, and the juices are bubbling and thickened, 65 to 75 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove galette from the oven and let cool completely (at least 2 hours) before slicing and eating, preferably with lots of ice cream."}]}