{"@context": "http://schema.org", "@type": "Recipe", "name": "Coconut-Braised Chicken Thighs With Turmeric and Peppers", "description": "Coriander, lemongrass, ginger, garlic, turmeric and coconut milk create layers of complex flavor in this braised chicken dish that’s lighter and fresher than many traditional curries. Available at Thai supermarkets and other specialty food stores, fresh makrut lime leaves are optional, but perk things up. Any leftover lime leaves — sublime when sautéed with butter and seafood, sliced very thinly and sprinkled as a garnish, or simmered into simple syrup for cocktails — can be stashed in your freezer, where they’ll keep for months.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/12/30/dining/aw-turmeric-braised-chicken/aw-turmeric-braised-chicken-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, curries, poultry", "keywords": "chicken, coconut milk, coconut oil, coriander, garlic, ginger, lemongrass, scallion, turmeric, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 620}, "recipeIngredient": ["2 tablespoons coconut oil or neutral oil", "2 teaspoons ground coriander", "Kosher salt and black pepper", "6 bone-in, skin-on thighs or 4 bone-in, skin-on chicken legs (about 2 1/4 pounds total)", "4 scallions, thinly sliced", "1/4 cup finely chopped fresh lemongrass (cut from the tender centers of 2 stalks)", "1 (2-inch) piece fresh ginger, peeled and finely chopped (about 3 tablespoons)", "3 garlic cloves, thinly sliced", "1 1/2 teaspoons ground turmeric", "4 fresh makrut lime leaves (optional)", "1 cup chicken stock", "1 (14-ounce) can light coconut milk", "5 ounces mini sweet peppers (about 7 peppers), trimmed and thinly sliced (or 1 bell pepper, stemmed, seeded and chopped)", "Fresh cilantro (small sprigs and chopped leaves) or basil (sliced), for serving", "Cooked jasmine rice, rice noodles or fresh ramen noodles, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, deep skillet, heat the oil over medium. In a small bowl, combine the coriander with 2 teaspoons salt and 1 teaspoon pepper. Pat the chicken dry using paper towels, then rub the seasoning all over the chicken. Add the chicken to the skillet, skin-side down, and cook until starting to heat through on one side, 10 minutes. Raise the heat to medium-high and continue to cook, without flipping, until skin is well browned, 4 to 5 minutes. Transfer to a plate, browned-side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to medium-low, add the scallions, lemongrass, ginger, garlic, turmeric and lime leaves, if using, and cook, stirring frequently, until tender, 6 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the stock and coconut milk and bring to a boil over high. Add the chicken, browned-side up, and cook over medium-low until cooked through, 20 to 25 minutes for thighs or 30 to 35 minutes for legs. (Chicken is cooked through when a thermometer inserted into the thickest part registers 165 degrees, or the juices run clear without a trace of pink when chicken is pierced with a knife.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken to a plate, browned-side up. Whisk the sauce in the skillet to emulsify, season to taste with salt and pepper, then add the sliced peppers and cook over medium just until slightly softened, 2 to 3 minutes. Return the chicken to the skillet, browned-side up, and add a few small sprigs cilantro on top of the sauce, for garnish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with rice or noodles, and pass bowls of cilantro at the table, for seasoning to taste."}], "link": "https://cooking.nytimes.com/recipes/1020755-coconut-braised-chicken-thighs-with-turmeric-and-peppers"}