{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemony Turmeric Tea Cake", "description": "This cake, which is adapted from “Nothing Fancy: Unfussy Food for Having People Over,” is so good and so simple to put together, you might come to call it “house cake,” which is, of course, cake to keep in your house at all times. Just slicing into it makes a bad day better, the baked equivalent of burning sage or palo santo to clear the energy. It travels well, and can truly be brought anywhere for any occasion, but most of the time it won’t make it out of your kitchen.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/11/26/dining/ar-lemony-turmeric-tea-cake/merlin_165035286_7fd1d30a-adce-4f81-b363-9066f36471fe-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "One 9-inch loaf", "recipeCuisine": "", "recipeCategory": "snack, cakes", "keywords": "butter, egg, flour, lemon, sour cream, turmeric, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1947}, "recipeIngredient": ["Nonstick cooking spray or butter, for greasing the pan", "1 1/2 cups/215 grams all-purpose flour", "2 teaspoons baking powder", "1 teaspoon kosher salt", "3/4 teaspoon ground turmeric", "2 lemons", "1 cup/200 grams granulated sugar, plus 2 tablespoons for sprinkling", "3/4 cup/180 milliliters sour cream or full-fat Greek yogurt, plus more for serving (optional)", "2 large eggs", "1/2 cup/115 grams unsalted butter (1 stick), melted", "Whipped cream (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Lightly grease a 4-by-9-inch loaf pan (see Tip) with nonstick cooking spray or butter, and line it with parchment, leaving some overhang on both of the longer sides so you’re able to easily lift the cake out after baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the flour, baking powder, salt and turmeric in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate 2 tablespoons zest from 1 lemon into a medium bowl. Halve the zested lemon and squeeze 2 tablespoons juice into a small bowl. Cut half the remaining whole lemon into thin rounds, discarding seeds (save the other half for another use)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 cup sugar to the lemon zest in the medium bowl; rub together with your fingertips until the sugar is fragrant and tinted yellow. Whisk in the sour cream, eggs and the 2 tablespoons lemon juice until well blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spatula, add the wet mixture to the flour mixture, stirring just to blend. Fold in the melted butter. Scrape the batter into the prepared pan, smoothing the top. Scatter the top with the lemon slices and 2 tablespoons sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the top of the cake is golden brown, the edges pull away from the sides of the pan, and a tester inserted into the center comes out clean, 50 to 60 minutes. (If the lemons are getting too dark, lay a piece of foil on top to prevent burning.) Let cool before slicing. (Cake can be baked up to 5 days ahead, wrapped tightly, and stored at room temperature.) Serve with whipped cream, if desired."}]}