{"@context": "http://schema.org", "@type": "Recipe", "name": "Charred Tomato Soup With Coriander and Cilantro", "description": "A chilled tomato soup is most welcome on a sweltering summer day. Charring the tomatoes over coals or under the broiler adds a rustic smoky flavor to this one, while quartered and dressed cherry tomatoes and a spoonful of fresh ricotta or thick yogurt add substance and texture.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/07/17/dining/12kitchenrex/merlin_156916641_b661ded3-eba6-4ccf-b723-1ecec0fd7d80-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "cilantro, coriander, ricotta, sherry vinegar, tomato, main course, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 131}, "recipeIngredient": ["3 pounds ripe red tomatoes", "Salt and pepper", "Extra-virgin olive oil", "2 large garlic cloves, minced", "Pinch of ground cayenne", "1 teaspoon coriander seeds, toasted and ground", "2 cups roughly chopped cilantro leaves and tender stems (from 2 bunches)", "2 tablespoons sherry vinegar", "1 pint cherry tomatoes, mixed colors, cut in quarters", "1 cup fresh ricotta or thick yogurt", "2 tablespoons snipped chives, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a charcoal grill or light the broiler. Remove cores from tomatoes and cut them in half horizontally. Season with salt and pepper on both sides and brush lightly with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place tomatoes skin-side down on the grill and leave for about 10 minutes, until skins are blackened and tomatoes have softened slightly. (If using the broiler, place the tomatoes on a rimmed baking sheet skin-side up and broil for 10 minutes.) Transfer tomatoes to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic, cayenne, coriander seeds, cilantro, 2 tablespoons olive oil and sherry vinegar. Stir all ingredients together. Let mixture sit for 10 minutes to allow flavors to marry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Purée tomato mixture with a blender or food processor. Strain through a medium mesh sieve, if desired. Thin with a little water if too thick. Taste and adjust seasoning. Chill well. (The soup will taste best if served within a few hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put cherry tomatoes in a small bowl. Sprinkle with salt and toss with a tablespoon of olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle the soup into chilled shallow bowls. Put a large spoonful of ricotta on top, and spoon cherry tomatoes over. Sprinkle with chives."}], "link": "https://cooking.nytimes.com/recipes/1020332-charred-tomato-soup-with-coriander-and-cilantro"}