{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Caramel-Apple Crisp", "description": "The caramel sauce does double duty in this warm, comforting crisp. First, it lends sweetness to the apple filling, and second, it yields a lot of leftovers to serve alongside. Use firm, tart apples like Mutsu, Jonathan or Honeycrisp, which will hold their shape during baking. Room-temperature apples work best here: If your apples are cold from the refrigerator, the caramel sauce may seize a bit. Save any extra caramel sauce in your fridge for a rainy day — that is, of course, if you haven't eaten it all.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2019/11/07/dining/ya-apple-crisp/ya-apple-crisp-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "apple, caramel, oats, pecan, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 70}, "recipeIngredient": ["2 cups/400 grams granulated sugar", "3/4 cup/170 grams unsalted butter (1 1/2 sticks), diced", "1 cup/240 milliliters heavy cream", "1 teaspoon vanilla bean paste or extract", "1 teaspoon kosher salt", "3 pounds/1,360 grams tart, firm apples, such as Mutsu, Jonathan or Honeycrisp (about 6 medium apples)", "1 tablespoon fresh lemon juice", "1 teaspoon ground cinnamon", "1/2 teaspoon ground cardamom", "1/8 teaspoon ground cloves", "Pinch of kosher salt", "1 cup/130 grams all-purpose flour", "1 cup/90 grams old-fashioned oats", "1/3 cup/40 grams chopped pecans (optional)", "1/3 cup/75 grams light brown sugar", "1/2 teaspoon kosher salt", "1/2 cup/115 grams unsalted butter (1 stick), softened"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the caramel sauce: Add the granulated sugar and 1/4 cup water to a 3-quart saucepan and stir to combine. Add the butter and set it over medium-high heat, but do not stir. Cook, without stirring, until the butter and sugar have completely melted and started to bubble, 4 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the mixture has begun to brown at the edges, use a heatproof spatula to carefully stir it occasionally until it is deep golden brown and beginning to smoke just slightly, about 4 to 5 minutes. Do not walk away from the pan during this process as the caramel will go from perfectly golden to burned in moments."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the mixture is deep golden, remove the pan from the heat, and carefully whisk in the heavy cream. The mixture will expand and sputter before turning into a smooth sauce. Add the vanilla and salt. If the caramel is at all lumpy, return the pan to the stove on low heat and whisk until smooth. You should have about 2 cups. Carefully pour the caramel into a heat-safe container to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: Heat your oven to 350 degrees and set a rack in the center. Peel, core and slice the apples into 1/2-inch slices, removing any bruised bits if necessary. Combine the sliced apples, lemon juice, spices and salt in a large bowl, and stir to combine. Drizzle 1/2 cup caramel sauce over the top and stir again. Scrape the apples and all of their juices into a 9- or 10-inch oven-safe skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the topping: In the same bowl, combine the flour, oats, pecans, sugar and salt. Stir until well combined, then add the butter and mash it into the dry ingredients with your fingers until crumbs form. Pour the crumb topping evenly over the apples. Bake the crisp until the topping is golden and the juices are bubbling, 40 to 50 minutes. Serve warm with more warm caramel sauce and ice cream. Store any remaining sauce in an airtight container in the refrigerator for about a week. It can be rewarmed for later use in a saucepan over low heat."}]}