{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker White Bean-Parmesan Soup", "description": "A pressure cooker renders dried beans buttery soft in a fraction of the time the stovetop would take. For this recipe, seek out whole wheat berries — not hulled or pearled — because they stand up to the long cook time, developing a pleasant chewiness while maintaining their shape. You can substitute whole farro or spelt, but make sure the farro is not pearled. The key to this soup’s flavor is the Parmesan rind, which infuses the soup with an earthy saltiness. Finally, don’t forget the finishing touches of lemon and parsley: They add brightness and bring other deeper flavors into sharper focus.\n<em>You can also make this recipe in a slow cooker. Find that recipe <a href=\"https://cooking.nytimes.com/recipes/1019696-slow-cooker-white-bean-parmesan-soup\">here</a>.</em>", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/03/12/dining/sd-pressure-cooker-white-bean-parmesan-soup/sd-pressure-cooker-white-bean-parmesan-soup-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, weekday, soups and stews", "keywords": "Cannellini Bean, Fennel, Parmesan, Wheat Berry, White Wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 428}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 553, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "14 grams", "proteinContent": "32 grams", "saturatedFatContent": "7 grams", "sodiumContent": "1002 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup olive oil", "1 large onion, finely chopped", "Kosher salt and black pepper", "1 fennel bulb, cored and finely chopped, fronds roughly chopped and reserved", "3 celery stalks, sliced 1/2-inch thick", "6 garlic cloves, roughly chopped", "1 teaspoon fennel seeds", "1 teaspoon red-pepper flakes", "2 sprigs fresh rosemary or 1 teaspoon dried rosemary, crushed", "1/2 cup dry white wine", "7 to 8 cups chicken stock or broth", "1 pound dried cannellini beans (see Tip)", "1 cup wheat berries", "8 ounces Parmesan, rind removed and reserved", "1 small bunch flat-leaf parsley, stems discarded and leaves chopped", "3 tablespoons fresh lemon juice (from 1 large lemon)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the sauté setting, heat the oil in the pot of a 6- to 8-quart pressure cooker. Add the onion and cook, stirring occasionally, until softened, about 5 minutes. Season generously with salt. Add the fennel and cook, stirring often, until the fennel is softened and the onion is lightly browned, about 5 minutes. Add the celery, garlic, fennel seeds and red-pepper flakes and cook, stirring often, until fragrant, 2 minutes. Add the rosemary and the wine. Bring to a simmer and reduce by half, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the stock, using 7 cups if you have a 6-quart pressure cooker or 8 cups if you have an 8-quart pressure cooker. Season with 1/2 teaspoon salt. Stir in the beans, wheat berries and Parmesan rind. Cover and set steam valve to sealed position. Pressure cook on high for 70 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the pressure to release naturally for 15 minutes then release the remaining pressure manually. Taste the beans to make sure they are soft. If they are not as soft as you would like, cover and set steam valve to sealed position. Pressure cook on high for 10 more minutes and then quick-release the pressure."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before serving, remove and discard the rosemary sprigs. Stir in the chopped parsley, lemon juice and reserved fennel fronds. Season to taste with salt and pepper. Divide among bowls and top generously with grated Parmesan."}]}