{"@context": "http://schema.org", "@type": "Recipe", "name": "Carrot Tart With Ricotta and Feta", "description": "Carrots work beautifully in this simple tart, but onions, parsnips, beets, zucchini or pumpkin work just as well. The key is to cook the vegetables before putting them on the tart, since the moisture released by baking raw vegetables would make the puff pastry soggy and prevent it from rising. Once you remove the tart from the oven, let it cool for 10 minutes before cutting to allow the cheese to firm up slightly. The tart can be served warm, or cooled to room temperature, and would make a great addition to a picnic.", "author": {"@type": "Person", "name": "Sue Li"}, "image": "https://static01.nyt.com/images/2019/04/11/dining/sl-carrot-tart/merlin_152013198_15059831-acda-425c-a7a9-5f7c28dad474-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "brunch, dinner, easy, lunch, pies and tarts, vegetables", "keywords": "carrot, feta, herbs, puff pastry, ricotta, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 486}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 405, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "10 grams", "sodiumContent": "355 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["Flour, for rolling out dough", "1 (14-ounce) package frozen puff pastry, thawed", "1 pound multicolored carrots, scrubbed and sliced lengthwise into 1/4-inch-thick pieces", "1 tablespoon extra-virgin olive oil, plus more for serving", "Kosher salt and black pepper", "8 ounces ricotta", "4 ounces feta, crumbled", "1 garlic clove, grated", "Chopped fresh parsley, chervil or chives, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. On a lightly floured surface, roll puff pastry into a 10-by-14-inch rectangle. Using a paring knife, lightly score a border around the perimeter of the puff pastry about a 1/4-inch away from the edges. Place puff pastry on a parchment-lined baking sheet and prick the pastry inside the border using a fork to prevent puffing in the center. Bake on top rack until puff pastry is lightly golden, about 20 minutes. Remove from the oven and let cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toss carrots with 1 tablespoon oil, season generously with salt and pepper and spread into a single layer on a baking sheet. Roast carrots on the bottom rack (underneath the puff pastry) until the edges are golden brown and carrots are still crisp-tender, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While puff pastry and carrots are in the oven, blend ricotta, feta and garlic in a food processor until smooth. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the cheese mixture onto the puff pastry up to the border and arrange the carrots in a single layer on top. Bake until the carrots are tender and the edges of the cheese mixture are golden brown, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle with olive oil and sprinkle with herbs before serving."}], "link": "https://cooking.nytimes.com/recipes/1020174-carrot-tart-with-ricotta-and-feta"}