{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Stroganoff", "description": "Forget what you think you remember about this putatively Russian dish, which saw its zenith in American kitchens during the 1950s and its nadir in school cafeterias two decades later. Beef stroganoff makes for an outstanding dinner: a vat of tender sautéed meat in a silken gravy studded with caramelized mushrooms, alongside a huge tangle of buttered noodles. Be careful when adding the cream at the end: Sour cream easily curdles in the heat, while crème fraîche or heavy cream offer smoother results.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2020/02/16/magazine/16mag-eat/16mag-eat-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, meat, noodles", "keywords": "beef, beef tenderloin, button mushrooms, egg noodles, parsley, worcestershire sauce, fall, winter, main course, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 770}, "recipeIngredient": ["Kosher salt and freshly ground black pepper", "1 1/2 pounds sirloin roast, or beef tenderloin, if you’re feeling fancy", "2 tablespoons all-purpose flour", "1 1/2 teaspoons hot paprika", "1 tablespoon neutral oil, such as canola or grapeseed", "4 tablespoons unsalted butter", "1/2 pound button mushrooms, cleaned and cut into quarters", "2 small shallots, thinly sliced", "12 ounces wide egg noodles", "1/4 cup dry white wine", "1 cup heavy cream or crème fraîche", "1 1/2 teaspoons Worcestershire sauce", "1 1/2 teaspoons Dijon mustard", "Chopped fresh parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the beef against the grain into 1/2-inch slices, pound lightly, then cut those slices into 1-inch-wide strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour, paprika, 1 1/2 teaspoons salt and 1 1/2 teaspoons pepper to a large shallow bowl and toss to combine. Dredge the strips of meat in the flour mixture, shake them to remove excess flour, then transfer them to a rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large skillet over high heat and swirl in the oil. When the oil begins to shimmer, sauté the beef slices, in two batches, until they are well browned on both sides but rare inside, 3 to 4 minutes per batch. Transfer the seared meat to the baking sheet. Turn the heat down slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 tablespoon of the butter to the pan. When it has melted and started to foam, add the mushrooms, toss to coat them with the fat, and season with salt and pepper. Cook, stirring frequently, until the mushrooms have released their moisture and are a deep, dark brown, 12 to 15 minutes. About halfway into the process, add the sliced shallots and 1 tablespoon butter and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the mushrooms cook, add the noodles to the boiling water, and cook until just done, about 10 minutes. Drain the noodles, and toss with the remaining 2 tablespoons butter. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the mushrooms and shallots are soft and caramelized, deglaze the pan with the wine, scraping at all the stuck-on bits on the pan’s surface. When the wine has reduced by about half, slowly stir in the cream, followed by the Worcestershire and mustard. Add the meat, along with any accumulated juices, and stir to combine. Cook, stirring occasionally, until the dish is hot and the beef is medium-rare, 2 to 3 minutes. Taste, and adjust the seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the noodles under or alongside the stroganoff; sprinkle stroganoff with parsley."}], "link": "https://cooking.nytimes.com/recipes/1020862-beef-stroganoff"}