{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Sausages With Grapes and Onions", "description": "You can use any kind of sausages in this cozy, autumnal dish, filled with roasted sweet grapes and vinegar-spiked onions. Spicy Italian sausages made from pork, chicken or turkey, fresh chorizo or merguez, will give the dish a kick, while milder sausages like chicken and apple, bratwurst or Weisswurst make for a gentler meal. Serve this on a bed of polenta or mashed potatoes, or with some crusty bread to sop up the vinegary, sausage-rich pan juices, and a green salad on the side. If you want to halve this recipe, reduce the oven temperature to 425 degrees; otherwise the smaller amount of food in the pan might get too brown.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/10/23/dining/18apperex/18apperex-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, weekday, sausages", "keywords": "fall, fennel seeds, grapes, parsley, sausage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 717}, "recipeIngredient": ["1 large Spanish onion, thinly sliced", "4 tablespoons extra-virgin olive oil", "1/2 teaspoon fine sea salt, plus more to taste", "1/2 teaspoon freshly ground black pepper", "4 cups seedless red grapes (1 1/4 pounds), destemmed", "1 teaspoon fennel, coriander, cumin or caraway seeds, lightly crushed", "1 pound any sausages, poked all over with a fork", "1/2 cup parsley, coarsely chopped", "2 tablespoons chopped chives", "2 teaspoons rice vinegar or sherry vinegar, plus more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. On a large (13-by-18-inch) rimmed baking sheet, toss together onion slices, 2 tablespoons oil, salt and pepper, and spread in an even layer. Roast for 8 to 12 minutes, until the onions turn translucent and the thinnest pieces take on a pale gold color at the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 10 minutes, add grapes, seeds and the remaining 2 tablespoons oil to pan with onions, and toss well. Spread in an even layer and nestle sausage into the mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until sausage has browned, 25 to 30 minutes, flipping sausage and tossing grapes and onions halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer sausages to a platter or to individual plates. Add parsley and chives to pan with grapes and onions and gently toss (this warms up and wilts the herbs). Use a slotted spoon to transfer grapes and onions to plates with the sausages."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add vinegar to rimmed baking sheet and scrape up any browned bits on the tray. Drizzle pan juices over the grapes and sausages, taste, and sprinkle more salt or vinegar on top, if desired."}], "link": "https://cooking.nytimes.com/recipes/1020536-roasted-sausages-with-grapes-and-onions"}