{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Honey-Soy Braised Pork With Lime and Ginger", "description": "Here to save your weeknight life: a slow-cooker main that’s truly “set-it-and-forget-it,” with results that taste like they required significantly more effort. This rich and flavorful pork takes about 5 minutes to throw together in the morning. Before dinner, just simmer the sauce — a sweet-salty mix of soy and honey — until it’s syrupy, shred the meat, add a flurry of fresh herbs and you’re done. The meat is a wonderfully simple anchor, and you can build a meal around it: Add lettuce cups and kimchi or serve it over rice, whole grains or even tortillas.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2020/03/04/dining/sdg-soy-honey-braised-pork/merlin_170016639_cd25e8e8-0597-42f4-9504-c0fe53fd41b2-articleLarge.jpg", "totalTime": "PT8H20M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, meat, roasts", "keywords": "dairy-free, garlic, ginger, honey, lime, pork, red pepper flakes, sesame oil, tamari, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 318}, "recipeIngredient": ["3 to 4 pounds boneless, skinless pork shoulder, trimmed of big hunks of fat and cut in half", "8 large garlic cloves, finely chopped", "3 tablespoons minced fresh ginger (from one 3-inch piece)", "1 teaspoon red-pepper flakes, plus more to taste", "2 teaspoons finely grated lime zest and 2 tablespoons juice (from 1 lime), plus more lime wedges for serving", "1 cup tamari or low-sodium soy sauce (see Tip)", "1 cup honey", "1 tablespoon toasted sesame oil", "Cooked rice, noodles or lettuce cups, for serving", "Toasted sesame seeds, sliced scallions and chopped cilantro, for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pork in a 6- to 8-quart slow cooker. Scatter the garlic, ginger, red-pepper flakes and lime zest over the top. In a liquid measuring cup, whisk together the tamari, honey and sesame oil, then pour it over the pork. Using tongs, turn to coat all sides of the pork in the sauce, and spoon some over the top so that some of the garlic and ginger is on top of the pork. Cover and cook on low until the pork is very tender and shreds easily with a fork, 8 to 9 hours; it will hold well on warm. (If you are home and able to flip the pork once during cooking, that will help the flavors distribute evenly on the meat and make the color uniform. If not, it will be fine.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, transfer the pork from the slow cooker to a serving platter or large, shallow serving bowl. Using a ladle, skim excess fat off the surface of the cooking liquid, if desired. Carefully pour the sauce into a large pot. Bring the sauce to a boil over medium-high heat and let it simmer until reduced and slightly syrupy, 15 to 20 minutes. Meanwhile, coarsely shred the pork using two forks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the lime juice over the top of the meat. Drizzle about half the sauce over the top of the shredded meat, tossing to evenly combine. Serve over rice or noodles or in lettuce cups. Top with sesame seeds, scallions and cilantro. Pass the remaining sauce at the table, if desired, as well as extra lime wedges and red-pepper flakes."}]}