{"@context": "http://schema.org", "@type": "Recipe", "name": "Endive Salad With Egg and Anchovy", "description": "For a cool-weather salad, pale green Belgian endive dressed with an assertive anchovy vinaigrette is a refreshing beginning to a meal — or a nice light lunch. For more color, try adding other endive relatives: the red-leafed variety, frisée, different types of radicchio or speckled Castelfranco chicory. All of these winter salad greens have sweetness and a pleasant hint of bitterness. Belgian endive is the mildest of the bunch. As for anchovies, look for good fat meaty ones. Rinse and blot, then coat with a little good extra-virgin olive oil.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/02/05/dining/03Tanisrex-salad/merlin_167974515_1fb1fa58-3ad0-42e3-9b84-1878cd30b449-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "lunch, salads and dressings", "keywords": "anchovy, endive, lemon, radicchio, main course, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 69}, "recipeIngredient": ["2 garlic cloves", "10 to 12 anchovy fillets, rinsed and blotted", "2 tablespoons lemon juice, plus more to taste", "1/2 teaspoon lemon zest", "2 tablespoons Dijon mustard", "Salt and pepper", "1/2 cup extra-virgin olive oil", "6 to 8 large Belgian endives", "A few handfuls of radicchio leaves or other brightly colored chicories (optional)", "6 to 8 large medium-boiled eggs, cooled and peeled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the vinaigrette: Pound together (or hand chop) garlic and 4 anchovy fillets to make a rough paste. Transfer mixture to a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 tablespoons lemon juice, zest and Dijon mustard and stir well. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in olive oil. Taste and adjust lemon juice, salt and pepper. Just before preparing salad, taste vinaigrette again and adjust seasoning as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the bottoms off of endives and discard any withered outer leaves. Separate the leaves and pile them in a large salad bowl. (Cut the hearts in half or quarters lengthwise.) Add the radicchio, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, sprinkle leaves lightly with salt and pepper, and drizzle with 2 tablespoons vinaigrette. Toss gently, then distribute among six to eight plates. Garnish each plate with an egg cut in half or into quarters, and an anchovy fillet, then drizzle plates with remaining dressing."}], "link": "https://cooking.nytimes.com/recipes/1020834-endive-salad-with-egg-and-anchovy"}