{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Spiced Mushroom and Apricot Pilaf", "description": "This pilaf scores all the points for being both gluten-free and vegan (provided you use vegetable stock), and for being robust enough for no one to notice. Star anise and cinnamon make this a warming (and winning) combination for a festive Thanksgiving spread, complementing roast turkey and just about any dish that finds its way to your table. It also serves well as a stand-alone main, with some lightly cooked greens to go alongside. Feel free to swap out the fresh mushrooms for whatever foraged finds you can get your hands on, just make sure to break them up into large chunks, keeping intact their natural “meatiness.”", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2019/11/20/dining/15ottorex1/15ottorex1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 main or 6 side servings", "recipeCuisine": "", "recipeCategory": "dinner, grains and rice, vegetables", "keywords": "ancho chili, apricot, basmati rice, dried porcini mushrooms, oyster mushroom, portobello, scallion, fall, winter, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 170}, "recipeIngredient": ["1 to 2 ancho chiles, stems discarded", "1 ounce/30 grams dried porcini mushrooms", "2 cups/480 milliliters chicken or vegetable stock", "Kosher salt and freshly ground black pepper", "1 pound/450 grams oyster mushrooms, roughly torn into separate stems", "5 large portobello mushrooms, stems discarded, each cap roughly broken up into 6 chunks", "1 large yellow onion, peeled, halved and cut into 1/4-inch/1/2-centimeter-thick slices", "5 ounces/140 grams dried apricots (the plump orange kind), quartered", "10 garlic cloves, peeled", "3 cinnamon sticks", "4 whole star anise", "1/2 cup plus 2 tablespoons/150 milliliters olive oil", "1 3/4 cups/340 grams basmati rice, washed until water runs clear, then drained well", "3 scallions, trimmed, then thinly sliced at an angle", "1/4 cup/5 grams loosely packed parsley leaves, picked with some of the stem attached"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a small pot of water to a boil and heat the oven to 450 degrees Fahrenheit/230 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the ancho chile to a heatproof bowl and pour over enough boiling water to cover. Let sit to rehydrate, about 20 minutes, then discard the soaking liquid and roughly chop the chile, seeds and all."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dried porcini mushrooms to a medium saucepan and add the stock, 1 1/2 cups/360 milliliters water, 1 1/4 teaspoons salt and a good grind of pepper. Bring to a simmer over medium-high heat, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the oyster and portobello mushrooms, onion, apricots, garlic, cinnamon, star anise, chopped ancho chile, 1/2 cup/120 milliliters oil, 1 teaspoon of salt and a good grind of pepper to a roasting pan (tin) that is about 10-by-13 inches/26-by-34 centimeters. Give everything a good stir, then bake until the vegetables are soft and well browned, 40 to 45 minutes, stirring halfway through. Remove from the oven, transfer half the mixture to a medium bowl, then arrange the remaining mushrooms in an even layer in the pan. Sprinkle the rice evenly on top of the mushrooms in the pan, without stirring, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the porcini mixture back up to a simmer over medium-high heat. Pour the porcini mixture over the rice, again without stirring, and cover the roasting pan tightly with foil. Return to the oven and bake until the rice is cooked through and has started to brown on the bottom of the pan, and the apricots begin to caramelize, about 25 minutes. Remove from heat and let sit, covered, for 10 minutes. Remove the foil and gently stir everything together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the scallions, parsley and the remaining 2 tablespoons/30 milliliters oil to the bowl with the reserved mushroom mixture; stir to combine. Spoon this over the rice mixture and serve."}], "link": "https://cooking.nytimes.com/recipes/1020568-sweet-spiced-mushroom-and-apricot-pilaf"}