{"@context": "http://schema.org", "@type": "Recipe", "name": "Hot and Sour Dumpling Soup", "description": "A Chinese take-out staple, hot and sour soup is super easy to create at home — and comes together in just 15 minutes. This weeknight version bolsters the traditional mushrooms and tofu with the addition of store-bought pork dumplings, but you could just as easily use chicken or vegetable dumplings, depending on your preference. Cornstarch gives the broth its velvety texture, vinegar adds verve, and white pepper adds subtle complexity, though black pepper is a perfectly fine substitute. Adjust the seasoning with extra soy sauce, ginger and vinegar for a more assertive soup.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2019/03/19/dining/kc-hot-sour-soup/kc-hot-sour-soup-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "american, chinese", "recipeCategory": "dinner, easy, quick, weeknight, dumplings, soups and stews", "keywords": "bamboo shoots, shiitake, tofu, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 392}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 392, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "3 grams", "proteinContent": "29 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1626 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons safflower or canola oil", "8 ounces fresh shiitake mushrooms, stemmed and thinly sliced (about 3 cups)", "2 tablespoons minced fresh ginger", "Kosher salt and pepper", "8 cups low-sodium chicken broth", "6 ounces firm tofu, cut into matchsticks (1 cup)", "1/3 cup low-sodium soy sauce", "2 ounces drained canned, sliced bamboo shoots, cut into matchsticks (1/3 cup)", "1/4 teaspoon ground white pepper (optional), plus more to taste", "12 frozen pork gyoza or potsticker dumplings (about 8 ounces)", "1/4 cup cornstarch", "3 tablespoons distilled white vinegar", "Thinly sliced scallions and fresh chiles (such as red Fresno or jalapeño), for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan, heat oil over medium. Add mushrooms and ginger and season with salt and pepper. Cook until softened, stirring occasionally, about 3 minutes. Stir in broth, tofu, soy sauce, bamboo shoots and white pepper, if using, and bring to a boil over high. Add dumplings and simmer over medium heat until dumplings are cooked through, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk cornstarch with 1/4 cup water to form a slurry. Add slurry and vinegar to saucepan and simmer until slightly thickened, about 2 minutes. Season with salt and more white pepper, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide soup among bowls and garnish with scallions and chiles. Serve hot."}]}