{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Zucchini, Feta and Fried Lemon", "description": "This is a less saucy, more pasta-salad-like pasta, which is to say it’s best served at room temperature after being carted to an outdoor location and eaten directly from the container. The zucchini mixture should be deeply flavorful and concentrated, rather than loose or watery. If you’re looking for something saucier, add more olive oil (not pasta water) as needed to coat each piece of pasta before serving.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/07/31/dining/29Romanrex/merlin_156253686_8ff38242-8ab1-41e5-b497-1005ebea1a0a-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, pastas", "keywords": "feta, pasta, walnut, zucchini, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 945}, "recipeIngredient": ["8 ounces pasta, such as spaghetti or bucatini", "Kosher salt", "1/4 cup olive oil, plus more for drizzling", "1/2 cup walnut pieces (optional)", "2 large shallots, 1 medium onion or 1 large leek (white and light green parts), thinly sliced", "1 lemon, thinly sliced, seeds removed", "Freshly ground black pepper", "2 tablespoons capers", "1 1/4 pounds zucchini (about 2 medium), thinly sliced", "2 ounces feta, crumbled (about 3/4 cup)", "1 cup parsley or dill leaves, or a mix, coarsely chopped", "2 tablespoons fresh oregano leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook pasta in a large pot of salted boiling water until al dente. Drain and rinse pasta with cool water to stop cooking and toss with a drizzle of olive oil to prevent sticking; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1/4 cup olive oil in a large skillet over medium-high heat. Add walnuts, if using, and toss to coat. Cook, stirring occasionally, until walnuts are toasted and golden brown, 3 to 4 minutes. Using a slotted spoon or strainer, transfer the walnuts to a small bowl (leaving the oil behind) and season with salt; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add shallots and lemon to the oil and season with salt and pepper. Cook, stirring occasionally, until both the shallots and lemons are totally softened and have begun to caramelize, 5 to 8 minutes. Add capers and stir to coat in the oil, letting them sizzle a minute or two."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add zucchini and season with salt and pepper. (Do not be alarmed at the amount of zucchini in the skillet; it will cook down by about half.) Cook, stirring occasionally, until much of the water has evaporated from the zucchini and it has totally softened, become translucent and is beginning to brown at the edges, 10 to 15 minutes. (This mixture should be very flavorful and lightly saucy.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from heat and add pasta, tossing to coat. (If your skillet is very full, you can always transfer everything to a large bowl and toss to coat there.) Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pasta to a large serving bowl and top with toasted walnuts, feta and herbs, finishing with a drizzle of olive oil."}], "link": "https://cooking.nytimes.com/recipes/1020370-pasta-with-zucchini-feta-and-fried-lemon"}