{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Chicken Soup With Lemon and Rice", "description": "Lightly thickened with egg yolks and sour cream, this comforting soup is both deeply satisfying and springy-bright. Choose the amount of lemon juice that’s right for you: Using a half cup makes an assertively tart soup, while the smaller amount gives a gentler result. This soup is a really excellent way to use up leftover rice. Any kind of cooked rice will work, though white jasmine and basmati are particularly nice. Finish the soup with a big hit of dill for freshness, but other soft, fresh herbs of your choice would also be welcome.\n<em>Find the slow-cooker version of the recipe <a href=\"https://cooking.nytimes.com/recipes/1019699-slow-cooker-creamy-chicken-soup-with-lemon-rice-and-dill?action=click&module=RecipeBox&pgType=recipebox-page&region=all&rank=16\">here</a>. </em>", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/03/29/dining/sd-pressure-cooker-chicken-and-rice-soup/merlin_146005377_b8ba76cc-d93f-4603-943d-69cc3a7516e9-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, soups and stews", "keywords": "chicken broth, chicken thighs, dill, lemon, rice, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 123}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 514, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "1 gram", "proteinContent": "44 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1293 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons unsalted butter", "1 large yellow or red onion, chopped", "Kosher salt and black pepper", "6 large garlic cloves, minced", "2 to 2 1/2 pounds boneless, skinless chicken thighs", "6 cups chicken broth or stock", "1 bay leaf", "2 cups cooked white rice", "5 large egg yolks", "1/2 cup sour cream", "1/3 to 1/2 cup fresh lemon juice (from about 2 large lemons), plus more as needed", "1 bunch dill, chopped (about 1 loosely packed cup)", "3 scallions, thinly sliced (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a 6- to 8-quart pressure cooker on the sauté setting. Add the onion, season with salt and cook, stirring often, until softened and translucent, about 5 minutes. Add the garlic and cook, stirring, until fragrant and softened, about 1 minute. Add the chicken thighs, season with salt, then add the chicken broth and bay leaf. Season very generously with pepper. Add 1/2 teaspoon salt if you are using low-sodium broth or 1 teaspoon salt if using homemade unsalted stock. (Do not add more salt now if you are using fully salted broth.) Cook on high pressure for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the pressure to release naturally for 10 minutes, then release the remaining pressure manually. (If hot liquid spurts out with the steam, close the knob and let it release naturally for 5 more minutes.) With a ladle, skim and discard excess fat from the top of the soup, if you wish. Using two forks, coarsely shred the chicken. (Don’t worry about getting every piece because the chicken will fall apart more when you whisk to thicken.) Add the rice and turn on the sauté setting. Whisk the egg yolks, sour cream and lemon juice in a medium bowl until creamy and combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip a large measuring cup into the hot broth. While whisking constantly, very slowly drizzle about 2 cups broth into the lemon juice mixture until fully combined and smooth. Pour this mixture into the pressure cooker and let the soup simmer, whisking, until slightly thickened and the rice is warmed through, about 5 minutes. Stir in the dill and season to taste with lemon juice, salt and pepper. Serve in bowls with scallions sprinkled on top, if using."}]}