{"@context": "http://schema.org", "@type": "Recipe", "name": "Bacon-Barbecued Brisket Flat", "description": "Packer brisket is what you order at a barbecue restaurant. The brisket flat (the leaner, flatter of the two muscles that comprise a whole brisket) is what you’re more likely to find at the supermarket. Lacking the generous marbling of a packer, the flat tends to toughen and dry out during a long slow cook on your grill or smoker. But two simple techniques deliver a moist, tender brisket flat every time. The first is to cook the flat in a foil pan to shield the lean meat from the heat. The second is to drape the brisket flat with a layer of bacon, which renders its fat during cooking, basting the meat and keeping it moist. Then there’s the bonus: You get to eat barbecued bacon along with your brisket.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2019/05/29/dining/24brisketrex1/24brisketrex1-articleLarge.jpg", "totalTime": "PT8H", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "barbecues, meat, project", "keywords": "bacon, brisket, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 29}, "recipeIngredient": ["1 (4- to 5-pound) brisket flat with at least a 1/4-inch layer of fat on top", "Coarse sea salt", "Cracked or freshly ground pepper", "Red-pepper flakes (optional)", "12 thick-cut bacon slices (about 12 ounces)", "Sliced white bread or brioche buns, for serving", "Barbecue sauce (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the brisket in a 9-by-13-inch disposable aluminum foil drip pan and generously season the top, bottom and sides of the brisket with salt, pepper and, if you like your brisket spicy, red-pepper flakes. Set the brisket with the lean side up. (The lean side is the flatter, less fatty side.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light your grill, smoker or cooker (such as a Big Green Egg) and heat it to 250 degrees. If using a kettle grill, start with less charcoal than you would for grilling a steak: A third to a half chimney starter will do it. If using a smoker, place a large heat-proof bowl of water in the smoke chamber. (This is optional, but it creates a humid environment that will keep your brisket moist and help the smoke adhere to the meat.) Add wood as specified by the manufacturer to generate smoke. If using a kamado-style cooker, set up a top-down burn: Load the fire box with lump charcoal, interspersing it with wood chunks or chips. Light 3 or 4 coals on top in the center; gradually, they’ll burn down, igniting the coals and wood beneath them.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the brisket in its pan to the smoker and smoke for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, flip the brisket so the fat side is on top. Neatly drape the top of the brisket with half the bacon slices. Cook the brisket until the bacon is deeply browned, about 3 hours. Refuel your cooker as necessary, adding wood as needed to generate a steady stream of smoke. Remove the browned bacon slices (and feel free to snack on them as a reward for your patience). Shingle the remaining uncooked bacon slices over the top of the brisket, overlapping them slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue cooking the brisket until the bacon and top of the brisket are deeply browned and the internal temperature registers 200 to 205 degrees on an instant-read thermometer, another 3 to 4 hours. There should be a nice pool of bacon and brisket fat in the bottom of the pan. Refuel your cooker as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "You can eat the brisket immediately, but it will be moister and more tender if you let it rest in the drip pan, covered with foil, in an insulated cooler for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, transfer the brisket to a cutting board. Cut across the grain into 1/4-inch slices, or as thickly or thinly as you desire, slicing the bacon along with it (or serving it on the side). Spoon any juices from the cutting board over the brisket, along with any pan drippings, to taste. Form sandwiches with bread or serve it on the side. Here, too, barbecue sauce is optional, but if you serve it, try the meat by itself first to appreciate the interplay of smoke and spice."}], "link": "https://cooking.nytimes.com/recipes/1020183-bacon-barbecued-brisket-flat"}