{"@context": "http://schema.org", "@type": "Recipe", "name": "Mission Burrito", "description": "To find the best burritos in San Francisco, you have to go to the Mission District, a historic Latin American neighborhood known for its vibrant culture and food. There are many places there to get a good burrito, but La Taqueria, which won a James Beard Award in 2017, is a favorite. Miguel Jara, who emigrated to the United States from Mexico, opened the restaurant in 1973 because he missed the cuisine of his home country. Mission burritos are known for their giant size (about eight inches long), and are packed with a hearty serving of meat, beans, salsa verde, pico de gallo, cheese, avocado and sour cream. Most Mission burritos include rice as well, but Mr. Jara believes it takes away from the flavors of the meat. No garnish is necessary, but the aluminum foil wrapper is required: No real Mission burrito is served without it.", "author": {"@type": "Person", "name": "Kiera Wright-Ruiz"}, "image": "https://static01.nyt.com/images/2019/10/07/dining/kwr-mission-burrito/kwr-mission-burrito-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 burritos", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, burritos and nachos, meat, steaks and chops", "keywords": "beer, monterey jack cheese, pinto beans, steak, tortilla, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 166}, "recipeIngredient": ["1 pound top sirloin steak", "1 (12-ounce) can Tecate beer", "Kosher salt", "5 tablespoons pork lard or 3 tablespoons neutral oil (such as canola or vegetable oil), plus more for searing the burritos, if desired", "3 tablespoons pork lard (optional)", "1 (15-ounce) can pinto beans, drained (about 1 1/3 cups beans)", "Kosher salt", "4 burrito-size (9- to 10-inch) flour tortillas", "1 cup shredded Monterey Jack cheese", "1 cup finely chopped homemade or store-bought pico de gallo", "1/4 cup salsa verde", "1/2 cup sour cream", "1 avocado, mashed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut steak in half crosswise. Place both pieces in a resealable plastic bag, squeeze out excess air from the bag and seal. Using a meat mallet, heavy frying pan or rolling pin, pound meat until about 1/4-inch thick. Make sure there are no holes in the bag, then pour the beer into it. Let the steak marinate for 10 to 15 minutes. Remove steak from bag, discarding marinade, and pat steak dry using a paper towel. Season steak on both sides with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the beans: In a small pot over low heat, combine the lard, if using, and pinto beans. (If you’re not using lard, add a few tablespoons of water to keep the beans from sticking to the pot.) Cover and cook for about 10 minutes, stirring occasionally, until warmed through. Remove from heat, season to taste with salt and keep covered until ready to assemble burritos."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the steak: Heat 5 tablespoons lard or 3 tablespoons oil in a large skillet over high. Working in two batches to avoid crowding the pan, cook each steak until browned, 1 to 2 minutes per side. Remove from heat, and let it rest for 5 to 10 minutes. Once slightly cooled, chop steak into bite-size pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the burritos: Working with one tortilla at a time, sprinkle 1/4 cup cheese in a strip (running parallel to you) across the middle of the tortilla, leaving a 1-inch edge on the left and right sides so the fillings don't spill out when you roll it. Top with 1/3 cup beans and 1/2 cup chopped steak. Top with 1/4 cup pico de gallo, 1 tablespoon salsa verde and 2 tablespoons sour cream. Using a spoon, smear a quarter of the mashed avocado on one side of the fillings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To wrap the burritos, fold the short left and right edges in towards the filling. Keeping the sides folded, fold the bottom of the tortilla up and over the filling. Tightly roll away from you until the entire burrito is secure."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’d like to crisp the outside of the burritos, heat 2 tablespoons of lard or oil in a large skillet over medium-high. Place the burrito in the skillet and cook each side until golden brown, 2 to 3 minutes. Tightly wrap a piece of aluminum foil around each burrito, and serve warm."}]}