{"@context": "http://schema.org", "@type": "Recipe", "name": "Black-and-White Sundae Bar", "description": "This is less a recipe for a sundae bar, and more a recipe for for the two sauces that accompany, crunchy bittersweet chocolate (essentially a homemade chocolate shell) and salty tahini caramel. Both can be made and stored for at least a month (for whenever the craving strikes). It’s hard to beat the creamy subtlety of vanilla ice cream to pair with them, but any ice cream of your choosing will work.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2020/04/01/dining/30Roman9/merlin_170266308_be38cf69-b674-4691-aa8e-55ec4a010542-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets, sauces and gravies", "keywords": "bittersweet chocolate, coconut oil, ice cream, tahini, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 29}, "recipeIngredient": ["8 ounces bittersweet chocolate, 60 to 72 percent, chopped (about 1 cup)", "1 cup coconut oil", "Kosher salt", "1/2 cup granulated sugar", "2/3 cup tahini", "Kosher salt", "2 pints vanilla ice cream", "Halvah, crumbled", "Cocoa nibs, chopped chocolate, toasted sesame seeds", "Flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chocolate sauce: Combine chocolate and coconut oil in a medium bowl, and place over a small pot of barely simmering water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt, stirring occasionally, until no lumps remain and you’ve got an impossibly shiny, chocolaty sauce. (Alternatively, microwave in 30-second increments until the sauce is shiny and no lumps remain.) Season with salt and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tahini caramel: Heat half the sugar in a medium pot over medium. Once the sugar starts to melt and liquefy, gently stir the sugar using a wooden spoon or heatproof spatula until it’s a nice golden-brown color, 2 to 4 minutes. (You want this to happen slowly to prevent risk of burning.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter remaining sugar on top and cook until all the sugar is totally liquified and a dark amber color, like good maple syrup, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly add in 2/3 cup water, taking care not to add it all at once or the sugar will seize. Then, add the tahini, mixing to blend well. Bring the whole thing to as simmer, season with salt and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, pour sauces (both will be spoonable or pourable at room temperature, no need to warm) over scoops of ice cream to suit your wants, needs, desires. Top with any combination of crumbled halvah, cocoa nibs, chopped chocolate, toasted sesame seeds, flaky salt or anything you might want on your ice cream at this moment."}], "link": "https://cooking.nytimes.com/recipes/1020961-black-and-white-sundae-bar"}