{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Pot Barbecue Pork and Beans", "description": "Two beloved barbecue staples are cooked together in one pot (or a <a href=\"https://cooking.nytimes.com/recipes/1020879\">slow cooker</a>) for mutually beneficial results. As the pork shoulder braises, the pork juices flavor the barbecue sauce and the sauce tenderizes the pork. Beans are then added to soak up the deeply concentrated sauce. The recipe uses store-bought barbecue sauce enhanced with the smoky heat of canned chipotles in adobo and brown sugar, which helps glaze the pork. Because every barbecue sauce is different, taste and adjust yours as needed. (To mimic a North Carolina-style sauce, add apple cider vinegar with the beans, or yellow mustard for a South Carolina-style sauce, or even gochujang and soy sauce for a Korean-inspired take.) To serve, slice the pork or shred it into pulled pork. <a href=\"https://cooking.nytimes.com/recipes/9375-cornbread?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=1\">Cornbread</a>, biscuits or Texas toast are great additions.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2020/02/13/dining/as-bbq-pork-and-beans/as-bbq-pork-and-beans-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, barbecues, beans, meat, one pot", "keywords": "barbecue sauce, brown sugar, chipotle, onion, pinto beans, pork shoulder, dairy-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 196}, "recipeIngredient": ["3 to 3 1/2 pounds boneless pork shoulder, trimmed of more than 1/4-inch fat", "Kosher salt and black pepper", "2 tablespoons extra-virgin olive oil", "1 cup store-bought or homemade barbecue sauce", "1 canned chipotle in adobo, finely chopped, plus more to taste", "3 tablespoons light brown sugar, plus more to taste", "1 large yellow onion, peeled and coarsely chopped", "4 garlic cloves, thinly sliced", "2 cups chicken broth or water", "2 (14-ounce) cans pinto beans (not drained)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Season the pork all over with 1 tablespoon salt and 3/4 teaspoon pepper. In a large Dutch oven, heat the olive oil over medium-high. Add the pork shoulder and sear until browned on all sides, 8 to 10 minutes. Spoon out all but 1 or 2 tablespoons of fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl or measuring cup, stir together the barbecue sauce, chipotle and brown sugar. Taste, and add more brown sugar or chipotle, as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion and garlic to the oil in the Dutch oven, season with salt and pepper and stir to coat. Cook over medium-high until the onions are softened, just 1 minute. Spoon the barbecue sauce over the pork, seeking to cover all exposed sides. Pour the chicken broth over the onion and garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and transfer to the oven, basting the pork with the sauce every 30 minutes or so until the pork falls apart when prodded with a fork, 2 1/2 to 3 hours. Open the cans of beans and drain and rinse one of the cans. When the pork is tender, add 1 can of beans and its liquid along with the rinsed beans; stir to combine. Cook, uncovered, in the oven until the pork is glazed and the beans are warmed through, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pork to a cutting board, then season the beans to taste with salt and pepper. Slice the pork against the grain into 1/2-inch-thick slices, or shred the pork with two forks. Serve the pork with the beans right out of the pot."}], "link": "https://cooking.nytimes.com/recipes/1020878-one-pot-barbecue-pork-and-beans"}