{"@context": "http://schema.org", "@type": "Recipe", "name": "Brothy Chicken Soup With Hominy and Poblano", "description": "This vibrant, hearty weeknight chicken soup is reminiscent of <a href=\"https://cooking.nytimes.com/recipes/1016476-pozole?action=click&amp;module=Global%20Search%20Recipe%20Card&amp;pgType=search&amp;rank=1\">pozole</a>, and achieved in record time. It starts with a base of onion and poblano pepper spiced with cumin, coriander and oregano. Broth is added, chicken thighs are simmered, then shredded, and cooked hominy is added for heft (though cooked rice would work equally well). The toppings stray from tradition: Crumbled tortilla chips provide crunch, as do snappy radishes; richness comes in the form of avocado or sour cream. Lay out bowls filled with various garnishes and let guests assemble as they like.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2020/01/16/dining/ch-mexican-chicken-soup/ch-mexican-chicken-soup-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american, mexican", "recipeCategory": "dinner, easy, weeknight, soups and stews", "keywords": "appetizer, main course, chicken, chicken thigh, hominy, poblano chili", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 241}, "recipeIngredient": ["3 tablespoons olive oil", "1 large yellow onion, finely chopped", "1 large poblano chile, deseeded and finely chopped", "3 garlic cloves, finely chopped", "1 teaspoon ground cumin", "1 teaspoon ground coriander", "1/2 teaspoon dried oregano, preferably Mexican oregano", "1/2 teaspoon red-pepper flakes (optional)", "Kosher salt and black pepper", "6 cups homemade or store-bought low-sodium chicken stock", "3/4 pound boneless, skinless chicken thighs", "1 (15-ounce) can hominy, drained and rinsed, or 2 cups cooked rice", "1 lime, quartered, for serving", "Crumbled tortilla chips, thinly sliced radishes, diced avocado, roughly chopped cilantro, thinly sliced scallions or sour cream, for garnishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large stock pot or Dutch oven over medium. Add the onion and poblano and cook, stirring occasionally, until they have softened without taking on any color, 4 to 6 minutes. Add the garlic, cumin, coriander, oregano and red-pepper flakes, if using, and cook, stirring frequently, until the garlic and spices are fragrant, about 1 minute more. Season well with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the stock and chicken and bring to a simmer. Cook until the chicken has cooked through and is no longer pink, 10 to 12 minutes. Using tongs or a slotted spoon, transfer the cooked chicken to a cutting board. When cool enough to handle, shred the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shredded chicken back to the pot along with the hominy and allow everything to simmer together for 5 to 10 minutes more. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle into soup bowls. Serve with limes, for squeezing on top, and bowls of optional garnishes."}], "link": "https://cooking.nytimes.com/recipes/1020795-brothy-chicken-soup-with-hominy-and-poblano"}