{"@context": "http://schema.org", "@type": "Recipe", "name": "Indiana Fried Chicken", "description": "This superb style of fried chicken, found in southeastern Indiana, relies on a heavy use of black pepper. Wagner’s Village Inn, a bar and restaurant in Oldenburg, stays true to the old-school method of skillet-frying in lard, and makes some of the best fried chicken in the area. The use of lard results in a very rich flavor, but canola oil is an acceptable substitute. At Wagner’s, the cooks add two tablespoons of water to the skillet just before removing the fried chicken, believing it “seals in the flavor.” Maybe, maybe not, but it’s a festive finish to this exquisitely simple dish.", "author": {"@type": "Person", "name": "Michael Ruhlman"}, "image": "https://static01.nyt.com/images/2019/06/19/dining/18chicken1/18chicken1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 to 4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, poultry", "keywords": "chicken, lard, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 94}, "recipeIngredient": ["1 4-pound chicken", "1 tablespoon fine table salt, plus more to taste", "2 1/2 to 3 tablespoons coarsely ground black pepper", "3 to 4 cups lard or canola oil", "3 cups flour, for dredging", "4 tablespoons water, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the legs from the chicken at the joint. Separate the drumsticks from the thighs at the joint by placing the leg skin side down and following the line of fat that runs directly above the joint. Remove the wings at the joint. Place the chicken neck side down and separate the back from the breast using a knife or kitchen shears. Cut the breast into quarters. Cut the back in half crosswise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken pieces to a large bowl. Sprinkle evenly with the salt and pepper and toss to coat, rubbing the chicken pieces to make sure the seasoning is uniformly distributed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the lard or oil to a large, deep cast-iron skillet or Dutch oven. You should have about 1 inch of fat, enough that the chicken will be submerged about three-quarters of the way up. Heat over high until the oil reaches 350 degrees, reducing the temperature as needed to medium or medium-high to keep it around 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour to a large bowl and dredge the chicken in the flour until thoroughly coated. Working in 2 batches, carefully lay half the chicken into the hot fat and pan-fry, turning the pieces frequently for even cooking, until the chicken is golden brown and the thighs are cooked through, 10 to 15 minutes per batch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before removing the chicken, turn off the heat. Carefully add 2 tablespoons of water to the fat. (It will boil up immediately. Add the water directly to the fat at a close range in the center of the skillet to minimize splatter; feel free to use a ladle if you don’t want to get too close.) When the water has cooked off and the vigorous bubbling has subsided, transfer the chicken to a paper-towel-lined plate. Turn the heat back on, bringing the oil back to 350 degrees, and fry the remaining batch of chicken, turning off the heat before adding the final 2 tablespoons of water. Transfer chicken to another paper towel-lined plate and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020267-indiana-fried-chicken"}