{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Barbecue Pork and Beans", "description": "Pork and beans are cooked together in a slow cooker for mutually beneficial results (If you don't have a slow cooker, you can do it in <a href=\"https://cooking.nytimes.com/recipes/1020878-one-pot-barbecue-pork-and-beans\">a pot in the oven</a>.) As the pork shoulder and barbecue sauce braise in the oven, the sauce soaks up the pork juices while the pork tenderizes. Then, beans are added to soak up the deeply concentrated sauce. The recipe uses store-bought barbecue sauce enhanced with the smoky heat of canned chipotles in adobo and brown sugar, which helps glaze the pork. Because every barbecue sauce is different, taste and adjust yours as needed. (For a more acidic sauce, add apple cider vinegar with the beans, or you can increase the sweetness with added sugar.) To serve, slice the pork or shred it into pulled pork.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2020/02/14/dining/as-slow-cooker-pork-and-beans/as-slow-cooker-pork-and-beans-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, barbecues, beans, meat, one pot", "keywords": "barbecue sauce, chipotle, chipotles in adobo, garlic, pinto beans, pork shoulder, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 194}, "recipeIngredient": ["3 to 3 1/2 pounds boneless pork shoulder, trimmed of more than 1/4-inch fat", "Kosher salt and black pepper", "1 tablespoon extra-virgin olive oil", "1 cup store-bought or homemade barbecue sauce", "1 chipotle in adobo, finely chopped, plus more to taste", "3 tablespoons light brown sugar, plus more to taste", "2 (14-ounce) cans pinto beans, rinsed", "6 garlic cloves, peeled and thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the pork all over with 1 tablespoon salt and and 3/4 teaspoon pepper. In a large Dutch oven or skillet, heat the olive oil over medium-high. Add the pork shoulder and sear until browned on all sides, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in your slow cooker, stir together the barbecue sauce, chipotle and brown sugar. Taste the mixture and adjust sweetness with brown sugar and spice with chipotle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add browned pork to the barbecue sauce and turn to coat in the sauce. Add the beans and garlic to the sauce around the pork. Cover and cook on low until the meat falls apart when prodded with a fork, 8 to 10 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pork to a cutting board. Skim excess fat from the top if desired, then season the beans to taste with salt and pepper. Slice the pork against the grain into 1/2-inch thick slices, or shred the pork with two forks. Serve the pork with the beans."}]}