{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Double-Garlic Mashed Potatoes", "description": "Roasted garlic is the secret to these deeply flavored mashed potatoes with a lively crunch from garlic chips. This dish takes a little more planning and prep than your average mashed potatoes, but it is well worth the effort. You can roast and fry the garlic and peel the potatoes ahead of time, storing the prepared potatoes submerged in water in the refrigerator for up to 12 hours before cooking. Feel free to use either red or russet potatoes here: Red potatoes will make a thick and creamy mash, while russets will yield a lighter and fluffier result (see Tip). If you run short on time, trim the garlic chips from your to-do list. Canned fried onions from your local supermarket, or fried shallots or fried garlic flakes from most Asian markets provide the same jolt of texture on top.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/10/29/dining/aw-double-garlic-mashed-potatoes/merlin_163202121_9bfca02b-dd1f-4610-91f8-d585c19b8803-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "8 to 12 servings (8 cups)", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "bay leaves, butter, garlic, heavy cream, potato, rosemary, thyme, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 193}, "recipeIngredient": ["3 heads garlic", "6 teaspoons olive oil", "1 cup neutral oil, such as canola or vegetable oil", "6 garlic cloves, thinly sliced crosswise", "Kosher salt", "4 pounds red or russet potatoes (see Tip)", "2 cups heavy cream", "2 fresh bay leaves, or 4 dried bay leaves", "1 tablespoon minced fresh rosemary, plus more for garnish", "1 tablespoon fresh thyme leaves, plus more for garnish", "Kosher salt and black pepper", "3/4 cup unsalted butter (1 1/2 sticks), cut into small cubes, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil over high. Heat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the roasted garlic: Set each head of garlic on its side and cut off (and discard) the top 1/4 portion at the pointed end. Transfer each head of garlic to a separate piece of aluminum foil, cut-side up, and drizzle each head with 2 teaspoons oil. Pull up the surrounding aluminum foil and crimp tightly to seal. Transfer to the oven and roast until the garlic is softened and caramelized, 40 minutes to 1 hour, depending on the size of the heads. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the garlic chips: Line a plate with paper towels. In a small shallow saucepan or frying pan, heat the canola oil over medium-high until shimmering. Working in batches, fry the sliced garlic, stirring often, until just starting to turn golden, 30 seconds to 1 minute. (They’ll continue to darken from the residual heat, so you’ll want to remove them from the hot oil before they’re fully golden brown.) Transfer garlic chips to the plate using a slotted spoon. Season with salt and repeat with remaining sliced garlic. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the boiled potatoes: Fill a large pot with water and season generously with salt. Bring to a boil over high heat. Fill a medium bowl about three-quarters full with water. Working with one potato at a time, peel each potato, then add it to the bowl of water. Next, working with one potato at a time, dice each into 1-inch pieces, returning each to the bowl of water after chopping. Drain the diced potatoes, then carefully add them to the pot of boiling water. Return the water to a boil, reduce the heat to medium-high and cook until potatoes are soft and can easily be pierced with a fork, 13 to 15 minutes. Transfer to a colander to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the herbed cream: Add the cream, bay leaves, rosemary and thyme to a medium saucepan and bring to a boil over medium-high, about 5 minutes. (The mixture will bubble up vigorously, which helps reduce the liquid and concentrate the flavor.) Strain the mixture, discarding the solids, and rinse out the saucepan. Return the infused cream to the saucepan and season with salt and pepper. Cover and set aside. (You should have about 1 1/3 cups.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the cooked potatoes to the pot along with the herbed cream and cubed butter. Squeeze the roasted garlic cloves from two heads into the potato mixture, discarding the skins, and mash until creamy. Season to taste with salt and pepper, and add more roasted garlic, if desired. (Store leftover roasted garlic in the refrigerator for 1 week.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer mashed potatoes to a serving bowl, dot with a generous pat of butter and sprinkle with rosemary, thyme and black pepper. Top with garlic chips, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020572-creamy-double-garlic-mashed-potatoes"}