{"@context": "http://schema.org", "@type": "Recipe", "name": "Cha Yen (Thai Iced Tea)", "description": "This homemade Thai iced tea gets its complex flavor from black tea, rooibos tea, star anise and cloves, and its sweetness from condensed milk. Adapted from the cookbook “Bangkok” by Leela Punyaratabandhu, this version is hardly typical: Most Thai iced tea sold on the streets of Bangkok — or in Thai restaurants stateside — contains an immoderate amount of sweetened condensed milk and uses a store-bought mix, which contains food coloring. The tea blend used here is intense on its own, but mellowed by ice and milk. Chill the tea fully before pouring it over ice so its flavors don’t get diluted.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/08/14/dining/aw-thai-iced-tea/aw-thai-iced-tea-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "non-alcoholic drinks", "keywords": "anise, cloves, condensed milk, half and half, sugar, tea, vanilla", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 178}, "recipeIngredient": ["4 tablespoons loose red rooibos tea leaves (or the contents of 10 rooibos tea bags)", "3 tablespoons loose black tea leaves (or the contents of 7 black tea bags)", "3 tablespoons granulated sugar", "10 star anise pods, broken into pieces or roughly chopped", "10 whole cloves", "1/2 cup half-and-half", "1/2 cup sweetened condensed milk", "1 tablespoon vanilla extract", "Ice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 4 cups water to a medium saucepan. Cover with a lid and bring to a boil. Remove from the heat. Add rooibos tea, black tea, sugar, star anise and cloves; cover and let steep, 10 minutes. Strain tea, pressing on tea leaves and spices to extract as much liquid as possible, then discarding solids. Refrigerate tea until chilled, at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a measuring glass, stir together the half-and-half, condensed milk and vanilla extract."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a pint glass with ice. Add 3/4 cup tea mixture and top with about 2½ tablespoons condensed milk mixture. Serve immediately."}]}