{"@context": "http://schema.org", "@type": "Recipe", "name": "Stone Fruit and Frangipane Toast", "description": "Juicy, late-summer fruits and rich almond frangipane do the hard work here. Consider making these toasts an exercise in generosity rather than technique: Spread frangipane thickly and all the way to the edges of the toast and err on the side of too much fruit, torn roughly and tossed with a pinch of salt, and some sugar to encourage caramelization. If serving this for an after-dinner dessert, add a splash of red wine to the fruit and serve with a dollop of mascarpone. If this is breakfast, you might prefer Greek yogurt as an accompaniment, or a glug of heavy cream.", "author": {"@type": "Person", "name": "Clare de Boer"}, "image": "https://static01.nyt.com/images/2019/08/28/dining/27Diaryrex2/merlin_159057141_bd849ea9-5396-4b5c-964c-36355dabb3d0-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "snack", "keywords": "almond flour, greek yogurt, peach, sourdough, stone fruit, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 63}, "recipeIngredient": ["1/2 cup/115 grams unsalted butter (1 stick), softened", "1/2 cup/100 grams granulated sugar, plus 1 tablespoon and 4 teaspoons", "2 egg yolks", "3/4 cup plus 1 tablespoon/90 grams almond flour", "Flaky sea salt", "4 slices sourdough bread (each about 1/2-inch thick), from the middle of a large loaf", "2 pounds ripe peaches, plums, apricots or other stone fruits", "Confectioners’ sugar, for garnish", "Heavy cream, whipped cream or Greek yogurt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. In the work bowl of a stand mixer fitted with the paddle attachment, cream 7 tablespoons butter and 1/2 cup granulated sugar on medium speed until pale and creamy, then add each egg yolk one by one, mixing between additions to emulsify. And almond flour and a pinch of salt and mix to combine, scraping the bottom of the bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the remaining 1 tablespoon butter on one side of the bread slices. Sprinkle with 2 teaspoons granulated sugar. Transfer to a baking sheet, buttered side down. Divide frangipane mixture among slices, spreading to coat the top of each slice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working over a bowl, tear the stone fruits off their pits into large bite-size pieces, dropping the fruit into the bowl as you go. Add 1 tablespoon granulated sugar and a pinch of salt and toss to coat. Pile the fruit onto the bread, some pieces facing up, some facing down, and gently press the fruit to adhere to the frangipane mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the fruit with the remaining 2 teaspoons granulated sugar, pour any juices left in the bowl over the fruit, then bake until fruit is tender and juicy, the bottom of the bread is deep brown, and the edges of the toast are crisp, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil the toasts until browned in spots, watching carefully so the fruit doesn’t burn, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top with confectioners’ sugar and serve with heavy cream, whipped cream, or yogurt, if you are virtuous!"}]}