{"@context": "http://schema.org", "@type": "Recipe", "name": "Glazed Cod With Bok Choy, Ginger and Oyster Sauce", "description": "This quick one-skillet meal gets a boost of flavor from oyster sauce, a salty-sweet condiment made from concentrated oyster juice and soy sauce that’s often used in Chinese cooking. Here, it melds with garlic, ginger and butter to create a velvety glaze for cod fillets. If cod is unavailable, hake, striped bass or even salmon are fine substitutes. Steamed rice, soba or egg noodles are all perfect canvases for soaking up the flavorful juices.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2019/07/30/dining/kc-glazed-cod/kc-glazed-cod-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, quick, weeknight, seafood, vegetables", "keywords": "bok choy, cod, ginger, oyster sauce, dairy-free, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 260}, "recipeIngredient": ["3 tablespoons canola oil", "3 garlic cloves, thinly sliced", "2 tablespoons minced fresh ginger", "1 pound baby bok choy, halved lengthwise", "Kosher salt and black pepper", "1/4 cup oyster sauce", "1 tablespoon low-sodium soy sauce", "1 1/2 pounds boneless, skinless cod fillets, cut crosswise into 2-inch pieces", "1 tablespoon unsalted butter", "1 tablespoon lime juice", "Cooked rice, soba or egg noodles, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonstick skillet, heat 2 tablespoons oil over medium. Add garlic and ginger and cook, stirring occasionally, until fragrant, 1 minute. Add bok choy, season with salt and pepper, and cook, stirring occasionally, until tender, about 5 minutes. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add oyster sauce, soy sauce and remaining 1 tablespoon oil to the skillet and bring to a simmer over medium. Season fish lightly with salt and pepper and add to skillet. Simmer gently over medium-low for 5 minutes. Turn fish and simmer, spooning sauce over fish, until cooked through, about 5 minutes. Swirl in butter and lime juice and simmer over medium heat until sauce is thickened, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve fish and bok choy over rice or noodles. Drizzle with remaining sauce."}], "link": "https://cooking.nytimes.com/recipes/1020306-glazed-cod-with-bok-choy-ginger-and-oyster-sauce"}