{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Puttanesca", "description": "Classic Italian puttanesca sauce is typically served over pasta, but it is paired with chicken in this comforting weeknight dish. Chicken thighs are browned, then set aside while you assemble a simple but bold tomato sauce made with briny capers and olives, salty anchovies and spicy red-pepper flakes. Serve the chicken over rice, orzo or egg noodles, with a hunk of bread to round out the meal.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/12/04/dining/ch-chicken-puttanesca/merlin_165081822_3e9ce73a-8790-4cb1-9719-cfd813735e7c-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, poultry", "keywords": "anchovy, capers, chicken, garlic, olives, onion, oregano, parsley, tomato paste, tomatoes, dairy-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 399}, "recipeIngredient": ["1 1/2 to 2 pounds bone-in, skin-on chicken thighs", "Kosher salt and black pepper", "1 tablespoon grapeseed or canola oil", "1 medium red or yellow onion, thinly sliced", "3 garlic cloves, thinly sliced", "4 to 5 anchovies, roughly chopped", "1/2 teaspoon red-pepper flakes", "1 tablespoon tomato paste", "1 (28-ounce) can whole tomatoes, gently crushed with your hand or a spoon", "1/2 cup roughly chopped pitted black or green olives", "2 tablespoons capers, rinsed well if in salt", "2 tablespoons roughly chopped Italian parsley", "1 tablespoon fresh oregano leaves (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat chicken thighs dry and season well with salt and pepper. In a deep-sided 12-inch skillet, heat the oil over medium-high. When the oil shimmers, add the chicken thighs, skin-side down, and cook undisturbed until nicely browned, 5 to 6 minutes. Flip and brown the other side of the chicken thighs, 4 to 5 minutes more. Transfer to a plate and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off and discard all but 2 tablespoons of fat from the pan and return the pan to medium heat. Add the onion and cook until softened, 2 to 3 minutes. Add the garlic, anchovies and red-pepper flakes, and cook, stirring occasionally, until the garlic is pale golden and the anchovies have dissolved, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomato paste and stir until dissolved, then stir in the tomatoes and their juices, scraping up any brown bits that have collected at the bottom of the pan. Stir in the olives and capers, then add the chicken back to the skillet along with any juices that have accumulated. Simmer until the flavors meld and the chicken cooks through, 15 to 20 minutes, adding a tablespoon or so of water if the sauce begins to look dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste and adjust seasonings accordingly. Scatter with parsley and oregano, if using. Divide chicken among plates or bowls, spooning additional sauce over top."}]}