{"@context": "http://schema.org", "@type": "Recipe", "name": "Peppermint Brownies", "description": "These crowd-pleasing treats start with a dense, chewy brownie that’s topped with a layer of creamy peppermint filling, dark chocolate glaze, and a sprinkle of crushed peppermints. For the cleanest slices, chill the finished brownies thoroughly, then use a warm knife to slice them. Dip the knife blade into hot water and wipe it dry with a kitchen towel between each cut, and you’ll be rewarded with clean layers of chocolate, peppermint and glaze. It’s fine to sub chocolate chips for the chopped chocolate, just make sure they are fully melted before proceeding.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2019/12/12/dining/ejm-peppermint-brownies/ejm-peppermint-brownies-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "15 servings (one 9-by-13-inch pan)", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars, finger foods", "keywords": "chocolate, peppermint, peppermint extract, semisweet chocolate, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 57}, "recipeIngredient": ["Nonstick cooking spray", "10 ounces/285 grams semisweet chocolate, chopped (or semisweet chocolate chips)", "8 ounces/225 grams unsalted butter (2 sticks), cut into 1-inch pieces", "1 cup/220 grams light brown sugar", "1/2 cup/100 grams granulated sugar", "3 large eggs", "2 teaspoons vanilla extract", "1 1/2 cups/190 grams all-purpose flour", "1/2 teaspoon baking powder", "1/2 teaspoon fine sea salt", "2 1/2 cups/310 grams confectioners’ sugar", "2/3 cup/160 milliliters sweetened condensed milk", "3/4 teaspoon peppermint extract", "1/2 teaspoon vanilla extract", "Pinch of fine sea salt", "6 ounces/170 grams semisweet chocolate, chopped (or semisweet chocolate chips)", "1/4 cup/60 milliliters heavy cream", "1 tablespoon unsalted butter", "Pinch of fine sea salt", "1/2 cup/95 grams crushed peppermints or candy canes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Lightly grease a 9-by-13-inch pan with nonstick spray, and line with parchment paper, leaving a 1 1/2-inch overhang on both sides (this will help you remove the brownies from the pan later)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the brownies: Place a medium heat-safe bowl over a medium pot of simmering water. Place the chocolate, butter, brown sugar and granulated sugar into the bowl. Heat, stirring frequently, until the mixture is evenly melted. The mixture will be grainy; that’s O.K."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the eggs into the chocolate mixture one at a time, then whisk in the vanilla extract. Add the flour, baking powder and salt and mix with a silicone spatula just until incorporated. Pour into the prepared pan and spread into an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the brownies until a toothpick inserted into the center comes out with a few moist crumbs, 30 to 35 minutes. Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the peppermint filling: In the bowl of an electric mixer fitted with the paddle attachment, on medium-low, mix the confectioners’ sugar, sweetened condensed milk, peppermint extract, vanilla extract and salt to combine. When the mixture appears well combined, scrape down the bowl well once, then mix on medium speed for 2 to 3 minutes. During mixing, the mixture will appear light and fluffy, but when you stop, it may look softer and more liquid. That’s O.K."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the peppermint mixture over the surface of the cooled brownies and spread into an even layer. (It will be stiff but spreadable.) Transfer to the refrigerator and chill for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the brownies chill, make the glaze: Place a medium heat-safe bowl over a medium pot of simmering water. Place the chocolate, cream, butter and salt in the bowl. Heat, stirring frequently, until the mixture is evenly melted. (Alternatively, this can be done in the microwave in a microwave-safe container in 15-second increments until fully melted.) Let the glaze cool for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the glaze over the chilled brownies and spread into an even layer. Sprinkle the crushed peppermints evenly over the surface. Return to the refrigerator to chill until the chocolate is fully set, about 45 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the parchment paper to lift the brownies out of the pan and use a sharp knife to cut them into 15 even pieces. For cleanest slices, dip the knife into warm water and dry with a clean towel in between each cut. Store in an airtight container at room temperature for up to one week."}]}