{"@context": "http://schema.org", "@type": "Recipe", "name": "Bollito Misto (Italian Boiled Meats With Red and Green Sauces)", "description": "Bollito misto is the Italian version of a boiled dinner, somewhat similar to the French pot au feu, but more complex. (A New England boiled dinner pales in comparison.) The dish can be quite an extravagant affair, with many cuts of veal, beef, tongue, sausages and a fat capon. This is a simpler version, though it is still a project and easier to complete if the work is spread over two or three days. But it is a worthy adventure. Serve the broth as a traditional first-course soup garnished with tortellini or other small stuffed pasta shapes, or plain, in little cups, for sipping. Two bright sauces — one green, one red — round out the dish as condiments.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/02/05/dining/03Tanisrex-bolito/merlin_167929602_5cb50414-9ee8-456b-92ac-ee397451a92c-articleLarge.jpg", "totalTime": "P2DT5H", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "meat", "keywords": "bone-in beef shank, chuck roast, cotechino, day-old bread, fennel bulbs, golden beet, Italian sausage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "recipeIngredient": ["4 pound chuck roast, rolled and tied", "3 pounds bone-in beef shank, sliced 1 1/2-inch thick", "Salt and pepper", "4 whole cloves", "2 bay leaves", "2 large onions, peeled", "1 teaspoon whole black peppercorns", "2 celery stalks", "2 large carrots, peeled", "1 precooked cotechino sausage (about 1 pound)", "6 sweet Italian sausages, with or without fennel seeds (about 1 1/2 pounds)", "8 medium carrots, peeled", "3 fennel bulbs, trimmed and cut into wedges", "6 medium golden beets, turnips or rutabaga, peeled, cut into wedges", "1 1/2 pounds small potatoes, such as Yukon Gold", "Parsley sprigs, for garnish", "3 bunches parsley, leaves and tender stems (about 3 cups)", "1 bunch basil, leaves only (about 2 cups)", "2 tablespoons capers in brine", "Extra-virgin olive oil", "Generous pinch of red-pepper flakes", "Salt and pepper", "4 thinly sliced scallions", "2 tablespoons grated horseradish", "A few drops of red wine vinegar", "1 cup cubed day-old bread (1/2-inch pieces)", "1/4 cup red wine vinegar", "2 large roasted peppers (jarred are O.K.)", "2 small garlic cloves", "2 tablespoons tomato paste", "1 teaspoon paprika (sweet or hot are fine, as long as it’s fresh)", "1/4 teaspoon ground cayenne", "2 to 3 tablespoons extra-virgin olive oil", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the meats: Season chuck roast and beef shank generously with salt and pepper and let sit for 1 hour at room temperature or refrigerate overnight, if time permits. Transfer meats to a 12-quart pot. Use the whole cloves to stick the bay leaves onto the whole onions, and add to the pot along with peppercorns, celery stalks and large carrots."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover with 4 quarts water (or a little more to cover) and bring to a boil. Reduce heat, cover with lid ajar and cook at a bare simmer for 2 to 3 hours, until meats are fork tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salsa verde: Purée parsley, basil and capers in food processor with about 1 cup olive oil to make a rough, loose paste. Transfer to a bowl, and stir in red-pepper flakes, salt and pepper, scallions, horseradish and vinegar. Thin with more oil to desired consistency. You should have 1 1/2 cups. (Both sauces can be made well ahead of time. The salsa verde will keep for 2 to 3 days in the refrigerator and is great on grilled fish, chicken or vegetables.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salsa rossa: Soak bread cubes with red wine vinegar until soft. Transfer to a blender or food processor, along with roasted peppers, garlic, tomato paste, paprika and cayenne. Blend until smooth, thick and creamy. Transfer to a bowl, stir in olive oil until it’s the consistency of a milkshake. (Don’t worry if it’s a little thin.) Season with salt and pepper. Taste and adjust seasoning — it should be spicy, and you should have 1 1/2 cups. (The sauce will keep in the refrigerator for 1 week.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once meats are tender, remove them from the pot and set aside. Strain broth through a fine mesh sieve and discard aromatics. Ladle off any surface fat. (If time permits, refrigerate meat and broth overnight.) Reheat meat in a small amount of broth. Bring remaining broth to a simmer and reduce for 10 to 15 minutes to concentrate flavors. Season to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a separate pot of water to a light simmer over medium heat, and cook the precooked cotechino sausage for 30 minutes. Add the Italian sausages and simmer for 12 minutes, until firm and cooked through. Turn off heat and keep sausages warm in their cooking liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As sausages cook, prepare the vegetables: Bring a pot of well-salted water to a boil. Cook each type of vegetable separately until soft but not mushy, about 10 minutes each, a bit longer for the potatoes. Blot on a kitchen towel, then arrange on a platter and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, cut chuck roast into 3/4-inch-thick slices, and chop shank meat into rough chunks. Cut cotechino crosswise into 1/2-inch slices. Leave Italian sausages whole. Arrange all meats on a platter, moisten with a little hot broth and garnish with parsley sprigs. This meal works well as a buffet, or you may prepare individual plates. Pass salsa verde and salsa rossa at the table. Serve broth in small cups alongside, if desired."}], "link": "https://cooking.nytimes.com/recipes/1020836-bollito-misto-italian-boiled-meats-with-red-and-green-sauces"}