{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Potatoes With Anchovies and Tuna", "description": "In this pantry-friendly recipe, golden, crackling-skinned potatoes move from side dish to main course after being tossed with tuna, capers and a pungent sauce of anchovies melted in brown butter. It’s extremely adaptable. If you don’t have (or like) tuna, use chickpeas or white beans instead. Just don’t skimp on the onion, which adds a crisp sweetness to the potatoes. With their slightly thicker skins, fingerlings work especially well here, but use whatever you’ve got.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/03/25/dining/20apperex/merlin_170424801_860befa0-8049-4fde-9450-d0db4ca02451-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, seafood, vegetables", "keywords": "anchovies, beans, onion, potato, tuna, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 383}, "recipeIngredient": ["1 1/2 pounds baby or fingerling potatoes", "Kosher salt", "Extra-virgin olive oil, for roasting", "6 tablespoons unsalted butter (3/4 stick)", "1 (2-ounce) tin anchovies, chopped (about 10 to 12 anchovies)", "1 tablespoon capers, drained", "2 garlic cloves, finely grated or minced", "1 (5- to 6-ounce) can or jar tuna, drained and flaked, or 1 (13-ounce) can chickpeas or white beans, drained", "1/2 teaspoon freshly ground black pepper", "Fresh lemon juice, to taste", "1 cup chopped soft herbs, including parsley, celery leaves and dill (optional)", "1/4 cup thinly sliced red onion, shallot or scallion"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot, cover potatoes with at least 1 inch of water, and add a generous amount of salt. Bring to a simmer, then cook until potatoes are very soft, 25 to 30 minutes. You want to overcook them a little, so the insides stay creamy when they’re roasted later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the potatoes, and let them cool until you can handle them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Use your hands to smash the potatoes to about 3/4-inch thick and transfer to a rimmed baking sheet. Toss with oil and a little salt. (The more generous you are with the oil, the crispier the potatoes will get.) Arrange potatoes in a single layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until dark golden and crisp, 40 to 50 minutes, flipping them over halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt butter in a small pot over medium heat. Stir in anchovies and capers, and continue to cook until butter is brown and nutty. Stir in garlic and remove pan from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour brown butter all over the potatoes. Add tuna (or beans) to the pan, and toss well. Season with more salt, if needed, pepper and lemon juice to taste. Scatter herbs and onions over the top and serve."}]}