{"@context": "http://schema.org", "@type": "Recipe", "name": "Abgoosht (Persian Lamb and Chickpea Stew)", "description": "Iran’s most beloved and ubiquitous peasant dish, abgoosht (or “meat water”) is made with inexpensive, bony cuts of meat, which take a back seat to the broth and the sheer ceremony involved in serving it all. Once the stew is cooked, it is divided into two parts: The meat, potatoes and beans are pulled from the stock and mashed into a meat paste, goosht kubideh. Simple to prepare, the dish turns into an occasion for a gathering, as the broth and meat paste are served with piles of warm flatbread, pickles and fresh herbs, palate cleansers that offset the richness of the dish.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2019/05/15/dining/14Iranianrex3/merlin_154258188_a8e988d7-5bce-43ff-a5a8-01d6318a52b6-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, beans, meat, soups and stews", "keywords": "lamb shanks, turmeric, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "recipeIngredient": ["2 1/2 pounds bone-in lamb shank", "1 teaspoon ground turmeric", "Fine sea salt and freshly ground black pepper", "1/2 cup dried chickpeas", "1/2 cup dried white beans, such as navy or cannellini", "2 large yellow onions, quartered", "1/4 cup tomato paste", "3 large russet potatoes (about 2 pounds)", "6 Omani (dried Persian) limes, rinsed and punctured multiple times with a fork", "Persian liteh pickles, for serving", "<a href=\"https://cooking.nytimes.com/recipes/1020212\">Salad-e Shirazi</a>, for serving", "Warmed sangak bread or other freshly baked flatbreads, for serving", "Assorted fresh herbs (such as mint, tarragon and basil), scallions and radishes, for serving (optional)", "Doogh (Persian yogurt drink), for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The night before you plan to cook, season the lamb with turmeric, 1 teaspoon salt and 1/2 teaspoon pepper. Cover and refrigerate. Place chickpeas and beans in a medium bowl; add 3 cups water and a generous pinch of salt. Refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook: Set a large Dutch oven or soup pot over high heat. Add lamb, onions, tomato paste and 8 cups water. Drain chickpeas and beans and add to pot. Bring to a boil, stir to dissolve tomato paste, and cover pot partially with a lid. Reduce heat and simmer stew for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel potatoes and cut into 1-inch pieces. Add potatoes and Omani limes to pot and continue simmering until potatoes and meat are both completely tender, about 1 hour. Taste and adjust the seasoning of the broth with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove limes from pot, and one by one, juice them into the soup through a sieve by pressing down on them with a spoon. (Avoid letting the seeds through the sieve, as they can be bitter.) Taste the broth after juicing each lime and add just enough so that the broth is tangy and bright."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the sieve to remove the meat, potatoes and beans from the pot and transfer them to a large bowl. Use a fork to pull the meat off the bones. If any of the bones have marrow, use a skewer to remove it and add to the bowl. Use a potato masher to mash meat, beans and potatoes into a soft, uniform paste — this is called goosht kubideh, literally “mashed meat.” If the mixture appears dry, add a few spoonfuls of broth and continue to mash until unctuous and smooth. Taste the paste and adjust the seasoning with salt, pepper and Omani lime juice, as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, bring broth and goosht kubideh to the table, along with bowls of liteh pickles, salad-e Shirazi, warmed sangak bread, fresh herbs and, if you like, doogh. All of the sides serve as palate cleansers to balance the richness of the dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Traditionally, the broth is eaten first with sangak bread, which can hold up to the broth without disintegrating. Typically, the bread is torn into bite-size pieces and added to broth to soak for a couple of minutes before digging in. This process is called tilit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the goosht kubideh separately after everyone has had a bowl of broth. Traditionally the meat paste is made into small sandwiches with fresh herbs, and eaten with alternate bites of salad-e Shirazi and liteh pickle. Leftover goosht kubideh makes for a great sandwich or baby food, and freezes well for up to 2 weeks."}]}