{"@context": "http://schema.org", "@type": "Recipe", "name": "Homemade Pocky", "description": "These crunchy cookie sticks are inspired by Pocky, the machine-made Japanese treat. They don’t pretend to be the perfectly straight version from the box, but they're freshly baked and taste far better. They're also fun to make: The dough is forgiving and easy to work with, so shaping it is as simple as rolling a Play-Doh snake. Decorating presents an opportunity to go wild. Mix matcha powder or pulverized freeze-dried berries with white chocolate; pair milk chocolate with hazelnuts; or combine dark chocolate with almonds or pecans. Sprinkles, shredded coconut or sesame seeds add flair.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/11/27/dining/ss-pocky/merlin_163734129_16c95838-5755-4c45-9dab-b78e283f6f79-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "34 cookie sticks", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars", "keywords": "dark chocolate, flour, matcha, milk chocolate, nuts, white chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 251}, "recipeIngredient": ["1 1/4 cups/160 grams all-purpose flour, plus more for dusting", "3 tablespoons granulated sugar", "1/2 teaspoon baking powder", "1/4 teaspoon kosher salt", "1/4 cup/55 grams cold unsalted butter (1/2 stick), cut into pieces", "3 tablespoons whole milk", "1/4 teaspoon vanilla extract", "3 ounces/85 grams white chocolate, chopped (about 1/2 cup)", "3 ounces/85 grams milk chocolate, chopped (about 1/2 cup)", "3 ounces/85 grams dark chocolate, chopped (about 1/2 cup)", "Vegetable shortening, as needed", "1 tablespoon pulverized freeze-dried raspberries or strawberries, or 1/2 teaspoon matcha powder", "2 tablespoons cocoa nibs", "3 tablespoons chopped nuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: Add 1 1/4 cups flour, the sugar, baking powder and salt to a food processor, and pulse a few times to combine. Add butter and pulse until small crumbs form. In a measuring cup, combine milk and vanilla. Stream into flour mixture while machine is running. Pulse until dough is fairly smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to a lightly floured surface, and roll until it is just over 1/4-inch thick. Use a bench scraper or the side of a large knife to straighten the sides so that it is a 5 1/2-by-8-inch rectangle. Wrap in plastic and transfer to a small baking sheet. Chill until firm, at least 1 hour and up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Use a bench scraper or long knife to cut the dough crosswise into 1/4-inch-thick strips that are about 5 1/2 inches long. Transfer half the dough to the refrigerator while you work with the other half. Using the palms of your hands, gently roll each strip on a lightly floured work surface until 7 to 8 inches long. Transfer strips to parchment- or silicone mat-lined baking sheets, keeping them as straight as possible and spacing them about 1 1/2 inches apart. Repeat with remaining dough. Freeze until firm, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden on edges and bottom, 14 to 16 minutes. Let cool a few minutes on the baking sheets, then transfer to wire racks to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Decorate the cookies: Melt each of the chocolates in a separate metal bowl set over a small saucepan with 1 inch of simmering water, stirring occasionally until melted. If using dark or milk chocolate, add 1/2 teaspoon vegetable shortening to each and whisk until combined. If using white chocolate, add enough vegetable shortening to make it thin enough for dipping, up to 1 tablespoon, whisking until mixture is glossy. Stir pulverized berries or matcha into white chocolate. (You can also melt the chocolate in the microwave instead: Transfer the chocolate and shortening to a microwave-safe glass bowl and microwave for 30 seconds. Whisk to combine, then heat in 20-second increments, whisking between each, until melted.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Holding a cookie stick over a bowl of chocolate, use a small spoon to pour the chocolate over 2/3 of the stick, turning cookie to coat on all sides. Let excess drip off, and scrape against the edge of the bowl. Set chocolate-coated cookie on a parchment- or wax paper-lined baking sheet. Sprinkle with nibs or nuts as desired. (You’ll want to keep all the dips in a warm place while working with them, and return them to the pot or microwave to remelt if needed.) Refrigerate until coating hardens. Cookies will keep in an airtight container at room temperature for 1 week."}], "link": "https://cooking.nytimes.com/recipes/1020657-homemade-pocky"}