{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato-Poached Fish With Chile Oil and Herbs", "description": "Poaching boneless, skinless fish fillets in a brothy sauce is a foolproof (and undeniably delicious) method for cooking fish. Here, go for meaty, mild-flavored, firm-fleshed varieties like cod, haddock, pollack, halibut or flounder. This flavorful sauce, made from burst cherry (or other small) tomatoes, sizzled shallots and toasted garlic, definitely has a summery vibe; feel free to substitute a can of peeled tomatoes if the real deal isn’t in season.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/06/19/dining/17Romanrex/17Romanrex-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, seafood", "keywords": "cod, fluke, garlic, halibut, tomatoes, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1456}, "recipeIngredient": ["1/4 cup olive oil, plus more for drizzling", "4 garlic cloves, thinly sliced", "1 small shallot, thinly sliced into rings", "1 teaspoon red-pepper flakes", "1 pound small, sweet tomatoes, halved", "Kosher salt and black pepper", "1 teaspoon fish sauce (optional)", "1 1/4 pounds fluke, halibut or cod, cut into 4 equal pieces", "1 cup cilantro, leaves and tender stems", "1/2 cup mint, leaves and tender stems", "Limes, halved, for serving", "Tortillas, toast or rice, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1/4 cup olive oil in a large skillet (use one with a lid) over medium-high. Add garlic and shallots and cook, swirling the skillet constantly until they start to toast and turn light golden brown, 2 minutes or so. Add red-pepper flakes and swirl to toast for a few seconds. Remove from heat and transfer all but 1 tablespoon of the chile oil to a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomatoes to the skillet and season with salt and pepper. Cook, tossing occasionally, until they burst and start to become saucy and jammy, 5 to 8 minutes. Add fish sauce, if using, and 1 1/2 cups water, swirling to release any of the bits stuck on the bottom of the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook until the sauce is slightly thickened but still nice and brothy, 3 to 5 minutes. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the fish with salt and pepper and gently lay the pieces in the brothy tomatoes. Cover the skillet and cook until the fish is opaque and just cooked through, 4 to 6 minutes (slightly longer for a thicker piece of fish, like halibut)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, transfer fish and brothy tomatoes to a large shallow bowl or divide among four bowls. Drizzle with reserved chile oil, more olive oil and the crispy shallots and garlic. Top with cilantro and mint, and serve with limes for squeezing over the top. Serve with tortillas, toast or rice, if you like."}], "link": "https://cooking.nytimes.com/recipes/1020279-tomato-poached-fish-with-chile-oil-and-herbs"}