{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato Bruschetta", "description": "This classic recipe is for lazy summer days that beg for moving slowly and snacking often. Chop tomatoes, place them in a colander, shower them with salt, then make yourself a drink or go for a swim. The longer they drain, the better they’ll be. This bruschetta gets better as it sits for a bit, so make it up to an hour ahead. While most bruschetta recipes have you rub a raw garlic clove on toasted bread, this one calls for making a quick infused oil that’s stirred into the tomatoes and basil, providing a more delicate garlicky note. Pile it all on toasted bread, and enjoy bite after juicy bite.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/06/05/dining/as-tomato-bruschetta/as-tomato-bruschetta-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, snack, dips and spreads, finger foods", "keywords": "appetizer, basil, bread, extra virgin olive oil, garlic, tomato, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 157}, "recipeIngredient": ["1 pound plum tomatoes (about 4 to 5 large), or another variety of ripe tomatoes", "1 teaspoon kosher salt", "5 tablespoons extra-virgin olive oil", "2 large garlic cloves, minced", "8 large basil leaves", "Grilled or toasted crusty bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Core and chop the tomatoes, then transfer to a colander over a bowl or in the sink. Add the salt and gently stir. Let drain for up to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the garlic oil: In a small saucepan, warm the olive oil and garlic over low heat until the garlic is softened and fragrant, about 5 minutes, making sure the garlic doesn’t brown. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the basil leaves up and thinly slice crosswise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oil is cool and the tomatoes are well drained, combine the tomatoes, garlic oil and basil in a medium bowl. Season with additional salt, to taste. Spoon over toasted bread."}]}