{"@context": "http://schema.org", "@type": "Recipe", "name": "Hot Sauce Roast Chicken With Tangy Kale Salad", "description": "In his cookbook “Amá: A Modern Tex-Mex Kitchen” (Chronicle Books, 2019), the chef Josef Centeno experiments with the Tex-Mex cuisine he grew up eating in San Antonio. Barbecue chicken played a significant role, and he reinterpreted those flavors with a chile paste-rubbed chicken that gets basted with hot sauce as it roasts. This simplified version requires less work and comes together with pantry staples. Slip a few pats of butter under the skin (this ensures the meat stays moist), toss together a dry rub made with chile powder, cumin and onion powder, then rub it all over the chicken. Pop it into the oven and baste with a combination of hot sauce and melted butter every 10 minutes. The crunchy kale salad pairs well with the tangy, buttery chicken. A pile of rice or beans would round out the meal.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/11/13/dining/aw-hot-sauce-roast-chicken/aw-hot-sauce-roast-chicken-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry", "keywords": "chicken, chili powder, cumin, hot sauce, kale, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 163}, "recipeIngredient": ["1 (4- to 4 1/2-pound) whole chicken ", "8 tablespoons unsalted butter (1 stick), chilled", "Kosher salt and black pepper", "3/4 to 1 teaspoon ground chipotle or chile powder", "3/4 teaspoon ground cumin", "1/2 teaspoon onion powder", "1/2 lemon, cut into 2 wedges", "1/3 cup vinegar-based arbol hot sauce, such as Cholula or Crystal", "1/4 cup extra-virgin olive oil", "1 1/2 teaspoons lime zest, plus 5 teaspoons lime juice (from 2 limes)", "2 teaspoons dried oregano (preferably Mexican oregano)", "1 small garlic clove, finely grated", "1/4 teaspoon black pepper", "Pinch of fine sea salt", "3/4 pound green cabbage (about 1/2 head), thinly sliced and chopped (about 4 cups)", "6 ounces Tuscan kale, stemmed, cut into thin ribbons", "1/2 cup finely chopped fresh cilantro, mint or parsley, or a combination"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Pat the chicken dry using paper towels. Cut 5 tablespoons butter into thin slices, reserving the remaining 3 tablespoons. Season the cavity of the chicken generously with salt and pepper. Working with your fingers, carefully loosen the skin of the chicken by sliding your fingers between the skin and the meat. Slide the sliced butter between the skin and the breast and thigh meat, evenly distributing the pieces over the chicken. In a small bowl, toss the ground chipotle, cumin and onion powder, 1 teaspoon salt and 1 teaspoon pepper. Rub the mixture all over the chicken. Stuff the cavity with the lemon wedges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tuck the wings behind the back of the chicken, crisscross the legs at the ankles and tie the legs together tightly using kitchen twine. Transfer the chicken, breast-side up, to the rack of a roasting pan and roast until the skin is crisp and lightly browned, 15 to 20 minutes. Lower the heat to 350 degrees and roast another 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt the remaining 3 tablespoons butter with the hot sauce in a small saucepan over medium heat. Set aside 2 tablespoons hot sauce mixture, for finishing the chicken. After the chicken has roasted for 30 minutes at 350 degrees, working in three or four batches, brush the baste all over the top and sides of the chicken every 10 minutes until the chicken reaches 165 degrees, 30 to 40 minutes more. Make sure to cook until an instant-read thermometer inserted into the thickest part of the thigh registers 165 degrees and the juices run clear. Remove the chicken from the oven, brush with the reserved 2 tablespoons hot sauce mixture, and let rest for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chicken rests, prepare the cabbage and kale slaw: Add the vinaigrette ingredients to a small jar and shake to combine. Set aside. Toss the cabbage, kale and herbs in a large bowl with the vinaigrette; season to taste with salt and pepper. Carve the chicken, breaking it down to eight pieces or slicing as desired, transfer to a platter and drizzle with any juices from the roasting pan. Serve immediately with slaw."}], "link": "https://cooking.nytimes.com/recipes/1020629-hot-sauce-roast-chicken-with-tangy-kale-salad"}