{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Mussels, Tomatoes and Fried Capers", "description": "The best part of a big pot of mussels is arguably the broth, especially when it features plenty of garlic and wine. Here, the mussels and their broth — combined with ripe summer tomatoes — make a heady, rich sauce for pasta. A topping of toasted garlicky bread crumbs run through with fried capers gives the mixture texture and tang. This is just as good warm as it is hot, so feel free to make it up to an hour in advance, adding the herbs just before serving.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/09/11/dining/06apperex1/merlin_160015539_fa2be5e8-f33f-43a1-99f1-3f2c63d3b2ad-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, pastas", "keywords": "bread crumbs, capers, mussels, pasta, tomato, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 272}, "recipeIngredient": ["Salt, as needed", "8 ounces calamarata, rigatoni or other short pasta", "4 tablespoons extra-virgin olive oil", "2 tablespoons drained capers, patted dry", "3 garlic cloves, 1 minced, 2 thinly sliced", "1/3 cup panko bread crumbs", "Large pinch of red-pepper flakes", "2 cups diced ripe, fresh tomatoes (2 medium tomatoes)", "Freshly ground black pepper, as needed", "Fresh lemon juice, to taste", "1/2 cup dry white wine", "3 large sprigs fresh oregano or marjoram", "2 pounds mussels, rinsed and debearded", "1 tablespoon unsalted butter, at room temperature, cut into small pieces", "1/4 cup torn fresh basil or mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of heavily salted water to a boil. Add pasta and cook according to package directions until 2 minutes shy of al dente. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As pasta cooks, prepare the bread crumbs: In a large pot, heat 3 tablespoons oil over medium heat. Add capers and minced garlic, and let sizzle for 30 seconds. Add bread crumbs, and fry until both crumbs and capers are golden brown, about 2 minutes. Scrape the crumbs and capers onto a plate, and season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining tablespoon oil to pot and let it get hot. Add sliced garlic and red-pepper flakes, and let sizzle until garlic is golden at the edges, 1 to 2 minutes. Stir in tomatoes and a pinch of salt and pepper. Cook until tomatoes have softened and start to lose their shape, about 6 minutes. Use a slotted spoon to transfer tomato solids to a small bowl, add lemon juice to taste, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wine and oregano to the pot and bring to a simmer. Add mussels, cover and cook over medium heat, shaking the pot occasionally, until mussels have opened and are cooked through, about 4 to 7 minutes. Transfer mussels with a slotted spoon to a large bowl, and let cool slightly. Discard any unopened mussels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer the mussels liquid until reduced to a glaze, about 5 minutes. Discard oregano sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When mussels are still hot (but not too hot to handle), pull meat from shells and add to the pot with reduced mussel broth (discard shells). Add pasta, tomatoes and butter, and toss well. Taste and add more lemon juice and salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer mixture to a shallow serving bowl and toss with herbs. Top with bread crumb-caper mixture and serve."}], "link": "https://cooking.nytimes.com/recipes/1020447-pasta-with-mussels-tomatoes-and-fried-capers"}