{"@context": "http://schema.org", "@type": "Recipe", "name": "Umami Garlic Noodles With Mustard Greens", "description": "The key to this heady noodle dish, adapted from “Vietnamese Food Any Day” (Ten Speed Press, 2019), is to build complexity by layering umami flavors in the pan. The cookbook’s author, Andrea Nguyen, starts with ingredients that are familiar to many pan-fried noodle dishes: oyster sauce, fish sauce, mushrooms, garlic. But then, in a brilliant move, she augments it all with a big dollop of salted, European-style cultured butter to add both creaminess and acidity. There’s also a touch of monosodium glutamate (MSG) in the mix, which you can buy in Asian markets or other supermarkets sold under the name Accent Flavor Enhancer. It has a salty sweetness that deepens all the other flavors. But if you’d rather not use it, nutritional yeast also works well. If you can’t get mustard greens, substitute baby kale or spinach.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/03/13/dining/umami-noodle-alt/umami-noodle-alt-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "vietnamese", "recipeCategory": "dinner, weekday, noodles", "keywords": "main course, monosodium glutamate, mushroom, mustard greens, ramen", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 409}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 319, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "10 grams", "sodiumContent": "1123 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 large garlic cloves, finely grated or minced", "Kosher salt, as needed", "10 ounces dried Chinese wheat noodles or Japanese ramen", "1 tablespoon oyster sauce", "2 teaspoons fish sauce", "1 teaspoon cornstarch", "1/2 teaspoon monosodium glutamate (MSG), or use 1/2 teaspoon chicken stock base or 2 tablespoons nutritional yeast", "1/2 teaspoon granulated sugar", "5 tablespoons salted, European-style (cultured) butter", "10 ounces sliced shiitake or cremini mushrooms", "1 large bunch mustard greens, stems and leaves, cut into 1 1/2-inch pieces", "Freshly ground black pepper", "1 tablespoon minced shallot", "Chopped cilantro, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, cover garlic with 1 tablespoon water. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of heavily salted water to a boil. Cook noodles 2 minutes less than package directions for very al dente. Reserve 3/4 cup noodle water, then drain noodles in a colander, rinse with cool water and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together oyster sauce, fish sauce, cornstarch, MSG, sugar and reserved cooking water. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 12-inch skillet, melt 3 tablespoons butter over medium-high heat. Stir in mushrooms and cook until well browned, about 5 minutes. Stir in mustard greens and continue to cook, stirring frequently, until bright green and just tender, another 2 minutes. Turn off the heat, transfer to a bowl, and season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return skillet to stove (with heat still off) and add remaining 2 tablespoons butter, shallot and garlic-water mixture (do not drain). As butter melts and sizzles, turn heat back on, to medium-low. Cook, stirring frequently, until garlic is fragrant and some pieces are golden, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in cooking liquid mixture and raise heat to medium; bring sauce to a bubble. Using tongs, toss in noodles just until coated in sauce, then turn off heat. If noodles look too thick or taste too salty, add a splash of water. Stir in mushrooms and mustard greens. Let it sit for 1 minute, then serve topped with cilantro."}]}