{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Gratin With Swiss Chard and Sumac Onions", "description": "This is not your typical potato gratin: The Cheddar and brown-butter pine nuts make it rich but not overly so, as the sumac onions and lemon juice lift the gratin to vibrant heights. Sumac is a tart and astringent spice used heavily in Middle Eastern cooking, adding sharpness to food where needed. These onions are great thrown into pasta and salads, or served with roasted chicken. The gratin can stand as a veggie main with a zesty salad alongside, as an accompaniment to your protein of choice or as part of a larger spread. Get ahead by making the onions and preparing all your ingredients (except the potatoes) well in advance, so they’re ready to be assembled together before baking. Once the whole thing goes in the oven, you’ll have ample time to get any accompaniments ready. You can serve this warm, but it also sits well to be served at room temperature.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2020/03/18/dining/14ottorex/14ottorex-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, casseroles, vegetables", "keywords": "cheddar, lemon, onion, parsley, sumac, swiss chard, yukon gold potato, main course, side dish, spring, winter, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 44}, "recipeIngredient": ["1/4 cup/60 milliliters olive oil", "1 1/2 pounds/680 grams red onions, peeled, halved and sliced about 1-centimeter thick", "Kosher salt", "1 1/2 tablespoons dried sumac", "2 1/2 pounds/1.1 kilograms (skin-on) Yukon Gold potatoes, sliced using a mandoline or very thinly sliced into rounds", "1 3/4 pounds/800 grams green Swiss chard, leaves torn from stems (stems reserved for another use) and roughly shredded (about 6 packed cups/315 grams)", "2/3 cup/30 grams roughly chopped fresh parsley, plus 2 tablespoons/5 grams finely chopped parsley for garnish", "6 garlic cloves, minced", "2 teaspoons finely grated lemon zest, plus 1/4 cup juice (from 2 lemons)", "Kosher salt and freshly ground black pepper", "8 ounces/225 grams mature Cheddar, roughly grated (about 3 cups)", "1 cup/240 milliliters chicken or vegetable stock", "3 tablespoons heavy cream (double cream)", "2 tablespoons/30 grams unsalted butter", "1/2 cup/65 grams pine nuts", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees Fahrenheit/180 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the onions: Add the oil to a large, ovenproof lidded skillet and heat over medium-high. Add the onions and 1 teaspoon salt to the hot oil and cook, stirring occasionally, until softened and browned, 15 to 20 minutes. Stir in the sumac and remove from the heat. Transfer the mixture to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the gratin: Add the potatoes, shredded chard, parsley, garlic, lemon zest, 1 tablespoon salt and 1 teaspoon pepper to a large bowl and mix well to combine. Fold through three-quarters of the sumac onions and half the cheese, then transfer everything to the skillet, smoothing out the top to even out the potato slices. In a measuring cup or bowl, combine the stock, cream and lemon juice, and pour this all over the potato mixture. Cover tightly with foil, then top with the lid. Bake for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the gratin from the oven, and remove the lid and foil. Sprinkle evenly with the remaining cheese and bake, uncovered, until golden and bubbling, 35 to 40 minutes. Remove from heat and let gratin settle for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the pine nuts: Add the butter to a medium skillet and melt over medium-high heat. Once melted, add the pine nuts and 1/4 teaspoon salt and cook, stirring occasionally, until the nuts are golden and the butter has browned, 2 to 3 minutes. Add the buttered nuts to the bowl with the remaining sumac onions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, stir the extra parsley into the sumac onion mixture and spoon this all over the gratin."}]}