{"@context": "http://schema.org", "@type": "Recipe", "name": "Pastelón", "description": "Pastelón is a layered Puerto Rican casserole of plantains, cheese and picadillo, a tomato-based ground beef mixture seasoned with onions, peppers, herbs and spices. The dish is often referred to as Puerto Rican lasagna, and to say there is only one real recipe for pastelón would be like saying there’s only one true lasagna. Variations abound! Some cooks boil the plantains and make a mash with taro; others fry them until they’re sweet and crisp. Nearly any mild, meltable cheese may be used, though there is debate over whether or not to add raisins. This recipe is adapted from from Natalia Vallejo, chef and owner of Cocina al Fondo in Santurce, Puerto Rico. She doesn’t serve pastelón at her restaurant, but she grew up eating it. Her version includes fried plantains, mozzarella, fresh tomatoes and raisins, because she says “Puerto Ricans like that sweet-and-salty mix.”", "author": {"@type": "Person", "name": "Daniela Galarza"}, "image": "https://static01.nyt.com/images/2020/02/18/dining/dg-pastelon/merlin_169064670_d5e76676-b9ec-4caa-a4da-2d8073e95757-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "dinner, casseroles, meat, vegetables", "keywords": "cumin, ground beef, mozzarella, olives, plantain, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 235}, "recipeIngredient": ["6 medium-ripe (yellow with some black spots) large plantains (about 4 1/2 pounds)", "1 cup canola oil", "1 small yellow onion (about 4 ounces), peeled and roughly chopped", "1 small green bell pepper (about 5 1/2 ounces), seeded and roughly chopped", "2 ají dulce chiles, seeded and roughly chopped (optional)", "3 garlic cloves, roughly chopped", "2 fresh cilantro stems with leaves, roughly chopped", "2 fresh culantro (recao) stems with leaves, roughly chopped (optional)", "2 tablespoons canola oil", "1 1/2 pounds lean ground beef", "1 1/2 teaspoons kosher salt", "1/2 teaspoon black pepper", "1 teaspoon ground cumin", "1 teaspoon ground sweet paprika", "1 teaspoon dried oregano", "3/4 pound fresh tomatoes, finely chopped (about 1 1/2 cups)", "1/2 cup white wine (or water)", "3 tablespoons tomato paste", "1/2 cup pimento-stuffed manzanilla olives, quartered", "2 tablespoons yellow or brown raisins (optional)", "Salt and pepper, to taste", "1 tablespoon unsalted butter", "2 large eggs", "Kosher salt", "2 cups shredded mozzarella (8 to 10 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the plantains: Line a sheet pan with paper towels; set aside. Cut off the ends of each plantain. With the tip of a knife, score plantains lengthwise and peel off the skin. Using a serrated knife or chef’s knife, cut each plantain in half lengthwise, and then halve again lengthwise so you end up with 24 long slices. (If some of the slices break or are unevenly shaped, that’s OK! Carry on.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large cast-iron or heavy skillet, heat 1 cup oil over medium-high to between 350 and 375 degrees. Working with 4 to 6 slices at a time, depending on what fits, fry plantains until deep golden brown, turning halfway through, about 6 minutes total. Transfer fried plantains to the prepared sheet pan and cook remaining plantains; set aside. (Let oil cool, then strain and reserve for another use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sofrito: Put onion, bell pepper, ají dulce chiles (if using), garlic, cilantro and culantro (if using), in a food processor; blend until it becomes a rough, wet purée. (You should have about 1 cup sofrito)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the picadillo: In a large, heavy skillet, heat 2 tablespoons oil over medium until it shimmers. Add the sofrito and cook, stirring often, until purée thickens and starts to brown, about 5 minutes. Add the beef and stir in the salt, pepper, cumin, paprika and oregano. Cook, stirring occasionally, until beef is evenly cooked and no longer pink, about 8 minutes. Turn off heat. Push meat mixture to one side, and carefully tilt skillet so that the fat from the meat collects at the bottom of the tilted pan; spoon off and discard as much of this excess fat as you can."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the skillet to medium heat. Add the chopped tomatoes, wine and tomato paste and cook, stirring occasionally, until tomatoes fall apart and the liquid starts to reduce, about 10 minutes. Turn off heat and stir in olives and raisins, if using. Season to taste with salt and pepper. (Picadillo can be made up to 2 days in advance. Rewarm it in a pan on the stove before proceeding with recipe.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pastelón: Heat the oven to 350 degrees. Grease a 9-by-13-inch glass baking dish with butter. Whisk the eggs with a pinch of salt and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay half the fried plantain slices along the bottom of the baking dish crosswise, piecing any broken pieces together to form an even layer. (If there are small gaps in the plantain layer, this is OK.) Top with half the picadillo (about 2 cups), smoothing it into an even layer, then sprinkle half the cheese on top in an even layer. Repeat with another layer of plantains then the remaining picadillo. Pour the whisked eggs evenly over the picadillo layer and spread it so it settles down into the pastelón. Sprinkle the remaining cheese on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the pastelón until the egg is cooked, the cheese is melted and the layers are set, 20 to 30 minutes. Cut into squares and serve hot."}], "link": "https://cooking.nytimes.com/recipes/1020880-pastelon"}