{"@context": "http://schema.org", "@type": "Recipe", "name": "Coffee and Cream Coffee Cake", "description": "In most classic coffee cakes, cinnamon plays a starring role, but this recipe puts coffee flavor front and center thanks to the addition of brewed coffee and espresso powder (or instant espresso). Espresso powder adds strong flavor, and it’s fine enough to dissolve completely so you don’t get any crunchy bits. A ribbon of cream cheese runs through the center of the cake, complementing the coffee flavor like a splash of cream in a cup of coffee.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2020/04/02/dining/em-coffee-cream-coffee-cake/em-coffee-cream-coffee-cake-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "One 9-inch cake", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "brown sugar, butter, coffee, cream cheese, eggs, espresso coffee powder, flour, oats, sour cream, sugar, vanilla, dessert", "aggregateRating": null, "recipeIngredient": ["1 1/2 cups/190 grams all-purpose flour", "1/2 cup/50 grams old-fashioned oats", "1/3 cup/75 grams light or dark brown sugar", "1 tablespoon espresso powder (or instant espresso)", "1/4 teaspoon baking powder", "1/4 teaspoon fine sea salt", "10 tablespoons/140 grams cold unsalted butter (1 1/4 sticks)", "12 ounces/340 grams cream cheese, at room temperature", "1/2 cup/100 grams granulated sugar", "1 large egg", "Nonstick cooking spray", "2 1/2 cups/320 grams all-purpose flour", "2 tablespoons espresso powder (or instant espresso)", "1 1/2 teaspoons baking powder", "1 teaspoon baking soda", "1/2 teaspoon ground cinnamon", "1/2 teaspoon fine sea salt", "3/4 cup/170 grams unsalted butter (1 1/2 sticks), at room temperature", "3/4 cup/165 grams light or dark brown sugar", "3/4 cup/150 grams granulated sugar", "3 large eggs", "1 tablespoon vanilla extract", "3/4 cup/180 milliliters coffee, cooled", "1/2 cup/120 milliliters sour cream", "Confectioners’ sugar, as needed for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the streusel: In a medium bowl, stir the flour, oats, brown sugar, espresso powder, baking powder and salt to combine. Cut the butter into tablespoon portions and drop it into the bowl. Mix with your hands or a pastry cutter until the mixture is thoroughly combined and comes together to form large clumps; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cream cheese filling: In the bowl of an electric mixer fitted with the paddle attachment, beat together the cream cheese and granulated sugar on medium speed until well combined, about 2 minutes. Scrape the bowl well, then add the egg and mix until fully incorporated. Transfer filling to a medium bowl and clean out the mixing bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the coffee cake: Heat the oven to 350 degrees. Lightly grease a 9-inch springform pan with nonstick spray. Line the edge of the pan with 2 strips of parchment paper cut to the height and diameter of the ring, then spray the ring again. (This helps prevent the cake from sticking and makes it easier to unmold.) Place it on a parchment-lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the flour, espresso powder, baking powder, baking soda, cinnamon and salt to combine. In the bowl of an electric mixer fitted with the paddle attachment (or in a medium bowl using a hand mixer), cream the butter, brown sugar and granulated sugar on medium speed until light and fluffy, 4 to 5 minutes. Add the eggs one at a time, and mix, scraping the bowl well after each is incorporated. Add the vanilla and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add about one-third of the flour mixture to the wet ingredients and mix on low speed to combine. With the mixer running, gradually pour the coffee into the mixture in a slow, steady stream, mixing until fully incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half of the remaining flour mixture and mix on low speed to combine. Add the sour cream and mix to combine, then add the remaining flour mixture and mix until fully incorporated. Scrape the sides and bottom of the bowl well to ensure the mixture is homogenous."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour half of the batter into the prepared pan, then sprinkle half of the streusel over the surface of the batter. Dollop the cream cheese mixture by the heaping tablespoons all over the surface of the batter, keeping it about an inch away from the sides. Spoon it over as evenly as you can, but don’t try to spread it once it’s on top of the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the remaining batter over the cream cheese and gently spread into an even layer. Sprinkle the remaining streusel on top. Transfer to the oven and bake until the cake springs back slightly in the center when touched and a toothpick inserted into the center comes out clean or with a few moist crumbs, checking it at about 1 hour and 20 minutes, then baking another 10 minutes if necessary. If your streusel is becoming too dark before the cake is done, loosely cover it with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a thin knife around the outside edge of the parchment paper ring to loosen it from the edge of the pan. Cool the cake for 20 to 30 minutes inside the pan, then remove the outer ring of the pan and the parchment paper and let cool completely. If desired, gently loosen the cake from the base and transfer to a platter, or simply leave it on the base to serve. Garnish with confectioners' sugar just before serving."}], "link": "https://cooking.nytimes.com/recipes/1020977-coffee-and-cream-coffee-cake"}