{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Chicken With Peppers, Focaccia and Basil Aioli", "description": "Surrounded by caramelized peppers, focaccia croutons — some crisp, some soaked with vinegar and chicken jus — and a bright basil aioli, this roast chicken dish is filled with delights that can only be earned through home-cooking and family-style eating. The deliciousness of this recipe relies on layering flavor and encouraging pan juices. Marinate the chicken and peppers generously, seasoning at various stages. Next, place some focaccia underneath the chicken to roast in schmaltz, and tuck smaller shards of the bread like a wreath around the edge of the dish, where they will crisp. If your dish runs dry during cooking, add a splash more vinegar. The basil aioli is crucial, though it doesn’t need to be homemade: Use the best store-bought version you can find and spruce it up with the basil, lemon and garlic paste.", "author": {"@type": "Person", "name": "Clare de Boer"}, "image": "https://static01.nyt.com/images/2019/08/28/dining/27Diaryrex1/merlin_159056598_cc3d8eb1-5102-4dab-921e-74281f349350-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry, roasts", "keywords": "basil, chicken, focaccia, olive oil, red bell pepper, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 150}, "recipeIngredient": ["1 whole chicken (4 to 5 pounds)", "1 tablespoon dried oregano, preferably wild", "1 tablespoon plus 1 1/2 teaspoons flaky sea salt", "Freshly ground black pepper", "1 cup good-quality red wine vinegar", "3 red bell peppers", "2 yellow bell peppers", "1 loaf focaccia (about 14 ounces), halved horizontally if thicker than 1 inch", "2 heads garlic, sliced in half widthwise through cloves", "1/2 cup extra-virgin olive oil", "1 packed cup fresh basil leaves ", "1/4 cup lemon juice (from 2 lemons), plus more to taste", "4 cloves garlic, grated", "2 teaspoons flaky sea salt, plus more to taste", "4 egg yolks", "2 2/3 cups extra-virgin olive oil", "Cold water, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chicken: Set the chicken on a work surface breast-side down. Use shears or kitchen scissors to remove and discard the backbone, then cut through the wishbone and along one side of the breast plate to separate the chicken into two halves. In a 9-by-13-inch (or similar size) baking dish, season the two chicken halves with half the oregano, 1 tablespoon salt and a few grinds of pepper. Drizzle with 3/4 cup vinegar. Set aside, or cover and refrigerate up to 2 hours in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blister the peppers: Turn the stovetop gas flames on high heat. Place the peppers directly over the flames, bottom-side down, and blister until the peppers are beginning to soften, rotating until the bottom, sides and tops are blackened, about 10 minutes. Transfer to a paper bag, fold to seal and let cool, 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working over a bowl to collect the juices, peel each pepper, then tear into thick strips, discarding the stems and seeds as you separate the pepper. Season peppers with the remaining 1/4 cup vinegar, 1 1/2 teaspoons oregano and 1 1/2 teaspoons salt, and toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tear 2 pieces of focaccia (using about half the loaf) into portions that are slightly smaller than the 2 pieces of chicken. Rub both pieces of focaccia with the halved garlic and transfer to the baking dish. Place the marinated chicken on top of each piece of torn focaccia, skin side up. Tuck garlic heads and peppers around the chicken. Tear remaining focaccia into shards and tuck these around the chicken and peppers. Pour any juices from the peppers over the whole dish and drizzle the olive oil over everything."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the chicken comes to 165 degrees, about 1 hour, depending on the size of your bird. If bread or peppers are getting burned before the chicken is fully cooked, cover those areas with aluminum foil and continue cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the aioli: Using a mortar and pestle, working in batches if necessary, mash basil with lemon juice, garlic and sea salt until it forms a paste. Either by hand in a bowl with a whisk or in a food processor, whirl egg yolks then begin adding the oil very slowly, whisking or blending until mixture is emulsified and thickened and all the oil has been added. (If mixture seems to thicken too much for the machine as you blend, pause to add a tablespoon of cold water.) Blend in basil paste until combined. Add additional cold water, 1 tablespoon at a time, to achieve a dippable texture; season to taste with salt and lemon. (Makes 3 1/2 cups.) Use immediately or refrigerate until use, up to 3 days (see Tip)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once chicken is cooked through, remove from oven and let rest for 5 to 10 minutes. Serve directly from the baking dish, family-style, with aioli on the side."}], "link": "https://cooking.nytimes.com/recipes/1020406-roast-chicken-with-peppers-focaccia-and-basil-aioli"}