{"@context": "http://schema.org", "@type": "Recipe", "name": "English Muffin Breakfast Casserole", "description": "This easy, make-ahead casserole makes creative use of classic breakfast ingredients like eggs, sausage, Cheddar cheese and English muffins. It’s a perfect no-stress centerpiece for a special-occasion breakfast: Simply assemble the casserole the night before and pop it in the oven before breakfast. Just remember to make sure to toast the English muffins until they’ve dried out a bit, which will help them absorb the egg mixture. For a vegetarian version, use vegetarian sausage or omit it altogether.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2019/12/11/dining/lh-english-muffin-breakfast-casserole/lh-english-muffin-breakfast-casserole-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, casseroles", "keywords": "butter, cheddar, eggs, english muffins, milk, sausage, scallion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 770}, "recipeIngredient": ["Unsalted butter, for greasing the pan", "6 plain English muffins", "2 tablespoons olive oil", "1 pound bulk hot or sweet breakfast sausage or Italian sausage", "1/2 cup thinly sliced scallions, white and green parts (about 3 scallions)", "Kosher salt and black pepper", "12 large eggs", "2 1/2 cups whole milk", "2 cups shredded sharp Cheddar cheese, lightly packed (about 8 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously grease the bottom and sides of a 9-by-13-inch baking dish with butter. Heat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the English muffins into 1-inch cubes. (Do not halve them horizontally as you would normally for the toaster.) Place the cubes on a sheet pan and bake until lightly toasted, 12 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the olive oil in a medium or large skillet over medium-high. Add the sausage and scallions, a pinch of salt and a pinch of pepper and cook, breaking up the sausage with a wooden spoon, until the sausage is evenly browned, 4 to 6 minutes. Transfer to a paper towel-lined plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add the eggs, milk, 1 teaspoon salt and 1/2 teaspoon pepper to large bowl; whisk to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, sprinkle half of the sausage, then half of the cheese onto the bottom of the baking dish. Add the English muffin cubes on top in one even layer. Carefully pour the egg mixture into the pan, pressing down lightly to make sure all the bread is moistened. Top with remaining sausage and cheese. Wrap well and refrigerate for at least 1 hour up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Bake the casserole until puffed and cooked through, about 40 minutes. (It may need a few more minutes, if your casserole has been in the refrigerator overnight.) Cool for 10 minutes, then cut into squares and serve."}], "link": "https://cooking.nytimes.com/recipes/1020714-english-muffin-breakfast-casserole"}