{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetarian Swedish Meatballs", "description": "Cremini mushrooms, chickpeas and bulgur wheat mimic the texture of ground meat in this vegetarian version of the classic Swedish meatball dish. Seasoned generously with allspice and nutmeg and blanketed in a velvety mushroom gravy, they are excellent served over egg noodles or mashed potatoes — or spooned onto a toasted hero (add sliced tangy pickles to balance out the richness). Leftover cooked meatballs can be frozen and reheated in a 425-degree oven until warmed through, about 15 minutes.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2020/01/27/dining/kc-vegetarian-swedish-meatballs/kc-vegetarian-swedish-meatballs-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "2 dozen meatballs", "recipeCuisine": "american", "recipeCategory": "dinner, finger foods, meatballs, vegetables", "keywords": "allspice, bread crumbs, chickpea, mushroom, mushroom stock, nutmeg, appetizer, main course, side dish, fall, winter, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 527}, "recipeIngredient": ["2 tablespoons bulgur wheat", "4 cremini mushrooms, stemmed and quartered", "1 (15-ounce) can chickpeas, rinsed (about 1 1/2 cups)", "1/3 cup plain bread crumbs", "1/4 cup sour cream", "1 large egg", "1 1/2 teaspoons kosher salt", "3/4 teaspoon ground allspice", "1/2 teaspoon black pepper", "1/2 teaspoon onion powder", "1/2 teaspoon freshly ground nutmeg", "Canola oil, for greasing", "2 tablespoons unsalted butter", "2 tablespoons all-purpose flour", "1 1/2 cups mushroom stock (or vegetable stock)", "1 tablespoon sour cream", "1 tablespoon finely chopped fresh parsley", "1 teaspoon Dijon mustard", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meatballs: Heat oven to 375 degrees. Bring 1/4 cup water to a boil in a small saucepan. Add the bulgur, remove from heat, cover and let sit until tender, 15 minutes. Drain, pressing to remove excess water. Cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a food processor, pulse mushrooms until finely chopped with some pea-size pieces remaining (do not purée); transfer to a large bowl. Repeat with the chickpeas: Pulse, then add them to the large bowl. Add the bread crumbs, sour cream, egg, salt, allspice, pepper, onion powder, nutmeg and the cooled bulgur and mix until well blended. Form into 1 1/4-inch meatballs (about 2 teaspoons each; you should have about 24). Arrange on a greased baking sheet and bake, turning halfway, until golden, 18 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the gravy: While the meatballs bake, in a large nonstick saucepan, melt butter over medium heat. Add flour and cook, whisking constantly, until smooth and lightly golden, 2 minutes. Add stock and bring to a simmer. Cook, whisking, until thickened, 2 minutes. Whisk in sour cream, parsley and mustard; season to taste with salt and pepper (you should have about 1 cup gravy). Add meatballs and simmer, spooning sauce over meatballs, until nicely coated, about 2 minutes more. Serve warm."}]}