{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Slow Cooker Red Beans and Rice", "description": "This vegan version of New Orleans-style <a href=\"https://cooking.nytimes.com/recipes/1020818\">red beans and rice</a> omits the sausage and ham hock, and instead adds smoked paprika, miso and soy sauce for a savory, rounded flavor. If you have a favorite Cajun or Creole spice mixture on hand, use 1 heaping tablespoon of it in place of the sage, cayenne, garlic, onion powders and sweet paprika, and taste before adding any salt, as seasoning blends contain a varying amount of sodium. These vegan beans are not as creamy as the ones made with pork, so smash a few against the side of the pot before serving to thicken the liquid. Serve with hot sauce, preferably a vinegary, cayenne-based Louisiana-style sauce like Crystal, Louisiana brand or Tabasco.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2020/01/22/dining/sd-vegan-red-beans-and-rice/sd-vegan-red-beans-and-rice-articleLarge.jpg", "totalTime": "PT7H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "bell pepper, celery, garlic, kidney bean, miso, onion, smoked paprika, soy sauce", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 98}, "recipeIngredient": ["1/4 cup vegetable oil", "1 large yellow onion, finely chopped", "Kosher salt and black pepper", "3 celery stalks, finely chopped", "1 green bell pepper, finely chopped", "10 garlic cloves, finely chopped", "1 heaping tablespoon white or yellow miso paste", "2 teaspoons smoked paprika", "1 teaspoon sweet paprika", "1 teaspoon onion powder", "1 teaspoon garlic powder", "1/2 to 1 teaspoon ground cayenne, plus more to taste", "1/2 teaspoon ground sage (optional)", "1 pound dried red kidney beans, soaked overnight", "3 dried bay leaves", "3 fresh thyme sprigs or 1 teaspoon dried thyme", "1 teaspoon soy sauce", "Cooked rice, for serving", "Sliced scallions, for serving", "Louisiana-style hot sauce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large (12-inch) skillet over medium. Add the onion, season with salt, and cook, stirring, until the onion is limp and translucent, 6 to 8 minutes. Add the celery and bell pepper and cook, stirring occasionally, until softened, 5 to 8 minutes. Add the chopped garlic, miso paste, smoked paprika, sweet paprika, onion powder, garlic powder, cayenne and sage, if using. Grind in a generous amount of black pepper and add 3/4 teaspoon salt. Stir to combine until the miso has dissolved, then remove from the heat and scrape the mixture into a 6- to 8-quart slow cooker. Add the beans, bay leaves, thyme and 6 cups water. Cook on high until the beans are very tender and creamy, about 7 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before serving, add the soy sauce, and season to taste with salt and cayenne. Using a fork or the back of a spoon, mash some of the beans against the side of the slow cooker to make the mixture slightly creamy. (It will continue to thicken as it sits.) Discard the bay leaves and thyme sprigs. Top the beans with hot cooked rice and scallions; serve with hot sauce."}], "link": "https://cooking.nytimes.com/recipes/1020816-vegan-slow-cooker-red-beans-and-rice"}