{"@context": "http://schema.org", "@type": "Recipe", "name": "Blood Orange Poppy Seed Window Cookies", "description": "The classic linzer cookie provided inspiration for this sandwich cookie. You’ll want to roll out the dough on a silicone baking mat or sheet of parchment paper, removing the excess, rather than trying to move each cookie, which might distort its shape. The added bonus is that you can also slide them onto a baking sheet should the dough warm up too much, and chill it until it’s workable again. You can fill these window cookies with any kind of marmalade, jam or preserves — even lemon curd. If using any of the first three, warm the filling in the microwave, adding a dribble of water if very thick. Strain through a sieve to remove the solids, if you want.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/11/27/dining/ss-window-cookies/merlin_163736391_d9bbe92f-2f06-49f7-a4e5-bb1f0bbe5771-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "About 2 dozen sandwich cookies", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars", "keywords": "blood orange, butter, flour, marmalade, poppy seeds, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 201}, "recipeIngredient": ["2 1/2 cups/320 grams all-purpose flour, plus more for dusting", "1 1/2 tablespoons poppy seeds, plus more for sprinkling", "1/2 teaspoon kosher salt", "1/4 teaspoon baking soda", "1 cup/225 grams unsalted butter (2 sticks), softened", "2/3 cup/135 grams granulated sugar", "2 large egg yolks, at room temperature", "1 teaspoon vanilla extract", "2 tablespoons buttermilk (or 1 tablespoon plus 2 teaspoons milk mixed with 1 teaspoon lemon juice)", "1 cup blood orange marmalade", "Confectioners’ sugar, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine flour, poppy seeds, salt and baking soda in a medium bowl. Whisk to combine, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, cream together butter and granulated sugar on medium-high speed until light and fluffy, 2 to 3 minutes. Add egg yolks and vanilla, then beat on medium speed until well combined, scraping the bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half the flour mixture and beat on low speed, drizzling in the buttermilk. Add remaining flour mixture and beat on low speed just until combined, then increase speed and beat until dough starts to clump together. Scrape the bowl and fold dough a few times to make sure everything is well combined. Divide into two equal balls, flatten into disks, wrap in plastic wrap and chill until firm, at least 1 hour and up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously flour a silicone baking mat or sheet of parchment paper. Place one disk of dough in center and dust both sides of the dough and rolling pin with flour. Working quickly, roll dough until slightly thicker than 1/8 inch. Slide onto baking sheet (do this any time the dough feels too soft or sticky). Chill in freezer until firm, about 10 minutes. Repeat process with second disk of dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flour two cookie cutters in the shape of your choice, one larger, measuring about 2 to 2 1/2 inches, and one smaller, measuring about 1 to 1 1/2 inches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the larger cutter, cut one of the dough sheets in this shape, flouring the cutter frequently. These will be the bottoms of the cookies. Lift off excess dough, knead and chill to re-roll for more cookies, if desired. Spread them out so there is a little space in between. (If the dough is soft and too delicate, chill it in the freezer to be able to move it more easily without distorting its shape.) Chill tray of cut cookie bottoms in freezer until firm, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For cookie tops, repeat Step 6 with remaining dough, again using the larger cutter. Then, using the smaller cutter, cut a “window” or a center hole in the tops of each cookie. (If the dough cracks, just a wait a moment or two to let it warm up.) Chill tray of cookie tops. Count as you go to make sure you have an equal number of solid bottoms and “window” tops. (You should have about 2 dozen of each.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Bake cookies until golden brown, 10 to 12 minutes. (The more delicate “window” cookies will bake faster, so you will want to remove them from the oven first.) Let cool a few minutes on the baking sheets and transfer to wire racks to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place marmalade in a small microwaveable bowl, and microwave 30 seconds to loosen, or transfer to a small saucepan and heat over medium-low until warmed, 1 to 2 minutes. Stir a few times, then strain out the solids, if desired. Let marmalade cool until thicker. (You can speed this up by popping it in the freezer for 15 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cookie bottoms on a parchment- or wax-lined baking sheet, flat-side down. Using an offset spatula or small spoon, spread 1 scant teaspoon marmalade on each bottom cookie, and top with a windowed cookie. Lightly dust with confectioners’ sugar, if desired. (It will stick to the cookie and melt on the marmalade.) Sprinkle marmalade with a few more poppy seeds. Store in an airtight container or tin between layers of parchment or wax paper until serving. Cookies will keep at room temperature for 1 week."}], "link": "https://cooking.nytimes.com/recipes/1020648-blood-orange-poppy-seed-window-cookies"}