{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Mac and Cheese", "description": "Many creamy vegan pasta recipes call for an arsenal of expensive ingredients, but this one relies on more approachable ones, like cashews and almond milk for richness, nutritional yeast for tang and soy sauce for complex saltiness. Sautéed onions do double duty: They serve as a thickener and help offset the sweetness of the cashews. This simple stovetop pasta is wonderful on its own, but feel free to add roasted vegetables, fresh herbs, spices, harissa or hot sauce. For a quick-baked version worthy of Thanksgiving dinner, pile the prepared mac and cheese into a casserole dish, top with panko and more nutritional yeast, and broil for a few minutes until golden brown.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/11/12/dining/aw-vegan-macaroni-and-cheese/aw-vegan-macaroni-and-cheese-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, pastas", "keywords": "almond milk, cashew, garlic, macaroni, mustard powder, nutritional yeast, onion, onion powder, pasta, soy sauce, turmeric, dairy-free, vegan, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 551}, "recipeIngredient": ["Kosher salt", "4 ounces raw, unsalted cashews", "3/4 cup unsweetened almond milk (or other unsweetened nut milk)", "2 tablespoons olive oil", "1/2 large yellow onion, finely chopped (about 1 cup)", "3 garlic cloves, thinly sliced", "3/4 teaspoon onion powder", "1/2 teaspoon ground turmeric", "1/4 teaspoon mustard powder", "Black pepper", "1/2 cup nutritional yeast, plus more to taste", "5 teaspoons tamari or low-sodium soy sauce", "16 ounces elbow macaroni or medium shells", "1 cup panko bread crumbs", "3 tablespoons olive oil, plus more for greasing", "2 tablespoons nutritional yeast", "Kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add the cashews to a large nonstick skillet and heat over medium, stirring frequently, until fragrant, toasty and slightly golden, about 4 minutes. Transfer cashews to a blender and add the almond milk. Wipe out the skillet with a paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the oil to the skillet and heat over medium. Add the onion, garlic, onion powder, ground turmeric and mustard powder, season with salt and pepper, and cook, stirring, until onions are very tender, 8 to 10 minutes, lowering the heat as necessary to avoid scorching. Remove from the heat, stir in 1/2 cup nutritional yeast and the tamari, then transfer to the blender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend the cashew mixture on high until thick and creamy, about 2 minutes, scraping down the sides as needed. (This works best with a high-power blender, but any blender will work — just keep blending the mixture 1 to 2 more minutes after the mixture looks creamy; it will emulsify further.) You should have about 1 1/2 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the pasta according to package instructions until al dente. Reserve 1 cup pasta cooking water. Drain pasta, then return cooked pasta to the pot. Stir in the cashew cream, then add the pasta cooking water 1/4 cup at a time until you achieve desired sauciness. Season to taste with salt, pepper and additional nutritional yeast, if desired. Serve immediately. (The sauce thickens significantly as it sits. If it starts to coagulate, or if you have any leftover macaroni and cheese, stir in a splash of the remaining pasta cooking water to loosen.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’d like a little crunch on top, prepare the optional panko topping: Heat the broiler. In a small bowl, add the panko, olive oil and 2 tablespoons nutritional yeast. Pinch the mixture together gently to combine thoroughly; season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the prepared macaroni to a lightly oiled 9-by-13-inch baking dish, arrange in an even layer and sprinkle the panko mixture on top, if using. Transfer to the oven on the shelf nearest to the broiler and broil until just golden on top, about 2 minutes. (The panko toasts quickly, so you’ll want to keep an eye on it.) Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020616-vegan-mac-and-cheese"}