{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple and Walnut Charoset", "description": "This very classic Ashkenazi charoset, which is a ceremonial part of the Passover Seder, is made from diced apple, toasted walnuts, a touch of cinnamon and a shower of sweet Passover wine. It’s meant to represent the mortar used by the Israelites when they were slaves in Egypt. The sweeter the apples you use, the less honey you’ll need to add at the end. But tart apples are nice here, too, as long as you balance their acidity. If you can’t get Manischewitz or another sweet Passover wine, ruby port is a fine substitute. You can make this charoset one day ahead and store it in the refrigerator; just mix it well before serving to reincorporate any liquid that might have seeped out of the mix.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/04/09/dining/mc-charoset/mc-charoset-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "3 1/2 cups", "recipeCuisine": "jewish", "recipeCategory": "dips and spreads", "keywords": "apple, cinnamon, honey, manischewitz wine, walnut halves", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 112}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 224, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "51 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 cup/150 grams walnut halves", "2 large or 3 small firm, crisp sweet apples (1 pound), such as Fuji or Gala, peeled, cored and diced in 1/4-inch pieces", "5 tablespoons sweet Passover wine, such as Manischewitz, or ruby port", "1 tablespoon fresh lemon juice", "1/2 tablespoon honey, plus more to taste", "1/2 teaspoon ground cinnamon, plus more to taste", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Spread walnuts on a rimmed baking sheet and toast in the oven, stirring once or twice, until fragrant and golden-brown at the edges, about 10 minutes. Transfer baking sheet to a wire rack to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely chop the nuts and place in a large bowl. Add remaining ingredients and toss to coat. Let sit for at least 30 minutes before serving. Taste and add more honey and cinnamon, if you’d like."}], "link": "https://cooking.nytimes.com/recipes/1020117-apple-and-walnut-charoset"}