{"@context": "http://schema.org", "@type": "Recipe", "name": "Parmesan White Bean Soup With Hearty Greens", "description": "Whatever you do, don’t throw away your Parmesan rinds: Within those waxy rinds is enough rich umami and salty cheese flavor to carry an entire soup’s broth. Collect and store them in an airtight container in the freezer (or purchase a container of them at your grocery store). Once you have about 10 ounces of rinds, simmer them with aromatics as you would to make chicken or bone broth. (For an easier cleanup, enclose the rinds in cheesecloth or muslin.) Use the broth to make risotto or minestrone, a pot of beans or this soup, which combines beans and greens with the garlic and lemon rind from the broth. Use whichever beans and greens you like, and mop up every last Parmesan-y drop with a hunk of crusty bread.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/09/23/dining/as-parmesan-white-bean-soup/as-parmesan-white-bean-soup-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "garlic, lemon, olive oil, parmesan, thyme, white beans, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1134}, "recipeIngredient": ["4 tablespoons extra-virgin olive oil", "1 head garlic, halved crosswise", "10 ounces Parmesan rinds, enclosed in cheesecloth or muslin", "1 lemon, rind peeled into thick strips with a vegetable peeler, then halved and juiced", "8 sprigs fresh thyme", "1/2 teaspoon red-pepper flakes", "1 pound hearty greens (such as escarole, kale, mustard greens or rapini), stemmed and torn into bite-size pieces", "Kosher salt and black pepper", "2 (15-ounce) cans white beans (such as Great Northern or cannellini) or chickpeas, drained and rinsed", "Freshly grated Parmesan, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the Parmesan broth: In a large pot, heat 2 tablespoons olive oil over medium-high. Add the garlic, cut-sides down, and cook until golden brown, 2 to 3 minutes. Add the Parmesan rinds, lemon rinds, thyme and 8 cups water and bring to a boil. Reduce heat to a simmer and cook, uncovered, until the broth tastes full and rich and is reduced by half, 1 to 1 1/2 hours. (You will have about 4 cups of broth.) Reserve half the garlic and half the lemon rinds, then strain the broth. Season to taste with salt and pepper. (Once cool, the broth will keep for 1 week refrigerated or 3 months in the freezer. If freezing, leave a bit of space between the broth and the lid of the container, as the broth will expand.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the soup: Squeeze the garlic cloves to release them from the reserved head. Finely chop the reserved lemon rind. In a large pot, heat the remaining 2 tablespoons olive oil over medium-low. Add the garlic cloves and the red-pepper flakes and cook, breaking up the garlic with your spoon, just until fragrant, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat to medium, add the greens and 1/4 teaspoon of the chopped lemon rind and a pinch each of salt and pepper. Cook, stirring, until the greens are wilted, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans and all of the Parmesan broth and bring to a boil. Reduce the heat to a simmer, cover, and cook until the greens are silky and the beans and broth are warmed through, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and taste. Stir in lemon juice and additional lemon rind to taste. (You will not use all the lemon.) Season to taste with salt and pepper. Serve with black pepper and grated Parmesan on top."}]}