{"@context": "http://schema.org", "@type": "Recipe", "name": "Rainbow Cake", "description": "This Technicolor cake is a project, but one you can pull off with a little elbow grease and lots of butter (nine sticks, to be exact). Most rainbow cakes call for coloring the individual layers of cake batter, but here, the frosting is tinted, creating an impressive rainbow inside each slice. The batter uses egg whites for a light, fluffy, just-sweet-enough layer cake, while the leftover egg yolks in the frosting make it smooth and creamy. We’ve included instructions for making the ombré and piped versions of the cake below, but you’ll need to make an extra half-batch of frosting for the piped version. A standard mixer cannot accommodate more than one batch of frosting at a time, so you’ll need to make the half-batch separately, then combine them before coloring and frosting.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2019/05/30/dining/ejm-rainbow-cake-sliced/ejm-rainbow-cake-sliced-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "One 9-inch cake", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "dessert, egg, flour, food coloring, milk, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 331}, "recipeIngredient": ["Nonstick cooking spray", "3 2/3 cups/465 grams all-purpose flour, plus more for dusting the pans", "1 tablespoon baking powder", "1 teaspoon fine sea salt", "8 large egg whites, at room temperature (reserve the egg yolks for the frosting)", "1 1/4 cups/300 milliliters whole milk, at room temperature", "2 1/2 cups/505 grams granulated sugar", "3/4 cup/180 milliliters vegetable oil", "1/2 cup/115 grams unsalted butter (1 stick), at room temperature", "1 tablespoon vanilla extract", "2 cups/480 milliliters whole milk", "1 1/2 cups/300 grams granulated sugar", "1/4 cup/30 grams cornstarch", "Pinch of fine sea salt", "8 large egg yolks, at room temperature", "8 sticks/905 grams unsalted butter, at room temperature", "1 tablespoon vanilla extract", "Red, orange, yellow, green, blue and purple food coloring paste or gel (See Tip 1)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Lightly grease three 9-inch round cake pans with nonstick cooking spray, then add a couple tablespoons of flour to each pan. Shake and rotate each pan until the flour fully coats the inside. Discard the excess flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the 3 2/3 cups flour with the baking powder and salt to combine. In a separate medium bowl, whisk the egg whites vigorously until lightly foamy, about 1 minute. Add the milk and whisk to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the paddle attachment, cream the sugar, oil and butter on medium speed until light and fluffy, 4 to 5 minutes, scraping down the sides as needed. Reduce the speed to low. Add the vanilla extract and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a quarter of the flour mixture to the bowl and mix on low speed until combined. Add a third of the egg white mixture and mix until combined. Continue to add the dry and wet ingredients, alternating until both are fully incorporated and the batter is smooth, scraping the sides as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the batter evenly among the three cake pans. (You’ll want about 2 1/3 cups/575 to 600 grams of batter in each pan.) Spread the batter in each pan into an even layer. Bake until the surface is evenly golden brown, the cake appears to have pulled away from the pan at the top edges and the center of the cake springs back gently when touched, 30 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cakes bake, make the frosting: In a medium saucepan over medium heat, combine the milk with 1/2 cup/100 grams granulated sugar, stirring occasionally, until the mixture comes to a simmer. Meanwhile, whisk the remaining 1 cup/200 grams granulated sugar with the cornstarch and salt in a large bowl until combined. Add the egg yolks and whisk until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour about 1 cup of the hot milk into the yolk mixture and whisk to combine. Add the yolk mixture to the saucepan and whisk to combine. Reduce the heat to low. Cook, stirring constantly with a silicone spatula, until it thickens enough to coat the back of the spatula, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the mixture through a fine-mesh sieve into a medium heat-safe bowl. Cover the surface directly with plastic wrap or a wet paper towel and refrigerate until no longer warm, about 1 hour. If making the piped version, make a separate half-batch of the custard now (see Tip 2)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cakes are baked, cool them in the pan for 10 minutes, then invert them onto a cooling rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the custard has cooled, finish the frosting: Transfer the custard to the bowl of an electric mixer fitted with the whip attachment, and beat on medium speed until smooth, about 1 minute. With the mixer running and a splash guard attached or a kitchen towel draped over your mixer to contain splashes, add the butter about 2 tablespoons at a time, mixing until the butter is combined between each addition, about 20 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the speed to medium-high. The mixture may look uneven and lumpy, but keep whipping until it becomes silky smooth and lightens in color, 5 to 7 minutes. Add the vanilla and mix to combine. (If making the piped version, finish the extra half batch of frosting now. Combine batches before dividing, coloring and frosting.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a serrated knife to slice each cake horizontally into two even rounds to form six cake layers: Place the first cake on a cake decorating turntable or flat plate. Use the knife to cut into the cake by holding the knife horizontally with the sharp side facing the cake, halfway up the side of the cake. Lightly cut into the cake by slicing into the outer perimeter of the cake all the way around, rotating the turntable or plate as you score it. Once you’ve created a marker around the outside of the cake as a visual guideline, continue rotating and moving the knife deeper into the cake to divide the cake into two even layers. Repeat with the other two cakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Evenly divide the frosting into six bowls (you should have about 1 1/4 cups each). Use food coloring gel or paste to color the frosting red, orange, yellow, green, blue and purple. Start with a few drops and add more as needed. Mix thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one cake round on the cake decorating turntable or flat plate, use a pastry brush to brush away any extra crumbs that have collected before frosting. Scrape about 1/3 cup red frosting on top of the cake layer, in the center, and use a medium offset spatula to spread it into an even layer, spreading it all the way to the edge of the cake. Wipe the spatula clean. Top with another layer of cake, bottom-side up, then scrape about 1/3 cup orange frosting on top of the cake layer, in the center, and spread into an even layer. Continue this process, spreading three more cake layers with 1/3 cup of the yellow, green and blue frostings and wiping the spatula clean after each application. Top with the final cake layer, bottom-side up. (You’ll use the purple frosting later.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a clean offset spatula around the sides of the cake to flatten the edge and smooth out excess frosting between layers that has leaked out on the sides. Refrigerate for 20 minutes to help the frosting set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Starting at the bottom of the cake, use a small offset spatula to apply a 1-inch thick stripe of red frosting. Wipe the spatula clean and repeat this process just above the red frosting with the orange frosting. Repeat, wiping the spatula clean between each application, with the yellow frosting, green and blue. The blue should be at the top edge of the cake and around the outer edge of the top surface of the cake. Cover the remaining top of the cake with the purple frosting. (If making the piped version, refer to Tip 3.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Hold a clean spatula horizontally flush against the top surface of the cake and slowly rotate the cake to smooth the surface. Clean the spatula and do the same to the sides of the cake, holding the spatula vertically. The colors will blend together to create an ombré effect. Add extra frosting to fix smudges and smooth the surface again. If desired, chill another 15 minutes before serving (this will make it easier to slice)."}], "link": "https://cooking.nytimes.com/recipes/1020257-rainbow-cake"}