{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Sheet Cake With Cinnamon Cream Cheese Frosting", "description": "This lightly spiced apple cake comes together in no time at all, and a few swoops of fluffy cinnamon cream cheese frosting dress it up for dessert. As written, this recipe yields a modest amount of frosting, so frosting lovers may want to double the recipe. Make sure to use fresh cinnamon for this recipe (and all of your fall baking) to get the best results.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2019/11/07/dining/ya-apple-cake/merlin_163287141_2011433c-fd6d-49bc-9227-43f98930b936-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "12 servings (one 9-by-13-inch cake)", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "applesauce, cardamom, cinnamon, clove, cream cheese, ginger, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 433}, "recipeIngredient": ["Unsalted butter, for greasing the pan", "2 cups/255 grams all-purpose flour, plus more for preparing the pan", "3/4 cup/165 grams light brown sugar", "2 large eggs", "2 cups/480 milliliters unsweetened applesauce", "3/4 cup/180 milliliters neutral oil, such as canola or grapeseed", "2 teaspoons ground cinnamon", "1 teaspoon ground cardamom", "1 teaspoon ground ginger", "1/4 teaspoon ground cloves", "3/4 teaspoon kosher salt", "1 teaspoon baking powder", "1 teaspoon baking soda", "8 ounces/230 grams cream cheese, at room temperature", "1/4 cup/65 grams unsalted butter (1/2 stick), at room temperature", "1 tablespoon ground cinnamon", "1 cup/100 grams confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake: Heat oven to 350 degrees and set a rack in the center. Butter and flour a 9-by-13-inch glass or light colored metal baking pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together the light brown sugar and eggs until pale and foamy. Add the applesauce, oil, spices and salt. Whisk to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the 2 cups flour, baking powder and baking soda, and whisk until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan, smooth the top, and firmly tap the pan on a countertop a few times to release air bubbles. Bake the cake until golden and puffed, and a tester inserted into the center comes out clean, 30 to 40 minutes. Cool the cake in the pan on a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cake is cool, make the frosting: Add the cream cheese, butter and cinnamon to the bowl of a stand mixer fitted with the paddle attachment. Mix on medium-high until smooth, stopping the mixer occasionally to scrape the bottom and sides of the bowl. Turn the speed to low, and slowly add the confectioners’ sugar. Mix until the sugar is moistened, then turn the speed up to medium-high and whip until smooth and fluffy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the frosting over the cooled cake and serve. Store any leftovers in the refrigerator, covered, for up to 3 days."}], "link": "https://cooking.nytimes.com/recipes/1020589-apple-sheet-cake-with-cinnamon-cream-cheese-frosting"}