{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto Marseille-Style", "description": "This recipe incorporates the components of a bouillabaisse into a risotto. The broth used to gradually soften the rice is seasoned with saffron, fennel and garlic, as it would be for the Marseillaise fish stew. The garlic mayonnaise, aioli, adds a finishing touch of sleek richness. As for the specifics of the seafood, I’ve used mussels, scallops, monkfish and shrimp, the last added at the very end to avoid overcooking. In place of monkfish you might consider halibut, tilefish or Alaskan black cod; clams could replace the mussels, and chunks of lobster could also be added. But salmon does not belong in this crowd.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2019/12/25/dining/19pairrex1/merlin_166104600_4eae3afd-7466-4afb-b9ac-b9d9d842dbec-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "grains and rice, seafood", "keywords": "arborio rice, dry white wine, fennel, mayonnaise, monkfish, mussels, sea scallop, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "recipeIngredient": ["1 cup dry white wine", "24 mussels", "3 cups fish stock", "1 tablespoon saffron threads", "2 tablespoons lemon juice", "Salt", "3 large garlic cloves, minced (about 2 1/2 teaspoons)", "1 teaspoon Espelette pepper or hot paprika, or more to taste", "1/2 cup mayonnaise, homemade or store-bought", "2 tablespoons extra-virgin olive oil", "1 cup finely minced fennel bulb", "1 cup Arborio rice", "1 tablespoon tomato paste", "1/2 pound monkfish, in 8 slices", "12 sea scallops, trimmed and quartered", "16 medium shrimp, preferably wild, peeled and deveined"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1/2 cup wine in a 2-quart saucepan, add the mussels, bring to a simmer and cover, leaving the lid slightly ajar. Steam the mussels until they open, about 4 minutes. Remove the mussels with a slotted spoon to a bowl. Add the fish stock and saffron to the mussel liquid in the saucepan and bring to a simmer. Stir in 1 tablespoon lemon juice, season with salt, remove from heat and set aside. Shuck the mussels and place meat in a dish, covered. Discard the shells."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix 3/4 teaspoon garlic, the remaining tablespoon lemon juice and 1/2 teaspoon of the Espelette pepper into the mayonnaise. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil on medium in a 4-quart sauté pan. Add the remaining 1 1/2 teaspoons garlic and the fennel to the pan and cook on medium-low until the fennel is soft but not brown, 5 minutes or so. Add the rice and cook, stirring, a few minutes, until the rice becomes opaque. Add the remaining 1/2 cup wine, the tomato paste and the remaining 1/2 teaspoon Espelette. Stir and cook on medium until the liquid is absorbed, a few minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the fish stock mixture into a 2-quart saucepan and bring barely to a simmer. Add 1/2 cup of the stock, stirring, to the rice; when it has been absorbed, add another half cup. Continue adding stock until there’s only about 1/2 cup left and the rice is nearly tender, 15 minutes or so. If you need more liquid you can add a little water. Season to taste with salt and more Espelette if desired. Fold in the mussels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining stock and tuck the monkfish and scallops into the rice. Stir gently and cook for about 3 minutes until the fish and scallops are nearly cooked through. Tuck in the shrimp. Cook another minute or so, until the shrimp are just done. Remove from heat. Check seasoning. Divide the risotto among 4 soup plates or dinner plates. Top each with a dollop of garlic mayonnaise and serve."}], "link": "https://cooking.nytimes.com/recipes/1020687-risotto-marseille-style"}