{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Pot Pasta With Ricotta and Lemon", "description": "This elegant, bright pasta dish comes together in about the same amount of time it takes to boil noodles and heat up a jar of store-bought marinara. The no-cook sauce is a 50-50 mix of ricotta and Parmesan, with the zest and juice of one lemon thrown in. That’s it. To make it more filling, add peas, asparagus or spinach in the last few minutes of the pasta boiling, or stir in fresh arugula or watercress with the sauce in Step 3. It’s a weeknight and for-company keeper any way you stir it.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2020/03/21/dining/11as-pasta-with-ricotta-and-lemon/merlin_155855151_a42a72df-8230-420d-b9b9-d81fe089ff55-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, lunch, weekday, pastas", "keywords": "lemon, parmesan, pasta, ricotta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 3231}, "recipeIngredient": ["Kosher salt", "1 pound short, ribbed pasta, like gemelli or penne", "1 cup whole-milk ricotta (8 ounces)", "1 cup freshly grated Parmesan or pecorino (2 ounces), plus more for serving", "1 tablespoon freshly grated lemon zest plus 1/4 cup lemon juice (from 1 to 2 lemons)", "Black pepper", "Red-pepper flakes, for serving", "1/4 cup thinly sliced or torn basil leaves, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Add the pasta and cook according to package instructions until al dente. Reserve 1 cup pasta cooking water, then drain the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pot, make the sauce: Add the ricotta, Parmesan, lemon zest and juice, 1/2 teaspoon salt and 1/2 teaspoon pepper and stir until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/2 cup pasta water to the sauce and stir until smooth. Add the pasta and continue to stir vigorously until the noodles are well coated. Add more pasta water as needed for a smooth sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the pasta among bowls and top with some of the sauce that’s pooled at the bottom of the pot. Garnish with grated Parmesan, black pepper, red-pepper flakes and basil, if using."}]}