{"@context": "http://schema.org", "@type": "Recipe", "name": "Cherry-Lemon Cream Jell-O Mold", "description": "This jiggly, layered mold holds a base of clear crimson (sweet cherry) and a topping of ivory white (tangy lemon mixed with sour cream). If you have extra time, you could make it into four layers, producing red and ivory stripes. Garnished with shiny green leaves like bay or holly, it looks especially festive, and is also quite delicious. Swapping out some of the water in the Jell-O formula for ingredients like sour cream and cherry juice gives this dessert its bright taste.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2019/11/27/dining/25moldsrex/merlin_164466384_88b76c64-aaa5-4e72-afad-f174cf5b3b28-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "parfaits and trifles", "keywords": "black cherry jell-o, cherry juice, lemon jell-o, sour cream, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 137}, "recipeIngredient": ["1 large (6-ounce) package lemon Jell-O", "4 cups boiling water", "1 (16-ounce) container sour cream", "Neutral cooking spray", "2 large (6-ounce) packages black cherry Jell-O, or use plain cherry or cranberry Jell-O", "1 quart sweet or tart cherry juice, or use cranberry juice (opt for less cloudy varieties)", "Fresh holly sprigs, bay leaves or edible flowers, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour lemon mix into a medium bowl and add 2 cups boiling water. Stir until dissolved, then let cool until warm but not steaming hot, about 10 minutes. Gradually whisk in sour cream until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spray a 10- or 12-cup mold or Bundt pan, preferably nonstick, very lightly with neutral cooking spray. Blot any extra oil with paper towels. Pour in lemon-sour cream mixture and refrigerate until set, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 15 minutes before lemon-sour cream mixture has set, pour cherry mix into a large bowl and add 2 cups boiling water. Stir until dissolved, then stir in cherry or cranberry juice. Make sure mixture has cooled to lukewarm at most before proceeding."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When lemon-sour cream mixture is set, gently ladle the cherry mixture over it. Don’t pour it on top, as the mixture breaks easily. Refrigerate again until completely set, at least 3 hours or overnight. (If you want to create multiple thinner layers of Jell-O, as seen in the picture here, instead of just one layer of each flavor, see Note.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to unmold, run the tip of a sharp knife around the edge of the pan to break the seal. Dip the bottom half of the mold in warm (not hot) water for 15 seconds. Place a serving plate over the top and flip to unmold. (If the mold doesn’t come out immediately, don’t shake it; try the warm water treatment again, 15 seconds at a time, until it comes out. If you leave the mold in the water for a longer time, it may start to melt.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, garnish, then slice, using a sharp knife and wiping the blade between slices."}], "link": "https://cooking.nytimes.com/recipes/1020644-cherry-lemon-cream-jell-o-mold"}