{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick-Broiled Pork Chops With Peanuts and Gochujang", "description": "<i>This is a no-recipe recipe, a recipe without an ingredients list or steps. It invites you to improvise in the kitchen.</i>\nHere’s a nice Wednesday-night meal. Secure the thinnest chops you can find at the store — that’s crucial for the quick-broil part. Throw a few handfuls of dry-roasted peanuts in a pan set over medium-high heat with a glug of sesame oil. Let those go until they’re fragrant and just beginning to darken, then take them off the heat and toss with a few shakes of chile powder. Set the peanuts aside and heat your broiler. Line a sheet pan with foil, and oil it lightly. Salt and pepper your chops, lay them out on the pan, and slide them into the oven. Cook the chops for around four minutes, then flip them over to finish. Meanwhile, mix a tablespoon or so of gochujang, the Korean red-pepper paste, with a healthy splash of orange juice and a wisp of mirin. Taste. Adjust. Pour into a deep serving dish or platter. When the chops are well crusted and brown, slide them into the sauce for a toss. Top with the peanuts and some chopped scallions if you have any. Rice on the side.\n\n<i>Sam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. <a href=\"https://www.nytimes.com/newsletters/cooking\">Sign up to receive it.</a> You can find more no-recipe recipes <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/14326423-no-recipe-recipes\">here</a>.</i>", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/02/17/dining/17NORECIPE-GOCHUJANG-PORK-CHOPS/17NORECIPE-GOCHUJANG-PORK-CHOPS-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "dinner, weekday, meat", "keywords": "gochujang, mirin, pork chops, sesame oil, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 211}, "recipeIngredient": [], "recipeInstructions": null, "link": "https://cooking.nytimes.com/recipes/1020000-quick-broiled-pork-chops-with-peanuts-and-gochujang"}