{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Granola", "description": "Studded with pink freeze-dried strawberries and lightly spiced, this strawberry granola makes for a perky start to the day or a fruity afternoon snack, especially when paired with yogurt or milk. First, roast oats, almonds, pumpkin seeds and coconut chips in a sweet syrup before mixing with crisp freeze-dried strawberries. Optional red-pepper flakes add a pleasant whisper of warmth, and play well with the strawberries and coconut. Feel free to substitute cashews or hazelnuts for the almonds, and omit the coconut chips if you don’t have them in the pantry. The resulting granola will still be full of flavor and crunch.", "author": {"@type": "Person", "name": "Daniela Galarza"}, "image": "https://static01.nyt.com/images/2020/04/03/dining/dg-strawberry-granola/merlin_171207453_4fc3e59e-f2af-4820-9606-9ae3b35cc77d-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "3 to 4 cups", "recipeCuisine": "american", "recipeCategory": "breakfast, grains and rice", "keywords": "almonds, coconut, oats, old-fashioned rolled oats, strawberry", "aggregateRating": null, "recipeIngredient": ["2 cups/200 grams rolled, old-fashioned (not quick-cooking) oats", "3/4 cup/100 grams raw or roasted almonds, hazelnuts or cashews, roughly chopped", "3/4 cup/40 grams unsweetened, raw coconut chips (optional)", "1/2 cup/70 grams raw pepitas (shelled pumpkin seeds)", "1/4 cup/70 grams honey", "1/4 cup/40 grams coconut sugar, packed light or dark brown sugar or granulated sugar", "1/4 cup/60 milliliters coconut oil or olive oil", "1/8 to 1/4 teaspoon red-pepper flakes (optional)", "3/4 teaspoon kosher salt", "1 cup/20 grams freeze-dried strawberries (optional)", "Strawberry jam and yogurt, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 300 degrees and set one rack in the middle of the oven. Line a large baking sheet with parchment paper and set aside. In a large bowl, mix together oats, almonds, coconut chips (if using) and pepitas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine honey and sugar. Stir over medium heat until mixture starts to simmer and sugar dissolves, 1 to 2 minutes; turn off heat. Stir in coconut oil, red-pepper flakes and salt. (If coconut oil is solid, allow it to fully melt.) Fold warm liquid mixture into oat mixture until well combined. Spread oat mixture evenly on the lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake granola on the middle rack for 15 minutes. Remove the baking sheet from the oven, leaving the oven on, and stir granola to redistribute any bits along the edge into the center and vice versa. Bake until oats, nuts and coconut chips are deeply toasted and have a light sheen, an additional 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let granola cool on tray, at least 1 hour. Stir in freeze-dried strawberries, which will break up a bit as you mix them in. (Makes 5 cups.) Serve granola over yogurt and jam, if desired. Granola keeps, in an airtight container, for 2 weeks at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1020980-strawberry-granola"}