{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken and Escarole Salad With Anchovy Croutons", "description": "Think of this salad as an umami-charged version of a classic Caesar. The central difference is that the egg yolk, which is typically emulsified into a creamy dressing, is plopped directly onto the lettuces, leaving you to break it and let it mingle with the salty, garlicky, lemony dressing, which is bolstered with a bit of soy sauce. (If the whole, raw egg yolks freak you out, swap them for jammy soft-boiled eggs or crispy fried eggs.) The true reason to make this salad, though, is that it’s adorned with chicken-fat-laced anchovy croutons, made in the oven while the chicken finishes cooking. They are worth the price of admission.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/03/20/dining/15Romanrex/merlin_152005611_30054f65-d1f3-4dc8-bb61-5bfdc58f0ecc-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, poultry, salads and dressings", "keywords": "anchovy, chicken, crusty bread, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 178}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 544, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "6 grams", "proteinContent": "37 grams", "saturatedFatContent": "7 grams", "sodiumContent": "981 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 pounds bone-in, skin-on chicken breasts or thighs", "Kosher salt and black pepper", "6 tablespoons olive oil, plus more as needed", "4 anchovy fillets, plus more if you like", "1/4 loaf of crusty bread, torn into 1-inch pieces (about 2 cups)", "1 garlic clove, finely grated", "1/4 cup fresh lemon juice, plus more as needed", "1 tablespoon soy sauce", "1 large head escarole or 2 heads romaine lettuce, torn into large pieces", "1 cup parsley, tender leaves and stems", "Pecorino or Parmesan, for shaving", "4 large egg yolks (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Season chicken with salt and pepper. Heat 1 tablespoon olive oil in a large skillet (preferably cast-iron) over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chicken, skin-side down, and cook without moving until the pieces are golden brown and crispy, 5 to 8 minutes. Flip the chicken and continue to cook until well browned on the other side, another 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Move the chicken to one side of the skillet and tilt the skillet a little so that the fat and drippings pool on one side. Add the anchovies and let them sizzle a bit to melt down. Add the croutons, along with 2 tablespoons olive oil. Season with salt and pepper and toss them to coat in the anchovy-chicken fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the skillet in the oven and roast until the chicken is cooked through and croutons are golden brown and crispy, 12 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, whisk the grated garlic, lemon juice and soy sauce in a small bowl and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place escarole and parsley in a large bowl or on a platter and dress with lemon-garlic mixture. Season with salt, pepper and more lemon juice if you like. Drizzle with remaining 2 tablespoons olive oil and shave some pecorino over the whole thing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken from the oven and let it rest a minute or two. Cut the meat off the bone and thinly slice. Place on top of the salad, along with the croutons. Top each serving with an egg yolk, if using, and more anchovies, if you like."}], "link": "https://cooking.nytimes.com/recipes/1020089-chicken-and-escarole-salad-with-anchovy-croutons"}