{"@context": "http://schema.org", "@type": "Recipe", "name": "Maple-Walnut Blondies", "description": "An autumnal riff on classic blondies, these are a treat for the true maple fanatic. Adding maple syrup to the batter and toasting the walnuts in maple syrup gives the blondies double the maple flavor, while a splash of bourbon in the batter mellows the sweetness. Make sure to underbake these slightly: The key to moist, chewy blondies is to take them out just before they’re fully baked. Refrigerate the blondies for optimal chewiness; they're especially good straight from the fridge.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2019/10/10/dining/lh-maple-blondies/lh-maple-blondies-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "9 servings", "recipeCuisine": "", "recipeCategory": "cakes, cookies and bars", "keywords": "bourbon, maple syrup, vanilla, walnut, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 262}, "recipeIngredient": ["1/2 cup/115 grams unsalted butter (1 stick), melted, plus more for greasing the pan", "3/4 cup/165 grams light brown sugar, lightly packed", "2 tablespoons maple syrup", "1 large egg", "1 1/2 teaspoons vanilla extract", "1 teaspoon bourbon (optional)", "1 cup/130 grams all-purpose flour", "1/2 teaspoon kosher salt, plus more to taste", "1/4 teaspoon baking powder", "Pinch of ground nutmeg", "1/2 cup/50 grams walnuts or pecans", "1 tablespoon maple syrup", "Pinch of kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Grease an 8-by-8-inch pan with butter and line with parchment paper, leaving overhang on two sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the optional maple nuts: In a small sauté pan, heat the walnuts, 1 tablespoon maple syrup and a pinch of salt over medium heat. Cook, tossing often, until the nuts are lightly toasted and the bottom of the pan looks dry, about 3 to 4 minutes. Transfer the walnuts to a cutting board to cool, roughly chop, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the 1/2 cup butter, brown sugar, 2 tablespoons maple syrup, egg, vanilla and bourbon, if using, and whisk until smooth. Add the flour, salt, baking powder and nutmeg, and stir with a wooden spoon until just combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the batter to the prepared pan and smooth with a spatula. Sprinkle the walnuts, if using, evenly on top. Bake for 21 to 23 minutes, until the bars are just starting to brown at the edges. They should seem slightly underbaked and will firm up as they cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the blondies lightly with salt, allow to cool to room temperature in the pan. When completely cool, remove from the pan using the parchment paper, then cut into squares and serve."}]}