{"@context": "http://schema.org", "@type": "Recipe", "name": "S’mores Blondies", "description": "These messy-in-a-good-way blondies capture the essence of s’mores — toasted marshmallows, gooey chocolate, malty graham cracker flavor — in a home oven. The blondie base replaces some of the flour with graham cracker crumbs, and is studded with large chunks of chocolate and marshmallow. Use chopped bar chocolate rather than chocolate chips, which contain stabilizers and don’t fully melt (though substituting chips will still result in a delicious blondie). As the blondies finish baking, they’re topped with a layer of marshmallows and another round of chocolate; messy and delicious, just like the real thing.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2019/07/02/dining/em-smores-blondies/em-smores-blondies-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "12 blondies", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars", "keywords": "bittersweet chocolate, butter, graham cracker, marshmallow, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 703}, "recipeIngredient": ["Nonstick spray", "9 whole graham crackers (about 135 grams), or store-bought graham cracker crumbs (about 1 cup)", "1 1/4 cups/160 grams all-purpose flour", "1 1/4 teaspoons baking powder", "1 teaspoon fine sea salt", "1 cup/225 grams unsalted butter (2 sticks), at room temperature", "1 packed cup/220 grams dark brown sugar", "1/2 cup/100 grams granulated sugar", "2 large eggs, at room temperature", "1 tablespoon vanilla extract", "8 ounces/225 grams bittersweet chocolate, coarsely chopped into chunks", "2 1/2 cups/150 grams mini marshmallows"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and arrange oven racks in the upper and lower thirds of the oven. Coat the inside of a 9-by-13-inch pan with nonstick spray and line it with parchment paper, leaving 2 inches of excess parchment on the long sides of the pan. (The excess will help you pull the blondies out later.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using whole graham crackers, add them to the bowl of a food processor and pulse until they form a fine powder. Alternately, you could put the crackers in a large resealable plastic bag and crush them using a rolling pin, then add them to the bowl. If using store-bought crumbs, add them directly to the food processor. Add the flour, baking powder and salt to the crumbs, and pulse a few times to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the paddle attachment, cream the butter, brown sugar and granulated sugar on medium speed until light and fluffy, 4 to 5 minutes. Add the eggs one at a time and mix on medium speed until well incorporated, scraping the sides of the bowl after each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vanilla and mix to combine. Turn the mixer to low and add the graham crumb mixture and mix just to combine. Add about ¾ of the chocolate to the mixer and mix to incorporate. Transfer the dough to the prepared pan. Use damp hands to press the dough into an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake on the lower rack until the bars are golden at the edges and the surface has a crackly appearance, 30 to 32 minutes. Remove the pan from the oven and sprinkle the marshmallows evenly over the surface. Return the pan to the top rack of the oven and bake until the marshmallows have softened and begun to turn golden brown, 6 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the oven. If any of the marshmallows have puffed up, use a toothpick or skewer to puncture them; they will deflate easily. Sprinkle the reserved chocolate on top of the marshmallows and return the pan to the top rack of the oven. Bake until the chocolate is melted and gooey, and the marshmallows are lightly toasted, about 2 minutes. Transfer the pan to a wire rack and let cool, 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a thin knife, slide the blade between the blondies and the pan on the short sides of the pan, then use the parchment sling to carefully remove the blondies. Let cool another 10 minutes, then slice into 12 even pieces and serve."}], "link": "https://cooking.nytimes.com/recipes/1020331-smores-blondies"}