{"@context": "http://schema.org", "@type": "Recipe", "name": "Neapolitan Pasta With Swordfish", "description": "The lusty foods and intense wines of southern Italy provide inspiration to spare for cooks and connoisseurs. San Marzano tomatoes, fresh mozzarella, succulent olives, tender pastas and fragrant olive oils, alone or combined, spell sheer enjoyment. The roots of red-sauce Italian, ever popular in the United States, are in the south — in Campania and Naples (its capital city) as well as in Puglia and Basilicata. This recipe is a riff on the traditional pasta alla puttanesca, with tomato, capers, olives and garlic, but without the anchovies. The recipe goes bigger on the fish front, with chunks of seared swordfish to bolster the mixture with meaty, briny notes.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2019/03/20/dining/14pairrex1/14pairrex1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "fish, pasta, tomatoes, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 72}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 524, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "4 grams", "proteinContent": "29 grams", "saturatedFatContent": "3 grams", "sodiumContent": "568 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons extra virgin olive oil", "1 1/4 pounds swordfish steaks, skin removed, in 3/4-inch cubes", "Salt and ground black pepper", "3 tablespoons capers in vinegar or salt, large ones if possible, rinsed and dried", "2 tablespoons thinly sliced garlic", "1 1/2 cups canned San Marzano tomatoes, chopped", "18 pitted Kalamata olives", "1 pound short pasta like casarecce, cavatelli, strozzapreti or penne", "Grated zest of 1 lemon", "1 tablespoon minced flat-leaf parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large sauté pan (4 quarts or more) on high heat, add 3 tablespoons of the oil and when it’s mighty hot (a piece of fish should sizzle) add the swordfish, spreading the pieces around in the pan in a single layer. Sear about 30 seconds until just starting to brown. Use a spatula to turn the fish, and cook another minute or so. Season with salt and pepper and remove to a bowl. Reduce heat to medium."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another tablespoon of the oil and the capers and cook a couple of minutes until the capers start to crisp and brown. Turn the heat to low, stir in the garlic and cook for a couple of minutes until it barely starts to color. Add the tomatoes and olives. Cook gently, stirring occasionally, for about 10 minutes to combine the flavors, then turn off the heat. While the tomatoes are simmering bring a pot of well-salted water to a boil for the pasta. Cook the pasta until it’s al dente. Remove 1 cup of pasta water, then drain the pasta and add it to the sauté pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat the pasta in the sauce on medium-low heat, folding everything together with a big spoon. Add a half cup or more of the pasta water to give the tomatoes a nice saucelike consistency, stirring until the pasta is well coated. Gently fold in the swordfish and the lemon zest, and stir until you have everything well mixed and heated through. Add more pepper if you wish; the mixture is not likely to demand salt. Transfer to a warm serving dish, scatter parsley on top and serve."}], "link": "https://cooking.nytimes.com/recipes/1020086-neapolitan-pasta-with-swordfish"}