{"@context": "http://schema.org", "@type": "Recipe", "name": "Lane Cake", "description": "This version of the classic Southern cake takes all of fruitcake’s best elements — bourbon-soaked dried fruit, toasty pecans and shredded coconut — and weaves them into a rich, custardy filling set between three layers of tender vanilla cake. It’s a special occasion dessert and a nightcap, all rolled into one. Acetate strips (see Tip) are useful for holding the layers in place while assembling, but if sourcing this tool is too much of a bother, use parchment or follow the instructions to assemble the cake without the strips. The flavor of this cake improves with time, so allow a few hours — or even a few days — before slicing and enjoying.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2019/12/12/dining/yk-lane-cake/yk-lane-cake-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "snack, cakes", "keywords": "bourbon, butter, cake flour, currants, pecans, shredded coconut, unsweetened coconut flakes, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "recipeIngredient": ["1 cup/225 grams unsalted butter (2 sticks), at room temperature, plus more for greasing", "2 1/4 cups/450 grams granulated sugar", "6 egg whites, at room temperature", "1 teaspoon vanilla extract", "2 3/4 cups/355 grams cake flour, sifted", "2 1/2 teaspoons baking powder", "1 1/4 teaspoons kosher salt", "1 cup/240 milliliters whole milk", "1 cup/225 grams unsalted butter (2 sticks)", "1 1/3 cups/270 grams granulated sugar", "14 egg yolks", "1 1/2 teaspoons kosher salt", "2 cups/135 grams finely shredded unsweetened coconut", "1 1/4 cups/200 grams currants", "1 cup/100 grams pecans, chopped", "1/2 cup/120 milliliters bourbon", "1/2 cup/100 grams granulated sugar", "2 tablespoons bourbon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Heat the oven to 325 degrees. Lightly grease the bottom and sides of an 13-by-18-inch baking sheet and line the bottom with a sheet of parchment. Cut 2 strips of acetate, each about 3 inches wide and 26 inches long. Set aside. (These will be used to help assemble the cake in Step 10.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, cream the butter and sugar on medium-high speed until light and fluffy, 3 to 4 minutes. In a small bowl, combine the egg whites and vanilla extract. Reduce speed to medium, then pour the egg mixture into the creamed butter in three additions, beating to incorporate after each and scraping the bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the cake flour, baking powder and kosher salt. Add the flour mixture all at once into the creamed butter and stir on low speed until just combined. Add the milk; use a rubber spatula or wooden spoon to fold in the milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour batter into the prepared pan and bake until cake is a pale golden brown and the surface is springy to the touch, 35 to 40 minutes. Allow the cake to cool completely before using. (The uncut cake can be made up to 1 day ahead, wrapped tightly in plastic or stored frozen for up to 2 weeks.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a large saucepan, melt the butter over low heat. Turn off the heat and stir in the sugar, yolks and salt. Whisk together to fully incorporate. Turn the heat back on low and, stirring continuously, cook to 155 degrees or until the mixture thickens and turns a slightly more pale yellow, 6 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the heat. Add the coconut, currants, pecans and bourbon, and fold them in using a rubber spatula. Let the filling cool completely. (Filling can be made ahead and stored refrigerated for up to 2 weeks.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the bourbon soak: In a small saucepan, combine the sugar with 1/2 cup/120 milliliters water and bring to a boil over medium heat. Stir until sugar dissolves, remove from heat and add the bourbon; set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the cake: Run an offset spatula along the sides of the cake to loosen the edges. Place a piece of parchment over the top and unmold the cake by flipping it upside-down onto a baking rack or large cutting board. Peel off and discard the parchment layer on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Orienting the cake vertically and starting with an 8-inch metal cake ring on the top left corner, punch out a full circle for the top layer. Move the ring to the bottom left corner and punch out the second layer. Move the cake ring to the top right corner of the cake, punch out a half circle and repeat the half circle on the bottom right corner. These half circles will form your bottom layer. (If you don’t have a cake ring, use a closed 8-inch springform pan without the bottom as a guide, and cut out the cake layers with a paring knife.) Reserve the leftover cake to fill in any gaps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe the cake ring clean. Place a 9-inch cardboard cake circle on a cake stand or plate and place the metal cake ring or a closed springform pan without the bottom on top. Line the inside of the cake ring with one of the acetate strips. Spread a tablespoon of filling around the middle of the cake board. (This will help the cake stick to the surface.) Move the cake half-circles to the inside of the cake ring, pushing them to the outer edges of the ring, and fill any gaps with cake scraps. Press down on any scraps to create a snug, flat layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the bottom layer with the bourbon soak. Using a large spoon or an ice cream scoop, add three to four dollops of the filling, about 1 cup total. Spread evenly with the back of an offset spatula. If the entire layer is not covered and spread to the edges, add more filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently move the second cake layer and slide it into the ring. Press down gently on the cake layer to make sure it sits firmly on top of the filling. Brush the cake with simple syrup and cover with filling, repeating the process above."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Guide a second acetate strip between the cake ring and the top 1/4 inch of the first strip, allowing slight overlap. Together, the rings should be about 5 to 6 inches tall. This will support the top layers of the cake when finished. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the third cake layer and press down into the filling to set. Brush your third layer with simple syrup and top with remaining filling. (If assembling the cake without acetate strips, once all the cake layers are in place, run the flat side of your offset spatula around the outside of the layer above the cake ring to create a smooth finish.) Cover with a sheet of plastic wrap and allow to sit at room temperature until ready to serve. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, slide the cake ring upward and remove it. Peel off the acetate layers and discard. (To remove the cake ring without acetate strips, remove the plastic film and run a warm knife or spatula between the ring and the cake. Slide the metal ring upward to remove.) Using a clean knife, cut the cake into desired number of slices and serve. "}]}