{"@context": "http://schema.org", "@type": "Recipe", "name": "Frozen Melon With Crushed Raspberries and Lime", "description": "Inspired by packed cups of Italian ice, this frozen melon dessert is the best way to enjoy melon (besides eating it fresh). Be sure to season it with enough citrus juice to give some dimension to the melon, which tends to read as simply sweet. Frozen melon can be made two weeks ahead, either scraped or unscraped. (If scraped, store in a resealable plastic container and re-fluff before serving.)", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/08/14/dining/13Romanrex3/merlin_158776299_86e038a2-65e4-48e7-b617-9e254d92b49a-articleLarge.jpg", "totalTime": "PT4H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets, ice dishes", "keywords": "cantaloupe, lime, melon, raspberries, watermelon, dairy-free, vegan, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 44}, "recipeIngredient": ["4 cups/640 grams cut melon, such as cantaloupe, watermelon or charentais, or a mixture (buy it precut, or remove the rind of a whole melon and cut into 2-inch chunks to get 4 cups)", "1/2 cup/120 milliliters fresh lime juice, plus more as needed", "2 tablespoons granulated sugar, plus more as needed", "6 ounces/90 grams raspberries", "1 tablespoon finely grated lime zest", "Sumac (optional)", "Flaky sea salt (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend melon in a food processor or blender until completely smooth; you should have about 4 cups purée. Transfer to a 9-by-4-inch loaf pan (or a shallow baking dish, if you have space for it in your freezer)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/2 cup lime juice and 2 tablespoons sugar and stir to blend; season with more lime juice and sugar, as needed. The mixture should be fairly tart and sweet. (The sweetness dulls once the mixture is frozen, so stay on the sweeter side now.) Place in freezer and let freeze until completely solid, anywhere from 2 to 4 hours, depending on your freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the mixture is frozen, use a spoon or fork to scrape the frozen melon into a fluffy pile of ice. If it becomes soft or melty when scraping, place it in the freezer until it’s solid enough to scrape again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If serving immediately, lightly pack some of the ice into serving glasses or bowls. (If not, transfer the ice to a resealable container and freeze until ready to serve. The frozen melon can be prepared up to 2 weeks ahead; if scraped, it might need a little re-fluffing before serving.) Top each serving with raspberries and use a spoon or fork to crush them into the ice. Top with more ice, followed by a bit of lime zest, and then a little sumac and flaky salt, if using."}], "link": "https://cooking.nytimes.com/recipes/1020392-frozen-melon-with-crushed-raspberries-and-lime"}