{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Chicken and Zucchini With Charred Scallion Salsa", "description": "Baked chicken breasts have a reputation for being dry, but pan-searing bone-in, skin-on breasts before roasting them helps them render their fat. It also forms a protective coating, develops a crisp, deep-golden skin and adds an extra layer of flavor. In this one-pot recipe, zucchini is tossed with the rendered chicken fat, and everything cooks together in the oven. Swap in any seasonal, quick-roasting vegetable for the zucchini, like cherry tomatoes or asparagus, but don’t skip the charred scallion and jalapeño salsa. The zingy lime, grassy herbs and barely there brown sugar really make this dish sing. If cilantro isn’t your thing, basil makes a fine replacement, or try a combination of the two. Alongside? Steamed rice would be nice.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/07/16/dining/ch-chicken-breasts-with-zucchini-and-scallion-salsa/ch-chicken-breasts-with-zucchini-and-scallion-salsa-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry, vegetables", "keywords": "chicken, cilantro, jalapeño, light brown sugar, lime, scallion, zucchini, fall, spring, summer, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 270}, "recipeIngredient": ["4 medium bone-in, skin-on chicken breasts (about 3 to 3 1/2 pounds), at room temperature", "Kosher salt and black pepper", "2 tablespoons canola or grapeseed oil", "1 1/2 pounds zucchini (3 to 4 medium zucchini), quartered lengthwise, then halved crosswise", "1/4 cup fresh lime juice (about 2 limes)", "1 medium jalapeño, thinly sliced, seeded if you prefer", "1 bunch scallions (about 7 or 8 scallions), trimmed and halved crosswise", "1 cup roughly chopped fresh cilantro", "1/4 cup olive oil", "1/2 teaspoon light brown sugar", "Flaky sea salt (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Pat the chicken very dry and season generously all over with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the canola or grapeseed oil in a 12-inch cast-iron pan or other large, ovenproof skillet over medium-high. Once the oil shimmers, add the chicken, skin side down, and cook undisturbed until skin turns golden brown, 5 to 7 minutes. Flip and cook another 5 minutes. Transfer the chicken to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the heat. Add the zucchini and stir to coat in the chicken fat. Season with salt and pepper. Do your best to arrange the zucchini in an even layer (some overlap is O.K.). Place the chicken, skin side up, on top of the zucchini, transfer to the oven and roast until the chicken is cooked through, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the salsa: In a medium bowl, stir together the lime juice and jalapeño; set aside. Heat a large skillet over medium. Add the scallions and cook, tossing frequently, until they begin to brown and char in spots, 4 to 6 minutes. Remove and set aside. When cool enough to touch, finely chop the scallions and toss them with the lime mixture. Stir in the cilantro, olive oil and brown sugar until the sugar dissolves. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken from the oven and transfer to a plate or a cutting board for about 5 minutes. If you want your zucchini more golden, pop it back in the oven while the chicken rests. Slice the chicken, if desired, and return it to the pan or serve it on the bone. Drizzle a few spoonfuls of the salsa over the chicken and season with flaky sea salt, if you’d like. Serve with the remaining salsa at the table."}], "link": "https://cooking.nytimes.com/recipes/1020353-skillet-chicken-and-zucchini-with-charred-scallion-salsa"}