{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Spaghetti and Meatballs", "description": "Using a mixture of uncased sausage and ground beef is the trick to achieving tender, flavorful meatballs without a lot of work or extra ingredients. These three-inch meatballs are oversize, so they can stay moist and tender after cooking for an extended period. This way, they also fit in the slow cooker in one layer, which helps them cook evenly. Choose any kind of turkey sausage you like best; sweet or hot Italian are both great choices. (Pork will work too, but will make the sauce a little oily.) Fear not, the spaghetti is cooked separately, so you can serve these meatballs over any long noodle for a traditional take, or spoon them over polenta or tuck them into hero rolls.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2020/01/30/dining/slow-cooker-meatballs/slow-cooker-meatballs-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "5 to 6 servings", "recipeCuisine": "american, italian", "recipeCategory": "dinner, meat, pastas", "keywords": "basil, bread crumbs, garlic, onion, parmesan, parsley, red wine, sausage, spaghetti, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 163}, "recipeIngredient": ["1/4 cup tomato paste", "3 tablespoons dry red wine", "1 cup panko bread crumbs", "1 cup finely chopped flat-leaf parsley (about 1/2 bunch)", "4 ounces grated Parmesan (1 to 1 1/4 cups), plus more for serving", "1/2 medium onion, coarsely grated (about 1/3 cup)", "2 large eggs, lightly beaten", "2 tablespoons whole milk", "2 garlic cloves, finely chopped", "2 teaspoons red wine vinegar", "1/2 to 1 teaspoon red-pepper flakes", "Kosher salt and black pepper", "1 pound bulk fresh sweet or hot Italian turkey sausage", "1 pound ground beef (10 to 20 percent fat)", "1 (28-ounce) can crushed tomatoes", "2 sprigs fresh basil, plus more for serving", "1 pound dried spaghetti, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 6- to 8-quart slow cooker, whisk together the tomato paste and red wine. In a bowl, stir together the panko, parsley, Parmesan, grated onion, eggs, milk, garlic, vinegar and red-pepper flakes. Season with 3/4 teaspoon salt and a generous amount of black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sausage and ground beef to the panko mixture, and gently mix using your hands just until all the ingredients are uniformly combined. (Don’t overmix, or you’ll end up with tough meatballs.) Form the mixture into 7 (3-inch) gently packed meatballs, and place them in the slow cooker. (They should fit snugly in one layer.) Pour the crushed tomatoes all over the top of the meatballs, then add the basil sprigs to the slow cooker. Cover, and cook on low for 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, cook the spaghetti according to the package directions in boiling, salted water and drain. Increase the slow cooker heat to high. Using a slotted spoon, remove the meatballs to a bowl. Discard the basil sprigs from the sauce. If there is more oil on the surface of the sauce than you’d like, use a ladle to skim it off and discard it. Add the drained pasta to the sauce and toss to coat the pasta evenly. Season to taste with salt and pepper. Add the meatballs back to the slow cooker and stir gently to combine. Serve the spaghetti and meatballs with more grated Parmesan and torn basil leaves for topping."}], "link": "https://cooking.nytimes.com/recipes/1020848-slow-cooker-spaghetti-and-meatballs"}