{"@context": "http://schema.org", "@type": "Recipe", "name": "Zucchini and Egg Tart With Fresh Herbs", "description": "Store-bought puff pastry makes easy work of this colorful tart, adapted from “The Modern Cook’s Year,” a vegetarian cookbook by the British author Anna Jones. When you’re rolling out puff pastry, thin flatbread or any other flattened dough, invert the baking sheet so you can unfurl the dough directly on it without the rim getting in the way of your rolling pin. Then parbake the tart without toppings first so that the base cooks through before it’s slathered with crème fraîche, piled with a mess of vegetables and eggs, and returned to the oven to finish. (You’ll want to bake just until the whites of the eggs start to look glossy and custardy, not firm.) Top with any torn, tender herbs you have on hand, like small parsley sprigs, chives, tarragon or dill, cut into quarters, and serve warm.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/07/31/dining/31food/merlin_152985294_e7de9b23-6bc4-47f5-9ee9-235a87617412-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, pies and tarts", "keywords": "crème fraîche, dijon mustard, eggs, lemon, peas, scallion, zucchini, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 296}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 750, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "4 grams", "proteinContent": "18 grams", "saturatedFatContent": "14 grams", "sodiumContent": "752 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 large eggs", "1 (14-ounce) package frozen puff pastry, thawed", "2 medium zucchini (6 to 7 ounces each), sliced lengthwise into 6 slabs, about 1/4-inch-thick each", "8 scallions, trimmed", "1 tablespoon plus 1 teaspoon extra-virgin olive oil", "Kosher salt and black pepper", "1/3 cup crème fraîche or mascarpone", "1 tablespoon Dijon mustard", "1/2 teaspoon freshly grated lemon zest", "1/3 cup frozen peas, thawed", "Any combination of fresh tarragon, small parsley or dill sprigs, and chopped chives, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Beat one egg in a small bowl for egg wash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On an inverted baking sheet, unfold the puff pastry to lay it out flat. Cut the puff pastry into a 10-by-12-inch rectangle, rolling out and trimming excess as needed. Slice a 3/4-inch strip from the perimeter of the puff pastry from each of the four sides. Brush the remaining puff pastry with the egg wash then prick every few inches of the surface with a fork to prevent puffing. Place the pastry strips along the edge of all four sides to form a border that is raised like the edges of a picture frame, gently pressing to seal. Trim the excess and brush border with egg wash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a second baking sheet, gently toss the zucchini and scallions with 1 tablespoon oil; season with salt and pepper. Transfer both baking sheets to the oven (the sheet holding the puff pastry should still be inverted) and bake until vegetables are softened and pastry is puffed and golden, removing the vegetables after 10 minutes and the puff pastry after 20 to 25 minutes. Press the pastry’s puffed center gently with your fingertips to deflate. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the crème fraîche, mustard and lemon zest in a small bowl and season with salt and pepper. Working within the border, brush the mixture over the pastry. Halve the zucchini crosswise at an angle. Arrange the zucchini and scallions on the surface of the pastry, draping the zucchini on its side and reinforcing with the scallions to create four circular nests to hold the eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crack each of the remaining four eggs into a small cup then transfer to a nest in the puff pastry. In a small bowl, toss the peas with the remaining 1 teaspoon oil and season with salt and pepper. Avoiding the eggs, sprinkle the tart with the peas. Bake until the egg whites are opaque and custardy and yolks are still runny, about 20 minutes. Season the eggs with salt and pepper and top with torn fresh herbs. Cut the tart into quarters and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020143-zucchini-and-egg-tart-with-fresh-herbs"}