{"@context": "http://schema.org", "@type": "Recipe", "name": "Abstract Art Cookies", "description": "Some cookies feature tightly piped designs that require a master draftsman’s talents. That’s not this cookie, which looks best decorated with a looser hand. Here, sugar cookie dough is flavored with rosemary and lemon zest, baked, coated with lemony glaze, and sprinkled with crushed pistachios, freeze-dried raspberries, rose petals and pomegranate seeds. Finally, they are drizzled with a bit of pink glaze, Jackson Pollock-style. Each one looks like a little abstract painting, no special skills needed.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/11/27/dining/ss-abstract-art-cookies/merlin_163734798_dd2a262b-8361-4e31-a860-497effad4ee3-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 2 dozen cookies", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars", "keywords": "confectioners' sugar, pistachio, pomegranate juice, pomegranate seeds, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 287}, "recipeIngredient": ["1 (1-pound/455-gram) box confectioners’ sugar (3 3/4 cups), plus more if needed", "3 tablespoons light corn syrup", "2 teaspoons fresh lemon juice", "3 to 4 tablespoons warm water, plus more as needed", "1 <a href=\"https://cooking.nytimes.com/recipes/1020651\">recipe Basic Sugar Cookies</a>, dough flavored with 1 teaspoon chopped rosemary and zest of 1 lemon, cut into 3-inch squares and cooled", "1/4 cup finely chopped raw (not roasted) pistachios", "2 tablespoons crushed freeze-dried raspberries", "2 tablespoons dried edible rose petals", "1/4 cup pomegranate seeds, blotted dry", "2 teaspoons pomegranate juice", "3 tablespoons confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the glaze: Add box of confectioners’ sugar, corn syrup, lemon juice and 3 tablespoons warm water to a medium bowl. Stir with a fork to combine well, slowly adding water as needed to achieve the desired consistency. You should have 2 cups of glaze. Test the glaze on a cookie as you go: If it doesn’t spread out on its own to a smooth finish within 10 seconds, it is too thick and needs more water. If it runs off the edge of the cookie, it’s too thin and needs more confectioners’ sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let glaze sit, tightly covered until ready to use, stirring occasionally. The glaze will keep for at least a week in a small airtight container like a glass jar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Decorate the cookies: Pour the glaze into a medium bowl. Holding a cookie by the edges, with the top-side down, dip into the glaze, moving the cookie around a bit to make sure the glaze coats the whole surface. Gently shake the cookie from side to side to let the excess drip off."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a small offset spatula to stop the flow of icing, gently scrape the cookie against edge of bowl, and flip the cookie over. Use the spatula to spread the icing to pop any air bubbles, and make sure it goes all the way to the edges. It should quickly smooth out on its own. If not, thin out the glaze a bit until it does. Use your fingers to wipe away any icing on the outside edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place on a cooling rack set over a parchment- or wax paper-lined baking sheet. Coat cookies a few at a time. While the icing is still wet, sprinkle the cookies as desired with the pistachios, raspberries, rose petals and pomegranate seeds. Repeat until all the cookies are coated and decorated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop out 1/4 cup of the remaining cookie glaze and transfer to a small bowl. Add the pomegranate juice and 3 tablespoons confectioners’ sugar (which will thicken it). Using a small spoon, drizzle the pink icing all over the cookies. Let dry completely. Cookies will keep at room temperature in an airtight container for 2 days, or up to 1 week without the pomegranate seeds."}], "link": "https://cooking.nytimes.com/recipes/1020645-abstract-art-cookies"}