{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken, Artichoke and Broccoli Bake With Herb Bread Crumbs", "description": "This one-dish dinner is indeed a casserole — but it’s bright and light, and nearly effortless. Toss canned artichokes with capers, garlic and chicken stock, pour over chicken breasts and broccoli florets, then let the oven do the work. Canned artichokes are the main flavor builder here so opt for the firmer water-packed variety, which hold their shape better during cooking. While the casserole bakes, toast the panko bread crumbs and season them with dill. Serve the chicken with a squeeze of lemon for brightness and a sprinkle of herby bread crumbs for crunch.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2019/04/11/dining/kc-chicken-and-artichoke/merlin_151400640_0b036e33-6417-414c-9055-dff9d5e3713d-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, casseroles, poultry", "keywords": "artichoke hearts, capers, cauliflower, chicken breast, dill, lemon, panko, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 336}, "recipeIngredient": ["4 boneless, skinless chicken breasts (1½ to 2 pounds total)", "1 small head broccoli (about 1 pound), tough stem discarded, head cut into 2-inch florets (about 4 cups)", "5 tablespoons extra-virgin olive oil", "Kosher salt and black pepper", "2 (14-ounce) cans quartered artichoke hearts in water, drained (about 4 cups)", "1/2 cup low-sodium chicken broth", "2 tablespoons drained capers", "2 tablespoons unsalted butter, melted", "5 garlic cloves, thinly sliced", "1/2 cup panko bread crumbs", "2 tablespoons chopped fresh dill", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. In a 3-quart baking dish, combine chicken, broccoli florets and 2 tablespoons oil; season with salt and pepper. Toss to evenly coat, spread broccoli in an even layer and arrange chicken breasts on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine artichokes, broth, capers, butter, garlic and 2 tablespoons oil and season with salt and pepper. Gently toss, then spoon mixture over chicken and broccoli. Bake until chicken is cooked through and artichokes are golden in spots, 30 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small skillet, heat remaining 1 tablespoon oil over medium. Add panko, reduce heat to medium-low and cook, stirring frequently, until golden and crisp, 8 to 10 minutes. Transfer to a bowl to cool, then stir in dill and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide chicken and vegetables among shallow bowls and spoon over some of the pan juices. Squeeze with lemon and top with dill bread crumbs."}], "link": "https://cooking.nytimes.com/recipes/1020175-chicken-artichoke-and-broccoli-bake-with-herb-bread-crumbs"}