{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Pretzel Pie", "description": "This is a wonderful but simple summer pie inspired by strawberry pretzel salad, a popular Southern dessert. The classic recipe consists of a crumbled pretzel crust, a whipped cream cheese and Cool Whip filling, and a top layer of strawberry Jell-O. In this fresher adaptation, crushed pretzels form the foundation of an easy shortbread crust, followed by a fluffy cream filling and a pile of fresh strawberries, omitting the use of gelatin. If you’re making this pie in advance — especially with juicy, height-of-season berries — complete Steps 1 to 3, then cloak the filled crust with plastic wrap and chill up to 24 hours. Just before serving, toss the berries in sugar and pile them on top.", "author": {"@type": "Person", "name": "Jerrelle Guy"}, "image": "https://static01.nyt.com/images/2019/06/26/dining/jg-strawberry-pretzel-pie/merlin_156815769_95060ad1-0724-419f-a1dd-e8affd8d61ee-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "confectioners' sugar, cream cheese, heavy cream, strawberries, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 221}, "recipeIngredient": ["14 tablespoons/200 grams unsalted butter (1¾ sticks), softened, plus more for greasing the pan", "2 cups plus 2 tablespoons/265 grams unsifted confectioners’ sugar", "3 cups/120 grams mini snack pretzels, finely ground", "1 cup/130 grams all-purpose flour", "1 teaspoon baking soda", "1 teaspoon kosher salt", "12 ounces/340 grams cream cheese", "1 1/2 cups/360 milliliters very cold heavy whipping cream", "1 pound/450 grams fresh strawberries, hulled and thinly sliced lengthwise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees and grease the inside of a 9-inch, deep pie dish with butter and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a stand mixer fitted with a paddle attachment, or in a medium bowl using a handheld electric mixer, beat the 14 tablespoons butter, ½ cup confectioners’ sugar, ground pretzels, flour, baking soda and salt on low speed until just combined, then increase the speed to high and continue to beat until you get a soft, cohesive dough. Gather the dough and transfer it to the pie pan. Using your fingers, press the mixture evenly across the bottom and up the sides of the dish. Bake until the crust is slightly puffed and deep golden brown in color, 12 to 15 minutes. Remove from the oven and allow to cool while you make the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the stand mixer with a paddle attachment, or in a large bowl using a handheld electric mixer, beat the cream cheese on high for 1 minute to soften. Turn off the mixer. Add 1½ cups confectioners’ sugar, and continue beating on low speed until combined. Stop to scrape down the sides of the bowl, then beat on high until fluffy, about 2 minutes. If using a stand mixer, switch to the whisk attachment. With the mixer running on low speed, slowly add the heavy whipping cream, a splash at a time, beating well after each addition until the mixture is smooth. Scrape down the sides of the bowl, increase speed to high and beat until billowy and whipped, about 2 more minutes. Transfer to the cooled crust and spread in an even layer. Refrigerate until ready to serve, or chill for 2 hours to allow the pie to firm up for slicing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 2 tablespoons confectioners’ sugar to the sliced strawberries and toss to coat, then pile the strawberries on top of the pie. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020323-strawberry-pretzel-pie"}