{"@context": "http://schema.org", "@type": "Recipe", "name": "Hazelnut, Pear and Cardamom Tart", "description": "This is an elegant alternative to the holiday parade of sugary pies. Cardamom adds a grown-up twist to the classic combination of hazelnut and pear. (Don’t overdo the spice, however, or your dessert will taste more like a cold remedy than a treat.) Cut corners by pressing out the crust, but don’t skip making your own roasted hazelnut meal: The deep, caramel flavor of toasted nuts is worth the labor. Use ripe pears, or poach harder fruit until tender before adding to the tart.", "author": {"@type": "Person", "name": "Clare de Boer"}, "image": "https://static01.nyt.com/images/2019/11/20/dining/15pierex3/merlin_164213457_6ff594f6-f4cd-417b-a4d6-6fc601c380e9-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "One 11-inch tart (about 10 servings)", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "cardamom, crème fraîche, hazelnut, pear, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "recipeIngredient": ["Shortcut Pie Crust (<a href=\"https://cooking.nytimes.com/recipes/1020632-shortcut-pie-crust\">see recipe</a>)", "10 ounces/285 grams whole raw hazelnuts", "2 tablespoons all-purpose flour", "12 cardamom pods", "1 1/4 cups/285 grams unsalted butter (2 1/2 sticks), at room temperature", "1 1/2 cups/300 grams granulated sugar", "3 large eggs", "3 very ripe Anjou or Bartlett pears (about 1 1/2 pounds), each peeled, cored and cut lengthwise into 6 wedges", "Crème fraîche, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the <a href=\"https://cooking.nytimes.com/recipes/1020632\">Shortcut Pie Crust</a> through Step 3."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to make the pie, heat the oven to 350 degrees. Roast the hazelnuts on a baking sheet until evenly browned and skins are loosened, 25 to 30 minutes. While they are still warm, rub them together in a dish towel to remove the skins. Cool the skinned hazelnuts, and then blitz them to a fine meal with the flour in the food processor. Transfer to a medium bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crush the cardamom pods and retrieve the seeds, discarding the pods, then crush the seeds to a fine powder using a mortar and pestle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, cream the butter, granulated sugar and crushed cardamom until pale and fluffy. With the machine running, add eggs one at a time, emulsifying each one fully before adding the next, and scraping down the sides of the bowl as needed. Transfer to the bowl with the hazelnut meal and stir to combine. Chill until firm, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the frangipane chills, shape and bake the crust: Working over an 11-inch fluted tart pan, prepare the Shortcut Pie Crust through Step 4, then chill, at least 30 minutes or up to 2 days. (This can be done ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Bake the chilled crust until just-cooked but not browned, about 15 minutes. (The crust will continue to cook while the tart bakes, so expect it to darken in color when it bakes the second time.) Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop the hazelnut frangipane into the crust. (Don’t try to spread it; it will distribute itself evenly as it cooks.) Nestle the pears into the frangipane, tucking some underneath the frangipane and leaving others on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake on a baking sheet until the frangipane is fully set in the center and the crust is golden brown, 75 to 90 minutes. Cool on a wire rack completely, then remove from the pan and serve with crème fraîche."}], "link": "https://cooking.nytimes.com/recipes/1020611-hazelnut-pear-and-cardamom-tart"}