{"@context": "http://schema.org", "@type": "Recipe", "name": "Bison Pot Roast With Hominy", "description": "The American bison that once roamed the Great Plains were considered sacred animals by the Lakota and other people of the region, and served as a critical food source that was celebrated in ceremonies and honored in prayers. According to numbers published by the United States Fish and Wildlife Service, there were 30 million to 60 million bison in North America in the 1500s. By the end of the 1800s, settlers had decimated the population. In the late 1990s, the number of bison in North America had grown again, to nearly 300,000 animals in public herds and on ranches. It’s exciting we now have access to this vitally important meat. When it’s slowly braised, the lean, mild bison becomes fork tender; hominy brings substance and a subtly sweet, nutty corn flavor. Serve this dish alone or pair it with <a href=\"https://cooking.nytimes.com/recipes/1020558-roasted-turnips-and-winter-squash-with-agave-glaze\">roasted turnips and winter squash</a>. Soaking the hominy overnight before adding it to the pot helps it cook faster, so the dried corn kernels are ready in the same amount of time as the bison. Leftovers are terrific served over corn cakes or folded into tortillas. A small branch of foraged white cedar adds a woodsy note, but juniper berries achieve a similar effect.", "author": {"@type": "Person", "name": "Sean Sherman"}, "image": "https://static01.nyt.com/images/2019/11/06/dining/04NativeAmericanrex1/merlin_163486038_ad181072-2368-4a27-bfe7-8266816d7a4c-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "meat", "keywords": "bison, dandelion greens, hominy, wild white cedar, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "recipeIngredient": ["1 cup dried hominy (see Note)", "1 (3- to 4-pound) bison chuck roast", "Coarse sea salt", "3 tablespoons sunflower oil", "3 to 4 cups bison or vegetable stock", "2 fresh sage sprigs, plus more sage leaves reserved for garnish", "1 (4-inch) branch wild white cedar, or 2 teaspoons dried juniper berries", "1/4 cup light agave nectar", "1 packed cup sliced dandelion greens (or other dark greens, such as spinach or kale)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the hominy to a large bowl and cover with 3 inches of water. Let soak overnight at room temperature. Drain, discarding the soaking liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 250 degrees. Season the bison generously on all sides with 2 tablespoons salt. Heat the oil in a large Dutch oven or heavy pot over medium-high. Add the bison and sear it until browned on all sides, rotating the meat when it releases easily from the pot, about 15 minutes total. Transfer the meat to a plate, then add the drained hominy, stock, sage sprigs, cedar or juniper, and agave to the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a simmer over high heat, scraping the bottom of the pot. Return the meat to the pot, cover, transfer to the oven and bake until the meat is very tender, 3 to 3 1/2 hours, turning over the bison about halfway through. Remove and discard the sage sprigs and cedar, if using. (If using juniper berries, you can discard them, but it’s not necessary: They add surprising flavor and texture when eaten with the meat.) Stir in the greens until wilted. Season the liquid with more salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the meat into 1-inch-thick slabs and divide among shallow bowls. Spoon some of the sauce, hominy and greens over the slices, and garnish with whole or torn sage leaves. "}]}