{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Pot Roast", "description": "A hunk of beef slowly braised in red wine, herbs and garlic makes for a classic pot roast that’s also easily customizable: Add the root vegetables and herbs you like best. The tough chuck roast needs about eight (or more) hours in a slow cooker to become fork tender, but the vegetables are better with a shorter cook time, so add them about four hours after the start. (If this is impossible because you’ll be gone all day, you can add the vegetables in the morning; just make sure you cut them into large chunks and know that the vegetables will be quite soft.) Optional quick-pickled onions add welcome bright flavor and make this simple dish feel special.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2020/01/20/dining/sdg-slow-cooker-pot-roast/merlin_168064500_aefe72a7-0f2e-4ba0-94a5-92e5bdf05743-articleLarge.jpg", "totalTime": "PT8H30M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, meat, roasts", "keywords": "beef, garlic, herbs, onion, red wine, root vegetables, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 94}, "recipeIngredient": ["4 pounds beef chuck roast, cut into 3 chunks", "Kosher salt and black pepper", "2 tablespoons vegetable oil", "7 ounces frozen pearl onions (or 1 yellow or red onion, peeled and cut into wedges)", "6 garlic cloves, smashed and peeled", "1 1/2 cups dry red wine", "1 tablespoon red wine vinegar", "5 fresh woody herb sprigs, such as thyme, sage or rosemary (or 1 teaspoon dried thyme, sage or rosemary)", "1 to 1 1/2 pounds peeled root vegetables, such as a mix of carrots and parsnips, cut into 2-inch chunks", "2 tablespoons unsalted butter, at room temperature (optional)", "2 tablespoons flour (optional)", "1 cup red wine vinegar", "2 tablespoons granulated sugar", "7 ounces frozen pearl onions (or 1 yellow or red onion, peeled and thinly sliced)", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the beef generously all over with about 1 heaping tablespoon salt. Heat the oil in a large skillet over medium-high. Add one chunk of the beef and sear on one side, undisturbed, until deeply browned, 5 minutes. Using tongs, remove the first chunk and place it in a 6- to 8-quart slow cooker. Repeat with the second and third pieces, searing one side and then placing the beef in the slow cooker. (You can certainly brown more than one side of each chunk, but one side is enough to build flavor without spending too much time on this step.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pearl onions and garlic to the skillet. Season lightly with salt and generously with pepper and cook, stirring, until just softened, 3 minutes. Pour in the red wine, vinegar and 1/2 cup water. Scrape up the browned bits with a wooden spoon or spatula and let the mixture come to a bubble. Tip the mixture into the slow cooker, and add the herbs. Cover and cook on low for 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pickled onions, if desired: Bring the vinegar and the sugar to a boil in a small saucepan over high. Add the pearl onions and a generous pinch of salt. Cook, stirring, to dissolve the sugar and warm the onions through, about 1 minute, then remove from heat. Set aside at room temperature to pickle until ready to serve, at least 1 hour. (Ideally, make the pickled onions in the morning, when you prep the dish. You could even make them up to 5 days ahead and store them in a sealed container in the refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the slow cooker, flip the pieces of beef with tongs, and add the root vegetables, pushing them under the liquid. Cover and cook on low until the beef and vegetables are both very tender, an additional 4 to 5 hours. Check to see if the meat is tender by testing it with a fork; it should be juicy and flavorful, and pull apart easily. If the meat is not yet tender, cover and cook another 1 to 2 hours. (The amount of time can depend upon the leanness or fattiness of your cut, or how hot your slow cooker runs.) Using tongs and a slotted spoon, remove the beef and vegetables to a serving platter. Break the beef into large chunks to serve. Drizzle some cooking liquid over the top of the beef and vegetables, and top with drained pickled onions to serve. Discard the remaining cooking liquid or strain it, refrigerate it, discard the fat and freeze the remaining liquid as beef stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’d prefer a thicker gravy, strain the cooking liquid into a medium pot and bring it to a boil over medium-high heat. Meanwhile, combine the butter and flour in a small bowl and knead it together with your fingers until it is uniform, almost like a dough. Once the liquid is boiling, drop the butter-flour mixture into the pot, whisking well to combine. Let it bubble until it is lightly thickened, about 5 minutes, then drizzle some gravy over the pot roast and vegetables, and top with the drained, pickled onions. Serve extra gravy on the side."}]}