{"@context": "http://schema.org", "@type": "Recipe", "name": "Batched Boulevardier", "description": "Some drinks are meant to be made and consumed immediately, others benefit from aging. The Boulevardier — a wintertime <a href=\"https://cooking.nytimes.com/recipes/1020312-classic-negroni\">Negroni</a> that substitutes bourbon for gin — swings both ways. Give this blend of bourbon, Campari and sweet vermouth time to mesh in a tightly sealed bottle in the fridge and the drink’s texture skews softer and more velvety. This batch recipe is lightly diluted, enough to enjoy the drink up, without ice, but not so much that it can’t be enjoyed over ice. One rule to follow: If you’re letting the batch sit for more than two weeks, leave the water out and add it the day you’re serving. Otherwise, marry it all, let it sit and drink as desired — or needed.", "author": {"@type": "Person", "name": "Rebekah Peppler"}, "image": "https://static01.nyt.com/images/2019/12/04/dining/27batchrex1/merlin_164785218_c09c99c9-c332-4076-81df-28eefed38933-articleLarge.jpg", "recipeYield": "6 (4-ounce) drinks", "recipeCuisine": "", "recipeCategory": "cocktails", "keywords": "bourbon, campari, sweet vermouth", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 94}, "recipeIngredient": ["9 ounces bourbon or rye whiskey", "6 ounces Campari", "6 ounces sweet vermouth", "3 ounces filtered water (or up to to 4 1/2 ounces water, if you prefer a more diluted drink)", "Orange peels, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the bourbon, Campari, sweet vermouth and water in a spouted measuring cup or pitcher, or a medium bowl. Pour the cocktail blend, using a funnel if needed, into a 750-milliliter bottle; seal and chill in the refrigerator for at least 2 hours or up to 2 weeks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, pour 4 ounces Boulevardier into a lowball or coupe glass. Holding an orange peel by its long edges, skin facing down into the glass, pinch the peel to release the citrus oils, then add it to the glass and serve."}], "link": "https://cooking.nytimes.com/recipes/1020675-batched-boulevardier"}