{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Summer Vegetables With Tahini Dressing", "description": "Start up the grill for a crowd-pleasing platter of vegetables from the garden or farm stand. Take care to keep the fire medium-hot, so you can cook the vegetables without letting them become scorched or blackened. A bit of char is nice, of course, but don’t try for perfect grill marks. Remove vegetables from the grill when they are just done. They’re topped with a garlicky, lemony tahini dressing that serves as a perfect accompaniment.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/08/14/dining/09Kitch-rex-vegetables1/merlin_158756298_c6995819-97c6-4b86-bfc2-c20d2ea80c09-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "eggplant, red pepper, tahini, tomatoes, zucchini, main course, summer, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 439}, "recipeIngredient": ["1/4 cup tahini, at room temperature and well stirred", "3 tablespoons lemon juice", "Pinch of ground cayenne", "2 garlic cloves, grated or pounded to a paste", "2 tablespoons extra-virgin olive oil", "1 cup plain yogurt (not Greek-style yogurt)", "Kosher salt", "2 medium red onions, peeled", "Extra-virgin olive oil", "Kosher salt and black pepper", "2 ripe red bell peppers or other peppers, such as Corno di Toro", "2 pounds zucchini, yellow summer squash, pattypans or a combination", "2 medium eggplants (or 4 small Japanese eggplants)", "4 small tomatoes", "Paprika or pimentón, for garnish (optional)", "Chopped mint, dill, parsley and cilantro, for garnish", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tahini dressing: Put tahini, lemon juice, cayenne and garlic in a small mixing bowl, and whisk until smooth. Whisk in olive oil, yogurt and a good pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a charcoal or gas grill, or a stovetop grill pan. Heat should be medium-high. Make sure grill racks are clean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut onions crosswise into 1/4-inch slices. Brush lightly with olive oil and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut bell peppers in half lengthwise. Remove stems and seeds, and discard. Cut each half in two, making eight pieces. Brush lightly with olive oil and season with salt and pepper. Transfer to a baking sheet or roasting pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut zucchini and eggplant lengthwise or at an angle into 1/2-inch-thick slices. Brush slices with olive oil on both sides, and season with salt and pepper. Transfer to a baking sheet or roasting pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut tomatoes in half crosswise. Brush lightly with olive oil and season with salt and pepper. Transfer to a baking sheet or roasting pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill onions and peppers (they take longer to cook): Set onion slices carefully on grill so they don’t fall apart. Start peppers skin-side up. Peppers and onions should take 4 to 5 minutes per side. As they are done, remove to a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill zucchini and eggplant for about 3 to 4 minutes per side. Grill tomatoes on one side only, until heated through, about 5 to 6 minutes. As they are done, remove to a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange vegetables in rows on the platter (or use two platters). Serve warm or at room temperature. Just before serving, drizzle tahini sauce over the vegetables. Sprinkle with paprika, if using, and shower with green herbs. Serve lemon wedges on the side."}], "link": "https://cooking.nytimes.com/recipes/1020382-grilled-summer-vegetables-with-tahini-dressing"}