{"@context": "http://schema.org", "@type": "Recipe", "name": "Poilâne’s Corn Sablés", "description": "In her book, “Poilâne, The Secrets of the World-Famous Bread Bakery,” Apollonia Poilâne, who heads the legendary Parisian boulangerie, describes the sweets in her shop as pâtisseries boulangères, bread-bakers’ pastries, which are typically less sweet, less fussy and less fussed over. These corn shortbread-style cookies, known as sablés in French, fit into that category perfectly. They’re made with all-purpose flour and corn flour – corn ground so fine that you can barely feel a bit of grit when you rub a little between your fingers. (Do not use cornmeal or cornstarch.) Baked, the cookies have the characteristic sandiness of sablés and the beautiful golden color of corn. To get the best texture, make sure your butter is soft and creamy. The dough is a pleasure to work with and, because it holds its shape when baked, a good choice for fanciful cutouts. At Poilâne, the cookies are always cut into simple rounds, so that, as Apollonia says, “they look like minisuns.”", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2019/08/25/magazine/25mag-eat/25mag-eat-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 60 cookies", "recipeCuisine": "french", "recipeCategory": "snack, cookies and bars", "keywords": "butter, corn flour, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 194}, "recipeIngredient": ["1/2 cup plus 2 tablespoons/125 grams granulated sugar", "1 large egg plus 1 large egg yolk, at room temperature", "1 cup plus 2 tablespoons/250 grams unsalted butter (2 1/4 sticks), cut into cubes, softened until creamy", "2 cups/240 grams corn flour", "1 3/4 cups plus 2 tablespoons/240 grams all-purpose flour, plus more for rolling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, working with a mixer on medium speed, beat the sugar, egg and egg yolk until pale and creamy, about 2 minutes. Add the butter, and beat until well blended, about 2 minutes. Add the corn flour and all-purpose flour to a medium bowl, and whisk until combined. Reduce the mixer speed to low, add the flour mixture and mix until just incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly flour a work surface, and turn the dough out onto it. Divide the dough in half, and shape into 2 discs. Wrap in plastic, and refrigerate for 30 minutes. (The dough can be frozen for up to 3 months; thaw for at least 3 hours at room temperature before rolling.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two baking sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly flour a work surface and a rolling pin. Working with 1 piece of dough at a time, roll the dough out 1/4-inch thick, reflouring the surface and pin as needed. Cut out 2-inch rounds, and place 1/2 inch apart on the baking sheets. Gather the scraps, reroll and cut out more cookies. Refrigerate the cookies on the baking sheets for 30 minutes before baking. (Alternatively, you can stack the cut-out rounds between sheets of parchment or wax paper, cover and refrigerate; place on baking sheets when you’re ready to bake the cookies.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position racks in the upper and lower thirds of the oven, and heat to 350 degrees. Bake the cookies until the centers are set and the edges are very lightly browned, 17 to 19 minutes. Rotate the pans from top to bottom and front to back halfway through the baking time. Immediately transfer the cookies to a wire rack, and let cool completely. Store the cookies in an airtight container for up to 1 week."}], "link": "https://cooking.nytimes.com/recipes/1020413-poilanes-corn-sables"}