{"@context": "http://schema.org", "@type": "Recipe", "name": "Nanaimo Bars", "description": "The Nanaimo bar is a tremendously sweet, no-bake layered bar cookie from Canada made almost exclusively of packaged ingredients. The buttercream layer gets its yellow hue from custard powder, a vital ingredient that makes this a true Nanaimo bar. Use an offset spatula to give the chocolate top a surface as smooth as freshly Zambonied ice. The novelist Margaret Atwood included this recipe, from the chef Susan Mendelson, in her “Canlit Foodbook,” a fund-raising book that featured food from literature, as well as author recipes. Ms. Atwood prefers walnuts in this recipe, but any combination of walnuts, almonds or pecans will do. We’ve added a smidge more cocoa and the optional addition of salt — but leave it out for the true Nanaimo bar experience.", "author": {"@type": "Person", "name": "Sara Bonisteel"}, "image": "https://static01.nyt.com/images/2019/03/27/dining/22nanaimorex/merlin_150934053_2e941dba-a5b4-4183-a991-8d2eb3428fb8-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "16 bars", "recipeCuisine": "canadian", "recipeCategory": "cookies and bars", "keywords": "coconut, custard powder, graham cracker crumbs, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 495}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 344, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "13 grams", "sodiumContent": "118 milligrams", "sugarContent": "24 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 cup/115 grams unsalted butter (1 stick), cut into pieces", "1/4 cup/50 grams granulated sugar", "1 large egg", "3 tablespoons cocoa powder", "1 teaspoon vanilla extract", "2 cups/235 grams graham cracker crumbs", "1 cup/85 grams unsweetened shredded coconut", "1/2 cup/50 grams finely chopped walnuts, almonds or pecans (or a mixture)", "1/4 cup/60 grams unsalted butter (1/2 stick), at room temperature", "3 tablespoons heavy cream", "2 tablespoons custard powder, such as Bird’s", "2 cups/245 grams confectioners’ (icing) sugar", "4 ounces/115 grams semisweet chocolate, broken into 1/2-inch (1 1/4-centimeter) pieces", "2 tablespoons unsalted butter", "Flaky sea salt, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line an 8-by-8-inch (20-by-20-centimeter) metal baking pan with parchment, allowing parchment to overhang by about 2 inches (5 centimeters) on two sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the base: In a double boiler, or a heatproof bowl placed over a saucepan of boiling water, whisk butter with granulated sugar, egg, cocoa powder and vanilla until melted. Continue whisking until mixture thickens slightly, 1 to 2 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in crumbs, coconut and nuts until the mixture is well combined and resembles wet sand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer mixture to the parchment-lined pan and use your fingers to press it into an even layer. Transfer pan to the refrigerator to chill until firm, at least 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the buttercream: In a stand mixer fitted with a paddle attachment, cream butter on medium speed for about 1 minute. Add heavy cream and custard powder and mix until combined, scraping sides and bottom of the work bowl as needed. Add 1 cup confectioners’ sugar and mix on low until incorporated. Add remaining confectioners’ sugar and mix on low until combined, scraping the bottom of the bowl as needed, then mix on medium-high speed until smooth, light and fluffy, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from refrigerator. Dollop the buttercream on top of the base layer then gently spread it evenly on top using an offset spatula. Transfer pan to the refrigerator to chill until buttercream is set, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the topping: In a small, heavy saucepan or a double boiler, heat the chocolate and butter over low, stirring often, until melted and evenly combined, 2 to 3 minutes. Remove from heat. Take pan from refrigerator and pour chocolate on top of buttercream layer. Working quickly and carefully, spread the chocolate evenly over the buttercream using an offset spatula. Sprinkle with flaky sea salt, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to refrigerator and chill until chocolate hardens, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve the bars: Lift excess parchment to remove Nanaimo square from the pan. Cut into 16 2-inch (5-centimeter) squares. Store bars in the refrigerator until ready to serve. Bring to room temperature before serving. Store remaining bars in the refrigerator for a few days, or wrap well and freeze."}], "link": "https://cooking.nytimes.com/recipes/1020098-nanaimo-bars"}