{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Rice Noodles With Coconut Milk, Peanuts and Lime", "description": "In this breezy recipe, rice noodles are tossed in a creamy-yet-light mix of coconut milk, fish sauce and lime, then garnished with plenty of salty peanuts, chile, lime zest and cilantro. Don’t bother picking the cilantro leaves from the stems; just chop the whole plant until you hit a firm, white stem. The green stems add crunch, and they pack more concentrated flavor than the leaves. Feel free to add whatever fridge stragglers or greenmarket celebrities that look good to you, such as thinly sliced vegetables, poached shrimp, pan-fried tofu, grilled chicken or pork. Because this salad teeters from savory to sweet, even pineapple, green apple or mango would do.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/08/22/dining/as-cold-rice-noodles/merlin_156441138_31323eed-3b53-4c4e-ab4d-c945f5bc3fd6-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "for two, lunch, quick, weekday, noodles", "keywords": "chiles, cilantro, coconut milk, fish sauce, lime, peanut, rice noodles, dairy-free, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 79}, "recipeIngredient": ["8 ounces linguine-style rice noodles", "1 cup full-fat coconut milk, plus more as needed", "1/2 cup finely chopped cilantro leaves and tender stems", "2 Thai chiles, thinly sliced into rounds, or 1 jalapeño, minced", "2 teaspoons fish sauce or soy sauce, plus more as needed", "2 limes", "3/4 cup coarsely chopped roasted, salted peanuts", "Red chile sauce, like sambal or sriracha, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook noodles in a large saucepan of boiling water according to package instructions until tender but still chewy. (They’ll firm up when cool, so you want to cook them to softer than al dente). Drain the noodles in a colander, fill the saucepan with cold water, swish the noodles in the cold water, then drain again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the empty pot, stir together the coconut milk, cilantro, chiles and fish sauce. Zest the limes over the pot, then halve one of the limes and squeeze its juice directly into the pot. Cut the remaining lime into 4 wedges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the noodles in the coconut milk mixture. Taste and adjust seasonings. (The flavor should be coconut-y, lightly sweet and savory. If you can’t taste the coconut, add more milk; if the mixture is too sweet, add more fish sauce.) Serve in bowls with peanuts scattered over top and lime wedges and chile sauce alongside. Spoon any collected coconut milk at the bottom of the pan over the noodles."}], "link": "https://cooking.nytimes.com/recipes/1020422-cold-rice-noodles-with-coconut-milk-peanuts-and-lime"}