{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp Bathed in Olive Oil and Lemon", "description": "A simple but lavish bath of olive oil and lemon juice is the Italian way of showing off superfresh seafood. The key, according to Marcella Hazan, is that the dish should never see the inside of a refrigerator, which changes the texture of the seafood and the flavor of the olive oil. She calls for shrimp in this recipe, but the formula also works with squid, clams and meaty fish fillets.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2019/09/04/dining/30oilrex1/merlin_159456510_4e95acae-f76f-4c74-ad27-a725f2b309c0-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "8 to 10 servings as an appetizer, 4 to 6 servings as an entree", "recipeCuisine": "", "recipeCategory": "brunch, dinner, easy, lunch, quick, snack, weeknight, seafood", "keywords": "appetizer, main course, bread, lemon, olive oil, parsley, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 70}, "recipeIngredient": ["3/4 cup extra-virgin olive oil, plus more as needed", "1/4 cup freshly squeezed lemon juice (from 1 to 2 lemons)", "2 pounds medium-large shrimp (about 26-30 per pound), peeled and deveined (tails optional)", "Flaky sea salt and coarsely ground black pepper", "1 large pinch freshly chopped flat-leaf parsley", "Torn or sliced crusty bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of water to a boil, preferably not too deep, so you can watch the shrimp as they cook. Pour the olive oil and lemon juice into a baking or serving dish, preferably a white one to show off the colors of the finished dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in a few batches to prevent overcooking, boil the shrimp over high until just firm and opaque, 2 to 3 minutes, removing them to a colander with a slotted spoon. When all the shrimp are cooked, transfer them to the olive oil-lemon bath and gently mix to coat. Sprinkle generously with salt and pepper. The shrimp should be just covered with liquid; pour in more oil as needed. Set aside to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, taste and adjust the seasonings with salt and pepper. Sprinkle with parsley and serve with bread, spooning some liquid over each serving."}]}