{"@context": "http://schema.org", "@type": "Recipe", "name": "Indian-ish Baked Potatoes", "description": "Of all the places my mom, who lives in Dallas, has traveled for work, her favorite will always be London — the cobblestone streets, the limitless sights, the walkability and, most important, the pubs. She spent a lot of time in pubs on early '90s London business trips, and the only vegetarian dish was very often a baked potato. This is where she discovered the ingenuity of filling a soft, steamy potato with all kinds of tasty toppings that absorb nicely into the starchy flesh. In this recipe, she subs out the big potato for smaller, thin-skinned ones (for a prettier presentation), and the bacon bits, chives and packaged cheese for spicier, brighter toppings: chiles, chaat masala, onions and ginger. This dish takes almost no time to put together once the potatoes are baked, but looks very impressive as an appetizer or a small side. Tip: Cut the ginger, onion and chiles while the potatoes bake, so everything is ready for assembly.", "author": {"@type": "Person", "name": "Priya Krishna"}, "image": "https://static01.nyt.com/images/2019/04/05/dining/ml-indianish-baked-potatoes/ml-indianish-baked-potatoes-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "american, indian", "recipeCategory": "dinner, easy, snack, finger foods, vegetables", "keywords": "appetizer, side dish, cilantro, new potatoes, potato, sour cream", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 248}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 179, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "5 grams", "sodiumContent": "398 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 pound small new potatoes or baby red potatoes", "Kosher salt", "3/4 cup sour cream", "4 teaspoons minced fresh ginger", "1/2 small red onion, finely diced", "2 small Indian green chiles or Serrano chiles, finely chopped", "2 teaspoons chaat masala", "2 tablespoons chopped fresh cilantro stems and leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Place the potatoes on a baking sheet and bake for 45 minutes, or until they are easily pierced with a fork. Let the potatoes cool until they can be handled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Without cutting all the way through to the bottom, slice each potato lengthwise and crosswise into four sections. Use your hands to push down and pull apart the four sections like a blooming flower. Sprinkle a pinch of salt on top of each potato, followed by a dollop of sour cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Evenly divide the ginger, onion, green chiles, and chaat masala among the potatoes. Make it rain with chopped cilantro and serve."}], "link": "https://cooking.nytimes.com/recipes/1020153-indian-ish-baked-potatoes"}