{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Chicken With Crunchy Seaweed and Potatoes", "description": "Two types of seaweed add flavor and crunch to this otherwise classic golden, roast chicken. A lemon-scented compound butter seasoned with dried red dulse (a mild type of seaweed) adds richness and a mineral, saline character to the bird, which is roasted with kelp and potatoes. As the chicken fat renders, it coats the vegetables, bronzing the potatoes and making the kelp as crisp as seaweed snacks. You do need to plan ahead to source the seaweed and marinate the chicken, but the reward is a robust, one-pan chicken dinner that hits all the right savory notes.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/04/30/dining/30seaweedrex1/merlin_153433002_0626e816-1bca-4493-84ae-2408432d3692-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, poultry, roasts", "keywords": "chicken, kelp, lemon, potato, seaweed, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 14}, "recipeIngredient": ["4 tablespoons unsalted butter, softened", "1 tablespoon red dulse flakes or powder", "1 teaspoon finely grated lemon zest plus 1 teaspoon lemon juice", "1 1/4 teaspoons kosher salt", "1 (3 1/2- to 4-pound) whole chicken, patted dry", "1 small bunch fresh herbs, such as rosemary, thyme or sage", "1 pound baby potatoes, halved, or quartered if large", "1 small red onion, halved and thinly sliced", "2 cups ready-cut (or slaw-cut) kelp seaweed (about 6 ounces), water lightly squeezed out (see Note)", "2 tablespoons extra-virgin olive oil", "Large pinch of red-pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together softened butter, dulse, lemon zest and juice, and 3/4 teaspoon salt. Rub all over chicken, including the cavity, underneath the skin, then on top of the skin. Stuff herb bunch into cavity and transfer chicken to a rimmed baking sheet. Let marinate at least 1 hour or up to overnight in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees and place a rack in the middle. Remove chicken from refrigerator and let sit at room temperature while you prepare vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss together potatoes, onion, kelp, oil, red-pepper flakes and remaining 1/2 teaspoon salt. Spread mixture out surrounding the chicken on the baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast, tossing vegetables every 20 minutes, until chicken is browned and a thermometer inserted into thickest portion of thigh reads 160 degrees, about 1 hour. Remove from oven, transfer chicken to a cutting board and tent loosely with foil for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer roasted vegetables to a serving platter and top with chicken and any remaining juices from baking sheet. Serve immediately."}]}