{"@context": "http://schema.org", "@type": "Recipe", "name": "Tater Tot Casserole", "description": "I first ate this hot dish, a Midwestern favorite, on a late fall evening in the humid kitchen of the cook and television star Molly Yeh, at her farmhouse in Minnesota. The casserole accompanied venison, lefse and talk of the sugar beet harvest outside. I thrilled to the cream-beefy, umami-strong flavors that sat beneath its golden, cobbled exterior, and I loved the way the potatoes soaked up the gravy that pooled below the venison. You could substitute other ground meats for the beef, and other frozen vegetables for the peas or corn, but the tots are mandatory, and I do love the addition of cheese at the end.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2020/03/02/dining/ss-tater-tot-hot-dish/merlin_169778625_cfbd7722-2c0a-42af-a424-f69667f5c0c3-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "dinner, casseroles, vegetables", "keywords": "carrot, cheddar, frozen peas, ground beef, potato, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 395}, "recipeIngredient": ["1/2 cup unsalted butter", "2 carrots, peeled and finely chopped", "2 celery stalks, finely chopped", "1 large white or yellow onion, finely chopped", "Kosher salt and black pepper", "3/4 cup all-purpose flour", "3 cups whole milk", "2 tablespoons chicken, vegetable or beef broth base or bouillon", "2 pounds ground beef (about 15 percent fat)", "9 ounces frozen peas or corn, or a combination", "1 1/2 pounds frozen Tater Tots", "1 cup shredded Cheddar (optional)", "Chopped fresh parsley, for serving (optional)", "Ketchup, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Make the creamed soup: In a large pot, melt 6 tablespoons butter over medium-high heat. Add the carrots, celery, half the onion and a pinch of salt and cook, stirring occasionally, until soft, 12 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the flour and cook for another minute. Add half the milk and cook, stirring, until thickened. Add the remaining milk and cook, stirring, until very thick. Stir in the broth base, and season to taste with salt and pepper. Pour into a heat-safe bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the pot and set it back over medium-high heat. Melt the remaining 2 tablespoons butter, then add the remaining onion and a pinch of salt. Cook, stirring, until soft, 5 to 7 minutes. Add the ground beef and cook, breaking up with a wooden spoon, until browned. Stir in the peas or corn and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, drain and discard any excess liquid from the beef mixture. Transfer half the mixture to a 4-quart casserole dish and spread it out evenly. Spread half the creamed soup mixture on top. (It can be tricky to spread the soup over the beef, but it’s OK if it gets messy and mixes together a little bit.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining beef mixture on top in an even layer, and spread the remaining creamed soup mixture on top. Cover with Tater Tots, sprinkle with another pinch of salt and pepper, then with cheese, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the tots are golden brown and crispy on top, about 45 minutes. Let cool slightly. Sprinkle with parsley and serve with ketchup, if using."}], "link": "https://cooking.nytimes.com/recipes/1020916-tater-tot-casserole"}