{"@context": "http://schema.org", "@type": "Recipe", "name": "Earl Grey Madeleines", "description": "Cédric Grolet, the pastry chef of Le Meurice hotel in Paris, is famous for his Instagram feed, which has nearly a million and a half followers, his tattoos and his title: Best Pastry Chef in the World. Mostly, and most rightly, he’s famous for his elegant pastries, so I was surprised when he asked me if I’d tasted one of his simplest, his madeleines. Small sponge cakes baked in shell-shaped molds (metal pans give you the best color and crust), madeleines are known for the impressive bump that develop on their tops. These madeleines, adapted from a Grolet recipe, are made with brown butter and flavored with Earl Grey tea and honey. Like all madeleines, they benefit from a rest in the refrigerator before they’re baked. (Good for the mads, convenient for the baker.) If you can arrange it, serve the madeleines just minutes out of the oven — it’s when their fragrance and texture are at their peak.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2019/12/08/magazine/08mag-eat/08mag-eat-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "About 20 madeleines", "recipeCuisine": "french", "recipeCategory": "snack, cakes", "keywords": "bergamot, cake flour, earl grey tea, honey, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 360}, "recipeIngredient": ["2 cups/255 grams cake flour, plus more for dusting", "1 tablespoon baking powder", "3 tablespoons full-flavored honey", "1 cup plus 2 tablespoons/255 grams unsalted butter (2 sticks plus 2 tablespoons), plus more for greasing", "3/4 cup plus 1 tablespoon/165 grams granulated sugar", "2 bergamots or Meyer lemons (or 1 lemon and 1 clementine), finely zested", "1 tablespoon loose Earl Grey tea, finely chopped", "3 large eggs plus 1 large egg white, at room temperature", "5 tablespoons/75 milliliters whole milk, slightly warm"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together the flour and baking powder. Put the honey in a medium heatproof bowl, and place a strainer over the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the butter to a boil in a medium saucepan over medium-high heat. As the butter cooks, gently swirl the pan. The butter will foam, then bubble, then turn golden. In 5 to 7 minutes, when the butter browns (it will be the color of hazelnuts, and have that aroma as well), pour it through the strainer onto the honey. Some dark bits will slip through the strainer, and that’s fine! Stir to blend."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk the sugar, zest, tea, eggs and egg white, and milk until combined; whisk 1 or 2 minutes more after the ingredients are blended. Add the flour mixture in three to four additions, whisking the ingredients together gently. You’ll have a thick batter that will fall back on itself in a ribbon. Switch to a spatula, and gradually stir in the warm butter-honey mixture. The batter will have a beautiful sheen. Press a piece of plastic wrap against the surface, and refrigerate the batter for at least 8 hours or up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to bake, center a rack in the oven, and heat it to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter and flour a regular-size madeleine pan (or coat it with nonstick baking spray); do this even if the pan is nonstick. Use a slightly rounded tablespoon of batter to fill each shell. Don’t worry about leveling the batter, as it will even out in the oven. Cover, and refrigerate any remaining batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the madeleines until the cakes are golden and the bumps spring back when gently prodded, 11 to 13 minutes. Unmold immediately by rapping the pan against the counter. Serve now ... or don’t. The madeleines stale quickly, but that just makes them better for dunking. If you’re baking more madeleines, be certain to cool the pan between batches."}]}