{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon-Raspberry Danish With Mascarpone", "description": "This braiding technique looks fancy, but it couldn’t be easier to achieve. The lemon-raspberry-mascarpone filling is pudding-like, which makes it important to weave the dough as tightly as possible to prevent too much leakage (though a little is to be expected). Let the pastry cool completely before glazing and serving. This allows the glaze and the filling to set properly; impatient slicers will be met with a sloppy filling rather than a creamy one.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2019/04/15/dining/em-lemon-raspberry-danish/merlin_153567099_ad485161-a939-4d2d-ae23-c7947e68859b-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "10 servings", "recipeCuisine": "american", "recipeCategory": "breads, pastries", "keywords": "confectioners' sugar, cream cheese, lemon, mascarpone, raspberries, vanilla, yeast, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 127}, "recipeIngredient": ["1 cup/240 milliliters whole milk", "3 cups/385 grams all-purpose flour", "1/4 cup/50 grams granulated sugar", "2 teaspoons instant yeast", "1/2 teaspoon fine sea salt", "1 large egg, at room temperature", "Nonstick spray, as needed", "2 1/2 ounces/70 grams mascarpone cheese (about 1/3 cup)", "2 ounces/55 grams cream cheese, at room temperature", "3/4 cup/90 grams confectioners’ sugar", "1 large egg white", "1/4 cup/70 grams lemon curd", "Zest of 1 lemon (about 1 tablespoon), optional", "1/2 teaspoon vanilla extract", "6 ounces/170 grams fresh raspberries", "1 egg", "1 cup/125 grams confectioners’ sugar", "2 tablespoons lemon juice", "Whole milk, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a small saucepan over low, heat milk until just warm to the touch (about 95 degrees). If needed, let cool to the correct temperature before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the milk heats, in the bowl of an electric mixer fitted with the dough hook, mix the flour, granulated sugar, yeast and salt to combine. Add the warm milk and the egg and mix on low speed until the dough comes together, about 2 minutes. Scrape down the sides of the bowl well, and mix on medium until the dough is very smooth, 4 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a medium bowl lightly greased with nonstick spray, and cover with plastic wrap. Let rise until puffy and doubled in size, 45 minutes to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the dough rises, make the filling: In the bowl of an electric mixer fitted with the whisk attachment, whip the mascarpone and cream cheese on low speed until well combined, about 2 minutes. Add the confectioners’ sugar and mix until well combined, scraping down the sides of the bowl as necessary, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat in the egg white on low speed, then scrape down the sides of the bowl. Add the lemon curd, lemon zest (if using) and vanilla and mix well to combine. Cover with plastic wrap and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the dough has risen, roll it out on a lightly floured surface using a lightly floured rolling pin into a 10-by-15-inch rectangle (about 1/2-inch-thick). Roll the dough around the rolling pin and gently transfer it to a piece of parchment paper that will fit on a baking sheet. Using the tip of a metal spatula, gently mark the dough into even, vertical thirds without cutting all the way through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the filling into the center third of the dough, spreading it in an even layer, leaving the outer thirds of the dough uncovered. Arrange the raspberries evenly on top of the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a bench knife, sharp knife or pastry wheel, cut 1 1/2-inch-wide horizontal strips down one side of the dough, stopping the cut just before you hit the filling. Repeat on the other side, being sure to cut the same number of strips at about the same place (these are the “strands” you'll braid over the filling). Transfer the parchment paper with the dough to a baking sheet to finish the assembly (it can be tricky to move the loaf once braided)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Braid the dough: Fold each strip of dough in toward the center, crisscrossing the filling by alternating one strip from each side. It’s O.K. to stretch the strips slightly if you need to. Continue to cross the strands all the way down the loaf. Pinch the excess dough at the ends together, then fold them under the loaf."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the loaf with greased plastic wrap and let rise until puffy, 30 to 45 minutes. Toward the end of the rise time, heat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make an egg wash: Lightly beat 1 egg and 1 tablespoon water together. Brush the surface of the bread with the egg wash, taking care to get all the nooks and crannies of the braid. Bake until the loaf is deeply golden brown, 30 to 35 minutes. Cool completely on the baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the loaf cools, make the glaze: In a medium bowl, whisk the confectioners’ sugar and lemon juice together to combine. The glaze should be thin enough to brush it onto the loaf. Add milk 1 teaspoon at a time, as needed to thin glaze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the loaf is cool, brush with the glaze until coated. Don’t worry if it pools in some places. Let the glaze set for 15 minutes before slicing and serving."}]}