{"@context": "http://schema.org", "@type": "Recipe", "name": "Peppery Lamb With Shell Beans and Cherry Tomatoes", "description": "One of the great joys of summer cooking is the availability of just-picked green beans, Romano beans and yellow wax beans, as well as tender, creamy fresh shell beans. They make a delicious colorful main-course salad complemented with sweet cherry tomatoes. To accompany it here, boneless lamb leg is coated generously with coarsely ground pepper and coriander, and roasted in the oven or in a covered grill until medium-rare. The peppery lamb pairs beautifully with the salad. Dressed with an assertive vinaigrette, this room-temperature dish is perfect for an al fresco lunch or supper. Use the method as a template for making similar salads all summer long, using other meats (or fish) if you wish. If shell beans are not available, you may substitute cooked dried beans or chickpeas.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/07/24/dining/19kitchrex1/19kitchrex1-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, meat", "keywords": "green beans, lamb, shell beans, tomato, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 31}, "recipeIngredient": ["4 pounds boneless lamb leg (ask for lamb sirloin)", "Kosher salt", "2 tablespoons coarsely crushed black peppercorns", "1 tablespoon coarsely crushed coriander seeds", "2 cups fresh cranberry beans or other fresh shell beans (from about 1 1/2 pounds in the pod)", "1 1/2 pounds young green beans, or a mix of green beans, Romano beans and yellow wax beans, topped and tailed", "1/2 pound cherry tomatoes, preferably of different colors, halved", "Basil leaves, for serving", "Cilantro sprigs, for serving", "2 garlic cloves, minced", "Kosher salt and black pepper", "1 teaspoon chopped anchovy fillets (optional)", "2 teaspoons Dijon mustard", "2 tablespoons red wine vinegar or lemon juice, plus more to taste", "1/2 teaspoon finely chopped thyme or rosemary leaves", "1/4 cup extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the lamb on all sides with salt. Place in a roasting pan and coat with crushed peppercorns and coriander. Set aside for 10 to 15 minutes to allow meat to absorb seasoning. (You may do this up to 2 hours ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put shell beans in a small saucepan and cover with 1 inch of water. Add a teaspoon of salt, bring to a boil, then lower heat and simmer gently for 20 to 25 minutes, until tender. Leave to cool in their cooking liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a larger pot of well-salted water to a boil and cook green beans until firm-tender, 3 to 4 minutes, then remove and spread out on a baking sheet to cool. (If using an assortment of beans, cook each type separately in the same pot. Taste a bean after 2 minutes to gauge doneness. They should be firm but not crunchy.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees, or prepare a grill. Roast lamb, uncovered, for about 30 minutes, until medium-rare or until an internal thermometer reads 125 degrees. If grilling, brown meat over hot coals, then move to the side, cover grill and finish cooking with indirect heat. Remove from heat and let rest for at least 10 minutes before carving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As lamb cooks, make the vinaigrette: In a small bowl, combine garlic, a pinch of salt and pepper, anchovy (if using), mustard, vinegar and thyme. Whisk in oil. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put shell beans, green beans and cherry tomatoes in a large bowl, sprinkle lightly with salt and add vinaigrette. Toss well to coat, then transfer mixture to a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut lamb into 1/8-inch slices and arrange over the top. Garnish with basil leaves and cilantro sprigs. Serve at room temperature."}]}