{"@context": "http://schema.org", "@type": "Recipe", "name": "Egg Salad Sandwiches With Green Olive, Celery and Parsley", "description": "This zesty egg salad has no mayonnaise (but a dab of homemade mayonnaise would be permissible). Use picholine or other tasty green olives (not the bland canned supermarket type) or substitute Italian-style marinated artichoke hearts. You could add a little chopped anchovy and a few capers, too, if so inclined. Served open-face as appetizers, these sandwiches are very pretty, but there’s no reason not to use the filling for a conventional sandwich.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/12/04/dining/02tanisrex-egg/merlin_164993190_66d4d4fd-1d79-4df5-a97b-66d1b63fdad6-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "12 open-face sandwiches", "recipeCuisine": "american", "recipeCategory": "snack, finger foods, sandwiches", "keywords": "appetizer, challah, green olives, hard-boiled egg, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 33}, "recipeIngredient": ["4 large eggs, boiled 9 minutes, chilled in ice water and peeled", "1/4 cup thinly sliced scallions, cut on the diagonal", "1/4 cup thinly sliced celery hearts, with leaves", "Salt and pepper", "1/2 cup roughly chopped green olives", "Pinch of red-pepper flakes", "1/2 cup roughly chopped flat-leaf parsley", "2 to 3 tablespoons extra-virgin olive oil", "6 slices challah bread", "Unsalted butter, at room temperature", "A handful of arugula leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop eggs into large rough pieces and put in a medium bowl. Add scallions and celery and season with salt and pepper. Add olives, red pepper, parsley and olive oil. Toss to combine and mash lightly with a fork to amalgamate. (Combine just before serving to keep the mixture fresh looking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay bread slices on a work surface and butter each generously. Spread 2 or 3 tablespoons egg mixture on each. Top each slice with a few arugula leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut each slice in half diagonally and serve. If desired, cut into bite-size pieces."}]}