{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Chicken and Potatoes With Feta, Lemon and Dill", "description": "In this simple but elegant sheet-pan dinner, chicken thighs and potatoes roast together at a high temperature, coming out crispy and golden. A generous squeeze of lemon juice, along with a scattering of fresh dill and feta cheese, elevates this dish from weeknight meat and potatoes to dinner-party fare. While the chicken will still be delicious if marinated for just 30 minutes, marinating it for several hours will yield the best results.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2019/12/19/dining/lh-chicken-and-potatoes/lh-chicken-and-potatoes-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, one pot, poultry, roasts, vegetables", "keywords": "chicken thighs, dill, feta, lemon juice, oregano, potato, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1116}, "recipeIngredient": ["3 tablespoons olive oil", "2 tablespoons lemon juice (from about half a lemon)", "1 garlic clove, minced", "1/2 teaspoon dried oregano", "Kosher salt and black pepper", "1 1/2 to 2 pounds small bone-in, skin-on chicken thighs (4 to 6 thighs)", "4 small Yukon gold potatoes (about 1 pound), cut into 3/4-inch pieces", "2 ounces feta cheese, crumbled (about 1/2 cup)", "2 tablespoons chopped fresh dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk 2 tablespoons oil with 1 tablespoon lemon juice, the garlic, oregano, 1 teaspoon salt and 1/2 teaspoon pepper. Add the chicken thighs toss to coat. Let the chicken marinate for at least 30 minutes at room temperature, or up to 8 hours, covered, in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. On a sheet pan, drizzle the diced potatoes with the remaining 1 tablespoon oil and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper; toss well and move to one side of the pan. Pat the chicken thighs dry and place them, evenly spaced, on the other side of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast for 15 minutes, toss the potatoes, then return everything to the oven and roast until the chicken is cooked through, the skin is golden brown, and the potatoes are tender, 15 to 25 more minutes, depending on the size of the thighs. If the potatoes are not quite tender, remove the chicken thighs to a plate to rest, and return the potatoes to the oven to roast until tender, another 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken and potatoes on a serving platter, and sprinkle them 1 tablespoon lemon juice. Scatter the feta and dill over the potatoes, sprinkle the whole dish with salt and pepper, and serve hot."}], "link": "https://cooking.nytimes.com/recipes/1020726-sheet-pan-chicken-and-potatoes-with-feta-lemon-and-dill"}