{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked White Beans and Sausage With Sage", "description": "This incredibly easy one-pan dinner is from the cookbook “The Silver Spoon for Children,” with more than 40 traditional recipes adapted from “The Silver Spoon,” a book that appears in many home kitchens in Italy. Older children with some experience can follow this recipe as is, but if you’ve got little ones who want to help, they can stir the sage, beans and apple juice together in a large bowl while the sausages bake, then you can pour the mixture into the hot pan. If you like your beans on the saucy side, add 1/4 cup more apple juice. Serve with buttered crusty rolls and something leafy and green.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2019/03/20/dining/18kidsrex1/18kidsrex1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weeknight, beans, casseroles, sausages", "keywords": "apple juice, cannellini beans, pork sausage, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 289}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 616, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "11 grams", "proteinContent": "33 grams", "saturatedFatContent": "9 grams", "sodiumContent": "879 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 sweet Italian pork sausages (about 1 pound)", "2 whole garlic cloves (do not peel)", "2 teaspoons olive oil", "2 fresh sage leaves", "2 (15-ounce) cans cannellini beans, rinsed and drained", "3/4 cup unsweetened apple juice", "Kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. In a 9-by-13-inch baking dish, prick the sausages all over with a fork. Add the garlic, drizzle with the olive oil and toss to coat. Bake until the sausages start to brown on top, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put on your oven mitts, take the roasting pan out of the oven and set it on a heatproof surface. Using tongs, carefully turn the sausages over. (The sausages will brown on the other side when they go back into the oven.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tear the sage leaves into little pieces and add them to the sausages along with the drained beans and apple juice. Give the bean mixture a stir."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wearing your oven mitts, put the roasting pan back in the oven and bake until the bean mixture is warmed, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put on your oven mitts one last time to remove the roasting pan from the oven. To serve, carefully stir everything together using a wooden spoon, and add a little salt and pepper to taste."}], "link": "https://cooking.nytimes.com/recipes/1020062-baked-white-beans-and-sausage-with-sage"}