{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemony Spinach Soup With Farro", "description": "Hearty enough to serve for dinner, but full of a salad’s worth of vibrant dark-leafed greens, this soup is both satisfyingly and extremely verdant. Puréeing a little potato into the broth adds creaminess and body, while chile and lemon juice make it bright and spicy. If you don’t have farro, you can leave it out, or substitute 2 cups of cooked rice (either brown or white). Farro adds a nice chewy texture and some heft to the bowl, but isn’t strictly necessary.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/01/03/dining/03apperex/03apperex-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, soups and stews, vegetables", "keywords": "cilantro, farro, parsley, spinach, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 640}, "recipeIngredient": ["4 tablespoons unsalted butter or olive oil", "2 leeks, white and light green parts, chopped", "2 celery stalks, diced", "3 garlic cloves, finely chopped", "3 rosemary or thyme branches", "2 bay leaves", "1 pound potatoes, peeled and cut into 1-inch pieces (2 to 3 medium potatoes)", "1 quart chicken or vegetable stock", "1 1/2 teaspoons fine sea salt, plus more as needed", "1/2 teaspoon black pepper", "1 cup farro", "1 pound baby spinach (about 20 cups)", "1 cup cilantro leaves and tender stems (or use dill)", "1 cup parsley leaves and tender stems", "Juice of 1/2 lemon, plus more for serving", "Extra-virgin olive oil", "Flaky sea salt", "Aleppo, Urfa, Turkish or other red-pepper flakes", "Grated Parmesan or pecorino (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter or heat the olive oil in the bottom of a large, heavy-bottomed pot over medium-high heat. Stir in the leeks and celery. Cook, stirring occasionally, until vegetables are tender, about 10 minutes. Stir in the garlic, rosemary and bay leaves; cook 1 minute more. Stir in the potatoes, stock, 2 cups water, 1 1/2 teaspoon salt and 1/2 teaspoon pepper. Bring to a boil; reduce heat to medium and simmer, partly covered, until vegetables are tender, 30 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a medium pot of salted water to a boil. Add farro and cook according to the timing on the package until just tender, about 20 to 30 minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard rosemary branches and bay leaves from the soup pot. Add spinach, cilantro and parsley, and simmer uncovered until very soft, 5 to 8 minutes. Using an immersion blender, purée soup until smooth. (Alternatively, you can purée the soup in batches in a blender or food processor.) If the soup is too thick, add a little water. If it’s too thin, let it simmer uncovered for another few minutes to thicken. Stir in lemon juice and more salt to taste. Stir in farro."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle the soup into bowls and top with a drizzle of olive oil, a few drops of lemon juice, flaky salt, red-pepper flakes and a little grated cheese, if desired."}]}