{"@context": "http://schema.org", "@type": "Recipe", "name": "Corned Beef With Cabbage, Potatoes and Carrots", "description": "Cure beef brisket in a salty, spiced brine and it becomes savory, tangy and aromatic corned beef. Get a corned beef made from flat-cut brisket, if you can, as it will be easier to slice into neat, uniform slabs. (The point cut has more striations of fat and may fall apart when sliced.) Braise the meat until tender, and add the vegetables toward the end of the braising time so they’ll absorb the beef juices and soften until perfectly crisp-tender. Finish the beef with a simple honey-mustard glaze and a quick broil to caramelize, then serve it with more Dijon mustard and beer. (Here are <a href=\"https://cooking.nytimes.com/recipes/1020070-slow-cooker-corned-beef-and-cabbage\">slow cooker</a> and <a href=\"https://cooking.nytimes.com/recipes/1020057-pressure-cooker-corned-beef-and-cabbage\">pressure cooker</a> versions of the recipe.)", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/03/04/dining/sd-corned-beef-and-cabbage/merlin_150865536_1d1583f3-28c5-4c21-96a4-af76ef3def5a-articleLarge.jpg", "totalTime": "PT4H45M", "recipeYield": "4 servings", "recipeCuisine": "american, irish", "recipeCategory": "dinner, lunch, meat, vegetables", "keywords": "cabbage, carrot, corned beef, potato, white wine, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 197}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 972, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "8 grams", "proteinContent": "60 grams", "saturatedFatContent": "18 grams", "sodiumContent": "4684 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 to 3 1/2-pound ready-to-cook corned beef, preferably flat-cut", "1 1/4 cups semi-dry white wine, such as Riesling", "1 pound red or Yukon gold potatoes, cut into 1- to 2-inch pieces", "2 to 3 large carrots (about 1/2 pound), peeled and cut into 1- to 2-inch pieces", "1/2 small head green or savoy cabbage (about 1 pound), core left intact, cut into 4 wedges", "3 tablespoons Dijon mustard, plus more for serving", "2 tablespoons honey", "Flaky sea salt, if necessary", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees. Remove the corned beef from its packaging in the sink and reserve the spice packet. Rinse the beef well under cold running water and pat it dry with paper towels. (If you don’t rinse off the brine, the meat will be too salty.) If there is a substantial fat cap on top of the beef, place the beef on a cutting board and trim most of it, if you’d like. (The fat will not completely render away during cooking.) Be sure to leave at least a thin layer of fat on top, about 1/8- to 1/4-inch thick, to keep the meat moist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the corned beef to a large Dutch oven with the fat cap facing up. Add the wine and the spices from the packet. Cover the pot and transfer to the oven to cook, 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Baste the beef with the cooking liquid. Drop the potatoes and carrots into the liquid surrounding the beef and lay the cabbage wedges on top. Cover and cook until the corned beef and vegetables are tender, 1 to 1 1/2 hours. (A paring knife should slip easily into the beef, but the meat should not be falling apart.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler to high. Stir together the mustard and honey in a small bowl. Remove the corned beef from the pot and put it on a foil-lined sheet pan. Spoon the honey-mustard glaze all over the top and sides of the beef and slide it under the broiler. Cook until the glaze bubbles and caramelizes in spots, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the corned beef rest for 5 to 10 minutes, then slice it against the grain into 1/2-inch slabs. Place the beef slices on the serving platter alongside the vegetables and drizzle everything with a little bit of the cooking liquid. Taste the vegetables, and season them with flaky sea salt, if necessary. (The beef will not need to be seasoned with salt.) Season the beef and vegetables to taste with black pepper. Serve with Dijon mustard."}], "link": "https://cooking.nytimes.com/recipes/1020074-corned-beef-with-cabbage-potatoes-and-carrots"}