{"@context": "http://schema.org", "@type": "Recipe", "name": "Yaki Onigiri (Grilled Japanese Rice Balls) With Pickled Shiitakes", "description": "Onigiri, also known as omusube, are portable snacks, often sold in Japanese convenience stores, which are traditionally stuffed with salty, tangy fillings, then wrapped in seaweed. When grilled, glazed or cooked, they become yaki onigiri. In this version, adapted from “Vegan JapanEasy: Classic and Modern Vegan Japanese Recipes to Cook at Home” by Tim Anderson (Hardie Grant, 2020), a little bit of the pickled shiitake filling goes a long way. (The recipe makes extra, which you can keep refrigerated to add to stir-fries, ramen or even omelets.) You could also stuff these with finely chopped kimchi, Japanese pickles, sautéed greens or nothing at all. Available online or at most Japanese supermarkets, an onigiri mold makes for sleek shaping, but, with a little practice, you could also form the shape by hand, or simply roll the rice between your palms into balls. For hot yaki onigiri, brush them with the miso glaze, which will form a delightful crackly, caramelized crust when broiled.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2020/04/22/dining/22Cookbook-Onigiri/22Cookbook-Onigiri-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 12 onigiri (2 to 4 servings)", "recipeCuisine": "japanese", "recipeCategory": "dinner, lunch, snack, finger foods, grains and rice, project, vegetables, appetizer, main course, side dish", "keywords": "dairy-free, vegan, vegetarian, mirin, miso, miso paste, rice, rice vinegar, shiitake, soy sauce, sushi rice", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 355}, "recipeIngredient": ["24 dried shiitake mushrooms", "1/2 teaspoon Japanese chile flakes, or a pinch of cayenne or red-pepper flakes", "3/4 cup tamari or soy sauce (preferably low sodium)", "1/2 cup mirin", "3 tablespoons rice vinegar", "1 1/2 cups sushi rice (Japanese short-grain rice)", "Neutral oil, for brushing", "Sesame seeds, for garnish (optional)", "1 sheet of nori, cut into small rectangles (optional)", "2 tablespoons red or white miso", "1 tablespoon sesame oil", "2 teaspoons mirin", "2 teaspoons granulated sugar", "2 teaspoons sake or water", "1/2 teaspoon rice vinegar, lime juice or other vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling, if using: Add the shiitakes to a medium saucepan and top with cold water by a couple of inches. Stir to combine. Heat over medium-low just until bubbles start to break the surface. Cover and set aside to rehydrate for about 30 minutes. Once the mushrooms are tender, transfer them to a cutting board and thinly slice. (Save the mushroom stock for another use.) Toss sliced mushrooms with chile flakes, then transfer to a jar or lidded container. Top with soy sauce, mirin and rice vinegar. Cover and refrigerate. Let pickle at least 2 hours to develop flavor. They’re even better after a few days and will keep refrigerated for up to 6 months."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the mushrooms have pickled (if using), prepare the rice: Add the rice to a medium saucepan with a tight-fitting lid. Rinse the grains to remove any excess starch, and cover rice with cold water by 1 or 2 inches. Swish them around with outstretched fingers, then drain the rice, repeating the process three or four times until the water goes from milky to just slightly cloudy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 1 3/4 cups/420 milliliters water into the rinsed, drained rice, and give the rice a stir to distribute evenly. If time permits, let the rice soak for 15 to 30 minutes, which will help the grains cook even more evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the rice over high and bring to a boil, stirring occasionally, about 5 minutes. Once the mixture comes to a boil, cover it with the lid and reduce the heat to low or medium-low. You want a low heat that is still high enough to hear the rice bubbling. You should be able to see some steam escaping from the lid; turn the heat up slightly if necessary. Set a timer for 15 minutes and let it cook, undisturbed. (No peeking, or you’ll lose precious moisture!)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 15 minutes, turn off the heat and gently fluff the rice using chopsticks or a fork. Put the lid back on and let sit for another 5 to 10 minutes to finish cooking in the residual heat. Tip the rice onto a baking sheet to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the rice cooks, prepare the miso sauce, if making hot, glazed yaki onigiri: In a small bowl, whisk together the miso, sesame oil, mirin, sugar, sake and rice vinegar until smooth and sugar has dissolved."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the rice has cooled enough to be handled comfortably, brush a baking sheet lightly with neutral oil, so the onigiri don’t stick, and prepare a bowl of water for rinsing your hand to prevent the rice from sticking. Form your onigiri. If using Japanese onigiri mold, press about 1/3 cup cooked rice in the bottom, press an indentation in the center to stuff with about 2 teaspoons of finely chopped filling, then top with another 1/3 cup layer of rice, pressing down with the top piece of your rice mold. Transfer onigiri to the greased baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If working by hand, you’ll want to grab a large handful of rice, compress the rice into a ball in the palm of your hand, then press the sides to form a triangular shape, flattening it into a triangular patty. (This shaping process requires some finesse, but you can also form rounded balls and simply compress them into pucks.) Transfer to the prepared baking sheet, rinsing your hands as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If stuffing with mushrooms or other fillings, you’ll need only a few finely chopped tablespoons: 1 to 3 teaspoons per onigiri, depending on the size of your rice rolls. Compress the first handful of rice in your palm. Add the filling to the center and fold the rice up the sides. (You want to make sure the filling is just in the center portion. If the rice doesn’t create a seal, the onigiri will fall apart.) Top with another layer of rice and compress on all sides to form onigiri in the desired shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish with sesame seeds and wrap with a small rectangle of nori, if using, and serve immediately. (Onigiri can be prepared 1 day in advance, wrapped in plastic and refrigerated, but should come to room temperature before being consumed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If making yaki onigiri, brush the top of the onigiri with miso sauce. Transfer to the oven and broil until the glaze forms a crust that is golden and lightly browned in spots, rotating if necessary, about 5 minutes. Carefully slip a flat spatula underneath to flip yaki onigiri; brush on the other side and broil until glazed on the second side, another 5 minutes. Garnish as you would onigiri."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1020991-yaki-onigiri-grilled-japanese-rice-balls-with-pickled-shiitakes"}