{"@context": "http://schema.org", "@type": "Recipe", "name": "Ozoni (Mochi Soup)", "description": "People in Japan and the Japanese diaspora hold mochi-making parties in late December, taking turns swinging an enormous mallet, pounding sticky rice in a hollowed-out stump until smooth and stretchy, then shaping it into balls or disks. Some of the mochi is eaten fresh with sweet or savory toppings, and some is offered plain to the spirits. (Stores sell it for anyone too busy to make it.) On New Year’s Day, hardened mochi pieces are reheated and used in ozoni soup. In Kyoto, round vegetables and mochi bob around in a pale miso soup; in Tokyo, rectangular mochi is served in shoyu broth; in Kanazawa, people add multicolored mochi and sweet shrimp to clear dashi; and in Fukui, it’s red miso soup with mochi and nothing else. This recipe, from Corinne Nakagawa Gooden, originates in Hiroshima, and came to Seattle with her grandmother Hisaye Sasaki in the early 1900s.", "author": {"@type": "Person", "name": "Hannah Kirshner"}, "image": "https://static01.nyt.com/images/2019/12/25/dining/25OSECHIREX1/merlin_166104552_102c5350-c7f9-49fe-98b8-e5d5fdf7a0bf-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "japanese", "recipeCategory": "soups and stews", "keywords": "appetizer, main course, chicken, mirin, mizuna, mochi, taro root, yuzus", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 14}, "recipeIngredient": ["1 pound chicken wings, necks, feet or meaty bones", "1 1/2 teaspoons fine sea salt, plus more as needed", "3 tablespoons mirin", "4 golf ball-size or 2 egg-size satoimo (taro root)", "3 ounces mizuna (about 4 cups), roots trimmed and discarded, stems and leaves cut into 2-inch lengths", "8 to 16 (¼-inch-thick) slices Naruto kamaboko (red-and-white spiraled fishcake)", "1 yuzu or Meyer lemon", "8 pieces plain mochi (see Note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chicken stock: Rinse the chicken parts. In a pot, bring the chicken, 1 1/2 teaspoons salt and 2 quarts water to a simmer over medium-high heat. Continue to cook at a low simmer for 30 minutes, reducing the heat as needed to prevent a full boil (which would cloud the broth)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the broth and discard the chicken or reserve the meat for another use. Add the mirin to the broth and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium saucepan of water to a boil. Add the satoimo and blanch until the skin is soft enough to slip off easily, about 3 minutes. Drain the satoimo, then use a spoon to scrape off the skin. Slice the satoimo into ¼-inch-thick rounds, then transfer them to a small saucepan. Add enough of the chicken broth to cover. Bring to a boil over high, then reduce the heat to simmer until soft, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In lacquerware soup bowls or other small bowls, neatly arrange mizuna, satoimo and 1 or 2 slices of Naruto. Peel one or two long strips from the yuzu, then cut the strips very thinly crosswise. In a medium saucepan, reheat the chicken stock. Taste and adjust salt as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, heat the mochi until puffy and soft, for a few minutes in a toaster oven or under the broiler, or 30 seconds on high in a microwave, and add it to the bowls. Immediately ladle about 1/2 cup hot broth into each bowl — before the mochi hardens — and garnish with a pinch of yuzu peel."}], "link": "https://cooking.nytimes.com/recipes/1020736-ozoni-mochi-soup"}