{"@context": "http://schema.org", "@type": "Recipe", "name": "Sausage, Egg and Kale Casserole", "description": "Finding a brunch dish that feeds a crowd can be a challenge, but this large-scale frittata does just that by layering sausage, kale and fontina with cream-thickened eggs. Use any fresh sausage you like (chorizo, merguez, or hot pork sausage work well), and swap in mild Swiss chard or peppery mustard greens in place of the kale. You can prepare this dish the night before serving by cooking through Step 5 and layering the sausage, vegetables and cheese in the baking dish. Let it warm up slightly at room temperature before adding the eggs, then bake as directed. Baking times will vary depending on how cold or warm the dish is, as well as its depth and ingredients, so keep an eye on the eggs; they should be just set in the center.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/04/05/dining/ss-strata/merlin_152985273_5259b810-5694-4ec3-ae03-bf69f2788c01-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, dinner, easy, lunch, weeknight, casseroles", "keywords": "eggs, fontina, kale, sausage, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 405}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 229, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "1 gram", "proteinContent": "11 grams", "saturatedFatContent": "9 grams", "sodiumContent": "330 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Softened butter, for greasing the dish", "6 teaspoons olive oil", "3/4 pound fresh hot sausage, like Italian, chorizo or merguez, casings removed", "1 large red onion (about 12 ounces), halved, then sliced lengthwise into 1/4-inch-thick wedges", "Kosher salt and black pepper", "4 cups torn kale leaves (about 3 ounces)", "10 ounces grape tomatoes, halved crosswise", "3/4 cup diced fontina (about 3 ounces)", "12 large eggs", "3/4 cup heavy cream or milk", "1/2 cup grated Parmesan (about 1 ounce)", "Aleppo pepper, for finishing (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Generously butter a large 2 1/2-quart baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 teaspoons olive oil in a large nonstick skillet over medium. Add sausage and cook, stirring to break it up, until lightly browned, 6 to 8 minutes. Transfer to the baking dish, spreading it in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 teaspoons oil to the skillet and increase heat to medium-high. Add red onion, salt it lightly and cook, stirring frequently, until it starts to take on color, about 8 minutes. Reduce heat to medium-low and continue cooking until softened, 3 to 4 minutes. Transfer to the baking dish and arrange evenly on top of the sausage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 2 teaspoons oil to the skillet and heat over medium. Add kale, season it lightly with salt and pepper, cover and cook, occasionally tossing with tongs until wilted, 2 to 3 minutes. Transfer to the baking dish and arrange evenly on top of the onions. Top with the grape tomatoes and fontina."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the eggs and cream in a large bowl and season generously with salt and pepper. (If making ahead of time, wrap the baking dish and egg mixture separately and refrigerate until needed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the egg mixture over the ingredients in the baking dish, and sprinkle with Parmesan. Bake until the eggs are just set in the middle, 25 to 30 minutes. (Increase the baking time by about 15 minutes if the components were refrigerated ahead of time.)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil until the top is lightly browned, 2 to 3 minutes. Sprinkle with Aleppo, if using."}]}