{"@context": "http://schema.org", "@type": "Recipe", "name": "Five-Spice Roasted Carrots With Toasted Almonds", "description": "A complex combination of fennel seeds, anise, clove, cinnamon and Szechuan peppercorns, five-spice powder is a crucial ingredient in the Chinese pantry that also happens to be deeply versatile. It can be used as a dry rub for roast chicken, tossed with sautéed vegetables or sprinkled over toasted nuts. Here, five-spice powder, along with a bright splash of vinegar and ginger, dresses up simple roasted carrots. Preheating your baking sheet in the oven will help caramelize and crisp your vegetables, and will also speed up cooking time.", "author": {"@type": "Person", "name": "Sue Li"}, "image": "https://static01.nyt.com/images/2019/11/01/dining/sl-roasted-carrots-with-five-spice/merlin_163577592_55f89804-9055-47dd-808b-5ecc311eacb8-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, weeknight, vegetables", "keywords": "almond, carrot, ginger, fall, spring, winter, side dish, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 191}, "recipeIngredient": ["6 tablespoons olive oil", "1 tablespoon five-spice powder", "2 garlic cloves, grated", "Kosher salt", "2 bunches carrots (about 2 pounds), trimmed and scrubbed, halved lengthwise if large", "1/4 cup unsalted, raw almonds", "1/4 cup sliced chives (about 1 small bunch)", "1 to 2 tablespoons sherry vinegar", "2 teaspoons grated fresh ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange one oven rack at the top and one at the bottom of the oven. Place a baking sheet on the bottom rack and heat the oven to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In large bowl, stir together 2 tablespoons olive oil with the five-spice powder, garlic and 1 teaspoon salt. Add the carrots and toss to coat. Transfer carrots to the hot baking sheet and arrange in an even layer and roast, on the bottom rack, until the carrots are tender and browned all over, 20 to 25 minutes, flipping halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While carrots are roasting, toast almonds on a separate baking sheet, on the top rack, until golden brown, 7 to 8 minutes. Allow to cool, then finely chop and transfer to a large bowl or serving platter. Add the chives, vinegar, ginger and remaining olive oil to the almonds, and season with salt. Add roasted carrots and toss to coat. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1020569-five-spice-roasted-carrots-with-toasted-almonds"}