{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Guinness Beef Stew With Horseradish Cream", "description": "This is a thick, rich braise that makes good use of root vegetables. Pick whichever roots you like best; carrots and rutabaga work particularly well together; celery root and parsnips are very nice, too. This is not a toss-it-in-and-go kind of slow cooker recipe: It takes a little time to brown the beef and make a roux-thickened gravy, but those steps build flavor and ensure that you end up with a hearty stew rather than watery soup. Get everything going in the slow cooker — prepare the night before if you have the time — and the stew will be ready the moment you step in the door at suppertime. The horseradish sour cream comes together in minutes and makes a fresh, tangy topping for the mellow stew. (Here are <a href=\"https://cooking.nytimes.com/recipes/1020060-pressure-cooker-guinness-beef-stew-with-horseradish-cream\">pressure cooker</a> and <a href=\"https://cooking.nytimes.com/recipes/1020061-oven-braised-guinness-beef-stew-with-horseradish-cream\">oven</a> versions of the recipe.)", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/02/26/dining/sd-guinness-stew/merlin_151073748_ae3de352-9faa-40af-8354-96a227d20f0f-articleLarge.jpg", "totalTime": "PT8H30M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, soups and stews", "keywords": "beef, guinness, mushroom, potato, root vegetables, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 77}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 936, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "6 grams", "proteinContent": "105 grams", "saturatedFatContent": "13 grams", "sodiumContent": "2002 milligrams", "sugarContent": "10 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 pounds beef chuck, fat trimmed and meat cut into 2-inch cubes", "2 tablespoons plus 1/3 cup all-purpose flour", "Kosher salt and black pepper", "4 tablespoons vegetable oil, plus more as needed", "3 large garlic cloves, chopped", "2 dried shiitake mushrooms, halved (optional)", "2 tablespoons tomato paste", "2 teaspoons packed brown sugar", "1 teaspoon unsweetened cocoa powder", "1 teaspoon onion powder", "1/2 teaspoon caraway seeds", "1/2 teaspoon instant espresso powder", "2 cups Guinness or other stout beer", "2 cups beef broth or stock", "2 fresh thyme sprigs", "1 pound red or Yukon gold potatoes, cut into 1- to 2-inch pieces", "1 to 1 1/2 pounds root vegetables, such as carrots, turnips, rutabaga, celery root or parsnips, peeled and cut into 1- to 2-inch pieces", "1 tablespoon balsamic vinegar", "1 teaspoon Worcestershire sauce", "1 teaspoon lemon juice, plus more to taste", "3/4 cup sour cream", "3 tablespoons jarred horseradish", "1/4 cup minced scallions or chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine the beef and 2 tablespoons flour. Season generously with salt and pepper and toss to coat. In a large skillet or Dutch oven, heat 2 tablespoons vegetable oil over medium-high. Working in batches, add the beef and let it brown on two sides, about 2 minutes per side. Add a bit more oil if the meat sticks. (You can brown it on more than two sides if you have time, but two sides is enough to build flavor and texture.) Transfer the browned beef to a bowl or plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the gravy: Reduce the heat to medium-low and add the remaining 2 tablespoons oil. Add the garlic, dried shiitakes (if using), tomato paste, brown sugar, cocoa, onion powder, caraway seeds and espresso powder. Cook, stirring constantly, until the mixture is fragrant and evenly blended, 1 to 2 minutes. (Reduce the heat to low or remove from the heat temporarily if the bottom of the pan threatens to burn.) Add the remaining 1/3 cup flour and cook, stirring and scraping constantly, until the mixture forms a thick, dry paste, about 1 minute. Add the beer and broth. Increase the heat to high and bring to a boil, whisking constantly to scrape any browned bits off the bottom of the pan. Let it boil until it is smooth and noticeably thickened, about 1 minute. Season with salt and pepper and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beef and any juices, the thyme, potatoes and root vegetables to a 6- to 8-quart slow cooker. Add the gravy and stir to combine. Cover and cook on low until the beef and vegetables are tender, about 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, add the vinegar, Worcestershire sauce and lemon juice. Taste, and season with more salt, pepper and lemon juice, if necessary. (If the stew tastes flat, add more lemon juice first, then more salt and pepper; acid is key to making it taste lively. It may need a surprising amount of salt, especially if you have used unsalted or low-salt stock.) Discard the thyme sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the horseradish sour cream: Stir together the sour cream, horseradish and scallions in a small bowl. Season with salt. Serve stew in low bowls with a spoonful of the horseradish sour cream on top."}]}