{"@context": "http://schema.org", "@type": "Recipe", "name": "Hot Brown", "description": "The Hot Brown was invented in 1926 at the Brown Hotel in Louisville, Ky., by the chef Fred Schmidt. The open-faced turkey sandwich, smothered in Mornay sauce and topped with bacon, was served to customers at late-night  dances, while the band was on its break. The dish has become a Louisville staple, one well suited for Derby Day or after Thanksgiving, when roast turkey is plentiful. Thick slices of bread, sold as Texas Toast in some parts of the United States, do not get lost under the meat and sauce. Hand-carved turkey is best for the dish; deli turkey slices do not deliver the same Hot Brown experience.", "author": {"@type": "Person", "name": "Sara Bonisteel"}, "image": "https://static01.nyt.com/images/2019/04/29/dining/sb-hot-brown/merlin_153389007_463efdc9-d417-443b-b472-dec48a69f660-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, weeknight, casseroles, poultry, sauces and gravies", "keywords": "bacon, bread, pecorino romano, tomato, turkey breast, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 159}, "recipeIngredient": ["1 (8-inch) sandwich loaf (about 20 ounces), cut evenly into 8 slices, crust removed", "2 tomatoes, quartered", "1 pound roasted turkey breast, thickly sliced", "1/4 cup unsalted butter (1/2 stick)", "1/4 cup all-purpose flour", "1 cup heavy cream", "1 cup whole milk", "1/2 cup shredded Pecorino Romano (about 1 1/2 ounces)", "Pinch of ground nutmeg", "Salt and freshly ground pepper", "Shredded Pecorino Romano, for sprinkling", "8 slices crisp cooked bacon", "Chopped parsley, for garnish", "Paprika, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sandwich: Heat oven to 400 degrees. Cut 4 bread slices in half diagonally. Divide the remaining 4 whole slices among four individual 7-by-9-inch (or other similarly sized) baking dishes (see Tip), and place 2 pieces of halved bread on opposite sides of the bread, positioning the longest side of each triangle closest to the whole slice of bread. The formation will look like a two-way arrow. Nestle a piece of tomato on either side of the whole slices of bread, forming a square shape with the bread triangles. Divide the turkey slices among the whole slices of bread. Transfer the casseroles to the oven to toast as you prepare the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the Mornay sauce: Melt the butter in a medium saucepan over medium heat. Whisk in flour until mixture forms a roux. Cook over medium-low heat, whisking frequently, 2 minutes. Whisk heavy cream and milk into the roux and cook over medium until the sauce begins to simmer and thicken, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the sauce from the heat and whisk in 1/2 cup Pecorino Romano until the sauce is smooth. Add nutmeg, salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the dishes from the oven and pour the Mornay sauce over each, smothering the meat, bread and tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle additional Pecorino Romano on top of each dish and broil until the cheese begins to brown and bubble, 4 to 5 minutes, working in batches, if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the broiler and cross 2 slices of bacon over each dish. Sprinkle with parsley and paprika, and serve immediately."}]}