{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta Salad With Summer Tomatoes, Basil and Olive Oil", "description": "This summery dish walks the line between tangy, juicy tomato salad and hearty pasta salad. To make it, ripe tomatoes are marinated with capers, garlic, basil and lots of good olive oil until they almost fall apart, creating a wonderfully soupy dressing for the pasta. Then the pasta is added while still hot to mix; as it cools, it absorbs all the bright flavors. If you can, choose heirloom tomatoes in an array of hues, and serve this in a glass bowl to show it off. Cubes of fresh mozzarella, or bocconcini, make for creamy addition. Add them just before serving, so the heat of the pasta doesn’t melt the cheese.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/06/27/dining/mc-pasta-salad-summer-tomatoes/merlin_157084848_efff9d16-ba65-4e99-9d6d-0daf3b8c1f63-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "pastas, salads and dressings", "keywords": "basil, capers, pasta, tomato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 416}, "recipeIngredient": ["2 pounds very ripe tomatoes, coarsely chopped", "1/4 cup drained capers or sliced olives", "3 garlic cloves, finely grated or mashed to a paste", "Kosher salt, as needed", "1/4 teaspoon black pepper, plus more as needed", "1/2 teaspoon red-pepper flakes", "1 large basil sprig, plus 1/2 cup torn fresh basil leaves", "3 oil-packed anchovy fillets, minced (optional)", "1/2 cup extra-virgin olive oil, plus more for serving", "1 pound short pasta, such as campanelle, fusilli or farfalle"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss together the tomatoes, capers, garlic, 1/2 teaspoon salt, black pepper, red-pepper flakes, the whole basil sprig and anchovies if using. Let sit for 5 minutes, then stir in 1/2 cup oil. Taste and add salt and pepper if needed. The tomatoes should be aggressively seasoned. Let tomatoes marinate for at least 1 hour and preferably 2 to 3."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of heavily salted water to a boil. Add pasta and cook until it is just al dente, usually a minute less than the package instructions. Drain well. Add to bowl with tomatoes while still warm and toss well. Let pasta cool, soaking up the dressing. Let pasta sit at room temperature for at least another hour and up to 6 hours before serving. Or chill for up to 24 hours; bring to room temperature before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, gently fold in torn basil leaves. Top with more olive oil and cracked black pepper before serving."}], "link": "https://cooking.nytimes.com/recipes/1020265-pasta-salad-with-summer-tomatoes-basil-and-olive-oil"}