{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick Pickled Amba", "description": "Adeena Sussman developed this brilliant recipe for amba, the habit-forming, hot and sour salt-cured mango pickle that usually takes several days to prepare. Ms. Sussman, a cookbook author who lives in Tel Aviv, completes the process in just 40 minutes, and adds an unusual ingredient that mimics the flavors of a longer fermentation: fish sauce. Make the quick pickle in the dead of winter with green, unripe mangoes, then use it to brighten up anything from a simple piece of sautéed fish to a bowl of rice and vegetables.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2019/12/01/magazine/01mag-eat/01mag-eat-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 2 1/2 cups", "recipeCuisine": "", "recipeCategory": "condiments, pickles", "keywords": "fish sauce, jalapeño, mango, mustard seed", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 80}, "recipeIngredient": ["1 pound unripe, green-skinned mango (about 1 large or 2 medium)", "1 medium white onion, finely chopped", "1 jalapeño, chopped (seeds included)", "2 tablespoons kosher salt", "3 garlic cloves, chopped", "1 1/2 teaspoons yellow mustard seeds", "1 teaspoon ground turmeric", "1 teaspoon ground fenugreek", "1/2 teaspoon ground cumin", "1/2 teaspoon sweet paprika", "3 tablespoons fresh lemon juice", "1 teaspoon fish sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the mango, and grate the fruit on the large holes of a box grater, directly into a medium saucepan. Add 2 cups water, the onion, jalapeño, salt, garlic, mustard seeds, turmeric, fenugreek, cumin and paprika. Bring to a boil, then reduce heat to medium-low and cook, stirring occasionally, until the mango and onion have softened and the liquid has reduced slightly, about 20 minutes. (If the mangoes aren’t very juicy and the pan starts to dry out before the fruit has softened, add a splash of water so the mixture can cook for the full 20 minutes without burning on the bottom of the pan.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat, let cool slightly, then stir in the lemon juice and fish sauce. Transfer to a blender and purée until smooth and glossy. Chill before serving. Store in an airtight container in the refrigerator for up to 1 month."}]}