{"@context": "http://schema.org", "@type": "Recipe", "name": "Tagliatelle With Prosciutto and Butter", "description": "Like cacio e pepe, this prosciutto-studded pasta — coated in emulsified butter, starchy pasta cooking water and Parmesan — requires repetition to master, but it's not at all difficult. Adapted from Evan Funke’s pasta cookbook, “American Sfoglino,” this dish comes together with just a few ingredients, but you’ll need to work fast: Add the pasta, pasta water and cheese to the butter and prosciutto quickly, then stir vigorously while gently jostling the pan back and forth with the other hand. Serve immediately, as the pasta can lose its luster within minutes as it soaks up the sauce.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/09/18/dining/16cookbooksrex1/16cookbooksrex1-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "2 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, for two, lunch, quick, weekday, pastas", "keywords": "main course, parmigiano-reggiano, prosciutto, tagliatelle", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 412}, "recipeIngredient": ["6 tablespoons unsalted butter", "2 ounces prosciutto, torn into bite-size pieces", "Kosher salt and black pepper", "3/4 pound <a href=\"https://cooking.nytimes.com/recipes/1020465-tagliatelle\">handmade fresh tagliatelle</a> or store-bought tagliatelle", "1/2 cup finely grated Parmigiano-Reggiano, plus additional for garnish if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, melt the butter over medium-high heat until frothy and golden, about 1 minute. Add half the prosciutto in one flat layer. Cook until crisp, 1 to 2 minutes, then transfer cooked prosciutto to a paper towel-lined plate. Repeat with remaining prosciutto, leaving it in the skillet, and remove skillet from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the boiling water lightly with salt. When the salt dissolves, add the tagliatelle and cook until toothsome and slightly undercooked, 2 to 4 minutes or according to package instructions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before your pasta is ready, return the skillet to the heat and warm over medium. Do not drain the pasta, but use a slotted pasta fork or tongs and transfer the cooked pasta directly to the skillet. Working quickly, add 1/2 cup Parmigiano-Reggiano and about 1/4 cup of the pasta cooking water and swirl vigorously to emulsify, jostling the pan at the same time, and cook just until sauce is silky, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the pasta among shallow bowls, sprinkle with pepper and remaining prosciutto and serve immediately, along with additional Parmigiano-Reggiano if desired."}], "link": "https://cooking.nytimes.com/recipes/1020466-tagliatelle-with-prosciutto-and-butter"}