{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Pilaf With Pumpkin, Currants and Pine Nuts", "description": "A well-made rice pilaf may be prepared in advance and reheated, covered, in a medium-hot oven. In Turkey, short-grain Bomba rice is preferred, but you may substitute Arborio, or long-grained white rice if you wish. Be sure to rinse the rice well, which will help the grains to remain separate, not clumped together.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/11/06/dining/01Tanisrex3/merlin_163467660_f45f1263-b2d0-4f2b-8ec6-0946e14bf7e1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, grains and rice", "keywords": "currants, pine nuts, pumpkin, rice, fall, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 89}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "2 cups pumpkin or hard squash, such as butternut, cut into 1/2-inch chunks", "Kosher salt", "1 medium onion, diced", "1/4 cup pine nuts", "1/2 cup currants", "1/2 teaspoon black pepper", "1/2 teaspoon ground allspice", "1/2 teaspoon ground cinnamon", "2 cups Bomba, Arborio or long-grain white rice, rinsed well and drained", "3 cups hot chicken broth or water", "4 tablespoons unsalted butter, cut into chunks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm olive oil in a heavy-bottomed pot with a lid or Dutch oven over medium-high heat. Add pumpkin, season with salt, and cook, stirring, until pumpkin begins to brown, 5 to 8 minutes. Remove and set aside, leaving oil in pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion and cook, stirring, until quite brown, about 5 minutes. Add pine nuts and let them brown a bit. Add currants, pepper, allspice and cinnamon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the rice and cook for 2 minutes more, making sure rice is well coated with oil. Add broth or water and 1 1/2 teaspoons kosher salt and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to a bare simmer. Taste broth and adjust for salt — it should be quite well seasoned. Add reserved pumpkin, cover with a lid, and cook over very low heat until all liquid is absorbed, about 20 minutes. Turn off heat, and let rice steam with lid on for 10 to 15 minutes. Add butter and fluff rice gently with two wooden spoons."}]}