{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken and Rice With Scallion-Ginger Sauce", "description": "Chicken and rice is a favorite combination around the world. This version, an Asian-inspired one-pot meal, coaxes a lot of flavor out of a limited ingredient list. Rinsing rice until the water runs clear helps remove extra starch on the outside of the grains and will make rice less gummy when cooked. The most essential step when cooking rice on the stovetop is to resist the urge to peek under the lid; the telltale sign that the rice is done is when the steam rising from under the lid has subsided. (In the early stages of cooking rice, there may be visible steam escaping the saucepan, but as the moisture is absorbed by the rice, you may notice less steam.)", "author": {"@type": "Person", "name": "Sue Li"}, "image": "https://static01.nyt.com/images/2020/02/19/dining/sl-chicken-and-rice/sl-chicken-and-rice-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "american, asian", "recipeCategory": "dinner, weeknight, grains and rice, one pot, poultry", "keywords": "chicken, chicken breast, jalapeño, rice, rice vinegar, scallion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 328}, "recipeIngredient": ["1 1/2 cups sushi rice (or other short-grain white rice)", "2 cups chicken broth", "1 (3-inch) piece fresh ginger, peeled and grated (about 3 tablespoons)", "4 boneless, skinless chicken breasts (about 2 pounds)", "Kosher salt and pepper", "1/4 cup vegetable oil", "6 scallions, trimmed and thinly sliced", "2 tablespoons unseasoned rice vinegar", "1 jalapeño, halved, seeded, then thinly sliced", "2 teaspoons toasted white sesame seeds", "1 teaspoon sesame oil", "1/2 teaspoon granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place rice in a fine-mesh sieve and rinse under cold water, shaking gently, until the water runs clear. In a medium saucepan, combine rice, broth and 1 tablespoon grated ginger. Season chicken all over with salt and pepper and place on top of rice mixture. Cover and bring mixture to a boil over high. Once mixture comes to a boil, reduce heat to medium-low and simmer until rice is plump, broth is absorbed and chicken is cooked through, 20 to 22 minutes. Turn off heat and let rest, covered, 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium bowl, combine the vegetable oil, scallions, vinegar, jalapeño, sesame seeds, sesame oil, sugar and remaining ginger; season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken from saucepan and slice 1/2-inch thick crosswise. Fluff rice with a fork and divide among bowls. Top with chicken and scallion-ginger sauce."}], "link": "https://cooking.nytimes.com/recipes/1020888-chicken-and-rice-with-scallion-ginger-sauce"}