{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Hamburgers", "description": "We cook a lot of burgers indoors on a fat-slicked iron skillet, and you can do that on a grill as well. (Here’s </span><a href=\"http://cooking.nytimes.com/guides/5-how-to-make-burgers\"><span>our burger guide</span></a><span> for more information and inspiration.) But sometimes you want a smoky grilled burger. For that, a charcoal grill is best, but a gas grill can do the trick, too. Resist the temptation to press down on the burgers with a spatula, which only spews juice and fat on the fire, causing the flames to flare up and the burger to lose flavor. If you feel your burger is cooking too quickly, use the cooler sides of the grill to rest them. And remember: lowering the top on the grill helps cheese melt.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/05/13/dining/13COOKING-BURGER/13COOKING-BURGER-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, lunch, quick, weekday, barbecues, burgers, meat", "keywords": "ground beef, hamburger buns, pepper, salt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 92}, "recipeIngredient": ["1 1/2 pounds ground beef, about 20 percent fat", "Kosher salt and black pepper", "Cheese slices (optional)", "4 hamburger buns, split"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start a charcoal fire or heat a gas grill. (Check out our <a href=\"https://cooking.nytimes.com/guides/7-how-to-grill\">grilling guide</a> for how.) Form the patties into 3/4-inch burgers, being careful not to make them too loose or too large, then make a deep depression in the center of each burger with your thumb. Season both sides of the each burger aggressively with kosher salt and black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place burgers on a hot grill and cook, without moving, for about 3 minutes. Use a spatula to turn the hamburger over. If using cheese, lay slices on the meat. Continue to cook until the burgers are cooked through, about another 3 to 4 minutes for medium-rare. Remove the burgers from the grill and allow to rest for a few minutes while you toast the buns. Top the burgers as you desire."}], "link": "https://cooking.nytimes.com/recipes/1020292-grilled-hamburgers"}