{"@context": "http://schema.org", "@type": "Recipe", "name": "Sloppy Joes", "description": "<em>This is a no-recipe recipe, a recipe without an ingredients list or steps. It invites you to improvise in the kitchen.</em> Put a Dutch oven over medium-high heat on your stove, then add a glug of olive oil and sauté in it a handful of chopped onions, a couple diced ribs of celery, a diced jalapeño and a small diced red pepper. When the mixture is supersoft, add a few cloves of minced garlic and cook for a couple more minutes, then dump a pound and a half of ground beef into the pot — ideally the sort that is 20 percent fat — and stir and sizzle until it is well browned, about 10 minutes. Bring the heat down a bit and add a lot of tomato paste — say 3 tablespoons, maybe 4 — and let it get a little toasty before adding a cup or more of puréed canned tomatoes. Cook that down for a few minutes, then add quite a few glugs of Worcestershire sauce and hot sauce to taste, and continue cooking until the mixture is quite thick, another 15 or 20 minutes. Season to taste and serve on toasted potato buns. I like steamed broccoli on the side, a walk for the dog and bed.\n<em>Sam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. <a href=\"https://www.nytimes.com/newsletters/cooking\">Sign up to receive it.</a> You can find more no-recipe recipes <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/14326423-no-recipe-recipes\">here</a>.</em>", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/02/17/dining/17norecipe-sloppyjoes/merlin_146747004_2de24c83-40fd-435e-a939-1e8c08a9c5f5-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, weekday, sandwiches", "keywords": "canned tomatoes, ground beef, hot sauce, worcestershire sauce, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 491}, "recipeIngredient": [], "recipeInstructions": null, "link": "https://cooking.nytimes.com/recipes/1020028-sloppy-joes"}