{"@context": "http://schema.org", "@type": "Recipe", "name": "Menemen (Turkish Scrambled Eggs With Tomato)", "description": "Menemen, made from eggs, tomatoes, peppers and sometimes onions, is a distinctly Turkish breakfast comfort food. Although a year-round dish, it is especially pleasing in the summer, with really ripe tomatoes from the garden or farmer’s market. Be creative with this dish: Add shallots, chiles, fresh herbs or Aleppo pepper, or treat it as purists do, with only tomatoes and eggs. Cook slowly, stirring infrequently, until the eggs form billowy puffs. You can serve topped with feta cheese or lamb sausage, with any warm flatbread on the side.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2019/08/14/dining/13Menemenrex1/merlin_158856480_0c3a1fa4-dfa0-435b-9311-9714d2f0389d-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "turkish", "recipeCategory": "breakfast", "keywords": "eggs, parsley, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 200}, "recipeIngredient": ["4 tablespoons extra-virgin olive oil", "1 medium white onion (about 10 ounces), peeled and diced", "1/2 teaspoon dried oregano, plus more as needed", "1/4 teaspoon Aleppo pepper, plus more as needed", "Kosher salt and freshly ground black pepper", "1 mild but flavorful long green pepper (such as Turkish carliston, Hungarian banana or Anaheim), stemmed, halved lengthwise, seeded, then diced", "1 cup peeled, chopped fresh heirloom tomato (about 7 ounces) or canned diced San Marzano tomatoes with their juices", "4 large eggs", "1/4 cup chopped fresh parsley, plus 2 tablespoons for garnish", "1 tablespoon unsalted butter (optional)", "Flatbread, toasted or untoasted, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a nonstick medium skillet over medium-high. Add the onion, oregano and Aleppo pepper, season with salt and pepper, and cook, stirring occasionally, until onion is translucent, 7 to 9 minutes. Stir in the green pepper and cook until soft, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the onions and peppers are cooking, purée half the tomatoes in a food processor or blender. Once the onions and peppers are soft, add the remaining chopped tomatoes to the onions and peppers. Crack the eggs into a medium bowl, add the puréed tomatoes and whisk until foamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the mixture in the skillet comes to a simmer, stir in the 1/4 cup parsley and the butter, if using. Reduce heat to low, add the egg mixture on top and cook, stirring occasionally, until the eggs are set but still soft, 3 to 4 minutes. Taste, adding a little more salt, oregano or Aleppo pepper, if needed. Sprinkle with remaining parsley and serve directly from the skillet, with flatbread alongside."}]}