{"@context": "http://schema.org", "@type": "Recipe", "name": "Southern Macaroni and Cheese", "description": "There is macaroni and cheese, and then there is special occasion macaroni and cheese like this one. Unlike most recipes, which start with a roux, this one begins with a milk-and-egg base, which gives the dish an incredibly rich, silky taste. It’s adapted from Millie Peartree, the owner of Millie Peartree Fish Fry & Soul Food restaurant in the Bronx, who has been making this dish since she was a little girl growing up in Georgia. The recipe was passed down in her family for generations, but because of the generous amount of cheese used, the dish was only made for events like Christmas and Thanksgiving. Extra-sharp Cheddar adds tartness and a layer of Colby Jack creates a gooey, molten center. If you can’t find a Colby Jack blend, shredded mozzarella or a Mexican-style blend will work in its place.", "author": {"@type": "Person", "name": "Kiera Wright-Ruiz"}, "image": "https://static01.nyt.com/images/2019/10/02/dining/kwr-mac-and-cheese/merlin_161591055_8827b61f-8325-4cb6-8db2-12a941eacbb0-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "dinner, weeknight, casseroles, noodles, pastas", "keywords": "cheddar, colby cheese, macaroni, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2203}, "recipeIngredient": ["Kosher salt and black pepper", "1 pound elbow macaroni", "2 cups whole milk", "2 large eggs", "4 cups shredded extra-sharp Cheddar (about 16 ounces)", "1/2 cup unsalted butter (1 stick), melted", "2 cups shredded Colby Jack (about 8 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Bring a large pot of generously salted water to a boil. Add macaroni and cook according to package directions until a little under al dente, about 4 minutes. Transfer to a colander and rinse under cold water to stop cooking. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk milk and eggs. Add cooked macaroni, 2 cups extra-sharp Cheddar, melted butter, 1 1/2 teaspoons salt and 1/2 teaspoon pepper, and stir until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half the macaroni mixture to a 9-by-13-inch baking dish in an even layer. Sprinkle 1 1/2 cups Colby Jack evenly on top. Spread the remaining macaroni mixture on top in an even layer. Cover with aluminum foil, transfer to the middle rack of the oven and bake for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven. Carefully remove and discard the aluminum foil. Top the macaroni mixture with the remaining 2 cups Cheddar and 1/2 cup Colby Jack. Broil on top rack until cheese is browned in spots, 3 to 5 minutes. (The broiled cheese can go from golden to burnt fairly quickly, so keep a close eye on it.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and let cool until the macaroni and cheese is fully set, 10 to 15 minutes. (The mixture may first appear jiggly, but it will firm up as it cools.) Serve warm."}]}