{"@context": "http://schema.org", "@type": "Recipe", "name": "Easy Matzo", "description": "At its most traditional, matzo is made from just flour and water. But adding a little salt for flavor and olive oil for richness yields an airy, tender matzo that’s easy to make. This version also includes a small amount of whole-wheat flour for earthiness, but you can use all white flour if you prefer. Matzos will keep for at least a week stored airtight at room temperature. (Note that these matzos are not kosher for Passover.)", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/04/01/dining/01Apperex/merlin_171067596_b279d2de-450e-4281-a3e9-b2b392c2f96a-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 matzo crackers", "recipeCuisine": "jewish", "recipeCategory": "breads, crackers and chips", "keywords": "all-purpose flour, olive oil, whole wheat flour, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 67}, "recipeIngredient": ["2 cups/255 grams all-purpose flour, plus more for rolling", "1/4 cup/30 grams whole-wheat flour", "3/4 teaspoon kosher salt", "1/4 cup/60 milliliters extra-virgin olive oil", "Flaky sea salt (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "With the racks positioned the top third and middle, heat oven to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, use a wooden spoon to stir together all-purpose flour, whole-wheat flour and kosher salt. Add in 1/2 cup water and the 1/4 cup oil, and stir until a pliable dough forms, adding more water if the dough seems dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly flour a work surface, and knead dough briefly until it becomes smooth. Cut dough into 4 even pieces. Re-flour your work surface, if necessary, and use a rolling pin to roll out 2 pieces as thinly as you can, about 6 to 8 inches in diameter. (They should be almost translucent.) Aim for rounds, but don’t worry if they are oblong."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer each matzo to a separate cookie sheet, and prick each one all over with a fork. Sprinkle with flaky sea salt, if you like. Bake until golden all over and lightly browned in spots, about 7 to 12 minutes. (Timing will depend on how thinly you rolled the dough.) Transfer matzos to a wire rack and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While first batch is baking, roll out remaining dough. If you have enough baking sheets, transfer the rolled dough onto another two sheets. If not, use the warm sheet trays you used in the first batch, being careful while transferring and pricking the dough with a fork. Bake and cool."}], "link": "https://cooking.nytimes.com/recipes/1020972-easy-matzo"}