{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice and Beans With Extras", "description": "<em>This is a no-recipe recipe, a recipe without an ingredients list or steps. It invites you to improvise in the kitchen.</em>\nMaybe tonight is calling for simple rice and beans, with limes to squeeze over the plate, warm tortillas to scoop up the food? First, rinse a cup or two of rice and cook as you usually do. As it steams away, dice an onion and sweat it in a saucepan with a drizzle or two of olive oil set over medium-high heat. When the onion begins to go translucent, add a few cloves of garlic and, if you’d like, some crumbled sausage, ground beef or lamb, then cook until it has started to crisp and the onion has started to caramelize. Add a healthy dusting of cumin, some salt and pepper to taste, and allow it all to go muddy and fragrant. Splash the mixture with the orange juice, maybe half a cup, and allow it to cook down, almost to syrup.\nThen add a big can of black beans (drained, please) and stir to combine, turning down the heat and allowing the flavors to come together, perhaps using a spoon to mash some of the beans as they cook. Serve it all on top of the finished rice, adorned with wedges of lime and accompanied by warmed tortillas or buttered toast. I like some pickled jalapeños, cilantro and hot sauce on there, too.\n<em>Sam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. <a href=\"https://www.nytimes.com/newsletters/cooking\">Sign up to receive it.</a> You can find more no-recipe recipes <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/14326423-no-recipe-recipes\">here</a>.</em>", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/02/17/dining/17norecipe-riceandbeans/merlin_147769374_8b7cb745-a853-47be-9041-fb5fcfe90fd4-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, beans, grains and rice", "keywords": "rice, tortilla, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 944}, "recipeIngredient": [], "recipeInstructions": null, "link": "https://cooking.nytimes.com/recipes/1020025-rice-and-beans-with-extras"}