{"@context": "http://schema.org", "@type": "Recipe", "name": "Handmade Tagliatelle Pasta ", "description": "Evan Funke, a pasta maker and the author of the cookbook “American Sfoglino,” developed an exacting recipe for handmade tagliatelle that practically guarantees success for ambitious home cooks. It takes time to achieve the proper balance between elasticity and extensibility in the dough. If it is too elastic, it won’t stretch to the desired thinness, but if it is too stretchy, it is too hydrated and won’t maintain its shape. Keep at it: The more often you make it, the better it will be. If you find the dough springing back after you roll it out, it may need more time to rest, so let it sit at room temperature for 30 minutes before resuming, or refrigerate it for up to 24 hours. Because the dough is the result of just two ingredients — flour and eggs — use the freshest eggs you can find.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/09/18/dining/16cookbooksrex6/merlin_160014927_49b81cd3-80dc-446c-a34b-53bdf6a95eea-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "1 1/2 pounds pasta (4 to 6 servings)", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, pastas, project", "keywords": "eggs, flour, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "recipeIngredient": ["1 pound (455 grams) “00” flour, plus more for dusting", "260 grams eggs (about 5 large eggs)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift the flour onto your work surface and make an 8-inch-wide well in the center. (You should be able to see the work surface in the middle, and the well’s walls should be high enough to contain the eggs.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a medium bowl, then pour the eggs into the well. Working from the interior edge of the well, use a fork to incorporate the flour into the eggs, flicking about 1 teaspoon of flour mixture onto the eggs at a time and whisking to combine. Continue incorporating the flour, flicking then whisking, until you’ve integrated almost half the flour and the dough is the consistency of pancake batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a bench scraper, scrape any remaining flour from the work surface onto the dough. Working in a clockwise motion, cut the dough together as if you were making biscuits: Scraping underneath the mixture, lift and fold it over itself and cut into it vertically a few times to help integrate the flour and eggs. Continue working the dough until a shaggy mass forms, 2 to 3 minutes. Knead with your hands until it forms a rough ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Anchoring the portion of the dough closest to you firmly to the surface with one hand, use the heel of the other hand to push the far end of the dough away from you quickly and energetically. Fold it over itself, then continue pushing it away from you using the heels of your palms. Rotate the dough a quarter turn and repeat the kneading, pushing the dough away then folding the furthest portion back over itself and rotating until the dough is a compact, slightly tacky mass, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the bench scraper, scrape any dry bits of dough from your work surface and discard. Wash — but do not dry — your hands and continue kneading the dough by pressing it against the work surface and away from you using the heels of your palms and folding it over itself until it is relatively smooth, with a slightly dimpled texture, an indication of gluten formation, 3 to 5 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap the dough tightly in plastic wrap, smoothing out any air pockets between the plastic wrap and the dough. Set aside to rest at room temperature for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unwrap the dough and halve it crosswise using a sharp knife. On a lightly floured surface, knead one piece of dough energetically with both hands, pushing the dough against the surface and away from you, folding it over itself then rotating the dough clockwise by 1- to 2-inch increments, like the hour markings on a clock. If the dough feels too dry, spray it and your hands with water, a little at a time every few rounds, until it loses its dryness. (A spray bottle will best distribute the liquid evenly, but you could also dip your hands into a bowl of water.) If you are closing the round ball and find that it is not sealing, spray that with a touch of water to help it along. Continue kneading until the dough is soft and smooth all the way around, lightens in color and becomes firmer, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap the dough tightly in plastic wrap, eliminating any air pockets between the plastic wrap and the dough. Repeat the kneading process with the second piece of dough. Let the dough balls rest at room temperature for 2 to 3 hours (or up to 48 hours in the refrigerator) before rolling them out to make fresh pasta. (Do not freeze the dough.) If you've refrigerated your dough, make sure to let it first come back down to room temperature for at least 30 minutes before removing it from its plastic wrap and rolling it out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured work surface, flatten the dough ball with your palm to form a uniformly thick disk that is about 6 inches wide. Using a rolling pin positioned at the center of the dough, roll the rolling pin away from you with firm, even pressure, stretching the dough into a half oval. Lift the pin and bring it back to the center and roll the rolling pin toward you, creating a full oval. Rotate 90 degrees and repeat until the pasta dough is a rounded square that is at least 20 inches wide — the wider the better, as it’ll result in a thinner, more delicate pasta. (Evan Funke recommends rolling out the dough until it is the thickness of 4 stacked pieces of paper, but do the best you can.) Cure the pasta dough by letting it sit out on your work surface until dry to the touch, 7 to 10 minutes. Flip the pasta dough and dry the other side, another 7 to 10 minutes. While flattened pasta dough is curing, roll out the other ball of dough. Once both doughs have been rolled out and cured, fold each pasta dough in half, press gently along the crease, and unfold. Using a sharp knife, cut the pasta in half along the crease."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position the half-moon-shaped pieces of dough with the round ends closest to you and the cut ends facing away from you. Starting at the round edge, fold the pasta away from you in 3-inch increments until you have a loose roll."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beginning at the end of one roll, using a sharp knife, square off the edges at the left and right, discarding the uneven strip at both ends, and cut each pasta roll crosswise into 1/4-inch-thick strips. Using one hand, grasp 6 to 8 pasta strands in the middle. Lift them off the work surface and shake to unfurl. Place the strands on a clean work surface or large sheet pan in a horizontal orientation, then gently tug them in the center to form into a U-shape. Repeat with the remaining dough strands. Cook right away or refrigerate for up to 24 hours in a high-sided container lined with paper towels and loosely covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To dry your tagliatelle in the traditional way, shape them into nests: Gather 20 to 25 strands, grasping them from the middle, and lift them off the work surface. With your other hand, grab the dangling ends closest to that hand. (You’re grabbing the cluster of pasta by one end.) Release your other hand and allow the strands to dangle over the top of your fingers. Loosely wrap the strands up and over your hand until they are completely wrapped. Lower the nest onto the work surface and release. Repeat with the remaining strands."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to cook the fresh or dried pasta, simply drop it into boiling salted water and cook until tender and starting to float, 1 to 4 minutes, depending on how thinly you have rolled out your dough."}]}