{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Schnitzel With Pan-Roasted Grapes", "description": "No matter how you spin it, making schnitzel is a bit of a process. But by starting with thinly sliced chicken breasts, or chicken cutlets, this recipe removes the most time-consuming step — pounding the chicken — and makes schnitzel more doable on a weeknight. The contrast in temperatures and textures from the pan-roasted grapes and tangy sour cream make for perfectly balanced bites. Serve with a simple green salad with a lemony vinaigrette.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2019/09/24/dining/lh-chicken-schnitzel-with-grapes/lh-chicken-schnitzel-with-grapes-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, poultry", "keywords": "chicken breast, dijon mustard, lemon, panko, red grapes, rosemary, sour cream, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 184}, "recipeIngredient": ["1 tablespoon olive oil", "2 cups seedless red grapes, washed and dried (about 12 ounces)", "1 1/2 tablespoons plus 1 teaspoon minced fresh rosemary", "1 tablespoon sherry or red wine vinegar", "Kosher salt and black pepper", "3/4 cup sour cream", "Zest and juice of 1/2 lemon", "1/2 cup all-purpose flour", "2 large eggs, lightly beaten", "2 tablespoons Dijon mustard", "1 1/2 cups panko bread crumbs", "4 chicken breasts (about 1 pound total), pounded or sliced to about 1/2-inch thickness", "1/4 cup plus 2 tablespoons grapeseed, canola or safflower oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large (12-inch) sauté pan over medium. Add the grapes, 1 1/2 tablespoons rosemary, the vinegar, 1/2 teaspoon salt and a pinch of black pepper. Cook for 5 to 7 minutes, tossing often and smashing down some of the grapes with the back of a wooden spoon as they begin to soften. Transfer the grapes and their juices to a small dish. Wipe out the skillet with a damp paper towel and set aside. In another small bowl, combine the sour cream, 2 teaspoons lemon juice (reserve the zest for serving), and 1/2 teaspoon salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the flour in a shallow bowl or rimmed plate. In a second bowl, whisk together the eggs and mustard until smooth. In a third bowl, mix the panko with the remaining 1 teaspoon minced rosemary, 1/2 teaspoon salt and 1/2 teaspoon pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat dry the chicken with a paper towel and season with salt and pepper. Working one at a time, dip the chicken breasts into the flour, shaking off any excess, then into the egg mixture, and finally, the panko mixture. Place the prepared breasts on a plate until ready to cook. (At this point, the chicken breasts may be covered and stored in the refrigerator for several hours before cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1/4 cup grapeseed oil<strong> </strong>in the sauté pan over medium-high heat. When the oil is hot (it should sizzle if you drop a bread crumb into the pan), place two breasts, evenly spaced, in the pan and cook for 1½ to 2 minutes on each side, until golden brown and just cooked through. Transfer to a plate lined with a paper towel and sprinkle with salt. Add the remaining 2 tablespoons grapeseed oil to the pan and repeat the process with the other two breasts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken to a serving platter, spoon the grapes on top and sprinkle the lemon zest over the chicken. Serve with the lemon-sour cream on the side."}]}