{"@context": "http://schema.org", "@type": "Recipe", "name": "Chinese Roast Pork on Garlic Bread", "description": "Chinese roast pork on garlic bread is one of the great New York sandwiches, a taste of the highest peaks of Catskills cuisine: thinly sliced, Cantonese-style char siu married to Italian-American garlic bread beneath a veil of sweet-sticky duck sauce. It’s been around since the 1950s, a favorite of the summertime borscht belt crowd. You can make the sandwich with store-bought char siu if you like, but I prefer the homemade variety because I can make it with fancy pork from the farmers’ market. It’s also juicier and more flavorful. Then, layer the meat onto garlic bread, and add a drizzle of duck sauce – for that, I use leftover packets from Chinese takeout orders or make my own with apricot preserves cut through with vinegar. Some people add a slash of hot mustard; others fresh pickles, or coleslaw. “It’s the ultimate assimilation crossover food,” the food writer and erstwhile restaurant critic Arthur Schwartz told me. “That sandwich is a symbol of acculturation.”", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2020/01/19/magazine/19mag-eat/19mag-eat-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "4 sandwiches", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, weeknight, sandwiches", "keywords": "garlic, honey, pork, pork butt, pork shoulder, scallion, soy sauce, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 214}, "recipeIngredient": ["2 pounds boneless pork shoulder or butt", "1/4 cup honey", "3 tablespoons low-sodium soy sauce", "2 tablespoons Shaoxing wine, dry sherry or sake", "2 tablespoons hoisin sauce", "1 tablespoon oyster sauce", "1 teaspoon five-spice powder", "2 jarred red fermented bean curd cubes, plus 1 tablespoon of the liquid from the jar (optional)", "4 tablespoons unsalted butter, softened", "8 garlic cloves, peeled and minced", "4 large sub rolls, not too crusty or firm, or Italian- or French-style bread, cut into 4 (6-to-8-inch) sections, split lengthwise", "1/2 cup apricot jam", "Red- or white-wine vinegar, to taste", "Chinese mustard, for serving", "1 bunch scallions, trimmed and sliced on an angle (about 1 cup), for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the pork into 1-by-4-inch pieces (each about the size of a stick of butter)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the marinade: In a large bowl, whisk together the honey, soy sauce, wine, hoisin sauce, oyster sauce, five-spice powder and, if using, the bean curd and its liquid. Add the pork, and mix thoroughly, then cover, and refrigerate for a few hours or up to 1 day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to cook the pork, heat the oven to its highest temperature (not the broil setting). Line a large sheet pan with aluminum foil, and put a metal rack on top. Take the pork out of the marinade, and place it on the rack in an even layer. Reserve remaining marinade."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide the pan into the top third of the oven, and roast for 20 minutes. Turn the pieces, and roast until each piece is deeply caramelized on all sides and fall-apart tender, another 20 to 25 minutes, basting with the remaining marinade. (If the pork isn’t as caramelized as you’d like, turn on the broiler to crisp the meat’s exterior, 1 to 2 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the oven, and transfer pork to a cutting board. Let the pork rest for 10 minutes, then slice about half the pieces lengthwise into thin strips about the size of thick-cut bacon. (Reserve the uncut pieces for future use, over rice, in stir-fries, etc.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the garlic bread: Mash together the butter and garlic, and then spread across the sliced sides of the rolls or bread. Place bread directly onto middle rack in the still-hot oven to toast for 3 to 5 minutes. While your bread is toasting, prepare your homemade duck sauce by stirring together the apricot jam with vinegar, to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the sandwiches: Spread mustard on one side of toasted bread, then duck sauce on the other. Add the sliced roast pork, garnish heavily with sliced scallions and serve."}], "link": "https://cooking.nytimes.com/recipes/1020771-chinese-roast-pork-on-garlic-bread"}