{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry-Marsala Cake", "description": "Joe Trivelli, the head chef of the River Café in London, has a recipe for an apple cake in his 2018 cookbook, “The Modern Italian Cook.” It’s simple to prepare but complex in flavor, because its batter includes vin santo and brown butter. Both the fruit and fortified wine are ingredients associated with Northern Italy. In Sicily, Marsala would be the spirit of choice; it has more depth than its counterpart thanks to a subtle savory quality, and is often used for macerating strawberries. It’s a perfect pairing, improved upon when baked into this cake, especially when berries are in season.", "author": {"@type": "Person", "name": "Charlotte Druckman"}, "image": "https://static01.nyt.com/images/2019/04/24/dining/23marsalarex3/merlin_153389490_6460e22c-7d27-43ee-93d7-09bf5b96b59c-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "dessert, marsala, strawberries, superfine sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 290}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 407, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "9 grams", "sodiumContent": "93 milligrams", "sugarContent": "23 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["9 tablespoons/125 grams unsalted butter, plus more for greasing", "1 1/4 pounds/565 grams fresh strawberries", "3/4 cup/150 grams superfine sugar, plus more as needed", "4 extra-large eggs, whites and yolks separated", "3/4 cup/180 milliliters sweet Marsala", "1 cup plus 2 tablespoons/150 grams all-purpose flour", "1/4 teaspoon baking powder", "Heaping 1/8 teaspoon fine salt", "Confectioners’ sugar, for dusting", "Freshly whipped cream or vanilla ice cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Brown the butter: Melt the 9 tablespoons butter in a small saucepan over medium heat, swirling it occasionally. As it melts, the butter will sizzle and foam. Continue cooking until the foam dissolves and the solids turn golden brown, about 5 minutes. (If the butter is spattering too much, reduce the heat a bit, and watch carefully to make sure it doesn’t burn.) Remove it from the heat and allow it to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Grease a 9-inch square cake pan with butter, line it with parchment, then grease the parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Hull the strawberries and slice them lengthwise, 1/4-inch thick. Toss them in a bowl with 2 tablespoons superfine sugar and set aside while you prepare the batter. (If strawberries aren’t in season and yours are underripe or less sweet than they should be, you may want to add 1 to 2 additional teaspoons superfine sugar.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk the egg yolks and 5 tablespoons superfine sugar together until pale. Whisk in the browned butter (scraping to include the solids, if you like), then whisk in the Marsala until incorporated. In a medium bowl, combine the flour, baking powder and salt. Sift over the batter and gently whisk to combine, smoothing out the lumps as best as you can."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a stand mixer fitted with the wire whip on medium speed, or an electric beater, or simply a whisk and a bowl, beat the egg whites until they form soft peaks. Slowly add the remaining 5 tablespoons superfine sugar while beating to form a shiny meringue with stiff peaks, 5 to 7 minutes. Gently fold 1/3 of the meringue mixture into the batter, followed by the rest, then fold in the strawberries, using a slotted spoon to add the berries to the batter, leaving any strawberry juices behind."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan and bake until the top is golden and the cake is springy to the touch, 30 to 33 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust with confectioners’ sugar and serve right away with some freshly whipped cream or vanilla ice cream."}], "link": "https://cooking.nytimes.com/recipes/1020133-strawberry-marsala-cake"}