{"@context": "http://schema.org", "@type": "Recipe", "name": "Parsley Salad With Fennel and Horseradish", "description": "I have always been the one at the Seder table to eat the parsley dipped in saltwater with enthusiasm. “You going to finish that?” I might ask my neighbor at the table when I see they have left theirs untouched after just a nibble. This salad is an obvious nod to the Seder plate, including both parsley (bitter herbs) and fresh horseradish, except it’s less ceremonial and more just a very delicious salad. I love, love parsley and think a well-seasoned bowl of it is something that most tables can benefit from, especially if those tables include braised pots of red meat. While parsley and fennel can be prepared ahead of time, the salad itself is best dressed right before you eat.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2020/04/01/dining/01Roman-Fennel-Salad-A/merlin_170265432_b307d88e-88a4-4a51-980e-81c3a2066536-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "8 to 10 servings", "recipeCuisine": "jewish", "recipeCategory": "easy, salads and dressings", "keywords": "appetizer, side dish, fennel, lemon juice, parsley, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "recipeIngredient": ["2 fennel bulbs, thinly sliced", "1 large bunch parsley, tender stems and leaves", "1/4 cup fresh lemon juice, plus more to taste", "Kosher salt and freshly ground black pepper", "Olive oil, for drizzling", "Fresh horseradish, for grating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss fennel and parsley together in a medium bowl. Add lemon juice, season with salt and pepper, and toss to coat. Season again with salt, pepper and more lemon juice if you like. (It should be fairly lemony.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle with olive oil, toss to coat and grate a bit of fresh horseradish over everything, gently tossing to distribute the horseradish. (Doing it this way prevents clumping.) Transfer to a serving bowl and grate more horseradish over before serving."}]}