{"@context": "http://schema.org", "@type": "Recipe", "name": "Easy No-Yeast Monkey Bread", "description": "Many monkey bread recipes are made with a yeast-risen dough, but the most classic methods use biscuit dough, as this one does. A quick fold of the dough ensures it’s light and fluffy inside. When you grease the pan, you may worry that two tablespoons of butter seems excessive, but the generous amount prevents the monkey bread from sticking to the pan and combines with the cinnamon sugar to create an effortless caramel sauce as it bakes. If you’re looking for an even simpler approach, you could replace the homemade dough with about two pounds of store-bought refrigerated biscuit dough.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2020/01/30/dining/ejm-monkey-bread/merlin_168100557_1d405ebc-3241-4a56-a7fb-3cc0767acabc-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "One 9-inch round or 10-inch bundt loaf", "recipeCuisine": "american", "recipeCategory": "snack, cakes, finger foods, one pot, quick breads, dessert", "keywords": "butter, buttermilk, cinnamon, flour, heavy cream, vanilla, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 433}, "recipeIngredient": ["4 cups/510 grams all-purpose flour, plus more for dusting", "1/4 cup/50 grams granulated sugar", "4 1/2 teaspoons baking powder", "1 1/2 teaspoons fine sea salt", "1 cup/225 grams cold unsalted butter (2 sticks), cut into 1/2-inch cubes", "1 1/3 cups/320 milliliters cold buttermilk, plus more as needed", "12 tablespoons/170 grams unsalted butter (1 1/2 sticks), at room temperature", "3/4 teaspoon vanilla extract", "1 cup/220 grams light or dark brown sugar", "1/4 cup/50 grams granulated sugar", "1 tablespoon ground cinnamon", "Pinch of fine sea salt", "1 cup/125 grams confectioners’ sugar", "6 tablespoons heavy cream or milk, plus more as needed", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the biscuit dough: In a large bowl, whisk the flour, granulated sugar, baking powder and salt to combine. Add the cubed cold butter and toss to coat with the flour mixture, using your fingers to separate butter cubes and ensure each piece is well coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use your fingers or a pastry cutter to cut the butter into the flour, and continue working until each piece of butter is no larger than the size of a pea. Make a well in the center of the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the buttermilk into the well and use your hands or a spatula to gently mix the dough to combine. You want to mix it minimally to keep the dough tender, but you also want to make sure it’s uniformly combined, eliminating any dry patches of flour. The dough should be slightly sticky; if the dough seems dry, stir in buttermilk 1 tablespoon at a time until the dough comes together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously flour your work surface and place the dough on it. Flour the surface of the dough and your hands, and press the dough into a rectangle about 1/2-inch thick (the size of the dough doesn’t matter, but the thickness is key). Fold the dough in quarters, then fold the quartered dough in half. Wrap it tightly in plastic wrap, and refrigerate. Heat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the monkey bread: Using 2 tablespoons of butter, grease a 9-inch cake pan with at least 2-inch-tall sides or a 10-inch bundt or tube pan. (If you use the bundt pan, take care to really get into all the grooves and ridges and coat them well.) Place the prepared pan on a parchment-lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the remaining 10 tablespoons/140 grams butter in a small saucepan over medium-low heat. Remove from the heat and stir in the vanilla. In a medium shallow bowl, stir the brown sugar, granulated sugar, cinnamon and salt together to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oven is hot, unwrap the dough. Lightly flour the work surface, then flour the surface of the dough. Using your hands, press the dough into a 9-by-12-inch rectangle. Slice the dough crosswise and lengthwise into 1-inch squares."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with a few pieces at a time, dip the dough into the melted butter and shake off the excess, then toss in the sugar mixture to coat. Transfer the pieces into the prepared cake pan. Continue this process, gently stacking the dough as you work."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the assembled monkey bread to the oven and bake until you see bubbling around the edge of the pan, the surface is well browned and it springs back lightly when pressed in the center, 45 to 50 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool in the pan for 5 minutes, then invert onto a serving platter or tray. Serve unglazed immediately, or let cool slightly while you make the glaze: In a medium bowl, whisk the confectioners’ sugar, cream and vanilla to combine. Add more cream as needed to thin, 1 tablespoon at a time. Drizzle over the surface of the monkey bread, or serve in a bowl alongside for dipping."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1020835-easy-no-yeast-monkey-bread"}