{"@context": "http://schema.org", "@type": "Recipe", "name": "Dirty Horchata", "description": "<a href=\"https://cooking.nytimes.com/recipes/1020251\">Horchata</a>, a sweet cinnamon drink popular throughout Latin America, is typically made by soaking white rice in water, straining the solids, then sweetening the liquid with sugar and cinnamon. But the horchata at Guisados, a chain of taco restaurants in Los Angeles, is different. It's made with whole milk and is served plain, or “dirty” with a shot of cold brew concentrate — and the chain sells up to 700 a day. This is an adaptation of its caffeinated version, and it serves a crowd. (You can leave out the coffee or halve the recipe, if you like.) Enjoy it with something spicy on a hot summer’s day.", "author": {"@type": "Person", "name": "Kiera Wright-Ruiz"}, "image": "https://static01.nyt.com/images/2019/05/21/dining/kwr-dirty-horchata/kwr-dirty-horchata-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "8 servings", "recipeCuisine": "american, mexican", "recipeCategory": "snack, non-alcoholic drinks", "keywords": "cinnamon, coffee, condensed milk, espresso, milk, nutmeg, rice, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 326}, "recipeIngredient": ["2 cups uncooked long-grain white rice", "1 (14-ounce) can sweetened condensed milk", "1 tablespoon ground nutmeg", "1 tablespoon ground cinnamon", "1/2 gallon whole milk", "2 cups cold brew concentrate or espresso, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice and 2 1/2 cups water to a large container and cover. Soak at room temperature for a minimum of 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the rice and soaking liquid into a blender, and blend until all the rice is finely ground, 2 to 3 minutes. (If necessary, stop your blender periodically to prevent overheating.) Add condensed milk, nutmeg and cinnamon; blend until combined. Pour the mixture into a large pitcher or bowl. Add the whole milk and whisk until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide horchata among ice-filled glasses and top with cold brew concentrate, to taste (about 2 to 3 tablespoons cold brew for each cup of horchata)."}], "link": "https://cooking.nytimes.com/recipes/1020252-dirty-horchata"}