{"@context": "http://schema.org", "@type": "Recipe", "name": "Sausages With Potatoes and Red Cabbage", "description": "A full meal baked in one pan, this easy weeknight dish yields tender, sweet red cabbage and crisp, golden potatoes seasoned with whole caraway and coriander and topped with meaty sausages. You can make this with any kind of sausage: whether spicy turkey, chicken and mushroom, classic pork bratwurst, chorizo or hot Italian links. A metal pan will give you slightly better browning on the potatoes, but use what you’ve got.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/02/27/dining/27apperex-copy/27apperex-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weekday, sausages", "keywords": "baby potatoes, red cabbage, sausage, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 336}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 163, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "25 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup extra-virgin olive oil", "1 pound baby potatoes, halved crosswise or quartered if large", "1/2 head red cabbage (about 1 pound), core removed, cut into 1-inch-thick wedges", "1 teaspoon caraway seeds, lightly crushed", "1 teaspoon coriander seeds, lightly crushed", "1 teaspoon kosher salt", "1 large onion, thinly sliced", "4 thyme sprigs", "2 rosemary sprigs", "6 fresh pork, turkey, chicken or other sausages (about 1 1/2 pounds)", "1 1/2 tablespoons Dijon mustard, plus more for serving", "1/2 cup freshly grated Parmesan", "1 lemon", "1/4 cup chopped dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Brush 1 tablespoon oil all over a preferably metal 9-by-13-inch baking dish. Arrange potatoes, cut side down, on one half of the dish. Arrange cabbage wedges on the other side, overlapping slightly to fit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle caraway and coriander seeds and 3/4 teaspoon salt on top. Scatter onions in an even layer and drizzle with 3 tablespoons oil. Tuck in thyme and rosemary sprigs. Bake for 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut sausages in half lengthwise, then use a pastry brush or spoon to coat mustard all over the pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When potatoes and cabbage have roasted for 30 minutes, remove baking pan from oven and use tongs to flip cabbage (but not potatoes). Sprinkle everything with Parmesan, arrange sausages, cut side down, on top of cabbage and potatoes, and return to oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until vegetables and sausages are browned on top, another 15 to 25 minutes, depending on the kind of sausages. The sausages are done when they are no longer pink inside and browned on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and transfer sausages to a plate. Discard herb sprigs, grate lemon zest over the vegetables and sprinkle with dill. Cut the zested lemon into wedges. Return sausages to pan (or transfer everything to a serving platter) and serve immediately with more mustard and lemon wedges on the side."}], "link": "https://cooking.nytimes.com/recipes/1020041-sausages-with-potatoes-and-red-cabbage"}