{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Turkish Kebabs With Sumac Onions and Garlic-Dill Mayonnaise", "description": "These vegan ground meat kebabs are inspired by Turkish street food. The kebabs themselves can be served on their own with the garlic-dill mayonnaise, or made into wraps, or tucked into Turkish bread or pita for sandwiches, with garlic-dill mayonnaise, sumac onions and tomatoes.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2020/03/04/dining/03fakemeatrex-kebabs/merlin_168789975_754a6c46-9d30-4f2b-b0e6-46378ae8ab97-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "turkish", "recipeCategory": "dinner, weekday, skewers and kebabs", "keywords": "cumin, red onion, sumac, vegan ground meat, vegan mayonnaise, main course, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 35}, "recipeIngredient": ["1 medium red onion, halved lengthwise, then thinly sliced", "1 cup loosely packed fresh parsley leaves", "1 tablespoon ground sumac", "20 garlic cloves, peeled and ends trimmed", "1 cup vegan mayonnaise", "1 tablespoon fresh lemon juice", "3 tablespoons extra-virgin olive oil", "Large handful of minced fresh dill leaves", "Kosher salt and freshly ground black pepper", "1 pound vegan ground meat, such as Impossible or Beyond", "1 tablespoon minced fresh oregano leaves", "3 medium garlic cloves, minced", "1 1/2 teaspoons Urfa pepper, or 1 teaspoon ground ancho chile", "1 1/2 teaspoons ground sumac", "1 teaspoon kosher salt", "1 teaspoon ground cumin", "1/2 teaspoon ground coriander", "1/2 teaspoon freshly ground black pepper", "1 teaspoon neutral oil, such as grapeseed or canola", "1 cup cherry tomatoes, halved", "1 cup arugula", "Hot sauce, to taste", "Vegan Turkish bread or pita"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sumac onions: Combine all ingredients and toss until the onion pieces are separated and well coated. (You should have about 1 1/2 cups. Sumac onions should be used the day they are made.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the garlic-dill mayonnaise: Put 18 garlic cloves in a medium pot, and cover with a couple inches of water. Bring to a boil over high heat. Continue cooking for 30 seconds. Drain garlic and allow to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, mince the remaining 2 garlic cloves. In a food processor, combine blanched and raw garlic, mayonnaise and lemon juice; process until completely smooth. With the machine running, slowly drizzle in the olive oil. Transfer mixture to a bowl, stir in minced dill, and season to taste with salt and pepper. (You should have about 1 1/2 cups.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the kebabs: Combine all ingredients in a large bowl, and fold with very clean hands until fully incorporated. Divide mixture in half, then divide each half into 6 equal balls. Working on a clean cutting board, roll them into cylinders about 3/4 inch in diameter. Cut each cylinder in half to form 24 small logs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook and serve: In a large skillet over medium-high, heat oil until shimmering. Add the logs, working in batches if necessary to prevent crowding. Cook on one side until well browned, about 2 minutes. Flip and cook on second side until well browned and cooked through, another 1 1/2 minutes. (Alternatively, cook on a hot grill until lightly charred and cooked through.) Transfer to a serving plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with sumac onions, garlic-dill mayonnaise, cherry tomatoes, arugula, hot sauce and Turkish bread or pita."}], "link": "https://cooking.nytimes.com/recipes/1020865-vegan-turkish-kebabs-with-sumac-onions-and-garlic-dill-mayonnaise"}