{"@context": "http://schema.org", "@type": "Recipe", "name": "Pickle-Brined Fried Chicken Sandwich", "description": "Pointedly low-fuss and remarkably moist, this recipe gets its verve from pickles used two ways: Dill pickle brine seasons and moistens the chicken from the inside-out, while chopped pickles add zip to the coleslaw. Many fried chicken sandwich recipes use breasts, but thighs have more fat, which means they’re more flavorful and harder to overcook. The chicken also fries at a lower temperature, so it finishes cooking and its crust crisps at precisely the same time. The buttermilk is key to the crispness here, so avoid any substitutions. Paired with cornstarch, it forms a thick crust that shatters with each bite. This sandwich is best enjoyed immediately, with your favorite hot sauce and a pile of napkins.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/08/05/dining/aw-pickle-brined-fried-chicken-sandwich/aw-pickle-brined-fried-chicken-sandwich-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 sandwiches", "recipeCuisine": "", "recipeCategory": "dinner, lunch, poultry, sandwiches", "keywords": "buttermilk, capers, chicken, mayonnaise, pickles, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 238}, "recipeIngredient": ["4 boneless, skinless chicken thighs (about 4 ounces each)", "24 dill pickle coins (about 3/4 packed cup), plus 1/2 cup pickle brine", "1/2 cup mayonnaise", "4 teaspoons drained capers, chopped", "Kosher salt and black pepper", "3/4 cup buttermilk", "1 cup all-purpose flour", "1/4 cup cornstarch", "1 tablespoon onion powder", "Canola oil or other neutral oil, for frying (4 to 6 cups)", "2 tablespoons unsalted butter", "4 soft buns, like brioche, split", "1 1/3 cups thinly sliced green cabbage (about 4 ounces)", "Thinly sliced red onion, for serving (optional)", "Hot sauce, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken thighs and 1/2 cup pickle brine to a resealable plastic bag and refrigerate at least 1 hour or up to 24 hours, turning the bag occasionally to marinate evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chicken marinates, prepare the pickle mayonnaise: Finely chop 8 dill pickle coins. In a medium bowl, whisk together the mayonnaise, capers and chopped pickles; season generously with salt and pepper. Refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook the chicken, pour the buttermilk into a wide shallow bowl. In a separate wide shallow bowl, add the flour, cornstarch, onion powder and 1 tablespoon each salt and pepper; whisk to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven or deep cast-iron skillet, add 2 inches of oil and, over medium-high, heat to 325 degrees, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one piece at a time, remove the chicken from the brine, transfer to the buttermilk and turn to coat. Lift chicken from the buttermilk, allowing the excess liquid to drip off, then add it to the flour mixture and turn to coat, patting extra flour mixture on top to ensure the chicken is well coated on all surfaces. Transfer to a plate and repeat with the remaining chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in two batches, add the chicken to the hot oil and cook, turning every 1 to 2 minutes, until crust is deep golden and chicken is cooked through, about 6 minutes total. Transfer to a paper towel-lined plate to cool and season with salt and pepper. (An instant-read thermometer inserted into the center of the thickest part of the thigh should read at least 165 degrees.) Repeat with the remaining chicken, adjusting the heat to ensure that the oil maintains a temperature of 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1 tablespoon butter in a large, preferably nonstick, skillet over medium. Add 2 buns, split-side down, and cook until warmed and toasted, about 2 minutes. Repeat with remaining butter and buns."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the coleslaw by tossing the cabbage with half of the pickle mayonnaise and season with salt and pepper. Slather the remaining pickle mayonnaise on the bottom of the buns and top with the chicken, red onion, remaining pickles and coleslaw. Serve with hot sauce, if using."}], "link": "https://cooking.nytimes.com/recipes/1020385-pickle-brined-fried-chicken-sandwich"}