{"@context": "http://schema.org", "@type": "Recipe", "name": "Soy-Glazed Chicken Breasts With Pickled Cucumbers", "description": "The pan-steam method used here ensures boneless, skinless chicken breasts cook quickly while staying moist. The technique works with water, but a flavorful mixture of soy sauce, honey, garlic and coriander infuses the chicken with even more flavor. Depending on the size of the skillet you use, the sauce may reduce a little slower or faster than the time indicated. When you swipe a rubber spatula across the bottom of the skillet, the sauce should hold a spatula-wide trail that fills in with liquid pretty quickly. If you happen to reduce too much, whisk in water one tablespoon at a time until you’re back to a shiny sauce that can be drizzled. Rice is an obvious side, but the sliced chicken and pickled cucumbers are really good tucked inside flour tortillas, too.", "author": {"@type": "Person", "name": "Dawn Perry"}, "image": "https://static01.nyt.com/images/2020/02/24/dining/dp-soy-glazed-chicken-breasts/merlin_169351428_b456334d-ef3a-4a2f-abdf-fa1aef96517a-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry, vegetables", "keywords": "chicken breast, cilantro, coriander, cucumber, garlic, honey, rice vinegar, shallot, soy sauce, dairy-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 582}, "recipeIngredient": ["1 English cucumber, thinly sliced", "1 shallot, peeled, halved and thinly sliced lengthwise", "1/4 cup rice vinegar", "Kosher salt and black pepper", "1/4 cup low-sodium soy sauce or tamari", "2 tablespoons honey or maple syrup", "4 boneless, skinless chicken breasts (1 1/2 to 2 pounds)", "2 tablespoons vegetable oil", "2 garlic cloves, smashed", "1 teaspoon coriander seeds, roughly smashed with the side of a heavy knife", "Cilantro leaves and tender stems, for serving", "Steamed rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, toss to combine the cucumber, shallot, vinegar, 1 teaspoon salt and 1/4 teaspoon pepper; set aside while you make the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a shallow dish, stir soy sauce and honey together; add chicken and turn to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat oil over medium-high. Add garlic and coriander and stir to coat. Add chicken breasts (reserve the marinade) and cook until browned on both sides, about 3 minutes per side. (Browning happens a little faster than usual here because of the honey and soy; if the marinade is getting too dark, lower the heat slightly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add reserved marinade and 1/4 cup water to the skillet. Bring to a simmer, reduce heat to medium-low and cook, covered, until cooked through, 4 to 5 minutes more per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the skillet, increase heat to medium-high and cook, turning chicken occasionally, until liquid is reduced and chicken is glazed, about 5 minutes. Serve chicken drizzled with any leftover glaze over rice with cucumber salad and cilantro."}]}