{"@context": "http://schema.org", "@type": "Recipe", "name": "Walnut Pie With Molasses and Orange", "description": "This pie is fudgy, nutty, salty-sweet and spiked with citrus. It’s a meeting of sorts, between arguably Britain and America’s greatest desserts: the treacle tart and pecan pie. Cut corners by grating the crust instead of rolling it out, but don’t skip making your own bread crumbs and roasted walnuts; the texture and flavor rely on the freshness of both. Once you’ve prebaked the crust to biscuit brown, err on the side of undercooking the molasses-custard filling: It’ll firm up when cooled and stay gooey for days.", "author": {"@type": "Person", "name": "Clare de Boer"}, "image": "https://static01.nyt.com/images/2019/11/20/dining/15pierex1/merlin_164213604_75507645-490a-45d1-96c9-ebaf62dcb8cf-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "One 9-inch pie (about 10 servings)", "recipeCuisine": "american, british", "recipeCategory": "pies and tarts", "keywords": "bread, corn syrup, ginger, molasses, orange, walnut, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "recipeIngredient": ["Shortcut Pie Crust (<a href=\"https://cooking.nytimes.com/recipes/1020632-shortcut-pie-crust\">see recipe</a>)", "4 1/2 ounces/130 grams whole raw, unsalted walnuts (about 1 1/2 cups)", "1 cup plus 1 tablespoon/255 milliliters light corn syrup", "Zest of 1/2 navel orange (about 1 teaspoon) and 1/4 cup juice (from the whole orange)", "1 tablespoon blackstrap molasses", "1/4 teaspoon ground ginger", "3/4 teaspoon kosher salt", "3 ounces/85 grams crustless white bread (crusts removed or reserved for another use), torn into small pieces, then pulsed in a food processor until very fine (about 2 lightly packed cups)", "1/2 cup/120 milliliters heavy cream, plus more for serving", "1 large egg plus 1 large egg yolk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the <a href=\"https://cooking.nytimes.com/recipes/1020632\">Shortcut Pie Crust</a> through Step 3."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the dough has chilled, working over a 9-inch pie dish, prepare the crust through Step 4, then chill, at least 30 minutes or up to 2 days. (This can be done ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to bake the pie, heat the oven to 350 degrees and arrange two racks near the center of the oven. Place the chilled pie crust on a sheet pan, and the walnuts on a separate sheet pan. Transfer both to the oven. Bake until the walnuts are evenly golden throughout, 12 to 15 minutes. Continue to bake the pie crust until it turns golden and is fully cooked, another 10 to 15 minutes (for a total of about 25 minutes). Finely chop the walnuts to between the size of a steel-cut oat and a pea. Variety in size is nice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pastry bakes, prepare the filling: Add the corn syrup, orange zest and juice, molasses, ginger and salt to a small saucepan and warm over low heat just until the syrups liquefy and loosen. (Do not boil.) Add the bread crumbs and toasted walnuts to the warmed mixture, stir and let sit until slightly cooled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the heavy cream and eggs together with a fork to combine, then fold it into the cooled walnut mixture. Pour into the pie crust and bake on a sheet pan until the center of the pie just sets, about 25 minutes. Serve at room temperature or just above, with plenty of heavy cream for drizzling."}], "link": "https://cooking.nytimes.com/recipes/1020609-walnut-pie-with-molasses-and-orange"}