{"@context": "http://schema.org", "@type": "Recipe", "name": "Condensed Milk Pound Cake", "description": "A dulce de leche swirl adds caramel sweetness to this light, moist pound cake, adapted from Margarita Manzke of République in Los Angeles. Although Ms. Manzke makes her own dulce de leche, the jarred kind works just as well here, especially after being marbled into the vanilla-scented, buttery batter. This cake is best served within 2 days of baking. Store it, well-wrapped, in the refrigerator, then bring it to room temperature before serving to best appreciate its gentle flavors.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/12/04/dining/03bakingbookrex3/merlin_164785293_4b308a23-cfee-4ed2-9312-686e404d62ac-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "dessert, dulce de leche, sweetened condensed milk, vanilla bean", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 274}, "recipeIngredient": ["1 cup/225 grams unsalted butter (2 sticks), at room temperature, plus more for greasing", "1/2 cup/100 grams granulated sugar", "3/4 cup plus 4 teaspoons/200 milliliters sweetened condensed milk", "3 large eggs, at room temperature", "Seeds from 1 vanilla bean, split lengthwise", "2 teaspoons vanilla extract", "1 2/3 cups/215 grams all-purpose flour", "3/4 teaspoon baking powder", "1/2 teaspoon fine sea salt", "1 1/4 cups/300 milliliters dulce de leche"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Grease a 9-inch loaf pan and line the bottom with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer fitted with the paddle attachment, cream butter and sugar on medium speed until pale and fluffy, 1 to 2 minutes. Add condensed milk and mix until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add eggs, one at a time, beating well and scraping down the sides of the bowl with a rubber spatula between additions. Beat in vanilla seeds and vanilla extract (save pod for vanilla sugar or vanilla extract); scrape down the sides of the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift flour, baking powder and salt into a bowl. Add to butter mixture, then beat until just incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape half the batter into prepared pan. Dollop two-thirds of the dulce de leche over batter. Top with remaining batter, then dollop with remaining dulce de leche. Plunge a small offset spatula or long toothpick into batter and swirl to create marbling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden at the edges, firm to the touch in the center and a toothpick inserted into center of cake (avoiding dulce de leche) comes out without any wet batter clinging to it, 55 to 70 minutes. Rotate the cake after 20 minutes to ensure even baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer cake to a wire rack to cool for at least 20 minutes before running a butter knife or offset spatula along the edges of the cake pan to loosen the cake, then unmolding. Serve warm or let cool."}], "link": "https://cooking.nytimes.com/recipes/1020667-condensed-milk-pound-cake"}