{"@context": "http://schema.org", "@type": "Recipe", "name": "Honey-Soy Braised Pork With Lime and Ginger", "description": "This is a wonderfully simple and hands-off way to prepare a flavorful hunk of meat, equally suited to a weeknight or a dinner party. There is no need to brown the pork first because the meat gets appealingly dark and caramelized while braising in the rich combination of soy sauce and honey. Fresh cilantro, scallions and a squeeze of lime added just before serving bring freshness. This meal is flexible: It works over rice or other whole grains, tossed with noodles or wrapped in lettuce leaves.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2020/03/04/dining/sdg-soy-honey-braised-pork2/sdg-soy-honey-braised-pork2-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, meat, roasts", "keywords": "dairy-free, garlic, ginger, honey, lime, pork, red pepper flakes, sesame oil, tamari, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 215}, "recipeIngredient": ["3 to 4 pounds boneless, skinless pork shoulder, trimmed of big hunks of fat and cut into 2 pieces", "8 large garlic cloves, smashed and finely chopped", "3 tablespoons minced fresh ginger (from one 3-inch piece)", "1 teaspoon red-pepper flakes, plus more to taste", "2 teaspoons finely grated lime zest and 2 tablespoons juice (from 1 lime), plus more lime wedges for serving", "1 cup tamari or low-sodium soy sauce (see Tip)", "1 cup honey", "1 tablespoon toasted sesame oil", "Cooked rice, noodles or lettuce cups, for serving", "Toasted sesame seeds, sliced scallions and chopped cilantro, for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees. Place the pork in a large Dutch oven that has a lid. Scatter the garlic, ginger, red-pepper flakes and lime zest over the top. In a measuring cup, whisk together the tamari, honey and sesame oil, then pour it over the pork. Using tongs, turn to coat all sides of the pork in the sauce, and spoon some over the top so that some of the garlic and ginger is on top of the pork. Cover, transfer to the oven and cook for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the pot and flip both chunks of pork. Cover the pot and braise until the pork shreds easily with a fork, about 1 more hour. Transfer to the stovetop."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, transfer the pork to a serving platter or a large shallow serving bowl. Using a ladle, skim and discard the excess fat off the surface of the cooking liquid remaining in the Dutch oven, if desired. Bring the sauce to a boil over medium-high heat and let it simmer until reduced and slightly syrupy, about 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sauce simmers, coarsely shred the pork using two forks. Sprinkle the lime juice over the top of the meat. Drizzle about half the sauce over the top of the shredded meat, then toss to combine. Serve over rice or noodles or in lettuce cups. Top with sesame seeds, scallions and cilantro. Pass the remaining sauce at the table, if desired, as well as extra lime wedges and red-pepper flakes."}], "link": "https://cooking.nytimes.com/recipes/1020918-honey-soy-braised-pork-with-lime-and-ginger"}