{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Guinness Beef Stew With Horseradish Cream", "description": "The first step of this hearty cold-weather stew is to put together a quick, aromatic roux directly in the pressure cooker. It sounds fussy, but it’s really not, and it ensures that the final stew is thick and rich, not watery. Beef chuck is the ideal choice here because it is a flavorful cut that becomes fall-apart tender when pressure cooked — and it does so in a fraction of the time that it would take to braise in the oven. Espresso and cocoa powders subtly reinforce the dark, toasty flavors in the Guinness gravy. Pass the horseradish cream at the table so everyone can top their own bowls. (Here are <a href=\"https://cooking.nytimes.com/recipes/1020060-pressure-cooker-guinness-beef-stew-with-horseradish-cream\">slow cooker</a> and <a href=\"https://cooking.nytimes.com/recipes/1020061-oven-braised-guinness-beef-stew-with-horseradish-cream\">oven</a> versions of the recipe.)", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/02/26/dining/sd-guinness-stew-copy/sd-guinness-stew-copy-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "american, irish", "recipeCategory": "dinner, soups and stews", "keywords": "beef, guinness, mushroom, potato, root vegetables, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 196}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 948, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "6 grams", "proteinContent": "106 grams", "saturatedFatContent": "13 grams", "sodiumContent": "2095 milligrams", "sugarContent": "10 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 pounds beef chuck, fat trimmed and meat cut into 2-inch pieces", "2 tablespoons plus 1/3 cup all-purpose flour", "Kosher salt and black pepper", "1/4 cup vegetable oil", "3 large garlic cloves, chopped", "2 dried shiitake mushrooms, halved (optional)", "2 tablespoons tomato paste", "2 teaspoons packed brown sugar", "1 teaspoon unsweetened cocoa powder", "1 teaspoon onion powder", "1/2 teaspoon caraway seeds", "1/2 teaspoon instant espresso powder", "2 1/2 cups Guinness or other stout beer", "2 1/2 cups beef broth or stock", "2 fresh thyme sprigs", "1 pound red or Yukon gold potatoes, cut into 1- to 2-inch pieces", "1 to 1 1/2 pounds root vegetables, such as carrots, turnips, rutabaga, celery root, or parsnips, peeled and cut into 1- to 2-inch pieces", "1 tablespoon balsamic vinegar", "1 teaspoon Worcestershire sauce", "1 teaspoon lemon juice, plus more to taste", "3/4 cup sour cream", "3 tablespoons jarred horseradish", "1/4 cup minced scallions or chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the beef and 2 tablespoons flour. Season generously with salt and pepper and toss to coat. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the sauté setting, heat the oil in the pot. Add the garlic, dried shiitakes (if using), tomato paste, brown sugar, cocoa, onion powder, caraway seeds and espresso powder. Cook, stirring constantly, until the mixture is fragrant and evenly combined, 1 to 2 minutes. Add the remaining 1/3 cup flour and cook, stirring and scraping constantly, until the mixture forms a thick, dry paste, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beer and broth and bring to a boil, whisking constantly to scrape any browned bits from the bottom of the pot. Let boil until noticeably thickened, about 1 minute. Add the beef and thyme and stir to combine. Cover and set steam valve to sealed position. Cook on high pressure for 22 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the pressure release naturally for 5 minutes, then release the remaining pressure manually. (If you find that too much liquid is spurting out with the steam, close the knob to seal again, wait a minute, and then turn the knob to release the rest of the pressure.) Open and stir in the potatoes and root vegetables. Set steam valve to sealed position and cook on high pressure for 10 minutes. Allow the pressure to release naturally for 10 minutes, then release the remaining pressure manually."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the lid. If the beef and vegetables are not tender, pressure cook on high for 3 more minutes and manually release the pressure. Add the vinegar, Worcestershire sauce and lemon juice. Taste and season with more salt, pepper and lemon juice if necessary. (If the stew tastes flat, add more lemon juice first, then more salt and pepper; acid is key to making it taste lively. It may need a surprising amount of salt, especially if you have used unsalted or low-salt stock.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard the thyme sprigs and skim the fat from the top using a ladle or by passing a clean paper towel just over the surface of the stew. (If you would like the stew to be thicker, transfer the beef and vegetables with a slotted spoon to a bowl or plate. Using the sauté setting, let boil until it is the desired consistency. Add the beef and vegetables back into the pot.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the horseradish cream: Stir together the sour cream, horseradish and scallions in a small bowl. Season with salt. Serve stew in bowls with a spoonful of the horseradish cream."}], "link": "https://cooking.nytimes.com/recipes/1020060-pressure-cooker-guinness-beef-stew-with-horseradish-cream"}