{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Vesuvio", "description": "No one really knows who invented chicken Vesuvio, a roast chicken and potato dish in white wine sauce named after Mount Vesuvius, the volcano in Campania, Italy. Some believe the dish first appeared on the menu at Vesuvio, a well-known Chicago restaurant in the 1930s; others believe it’s a riff on the roast chicken dishes that grandmothers in Southern Italy have been making for hundreds of years. (The truth is probably somewhere in the middle.) Whatever its origins, Chicagoans claim it as their own, and you can find it at almost every Italian-American restaurant in the Windy City. The dish always includes plenty of oregano and lemon juice, and usually a scattering of fresh or frozen peas for color. We reached out to La Scarola, one of the most popular Italian-American restaurants in Chicago, for their recipe, and then we adapted it for home cooks. Serve it with plenty of crusty bread, for sopping up the mouthwatering sauce.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2019/10/08/dining/ml-chicken-vesuvio-horizontal/ml-chicken-vesuvio-horizontal-articleLarge-v3.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, weeknight", "keywords": "chicken, green peas, lemon, parsley, russet potatoes, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 993}, "recipeIngredient": ["3 large russet potatoes (about 2 1/4 pounds), scrubbed, halved lengthwise, then into long 1-inch-wide wedges", "5 tablespoons extra-virgin olive oil", "1 1/2 teaspoons dried oregano", "3 pounds bone-in, skin-on chicken thighs (about 8 thighs)", "Kosher salt and black pepper", "4 tablespoons unsalted butter, cut into 4 slices", "6 to 8 garlic cloves, thinly sliced", "1 1/4 cups chicken stock", "1/4 cup dry white wine", "1 cup fresh or frozen green peas", "1/2 lemon, juiced", "Chopped Italian parsley, for serving", "Crusty bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. In a 9-by-13-inch baking dish, toss the potato wedges with 3 tablespoons olive oil and 1/2 teaspoon oregano; season with salt and pepper. Spread the potatoes out in an even layer (it’s O.K. if some overlap). Bake, tossing gently once halfway through cooking, until the edges begin to brown, and the potatoes can be pierced with a fork but are still quite firm, about 30 minutes. (They’ll finish cooking with the chicken.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While potatoes roast, prepare the chicken: Season the chicken with salt, pepper and the remaining 1 teaspoon oregano. In a large 12-inch skillet, heat the remaining 2 tablespoons olive oil over medium-high until it shimmers. Working in batches if necessary, cook the chicken, skin-side down, until it is golden brown, 8 to 10 minutes. Transfer the chicken to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to medium-low, add the butter and garlic to the skillet and cook until the butter is melted and the garlic is fragrant and just beginning to brown, 2 to 3 minutes. Add the chicken stock and wine to the skillet, bring to a simmer and cook for 2 minutes. Add the peas. Pour the mixture evenly over the potatoes, then gently stir to combine. Place chicken on top of the cooked potato mixture, skin-side up. Drizzle any reserved chicken juices on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the chicken is cooked through and the potatoes are tender, 20 to 25 minutes. Turn on the oven’s broiler function, and broil until the chicken skin is golden brown and crisp, 1 to 2 minutes. Drizzle with lemon juice, and sprinkle with parsley. Serve immediately, with plenty of the pan juices spooned over the chicken and potatoes, and crusty bread on the side."}], "link": "https://cooking.nytimes.com/recipes/1020527-chicken-vesuvio"}