{"@context": "http://schema.org", "@type": "Recipe", "name": "Herby Polenta With Corn, Eggs and Feta", "description": "Cooking polenta in the oven has turned out to be quite a game-changer for me, and completely contradicts the belief that polenta needs to consistently be attended to. Do try to find coarse cornmeal here rather than the quick-cooking kind, as that style of polenta simply won’t yield the same smooth and creamy result that you’re looking for. You can also swap out the chicken stock for vegetable stock or water if you’re looking for a vegetarian alternative. I like to serve this as a midday brunch with a zesty green salad, as it’s hearty enough to keep you going until dinner.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2019/05/29/dining/28ottorex/merlin_154779477_40a4bb19-c6f1-4cf6-9fdd-648e194154b3-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "casseroles, grains and rice", "keywords": "cilantro, corn, cornmeal, eggs, feta, polenta, scallion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 563}, "recipeIngredient": ["9 ounces/255 grams frozen corn kernels (about 2 cups), defrosted", "7 ounces/200 grams baby spinach (about 10 lightly packed cups), roughly torn or sliced", "1 cup/150 grams coarse cornmeal", "1 packed cup/50 grams finely grated Parmesan", "5 scallions (spring onions), thinly sliced, 2 tablespoons reserved for garnish", "1/4 cup/20 grams roughly chopped fresh cilantro (coriander), plus 1 tablespoon finely chopped and reserved for garnish", "3 tablespoons roughly chopped flat-leaf parsley", "3 tablespoons roughly chopped fresh dill", "4 garlic cloves, finely chopped", "Salt and black pepper", "2 1/4 cups/530 milliliters whole milk", "2 cups/475 milliliters chicken stock", "3 tablespoons/40 grams unsalted butter, cut into cubes", "5 ounces/140 grams Greek feta, roughly crumbled (about 1 cup)", "8 medium eggs, at room temperature", "2 tablespoons olive oil", "1/2 teaspoon red-pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees Fahrenheit/200 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the corn to a food processor and pulse once or twice, just until roughly chopped. Transfer corn to a large bowl and add the spinach, cornmeal, Parmesan, scallions, 1/4 cup cilantro, parsley, dill, garlic, 1 1/2 teaspoons salt and a good grind of pepper; stir to combine. Transfer this mixture to a large, deep, oven-proof skillet, then add the milk, stock and butter, stirring gently to mix through. Transfer to the oven and bake for 20 minutes, then remove from the oven and give everything a good whisk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return to the oven and bake until the cornmeal is cooked through and the mixture has thickened, about 20 minutes. Give the polenta another good whisk — it should be quite smooth and not completely set — then stir in half the feta. Increase the oven temperature to 425 degrees Fahrenheit/220 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a dinner spoon to make 8 shallow wells in the polenta. Crack an egg into each well and sprinkle lightly with salt and pepper. Sprinkle the remaining feta all over, and bake until the egg whites are cooked and the yolks are still runny, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine the reserved scallions and cilantro in a bowl with the oil. Spoon this mixture all over the polenta and eggs and sprinkle with the red-pepper flakes. Serve directly from the pan."}], "link": "https://cooking.nytimes.com/recipes/1020218-herby-polenta-with-corn-eggs-and-feta"}