{"@context": "http://schema.org", "@type": "Recipe", "name": "Zuni Café’s Small-Batch Aioli", "description": "Zuni Café in San Francisco makes a traditional aioli with only four ingredients: garlic, egg yolk, olive oil and salt. No lemon or vinegar, no mustard, no pepper. Quarts of aioli are produced daily, mounted by hand with a wire whisk. You can, of course, make aioli with an electric blender or food processor in a matter of seconds, but, in “The Zuni Café Cookbook,” the chef Judy Rodgers describes how to make aioli with a mortar and pestle, the old-fashioned way. It takes patience, but the result is sublime. Choose a mild-tasting extra-virgin olive oil, perhaps a French one, or use a mixture of half-olive oil and half-neutral-tasting vegetable oil.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/03/06/dining/06kitchrex3-1/06kitchrex3-1-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "About 1/2 cup", "recipeCuisine": "", "recipeCategory": "quick, condiments, sauces and gravies", "keywords": "egg yolks, garlic, olive oil", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 83}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 250, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "0 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "4 grams", "sodiumContent": "72 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 large or 2 small garlic cloves", "Salt", "1 egg yolk", "1/2 cup mild-tasting extra-virgin olive oil, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut garlic into a few pieces, and pound them in a mortar. Add a pinch of salt, which will act as an abrasive and help you smash the last solid bits of garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the egg yolk and stir with the pestle to combine the mixture. Using the pestle, work in oil, a cautious trickle or a few drops at first, then gradually increasing the flow as the yolk becomes tacky and opaque."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly stir in remaining oil, or as much as you can. As the yolk reaches saturation, the mixture will make a satisfying clucking sound (The aioli will be quite thick at this point.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in a few drops of water. The water will whiten and soften the aioli, allowing you to add a little more oil, in case the garlic seems too aggressive when you taste the aioli. You’ll need the water in any event, or the sauce will be too stiff. (Stirring in 1/2 teaspoon water will allow you to incorporate as much as 1/2 cup more oil.) Stop adding oil when the sauce has the consistency you like. Taste and adjust salt, and thin again with a little more water, if necessary."}]}