{"@context": "http://schema.org", "@type": "Recipe", "name": "Gingery Brownie Crinkle Cookies", "description": "These chocolate cookies are irresistible warm from the oven, when the chips or chunks inside are still luxuriously liquidy. They then cool to a fudgy, brownielike texture with a chewy edge — if any manage to stay around that long. Both fresh and candied ginger lend sophistication, but feel free to leave them out if you want a pure chocolate experience. These cookies are also ideal for late-night cravings: You can be eating them 30 minutes after you start measuring the cocoa powder.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/11/27/dining/ss-ginger-cookie/ss-ginger-cookie-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "20 cookies", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars", "keywords": "bittersweet chocolate, candied ginger, cocoa powder, dutch-processed cocoa powder, ginger, unsalted butter, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 591}, "recipeIngredient": ["1/3 cup/45 grams all-purpose flour", "1/3 cup/30 grams Dutch-processed cocoa powder", "3/4 teaspoon baking powder", "1/2 teaspoon kosher salt", "8 ounces/225 grams bittersweet chocolate (70 percent), broken or chopped into pieces", "1/4 cup/55 grams unsalted butter (1/2 stick)", "2 large eggs, at room temperature", "1/2 cup/100 grams granulated sugar", "1/4 cup/55 grams light brown sugar", "1 tablespoon grated fresh ginger", "1 teaspoon vanilla extract", "4 ounces/115 grams bittersweet chocolate chips or chopped chocolate (about 2/3 cup)", "8 to 10 pieces candied ginger slices (about 2 1/2 ounces/70 grams), thinly sliced crosswise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Combine flour, cocoa powder, baking powder and salt in a medium bowl, and whisk to combine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the 8 ounces bittersweet chocolate and the butter in a small heatproof bowl that fits on top of a small saucepan without falling in. Bring 1 inch of water to a boil in the saucepan over high, reduce to a simmer, then set the bowl on top. Stir occasionally until completely melted. Remove bowl from saucepan to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine eggs, granulated sugar and light brown sugar in the bowl of an electric stand mixer fitted with the whip attachment. Beat on medium speed to combine, scraping down the sides once. Increase speed to high and beat until pale and fluffy, about 5 minutes, scraping the bowl as needed. Add the ginger and vanilla. Beat to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the melted chocolate mixture and beat on medium speed to combine. Add the flour mixture and beat on low speed until just combined. Remove bowl from mixer, scrape sides and fold a few times to make sure everything is well combined. Add the 4 ounces bittersweet chocolate chips and fold to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a small cookie scoop to scoop dough (which will be pretty runny) into generous 1-tablespoon portions. Transfer to parchment-lined baking sheets, setting each scoop 3 inches apart. Top each cookie with a good pinch of candied ginger. Bake until surface is crinkled and edges are firm, 8 to 10 minutes, rotating sheets from front to back and top to bottom halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cookies cool for a few minutes on the baking sheets, and transfer them to a wire rack to cool further. Scoop any remaining dough onto one of the baking sheets — it’s O.K. to reuse the parchment — and repeat. Cookies will keep in an airtight container at room temperature for 3 to 4 days."}], "link": "https://cooking.nytimes.com/recipes/1020655-gingery-brownie-crinkle-cookies"}