{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Mushrooms and White Beans With Buttery Bread Crumbs", "description": "Not really a ragout and not quite a gratin, this hearty meatless casserole has it all: deeply browned mushrooms, creamy white beans, salty feta and crisp bread crumbs. The result is rich, comforting and perfect for a cold night in. Fresh bread crumbs are worth making or seeking out for texture’s sake, but panko will also work nicely. Toss the bread crumbs with melted butter, then briefly broil them for a golden, crunchy topping, a nice contrast to the dish’s silkiness. Paired with a bright salad and a hunk of good bread, this dish works well as a vegetarian main course, or as a companion to sausages and other roasted meats.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/12/19/dining/ch-mushrooms-and-beans/merlin_166104657_42167c9d-2718-48e5-93cf-b5311d9dbb32-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "easy, beans, casseroles, one pot, vegetables", "keywords": "bread crumbs, feta, mushroom, panko, shallot, thyme, white beans, fall, winter, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 663}, "recipeIngredient": ["3 tablespoons olive oil", "1 pound mixed mushrooms, such as cremini, shiitake or oyster, torn or roughly chopped into bite-size pieces", "Kosher salt and black pepper", "1 tablespoon butter", "1 small shallot, finely chopped", "2 large garlic cloves, finely chopped", "1 tablespoon fresh thyme leaves", "1 (15-ounce) can white beans (such as cannellini or great Northern), drained and rinsed", "4 ounces feta cheese, crumbled (about 1 cup)", "1 cup vegetable stock, chicken stock or water", "2 tablespoons roughly chopped Italian parsley", "3 tablespoons unsalted butter", "3/4 cup fresh, coarse bread crumbs or panko", "Kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Prepare the mushrooms: In a large (12-inch) ovenproof skillet, heat the olive oil over medium heat. Add the mushrooms, and season with salt and pepper. Cook, stirring occasionally until they begin to brown and crisp around the edges, 7 to 10 minutes. Add the butter, shallot, garlic and thyme, and stir until the shallot has softened slightly and the garlic is fragrant, about 1 minute. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat and stir the white beans into the skillet. Toss until combined, then top evenly with feta. Add the stock and bake until the stock is slightly bubbling and the feta has slightly softened, 13 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the beans bake, make your bread crumbs: In a small saucepan, melt the butter over medium heat. Turn off the heat, add the crumbs and toss until evenly covered with butter. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the mushroom mixture from the oven and turn on the broil setting. Top the mushrooms and beans with the bread crumbs, then broil until the bread crumbs are golden and the feta is crisp on the edges, 1 to 2 minutes. (Don’t walk away!) Scatter with parsley and serve directly from the pan."}], "link": "https://cooking.nytimes.com/recipes/1020721-baked-mushrooms-and-white-beans-with-buttery-bread-crumbs"}