{"@context": "http://schema.org", "@type": "Recipe", "name": "Rock-Shrimp Roll", "description": "Rock shrimp are meaty and firm, like lobster tail, and have a mild, bland flavor that can really use the help of seasoning at several stages. So we salt them before cooking and during cooking. Once the shrimp are mixed with onion and celery and mayonnaise, taste the shrimp salad as a whole to decide if it could stand even another pinch of salt or grind of pepper. But use unsalted butter on the bun when griddling, to get the perfect play between the sweet and the saline.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2019/06/30/magazine/30mag-eat/48bcfb92f92f4965a83b73fa9ad61f13-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "brunch, dinner, easy, lunch, quick, snack, sandwiches, seafood", "keywords": "dill, egg, endive, rock shrimp, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 133}, "recipeIngredient": ["1/2 cup kosher salt, plus more for seasoning", "1 1/2 pounds peeled raw rock shrimp", "1/2 of 1 small white onion, finely minced", "1 small celery rib from inner core, finely minced", "5 tablespoons mayonnaise (Hellmann’s or Best Foods only!)", "Freshly ground black pepper", "2 large, bushy branches of dill, stems removed, feathery leaves chopped", "1/2 of 1 lemon", "4 tablespoons unsalted butter, at room temperature", "4 hot dog buns, preferably potato", "2 large hard-boiled eggs, peeled then sliced into thin rounds using an egg slicer", "1 small red or green Belgian endive, cut crosswise into thin coins"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a stockpot, bring 2 1/2 quarts of water to a rolling boil, and add the 1/2 cup salt. In a large bowl, prepare an ice bath with 3 to 4 quarts of cold water and about a quart of ice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the shrimp all over with kosher salt, and turn off the heat under the boiling water. Wait 1 full minute before dropping the shrimp into the hot water. Let shrimp cook just until they lose their translucence, 1 to 2 minutes. Strain, then plunge into the ice bath just until cooled, no more than 2 minutes. Pat shrimp dry, and transfer to a cutting board. Roughly chop the shrimp by making a few cuts through the pile with your chef’s knife until shrimp is cut into medium, bite-size pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer chopped shrimp to a bowl, and stir in the onion, celery and 3 tablespoons mayonnaise. Season to taste with kosher salt, pepper, chopped dill and a few drops of lemon juice. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large cast-iron skillet over medium. Evenly butter the interior and exterior of each hot dog bun. Working in batches, toast the buns inside and out in the skillet until golden brown. (We love as much buttery griddled surface area as possible.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, remove the buns from the skillet, and slather the interiors with the remaining mayonnaise. Evenly distribute the shrimp salad among the buns. Top each roll with alternating slices of hard-boiled egg and endive, then sprinkle each roll with a little kosher salt, a short grind of fresh black pepper and a few drops of lemon juice."}], "link": "https://cooking.nytimes.com/recipes/1020322-rock-shrimp-roll"}