{"@context": "http://schema.org", "@type": "Recipe", "name": "Honey-Apple Bread Pudding", "description": "Soft and cakelike challah makes for a deluxe bread pudding. This one is shot through with cubes of apples caramelized in honey, then topped with sliced almonds for crunch. You can assemble the pudding up to two days ahead of time and store it, covered, in the refrigerator. Then pop it into the oven an hour or two before you want to serve it, adding a few minutes onto the baking time. It’s best served warm, when the apples are at their most jamlike. But leftovers served cold from the fridge make a terrific breakfast.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/09/26/dining/mc-challah-bread-pudding/mc-challah-bread-pudding-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, snack, casseroles, custards and puddings", "keywords": "almond, apple, challah, challah bread, cinnamon, honey, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 141}, "recipeIngredient": ["4 tablespoons unsalted butter, plus more for greasing the pan", "1 pound challah loaf, cut into 1-by-2-inch pieces", "6 tablespoons honey", "6 apples (about 2 3/4 pounds, an assortment of varieties works well), peeled and diced into 1/2-inch cubes (8 cups)", "1 vanilla bean, split lengthwise, seeds scraped", "1/2 teaspoon plus a pinch of fine sea salt", "2 cups half-and-half or heavy cream", "1 1/2 cups whole milk", "5 large eggs plus 3 large egg yolks", "1/2 cup granulated sugar", "1/2 teaspoon ground cinnamon", "1/4 teaspoon ground nutmeg", "1/2 cup sliced almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees and butter a 9-by-13-inch baking dish or large gratin dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a rimmed baking sheet, spread bread in an even layer. Toast, tossing once or twice, until dried out and light golden, about 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat honey in a large nonstick skillet over medium-high and cook until it caramelizes, about 5 minutes — you’ll be able to tell when it begins to brown and smells nutty."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and stir in butter until it melts, then stir in apples, vanilla seeds and pod, and a pinch of salt. Return to medium-high heat, cover and cook, stirring frequently, until apples are soft and liquid has mostly evaporated, about 10 minutes. Transfer apples and any liquid to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate large bowl, whisk together half-and-half, milk, eggs and yolks, sugar, cinnamon, nutmeg and 1/2 teaspoon salt. Gently toss in bread and half the cooked apples (reserve the other half for later). Scrape into prepared baking dish, cover with foil, and bake for 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove foil, and spoon remaining apples on top in an even layer. Drizzle or scrape any reserved apple liquid all over the top, then top with almonds. Return to oven and bake, uncovered, until almonds are toasted and pudding is set but not dry, another 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool for at least 15 minutes, then cut into squares and serve, preferably warm."}], "link": "https://cooking.nytimes.com/recipes/1020508-honey-apple-bread-pudding"}