{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Chipotle Chicken Pozole", "description": "A pressure cooker is the perfect tool for making a quick pozole that tastes like it has simmered for a long time. Traditional red pozole usually requires toasting and puréeing dried chiles for a flavorful broth, but this one relies on canned chipotles for smoky complexity. Chipotles can be fiery, so feel free to use fewer peppers if you’re concerned about the heat, but don’t skimp on the adobo sauce: It’s milder than the peppers and is packed with loads of smoky, garlicky flavor. Serve the soup in bowls with plenty of crumbled cheese, diced avocado and crushed chips, for topping.\n\n<p><em>The slow-cooker version of this dish uses bone-in, skin-on chicken thighs, carrots and celery, is available <a href=\"https://cooking.nytimes.com/recipes/1019692-slow-cooker-shortcut-chicken-pozole?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=1\">here</a>.</p></em>", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/03/19/dining/sd-pressure-cooker-chipotle-chicken-pozole/sd-pressure-cooker-chipotle-chicken-pozole-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 to 6 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, weekday, soups and stews", "keywords": "chicken thigh, chipotle, corn, hominy, onion, pozole, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 419}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 389, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "44 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1117 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons vegetable oil", "1 large red or yellow onion, finely chopped", "Kosher salt", "8 cloves garlic, finely chopped", "1 (7-ounce) can chipotle peppers in adobo sauce", "1 teaspoon onion powder", "1 teaspoon garlic powder", "1 teaspoon ground cumin", "1/2 teaspoon dried oregano", "2 1/2 pounds boneless, skinless chicken thighs", "5 cups chicken broth or stock", "1 cup frozen corn", "1 (29-ounce) can pozole (hominy), rinsed and well drained", "Juice of 1 lime (about 2 tablespoons), plus more as needed", "Crushed tortilla chips, shredded cabbage, diced avocado, crumbled queso fresco, minced red onion and cilantro, for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the sauté setting, heat oil in a 6- to 8-quart pressure cooker. Add the onion, season it with salt and cook, stirring often, until the onion is softened and translucent, about 5 minutes. Add the garlic and cook, stirring, until slightly softened and fragrant, 2 minutes. Turn the sauté setting off."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the can of chipotles and remove the chiles, leaving as much of the adobo sauce behind as possible. (Scrape the sauce off the chiles with your fingers as best you can.) Set the chiles aside and add the adobo sauce to the pressure cooker. Chop 1 to 4 of the chiles until they are almost a paste. (Determine the number of chiles according to your desired level of heat: 1 chile for a very mild soup and 4 for a very spicy soup.) Add the chiles to the pressure cooker. (Store remaining chiles in an airtight container in the refrigerator for 5 days and in the freezer indefinitely.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the sauté setting, add onion and garlic powders, cumin and oregano to the pressure cooker. Cook, stirring constantly, until fragrant and heated through, about 1 minute. Stir in the chicken until coated, scraping the bottom of the pan. Add the broth and 1/2 teaspoon salt (but hold off on the salt if you are using fully salted broth.) Close the lid and cook on high pressure for 18 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the pressure release naturally for 5 minutes, then release remaining pressure manually. (If hot liquid spurts out of the knob along with the steam, carefully close it and wait 5 more minutes before releasing remaining pressure.) Using a ladle, skim excess fat from the surface of the soup, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the sauté setting, coarsely shred the chicken in the pot using 2 forks. Add the corn and the pozole and simmer until warmed through, 3 to 5 minutes. Add the lime juice and taste; add more salt or lime juice if necessary. Serve the soup in bowls with the toppings of choice."}], "link": "https://cooking.nytimes.com/recipes/1020110-pressure-cooker-chipotle-chicken-pozole"}