{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Roast Chicken and Mustard-Glazed Cabbage", "description": "This hearty one-pan meal is inspired by the classic combination of sausage and sauerkraut, but with chicken in place of pork and fresh cabbage instead of fermented. Cabbage slices are brushed with a simple mustard vinaigrette, then roasted underneath chicken thighs that have been seasoned with cumin and coriander. In the heat of the oven, the chicken crisps, the cabbage softens and the red onion becomes jammy and sweet. Serve with crusty bread and additional mustard on the side.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/11/21/dining/aw-chicken-with-cabbage/aw-chicken-with-cabbage-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry, vegetables", "keywords": "apple cider vinegar, cabbage, capers, chicken, coriander, cumin, mustard, red onion, dairy-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 826}, "recipeIngredient": ["1/2 cup olive oil, plus more for brushing and drizzling", "2 tablespoons stone-ground coarse mustard, plus more for serving", "4 garlic cloves, minced", "4 teaspoons apple cider vinegar", "4 teaspoons cumin seeds", "Kosher salt and black pepper", "1 medium head green cabbage (about 2 1/2 pounds)", "2 medium red onions, peeled, then cut into 1/2-inch rounds", "1/4 cup drained capers", "1 1/2 teaspoons ground coriander", "1 teaspoon ground cumin", "6 bone-in, skin-in chicken thighs (about 3 pounds total)", "Torn fresh parsley, dill or arugula sprigs, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Prepare the dressing: In a small bowl, whisk together 1/2 cup olive oil with the mustard, garlic, vinegar and cumin seeds. Season generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cabbage: Halve the cabbage lengthwise through the core, then cut each half into 1-inch-thick wedges. (Make sure to continue cutting lengthwise through the core to keep the pieces intact.) You should have about 16 pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cabbage wedges to a large (13-by-18-inch) baking sheet. Brush all the wedges with half the vinaigrette, then carefully turn and brush the other side with remaining vinaigrette. Arrange in an even layer, then season generously with salt and pepper. On a separate baking sheet, brush the red onion rounds with olive oil on both sides; season generously with salt and pepper. Add the onion rounds to the cabbage wedges, interspersing the red onion and cabbage and tucking some onion rounds partly underneath. Sprinkle the capers evenly on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chicken: In a small bowl, toss the coriander and cumin with 1 tablespoon salt and 1 1/2 teaspoons pepper. Place the chicken on the sheet pan where you oiled the onions and drizzle with olive oil all over, then rub the seasoning all over the chicken. Arrange the chicken pieces on top of the cabbage and onions, skin-side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to the oven and roast until the chicken is cooked through and the cabbage is lightly browned in spots and tender, about 35 to 40 minutes. Top with parsley or dill and serve immediately, passing more mustard on the side."}], "link": "https://cooking.nytimes.com/recipes/1020659-sheet-pan-roast-chicken-and-mustard-glazed-cabbage"}