{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Beef Stew With Maple and Stout", "description": "This savory-sweet stew is delightfully hands-off — no sautéing, searing or simmering. The key is the timing: Cook the beef first and add the vegetables later to ensure that the meat tenderizes while the vegetables retain some bite. Real maple syrup gives the dish a sweetness that pairs well with the mild bitterness of stout beer. Carrots, potatoes and parsnips are classic stew vegetables, but rutabaga or celery root work well, too. A squeeze of lemon at the end brightens the flavors of this cold-weather dish.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/03/12/dining/sd-pressure-cooker-maple-stout-beef-stew/sd-pressure-cooker-maple-stout-beef-stew-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, soups and stews", "keywords": "Balsamic Vinegar, Chuck Roast, Clove, Maple Syrup, Stout Beer, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 221}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 538, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "6 grams", "proteinContent": "54 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1246 milligrams", "sugarContent": "14 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 pounds beef chuck roast, excess fat trimmed, meat cut into 2-inch pieces", "Kosher salt and black pepper", "1/4 cup all-purpose flour", "3 thyme sprigs", "2 rosemary sprigs", "1 cup beef broth (or 1 1/4 cups if using an 8-quart pot)", "3/4 cup stout beer (or 1 cup if using an 8-quart pot)", "1/4 cup real maple syrup, preferably dark", "4 garlic cloves, chopped", "1 teaspoon red-pepper flakes", "1 teaspoon onion powder", "1 teaspoon garlic powder", "2 tablespoons balsamic vinegar, preferably aged", "3 large carrots, peeled and cut into 1 1/2-inch pieces", "2 parsnips, peeled and cut into 1 1/2-inch pieces", "2 large russet potatoes, peeled and cut into 1 1/2-inch pieces", "2 tablespoons fresh lemon juice, plus more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beef to a 6- to 8-quart pressure cooker, season it generously with salt and pepper and toss it with the flour until evenly coated. Add the herb sprigs, the broth, beer, syrup, garlic, red-pepper flakes, onion and garlic powders and 1 tablespoon vinegar; stir to combine. Cover and set steam valve to sealed position. Cook on high pressure for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the pressure release naturally for 15 minutes, then release the remaining pressure manually. (If hot liquid spurts out with the steam, close the knob and wait a few more minutes, then release again.) Stir in the carrots, parsnips and potatoes; season with salt and pepper. Cover and set steam valve to sealed position. Cook on high pressure for 18 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the pressure release naturally for 15 minutes, then release the remaining pressure manually. (If hot liquid spurts out with the steam, close the knob and wait a few more minutes, then release again.) Remove and discard the rosemary and thyme sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the remaining 1 tablespoon vinegar. Season to taste with more salt and pepper, as needed. Add the lemon juice. If the vegetables are not tender, or if the broth is not as thick as you would like, using the sauté setting, simmer for a few minutes. (You can also stir to encourage the potatoes to fall apart a little, which will help thicken the broth.) Divide among shallow bowls."}]}