{"@context": "http://schema.org", "@type": "Recipe", "name": "Bhatti da Murgh (Indian Grilled Chicken With Whole Spices)", "description": "Adapted from the chef Chintan Pandya of Adda Indian Canteen in Long Island City, Queens, this fiery, aromatic recipe calls for marinating whole chicken legs in yogurt, ginger-garlic paste and ground spices, then coating them in cracked whole spices before roasting. The ground spices imbue the meat with flavor while the whole spices add pungency and a wonderful crunch. At Adda, Mr. Pandya cooks these in a tandoor. But you can roast them in your oven, or cook them on the grill using indirect heat and a baking sheet. In either case, brushing the sizzling chicken skin with plenty of melted butter is the key to its rich taste and burnished crispness.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/07/24/dining/19apperex1/19apperex1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, poultry", "keywords": "cardamom, chicken legs, garlic, ginger, yogurt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 174}, "recipeIngredient": ["6 whole, bone-in chicken legs (drumsticks with thighs attached, about 4 1/2 pounds)", "2 tablespoons finely grated garlic (about 6 large cloves)", "2 tablespoons finely grated fresh ginger", "1 tablespoon white vinegar", "1 1/2 teaspoons ground cayenne, or to taste", "1 1/2 teaspoons garam masala", "2 teaspoons fine sea salt", "1/2 cup plain whole milk yogurt", "1/2 teaspoon freshly ground black pepper", "1/2 teaspoon ground clove", "1/2 teaspoon ground mace", "1/2 teaspoon ground anise or fennel seeds", "1/2 teaspoon ground black cardamom (optional)", "1/2 teaspoon ground green cardamom", "2 teaspoons cumin seeds", "2 teaspoons coriander seeds", "1 1/2 teaspoons red-pepper flakes", "3 to 4 tablespoons melted salted butter, as needed for basting", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pop the joint on each leg: Grasp a drumstick in one hand and a thigh in the other, and bend the joint back until you hear a crack. This helps the leg cook more evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a small knife, make a slash in the meaty part of each drumstick and thigh twice or three times, going all the way to the bone."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, stir together garlic, ginger, vinegar, cayenne, garam masala and salt. Keep half the mixture in the bowl and set aside; rub remaining mixture all over chicken, getting underneath the skin. Refrigerate for at least 20 minutes (or up to 2 hours) while you prepare the yogurt marinade."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir yogurt into the large bowl with ginger-garlic mixture, then stir in black pepper, clove, mace, anise, black cardamom (if using) and green cardamom. Transfer spice-rubbed chicken to yogurt mixture, tossing gently to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and refrigerate chicken for at least 6 hours, and preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, prepare the grill for indirect heat. (If using a charcoal grill, mound coals to one side, allowing for an area of indirect heat. If using a gas grill, turn on only a few of the burners and leave the rest off.) Or heat oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mortar and pestle, the flat side of a knife or a spice grinder for a very brief time, crack the cumin, coriander and red-pepper flakes but do not grind; you want a coarse texture here. Sprinkle spice mix onto chicken to coat each piece."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a rimmed baking sheet on the unlit side of the grill or in the oven and let heat for 15 minutes. Carefully place chicken on the hot baking sheet and drizzle each piece with a little melted butter. Cover grill, if grilling. Let chicken cook for 25 to 35 minutes, drizzling with melted butter two or three times. The chicken is done when the skin is dark brown and the juices run clear when pricked with a knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you are grilling, you can sear the chicken over direct heat for 1 to 2 minutes per side just before serving to char the skin, but this is optional. Serve chicken on a platter, with lime wedges on the side."}]}