{"@context": "http://schema.org", "@type": "Recipe", "name": "Mast-o Khiar (Persian Cucumber and Herb Yogurt)", "description": "Yogurt, both plain and with cucumbers, is everywhere on Iranian tables — the thicker and sourer, the better. Mast-o khiar is an everyday side similar to Indian raita or Greek tzatziki, but raisins, walnuts and rose petals elevate this version of the dish, adding a host of different flavors and textures. Dice, rather than grate, the cucumbers to keep them from getting watery, and don’t skip the dried mint and dried dill, which add dimension to the fresh herbs.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2019/05/15/dining/14Iranianrex9/merlin_154113654_5408eef0-6a17-476c-ab05-9d62d6c4635c-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "About 4 cups", "recipeCuisine": "middle eastern", "recipeCategory": "easy, quick, condiments, salads and dressings", "keywords": "cucumber, greek yogurt, herbs, walnut, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 126}, "recipeIngredient": ["1/4 cup black or golden raisins", "3 Persian cucumbers (about 1/2 pound)", "24 ounces Greek yogurt or labneh (3 cups)", "2 tablespoons any combination of finely chopped fresh parsley, cilantro, basil, tarragon or dill", "1 garlic clove, finely grated or pounded into a smooth paste with a pinch of salt", "Fine sea salt and freshly ground black pepper", "3/4 teaspoon ground or crumbled dried rose petals (optional)", "1 teaspoon dried mint", "1 teaspoon dried dill", "3 tablespoons roughly chopped toasted walnut pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, submerge the raisins in boiling water to plump for 10 minutes, then drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove alternating stripes of peel on cucumbers and trim ends. Dice cucumbers into 1/4-inch pieces and place in a large bowl with raisins, yogurt, fresh herbs, garlic, 3/4 teaspoon salt, 1/2 teaspoon pepper and, if using, half the rose petals. Using your fingers to break up any large pieces, gently grind the dried mint and dried dill into the bowl. Stir to combine and adjust seasoning with salt as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, stir in the walnuts and transfer to serving bowl. Garnish with remaining rose petals, if using. Cover and refrigerate leftovers for up to 3 days."}], "link": "https://cooking.nytimes.com/recipes/1020213-mast-o-khiar-persian-cucumber-and-herb-yogurt"}