{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Tahini Mousse", "description": "Dense and very creamy, this dark chocolate mousse has pockets of sesame tahini swirled through it, weaving a nutty flavor into the bittersweet. The candied cacao nibs add a piquant, caramelized crunch. But feel free to skip them, and simply sprinkle plain nibs on top of the mousse. Or substitute another crunchy topping, such as chopped, toasted almonds or walnuts, or sesame brittle.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/02/12/dining/11Chocolaterex-mousse1/merlin_168265245_6a5bef3b-3fe4-40fd-8c89-c60a5c5faedb-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "custards and puddings", "keywords": "bittersweet chocolate, cocoa, crème fraîche, tahini, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 205}, "recipeIngredient": ["1 cup/240 milliliters cold heavy cream", "1 tablespoon confectioners’ sugar", "1 teaspoon vanilla extract", "Pinch of fine sea salt", "5 ounces/140 grams extra bittersweet chocolate (around 70 percent), chopped", "1/2 cup/65 grams confectioners’ sugar", "1/4 cup/60 milliliters tahini", "1/3 cup/80 milliliters crème fraîche", "1 teaspoon vanilla extract", "Pinch of fine sea salt", "2/3 cup/160 milliliters heavy cream", "1/4 cup/50 grams granulated sugar", "1/2 cup/60 grams cacao nibs", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cream for the chocolate mousse: Using an electric mixer fitted with a whisk or beaters, combine 3/4 cup cream, confectioners’ sugar, vanilla and salt. Whip to medium-firm peaks, then transfer whipped cream to a bowl and refrigerate until ready to finish the mousse in Step 6."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the tahini mousse: In the same mixer bowl (no need to wipe it out), combine confectioners’ sugar, tahini, crème fraîche, vanilla extract and salt. Beat everything together until smooth, scraping the sides of the bowl as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce mixer speed to low and slowly beat in cream until the tahini mousse thickens. It will be thinner than whipped cream but should still mound on a spoon. Refrigerate while you finish preparing chocolate mousse."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chocolate in a small bowl. Melt in the microwave in 30-second bursts, stirring after each burst. Heat an inch of water in a medium pot over medium-high until simmering. (Alternatively, put chocolate into a large heatproof bowl and place it over the simmering water. Stir chocolate occasionally with a silicone spatula until it melts.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove bowl of melted chocolate from the pot. Pour in remaining 1/4 cup cream, and let sit for 1 minute. Whisk until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a rubber spatula, fold in 1/3 of the prepared whipped cream into the chocolate mixture, then fold in remaining whipped cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently fold tahini mousse into chocolate mousse, leaving very visible streaks. Place mixture in serving bowls or ramekins, and chill until firm, at least 2 hours and up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As mousse sets, make the candied cacao nibs (if using): Heat oven to 325 degrees, and line a rimmed baking sheet with parchment paper. In a small pot, bring sugar and 1/4 cup/60 milliliters water to a boil, and simmer, stirring, until sugar has completely melted, 2 to 4 minutes. Remove from heat and stir in cacao nibs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread nibs in an even layer on prepared baking sheet. Bake until dry and crunchy, about 20 minutes, stirring halfway through. Let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon nibs, if using, on top of mousse, sprinkle with flaky sea salt, and serve."}]}