{"@context": "http://schema.org", "@type": "Recipe", "name": "Parmesan Broth", "description": "Parmesan broth boosts the flavor of everything it touches. More robust than meat- or vegetable-based stocks, this kitchen staple summons the complex essence of aged cheese to serve as a liquid foundation for simmered beans, <a href=\"https://cooking.nytimes.com/recipes/1020933\">brothy soups</a> and <a href=\"https://cooking.nytimes.com/recipes/1020935\">braised vegetables</a>. This recipe relies on leftover Parmesan rinds, which can be collected over time and stored in the freezer, or bought at some supermarket cheese counters and most specialty cheese shops. If refrigerating the broth for later use, break up the solidified fats with the back of a spoon, or warm to redistribute before using.", "author": {"@type": "Person", "name": "Julia Sherman"}, "image": "https://static01.nyt.com/images/2020/03/18/dining/13Parmrex1/merlin_170016945_729a14a2-79fc-452f-8da7-cc829f850abe-articleLarge.jpg", "totalTime": "PT2H45M", "recipeYield": "About 9 cups", "recipeCuisine": "american", "recipeCategory": "soups and stews", "keywords": "appetizer, side dish, bay leaves, garlic, olive oil, parmesan, parsley, thyme, yellow onion, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 96}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "1 large (skin-on) yellow onion, quartered from tip to tip", "1 whole head garlic, cut in half crosswise", "3/4 pound Parmesan rinds (about 5 large rinds)", "15 fresh parsley sprigs", "8 fresh thyme sprigs", "2 teaspoons whole black peppercorns", "2 dried bay leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven or heavy pot, heat the oil over medium. Add onion quarters and halved garlic, and cook, flat-side down, until the onion and garlic are lightly brown, about 3 minutes. Add Parmesan rinds, parsley, thyme, peppercorns, bay leaves and 12 cups water; bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the water comes to a boil, reduce to a simmer. Partly cover and cook, stirring occasionally to prevent the cheese from sticking to the bottom of the pot, until broth is cloudy and tastes strongly like Parmesan, 2 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the broth through a fine-mesh sieve, pressing the vegetables and cheese rinds to extract as much liquid as possible. Let cool, then store the broth in the refrigerator up to 1 week or the freezer up to 3 months."}]}