{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick Chicken and Dumplings", "description": "This is the perfect soup for when you’re craving chicken and dumplings, but not quite up to the task of making the traditional dish. Store-bought rotisserie chicken and gnocchi live their best lives here, simmered in a comforting broth of chicken stock and heavy cream seasoned with rosemary and thyme. Leeks, carrots and celery are standard, but butternut squash, parsnips, mushrooms, fennel or shallots are worthy additions. Simply sauté your aromatics and vegetables, simmer with some chicken stock and cream, stir in the chicken and gnocchi, and dinner is done in 20 minutes from start to finish.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/12/30/dining/aw-quick-chicken-and-dumplings/merlin_166281663_9a0644d2-4d94-42f0-981c-87ab8c630d16-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": " 4 to 6 servings (about 9 cups)", "recipeCuisine": "american", "recipeCategory": "dinner, quick, weekday, poultry, soups and stews", "keywords": "carrot, celery, chicken, chicken stock, garlic, gnocchi, heavy cream, leek, rosemary, thyme, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 710}, "recipeIngredient": ["3 tablespoons unsalted butter", "2 medium carrots or 8 ounces butternut squash, peeled and chopped into 1/2-inch pieces (about 1 cup)", "1 medium leek, trimmed, white and pale green portion halved lengthwise and thinly sliced (about 1 cup)", "2 medium celery stalks, peeled and sliced 1/2-inch thick (about 2/3 cup)", "3 garlic cloves, finely chopped", "1 tablespoon finely chopped fresh rosemary", "2 teaspoons fresh thyme leaves", "1 teaspoon poultry seasoning (optional)", "Kosher salt and black pepper", "3 tablespoons all-purpose flour", "5 cups chicken stock", "1 cup heavy cream", "1 (16-ounce) package fresh or shelf-stable store-bought gnocchi", "1/2 small (3-pound) store-bought rotisserie chicken, skin and bones discarded, meat torn into bite-size pieces (about 2 cups shredded meat)", "Fresh tarragon, parsley or dill, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, melt the butter over medium. Add the carrots, leek, celery, garlic, rosemary, thyme and poultry seasoning, if using. Season generously with salt and pepper, and cook, stirring occasionally, until vegetables are slightly softened, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with the flour, then cook, stirring, 2 minutes. (This cooks the flour to soften its raw flavor.) Gradually stir in the stock and cream, and bring to a boil over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the mixture boils, stir in the gnocchi, reduce the heat to medium and cook until gnocchi and vegetables are tender, about 5 minutes. Stir in the chicken in the last couple of minutes. Season to taste with salt and pepper. Divide among bowls and top with fresh tarragon and more black pepper, if desired."}], "link": "https://cooking.nytimes.com/recipes/1020756-quick-chicken-and-dumplings"}