{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Ribollita With Smoked Mozzarella Toasts", "description": "This classic Italian vegetable stew is a wonderful way to revive leftover cooked vegetables and stale bread (r<span>ibollita means “reboiled” in Italian)</span>. You can prepare it <a href=\"https://cooking.nytimes.com/recipes/1016052-ribollita?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=1\">in a pot</a> following a more traditional method, but here, a pressure cooker makes it possible to cook dried beans relatively quickly without having to soak them. Thanks to a quick sauté in olive oil, the vegetables become silky and almost disappear into the soup. If you’d like to add leftover cooked vegetables, throw them in with the greens at the very end so they don’t overcook.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2020/01/22/dining/sd-pressure-cooker-ribollita/merlin_167531451_147de213-6af4-4542-bdba-f1837006ea83-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings (about 8 cups)", "recipeCuisine": "italian", "recipeCategory": "dinner, soups and stews", "keywords": "cannellini beans, celery, fennel, kale, leek, lemon, mozzarella, onion, rosemary, thyme, tomato, white wine, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 104}, "recipeIngredient": ["1/4 cup olive oil, plus more for drizzling", "1 large yellow or red onion, finely chopped", "Kosher salt and black pepper", "1 large leek, trimmed, white and light green parts sliced", "3 celery stalks, finely chopped", "1 small fennel bulb, trimmed, cored and finely chopped, fronds reserved", "14 garlic cloves, smashed and roughly chopped", "2 dried bay leaves", "1 teaspoon red-pepper flakes, plus more for serving", "1 cup dry white wine", "5 cups chicken or vegetable stock", "1 1/2 cups dried white beans, such as cannellini or great Northern (no need to soak)", "1 (15-ounce) can crushed tomatoes", "3 fresh thyme sprigs or 1 teaspoon dried thyme", "1 fresh rosemary sprig or 1/2 teaspoon dried rosemary", "2 tablespoons fresh lemon juice (from about 1/2 lemon)", "1 bunch kale, chard or collards (about 12 ounces), stemmed and finely chopped, or 1 (10-ounce) bag frozen chopped spinach or kale", "2 teaspoons balsamic vinegar, preferably aged", "8 slices crusty bread, for serving", "1 garlic clove, cut in half", "Olive oil", "8 ounces smoked or regular mozzarella, cut into 8 (1/4-inch-thick) slices"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on the sauté setting of a 6- to 8-quart electric pressure cooker and heat the oil. Add the onion, season with salt, and cook, stirring occasionally, until limp and translucent, 6 to 8 minutes. Add the leek, celery and fennel, season with salt, and cook, stirring occasionally, until softened and fragrant, about 8 minutes. Add the chopped garlic, bay leaves, red-pepper flakes and white wine; season with a generous amount of pepper. Stir well and let the wine come to a simmer before turning off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the stock, beans, tomatoes, thyme, rosemary and lemon juice. Cook on high pressure until the beans are creamy, 50 minutes to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the pressure to release naturally for 10 minutes, then release the remaining pressure manually. Turn on the sauté setting. Remove and discard the bay leaves and herb sprigs (if using). Stir in the greens and vinegar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the greens cook, stirring occasionally, while you make the toasts: Turn on the broiler. Rub the bread slices with the halved garlic and drizzle them with olive oil. Position a rack 6 inches from the broiler, and toast the slices until very light golden, 1 to 2 minutes. Add 1 slice of mozzarella to each toast and broil until softened and browned in spots."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the soup to taste with salt and pepper. Divide the soup among bowls, adding a mozzarella toast in each bowl. Top with the reserved fennel fronds and black pepper or red-pepper flakes, if desired."}], "link": "https://cooking.nytimes.com/recipes/1020826-pressure-cooker-ribollita-with-smoked-mozzarella-toasts"}