{"@context": "http://schema.org", "@type": "Recipe", "name": "Boxty (Irish Potato Pancakes)", "description": "Boxty, breadlike potato pancakes that originated in Ireland as early as the late 18th century, were created as a resourceful way to transform less-than-stellar potatoes into a hearty side dish. Variations of these crisp, chewy potato pancakes abound, but most involve some combination of mashed potatoes, grated potatoes, flour, baking soda or baking powder; buttermilk or eggs are sometimes added for richness. Popular in pubs but also made at home, they’re typically served as an accompaniment to stews and rich meat dishes. This recipe is adapted from “The Irish Cookbook” by Jp McMahon (Phaidon, 2020), who serves them in a more modern fashion, with smoked salmon, sour cream and pickled onions, which balance and brighten.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2020/03/04/dining/aw-boxty/merlin_170015676_abe38e61-3506-4f73-8493-f30ee1e3b5ce-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 12 pancakes", "recipeCuisine": "irish", "recipeCategory": "brunch, dinner, lunch, weeknight, breads, vegetables", "keywords": "apple cider vinegar, butter, buttermilk, flour, potato, red onion, sugar, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 127}, "recipeIngredient": ["1/2 small red onion", "1/4 cup apple cider vinegar", "2 tablespoons granulated sugar", "1 tablespoon kosher salt", "Fine sea salt and black pepper", "2 pounds all-purpose potatoes, preferably Rooster or Yukon gold", "1 cup buttermilk", "1 1/2 cups all-purpose flour, sifted", "1 teaspoon baking powder", "4 to 6 tablespoons unsalted butter, as needed", "Smoked salmon and sour cream, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pickled red onions: Slice the red onion thinly from stem to stem, then transfer slices to a small heatproof bowl. In a small saucepan, combine the vinegar, sugar, salt and 1/2 cup water. Bring to a simmer over medium, stirring occasionally, until sugar and salt dissolve, then pour on top of onions; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the boxty: Fill a medium saucepan halfway with water; season generously with salt and bring to a boil over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel half the potatoes, then cut them into 1-inch cubes, tossing the cubes into the water as you go. Once the water comes to a boil, continue to cook until potatoes are soft, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the diced potatoes boil, peel the remaining potatoes, then grate them coarsely using a box grater. Season the grated potatoes generously with 2 teaspoons sea salt and 1 teaspoon pepper, toss to coat, then transfer them to a clean, dry kitchen towel. Squeeze the grated potatoes over a sink to remove the excess liquid, then transfer them to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the diced potatoes are soft, transfer them to a colander to strain, then transfer to the large bowl with the grated potatoes; mash until creamy, and mashed and grated potatoes are well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the buttermilk on top of the warm potato mixture and stir briefly just to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour and baking powder and stir until thoroughly combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large cast-iron or nonstick skillet, heat 2 tablespoons butter over medium heat. Working in batches, spoon in the potato mixture using 1/3 cup measure to form small 3- to 4-inch-wide pancakes, leaving at least 1 inch of space between pancakes. Cook until nicely browned on both sides, 4 to 5 minutes per side. Repeat with remaining pancakes, adding more butter between batches as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve pancakes topped with pickled red onions, and smoked salmon and sour cream, if you like."}]}