{"@context": "http://schema.org", "@type": "Recipe", "name": "Savory Steel-Cut Oats With Fried Egg and Za’atar", "description": "Oat porridge for breakfast is often topped with brown sugar and cream. Though sweetened porridge is delicious, a savory approach with oats makes a nice change. Think of oats as a fine substitute for rice — you don’t always want rice pudding, do you? Steel-cut oats have a nutty whole-grain flavor and retain a nubbly texture, far superior to rolled oats; they pair nicely with savory toppings, for a risotto-like effect. This easy, hearty dish is actually suitable for any time of day, not just morning. If you can’t find za’atar (a splendid spice mix of wild thyme, sumac and sesame used throughout the Middle East), try a sprinkling of toasted ground cumin or a pinch of oregano, or a generous amount of freshly ground black pepper. It’s hard to cook a single portion of oats, so make the full batch. Leftovers can be reheated for another day’s breakfast. (And if rolled oats is all you have, it’s no crime.)", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/04/08/dining/03Tanisrex1-oats/merlin_171108087_2797a7cc-dd77-45dc-8bfc-8b892db8c651-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "1 serving", "recipeCuisine": "mediterranean", "recipeCategory": "breakfast, grains and rice", "keywords": "egg, steel-cut oats, za’atar, main course, vegetarian", "aggregateRating": null, "recipeIngredient": ["1 cup steel-cut oats (pinhead, not rolled)", "Salt", "Extra-virgin olive oil", "1 large egg", "A few strips of roasted red pepper (jarred is fine)", "1 teaspoon chopped scallion", "Red-pepper flakes", "Za’atar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil 3 cups water in a small saucepan. Add oats with a big pinch of salt, and simmer over low heat for 20 minutes. Cover and let rest off heat for 10 minutes. Taste and adjust salt. Beat in a little boiling water if oats are too firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet over medium-high, heat 1 tablespoon oil. Fry egg sunny side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put oats in a low bowl and place egg on top. Garnish with strips of roasted pepper. Sprinkle with scallion, red-pepper flakes to taste, and finish with about 1/2 teaspoon za’atar. Drizzle with a little more olive oil."}], "link": "https://cooking.nytimes.com/recipes/1020973-savory-steel-cut-oats-with-fried-egg-and-zaatar"}