{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemony Pasta With Asparagus and White Beans", "description": "Marinating canned white beans in lemon juice and zest, along with red-pepper flakes and shallots, imbues them with brightness and a touch of heat, adding so much flavor to this warm-weather pasta. It’s dead simple to make: While the pasta cooks and the beans marinate, sauté the asparagus in olive oil, then use that pan to finish the dish. There’s enough asparagus in the mix to make this a one-pan meal, but serving it with a crisp green salad on the side will add a little crunch and freshness.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/06/04/dining/mc-lemony-pasta-with-asparagus/mc-lemony-pasta-with-asparagus-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, noodles, pastas", "keywords": "asparagus, lemon, parmesan, parsley, pasta, white beans, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 298}, "recipeIngredient": ["1 large lemon, plus more fresh lemon juice for serving", "1 (15-ounce) can white beans, rinsed", "1 shallot, finely diced, or 2 tablespoons finely diced red onion", "3 garlic cloves (2 thinly sliced, 1 finely grated)", "1/4 teaspoon red-pepper flakes, plus more to taste", "Kosher salt", "4 tablespoons extra-virgin olive oil", "1 pound short pasta, such as campanelle, fusilli or farfalle", "2 bunches asparagus (about 2 pounds), ends trimmed, stalks sliced into 1/2-inch pieces", "2/3 cup coarsely chopped Italian parsley leaves", "1/2 cup grated Parmesan, plus more for serving", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate the zest from the lemon into a small bowl. Halve the lemon and squeeze the juice from half of it on top of the zest. Add the white beans, shallot or onion, grated garlic, red-pepper flakes and a large pinch of salt and toss well. Drizzle in 1 tablespoon olive oil and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of heavily salted water to a boil. Add pasta and cook until just shy of al dente, usually 2 minutes less than the package directs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat a 12-inch sauté pan over medium-high heat. When hot, add the remaining 3 tablespoons oil, then add the asparagus. Sauté until the asparagus is tender and starting to brown at the edges, 7 to 10 minutes. Add a big pinch of salt and the sliced garlic and sauté until the garlic is lightly golden, 1 to 2 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip a coffee mug or glass measuring cup into the pasta water and scoop out about 1/2 cup of it to use for the sauce. Drain pasta, shaking it well. Add pasta, bean mixture, parsley and Parmesan to sauté pan and cook until the beans are hot and the pasta is al dente. If the mixture looks dry, splash in some (or all) of the reserved pasta water. Squeeze remaining lemon half over pasta, toss and taste. Season with pepper; add more salt, red-pepper flakes and lemon juice, if desired."}], "link": "https://cooking.nytimes.com/recipes/1020215-lemony-pasta-with-asparagus-and-white-beans"}