{"@context": "http://schema.org", "@type": "Recipe", "name": "Radicchio Salad With Crunchy Shiitake Mushrooms and Barley", "description": "A colorful grain salad is the perfect light meal. Here, barley adds heft and texture to a bitter leaf salad that’s balanced with a sweet-tart dressing. The sleeper hit of this recipe are the crispy shiitake mushrooms, which impart deep flavor in two ways: They are pan-seared, and the caramelization left in the pan adds extra umami to the dressing. For gluten-free diets, you could substitute buckwheat groats or brown rice in place of the pearled barley.", "author": {"@type": "Person", "name": "Sue Li"}, "image": "https://static01.nyt.com/images/2020/02/19/dining/sl-barley-radicchio-salad/sl-barley-radicchio-salad-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, weeknight, grains and rice, salads and dressings, vegetables", "keywords": "appetizer, main course, side dish, balsamic vinegar, barley, mushroom, pearl barley, radicchio, shiitake, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 77}, "recipeIngredient": ["3/4 cup pearled barley, rinsed", "1 medium yellow onion, halved", "4 garlic cloves, lightly crushed", "Kosher salt and black pepper", "1/4 cup vegetable oil", "1/4 pound fresh shiitake mushrooms, stems removed and caps thinly sliced", "1 shallot, thinly sliced", "4 tablespoons balsamic vinegar", "1 tablespoon maple syrup", "1 large (12-ounce) head radicchio, core discarded and leaves torn into bite-size pieces", "1/4 cup roughly chopped fresh parsley leaves", "1/4 cup roughly chopped small fresh dill sprigs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine barley, onion, garlic and 1 tablespoon kosher salt in a large pot. Add enough water to cover the barley by about 2 inches. Bring to a boil over high, then lower heat to medium-low and simmer until the grains are plump and tender, about 40 minutes. Drain the mixture, and discard the onion and garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After barley has cooked about 30 minutes, prepare the mushrooms: Heat oil in a medium skillet over medium. Add mushrooms and cook, stirring frequently, until golden brown and the ends are starting to curl and crisp, 9 to 10 minutes. Using a pair of tongs or a slotted spoon, transfer the mushrooms to a paper towel-lined plate and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the skillet with the oil back to medium heat. Add the shallot and cook, stirring, until golden, 1 to 2 minutes; turn off the heat. While the oil is still hot, stir in balsamic vinegar and maple syrup. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a platter, layer the radicchio with cooked barley and drizzle with balsamic vinegar dressing. Top with reserved mushrooms, parsley and dill before serving. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1020884-radicchio-salad-with-crunchy-shiitake-mushrooms-and-barley"}