{"@context": "http://schema.org", "@type": "Recipe", "name": "Coconut Creamed Kale", "description": "These are not your typical creamed greens: Here, curly kale, rich coconut milk, curry powder and chile sauce are tossed together, then baked. The result is two textures in one: creamy on the bottom and crunchy (like a kale chip) on top. Crisp coconut flakes bring even more texture. Serve the greens with plenty of the curry coconut sauce spooned over. Pair them with rice, chewy noodles, roasted squash or red lentils, or alongside white fish or shrimp.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/01/14/dining/as-creamed-kale/merlin_166828446_33150a4f-3300-4572-89d9-db1551c5f9d9-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "coconut flakes, coconut milk, curry powder, kale, sambal, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 193}, "recipeIngredient": ["2 (13-ounce) cans full-fat coconut milk", "2 tablespoons Madras curry powder", "1 (2-inch) piece fresh ginger, peeled and finely grated (about 1 tablespoon)", "1 teaspoon sambal oelek or Sriracha", "Kosher salt and black pepper", "2 large bunches curly kale (about 1 pound), stems removed, leaves torn into 3-inch pieces", "1/2 cup unsweetened coconut flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. In a 3-quart/9-by-13-inch baking pan, use a fork to stir together the coconut milk, curry powder, ginger and sambal oelek. Season with 1 teaspoon salt and a generous grind of black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half the kale and use your hands to toss to coat. Add the remaining kale, season with salt and pepper, and massage with your hands so that the volume decreases a bit, and the kale no longer extends above the pan’s edge. Toss just once or twice so some of the kale is coated in sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 35 minutes. Sprinkle with coconut flakes, then continue to bake until the sauce has thickened and the kale on top is crisp, another 10 to 15 minutes, keeping an eye on the coconut flakes to avoid burning. Serve warm."}], "link": "https://cooking.nytimes.com/recipes/1020780-coconut-creamed-kale"}