{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Congee With Turmeric and Cumin", "description": "This dish, which was created for the 2019 NYT Food Festival by Tyler Heckman, the executive chef at Ferris restaurant in New York, combines his interest in Cantonese cooking with his affinity for the flavors of New York City street food — specifically, the chicken and rice plates <a href=\"https://www.nytimes.com/2017/04/18/dining/halal-cart-food-vendor-new-york-city.html\">sold from halal carts</a>. Congee is a rice porridge popular in China and among other Asian cuisines, and this version is heavily spiced with cumin and turmeric, which lend a golden hue and an earthy flavor. If you haven’t made congee before, you might balk at the high ratio of water to rice, but give it time, and the rice will break down until creamy. Spiced chicken, tangy yogurt and a punchy blender hot sauce add texture, richness and brightness to the dish.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/09/25/dining/aw-halal-congee/aw-halal-congee-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, condiments, grains and rice, poultry", "keywords": "chicken thighs, cumin, jasmine rice, turmeric, yogurt, za’atar, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 118}, "recipeIngredient": ["1 teaspoon neutral oil", "3 cloves garlic, peeled and lightly crushed", "1 cup jasmine rice, rinsed", "1/2 peeled white onion, cut into 2 wedges", "1 1/2 teaspoons ground turmeric", "1 1/2 teaspoons ground cumin", "Kosher salt", "3/4 cup plain yogurt", "2/3 cup mayonnaise, preferably Kewpie brand", "1 tablespoon za’atar", "Kosher salt and black pepper", "1 cup chopped jarred roasted red bell pepper", "1/2 cup Crystal hot sauce", "1 tablespoon Champagne vinegar", "Kosher salt", "5 tablespoons olive oil", "1/4 cup ground turmeric", "3 tablespoons ground cumin", "2 tablespoons ground cardamom", "Kosher salt", "2 pounds boneless, skinless chicken thighs", "Julienned iceberg lettuce", "Diced tomato"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the rice: In a small skillet, sauté the garlic in oil over medium-high heat, until deep golden brown all over, about 3 minutes. Transfer the garlic to a large lidded pot, and discard the oil. Add the rice, onion, turmeric, cumin, 1 teaspoon salt and 10 cups water to the pot and bring to a boil over high. Reduce the heat to medium-high, partially cover the pot with a lid (two-thirds of the pot should be covered) and cook, stirring occasionally, until the rice breaks down and the soup is thick and creamy, 30 to 40 minutes. Remove and discard onion and garlic, if desired. Season congee to taste with salt, remove from heat and cover. (Makes about 7 cups.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the yogurt sauce: In a medium bowl, whisk together the yogurt, mayonnaise and za’atar. Season to taste with salt and pepper, transfer to a squeeze bottle or a spouted measuring cup, and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the spicy sauce: Add the roasted bell pepper, hot sauce and Champagne vinegar to a blender and purée until completely smooth. Season with salt to taste, transfer to a squeeze bottle or a spouted measuring cup, and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chicken: In a large bowl, whisk 4 tablespoons olive oil with the turmeric, cumin, cardamom and 1 tablespoon kosher salt. Add the chicken thighs and toss to coat. Heat the remaining 1 tablespoon olive oil in a large cast-iron pan. Working in batches, cook the chicken thighs over medium until a golden crust forms on each side, 6 to 7 minutes per side. Transfer to a cutting board, let rest 5 to 10 minutes, then thinly slice the chicken crosswise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the congee among wide, shallow bowls. Top with the chicken, lettuce and tomato, then drizzle with yogurt and spicy sauce. Pass additional sauces at the table so guests can adjust creaminess or heat level according to preference."}]}