{"@context": "http://schema.org", "@type": "Recipe", "name": "Oat Milk Chocolate Pudding", "description": "Chocolate pudding is equal parts comfort and romance, which means it’s great accompanied by sweatpants, candlelight or both. This 15-minute version is inspired by a recipe from Alice Medrich, the cookbook author, in which she uses both cocoa powder and chocolate, and cornstarch instead of eggs for a pure chocolate flavor (eggs can dilute the subtle notes). Here, nondairy milk is swapped in for the milk and the cream with equally wonderful results. When developing this recipe, we found that oat milk created a pudding with the plushest texture. Soy, almond and coconut milks work, too, although they might impart their own flavor and the pudding texture may vary.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/08/20/dining/as-vegan-chocolate-pudding/merlin_159056808_5cfcb40e-9674-4613-803e-0f8b66dd1d4d-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "for one, quick, weekday, custards and puddings", "keywords": "chocolate, cocoa powder, cornstarch, milk, vanilla, dairy-free, vegan, vegetarian, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 783}, "recipeIngredient": ["1/3 cup/65 grams granulated sugar", "1/3 cup/30 grams unsweetened cocoa powder", "2 tablespoons cornstarch", "1/8 teaspoon fine sea salt", "2 cups/480 milliliters nondairy milk, preferably oat", "3 to 4 ounces/85 to 115 grams bittersweet bar chocolate, finely chopped (see Tip 1)", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, use a wooden spoon or silicone spatula to stir together the sugar, cocoa, cornstarch and salt. Slowly stir in the milk and keep stirring until smooth and combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the mixture constantly over medium-low heat, scraping the bottom, sides and corners of the pan, until the pudding thickens, begins to bubble, and coats the back of the spoon or spatula, 5 to 10 minutes. (If the pudding is coating the bottom of the pan too quickly, reduce the heat.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chocolate and stir vigorously until the pudding is very thick and smooth, about 30 seconds longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat and stir in the vanilla. Spoon the pudding into a serving bowl or individual cups or ramekins. Serve warm, at room temperature or chilled (see Tip 2). It will thicken as it cools."}], "link": "https://cooking.nytimes.com/recipes/1020415-oat-milk-chocolate-pudding"}