{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Shrimp Scampi", "description": "This has all the garlicky, lemony flavors of classic shrimp scampi, but is cooked on a sheet pan instead of a skillet. This allows the lemon to char and caramelize, and gives the shrimp a condensed, deep flavor from roasting at high heat. Serve it with crusty bread for dipping, or over pasta to absorb the sauce, and with more lemon juice and red pepper flakes showered on top for pizzazz.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/10/16/dining/15shrimprex1/15shrimprex1-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "seafood", "keywords": "lemon, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 993}, "recipeIngredient": ["2 lemons", "Extra-virgin olive oil", "1 teaspoon fine sea salt, plus more as needed", "1 cup dry white wine", "3 tablespoons unsalted butter", "1 pound peeled large or extra-large shrimp", "2 to 3 garlic cloves, thinly sliced", "1/8 teaspoon red-pepper flakes, plus more for garnish", "Freshly ground black pepper", "1/2 cup fresh parsley, chopped", "1/4 cup fresh basil, chopped (or use more parsley)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Position a broiler rack 4 inches from heating element, then heat the boiler. If your oven is separate from your broiler, heat the oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice one of the lemons 1/4-inch thick, removing the seeds. Arrange lemon slices in a single layer on a rimmed baking sheet. Cut the other lemon into wedges and reserve for serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush lemon slices generously with oil and sprinkle lightly with salt. Carefully pour wine onto baking sheet, avoiding pouring directly over lemon slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pan to the oven or broiler, and broil until the tops of the lemon slices are caramelized and charred in spots, and the wine has reduced by half, 6 to 12 minutes. (Broilers vary a lot in their intensity, so watch carefully.) If your broiler is in your oven, turn off the broiler and heat oven to 450 degrees. (It should heat up quickly since the broiler’s been on.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium pot over medium heat, melt the butter. Remove from heat and add shrimp, garlic, 3/4 teaspoon salt, the red-pepper flakes and black pepper; toss well to coat shrimp with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer shrimp mixture to the baking sheet, and spread shrimp in an even layer on top of the lemon slices. Roast until shrimp are cooked through, 3 to 5 minutes. Toss lemons and shrimp well, taste, and add more salt if needed. Transfer shrimp, lemons and any pan juices to a serving platter and sprinkle with parsley, basil and more red-pepper flakes. Serve immediately, with lemon wedges for squeezing."}], "link": "https://cooking.nytimes.com/recipes/1020523-sheet-pan-shrimp-scampi"}