{"@context": "http://schema.org", "@type": "Recipe", "name": "Peanut Laddoo Buckeye Balls", "description": "Here’s a simple, no-bake sweet that riffs on peanut laddoos, a bite-size Indian confection made of ghee, sugar and nuts, with a chocolate coating inspired by buckeyes, the peanut butter and chocolate treat popular in Ohio. It was dreamed up by Hetal Vasavada, the blogger and author of the dessert cookbook “Milk & Cardamom,” which combines the traditional Indian flavors she grew up with and the Western sweets she encountered as an American kid in New Jersey. The cardamom, ghee and jaggery provide both an interesting twist to the traditional flavor combination and a slightly grittier texture, which Ms. Vasavada likens to that of a Butterfinger candy bar.", "author": {"@type": "Person", "name": "Priya Krishna"}, "image": "https://static01.nyt.com/images/2019/07/16/dining/16burfirex-01/merlin_157887777_b8e434ca-3321-4fca-94a1-2e5501f899df-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "About 15 balls", "recipeCuisine": "american, indian", "recipeCategory": "snack, candies, cookies and bars", "keywords": "cardamom, coconut oil, ghee, milk chocolate, peanut, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 130}, "recipeIngredient": ["1 cup/150 grams roasted unsalted peanuts", "2/3 cup/95 grams jaggery powder or 145 grams dark brown sugar", "2 tablespoons/30 grams ghee, plus more as needed", "1/4 teaspoon cardamom seeds, finely crushed", "1/4 teaspoon kosher salt", "3/4 cup/130 grams milk chocolate morsels", "1 teaspoon coconut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium skillet, toast the peanuts over medium heat, shaking the pan, until fragrant and slightly darkened, 3 to 4 minutes. Transfer the peanuts to a food processor and process until pulverized into a fine powder. Add the jaggery, ghee, cardamom and salt and process until the mixture reaches the texture of thick, chunky peanut butter, 1 to 2 minutes, scraping down the sides every so often. The mixture should easily form a ball if you squeeze it with your fist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the mixture into a medium bowl. Tightly pack a tablespoon (about 15 grams) with the peanut laddoo mixture. Remove from the measuring spoon and give the peanut laddoo mixture a squeeze with your fist, then gently roll the mixture into a ball. (If the mixture seems sticky, you can grease your hands with ghee.) If your mixture is too crumbly, return it to the rest of the peanut mixture in the medium bowl and mix in an additional tablespoon (about 15 grams) of ghee. Try rolling again, adding more ghee as needed to help the mixture come together, then form into about 15 balls. Transfer all of the laddoos to a plate and freeze for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chocolate and coconut oil to a microwavable bowl, and microwave in 15-second increments, stirring between each increment, until the chocolate is fully melted, 1 to 2 minutes. Alternatively, if you don’t have a microwave, you can set up a bain-marie by bringing a small saucepan of water to a boil over high. Once it reaches a boil, lower the temperature to reduce it to a simmer and place a small heatproof bowl on top of the pot, making sure the bowl does not touch the water. Add the chocolate and coconut oil to the bowl and stir until melted, 2 to 3 minutes. Remove the melted chocolate from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with parchment paper. Remove the laddoos from the freezer; if any have flattened, roll them again into round balls. Insert a toothpick into each peanut laddoo and dip it into the chocolate, leaving about ⅓ of the laddoo exposed on top. Transfer each ball onto the parchment-lined baking sheet and remove the toothpick. If it’s stuck, use another toothpick to push the laddoo off the inserted toothpick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to the freezer until the chocolate is set, 10 to 20 minutes. Gently use your finger to smoothen the surface of the peanut laddoo to cover the toothpick holes. Serve chilled. Store in an airtight container in the refrigerator for up to 2 weeks."}]}