{"@context": "http://schema.org", "@type": "Recipe", "name": "Cauliflower “Mac” and Cheese", "description": "Somewhere between macaroni and cheese, British cauliflower cheese and a <a href=\"https://cooking.nytimes.com/recipes/1019708-cauliflower-gratin-with-leeks-and-white-cheddar?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=1\">cauliflower gratin</a> is this burbling dish of tangy, creamy cauliflower. Cauliflower florets cut into noodle-size pieces step in for macaroni in this pasta-less macaroni and cheese; they’re roasted and draped in a mixture of melty Cheddar, heavy cream, garlic and cayenne. You could also add mustard, thyme or rosemary, or even caramelized onions, and swap out the Cheddar for Gruyère or another cheese. As the cauliflower cooks in the cream mixture, the cream thickens slightly and the cauliflower continues to brown. Serve it with a bright, crisp salad to offset the richness.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2020/03/26/dining/as-cauliflower-mac-and-cheese/as-cauliflower-mac-and-cheese-articleLarge-v2.jpg", "totalTime": "PT35M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, casseroles, vegetables", "keywords": "cauliflower, cheddar, garlic, heavy cream, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "recipeIngredient": ["1 large cauliflower (2 1/2 pounds), cut into small florets the size of macaroni", "3 tablespoons extra-virgin olive oil", "Kosher salt and black pepper", "1 1/2 cups grated Cheddar (about 6 ounces)", "1 cup heavy cream", "1 garlic clove, finely grated", "1/4 teaspoon cayenne"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. Toss the cauliflower with the olive oil on a baking sheet. Season with salt and pepper, spread in an even layer and roast until browned and cooked through but retaining some bite, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cauliflower to an 8-inch or other 2-quart baking dish. (You could also bake this in individual ramekins; just mix the cauliflower with the other ingredients in a medium bowl before dividing.) Reserve 1/4 cup Cheddar. Add the remaining 1 1/4 cups Cheddar, heavy cream, garlic and cayenne to the cauliflower and stir to combine. Season with salt and pepper, then top with the reserved 1/4 cup Cheddar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until the cream has thickened, the cheese has melted, and some of the cauliflower is browned on top, 15 to 20 minutes. Let sit 5 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1020969-cauliflower-mac-and-cheese"}