{"@context": "http://schema.org", "@type": "Recipe", "name": "Maida Heatter’s Chocolate Mousse Torte", "description": "Maida Heatter, the legendary dessert-cookbook author, tested this recipe 20 times before deeming it good enough for publication in The Times in <a href=\"https://timesmachine.nytimes.com/timesmachine/1972/05/21/82224385.html?pageNumber=430\">May 1972</a>. Her toil was worth the trouble: Eight months later, it was named the paper’s <a href=\"https://timesmachine.nytimes.com/timesmachine/1973/01/21/99113021.html?pageNumber=291\">most requested dessert recipe of the year</a>. This is an adaptation of the version that appears in Ms. Heatter’s book “Happiness is Baking” (Little, Brown, 2019). It begins with a big batch of chocolate mousse, half of which is baked in a pie plate. As it cools, it sinks in the middle, creating a dense, fudgy cake with a bit of an elevated edge. The remaining mousse is piled in the center, then topped with snowy whipped cream and chocolate shavings. One note: Like most traditional mousses, this one contains raw eggs. Use the best pasteurized eggs you can find. If that worries you, try another <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/10530406-maida-heatter-recipes\">Maida Heatter dessert</a> instead.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2019/05/31/dining/mh-chocolate-mousse-torte/merlin_152090256_8c1a5256-64cd-41b7-9495-c63066f93a87-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "coffee, confectioners' sugar, heavy cream, semisweet chocolate, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 386}, "recipeIngredient": ["Unsalted butter, for greasing the pan", "Fine dry bread crumbs or cocoa powder, for dusting", "8 ounces/225 grams semisweet bar chocolate (not chips), chopped", "1 tablespoon instant espresso or coffee powder", "1/4 cup boiling water", "8 large eggs, yolks and whites separated", "1/3 cup/65 grams granulated sugar", "1 teaspoon vanilla extract", "1/8 teaspoon fine sea salt", "1 1/2 cups/360 milliliters heavy cream", "1/3 cup/40 grams confectioners’ sugar", "1 1/2 teaspoons vanilla extract", "Grated semisweet chocolate, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a rack in the center of the oven. Heat oven to 350 degrees. Butter a 9-inch glass pie plate. Dust it with bread crumbs or cocoa powder. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chopped chocolate in the top of a small double boiler over water over low heat. Bring it to a low simmer. Meanwhile, in a cup or small bowl, dissolve the coffee in the 1/4 cup boiling water and pour it over the chocolate. Cover and cook over low heat, whisking occasionally, until the chocolate is almost melted. Remove from heat and continue to stir until smooth. Let cool slightly. (Alternatively, place chocolate in a medium microwave-safe bowl. Dissolve the coffee in the boiling water and pour it over the chocolate. Cover with a plate or kitchen towel and let stand for 5 minutes. Vigorously whisk until the chocolate is melted and smooth. If there are still bits of unmelted chocolate, microwave in 15-second bursts, whisking between, until smooth and fully melted.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the whisk attachment, beat the yolks at high speed until they are pale, thick and lemon-colored, about 5 minutes. Gradually add the granulated sugar and continue to beat at high speed for 5 minutes more until very thick. Reduce speed to low, and add the vanilla and cooled chocolate, scraping the sides of the mixing bowl as necessary. Transfer mixture to a medium bowl. Wash the whisk attachment and mixing bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the mixing bowl of the electric mixer fitted with the whisk attachment, beat the egg whites with the salt until stiff but not dry. Gradually, in two or three small additions, gently fold half the egg whites into the chocolate, then fold the chocolate mixture into the remaining whites just until no whites show. Handling as little as possible, gently reserve about 4 cups of the mousse in a separate medium bowl; cover and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the rest of the mousse into the pie plate; it will barely reach the top. Gently level and bake for 25 minutes. Turn off the heat, then leave it in the oven for 5 minutes more. Remove from oven and cool on a rack. (The mousse will rise during baking and then, while cooling, it will sink in the middle, leaving a high rim.) Wash the mixing bowl and whisk attachment and place in the refrigerator or freezer to chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the baked mousse is completely cool, remove reserved mousse from refrigerator. Handling as little as possible, transfer the chilled mousse to the center of the baked mousse. Mound it slightly higher in the center, but be careful to handle as little as possible or it will lose the air beaten into it. Refrigerate for at least 2 to 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the whipped cream: In the chilled mixing bowl with the chilled whisk attachment, whip the cream, confectioners’ sugar and vanilla on high speed until it holds a defined shape. Spread over the unbaked part of the mousse, excluding the rim; refrigerate. (Another way of applying the whipped cream: Use a pastry bag fitted with a medium star tube and pipe a lattice pattern over the top of the pie and a border around the edge.) Coarsely grate some semisweet chocolate over the top before serving, if desired. The torte is best eaten the day it’s made, but it’s not bad the next day."}], "link": "https://cooking.nytimes.com/recipes/1020262-maida-heatters-chocolate-mousse-torte"}