{"@context": "http://schema.org", "@type": "Recipe", "name": "Spatchcocked Chicken With Herb Butter", "description": "Spatchcocking (also called butterflying) a chicken helps it to roast more evenly and much more quickly, giving you perfectly tender, juicy meat with golden skin. This one is slathered with herb butter, making it extra fragrant. (If you have any herb butter left over, freeze it, then use it on steaks or fish or roasted potatoes.) Pulling out a well-flavored compound butter is one of those cheffy moves that makes almost everything taste better.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/03/11/dining/06appe-chicken/06appe-chicken-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "weekday, poultry", "keywords": "herbes de provence, parsley, rosemary, thyme, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 152}, "recipeIngredient": ["1/4 cup unsalted butter (1/2 stick), at room temperature", "4 garlic cloves, finely grated or minced", "2 teaspoons minced fresh parsley leaves", "2 teaspoons minced mixed fresh herbs — any mix of mint, oregano and marjoram", "1 1/2 teaspoons minced fresh thyme leaves", "1/2 teaspoon minced fresh rosemary leaves", "1 3/4 teaspoons fine sea salt", "1 teaspoon herbes de Provence", "1/2 teaspoon finely grated lemon zest", "1/2 teaspoon freshly ground white pepper", "1/2 teaspoon freshly ground black pepper", "1 (3 1/2- to 4-pound) chicken, spatchcocked and dried with paper towels (see Note)", "Lemon wedges, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, mash together the butter, garlic, parsley, mixed herbs, thyme, rosemary, salt, herbes de Provence, lemon zest, white pepper and black pepper. Rub three-quarters of the mixture all over the chicken, including under the skin. (Reserve the remaining herb butter for serving.) Place the chicken, breast-up, on a rimmed baking sheet and refrigerate it, uncovered, for at least 2 hours and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Roast chicken until it is just cooked through (the meat will no longer be pink and the juices will run clear; an instant read thermometer inserted into the thigh will read 165 degrees), 40 to 55 minutes. Let the chicken rest on a cutting board for 10 minutes before carving. Serve it topped with the reserved herb butter and lemon wedges."}], "link": "https://cooking.nytimes.com/recipes/1020919-spatchcocked-chicken-with-herb-butter"}