{"@context": "http://schema.org", "@type": "Recipe", "name": "Irish Cream Poundcake", "description": "This classic poundcake has a boozy twist that’s perfect for parties, St. Patrick’s Day and beyond. Irish cream liqueur — a rich blend of Irish whiskey, cream, sugar, vanilla and other flavorings — is added to both the batter and the glaze, which yields doubly flavorful results. The alcohol in the cake burns off during baking, but if you’d like to mute the hint of alcohol in the glaze, simply bring the Irish cream to a simmer and let it cool before whisking it with the confectioners’ sugar. Serve the cake alone, with a scoop of coffee ice cream or a hot cup of coffee (spiked with Irish cream, perhaps). The cake keeps well at room temperature, tightly wrapped, for up to 4 days.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2019/03/04/dining/em-irish-cream-poundcake/em-irish-cream-poundcake-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "american, irish", "recipeCategory": "cakes", "keywords": "confectioners' sugar, flour, Irish cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 501}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 616, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "75 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "18 grams", "sodiumContent": "268 milligrams", "sugarContent": "53 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["Nonstick cooking spray", "1 cup/225 grams unsalted butter (2 sticks), at room temperature", "1 2/3 cups/215 grams all-purpose flour, plus more for dusting the pan", "2/3 cup/145 grams light brown sugar", "1/2 cup/100 grams granulated sugar", "4 large eggs, at room temperature", "1 1/4 teaspoons baking powder", "1/2 teaspoon fine sea salt", "1/2 cup/120 milliliters Irish cream", "1 1/4 cups/155 grams confectioners’ sugar", "3 tablespoons Irish cream, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Spray a 9-inch loaf pan with nonstick spray, then dust with flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, cream the butter, brown sugar and granulated sugar on medium speed until light and fluffy, 4 to 5 minutes. Add the eggs one at a time, mixing on medium speed until incorporated, about 30 seconds each. Scrape down the sides of the bowl after each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the flour, baking powder and salt. Add the mixture to the bowl of the stand mixer and mix on low until incorporated, about 30 seconds. Add the Irish cream and mix on low to combine, 15 seconds more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan and spread in an even layer. Bake until the surface of the cake is lightly golden brown and a toothpick inserted into the thickest part comes out clean, 55 to 65 minutes. Let cool in the pan for 10 minutes, then unmold onto a wire rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the glaze: Whisk the powdered sugar and Irish cream together in a medium bowl to form a thick glaze. Spoon the glaze over the surface of the loaf, letting the excess drip down the sides. Let the glaze set for 10 to 15 minutes before slicing."}], "link": "https://cooking.nytimes.com/recipes/1020076-irish-cream-poundcake"}