{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Ziti With Sausage Meatballs and Spinach", "description": "Baked ziti is meant to feed a crowd, and this one surely does. “Cheater” meatballs made with uncased Italian sausage are strewn throughout the sauce for heft, and baby spinach lends a pop of color. Because ricotta has a tendency to dry out when baked, crème fraîche is added to ensure a more velvety texture, but sour cream thinned out with a little heavy cream works just as well. The whole dish can be assembled and baked ahead the day before. Bring it to room temperature before warming, then broil right before serving for crisp edges.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/03/28/dining/ch-baked-ziti-with-sausage-meatballs/ch-baked-ziti-with-sausage-meatballs-articleLarge-v2.jpg", "totalTime": "PT1H45M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american, italian", "recipeCategory": "dinner, casseroles, pastas", "keywords": "crème fraîche, pasta, pecorino, ricotta, sausage, spinach, tomato, ziti, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 391}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 567, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "4 grams", "proteinContent": "32 grams", "saturatedFatContent": "15 grams", "sodiumContent": "906 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 pound sweet Italian sausage (pork, turkey or chicken), casing removed", "2 tablespoons olive oil", "1 medium onion, finely chopped", "3 garlic cloves, finely chopped", "1 tablespoon fresh oregano leaves, roughly chopped", "1 teaspoon red-pepper flakes (optional)", "2 (28-ounce) cans whole San Marzano tomatoes with their juices", "5 ounces baby spinach", "Kosher salt and black pepper", "1 pound ziti, penne or other short, tubular pasta", "1 (15-ounce) container ricotta", "7 ounces crème fraîche (about 1 scant cup)", "1 cup grated pecorino", "3/4 pound fresh mozzarella, cut or torn into 1/2-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands, shape the sausage into about 35 (1-inch) meatballs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a deep 12-inch skillet or a Dutch oven, heat the oil over medium. Working in two batches, fry the meatballs until golden all over, about 2 minutes per side, then transfer to a paper towel-lined sheet pan or platter. Cook the onion until softened, scraping up any browned bits from the bottom of the pan, 3 to 4 minutes. Add the garlic, oregano and red-pepper flakes, if using, and cook until the garlic is fragrant, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes and their juices to the skillet, gently crushing them. Stir in the meatballs, bring to a simmer and cook, 20 minutes. Gently fold in the spinach, tossing until it wilts. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the oven to 400 degrees. Bring a large pot of salted water to a boil, add pasta and cook until 2 to 3 minutes short of al dente (it will finish cooking in the oven). Drain pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the ricotta, crème fraîche and half the pecorino. Season with salt and pepper. Stir half the meatball sauce into the ricotta mixture. Add pasta and toss together to coat. Pour into a 9-by-13-inch baking dish that’s at least 2 1/2 inches deep. Top with the remaining meatball sauce, the mozzarella and the remaining pecorino. Place uncovered baking dish on a sheet tray and bake until the cheese is melty and bubbly, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat to broil and cook until the cheese and pasta brown in spots, 1 to 2 minutes. (Don’t walk away; the cheese can burn very quickly!) Remove from oven and let rest for 5 to 10 minutes before serving."}]}