{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheesy Baked Pasta With Sausage and Ricotta", "description": "Like a cross between baked ziti and sausage lasagna, this mozzarella-topped pasta is rich with ricotta and crushed tomatoes — and cooks entirely in one pan, including the pasta. The Italian sausage adds meaty depth to the sauce, but vegetarians can leave it out or use their favorite plant-based sausage instead.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/02/10/dining/onepot-cheesypasta/onepot-cheesypasta-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "easy, weekday, pastas", "keywords": "main course, mozzarella, parmesan, pasta, ricotta, sausage, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1325}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "3/4 pound bulk hot or mild Italian sausage (pork, chicken or turkey)", "4 garlic cloves, thinly sliced", "1 teaspoon dried oregano", "1/2 teaspoon fennel seeds, coarsely crushed", "Pinch of red-pepper flakes, plus more for serving (optional)", "1 (28-ounce) can whole peeled tomatoes with their juices", "1 (14-ounce) can crushed or strained tomatoes", "2 bay leaves", "Kosher salt", "12 ounces dried pasta, such as small shells, farfalle or other shaped pasta", "8 ounces fresh mozzarella, torn into bite-size pieces", "6 ounces whole-milk ricotta (about 3/4 cup)", "1/3 cup grated Parmesan", "1/4 cup basil leaves", "Black pepper, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Heat oil in a 12-inch ovenproof skillet over medium-high. Crumble sausage into skillet, using a spoon to break it into small pieces. Cook until starting to brown, stirring occasionally, 5 to 7 minutes. Stir in garlic, oregano, fennel seeds and red-pepper flakes (if using), and cook another 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in whole tomatoes and their juice, using a spoon to break them up. Add crushed tomatoes, bay leaves and 2 teaspoons salt, and bring to a simmer. Simmer for 10 minutes to thicken slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in pasta and 1 cup water and return to a simmer. Continue to simmer for 2 minutes, stirring frequently to make sure pasta doesn’t stick to the bottom of the pan. Remove from heat, pluck out the bay leaves, and fold in about a third of the mozzarella."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top pasta with remaining mozzarella and dollops of ricotta. Sprinkle with Parmesan, then transfer to oven. Bake until pasta is tender when poked with a fork, and cheese is bubbly and lightly golden, 18 to 22 minutes. (If you’d like a more deeply browned topping, run the pan under the broiler for 1 or 2 minutes.) Remove from oven and let cool slightly before serving. Top with basil, plenty of black pepper, and more red-pepper flakes, if you like."}]}