{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon With Whole Lemon Dressing", "description": "Roasting salmon low and slow in one large piece means just cooked, perfectly medium-rare salmon every time. In a pinch, this recipe would work with pre-portioned salmon fillets, but make sure they are at least an inch thick, and decrease the cooking time by about 5 to 8 minutes. The lemon dressing here is tangy, floral and, yes, a little bitter (as the whole lemon is involved, pith and all). If that’s not your preferred flavor profile, feel free to only use the zest and juice.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2020/02/26/dining/24Romanrex/merlin_167079003_d91749ac-0392-44a1-8d62-932f67e22ec4-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, seafood", "keywords": "butter lettuce, cucumber, lemon, salmon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1306}, "recipeIngredient": ["2 lemons, seeds removed, peel, pith and fruit finely chopped", "1 small shallot or garlic clove, finely chopped", "3 oregano, marjoram or thyme sprigs, leaves stripped and chopped", "2 tablespoons white wine vinegar", "Kosher salt and freshly ground black pepper", "1/4 cup olive oil, plus more for drizzling", "1 1/2 pounds skin-on salmon fillet (skinless is fine in a pinch)", "1 head butter or Little Gem lettuce, torn into large pieces", "2 Persian cucumbers or radishes, or both, sliced, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. In a small bowl, combine finely chopped lemon, shallot, oregano and vinegar for the dressing. Season with salt and pepper, and add 1/4 cup olive oil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season salmon on both sides with salt and pepper. Place skin-side down in a 9-by-13-inch baking dish (or other 2-quart equivalent). Spoon half the lemon dressing over the salmon, and place in the oven until salmon is just cooked through but still a nice orange-pink in the thickest parts for more of a medium-rare salmon, 15 to 20 minutes, depending on the thickness of the fillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, scatter lettuces onto a large serving platter. Once salmon is out of the oven, use a spoon or spatula to transfer it to the serving platter with the lettuces, leaving behind the skin. Spoon remaining lemon dressing over the salmon and lettuces. Serve alongside cucumbers or radishes, or both, for crunch."}]}