{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Sausage With Spring Onions, Potatoes and Mustard", "description": "Fresh spring onions make this effortless sausage and potato sheet-pan supper feel elegant, but you could just as easily use scallions, leeks or nearly any other member of the allium family. The spring onions and potatoes make the perfect bed for roasting: They prop up the sausages so they brown instead of steam, and they absorb the sausage drippings while doing so. A spicy, tangy mustard relish cuts the richness of the sausage and offsets the sweetness of the spring onions. Should you have leftovers, they are excellent tucked between slices of toasted bread smeared with plenty of mayonnaise and more mustard.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2020/04/03/dining/kc-sausage-leek-potato-sheet-pan-dinner/merlin_171207477_80877bff-1951-4c37-bc13-fcc6fe533c11-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, weeknight, meat, one pot, roasts, vegetables", "keywords": "main course, mustard, new potato, sauerkraut, sausage, spring onions", "aggregateRating": null, "recipeIngredient": ["1 pound spring onions, small leeks or scallions, trimmed and halved lengthwise", "1 1/2 pounds small new potatoes (or russet potatoes, cut into 1 1/2-inch cubes)", "1 1/2 cups drained jarred or refrigerated sauerkraut (9 ounces)", "5 garlic cloves, thinly sliced", "1/2 cup extra-virgin olive oil", "Kosher salt and black pepper", "2 pounds sausage, fully cooked or uncooked (such as bratwurst, kielbasa, sweet or hot Italian)", "2 tablespoons chopped fresh parsley, plus more for garnish (optional)", "2 tablespoons coarse or Dijon mustard", "1 tablespoon minced shallot or onion", "1 tablespoon lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. On a rimmed baking sheet, combine spring onions, potatoes, sauerkraut, garlic and 1/4 cup oil; season with salt and pepper and toss to coat. Spread in an even layer and roast for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange sausages on top and roast until spring onions and potatoes are tender and sausages are heated through, about 30 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sausages roast, in a small bowl, combine the 2 tablespoons parsley, if using, with the mustard, shallot and lemon juice, plus the remaining 1/4 cup oil and 1 tablespoon water. Stir to combine, then season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide sausages and vegetables among plates. Sprinkle with additional parsley, if using, and drizzle with mustard relish to taste."}], "link": "https://cooking.nytimes.com/recipes/1020981-sheet-pan-sausage-with-spring-onions-potatoes-and-mustard"}