{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Seared Eggplant With Pearl Couscous", "description": "This is a great weeknight one-dish dinner, and vegetarian (or vegan if you like) to boot. It is from the cook Adeena Sussman, who divides her time between New York and Tel Aviv, where pearl (or Israeli) couscous is called “p’titim,” meaning flakes.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2019/09/25/dining/23vegrex1/23vegrex1-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas, vegetables", "keywords": "couscous, eggplant, parsley, tomato, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 529}, "recipeIngredient": ["1 teaspoon ground cinnamon", "1/2 teaspoon ground cumin", "1/4 teaspoon ground cayenne", "Kosher salt and ground black pepper", "1 1/2 cups pearl couscous (also called Israeli couscous)", "1/3 cup extra-virgin olive oil", "2 cups cubed eggplant with skin (about 1 small eggplant)", "1 medium yellow or white onion, chopped", "2 garlic cloves, minced", "1 tablespoon tomato paste", "1 medium tomato, diced, or 1 cup canned diced tomatoes", "1/4 teaspoon smoked paprika", "1/4 cup freshly chopped parsley", "Yogurt, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine cinnamon, cumin, cayenne and 1/2 teaspoon salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a heavy pot (2 to 3 quarts) with a tight-fitting lid over medium until hot but not smoking. Add couscous and toast, stirring often, until golden and fragrant, about 3 minutes. Transfer toasted couscous to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add oil to pot and raise heat to medium-high. When it shimmers, add eggplant, onion, 1/2 teaspoon salt and 1/4 teaspoon pepper and cook, stirring often, until onions are softened and golden and the eggplant is browned and slightly shrunken, 8 to 10 minutes. Add garlic and stir just until fragrant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomato paste and the prepared spice mixture and cook, stirring, 1 minute. Stir in toasted couscous, tomato and 1 1/2 cups water, cover, reduce the heat to low and simmer until the couscous has absorbed all the liquid, 8 to 12 minutes. Turn off the heat and let rest 2 minutes. Uncover, stir in paprika and parsley, then taste and adjust the seasoning with salt. Serve immediately and dollop with yogurt, if desired."}], "link": "https://cooking.nytimes.com/recipes/1020479-spiced-seared-eggplant-with-pearl-couscous"}