{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetarian Bean and Cheese Enchiladas", "description": "Enchiladas can be a bit of a project, but here, the process has been streamlined, making them a truly possible weeknight endeavor. Begin by sautéing peppers, onions and garlic until charred in spots, then blend half of the vegetables with canned tomatoes and chili powder for the sauce and combine the rest with black beans, shredded cheese and cumin for the filling. If you’re short on time, you could use store-bought enchilada sauce (you'll need three cups), but quality varies, so taste it and add whatever you think is missing: chipotle in adobo or chili powder for smokiness, hot sauce for heat, dried oregano or fresh cilantro for complexity and salt for overall flavor.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/05/20/dining/as-bean-and-cheese-enchiladas/as-bean-and-cheese-enchiladas-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "american, mexican", "recipeCategory": "dinner, weekday, burritos and nachos, casseroles", "keywords": "bell pepper, black beans, cheddar, chile powder, cumin, monterey jack cheese, tomato, tortilla, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1024}, "recipeIngredient": ["2 tablespoons olive oil", "2 medium yellow onions, finely chopped", "1 red bell pepper or poblano chile, stemmed, seeded and cut into 1/4-inch pieces", "4 garlic cloves, peeled and thinly sliced", "Kosher salt and black pepper", "1 1/2 teaspoons ground cumin", "1 (15-ounce) can fire-roasted tomatoes, preferably crushed (see Tip)", "2 teaspoons chili powder", "1/2 teaspoon hot sauce or 1 chipotle chile in adobo, chopped (optional)", "1/4 cup sour cream, plus more for serving (optional)", "2 (15-ounce) cans black beans, rinsed", "5 ounces mild Cheddar or Monterey Jack cheese, grated (about 1 1/4 cups)", "10 to 12 (6-inch) soft corn or flour tortillas", "Fresh cilantro leaves and stems, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. In a large skillet, heat the oil over medium-high. Add the onions, bell pepper and garlic; season with salt and pepper. Cook, stirring occasionally, until softened and charred in spots, 6 to 8 minutes. Stir in the cumin and cook until fragrant, about 1 minute. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer half the vegetable mixture to a blender; add the tomatoes, chili powder and hot sauce. Blend until very smooth. Season to taste with salt and pepper. (If your blender isn’t particularly strong and the sauce looks more like a chunky purée, add 1/4 cup sour cream and blend again until smooth.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the black beans and 1/2 cup cheese to the remaining vegetables in the skillet and stir to combine. Some canned beans are already salted, so taste and adjust seasonings as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread out the tortillas directly on the oven rack and heat until warmed and pliable, 1 to 2 minutes, then wrap in a kitchen towel to keep warm. Pour half the enchilada sauce (about 1 1/2 cups) into a medium casserole dish or a 9-by-13-inch baking pan and spread it to cover the bottom of the dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line up the filling, tortillas and baking dish in a row. Place a little more than 1/4 cup of the bean mixture in the center of one tortilla. Roll up the tortilla and place in the casserole dish, seam-side down. Repeat with the remaining tortillas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the remaining sauce over the enchiladas, then sprinkle with the remaining 3/4 cup cheese. Bake until the cheese has melted, about 10 minutes. Top with sour cream and cilantro and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020244-vegetarian-bean-and-cheese-enchiladas"}