{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek Lemon Potatoes", "description": "For the dreamiest roasted potatoes — with creamy insides and very crispy outsides — follow this classic Greek method of roasting peeled potatoes in equal parts olive oil, lemon juice and chicken stock. The potatoes soak up the flavorful liquid, allowing the insides to remain tender while the outsides crisp in the oven’s high heat. You can follow the same method for russet potatoes, though the final result will be less moist.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/09/17/dining/as-lemon-potatoes/as-lemon-potatoes-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "greek", "recipeCategory": "vegetables", "keywords": "chicken stock, lemon juice, olive juice, oregano, yukon gold potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 629}, "recipeIngredient": ["1/2 cup chicken broth or water", "1/2 cup olive oil", "1/2 cup freshly squeezed lemon juice (from 3 to 4 large lemons)", "1 tablespoon kosher salt", "3 pounds large Yukon Gold potatoes (about 6), peeled then halved lengthwise and crosswise", "1 tablespoon dried oregano (optional)", "Flaky salt and black pepper, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. On a rimmed sheet pan, combine the chicken broth, olive oil, lemon juice and kosher salt. Toss the potatoes in the liquid to coat, then arrange the potatoes in an even layer, cut-sides down. Sprinkle the oregano over the potatoes, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the potatoes, flipping halfway through, until fork-tender, dark brown and crispy on top, 55 to 60 minutes. (If the potatoes are cooked through but not as crispy as you’d like, run them under the broiler for a few minutes.) Sprinkle with flaky salt and black pepper as desired."}]}