{"@context": "http://schema.org", "@type": "Recipe", "name": "Farro and Green Bean Salad With Walnuts and Dill", "description": "Farro is a perfect vehicle to showcase summer produce. With its nutty flavor and toothsome texture, the whole grain is a great counterbalance to snappy, sweet green beans. The farro cooks while you prepare the rest of the salad, allowing for an easy-to-assemble meal. Dill and walnuts, a nod to Middle Eastern flavors, are used in the gremolata, but pistachios and mint or hazelnuts and parsley would also work. Feta cheese or ricotta salata tossed in at the end would also be a nice addition. This hearty salad works well on its own, but would also be a fine companion to grilled fish or any other protein. Add the acid just before serving; it makes every ingredient sing.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/08/06/dining/ch-farro-and-green-bean-salad/ch-farro-and-green-bean-salad-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, weekday, grains and rice, salads and dressings, vegetables", "keywords": "dill, farro, green beans, lemon, shallot, walnut, main course, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 287}, "recipeIngredient": ["1 cup farro", "Kosher salt", "1/2 cup finely chopped walnuts", "1 cup roughly chopped fresh dill", "2 tablespoons lemon zest (from about 2 lemons)", "2 tablespoons finely chopped shallot (from about 1 shallot)", "2 tablespoons olive oil", "1 pound green beans, trimmed", "Black pepper", "Lemon juice or white wine vinegar", "Flaky sea salt, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add farro, 3 cups water and a pinch of kosher salt to a medium saucepan and bring to a boil. Reduce to a simmer, cover and cook until the farro is tender and toothsome, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the farro cooks, make the gremolata: Toast the walnuts in a large (preferably 12-inch) skillet over medium-low heat, stirring frequently to ensure that they don’t burn, 4 to 5 minutes. Transfer toasted walnuts to a medium bowl. Add the dill, lemon zest and shallots and toss to coat. Season with salt and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the skillet and heat the oil over medium. Add the green beans and season generously with salt and pepper. Cook, stirring frequently, until the beans are crisp tender and start to brown in spots, 6 to 8 minutes. Add a few tablespoons of water to help them along, if needed. Turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If there is any residual cooking liquid from the farro, drain it and add the farro directly to the skillet. Toss with the beans until well combined and season with salt and pepper. Transfer to a large serving bowl or platter and top with the gremolata. Drizzle with lemon juice or white wine vinegar to finish. Season with flaky salt, if desired."}]}