{"@context": "http://schema.org", "@type": "Recipe", "name": "Beet Dip With Labneh", "description": "This recipe for a delicious raw beet dip comes from Botanica, a vegetable-focused restaurant in Los Angeles run by Emily Fiffer and Heather Sperling. The recipe is easy — throw everything into the blender raw — though it requires a little time for the blades to break down the beets with walnuts, olive oil and a few other aromatics. Fiffer and Sperling cleverly adapted the dip from muhammara, the Middle Eastern spread made from red peppers. Using beets creates another dish altogether, but one that tastes bright, sweet and earthy. Serve it with a dollop of labneh, as well as warm pita and quartered Persian cucumbers for dipping, and generously drizzle everything with olive oil and crunchy salt.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2019/06/09/magazine/09mag-eat/3fa1de3134ec476f95b16859e45a5c1d-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "4 to 6 servings", "recipeCuisine": "middle eastern", "recipeCategory": "easy, quick, snack, dips and spreads", "keywords": "appetizer, side dish, beet, labneh, pomegranate molasses, walnut", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 275}, "recipeIngredient": ["1 medium beet or 1 bunch small beets (about 1/2 pound), peeled and roughly chopped", "1 cup whole walnuts, toasted, plus chopped walnuts for garnish", "1 lemon, juiced, plus additional, for zesting and juicing", "1 tablespoon pomegranate molasses", "1 teaspoon chile flakes, such as Urfa", "1 garlic clove, peeled", "1 teaspoon kosher salt, plus more to taste", "1/2 cup extra-virgin olive oil, plus more for garnish", "Freshly ground black pepper", "1 cup labneh, for serving", "Torn pita, for serving", "3 Persian cucumbers, quartered, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the beets, whole walnuts, lemon juice, pomegranate molasses, chile flakes, garlic and salt into a food processor or blender. Purée on high until beets and nuts are finely chopped. Scrape down the sides, and blend again, until the mixture gets slightly smoother. Add the olive oil, and blend again, scraping down the sides, until mixture forms a coarse purée. Taste, and adjust seasoning with salt, pepper and additional lemon juice, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon labneh into a bowl, smoothing it, then heap the beet dip on top. Top with a generous drizzle of olive oil and chopped walnuts; grate some lemon zest on top. Serve with pita and cucumbers for dipping."}], "link": "https://cooking.nytimes.com/recipes/1020270-beet-dip-with-labneh"}