{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Flatbread With Za’atar", "description": "A favorite Middle Eastern street snack is a small freshly baked flatbread, brushed with a mixture of olive oil and za’atar, the flavorful Middle Eastern spice mixture that contains wild thyme, sumac and sesame seeds. It is uncommonly good. For a more complex, pizzalike flatbread, this recipe adds spiced ground lamb and feta, along with a shower of herbs. But if you simply want the plain za’atar version, omit the lamb topping altogether.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/03/20/dining/20kitchen1/15kitchen1-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 (6-inch) flatbreads", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, lunch, breads", "keywords": "appetizer, side dish, feta, lamb", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 70}, "recipeIngredient": ["2 teaspoons dry active yeast", "1 teaspoon sugar", "1 cup/240 milliliters lukewarm water", "3 cups/385 grams “00” flour or all-purpose flour", "2 tablespoons extra-virgin olive oil", "1 teaspoon kosher salt", "Extra-virgin olive oil", "1 large onion, diced (about 1 1/2 cups)", "Kosher salt", "4 garlic cloves, minced", "1 pound ground lamb, preferably shoulder meat", "1/2 teaspoon black pepper", "1/2 teaspoon ground cloves", "1/2 teaspoon allspice powder", "1/4 teaspoon cayenne powder", "1/2 teaspoon ground cumin", "1/2 teaspoon ground coriander", "1/2 teaspoon ground cinnamon", "1 teaspoon sumac powder", "1 tablespoon pomegranate molasses", "3 tablespoons za’atar, combined with 3 tablespoons extra-virgin olive oil", "8 ounces mild feta or halloumi", "1/4 cup pine nuts (optional)", "Parsley leaves, for garnish", "Mint leaves, for garnish", "Cilantro leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a large mixing bowl or the bowl of a stand mixer, dissolve yeast and sugar in water. Stir in 1 cup flour to form a thin batter. Leave to rest until mixture is bubbly, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining flour, olive oil and salt. Mix until dough comes together, then knead until smooth, about 5 minutes. The dough should be soft and a bit sticky; dust lightly with flour as necessary. Return dough to bowl, cover and let rise until doubled, about 1 hour. (Alternatively, put dough in a resealable plastic bag and refrigerate overnight.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the filling: Put 3 tablespoons olive oil in a wide skillet over medium-high heat. When oil is hot, add onions, season generously with salt and stir to coat. Cook, stirring, until softened and nicely browned, 5 to 7 minutes. Stir in garlic and cook for 1 minute more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add lamb to skillet and mash into onions with a large spoon until crumbled. Sprinkle with salt, then stir in pepper, clove, allspice, cayenne, cumin, coriander, cinnamon, sumac and pomegranate molasses. Turn heat to low and stir to combine. Cook for 5 minutes, until meat is just cooked through. Transfer mixture to a rimmed baking sheet and spread out to cool. (You will have a bit more lamb filling than you need — it’s good on buttered toast for a cook’s treat.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Punch down dough and divide into 8 2 1/2-ounce pieces. Knead each piece into a ball. Cover with a damp towel and let dough rest 20 to 30 minutes, then roll thinly or stretch each piece into a 6-inch round. Make the dough as thin as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange 4 rolled-out dough rounds on a parchment-lined baking sheet. Brush each with a generous amount of za’atar-oil mixture over dough (all the way to the edges or you’ll get a puffed up “lip”). Make a layer of thinly sliced or crumbled feta, then sprinkle 1/4 cup of the cooled lamb mixture over the entire surface. Sprinkle on a few pine nuts, if using. Press topping down with the palm of your hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 4 flatbreads at a time, on the upper rack of the oven, for 5 to 8 minutes or until puffed and lightly browned. The dough should still be soft and pliable, not crisp. Serve hot or at room temperature, garnished with parsley, mint and cilantro leaves, whole or roughly chopped."}]}