{"@context": "http://schema.org", "@type": "Recipe", "name": "Amatriciana on the Fly", "description": "<i>This is a no-recipe recipe, a recipe without an ingredients list or steps. It invites you to improvise in the kitchen.</i>\n\nHere’s a half-hour challenge that’s no challenge at all. Set a large pot of salted water on the stove, over high heat. In a pan, sauté chopped bacon — slab bacon, if you can get it — in a glug or two of olive oil until it’s crisp. Remove the bacon and add chopped onion to the fat, cooking until it’s soft and fragrant. Figure the equivalent of a slice of bacon and half an onion per person.\n\nMeanwhile, boil water for enough pasta to feed your crowd, and cook it until it is just shy of tender. While it cooks, add some canned chopped tomatoes and the cooked bacon to the onions, and stir it to make a sauce. Drain the pasta, then toss it with a knob of butter, and add the pasta to the sauce. Slide all that into a warm serving bowl, then top with grated pecorino. A scattering of chopped parsley is never going to be a bad idea here, but you can omit it if the clock’s ticking. Serve with red-pepper flakes and extra cheese on the side.\n\n<i>Sam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. <a href=\"https://www.nytimes.com/newsletters/cooking\">Sign up to receive it.</a> You can find more no-recipe recipes <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/14326423-no-recipe-recipes\">here</a>.</i>", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/02/17/dining/17norecipe-amatraciana/17norecipe-amatraciana-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas", "keywords": "bacon, canned tomatoes, pasta, pecorino, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 274}, "recipeIngredient": [], "recipeInstructions": null, "link": "https://cooking.nytimes.com/recipes/1020007-amatriciana-on-the-fly"}