{"@context": "http://schema.org", "@type": "Recipe", "name": "Tumble-Jumble Strawberry Tart", "description": "I first had a strawberry tart like this one more than 10 years ago at the Paris cafe La Palette, and I’ve been making my own version of it ever since. It’s simply a crust slicked with some jam and then topped with an abundance of berries; whipped cream or crème fraîche is optional. The recipe is straightforward, but the construction is genius. You bake the crust, which is both crisp and tender, to a beautiful golden color and then set it aside. (Use the scraps of dough to make cookies; sprinkle with sugar before baking.) When you’re ready for dessert, you cut and finish only as many servings as you need, ensuring that the crust will always have great texture and the berries will always be fresh and bright. You could use a store-bought crust, but there are so few components in this dessert, it’s good to make each one count.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2019/07/14/magazine/14mag-eat/72e1f453e8d34af9bae7038433405964-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "american, french", "recipeCategory": "easy, quick, pies and tarts", "keywords": "all-purpose flour, crème fraîche, strawberries, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 242}, "recipeIngredient": ["1 1/2 cups/200 grams all-purpose flour", "1/3 cup/40 grams confectioners’ sugar", "2 tablespoons granulated sugar", "1/4 teaspoon fine sea salt", "Grated zest of 1 lemon (optional)", "9 tablespoons/130 grams very cold unsalted butter, cut into small pieces, plus additional for greasing", "1 large egg yolk", "1/2 teaspoon pure vanilla extract", "1/2 cup/120 milliliters strawberry jam", "1 quart/680 grams fresh strawberries, hulled", "Granulated sugar, as needed (optional)", "Whipped cream or crème fraîche, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the flour, both sugars, salt and lemon zest, if you’re using it, in the bowl of a food processor; pulse to blend. Scatter the butter on top; pulse the butter into the dry ingredients until you’ve got a bowlful of curds. At first the dough will look like cornmeal, but it will change as you go, so work in long pulses — you might need as many as 20 — and scrape the bottom and sides of the bowl often."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the yolk and vanilla together, and add in three additions, pulsing after each. Pulse just until the dough starts to come away from the sides of the bowl; it should form moist clumps and hold together when pinched. Turn it out onto a counter, knead it into a compact ball and flatten it into a disk between two sheets of parchment or wax paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the dough into an 11-inch circle. If it’s cold enough, fit it into a 9- to 9½-inch tart pan with a removable bottom, prick the bottom with a fork and trim the top even with the pan’s rim; if it’s not cold, chill it until it’s workable. Refrigerate the crust in the pan for at least 1 hour (or cover and freeze up to 2 months; bake straight from the freezer)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400. Place the dough in its pan on a baking sheet, cover with a piece of buttered foil or parchment and fill with rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 20 minutes, then carefully remove the foil or paper and rice. Bake, uncovered, until the crust is golden, another 8-10 minutes. Let cool, at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re serving 6, cover the bottom of the crust with a layer of jam, and then cut the tart into wedges. (Otherwise, cut the number of wedges you need, and spread each portion with jam.) Halve or quarter as many berries as you’d like — be generous — and if you want, toss with a little granulated sugar. Place each wedge of crust on a plate, and spoon over berries, letting them tumble where they might. If you’d like, top each serving with whipped cream, or pass the cream at the table."}]}