{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Turnips and Winter Squash With Agave Glaze", "description": "Traditionally, this dish, from the Great Plains, would include timpsula, the wild turnip that grows in patches across the region. (Old Lakota harvesting stories tell of how the timpsula point the forager from one plant to the next.) In Lakota homes, the turnips are often braided and dried for use throughout the winter. Unless you live in the region, fresh timpsula is difficult to come by, as it’s not sold commercially. It’s also milder and slightly denser than the garden turnips we’ve substituted in this traditional pairing. The agave glaze adds a touch of sweetness to the vegetables, and the toasted sunflower seeds add crunch. Serve this with <a href=\"https://cooking.nytimes.com/recipes/1020557-bison-pot-roast-with-hominy\">bison pot roast with hominy</a> or spooned over wild rice for a comforting vegetarian meal.", "author": {"@type": "Person", "name": "Sean Sherman"}, "image": "https://static01.nyt.com/images/2019/11/06/dining/04NativeAmericanrex2/04NativeAmericanrex2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, vegetables", "keywords": "butternut squash, light agave nectar, sunflower seeds, turnip, dairy-free, vegan, vegetarian, fall, winter, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 32}, "recipeIngredient": ["2 pounds turnips, trimmed if needed, then cut into 1-inch chunks", "1 small butternut squash or 2 delicata squash (about 2 pounds total), unpeeled, halved, seeds and membranes scraped away, then cut into 1-inch chunks", "2 tablespoons sunflower oil", "2 tablespoons chopped fresh sage", "2 teaspoons coarse sea salt", "2 tablespoons light agave nectar", "1/4 cup toasted sunflower seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Line 2 baking sheets or roasting pans with parchment or foil. In a large bowl, toss the turnips and squash with the oil, sage and salt. Divide the mixture between the 2 baking sheets, then spread in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to the oven on the middle and lower shelves, and roast for 20 minutes, stirring the vegetables and rotating the baking sheets halfway through. Reduce the heat to 400 degrees and continue to roast until tender and caramelized, another 10 to 20 minutes, stirring and rotating again halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and brush with the agave. Return to the oven and cook until the vegetables appear glossy, 2 to 3 minutes. Serve with sunflower seeds scattered on top."}], "link": "https://cooking.nytimes.com/recipes/1020558-roasted-turnips-and-winter-squash-with-agave-glaze"}