{"@context": "http://schema.org", "@type": "Recipe", "name": "Spumoni Ice Cream Cake", "description": "Spumoni is a frozen Italian-American dessert made by layering pistachio, cherry and chocolate (or sometimes vanilla) gelati. This showstopper ice cream cake version looks difficult, but it’s made with store-bought ingredients, so it mostly involves shopping and assembly. The layers can be stacked ahead, and you also don’t have to worry too much about its melting rapidly: The cake’s sheer volume and store-bought ice creams' stabilizers help it stay cold. For a Neapolitan-style cake, you could swap strawberry ice cream for the cherry and vanilla for the pistachio. The only true challenge here is making sure there’s room in your freezer, since this cake is about 4 inches tall.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/07/22/dining/as-spumoni-ice-cream-cake/merlin_158023122_3d451d2c-295a-4dfb-ab52-4e9bd158225f-articleLarge.jpg", "totalTime": "PT6H50M", "recipeYield": "About 16 servings", "recipeCuisine": "american, italian", "recipeCategory": "cakes, ice creams and sorbets", "keywords": "amaretti cookies, confectioners' sugar, ice cream, maraschino cherry, sprinkles, whipping cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 199}, "recipeIngredient": ["1 (1.5-quart) carton or 3 pints cherry ice cream", "1 (1.5-quart) carton or 3 pints pistachio ice cream", "1 (1.5-quart) carton or 3 pints chocolate ice cream, preferably with chocolate chips", "50 amaretti cookies, meringues or chocolate wafers (10 1/2 ounces)", "1 cup maraschino cherries (from one 14-ounce jar), drained and stemmed if needed", "2 1/2 cups heavy cream (see Tip)", "5 tablespoons confectioners’ sugar", "Pinch of kosher salt", "Multicolored sprinkles, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lid from the cherry ice cream and let sit at room temperature until the ice cream softens to the consistency of thick cake batter, 5 to 10 minutes. Remove the lids from the pistachio and chocolate ice creams and let soften in the refrigerator until the ice creams are softened to the consistency of thick cake batter, 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the ice creams soften, cover the bottom of a 9-inch springform pan with one layer of whole amaretti cookies, flat sides down. Put the remaining amaretti in a resealable plastic bag and crush with a heavy pan. Line another 9-inch round cake pan with plastic wrap, leaving a few inches of overhang. Add the crushed cookies and set aside until Step 4."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On top of the whole cookies in the springform pan, spread the softened cherry ice cream in an even layer. Tap the pan gently on the counter to remove air pockets. Distribute the maraschino cherries over the cherry ice cream, saving a handful for the top of the cake. Spread the softened pistachio ice cream in an even layer on top of the cherries. Tap the pan gently on the counter to remove air pockets. Cover the pan with plastic wrap and freeze until firm, about 2 hours or up to 1 week. (If at any point the ice cream is melting to liquid, pop the cake and ice creams in the freezer to firm to a spoonable consistency.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately after placing the cherry and pistachio layers in the freezer, prepare the chocolate layer: Shake to distribute the cookie crumbs evenly in the cake pan. Spread the softened chocolate ice cream in an even layer over the cookies. Press down as you go to adhere the ice cream to the cookies, then tap the pan on the counter to remove air pockets. Cover the pan with plastic wrap and freeze until firm, about 2 hours or up to 1 week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a knife around the cake in the springform pan, then unmold the springform and transfer the cake to a serving plate. Use the plastic wrap overhang to remove the chocolate ice cream out of the cake pan. Invert the layer onto the pistachio ice cream so the crushed cookies are on top (do not remove the plastic wrap). Freeze until set, about 4 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to serve, whip the cream with the sugar and salt until stiff peaks form. Remove the cake from the freezer and remove the plastic wrap from the cake. Working quickly, with a spoon or offset spatula, frost the sides and top of the cake with the whipped cream, then decorate with sprinkles and the reserved maraschino cherries. Serve right away. (If you find the cake too solid to cut, run your knife under hot water before slicing and wipe it dry between cuts. Also remember that the first piece is always the trickiest to get out.)"}], "link": "https://cooking.nytimes.com/recipes/1020365-spumoni-ice-cream-cake"}