{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Lamb Meatballs With Chickpeas and Eggplant", "description": "This dish does not shy away from fat in the best way possible. From the lamb to the olive oil to the yogurt used as a sauce at the end, this is a one-skillet meal that feels worthy of a weekend spread. Since these meatballs aren’t made with binders like eggs or bread, they’re truly best made with a fatty meat like lamb. If you decide to use pork or beef instead, make sure it’s a mixture with a higher fat content or the meatballs could turn out dry. Since eggplant can really soak up oil when pan-frying, feel free to add more to the skillet as the slices cook.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/10/23/dining/21Romanrex/merlin_156252114_ab61c57b-64e1-4e8f-a0ab-94da3bbba996-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, meat, meatballs", "keywords": "chickpea, eggplant, greek yogurt, lamb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 447}, "recipeIngredient": ["1 1/2 pounds ground lamb, pork or beef", "1 1/2 teaspoons fennel seeds", "2 garlic cloves, finely grated", "1 teaspoon red-pepper flakes, plus more as needed", "Kosher salt and freshly ground black pepper", "8 tablespoons olive oil, plus more as needed", "1 medium eggplant, sliced about 1/4-inch thick", "2 (15-ounce) cans chickpeas, drained and rinsed", "1 cup full-fat Greek yogurt, labneh or sour cream", "3 cups mixed greens (the more peppery, the better)", "1 cup cilantro, leaves and tender stems", "1 lemon, halved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine lamb, fennel seeds, garlic and 1 teaspoon red-pepper flakes in a medium bowl. Season with 1 1/2 teaspoons kosher salt, and black pepper to taste, and mix until everything is well combined and the spices are evenly distributed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands, roll lamb mixture into balls about 1 1/2 to 2 inches in diameter, placing them on a parchment-lined baking sheet or plate. You should have about 12 meatballs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon olive oil in a large skillet over medium heat. Add meatballs — work in batches if your skillet can’t comfortably fit them all without crowding — and cook, gently rotating them occasionally so they more or less brown on all sides while keeping a vaguely round shape, 8 to 10 minutes. (Do not stress about this part; they will be delicious no matter what shape they are.) After they are evenly browned and cooked through, transfer them to a plate, leaving the fat and any browned bits behind."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 4 tablespoons oil to the skillet and, working in batches, if needed, add eggplant slices in an even layer, seasoning with salt and pepper. Cook the slices, flipping them once, until they are browned on both sides, about 6 to 8 minutes. Add more oil as needed. After eggplant slices are cooked and browned, transfer them to the plate with the meatballs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 3 tablespoons oil to the skillet, along with chickpeas. Season with salt and pepper, and cook, shaking the skillet and stirring occasionally, until chickpeas are nicely browned, 3 to 5 minutes. (They won’t exactly crisp; you’re just looking to take the edge off and get them nicely seasoned.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season yogurt with salt and pepper and smear onto the bottom of a large plate or serving platter. Top with meatballs, eggplant and chickpeas. Scatter with greens and cilantro, and then squeeze lemon halves over everything before serving."}], "link": "https://cooking.nytimes.com/recipes/1020537-crispy-lamb-meatballs-with-chickpeas-and-eggplant"}