{"@context": "http://schema.org", "@type": "Recipe", "name": "Scalloped Potato Gratin", "description": "Is there anything better than a molten, golden-topped potato gratin? I don’t think so, either. This one stays fairly classic — scented with sage, garlic and nutmeg, then showered with lots of nutty Gruyère. My tweak is in form rather than flavor. Instead of piling the potatoes an inch or two deep in a gratin dish, I shingle the slices in a shallow sheet pan. It gives the whole thing a more elegant look, and you get maximum browning and crunch on top. There’s less of the gooey center, but what it loses in ooze it makes up for in increased surface area for the crisp-edged baked cheese.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/03/11/dining/06apperex-gratin/merlin_169778982_31c411f1-f171-4a32-b9b9-dd8d19fe4f4d-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "french", "recipeCategory": "weekday, casseroles, vegetables", "keywords": "garlic, gruyère, potato, sage, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 185}, "recipeIngredient": ["1/4 cup unsalted butter (1/2 stick), plus more for greasing the aluminum foil, at room temperature", "3 cups heavy cream", "1/4 cup chopped fresh sage leaves", "4 fat garlic cloves, finely grated or minced", "1/4 teaspoon freshly grated nutmeg", "1 1/2 teaspoons fine sea salt, plus more as needed", "5 large eggs", "4 pounds russet potatoes (about 6 large or 8 medium)", "Freshly ground black pepper", "2 1/4 cups grated Gruyère (8 1/2 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees, and brush 1/4 cup butter on a rimmed 17-by-13-inch baking sheet. Brush one or two pieces of foil (enough to cover the top of the pan) with more butter. Set the foil aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot, bring the cream, sage, garlic, nutmeg, and a pinch of salt to a simmer. Simmer until reduced by a quarter, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heatproof bowl, lightly beat the eggs. Beating constantly, gradually add a little of the hot cream to the eggs, then slowly pour in the rest of the hot cream, whisking to prevent the eggs from curdling. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mandoline or a sharp knife, slice the potatoes into 1/8-inch-thick rounds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange one layer of potatoes on the buttered baking sheet, slightly overlapping the slices. Sprinkle with 3/4 teaspoon of the salt, add pepper to taste, then pour half the egg mixture over the potatoes. Top with 1/2 cup cheese. Repeat the layers of potato, seasoning and egg mixture. Top with the remaining 1 3/4 cups cheese. Cover the baking sheet with the foil (buttered-side down) and bake for 20 minutes. Remove the foil and bake until the potatoes and cheese are browned and bubbling, 25 to 30 minutes. Let cool slightly, then serve."}], "link": "https://cooking.nytimes.com/recipes/1020921-scalloped-potato-gratin"}