{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear and Frangipane Crostata", "description": "Basically a batter of ground almonds in a buttery sweet Italian-style crust, this easy tart is sublime with a little sugared fruit baked on top — apples or pears in the cold months, cherries and stone fruit in summer — but it is also very good plain, served with a fruit compote alongside. A small wedge is sufficient after a big meal, but no one will complain if you serve a dab of whipped cream or ice cream on the side. This tart is best on the day it is baked: Save time by making the dough and lining the tart pan up to a week in advance and freezing.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/02/05/dining/03Tanisrex-crostata/03Tanisrex-crostata-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "almond, egg, pear, rum, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 150}, "recipeIngredient": ["1/2 cup/100 grams granulated sugar", "Pinch of salt", "1 whole egg, plus 2 yolks", "1/2 cup/115 grams unsalted butter (1 stick), softened", "2 1/4 cups/290 grams all-purpose flour", "1 cup/110 grams finely ground blanched almonds", "1/2 cup/100 grams granulated sugar, plus 2 tablespoons for sprinkling", "3 tablespoons/45 grams melted unsalted butter", "2 egg yolks, plus 1 whole egg", "2 tablespoons dark rum", "1/2 teaspoon almond extract", "2 or 3 medium pears, peeled and sliced 1/4-inch thick"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Heat oven to 375 degrees. In a stand mixer or in a bowl with a sturdy whisk, beat together sugar, salt, eggs and butter. Fold in flour and knead the dough into a ball. Squash the dough into a disk, wrap in plastic wrap and refrigerate for at least an hour or up to 2 days before using. (Dough can also be frozen up to 2 months.) Roll out dough using a lightly floured rolling pin or press dough into a 10-inch French tart pan. Freeze or refrigerate tart shell while you make the filling. (It is not necessary to blind bake the tart shell.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Whisk together almonds, sugar, butter, egg yolks and whole egg until creamy, then whisk in rum and almond extract."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the frangipane batter evenly over the bottom of tart shell, and arrange pear slices over in a circular pattern. Sprinkle with 2 tablespoons sugar. Bake at 375 degrees, for 10 minutes, then reduce heat to 350 degrees. (If pastry is browning too quickly, loosely cover edges with foil.) Bake for 25 to 30 minutes until golden but not too dark and a toothpick pushed into the center of the tart comes out clean. If it doesn't, bake a few minutes longer."}], "link": "https://cooking.nytimes.com/recipes/1020838-pear-and-frangipane-crostata"}