{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken With Prosciutto and Sage", "description": "Versatility is what you get with this dish, which borrows its flavors from the Italian staple saltimbocca, a combination of veal, prosciutto and sage. Here, the dark meat of chicken takes the place of veal, and instead of meat slices topped with the ham and herbs, there are plump bundles with the sage inside. Boneless chicken thighs make for easier slicing. Leaving the skin on to brown, provides more flavor, especially with some of the sage tucked underneath. Fingerling potatoes simmer as the chicken braises, and fresh peas contribute a touch of spring for a one-pot meal, not instant but hardly demanding. A final, judicious splash of balsamic vinegar intensifies the sauce.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2019/04/17/dining/11pairrex/merlin_153033765_9dc61a90-1c2b-44ab-b109-77f27ba72f89-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry", "keywords": "chicken thigh, fennel, fingerling potatoes, prosciutto, sage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 120}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 430, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "3 grams", "proteinContent": "31 grams", "saturatedFatContent": "8 grams", "sodiumContent": "860 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon unsalted butter", "6 large boneless, skin-on chicken thighs (about 6 ounces each)", "1/2 cup finely chopped fennel bulb (about 1/4 bulb)", "1/2 cup finely chopped red onion (about 1/2 onion)", "Salt and ground black pepper", "1/2 teaspoon ground sage", "18 medium-size fingerling potatoes (about 1 pound)", "1 1/2 cups chicken stock", "18 fresh sage leaves (from a small bunch), plus a few sprigs for garnish", "12 thin slices prosciutto (about 5 ounces)", "2/3 cup shelled peas", "1 teaspoon good-quality balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in a large sauté pan over medium-high heat. Add chicken thighs, skin side down, and sear until skin is nicely browned, about 5 to 7 minutes. Remove chicken to a platter, skin side up. Reduce heat to low, add fennel and onion to sauté pan, season with salt and pepper, stir in ground sage and cook until translucent, about 5 minutes. Add potatoes, stir, add stock, bring to a simmer, cover and cook until potatoes are just about tender when pierced with a paring knife, 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While potatoes are cooking, tuck a sage leaf under the skin of each thigh. Turn thighs over and season the flesh side of each with salt and pepper, and place 2 sage leaves on each. Roll each thigh into a bundle, skin side out, and wrap in prosciutto, using 2 overlapping slices for each to fully enclose the chicken. Tuck wrapped chicken, seam side down, in among the potatoes in the sauté pan. Add the peas. Cover and cook for 20 minutes, basting chicken with pan juices halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken to a warm platter and surround with potatoes. Stir vinegar into the pan sauce, add salt and pepper if needed, and pour, including the peas, over and around the chicken and potatoes. Garnish platter with sage and serve."}], "link": "https://cooking.nytimes.com/recipes/1020140-chicken-with-prosciutto-and-sage"}