{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Beans and Greens With Fried Shallots", "description": "These delightfully al dente green beans are a quick-cooking nod to the green bean casserole. There is no cream of mushroom soup, but there are fried shallots. Torn leafy greens, briefly sautéed with a bit of butter and a few melted anchovies (which can be omitted for vegetarians), are added to the beans to wilt at the last minute for a very green-on-green side. Depending on what else you’re serving, this could almost count as a salad. Be sure to finish with plenty of acid and flaky salt.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/11/13/dining/11Romanrex4/merlin_161935386_137071aa-6441-4ccc-a962-f0b0e4b0f90c-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, vegetables", "keywords": "anchovy fillets, green beans, kale, shallot, swiss chard, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 461}, "recipeIngredient": ["1/2 cup olive oil", "3 large shallots, thinly sliced", "Kosher salt and freshly ground black pepper", "2 pounds green beans, trimmed", "4 tablespoons unsalted butter", "4 anchovy fillets", "1 large bunch kale or Swiss chard, thick stems removed, leaves torn into bite-size pieces", "2 tablespoons apple cider, white wine vinegar or fresh lemon juice, plus more for seasoning", "Flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil and shallots in a large skillet over medium heat. Cook, swirling the skillet occasionally, until shallots are lightly browned and starting to crisp, 5 to 6 minutes. Using a slotted spoon, transfer shallots to a paper towel; season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer half of the oil from the pan to a small bowl. Return the skillet to medium-high heat, and add green beans. Season with salt and pepper and cook, without tossing, until lightly charred and blistered on one side, 3 to 4 minutes. Give them a toss, and cook, another 3 to 4 minutes, until just tender and cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter and anchovies, and season with salt and pepper. Add kale, and toss to coat until greens are wilted and tender and butter is melted, 2 to 3 minutes. Remove from heat, and add vinegar, tossing to coat. Season with salt, pepper and more vinegar, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a large bowl or platter and drizzle with reserved shallot oil. Scatter with fried shallots and flaky salt, and serve."}], "link": "https://cooking.nytimes.com/recipes/1020603-green-beans-and-greens-with-fried-shallots"}