{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Farro With Crispy Mushrooms and Sour Cream", "description": "Similar in texture to a risotto (without the constant stirring), this creamy, saucy farro is about half the work, with almost no technique required. While the porridgelike texture is a delight all on its own, the meaty, golden brown mushrooms and frizzled leeks are the real reason you are here. Using plenty of olive oil to make sure the mushrooms crisp and brown without sticking will be the secret to success in that department.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2020/01/15/dining/13Romanrex/merlin_166853004_056d5354-de14-4f10-a8fb-520e2d02e6e0-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, grains and rice", "keywords": "farro, leek, mushroom, sour cream, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1090}, "recipeIngredient": ["1/4 cup olive oil, plus more as needed", "4 medium leeks, white and light green parts, thinly sliced", "1 pound mix of mushrooms, such as maitake, oyster, cremini or chanterelle, torn into bite-size pieces (about 5 cups)", "Kosher salt and freshly ground black pepper", "1 3/4 cups pearled or semi-pearled farro or barley", "4 cups vegetable broth or chicken broth", "1/2 cup finely chopped chives (from about 1 bunch)", "1 cup fresh dill leaves, coarsely chopped", "1 tablespoon finely grated lemon zest, plus lemon wedges for squeezing", "Sour cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in a large Dutch oven over medium-high heat. Add half the leeks and half the mushrooms, and season with salt and pepper. Cook, stirring occasionally, until the mushrooms are browned and crisped, 12 to 15 minutes. (They will start giving off moisture and steaming a little before this happens, so be patient.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, transfer them to a medium bowl leaving any olive oil behind. (They will have absorbed the oil as they cook, and released it back as they crisp.) Add a bit more olive oil so there’s another 1/4 cup or so in the pot. Cook the remaining leeks and mushrooms, adding them to the bowl with the other mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Without wiping the pot, add farro and season with salt and pepper. Cook over that same medium-high heat, stirring frequently, until farro is toasted on the outside (it will go from pale golden brown to a toastier golden brown), about 5 minutes. Add vegetable broth and 2 cups water; season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a strong simmer and reduce heat to medium-low. Simmer gently, stirring occasionally, until farro is fully cooked and most (but not all) of the liquid has been absorbed, 20 to 25 minutes. It should still look a bit loose, like risotto or a porridge. Remove from heat and add half the chives."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss dill, remaining chives and lemon zest together in a small bowl. To serve, season farro with salt and pepper and ladle into bowls. Top with sour cream, mushrooms and leeks, and dill mixture. Serve lemon wedges alongside for squeezing."}], "link": "https://cooking.nytimes.com/recipes/1020774-creamy-farro-with-crispy-mushrooms-and-sour-cream"}