{"@context": "http://schema.org", "@type": "Recipe", "name": "Ham and Cheese Pasta With a Handful of Peas", "description": "<em>This is a no-recipe recipe, a recipe without an ingredients list or steps. It invites you to improvise in the kitchen.</em>\nPick up a box of large shells — the ones the size of a knuckle, so they hold a little pasta water in them. Pick up a ham steak from the butcher or the corner of the supermarket meat display, and dice it. Pick up a bag of frozen organic peas as well — they’re sweeter. You’ll need a block of good Swiss if you can find it, or some Jarlsberg if you can’t. (Hey, it melts like a dream.)\nSet a large pot of salted water to boil, and prepare your pasta. While it cooks, get to work on the next burner, browning the ham in a pat of good unsalted butter in a skillet. Offstage, grate about a cup of cheese into a large serving bowl. When the pasta has been cooked for just shy of the time called for on its packaging, throw in a handful of peas, cook another minute, then drain, reserving a little cooking water. Toss the whole mess into the cheese, along with the hot ham, another pat or two of butter and a splash of the pasta water. Watch as the cheese goes soft and ribbony in the heat, and the fat of the ham mingles with the butter and the pasta water, and the shells pick up some of it and grab peas in their valves. Shave some Parmesan over the top. Don’t you want to eat that right now?\n<em>Sam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. <a href=\"https://www.nytimes.com/newsletters/cooking\">Sign up to receive it.</a> You can find more no-recipe recipes <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/14326423-no-recipe-recipes\">here</a>.</em>", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/02/17/dining/17norecipe-hamcheese/17norecipe-hamcheese-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, pastas", "keywords": "ham, pasta, peas, swiss chard, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 390}, "recipeIngredient": [], "recipeInstructions": null, "link": "https://cooking.nytimes.com/recipes/1020023-ham-and-cheese-pasta-with-a-handful-of-peas"}