{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey Barbecue Sandwiches With Pickles and Slaw", "description": "Most turkey sandwiches are best made with slices of white meat stacked neatly between two slices of bread. Not this one. With a saucy, spicy filling piled onto a hamburger bun, it’s perfect for dark meat and any scraps you may have leftover from the carcass. The cabbage slaw adds crispness and tang to the soft turkey, and bread-and-butter pickles give the sandwich a touch of sweetness. If you don’t have leftover turkey in your refrigerator, this recipe works just as well with the meat torn off a rotisserie chicken.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/11/27/dining/22apperex3/merlin_164466594_a62e395c-e6b0-4ace-a1d1-8f3f41c8ecc0-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, weekday, sandwiches", "keywords": "barbecue sauce, cabbage, hamburger buns, jalapeño, turkey, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 63}, "recipeIngredient": ["1/4 cup apple cider vinegar, plus more as needed", "2 teaspoons granulated sugar", "1 teaspoon fine sea salt", "4 cups sliced green cabbage (about 1/2 small head)", "1 large shallot, thinly sliced", "1 large carrot, coarsely grated", "1 jalapeño, seeded and thinly sliced", "1/2 cup barbecue sauce, <a href=\"https://cooking.nytimes.com/recipes/1014733-pulled-pork-sandwiches\">homemade</a> or store-bought, plus more for serving", "Hot sauce (optional)", "12 ounces cooked shredded turkey, warmed up (about 3 cups)", "Mayonnaise (optional)", "4 sandwich or hamburger buns", "Bread-and-butter pickle slices, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pot, combine 1/4 cup vinegar, the sugar and the salt. Cover pot and heat just until sugar dissolves, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium bowl, toss together cabbage, shallot, carrot and jalapeño. Pour hot vinegar mixture over vegetables and toss to combine. Cover and let sit, tossing occasionally, while you prepare the sandwiches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour barbecue sauce into a medium bowl and taste it. If it’s too sweet, add a little more vinegar and hot sauce, if you like. Toss in turkey and stir until evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the sandwiches, spread mayonnaise inside the buns, if you like, then fill the buns with slaw, pickles and turkey. Serve with more hot sauce on the side, if you like."}]}