{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn on the Cob With Lime, Fish Sauce and Peanuts", "description": "As this recipe proves, lime juice, fish sauce and sugar is a powerful combination you should commit to memory. Traditionally, those three ingredients form the base of several classic Thai and Vietnamese sauces like nuoc cham and nam pla prik. The mayonnaise here is barely noticeable, but it serves an important role in helping the flavors adhere to the corn. The cilantro is optional so no one will throw a fit.", "author": {"@type": "Person", "name": "Emily Fleischaker"}, "image": "https://static01.nyt.com/images/2019/07/09/dining/ef-corn-on-the-cob-with-fish-sauce-lime-and-peanuts/ef-corn-on-the-cob-with-fish-sauce-lime-and-peanuts-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "appetizer, side dish, cilantro, corn, fish sauce, lime leaves, peanut, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "recipeIngredient": ["4 ears fresh corn, shucked", "1 lime", "6 tablespoons mayonnaise", "2 teaspoons fish sauce", "1/2 teaspoon granulated sugar", "1/2 to 3/4 cup finely chopped unsalted roasted peanuts", "3 tablespoons chopped fresh cilantro (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat grill to medium-high. Grill corn, turning occasionally, until cooked through and lightly charred, 10 to 12 minutes. (Alternatively, drop corn in a large pot of salted boiling water and cook for 5 to 7 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, zest the lime. Set aside the zest then cut the lime in half. Cut one half into four wedges and squeeze the remaining half into a small bowl. Stir the mayonnaise, fish sauce and sugar into the lime juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slather hot corn with mayonnaise mixture. Sprinkle with chopped peanuts, or, for maximum coverage, roll corn in peanuts spread on a plate. Sprinkle with lime zest and cilantro, if using. Serve with lime wedges alongside for squeezing."}], "link": "https://cooking.nytimes.com/recipes/1020339-corn-on-the-cob-with-lime-fish-sauce-and-peanuts"}