{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Chops With Salted Plums", "description": "This weeknight affair pairs savory pork with a sweet-and-sour mixture of sliced plums and red onions. When a recipe has so few ingredients, it’s important that they be of the highest quality possible. The pork chops here will deliver most of the fat, so make sure they’re well marbled (bone-in loin or rib chops both work). As for the plums, this is one of the rare occasions in which underripe is preferred to perfectly ripe, so they maintain texture after they get briefly tossed in the skillet, and also deliver plenty of acidity for the pan sauce.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/09/11/dining/09Romanrex/merlin_156252630_4ec6d8aa-e1d1-4761-aa2a-9bdbfb17cd06-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weekday, meat", "keywords": "fall, summer, main course, plums, pork chops, red onion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 298}, "recipeIngredient": ["2 bone-in pork chops (1 1/4- to 1 1/2-inch thick, about 1 1/2 pounds total)", "Kosher salt and ground pepper", "1 pound medium plums, pitted and sliced", "1/2 small red onion, thinly sliced", "1/4 cup unseasoned rice wine vinegar or fresh lime juice, plus more as needed", "1/2 teaspoon fish sauce (optional)", "2 tablespoons canola oil", "1 cup fresh mint leaves", "Olive oil, for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season pork with salt and pepper; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the plums and onion in a medium bowl along with vinegar and fish sauce, if using. Season with salt and pepper and try a plum; they should be relatively tangy and salty. Add more vinegar or salt, if needed, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large skillet over medium-high heat. Add pork chops and cook, without moving, until well browned on one side, 4 to 6 minutes. Flip chops and cook until well browned on the other side, another 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pork chops to a cutting board to rest. Add plum and onion mixture to the skillet and remove from heat. Give everything a toss, just to deglaze the skillet and scrape up any of those browned bits, slightly wilting the onion and letting some of those plum juices run free."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice pork chops to your desired thickness and transfer to a large serving platter. Scatter with plum mixture, top with mint and give everything a drizzle of olive oil before serving."}]}