{"@context": "http://schema.org", "@type": "Recipe", "name": "New Shrimp Louie (Poached Shrimp Salad)", "description": "In this spirit of classics like shrimp Louie or niçoise salad, this is a fairly basic, highly customizable salad-for-dinner deal, in which the nonnegotiables are fresh seafood (shrimp or salmon), crunchy lettuce (romaine or Little Gems) and tons of lemon (which comes in a tangy vinaigrette made with shallot and tarragon). From there, you can add any number of raw or lightly blanched vegetables, like shaved radish, sliced avocado or blanched green beans. To make things easy and efficient, the shrimp, eggs and green beans can all be cooked in the same pot of boiling water, so it’s not much of a fuss.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/05/22/dining/20Romanrex/merlin_154781400_28fde81b-638c-4968-a091-e2821f68ef96-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "brunch, dinner, lunch, weekday, salads and dressings, seafood", "keywords": "avocado, egg, green beans, lettuce, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 317}, "recipeIngredient": ["Kosher salt", "8 ounces green beans, tails trimmed", "1 1/2 pounds large shrimp, shell on, deveined if you like", "4 large eggs", "1 small shallot, sliced", "2 tablespoons fresh tarragon leaves, finely chopped", "3 tablespoons fresh lemon juice", "Freshly ground black pepper", "1/2 large head romaine lettuce or 3 heads Little Gem lettuce, torn or cut into large pieces", "1 medium watermelon radish or 3 regular radishes (or a mix of both), thinly sliced", "1 avocado, thinly sliced", "Olive oil, for serving", "1 cup <a href=\"https://cooking.nytimes.com/recipes/1020051-zuni-cafes-small-batch-aioli\">aioli</a> or mayonnaise, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Add green beans and cook until bright green and just tender, 2 minutes or so. Remove from water and transfer to a plate to cool. (No need to use an ice bath, but if you want to, go for it.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add shrimp and cook until bright pink and just cooked through, 2 to 4 minutes depending on the size of the shrimp. Transfer to a plate to cool. Once the shrimp are cool enough to handle, peel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the water to a boil and gently lower in eggs. Boil for 6 to 7 minutes (6 for runnier yolks, 7 for slightly firmer). Remove from heat and run under cold water for a minute or two. (Feel free to place them in an ice bath, if you wish, but I find very cold running water does the trick.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine shallot, tarragon and lemon juice in a small bowl and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the salad, arrange the lettuce on a large serving platter or in a shallow bowl and scatter with radishes, avocado, green beans and shrimp. Spoon shallot mixture over everything and drizzle with olive oil. Peel and halve the eggs and nestle in the salad. Serve with aioli or mayonnaise alongside for individual dressing."}], "link": "https://cooking.nytimes.com/recipes/1020237-new-shrimp-louie-poached-shrimp-salad"}