{"@context": "http://schema.org", "@type": "Recipe", "name": "Yellow Sheet Cake With Chocolate Frosting", "description": "This is the kind of dessert worth dreaming about: a buttery yellow cake topped with a chocolate-sour cream frosting, made doubly rich with cocoa powder and melted chocolate. The batter may seem thin when you spread it in the pan, but, once baked, it rises to perfection. It’s not a towering, lofty cake — it’s not meant to be — but when it’s covered with a generous layer of frosting, it makes for the ideal cake-to-icing ratio. For a perfect cake, make sure designated “room temperature” ingredients truly are; this helps ensure that the batter is fully incorporated so the cake bakes evenly.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2019/03/11/dining/em-yellow-sheet-cake-with-chocolate-frosting/merlin_151072443_d52e0970-46c3-4ed9-b58f-dcbb1c67b9dc-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "One 9-by-13-inch cake", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "chocolate, cocoa, confectioners' sugar, flour, sour cream, sugar, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 631}, "recipeIngredient": ["Nonstick cooking spray", "3/4 cup/170 grams unsalted butter (1 1/2 sticks), at room temperature", "1 1/4 cups/250 grams granulated sugar", "2 large eggs plus 1 large egg yolk, at room temperature", "1 tablespoon vanilla extract", "1 1/2 cups/190 grams all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/4 teaspoon fine sea salt", "3/4 cup/180 milliliters whole milk", "3/4 cup/170 grams unsalted butter, at room temperature", "2 1/2 cups/310 grams confectioners’ sugar", "1/2 cup/45 grams cocoa powder", "1/2 cup/120 milliliters sour cream", "2 ounces/55 grams bittersweet chocolate, melted and cooled", "1 1/2 teaspoons vanilla extract", "Pinch of fine sea salt", "Sprinkles, for finishing (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease a 9-by-13-inch pan with nonstick spray. Heat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: In the bowl of an electric mixer fitted with the paddle attachment, cream the butter and sugar on medium speed until light and fluffy, 4 to 5 minutes. Beat in the eggs one at a time, then the egg yolk, scraping the sides of the bowl after each addition. Mix on medium speed until fully incorporated, about 1 minute. Add the vanilla extract and mix to combine, 15 to 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the flour, baking powder, baking soda and salt to combine. Add about 1/3 of the flour mixture to the mixer and mix on low speed until incorporated, about 30 seconds. Add about half the milk and mix on low speed until incorporated, about 15 seconds more. Repeat with another batch of flour mixture, the remaining milk, then the remaining flour mixture until fully incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the batter to the prepared pan and spread in an even layer. Bake until a toothpick inserted into the center comes out clean and the cake is golden and separating from the pan at the edges, 30 to 35 minutes. Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the frosting: Add the butter to the bowl of an electric mixer fitted with the paddle attachment and beat on medium speed until light and fluffy, 3 to 4 minutes. Remove the bowl from the electric mixer, and sift the confectioners’ sugar and cocoa into the bowl with the butter. Stir with a spatula a few times to incorporate slightly. Return the bowl to the mixer and beat on medium speed until smooth and uniform in color, 1 to 2 minutes. Add the sour cream and melted chocolate and mix on low speed until combined, about 30 seconds. Add the vanilla and salt and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the frosting on the cooled cake in an even layer. Garnish with sprinkles, if desired."}], "link": "https://cooking.nytimes.com/recipes/1020093-yellow-sheet-cake-with-chocolate-frosting"}