{"@context": "http://schema.org", "@type": "Recipe", "name": "Ricotta Dumplings With Buttered Peas and Asparagus", "description": "These dumplings are a way to get the satisfaction of making your own pasta without having to make your own pasta. This recipe doesn’t require you to drain the ricotta, but if you notice that yours is especially wet, you may want to add a tablespoon or two more of flour to make sure the dough stays together. It should be like a very wet biscuit dough (and not pourable or soupy). As for the vegetables, this dish is a truly excellent canvas for anything seasonal (asparagus and peas in the spring, cherry tomatoes in the summer, mushrooms in the fall, squash in the winter), so adjust as you like.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/05/08/dining/06romanrex/merlin_154236198_f306e3c5-29e4-4efd-b2ca-602531730222-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, pastas", "keywords": "asparagus, pea shoots, peas, ricotta, main course, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1079}, "recipeIngredient": ["2 cups whole-milk ricotta", "2 large eggs", "Kosher salt and black pepper", "3/4 cup all-purpose flour", "4 tablespoons unsalted butter", "2 tablespoons olive oil, plus more for serving", "1 large leek, white and light green parts only, thinly sliced", "1 bunch asparagus, woody ends removed, cut into 2-inch pieces", "2 cups shelled fresh or frozen peas", "3 cups pea shoots or leaves, thick stems removed", "1/4 cup parsley or mint leaves, for serving", "Parmesan or pecorino, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine ricotta and eggs in a large bowl. Season with salt and pepper and, using a large wooden or metal spoon, gently mix in the flour, taking care not to overmix (which could result in tough dumplings)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat butter and 2 tablespoons olive oil in a large skillet over medium-high. Add leeks and season with salt and pepper. Cook, stirring occasionally, until leeks have softened completely and are starting to pick up some color, 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add asparagus and peas to the skillet and season with salt and pepper. Cook, tossing occasionally, until asparagus is just tender and bright green, 2 to 4 minutes, depending on its thickness. Remove from heat while you cook the dumplings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water is at a nice steady boil, drop the ricotta mixture into the pot by the heaping spoonful. (The dumplings will expand in the water, so make them slightly smaller than you’d like them to end up.) Be careful not to crowd the pot; cook the dumplings in batches if need be."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the dumplings rise to the top, let them boil until cooked through, 4 to 5 minutes. (You can always pull one out and cut it in half to test its doneness; the texture will go from dense and doughy to light and pillowy.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the dumplings finish cooking, use a slotted spoon to transfer them to the skillet with the peas and asparagus. Once they’re all in there, give everything a quick toss over medium heat just to evenly coat the dumplings in the buttery sauce. Add pea shoots and toss just to wilt slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a large serving bowl or platter and top with parsley, cheese and more olive oil, if you like."}], "link": "https://cooking.nytimes.com/recipes/1020204-ricotta-dumplings-with-buttered-peas-and-asparagus"}