{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Flautas Ahogadas", "description": "These crunchy, tube-shaped flautas ahogadas — the name roughly translates to “drowned flutes” — are served in a pool of spicy tomatillo sauce, and the idea is to slather each bite in the sauce as you eat. They’re immensely popular in Mexico City, where they’re prepared using long corn tortillas specifically made for the dish. This faster version uses standard corn tortillas and a quick rotisserie chicken filling, but the tomatillo sauce, which is tart with an underlying sweetness, deserves to be made from scratch. Prepare it a day in advance or freeze it to save time. It’s worth making a double batch of the sauce, because it brightens up just about anything: tacos, quesadillas or eggs.", "author": {"@type": "Person", "name": "Lesley Téllez"}, "image": "https://static01.nyt.com/images/2019/05/03/dining/lt-flautas/lt-flautas-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, poultry", "keywords": "chicken, cilantro, cotija, serrano chili, tomatillo, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 99}, "recipeIngredient": ["1 small white onion, peeled", "1 pound tomatillos, husked and rinsed", "2 serrano chiles", "1 large garlic clove, peeled", "2 cups shredded white and dark meat (about 10 ounces) from half a rotisserie chicken", "3/4 teaspoon ground cumin", "1/2 teaspoon Mexican oregano", "Kosher salt and ground pepper", "1 tablespoon canola oil, plus about 2 cups for frying", "12 corn tortillas", "1/2 cup <a href=\"https://cooking.nytimes.com/recipes/1018885-crema\">Mexican crema</a>", "3/4 cup crumbled cotija cheese (about 4 ounces)", "1/2 cup cilantro leaves and stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large saucepan halfway with water and bring to a boil over high. Thinly slice half the onion crosswise into thin rounds, leaving the remaining onion half in one large piece. Add the onion wedge, tomatillos, chiles and garlic to the boiling water, reduce the heat to medium-low and simmer, stirring occasionally, until softened and tomatillos take on a yellow-green hue, about 10 minutes. Reserve 1 cup cooking water and pour the remaining contents of the saucepan into a colander to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While tomatillos cool, toss the chicken with the cumin, oregano, 1/2 teaspoon salt and 1/4 teaspoon black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely chop the cooked onion, garlic and chiles, discarding chile stems. Transfer to a blender with 1/4 cup reserved cooking water and blend until chunky. Add the tomatillos and another 1/2 cup reserved cooking water and blend until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon oil in the saucepan over medium. Add the sauce and 1 teaspoon salt. Pour the remaining 1/4 cup reserved cooking water into the blender jar, swirl around to catch any remnants in blender, then pour the mixture into the saucepan. Simmer over low, stirring often, until flavors meld, about 10 minutes. Cover and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sauce cooks, wrap the tortillas in a damp dish towel and microwave, 1 minute. Shuffle the tortillas to redistribute the heat, then microwave, 1 minute more. Transfer to a dry dish towel and wrap tightly to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat about 1/2-inch oil in a large, heavy skillet over medium-high. To test if it’s hot enough, tear off a small piece of tortilla, add to oil and flip after 30 seconds; the tortilla should turn light golden-brown. (You’ll need to make sure the oil is properly heated so the flautas become crisp.) Working with one at a time, pull out a warm tortilla and add about 2 tablespoons chicken in a line down the center of the tortilla. Roll tightly and secure crosswise using two toothpicks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once you’ve rolled all 12 tortillas, gently transfer them to the hot oil using tongs and cook, seam side down, until golden brown on all sides, turning occasionally, about 4 to 5 minutes. (Work in batches to avoid crowding.) Using tongs, tilt flautas over skillet to allow excess oil to drain, then transfer flautas to a paper towel-lined platter and carefully remove and discard toothpicks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide the sauce among 4 shallow bowls (about 1/2 cup per serving). Divide the flautas among bowls and slather flautas with crema. Top with cheese, sliced onion and cilantro and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020200-chicken-flautas-ahogadas"}