{"@context": "http://schema.org", "@type": "Recipe", "name": "Tacos de Picadillo", "description": "In Texas, picadillo is a ground-beef mixture that can be tucked into tacos, stuffed into peppers or burritos, or even eaten like stew with tortillas. Adán Medrano, a chef and writer whose work focuses on the Mexican-American food he grew up on in South Texas, created this dish based on the rolled tacos served for nearly seven decades at the Malt House in San Antonio, a beloved Texas Mexican spot that was demolished in 2018. The meat is flavored with what Mr. Medrano calls the “holy trinity,” a Texas Mexican spice paste of peppercorns, cumin and garlic. While many Mexican-Americans soften the tortillas in hot oil as for enchiladas, Mr. Medrano dips them in caldito, a broth created from the picadillo liquid.", "author": {"@type": "Person", "name": "Rachel Wharton"}, "image": "https://static01.nyt.com/images/2019/04/24/dining/22mexicanrex2/22mexicanrex2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "10 tacos", "recipeCuisine": "american, mexican", "recipeCategory": "dinner, easy, meat, tacos", "keywords": "corn tortillas, ground beef, salsa, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 132}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 189, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "4 grams", "sodiumContent": "214 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["4 large garlic cloves, peeled and minced", "2 teaspoons cumin seeds", "1/2 teaspoon whole black peppercorns", "1 tablespoon canola or vegetable oil", "1 pound lean ground beef", "1/2 medium white onion, halved and thinly sliced", "Kosher salt", "10 corn tortillas, plus more as needed (see Tip)", "1 cup thinly sliced iceberg lettuce, seasoned with salt", "1 plum tomato, diced and seasoned with salt", "Rice and beans, for serving", "Salsa ranchera or other cooked tomato salsa (optional), for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a mortar and pestle to mash the garlic, cumin seeds and peppercorns into a smooth paste. Add 1/4 cup water and mash until the paste is incorporated into the water. Transfer the mixture to a measuring cup. (Alternately, blend the garlic, cumin seeds and peppercorns in a blender with about 1/4 cup water, occasionally scraping down the sides of the blender until very well blended, about 5 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the picadillo, heat the oil in a large, deep skillet over medium-high. Add the beef and let it brown, breaking it up with a wooden spoon, until mostly cooked through, about 8 minutes. Add the onion and cook, stirring occasionally, until the onion becomes translucent and the meat is fully crumbled, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half the blended garlicky liquid to the beef, along with 1/4 teaspoon salt and about 1 cup water. (The water should cover the beef by about two-thirds.) Let the mixture come to a simmer over medium heat. Let cook, occasionally scraping the bottom of the skillet using a wooden spoon to release any browned bits, until the liquid reduces slightly, 5 to 7 minutes. Turn off the heat and season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain most but not all of the liquid from the beef picadillo into another skillet (you’ll want to retain just enough to keep the meat moist), then cover the beef picadillo and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the excess beef cooking liquid, add the remaining blended garlicky liquid, 1 cup water and 1/8 teaspoon salt. Bring the mixture to a strong simmer over medium-high heat and let it cook for about 5 minutes, then reduce the heat to medium-low. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the drained beef picadillo, season to taste, and add a few spoonfuls of the reduced broth to season the meat, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay one tortilla in the skillet containing the simmering broth and let it soak just until slightly softened, 5 or 6 seconds (enough time for the tortilla to absorb the flavors of the broth without absorbing too much liquid and falling apart). Working quickly, use a spatula to remove the softened tortilla from the skillet, allowing excess liquid to drip off, and lay the tortilla down on a plate. Spoon about 1/4 cup beef picadillo down the middle. Roll the taco and transfer it to a platter, seam side down. Repeat this step until you have filled all of the tortillas. Discard any remaining broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the tacos with the shredded lettuce and diced tomato. Serve with rice and beans and salsa, if using."}]}