{"@context": "http://schema.org", "@type": "Recipe", "name": "Pretzel Shortbread", "description": "Flecked with sea salt on the outside, buttery and supremely crunchy within, this pretzel shortbread leans to the savory side, both salty and sweet. This version, created by Lost Bread Company in Philadelphia, mixes crumbs from the bakery’s own sourdough pretzels into the dough. But any pretzels will give the shortbread the necessary tang. The bakery also dips the shortbread into a lye solution before baking to give them that characteristic glossy surface. This simplified version calls for either using baking soda or an egg white. The slightly bitter baking soda mixture adds some of the complex flavor of the lye, but using an egg white is simpler, and the cookies are nearly as delicious.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/03/04/dining/28Appe1/merlin_169351569_a62b84f9-83de-4f55-8f5b-893e6dd0620a-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "About 15 cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "demerara sugar, flour, pretzel crumbs, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 455}, "recipeIngredient": ["1/2 cup/65 grams pretzel crumbs (see Note)", "3 1/4 cups/415 grams all-purpose flour", "1 cup/210 grams Demerara sugar", "1/4 teaspoon fine sea salt", "1 1/4 cup plus 2 tablespoons/310 grams unsalted cold butter (2 3/4 sticks), cut into 1/2-inch cubes", "1/4 cup baking soda, or 1 large egg white", "Pretzel salt or flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Spread pretzel crumbs on a rimmed baking sheet and bake them, stirring once, until they smell toasty (they may not darken, and that's OK), about 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour crumbs into the bowl of an electric stand mixer to cool. Whisk in flour, sugar and salt. Place the butter cubes on top of the flour mixture and chill until everything is very cold, at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the paddle attachment, beat flour and butter mixture on low speed until it comes together into a dry, crumbly dough that just holds together when you squeeze it, 10 to 15 minutes. If the dough isn’t coming together in the mixer, use your hands to knead it. It will be difficult to work with."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a rimmed baking sheet with a silicone baking mat. On a floured surface, use a rolling pin to roll out and press dough into an 8-by-10-inch rectangle about 3/8-inch thick. (Alternatively, you can press the dough into a quarter sheet pan with your fingers instead of rolling). Cut into rectangles approximately 3 inches by 2 inches. Transfer rectangles to the lined baking sheet. Using the tip of a slim chopstick or a fork, poke holes all over the dough, going halfway but not all the way through. Place baking sheet in freezer until dough is frozen, at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 500 degrees. If using baking soda for the coating, combine it in a small pot with 2 cups water and bring to a boil over high heat, stirring to dissolve. Let cool completely. Dip each cookie into the solution, letting the excess drip off, then place it back on the baking sheet. If using an egg white, whisk it with 1 tablespoon water until frothy, then brush it on top of cookies. Sprinkle the coated cookies evenly with flaky sea salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer baking pan to oven and immediately lower the temperature to 350 degrees. Bake until deep golden brown, 18 to 23 minutes. Transfer baking sheet to a wire rack to cool completely before removing cookies, then store them in an airtight container."}]}