{"@context": "http://schema.org", "@type": "Recipe", "name": "Olive Oil Bundt Cake With Beet Swirl", "description": "Sweet roasted beets and extra-virgin olive oil add earthiness to this delicate Bundt cake, a baking project that promises stunning results. Roasting the beets beforehand concentrates their sweetness, and stacking thick layers of batter — one flavored with olive oil, the other with beets — creates bold swoops of red within the baked cake. Allow the cake to cool completely before slicing to avoid blurring the lines. Because of its lightly sweet notes, this cake is equally at home at breakfast or brunch, as a snack or dessert. To dress it up further, serve with lightly sweetened whipped cream or crème fraîche.", "author": {"@type": "Person", "name": "Jerrelle Guy"}, "image": "https://static01.nyt.com/images/2019/04/11/dining/jg-beet-cake/merlin_153033708_8321aaec-cb9a-484a-ab8a-9f855223e5b6-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "beets, lemon juice, lemon zest, olive oil, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 141}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 398, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "5 grams", "sodiumContent": "327 milligrams", "sugarContent": "29 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 pounds/570 grams raw beets, trimmed, peeled and cut into bite-size pieces", "1 1/2 cups/360 milliliters extra-virgin olive oil plus 2 tablespoons, and more for greasing", "1 1/2 teaspoons kosher salt", "3 1/2 cups/450 grams all-purpose flour, plus more for dusting", "1 cup/240 milliliters whole milk", "1 tablespoon lemon zest plus 1/2 cup/120 milliliters fresh lemon juice (from 3 or 4 lemons)", "5 eggs, beaten", "1 1/2 cups/300 grams granulated sugar", "1 tablespoon baking powder", "1/4 teaspoon baking soda", "Confectioners’ sugar, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Line a rimmed baking sheet with parchment paper. On the baking sheet, toss the beets with the 2 tablespoons oil and 1/2 teaspoon salt until coated. Roast until fork-tender, tossing halfway through, 30 to 40 minutes. Let beets cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cooled, transfer beets to a food processor and pulse until puréed, scraping down the sides of the bowl as needed. Transfer to a medium bowl. Lower the oven temperature to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease the inside of a 10-inch Bundt pan with oil, dust with flour, then invert the pan over the sink and tap it gently to discard excess flour. Set aside. In another medium bowl, combine the milk, lemon zest and juice and let sit until curdled, 1 or 2 minutes. Whisk in the eggs, then whisk in the remaining 1 1/2 cups oil and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift the 3 1/2 cups flour with the granulated sugar, baking powder, baking soda and the remaining 1 teaspoon salt into a large bowl and whisk to blend. Make a well in the center and pour in the wet ingredients, continuing to whisk, beginning in the middle and moving outward, until just combined. Transfer 2 cups of the batter to the bowl with the cooled beet purée and gently fold it in until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour about half of the plain batter into the base of the prepared Bundt pan. Next, pour half the beet batter on top, followed by half the remaining plain batter. Top with another layer of the remaining beet batter, then a final layer of the remaining plain batter. Bake until a toothpick inserted into the center comes out clean, 50 to 60 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cake from the oven, release it from the edges of the pan using a butter knife, and allow it to cool, 5 minutes. Carefully invert the cake onto a serving tray to cool completely. (The cake’s swirls come out more clearly if you let the cake rest for a few hours, or ideally, overnight.) Dust with confectioners’ sugar before serving."}]}