{"@context": "http://schema.org", "@type": "Recipe", "name": "Any Vegetable Soup", "description": "When it comes to stocking the pantry with root vegetables, most people stop with potatoes (regular and sweet), carrots, onions and garlic. And those are excellent to have on hand. But there are loads of other, more neglected roots, like rutabagas, turnips, radishes and celery root, worth having on hand. All root vegetables will keep for months in a cool, dark place, and they come in very handy, whether you want to roast up a bunch with olive oil and spices, or you want to make them into soup. This soup may not be the most beautiful of dishes, but it's hearty and nourishing, and highly adaptable, easily made with just about any root vegetables you have on hand.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/03/25/dining/23mc-pantryrex2/merlin_170847768_788f24dd-b061-491a-b0c0-9072a4111be4-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, soups and stews, vegetables", "keywords": "celery, greens, onion, root vegetables, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 148}, "recipeIngredient": ["4 tablespoons butter or olive oil", "1 large onion, 3 shallots or 2 leeks, white and light green parts only, chopped", "2 celery stalks, diced", "3 garlic cloves, chopped", "3 rosemary, thyme or sage sprigs (optional)", "2 bay leaves", "3 pounds mixed root vegetables (any combination of potato, sweet potato, turnip, rutabaga, parsnip, carrot, celery root, fennel bulbs), peeled and cut into 1-inch chunks", "2 quarts water or stock, more as needed", "Fine sea salt, to taste", "1 quart fresh greens (kale, spinach, mustard, Swiss chard), or 1 (10-ounce) package frozen greens, thawed", "Juice of 1/2 lemon, plus more to taste", "Red-pepper flakes or other chile flakes (optional)", "Grated Parmesan or pecorino (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter or heat oil in a large, heavy-bottomed pot over medium-high. Stir in onion and celery. Cook, stirring occasionally, until vegetables are tender, about 10 minutes. Stir in garlic, herb sprigs, if using, and bay leaves; cook 1 minute more. Add root vegetables, water or stock and 1 teaspoon salt. Bring to a boil; reduce heat to medium and simmer, covered, until vegetables are tender, 30 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove, and discard herb sprigs, if using, and bay leaves. Add greens and simmer until they are tender, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an immersion or regular blender, purée soup until smooth. If the soup is too thick, add a little water. Season with lemon juice and more salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle soup into bowls and top with a drizzle of olive oil, a few drops of lemon juice, flaky salt and red-pepper flakes or grated cheese, if desired."}], "link": "https://cooking.nytimes.com/recipes/1020950-any-vegetable-soup"}