{"@context": "http://schema.org", "@type": "Recipe", "name": "Swiss Rösti With Smoked Salmon and Poached Egg", "description": "In Switzerland, rösti (pronounced roosh-ti) is considered a national dish, though it is most popular in the German-speaking regions of the country. Made from grated potatoes, it resembles American hash browns, fried in a skillet like a thick potato pancake and cut into wedges. Rösti is often enhanced with ham, bacon or cheese or served with sausages. This posh version is garnished with smoked salmon, sour cream and a poached egg, perfect for a weekend breakfast. For best results, boil the potatoes one day (or at least several hours) in advance and chill. Cook them until just done and still firm — check with a skewer or paring knife — or they will be impossible to grate.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/04/10/dining/05kitchen-rosti1/05kitchen-rosti1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, vegetables", "keywords": "egg, potato, salmon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 69}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 323, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "4 grams", "proteinContent": "15 grams", "saturatedFatContent": "8 grams", "sodiumContent": "621 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds yellow-fleshed potatoes, parboiled, peeled and chilled", "Salt and pepper", "2 tablespoons clarified butter, duck fat or vegetable oil, plus more as needed", "4 to 6 eggs, at room temperature", "6 slices smoked salmon (about 8 ounces)", "1 cup crème fraîche or sour cream", "Snipped chives, for garnish", "Watercress, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the large holes of a box grater, shred the parboiled potatoes onto a baking sheet. (Try not to mash them.) Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a 9-inch cast-iron or nonstick skillet over medium-high heat and add 2 tablespoons butter. When butter is hot, use a spatula to transfer all the grated potatoes to the skillet. Let the potatoes begin to brown, then turn heat to medium. Press down lightly with spatula to form a thick cake. Let cake fry gently until bottom is golden brown and crisp, about 10 to 15 minutes. Shake the pan to be sure the cake isn’t sticking; loosen with a spatula if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay a plate over the uncooked side of the cake and carefully invert the cake onto the plate, crisp-side up. Return the skillet to the stove, add a little more butter to the pan as necessary and slip the cake back in, uncooked-side down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry gently for another 10 to 15 minutes, until crisp on the second side. Remove from heat and slide the cake (or invert) onto a plate or cutting board. Sprinkle lightly with salt and pepper. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Poach the eggs: Fill a wide skillet halfway with water. Add a good pinch of salt and bring to a gentle simmer. Break each egg into a teacup, then carefully slip it beneath the water’s surface. Cook for 2 minutes, until eggs are barely set, then turn off heat. (Leave eggs in hot water to finish cooking as you prepare the plates.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the rösti into wedges and divide among plates. Drape a slice of smoked salmon next to each wedge. Remove eggs one by one with a slotted spoon (holding a towel beneath spoon to catch excess water), and place on the other side of each wedge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top each wedge with a dollop of crème fraîche. Garnish with a sprinkle of chives and a sprig of watercress."}], "link": "https://cooking.nytimes.com/recipes/1020081-swiss-rosti-with-smoked-salmon-and-poached-egg"}