{"@context": "http://schema.org", "@type": "Recipe", "name": "Ginger Mango Cream Tart", "description": "Festive enough for a holiday party or a summer cookout, this bright and creamy mango tart has a crisp gingersnap crust and is topped with candied ginger, pistachios and toasted coconut. The no-bake crust, which is made from store bought gingersnaps, butter and light brown sugar, comes together in the food processor with the press of a button. For the filling, fresh or frozen mango is cooked with ginger and turmeric to deepen its flavor and brighten the color of the finished dessert.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2019/11/22/dining/em-mango-cake/merlin_164331360_bff22aaf-98ac-4db9-96ce-9c8b6c938bec-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "One 9-inch cake (8 to 10 servings)", "recipeCuisine": "american", "recipeCategory": "cakes, pies and tarts", "keywords": "confectioners' sugar, cream cheese, gelatin, ginger, mango, pistachio, turmeric, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 156}, "recipeIngredient": ["12 ounces/340 grams gingersnap cookies, about 48 (2-inch) cookies", "1/2 cup/115 grams unsalted butter (1 stick), melted", "1/4 cup/55 grams light brown sugar", "Pinch of fine sea salt", "16 ounces/455 grams cubed fresh mango (or thawed, frozen mango)", "1/2 cup/100 grams granulated sugar", "1 1/2 teaspoons ground ginger", "3/4 teaspoon ground turmeric", "1/2 teaspoon fine sea salt", "1 1/2 teaspoons powdered gelatin", "16 ounces/455 grams cream cheese, at room temperature", "3/4 cup/90 grams confectioners’ sugar", "1/2 cup/120 milliliters heavy cream", "Sliced candied ginger, chopped pistachios, toasted coconut, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the crust: Add the gingersnaps to a food processor, roughly breaking them as you go, then pulse them into fine crumbs. (You should have about 2 1/4 cups). Add the melted butter, light brown sugar and salt to combine. Transfer the mixture to a 9-inch springform pan, then press it evenly into the base and halfway up the sides of the pan. Freeze while you make the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: In a medium saucepan, heat the mango, sugar, ginger, turmeric and salt over medium heat, stirring occasionally, until the mango is very soft and starts to break down, 8 to 12 minutes. Cool for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 3 tablespoons cool water in a small microwave-safe bowl. Sprinkle the gelatin over the water and let bloom for 5 minutes. Microwave until fluid, 15 to 30 seconds. (Alternatively, the bowl of gelatin can be placed over a small pot of simmering water until melted.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the bowl of the food processor, add the mango mixture and pulse until mostly smooth. Add the cream cheese and confectioners’ sugar and pulse until combined and smooth. Scrape the bowl well, then pulse again to combine. Add the cream and process for 1 minute. Finally, add the melted gelatin and pulse briefly to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mixture to the chilled crust and gently spread into an even layer. Wrap the pan in plastic wrap, transfer to the refrigerator, and chill for 12 hours (or up to 24 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently run a small offset spatula or thin knife around the outer edge of the cake to loosen the crust, then release the outer ring. Run a large thin knife between the springform base and the bottom of the cake and use a large spatula to gently transfer the cake to a serving platter. (Alternatively, you can keep the cake on the base and transfer them together to a serving platter.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using any of the garnishes, sprinkle them around the outside edge just before slicing and serving."}], "link": "https://cooking.nytimes.com/recipes/1020663-ginger-mango-cream-tart"}