{"@context": "http://schema.org", "@type": "Recipe", "name": "Pozole With Duck and Mezcal", "description": "The giant white hominy used to make pozole are a blank canvas. The hominy — soaked, then simmered using a quick-boil shortcut that skips the need for overnight soaking — welcome chiles and a good dose of cumin. This pozole includes prepared duck confit instead of the more usual pork or chicken. Some diced fresh pineapple in the thick stew balances the spicy heat. A small glass of mezcal is a fine partner, especially as a finishing touch. Save a little of the drink for when you and guests are almost finished eating, to pour into the bowl for the last soupy spoonfuls. It’s what the French do in Gascony with their red wine when they enjoy a soup called garbure.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2020/01/29/dining/23pairrex/merlin_167526912_7593a1f5-b40f-49e7-9699-baccf26137c6-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "chicken stock, duck confit legs, mezcal, pineapple, white hominy, main course", "aggregateRating": null, "recipeIngredient": ["1 cup dry white hominy (mote pelado)", "2 tablespoons duck fat or extra virgin olive oil", "1 large white onion, slivered", "1 green bell pepper, cored, seeded and slivered", "1 fresh poblano, cored, seeded and slivered", "1 leek, white part only, finely chopped", "1 jalapeño, cored, seeded and minced", "1 teaspoon ground cumin", "1/4 teaspoon chipotle powder or smoked paprika", "1/8 teaspoon cayenne, or more, to taste", "1/4 whole fresh pineapple, peeled, cored and diced", "2 duck confit legs and thighs, boned and slivered", "4 cups chicken stock", "1 tablespoon tomato paste", "Salt", "Red-pepper flakes, to taste", "2 teaspoons lime juice", "3 scallions, minced", "1 tablespoon minced cilantro leaves", "6 ounces mezcal, or to taste, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place hominy in a saucepan, add 4 cups water, bring to a boil and cook for 2 minutes. Set aside, covered, for 1 hour. Then simmer about 2 hours, partly covered, until starting to soften, adding more water if needed to keep kernels covered. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat duck fat or oil in a large sauté pan. Add the onion, bell pepper, poblano, leek and jalapeño. Cook on medium low until vegetables are soft and the onion barely starts to color, 5 to 6 minutes. Stir in the cumin, chipotle powder and cayenne. Cook for a minute, then add the pineapple and duck. Drain the hominy and add it. Add the chicken stock and tomato paste. Bring to a simmer, cover and cook on low about 1 1/2 hours, until the hominy has softened, is starting to look translucent and some of the kernels are popping open."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season with salt and red-pepper flakes to taste. Add the lime juice. Fold in the scallions and cilantro. Divide the mezcal among 4 small glasses and serve alongside, if desired, to sip with the pozole. As guests have nearly finished their pozole suggest they pour some of the mezcal into their bowls for the last few spoonfuls."}]}