{"@context": "http://schema.org", "@type": "Recipe", "name": "Garlic Knots", "description": "Garlic knots are a beloved classic pizzeria snack that can easily be recreated at home. Start with premade dough from the supermarket or buy it straight from your neighborhood pizza joint. For best results, the dough needs to rest — or “rise” — twice. The first resting period achieves a dough that is pliable and easy to roll out and shape. Once formed into knots, the dough rests a second time, allowing it to relax after being stretched and shaped, resulting in a more tender and fluffier garlic knot. But it’s the garlic butter that’s the star here. Cook the garlic slow and low, since frying it too fast will make it bitter, then toss it with the knots. For a cheesy twist, sprinkle some grated Parmesan over the glossy rolls.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2019/03/19/dining/kc-garlic-knots/kc-garlic-knots-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "12 servings", "recipeCuisine": "american", "recipeCategory": "finger foods", "keywords": "appetizer, garlic, marinara sauce, parmesan, parsley, pizza dough", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 57}, "recipeIngredient": ["1 pound prepared pizza dough, thawed if frozen", "All-purpose flour, for dusting", "4 tablespoons unsalted butter", "2 tablespoons extra-virgin olive oil", "2 tablespoons minced garlic", "1 tablespoon finely chopped parsley", "Kosher salt", "Parmesan, for finishing (optional)", "Warmed marinara sauce, for dipping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough into 2 equal pieces and arrange on a parchment-lined baking sheet a few inches apart. Cover loosely with plastic wrap and let stand at room temperature until softened and pliable, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one piece at a time, use a lightly floured rolling pin to roll dough into a 6-inch square on a lightly floured surface. Cut into six 1-inch strips. Roll one strip to form a rope about 8 inches long, then tie into a single knot. Transfer to the parchment-lined baking sheet. Repeat with remaining strips and second piece of dough, arranging the knots a few inches apart on the baking sheet. Cover loosely with plastic wrap and let stand until puffed and doubled in size, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Bake knots until golden on bottom, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small saucepan, cook butter and oil over low heat until butter melts. Add garlic and cook, stirring occasionally, until softened and very fragrant, about 5 minutes. Scrape butter mixture into a large bowl, then stir in parsley and season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In batches, toss the warm knots in the garlic butter until well coated. Sprinkle with Parmesan, if desired, and serve with marinara sauce."}], "link": "https://cooking.nytimes.com/recipes/1020114-garlic-knots"}