{"@context": "http://schema.org", "@type": "Recipe", "name": "Shortcut Pie Crust", "description": "This recipe and method make a distinctly tender, crisp crust. Unlike rolling, which can toughen pastry by developing the gluten in the dough, grating breaks — or shortens — the protein chains, which leads to extra tenderness. Pressing the grated pastry directly into the pie plate makes patisserie-thin crusts achievable, without much practice. It’s key to thoroughly chill the dough before grating and to pull it up higher than the rim of the dish to allow for shrinkage. Swap this recipe in as the base of any sweet pie, adjusting the thickness accordingly. Deeper pies made in dishes without removable bases benefit from slightly thicker crusts, whereas fluted tart crusts are best whisper thin. Make double the dough and freeze half, so you have an excuse to make pie another day.", "author": {"@type": "Person", "name": "Clare de Boer"}, "image": "https://static01.nyt.com/images/2019/11/20/dining/15pierex4/15pierex4-articleLarge.jpg", "totalTime": "PT3H50M", "recipeYield": "One 8- to 11-inch pie or tart crust", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "butter, confectioners' sugar, egg, flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 271}, "recipeIngredient": ["1 1/2 cups/190 grams all-purpose flour", "1/2 cup/60 grams confectioners’ sugar, passed through a sieve", "1/4 teaspoon kosher salt", "9 tablespoons/130 grams cold unsalted butter, cut into cubes", "2 large egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the flour, confectioners’ sugar and salt in the bowl of a food processor. Add the cubed butter and blitz until the flour mixture has a sandy texture with some pea-size butter bits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the egg yolks and blitz then pulse just until the pastry begins to come together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tip the pastry out onto a rectangle of plastic wrap. Using your hands, form it into a 6-inch log. Wrap in plastic wrap and chill, at least 3 hours or up to 3 days, or wrap and freeze for up to 3 months. If using frozen dough, allow to soften slightly in the fridge for an hour before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the large holes on a box grater, grate 3/4 of the chilled pastry directly into your pie dish or tart pan. Working quickly by hand, press the grated pastry into the dish, starting with the sides then covering the bottom, grating more of the chilled pastry into the dish as needed to cover evenly. Pay attention to the seam between the sides and the base, making sure it is the same thickness as the rest of the pastry: The crust should form an even layer that is about 1/4-inch thick. (Save any leftover pastry for another use.) Chill, at least 30 minutes or up to 2 days. (This can be done ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The crust can take various routes from here; refer to whichever pie or tart recipe you're using for guidance. If blind-baking this crust, it cooks best at 350 degrees."}]}