{"@context": "http://schema.org", "@type": "Recipe", "name": "Giant Cinnamon Roll Scone", "description": "Just when you thought the world couldn’t improve upon cinnamon rolls, this dreamy mashup comes along. Adapted from “</span><a href=\"https://www.amazon.com/Procrastibaking-Recipes-Getting-Delicious-Possible/dp/1982117745\">Procrastibaking</a>: 100 Recipes for Getting Nothing Done in the Most Delicious Way Possible<span>” (Atria, 2020) by Erin Gardner, they are actually quite easy to put together: Toss together a basic scone dough, then roll it out, spread it with a sweet cinnamon-butter filling, cut it into strips, roll it up, score and bake. Once cooled, drizzle the roll with a simple vanilla sugar icing, gently break into wedges and serve to the delight of your loved ones.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2020/04/22/dining/20cookbookrex2/merlin_171347805_6050844c-6839-42f5-8a5d-02606faa79b6-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 scones", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, snack, dessert", "keywords": "butter, confectioners' sugar, flour, heavy cream, scone, sugar, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1658}, "recipeIngredient": ["2 1/4 cups/285 grams all-purpose flour, plus more for dusting", "1/3 cup/65 grams granulated sugar", "1 tablespoon baking powder", "1/2 teaspoon kosher salt", "3/4 cup/170 grams cold unsalted butter (1 1/2 sticks), cubed", "1/2 cup/120 milliliters heavy cream, plus more as needed", "1 teaspoon pure vanilla extract", "3 tablespoons unsalted butter, melted", "1/4 cup/55 grams dark brown sugar", "2 teaspoons ground cinnamon", "1 cup/125 grams confectioners’ sugar", "1 teaspoon pure vanilla extract", "2 to 3 tablespoons whole milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with parchment paper or a silicone baking mat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: In a large bowl, whisk together the flour, granulated sugar, baking powder and salt. Add the cubed butter, then pinch and press the butter into the flour until the mixture resembles coarse sand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a well in the center of the sandy mixture and add the heavy cream and vanilla. Toss and fold until it comes together to form a loose dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust your work surface with flour and turn the dough out onto it. Gently knead the dough two or three times to bring it together. Use your hands to press the dough into a 5-by-14-inch rectangle with a long side facing you. Imagine the dough divided vertically into three equal sections, like a standard sheet of paper folded to fit into an envelope. Carefully lift the section on the right and fold it over the center section. Lift the section on the left and fold it over the other two layers. When you look at your dough from the front, you should see three distinct layers. Turn the little dough package so that one of the folded edges is facing you."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use your hands to press the layered dough back down into a long rectangle similar in size to the first one you made, flouring your work surface and dough as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a small bowl, whisk together the melted butter, brown sugar and cinnamon. Drizzle the filling on top of the dough and spread it out using a spoon or silicone spatula to fully cover the top surface of the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the dough lengthwise into four equal strips. Pick up a strip and transfer it to the prepared baking sheet, filling-side up. Roll it up tightly, then stand it up on one of its flat sides in the center of the sheet. Pick up another strip, and wrap that strip, filling-side in, around the standing coil starting where the first coil left off. Repeat with the two remaining strips. Gently push the circle of coiled dough down to adhere the strips together and flatten the dough to about 9 inches in diameter. Cover and chill the dough for at least 30 minutes, or up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position a rack in the center of the oven and heat the oven to 350 degrees. Cut the chilled roll into 8 wedges, leaving the cut pieces together in a circle instead of pulling them apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, rotating the pan halfway through, until the scones have puffed and browned around the edges, 20 to 24 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the sheet to a rack to cool for 20 to 30 minutes before carefully moving the warm scones onto a cutting board or serving platter. (If you don’t let them cool first, they will fall apart when you try to move them.) Using a knife, gently slice to separate the 8 individual scones, but don’t pull them apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the glaze: In a small bowl or glass measuring cup, whisk together the confectioners’ sugar and vanilla with enough milk until the glaze is spreadable. Drizzle it over the scones and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1020986-giant-cinnamon-roll-scone"}