{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetarian Mushroom Shawarma Pitas", "description": "Dusted with smoky spices like cumin, coriander and paprika, these thick-cut roasted portobello mushrooms are inspired by shawarma, Middle Eastern spiced lamb — and they taste surprisingly meaty. The flavors are bold, but the prep is simple: While the mushrooms and onions roast, make an easy turmeric and Greek yogurt sauce, and toss sliced red cabbage with salt. Pile everything into a pita with a flurry of cilantro and mint to freshen things up (parsley or salad greens would also do the job in a pinch). While these hearty pitas are best enjoyed with a knife and fork as open-faced sandwiches, they can also be folded into half-moon parcels and eaten out of hand.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/06/13/dining/aw-large-mushroom-shawarma/aw-large-mushroom-shawarma-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "american, middle eastern", "recipeCategory": "dinner, lunch, weekday, sandwiches, vegetables", "keywords": "coriander, cumin, paprika, portobello, red cabbage, red onion, turmeric, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 934}, "recipeIngredient": ["3/4 pound portobello mushroom caps, sliced 1/2-inch thick", "1 medium red onion, halved and cut into 1/3-inch wedges", "3 tablespoons plus 2 teaspoons extra-virgin olive oil", "1 teaspoon ground cumin", "3/4 teaspoon ground coriander", "1/2 teaspoon ground sweet or smoked paprika (optional)", "Kosher salt and black pepper", "4 pitas", "2 packed cups very thinly sliced red cabbage (about 6 ounces)", "3/4 cup low-fat or whole-milk Greek yogurt", "3/4 teaspoon ground turmeric", "Cilantro or mint, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. On a large rimmed sheet pan, drizzle the mushrooms and red onion with 3 tablespoons oil. Sprinkle with cumin, coriander, paprika (if using), 1 teaspoon salt and 1/2 teaspoon pepper; toss to coat. Arrange in an even layer and roast until tender and browned, about 20 minutes. Add the pitas directly to the oven rack to warm during the last 5 minutes of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toss cabbage with remaining 2 teaspoons oil in a medium bowl; toss to coat. Season generously with salt and pepper. In a small bowl, stir together yogurt and turmeric; season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, slather yogurt over warm pitas. Top with cabbage, mushroom mixture and herbs, and serve immediately."}]}