{"@context": "http://schema.org", "@type": "Recipe", "name": "Easy Chicken Kapama", "description": "The traditional version of this Greek-inspired dish calls for a whole chicken to be broken down into parts, then braised in a fragrant, cinnamon-laced tomato sauce. This weeknight version instead calls for boneless, skinless chicken thighs, which are are much less work and less time-consuming to prepare. Like most braised dishes, this one tastes even better once the flavors have had a chance to mingle, so it’s an ideal make-ahead meal. Serve it over buttered egg noodles or orzo with a showering of grated Parmesan or Greek kefalotyri cheese.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/03/18/dining/ch-chicken-kapama/merlin_151075185_c69e2424-12dc-4f5c-90ba-3ab5c58bedc7-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "greek", "recipeCategory": "dinner, weekday, poultry", "keywords": "chicken thighs, cinnamon, cinnamon stick, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 385}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 414, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "4 grams", "proteinContent": "47 grams", "saturatedFatContent": "7 grams", "sodiumContent": "875 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds boneless, skinless chicken thighs", "Kosher salt and black pepper", "1 teaspoon ground cinnamon", "2 tablespoons unsalted butter", "1 tablespoon olive oil", "1 medium yellow onion, thinly sliced", "2 garlic cloves, thinly sliced", "2 tablespoons tomato paste", "1 (14-ounce) can crushed tomatoes", "1 to 2 cinnamon sticks", "Buttered egg noodles or orzo, for serving (optional)", "2 tablespoons fresh herbs, such as Italian parsley and oregano, roughly chopped (optional)", "Grated kefalotyri cheese or Parmesan, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken well on both sides with salt and pepper and sprinkle with the ground cinnamon. In a large skillet, heat butter and olive oil over medium. Working in batches to avoid overcrowding, cook the chicken until it begins to lightly brown in spots, 2 to 4 minutes per side. Set aside. (If it’s not cooked through at this point, that’s O.K.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion and the garlic to the skillet and cook until the onion begins to soften and the garlic is fragrant, 2 to 3 minutes. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the tomato paste, tomatoes, 1/4 cup water and the cinnamon stick(s). Add the chicken and any residual juices, stir to coat with the sauce and bring to a simmer. Turn heat to medium-low, cover and simmer until the chicken is cooked through and the flavors meld, stirring occasionally, 15 to 20 minutes. Add a few tablespoons water if needed to thin out the sauce. Taste and adjust seasonings to your liking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the chicken over buttered egg noodles or orzo, if using, spooning the tomato sauce on top. Top with the herbs and grated cheese, if using."}]}