{"@context": "http://schema.org", "@type": "Recipe", "name": "Peanut Butter", "description": "Peanut butter is an essential pantry item, and a perfect building block to pack protein into on-the-go snacks. Making your own from scratch means you control what goes into it (no sugar or hydrogenated oils, or excessive salt). Roasting the raw peanuts until deep golden is the key to achieving a flavorful result. If your raw peanuts have skins, leave them on; they add extra fiber, antioxidants and toasty flavor. A few pinches of ground cinnamon, or a couple tablespoonfuls of chia seeds, currants or honey can be added to provide crunch, warm spice or a touch of sweetness.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2019/04/09/dining/kc-peanut-butter/kc-peanut-butter-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "1 3/4 cups", "recipeCuisine": "", "recipeCategory": "dips and spreads", "keywords": "peanut, salt", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 248, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "4 grams", "proteinContent": "11 grams", "saturatedFatContent": "3 grams", "sodiumContent": "8 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 pound raw, skin-on peanuts (about 3 cups)", "Kosher salt (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Spread nuts in an even layer on a rimmed baking sheet. Bake until golden and nicely toasted, about 25 minutes, stirring halfway through. Transfer to a rack and cool completely, 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place nuts in a food processor and purée until smooth, about 8 minutes, scraping the sides and bottom of the bowl as needed (mixture may clump up, but will eventually become creamy). Season to taste with salt, if desired. Peanut butter will keep in an airtight container in the refrigerator for at least 3 weeks."}]}