{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Pot Zucchini-Basil Pasta", "description": "This no-colander-necessary, one-pot pasta method isn’t a gimmick: Cooking the noodles in just enough seasoned stock means they’re done in the same amount of time it takes the liquid to reduce into a concentrated, extra flavorful sauce. Mascarpone makes it silky, though crème fraîche or even softened cream cheese would be solid substitutes. While the pasta cooks, make a quick gremolata of chopped parsley, salted almonds and basil, which adds brightness and texture to the finished dish. Though this pasta comes together quickly, it requires more attention than some: Be sure to stir frequently so the noodles cook evenly, and add a splash of water toward the end of cooking, as needed, so they stay saucy.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/08/18/dining/18help/merlin_155854968_ca2b1cf5-1b9f-4efa-997d-970d0b775eb8-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, for two, lunch, quick, weekday, pastas, vegetables", "keywords": "almond, basil, garlic, mascarpone, parsley, pasta, zucchini, fall, summer, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 639}, "recipeIngredient": ["2 3/4 cups vegetable stock", "12 ounces medium pasta shells", "2 medium zucchini (about 14 ounces total), trimmed and cut into 1/2-inch cubes", "4 ounces mascarpone, crème fraîche or softened cream cheese", "1 large garlic clove, finely chopped", "1/3 packed cup thinly sliced basil", "Kosher salt and black pepper", "3 tablespoons chopped roasted salted almonds", "3 tablespoons chopped Italian parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, deep 12-inch skillet, bring stock to a boil over high heat. Once stock boils, stir in pasta, zucchini, mascarpone, garlic and half the basil; season generously with salt and pepper and reduce the heat to medium-high. Cook, stirring frequently, until pasta is tender and liquid is reduced until thickened and creamy, 12 to 13 minutes, adding a splash of water during the last few minutes of cooking if needed to moisten. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the gremolata: Chop almonds and parsley with remaining basil until finely chopped and combined; season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide pasta among shallow bowls. Sprinkle with gremolata and serve immediately."}]}