{"@context": "http://schema.org", "@type": "Recipe", "name": "Curry Chicken Breasts With Chickpeas and Spinach", "description": "This entire dish is built for flavor — and ease. An ideal ingredient for quick weeknight meals, chicken breasts can be pounded thin, so they’ll cook quickly and evenly. Here, the cutlets are dusted in flour to create a delicate, golden crust that seals in moisture, and flavored with Madras curry powder, an Indian spice blend featuring coriander, turmeric, chiles, cumin, fennel, garlic and ginger. Toasting it in oil brings out all its warmth and richness. The curried chickpeas make a wonderful side dish on their own, and would pair just as well with another meat or fish.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2019/08/14/dining/kc-chicken-and-chickpeas/merlin_158856195_c3accd56-908e-45f0-a13a-4a31378343b8-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weeknight, beans, poultry, vegetables", "keywords": "baby spinach, chicken breast, chickpea, cilantro, curry powder, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 282}, "recipeIngredient": ["1/4 cup all-purpose flour", "4 (6-ounce) boneless, skinless chicken breasts, pounded 1/2-inch thick", "Kosher salt and black pepper", "1/4 cup canola oil", "2 tablespoons Madras curry powder", "1 (15-ounce) can chickpeas, rinsed", "2 tablespoons unsalted butter", "1 tablespoon fresh lime juice, plus wedges for serving", "4 ounces baby spinach (about 4 packed cups)", "Chopped fresh cilantro (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place flour on a plate. Season chicken with salt and pepper, then lightly dredge in flour until coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonstick skillet, heat 1 tablespoon oil over medium. Add 2 chicken cutlets and cook until golden and cooked through, about 3 minutes per side. Transfer to plates. Repeat with 1 tablespoon oil and remaining cutlets, transferring cutlets to plates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 2 tablespoons oil to the skillet, then curry powder and chickpeas. Season with salt and pepper and cook over medium heat, stirring frequently, until chickpeas are golden and starting to pop, about 3 minutes. Add butter, lime juice and spinach and stir just until spinach starts to wilt, about 30 seconds. Spoon chickpea mixture over chicken and top with cilantro, if using. Serve with lime wedges."}], "link": "https://cooking.nytimes.com/recipes/1020309-curry-chicken-breasts-with-chickpeas-and-spinach"}