{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Tuna, Capers and Scallions", "description": "There are about a gazillion ways to cook pasta using other pantry staples — things like garlic, bread crumbs, pecorino, capers, olives and especially, canned fish. This recipe, pasta with tuna, anchovies and capers, showered with lots of green herbs and scallions, is one of my family’s household favorites. I like it with a long, thin, twirlable pasta — spaghetti, linguine or bucatini — but you can use whatever pasta you have on hand. Even macaroni works just fine and might even persuade your finicky kid to eat this dish (though, so far, mine abstains).", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/03/23/dining/23pantryrex5/merlin_170847792_732f9bad-0acb-4bee-8f1e-a5dac3ca3df4-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas", "keywords": "anchovies, capers, garlic, herbs, pasta, scallion, tuna, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 255}, "recipeIngredient": ["Salt", "12 ounces long, thin pasta, such as bucatini, spaghetti or linguine", "3 tablespoons extra-virgin olive oil", "3 garlic cloves, thinly sliced", "3 scallions, thinly sliced, white and green parts separated", "6 to 10 anchovies, chopped", "3 tablespoons drained capers", "1 cup torn fresh herbs, such as parsley and dill, or celery leaves, plus more for serving (optional)", "1 (5- or 6-ounce) can tuna, drained", "Red-pepper flakes, for serving", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a well-salted pot of boiling water, cook pasta according to package directions until al dente. Drain, saving 1 cup pasta water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat the oil over medium. Add garlic and scallion whites, and cook until fragrant, about 1 minute. Add anchovies and capers and cook until anchovies melt and capers and garlic turn golden, 2 to 3 minutes longer. Add 1/2 cup pasta water, let it reduce until there is just a little left in the pan, then add pasta and herbs and toss well to coat. Add tuna and toss well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with red-pepper flakes on top, more herbs, scallion greens, and a drizzle of olive oil. Serve with lemon wedges on the side for squeezing."}]}