{"@context": "http://schema.org", "@type": "Recipe", "name": "Feast of the Seven Fishes Pie", "description": "A velvety fish pie, filled with chunks of seafood in a delicate sauce, is classic cold-weather comfort food in the British Isles. This seafood pie is fancier than most. It’s got a buttery puff pastry topping that turns golden and crunchy as it bakes. And it’s brimming with seven varieties of fish, including scallops and shrimp, to make it festive enough to serve for a blowout Christmas Eve meal, like the Italian-American celebration Feast of the Seven Fishes. That said, if you’d rather keep things simpler, using just two or three kinds of fish still results in a stunning pie. Alaskan wild pollock, a mild, flaky fish that’s becoming more and more available in seafood markets, is a lovely and sustainable choice, as is Pacific cod.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/12/18/dining/13Apperex/merlin_165684945_becc0a2e-826a-4cd3-a618-3e5486964200-articleLarge.jpg", "totalTime": "PT1H50M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "anchovies, clam juice, dry white wine, leek, puff pastry, sea scallop, shrimp, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 574}, "recipeIngredient": ["6 tablespoons unsalted butter", "2 large leeks, white and light green parts only, halved and thinly sliced (4 cups)", "2 teaspoons kosher salt", "1 garlic clove, minced", "2 anchovies, minced", "1/2 cup dry white wine or dry vermouth", "1/4 cup all-purpose flour, more for rolling out pastry", "3/4 cup chicken stock", "1/2 cup clam juice", "1 pound mixed mild fish fillets, cut into 1 1/4-inch thick cubes (such as cod and pollock)", "1/2 pound large shelled shrimp (16 to 20 count)", "1/2 pound large sea scallops, side muscle removed", "1 cup frozen peas", "1 tablespoon chopped tarragon", "1 tablespoon chopped parsley", "2 tablespoons drained capers, chopped", "1 large egg", "1 pound puff pastry, thawed", "1 cup sour cream, for serving (optional)", "1 ounce salmon or trout roe or other caviar (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a shallow 1 1/2-quart baking dish or casserole. Melt 2 tablespoons butter in a large skillet over medium-high heat, then stir in leeks and 1 teaspoon salt, and cook until soft, stirring frequently, 5 to 7 minutes. Stir in garlic and anchovies and cook 1 minute, until the anchovies dissolve. Add wine and bring to a boil, then let simmer until the wine evaporates almost completely. Remove from heat and scrape into a heatproof bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, melt remaining 4 tablespoons butter over medium heat. Whisk in flour and cook until pale golden, 1 to 3 minutes. Slowly whisk in chicken stock and clam juice, and bring to a simmer, whisking constantly. Simmer for 1 to 3 minutes until very thick (it will thin out as it bakes), then remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the fish cubes, shrimp and scallops dry. Stir them into the sauce along with the sautéed leeks, peas, tarragon, parsley, capers and remaining 1 teaspoon salt. Spoon mixture into prepared dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill uncovered, for at least 1 hour, and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before baking, heat oven to 425 degrees. In a small bowl, whisk together egg with 1 teaspoon water. On a lightly floured surface, unroll pastry dough. Roll it 1/8-inch thick. Use a fish cutter or paring knife to cut out a fish from the center of dough. (Alternatively, you can cut circles from the dough and overlap them on top of the pie to look like fish scales)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pastry on top of pie and trim edges, but don’t seal them (sealing impinges on the puffing). Brush egg wash all over pastry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pie on a rimmed baking sheet and bake until crust is golden, 30 to 40 minutes. Remove from oven and let cool for 5 to 10 minutes before serving. If you like, spoon the sour cream into a shallow dish, top it with the trout roe and serve it on the side for guests to add to the pie. Or spoon the caviar into the fish cutout on top of the pie and serve sour cream on the side."}]}