{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Goat Leg in Obe Ata", "description": "Obe ata is my versatile, back-pocket Nigerian recipe. A bright purée of red bell peppers, onions, tomatoes and habaneros, this stew is the base of several dishes, such as <a href=\"https://cooking.nytimes.com/recipes/1020288-jollof-rice\">jollof rice</a> and <a href=\"https://cooking.nytimes.com/recipes/1020297-e-fo-riro-stewed-amaranth-greens-with-smoked-mackerel\">stewed amaranth greens</a>, and accompanies starchy mains as a sauce. This tangy recipe, enhanced by the lingering heat of habanero chiles, uses goat, but you can substitute lamb, beef or pork cuts of a similar size. Any large bone-in cut of meat will do, and will be coaxed into tenderness after a slow braise. The best way to serve this is right in the pot or on a large platter for guests to share, garnished with a mess of fresh herbs and citrus zest and served alongside steamed rice, jollof rice, <a href=\"https://cooking.nytimes.com/recipes/1020283-dodo-fried-plantains-with-quick-pickled-onions\">fried plantains</a> or <a href=\"https://cooking.nytimes.com/recipes/1020286\">crispy yam fries</a>.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2019/06/26/dining/24Nigerianrex4/merlin_156696663_fe8c024d-6871-46b0-b732-333ee978a62e-articleLarge.jpg", "totalTime": "PT6H", "recipeYield": "8 to 10 servings", "recipeCuisine": "african", "recipeCategory": "dinner, meat, soups and stews", "keywords": "beef stock, canned tomatoes, carrot, goat leg, thyme, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 64}, "recipeIngredient": ["2 tablespoons canola oil, plus more as needed", "1 (4- to 5-pound) bone-in goat leg, cut in half or thirds to fit your pot (or use similarly sized lamb, beef or pork cuts)", "Kosher salt", "1 garlic bulb, halved crosswise", "3 large carrots, scrubbed, trimmed and cut into 2-inch pieces", "2 large red onions, peeled and chopped into large dice", "1 (14-ounce) can whole peeled tomatoes with their juices", "10 fresh thyme sprigs", "2 fresh bay leaves", "1 red habanero chile, stemmed", "4 cups beef or chicken stock", "1 (28-ounce) can whole peeled tomatoes with their juices", "2 medium red bell peppers, stemmed, seeded and roughly chopped", "1 medium red onion, peeled and roughly chopped", "8 garlic cloves, peeled", "1 (2-inch) piece fresh ginger, peeled and finely chopped", "2 red habanero chiles, stemmed", "1/4 cup canola or other neutral oil", "1 lemon, zest removed in strips, then julienned lengthwise", "1/4 cup fresh cilantro leaves and tender stems", "1/4 cup fresh parsley leaves and tender stems", "1/4 cup torn fresh mint leaves", "1/4 cup sliced scallions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons canola oil in a large Dutch oven or heavy-bottomed, ovenproof pot over medium-high. Season the goat leg generously all over with salt, then sear, turning frequently, until browned, 10 to 20 minutes, depending on how many pieces. Transfer to a large bowl using tongs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Sear the garlic bulb halves in the rendered fat, cut-side down, until golden brown, 1 to 2 minutes. Transfer to the bowl with the goat. Cook the carrots and onions with a pinch of salt, stirring occasionally, until vegetables are just beginning to soften and brown at the edges, about 8 minutes. Add the tomatoes and their juices, tearing the whole tomatoes into large chunks with your hands as you add them. Add the thyme, bay leaves and habanero."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the stock and bring to a simmer over medium-high. Return the goat and garlic to the Dutch oven, cover and transfer to the oven. Braise until meat is tender but doesn’t fall apart, 2 1/2 to 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the obe ata: Combine all the obe ata ingredients except the oil in a blender and purée on high until smooth, working in batches, if needed. The liquid from the can of tomatoes should suffice, but you can add up to 1/4 cup of water if necessary to get the purée going. (You should have about 6 cups of purée.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the 1/4 cup canola oil in a large pot over medium-high. Add the purée and bring to a simmer. Reduce heat to medium, cover and simmer until the sauce is slightly reduced by about a third of its original volume, 40 to 45 minutes. (You should have about 4 cups of obe ata. It can be cooled and stored refrigerated for up to 2 weeks, or stored frozen for up to a month.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the Dutch oven from the oven and increase the oven temperature to 375 degrees. Transfer the goat to a large bowl using tongs. Strain the broth, discarding the solids, and return the broth to the Dutch oven. (You should have 2 to 3 cups.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the obe ata to the Dutch oven and bring the sauce up to a simmer over medium-high. Cook, stirring occasionally, until flavors meld and sauce thickens slightly, about 20 minutes. Season with salt and place the goat leg back in, ladling sauce over the top of the goat if it is not completely submerged. Cover with lid and return to the oven. Braise until the goat is tender enough to pull with a fork and just beginning to fall off the bone, about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place the goat in a deep serving platter with the meat on the bone, or off the bone in large chunks with the obe ata spooned generously over the meat. Scatter the top with the lemon zest, fresh herbs and scallions."}]}