{"@context": "http://schema.org", "@type": "Recipe", "name": "Stamped Citrus Shortbread", "description": "Use cast-iron cookie stamps to leave imprints on this beautifully textured shortbread, which is flavored with tangy orange and lemon zests. The stamps, which are available online, are a fun way to shape and decorate cookies without much effort. (Don’t be afraid to be generous with the flour, on the cookie balls and on the stamps themselves, shaking off excess so you still get a clean imprint.) But if you don’t have stamps, you can roll and cut the dough using a simply shaped cutter, or roll the dough into a log for slice-and-bake cookies.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/11/27/dining/ss-citrus-shortbread/merlin_163736658_f0f3dcf3-5a89-4439-9ba7-5f788ed22be1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "About 2 dozen cookies", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars", "keywords": "butter, confectioners' sugar, flour, lemon, orange, vanilla, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 403}, "recipeIngredient": ["2 cups/255 grams all-purpose flour, plus more as needed", "1/3 cup/45 grams cornstarch", "1/2 teaspoon kosher salt", "1 cup/225 grams unsalted butter (2 sticks), softened", "1/2 cup/100 grams granulated sugar", "1 orange (preferably tangelo)", "1 lemon", "1/2 teaspoon vanilla extract", "1/2 teaspoon lemon extract", "3/4 cup/75 grams sifted confectioners’ sugar", "1 tablespoon melted butter", "1 tablespoon fresh orange juice, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cookies: Add flour, cornstarch and salt to a medium bowl, and whisk to combine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine butter and granulated sugar in the bowl of a stand mixer fitted with the paddle attachment. Zest half the orange and half the lemon directly into the bowl. Reserve the lemon and orange for the glaze. Cream the butter mixture on medium-high speed until light and fluffy, 2 to 3 minutes. Add vanilla and lemon extracts and beat on medium speed until well combined, scraping the bowl a few times as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour mixture to the butter mixture and beat on low speed just until combined. Scrape the bowl and fold a few times to make sure everything is well combined. Wrap dough in plastic wrap, flatten into a disk, and chill until firm, at least 1 hour, and up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Cut dough in half and let one piece warm up for 30 minutes if it has chilled longer than an hour. Return the other half to the refrigerator. Portion the dough into pieces roughly the size of walnuts (a scant 2 tablespoons/about 35 grams), then roll each piece into a ball between your hands. One at a time, dip a ball of dough into flour and set on work surface. If dough balls soften too much, return them to the refrigerator to firm up for a few minutes. You want it cool, but malleable. Dip cookie stamp in flour, and press down on the ball of dough until it is about 1/4-inch thick. Remove stamp. (If dough sticks to stamp, carefully peel it off. Don’t worry about excess flour as you will brush it off after chilling.) Trim the edges using a 2-inch cookie cutter, and transfer dough rounds to 2 parchment- or silicone mat-lined baking sheets, arranging them about 1 1/2 inches apart. Repeat with remaining dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once you have stamped out all the cookies, knead together the scraps to make a few more. Chill in the freezer until very firm, about 10 minutes. When cold, brush off any excess flour with a dry pastry brush."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until cookies just start to turn golden underneath, 12 to 14 minutes, switching the baking sheets from front to back and top to bottom halfway through baking time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the glaze while the cookies bake: Zest the remaining skin from the reserved lemon and orange into a small bowl. Add the confectioners’ sugar, butter and orange juice and whisk until smooth. If glaze is too thick, add more orange juice. If it is too thin, add more confectioners’ sugar. It should be the consistency of thin custard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the cookies cool for a few minutes on the baking sheets, and transfer to a wire rack set over a parchment- or wax paper-lined baking sheet. Pick up a cookie, and using the back of a small spoon, spread a generous teaspoon of glaze on a cookie, letting any excess drip onto the next cookie. Repeat until all the cookies are glazed. Cool completely. Cookies will keep in an airtight container at room temperature for up to 1 week."}]}