{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn Casserole", "description": "Here is a from-scratch version of the classic corn casserole, a popular holiday side dish in the southeastern United States that is traditionally made using store-bought Jiffy cornbread mix. If you’ve never had corn casserole before, you’re really missing out: It’s like an incredibly moist cornbread studded with fresh corn kernels. (Frozen corn can be used in the cold weather months.) Two pounds of corn kernels are bound together with a simple batter of flour, baking powder, cornmeal, Cheddar, eggs, melted butter and sour cream, then poured into a baking pan, topped with more cheese, and baked until bubbly. Fresh rosemary and scallions, untraditional and optional additions, add savory notes that balance out the sweetness of the corn.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/10/22/dining/as-corn-casserole/as-corn-casserole-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "cheddar, corn, cornmeal, eggs, rosemary, scallion, sour cream", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 555}, "recipeIngredient": ["6 tablespoons unsalted butter", "2 pounds frozen or fresh corn kernels (about 6 1/2 cups)", "4 scallions, thinly sliced crosswise (optional)", "1 fresh rosemary sprig (optional)", "Kosher salt and black pepper", "1/2 cup all-purpose flour", "1/2 cup fine or coarse yellow cornmeal", "2 teaspoons baking powder", "1 cup sour cream", "2 large eggs", "1 1/2 cups freshly grated Cheddar or Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Add 4 tablespoons butter to a 9-by-13-inch pan or other 3-quart casserole dish and transfer to the oven. Once the butter has melted, about 5 minutes, take the pan out of the oven and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot, melt the remaining 2 tablespoons butter over medium-high. Add the corn, scallions and rosemary, if using, 1 teaspoon salt and several grinds of black pepper, and cook, stirring occasionally, until the corn starts to give off some liquid and softens, about 5 minutes. Remove from heat and discard the rosemary sprig."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the flour, cornmeal, baking powder and 1 teaspoon salt into the corn mixture. Tilt the baking pan so that the bottom gets coated in the melted butter, then pour the excess butter (do not scrape the dish) into the pot with the corn mixture. Stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the sour cream and eggs with a fork until combined. Add to the corn mixture along with 1/2 cup grated cheese and stir just until combined, taking care not to overmix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the pan, spread evenly, then sprinkle with the remaining 1 cup of cheese. Bake until the cheese is melted and the casserole is set, 30 to 35 minutes. For a golden top, broil for a few minutes. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1020548-corn-casserole"}