{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin Maple Cornbread", "description": "Sweetened with brown sugar and maple syrup, this cornbread is hardly typical and extremely versatile: It would be just as welcome as a Thanksgiving side as it would be as breakfast, a snack or even a light dessert. Should you have any leftovers, try toasting cubes of the cornbread in the oven and serving them warm with poached fruit and yogurt or ice cream. Though you may find fine, medium and coarse ground cornmeal at your supermarket, be sure to use finely ground. Its downy texture is best suited for this recipe.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2019/11/07/dining/ss-maple-pumpkin-cornbread/ss-maple-pumpkin-cornbread-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "9 to 12 servings", "recipeCuisine": "", "recipeCategory": "breads, quick breads", "keywords": "buttermilk, cornmeal, maple syrup, pumpkin purée, fall, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 275}, "recipeIngredient": ["1/2 cup plus 2 tablespoons/140 grams unsalted butter (1 1/4 stick), melted and cooled slightly, plus more for greasing the pan", "1 cup/180 grams finely ground yellow cornmeal", "1 cup/130 grams all-purpose flour", "1 teaspoon baking powder", "3/4 teaspoon kosher salt", "1/2 teaspoon baking soda", "1 large egg", "3/4 cup/165 grams packed light or dark brown sugar", "1 cup/240 milliliters canned pumpkin purée", "1/2 cup/120 milliliters buttermilk", "1/2 cup plus 2 tablespoons/150 milliliters maple syrup", "1/4 cup/15 grams pumpkin seeds (pepitas)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Butter an 8-inch square baking pan. Line with parchment paper, leaving a 2-inch overhang on two sides. Butter the parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the cornmeal, flour, baking powder, salt and baking soda."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together 1/2 cup melted butter, the egg, brown sugar, pumpkin purée, buttermilk and 1/2 cup maple syrup. Fold in the dry ingredients. Transfer the batter to the prepared pan, and smooth out the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top evenly with the pumpkin seeds. Bake until a toothpick inserted into the center comes out with moist crumbs attached, 25 to 30 minutes. Meanwhile, combine the remaining 2 tablespoons of melted butter and the remaining 2 tablespoons maple syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer bread in the pan to a wire rack. While the bread is still warm, brush the entire surface with the butter-maple mixture. Remove the cornbread from the pan using the overhanging parchment, and cut cornbread into pieces. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1020591-pumpkin-maple-cornbread"}