{"@context": "http://schema.org", "@type": "Recipe", "name": "Blackberry Jam Crostata", "description": "With a press-in-the-pan buttery cookie crust and a tangy jam filling that’s topped with almonds and Demerara sugar, this crostata is simple, homey and utterly delightful. A touch of whole-wheat flour gives the crust complexity and a gentle nutty flavor, while homemade blackberry jam spiked with lemon verbena makes the confection festive enough for guests. This recipe is adapted from Elizabeth Minchilli, a food writer in Rome, who often buys excellent-quality cherry jam for the filling. If you’d like to substitute store-bought jam, use 1 1/2 cups.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/07/31/dining/26apperex/26apperex-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "cookies and bars, pies and tarts", "keywords": "almond, blackberry, blueberry, lemon, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 250}, "recipeIngredient": ["3 cups/340 grams blackberries", "1 cup/125 grams blueberries", "3/4 cup/150 grams granulated sugar, plus more as needed", "2 teaspoons minced fresh lemon verbena (optional)", "1 teaspoon fresh lemon juice, plus more as needed", "1/2 teaspoon grated lemon zest", "1 teaspoon vanilla extract", "1/3 cup sliced almonds", "Demerara sugar, for sprinkling", "1 1/2 cups/190 grams all-purpose flour", "3/4 cup/95 grams whole-wheat flour", "12 tablespoons/170 grams unsalted butter (1 1/2 sticks), softened", "1/2 cup/100 grams granulated sugar", "2 large egg yolks, at room temperature", "1 tablespoon finely grated lemon zest", "1 teaspoon vanilla extract", "1/2 teaspoon fine sea salt", "1/4 teaspoon almond extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the jam: In a medium saucepan, stir together blackberries, blueberries, sugar and lemon verbena, if using. Cook over medium heat, stirring occasionally at first, then more frequently as the mixture starts to bubble and reduce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When mixture has reduced and looks syrupy (about 30 minutes total), stir in lemon juice and zest. Taste and add sugar if necessary. (This depends on how sweet your berries were to begin with.) Cook for 3 minutes longer, stirring frequently to prevent burning. When the jam is thickened and shiny but still slightly runnier than you expect jam to be, take it off the heat; it will continue to thicken as it cools."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape jam into a bowl or heatproof container, stir in vanilla and let cool to room temperature. Taste and stir in a little more lemon juice if the jam seems very sweet. At this point, the cooled jam can be chilled for up to 1 week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a medium bowl, whisk together all-purpose and whole-wheat flours, and set aside. In a second bowl and using an electric mixer, beat butter and sugar until pale and fluffy, about 3 minutes. Beat in egg yolks, lemon zest, vanilla, salt and almond extract until combined, then beat in flour mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop 1/2 cup of the dough into a bowl or container, cover and chill. Transfer remaining dough to a 9- or 10-inch tart pan and use floured fingers to press evenly into bottom and sides. Chill crust in the refrigerator for at least 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, heat oven to 350 degrees. Spread jam evenly into crust, then using your fingers, crumble reserved 1/2 cup dough over jam. Sprinkle with almonds and Demerara sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden, 38 to 48 minutes. Let cool completely to room temperature before serving."}], "link": "https://cooking.nytimes.com/recipes/1020361-blackberry-jam-crostata"}