{"@context": "http://schema.org", "@type": "Recipe", "name": "Warm Fig and Chocolate Sponge Cake", "description": "This dessert is somewhere between a sponge cake and a clafoutis: light and airy, yet rich from the addition of dark chocolate and rum. Make sure you use really ripe, in-season figs, as they make all the difference here. The figs release their juices with the caramel, rum and orange to create a sauce that is perfect to scoop over the sponge cake when serving. For a more concentrated flavor, roast your figs separately before adding them to the caramel. A spoonful of crème fraîche is all you need here, but you could serve this with some vanilla ice cream, if you’re looking for a supertreat.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2019/08/16/dining/16ottorex01/16ottorex01-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "chocolate, crème fraîche, figs, orange, rum, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 137}, "recipeIngredient": ["1/2 cup/100 grams superfine (caster) sugar", "2 tablespoons dark rum", "2 teaspoons finely grated orange zest, plus 1 tablespoon juice (from 1 orange)", "12 ripe black figs (about 14 ounces/400 grams), tough stems removed and figs halved lengthwise", "2 eggs, whites and yolks separated", "1/3 cup plus 2 tablespoons/100 milliliters heavy cream (double cream)", "1/4 cup/35 grams all-purpose (plain) flour", "2 tablespoons/15 grams cocoa powder", "1 teaspoon vanilla extract", "1/4 teaspoon flaky sea salt", "1 1/2 ounces/40 grams dark chocolate (70 percent), roughly chopped into scant 1/2-inch/1-centimeter pieces", "Crème fraîche, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees Fahrenheit/190 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/4 cup/50 grams sugar to a small, oven-proof, high-sided sauté pan with a 6-inch/15-centimeter base (or similar). Cook over medium-high heat, swirling the pan a few times, until the sugar has melted and turned a dark caramel color, 5 to 8 minutes. Carefully add the rum — it will spit and seize up a little — and cook for another 30 seconds, stirring until combined and thick. Remove from the heat, stir in the orange juice and figs, and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the egg yolks to a medium bowl along with 2 tablespoons/25 grams sugar. Whisk by hand until pale and thick, about 3 minutes. Add the cream, flour, cocoa powder, vanilla, salt and orange zest, then whisk until smooth and thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another medium bowl, using a clean whisk, whisk the egg whites by hand with the remaining 2 tablespoons/25 grams sugar until they form stiff peaks, 4 to 5 minutes. Fold gently into the yolk batter, then pour the  mixture over the figs in the sauté pan (it should cover the figs completely)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle all over with the chocolate and bake until the batter rises and is cooked through, about 25 minutes. Remove from the oven, divide among four bowls and drizzle with any remaining liquid from the pan. Serve hot, with some crème fraîche alongside."}]}