{"@context": "http://schema.org", "@type": "Recipe", "name": "Turmeric-Black Pepper Chicken With Asparagus", "description": "In this sweet and spicy stir-fry, black pepper, honey and rice vinegar help accentuate turmeric’s delightfully earthy qualities. Thinly sliced asparagus doesn’t need much time to cook, but feel free to swap with any other vegetables that cook in just a few minutes, like thinly sliced green beans, frozen peas or baby spinach. Serve this with rice or rice vermicelli noodles, or tuck it into a lettuce cup or pita with yogurt and fresh herbs. You could also trade the chicken for tofu, shrimp or cubed pork shoulder.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2020/03/26/dining/as-turmeric-chicken/merlin_170459076_be9517b6-6c9d-47f1-bb27-843d6c777088-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weekday, poultry, vegetables", "keywords": "asparagus, chicken, honey, lime, pepper, rice vinegar, turmeric, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 284}, "recipeIngredient": ["3 tablespoons honey", "3/4 teaspoon black pepper, plus more to taste", "Kosher salt", "2 tablespoons all-purpose flour", "1 1/2 teaspoons ground turmeric", "1 pound boneless, skinless chicken thighs, cut into 1-inch pieces", "1 tablespoon coconut or canola oil", "12 ounces asparagus, trimmed and thinly sliced on an angle", "1 teaspoon unseasoned rice vinegar (optional)", "1 lime, cut into wedges (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or measuring cup, stir together 1/4 cup water with the honey, pepper and 1/2 teaspoon salt; set honey mixture aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, stir together the flour, turmeric and 1 teaspoon salt. Add the chicken and toss until coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium (10-inch) nonstick skillet, heat the oil over medium-high. Add the chicken and cook until the turmeric is fragrant and the chicken is golden brown on both sides, 2 to 3 minutes per side. Add the asparagus, season with salt, stir to combine and cook until crisp-tender, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the honey mixture and cook, stirring, until the chicken is cooked through and the sauce has thickened, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and stir in the vinegar, if using. Season to taste with salt and pepper. Serve with lime squeezed over top, if you like."}], "link": "https://cooking.nytimes.com/recipes/1020970-turmeric-black-pepper-chicken-with-asparagus"}