{"@context": "http://schema.org", "@type": "Recipe", "name": "Polenta and Sausages for a Crowd (Polenta alla Spianatora)", "description": "Picture a golden circle of polenta, spread on a large board or platter, and topped with a rich tomato-y sausage-laden ragù. It’s a traditional, somewhat theatrical way to eat polenta in Northern Italy, and it makes quite an impression when it’s brought to the table. Known as polenta sul tavola or polenta alla spianatora, it is usually served with forks but no plates, with guests gathered around the table for a very casual family-style meal. You can make it when there’s nothing in the house to eat except cornmeal and canned tomatoes, plus an onion or two.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/10/02/dining/27tanisrex2-polenta/merlin_161340912_d3cdbd68-9912-4826-b8a9-df7f2ce9a850-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, grains and rice, sausages", "keywords": "fall, winter, gluten-free, main course, polenta, sausage, tomatoes", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 286}, "recipeIngredient": ["2 cups medium cornmeal", "Kosher salt and black pepper", "8 to 10 cups boiling water or chicken broth", "3 tablespoons extra-virgin olive oil, plus more for drizzling", "1 medium onion, finely diced", "1 1/2 pounds Italian fennel sausage, sweet or hot, in 2- to 3-ounce links", "1 bay leaf", "3 garlic cloves, minced", "1 basil sprig, plus more leaves for garnish", "1 cup dry red wine", "1 (28-ounce) can crushed tomatoes with their juices", "Red-pepper flakes, to taste", "1/2 pound sliced wild or cultivated mushrooms (optional)", "Chopped parsley, for garnish", "Grated pecorino cheese, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the polenta: In a heavy-bottomed pot, whisk together polenta, 2 teaspoons kosher salt and 8 cups boiling water over medium-high heat. Continue whisking as mixture comes to a boil and begins to thicken. Turn heat to low and switch from a whisk to a wooden spoon. Stir every 10 minutes or so, for about 40 minutes, adding a splash of water as necessary to keep polenta from thickening too much. It may take as much as 2 cups more liquid to achieve a smooth, pourable consistency. Taste polenta for salt and add pepper to taste. Stir well, cover and keep warm for up to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As polenta cooks, prepare the topping: Add olive oil to a Dutch oven over medium-high heat. Add onions, season with salt and pepper, and cook, stirring, until softened. Add sausages and let brown on both sides, about 2 minutes per side. Add bay leaf, garlic and basil sprig, and cook for 1 minute more. Add wine, turn up heat, and let reduce by half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add crushed tomatoes and their juices and bring to a boil. Reduce heat to a simmer and cook for about 1 hour, until sauce has thickened somewhat. Taste and adjust with salt and red-pepper flakes. (If using mushrooms, sauté over high heat in a little olive oil, until lightly browned. Season with salt and pepper.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " To serve, rinse a large circular wooden board, about 18-inch diameter, with cool water. (Alternatively, use a large platter.) Pour polenta onto the board, and, using a spatula, quickly spread it into a circle about 3/4-inch deep."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully ladle sauce over the polenta, leaving a 1-inch polenta border at the edges. Arrange sausages over the sauce. Top with mushrooms, if using. Sprinkle with basil, parsley and pecorino."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place polenta in the center of the table, alongside bowls of grated pecorino. To serve the dish traditionally, offer guests forks but no plates and invite them to attack the polenta nearest their chair. Alternatively, cut polenta into large slices, and serve on dinner plates."}], "link": "https://cooking.nytimes.com/recipes/1020500-polenta-and-sausages-for-a-crowd-polenta-alla-spianatora"}