{"@context": "http://schema.org", "@type": "Recipe", "name": "Figs in Blankets With Port-Mustard Sauce", "description": "This clever riff on the classic pigs in blankets comes from a Champagne bar, with branches in San Francisco and New York, where they’re made with fresh figs. Using dried figs gives them year-round adaptability. The figs are plumped in port and stuffed with Stilton, though any blue cheese will be fine. The port used for soaking is reduced to a syrup, and flavors a mustard sauce. The figs in blankets are a great holiday tidbit with white, red, rosé or sparkling wine, with cocktails or punch. Serve them alongside a salad or as part of a cheese course. They’re easily prepared in advance and frozen. The puff pastry is quick to prepare in a food processor using frozen butter. The figs in blankets can also be made with purchased puff pastry; one pound is what you’ll need.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2019/11/20/dining/14pairrex/merlin_163923747_53e52966-5f6d-477b-b207-18a1d63fbf16-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "48 pieces", "recipeCuisine": "american", "recipeCategory": "snack, finger foods", "keywords": "appetizer, dijon mustard, dried figs, sour cream, stilton, tawny port", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 33}, "recipeIngredient": ["48 small dried mission figs, stemmed, or 24 larger dried figs, stemmed and halved vertically", "1 1/2 cups tawny port", "1 cup/225 grams salted butter (2 sticks), frozen", "1 1/2 cups/190 grams all-purpose flour, plus extra for rolling", "1/2 cup/125 milliliters full-fat sour cream", "3 ounces Stilton or other blue cheese", "1/3 cup Dijon mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place figs in a 2-quart saucepan, add port, bring to a simmer, remove from heat and let soak, covered but not refrigerated, overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Cut the frozen butter in 8 pieces and grate using a shredding disc of a food processor. Change to the regular blade. Add the flour and pulse 15 or 20 times, until the mixture resembles coarse crumbs. Add the sour cream and pulse for a minute or so until the dough starts to come together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out on a floured surface and knead briefly to form a smooth ball. Divide the dough in half and flatten each piece. Place each in a resealable sandwich bag, press out any air, seal the bag and use a rolling pin to roll the bag until the dough fills the bag, forming a square. Refrigerate 2 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain figs, reserving the port; you should have about a half cup of the port. Spread figs on several layers of paper towel to dry for about 30 minutes. Return the port to the saucepan and boil 6 to 8 minutes until syrupy and reduced to 1/4 cup. Remove from heat and set aside. Cut a slit in each of the figs and insert a small nugget of the cheese, less than a half-inch, in each."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the dough from their bags by cutting the bags and peeling them off. On a lightly floured board roll one square of the dough into a rectangle 8-by-12 inches. Cut it in 8 strips each an inch wide, across the width of the rectangle. Cut each strip in thirds. You should have 24 pieces, each 1-by-4 inches. Wrap 24 of the figs in the strips of dough, moistening the ends to seal. Cover a baking sheet with foil. Place the wrapped figs on the baking sheet, seam side down. Repeat with the other square of dough and figs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Stir the mustard into the reduced port and transfer to a serving dish. This mixture will keep, refrigerated in a covered container, at least three weeks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Bake wrapped figs about 35 minutes, until golden. Some of the figs may have oozed residue of the port which can be brushed off. Serve the baked figs at once or let cool and refrigerate or freeze. To reheat, let them come to room temperature, then warm at 250 degrees for 15 minutes. Serve with port-mustard sauce alongside for dipping."}], "link": "https://cooking.nytimes.com/recipes/1020586-figs-in-blankets-with-port-mustard-sauce"}