{"@context": "http://schema.org", "@type": "Recipe", "name": "Air-Fryer Brussels Sprouts With Garlic, Balsamic and Soy", "description": "Brussels sprouts are quite possibly the best vegetable you can make in an air fryer; the leaves turn brittle and delightfully crunchy. Here they are paired with slivers of garlic, which turn into pungent golden chips as they fry. Then the whole thing is dressed with a mix of balsamic vinegar that’s been simmered until thickened, then seasoned with lime juice for freshness and soy sauce for complexity. Serve this as a side dish, or as snack with drinks; just make sure to have plenty of napkins on hand.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/04/03/dining/03airrex3/02airrex3-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "appetizer, side dish, balsamic vinegar, brussels sprouts, garlic, soy sauce, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 200}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 155, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "186 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 pound brussels sprouts, trimmed and halved through the stems (cut larger ones in quarters)", "3 tablespoons extra-virgin olive oil", "1/4 teaspoon kosher salt", "2 garlic cloves, thinly sliced", "1/4 cup balsamic vinegar", "1 teaspoon fresh lime juice, plus more for serving", "1/2 teaspoon soy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat air fryer to 400 degrees, if preheating is necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place brussels sprouts in the air fryer basket; drizzle with 1 tablespoon oil and the salt. Fry for 15 minutes, shaking basket or stirring the sprouts halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle sprouts with garlic. Continue to fry until the garlic is golden brown, another 2 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small saucepan, bring balsamic vinegar to a simmer. Continue to simmer until thickened and starting to look syrupy, adjusting heat as necessary to prevent burning, 2 to 3 minutes. (Keep a close eye on it; it will go from reduced to burned very quickly.) Remove from heat and whisk in 2 tablespoons oil, the lime juice and the soy sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer brussels sprouts to a serving platter and drizzle with balsamic dressing. Squeeze more lime juice on top to taste."}], "link": "https://cooking.nytimes.com/recipes/1020126-air-fryer-brussels-sprouts-with-garlic-balsamic-and-soy"}