{"@context": "http://schema.org", "@type": "Recipe", "name": "Hibiscus Quesadillas (Quesadilla con Flor de Jamaica)", "description": "Dried hibiscus is cheap and plentiful, usually available in specialty grocery stores or international supermarket bulk bins. It has a place in kitchens around the world, in drinks and syrups and remedies and stews. The calyxes of the flower — the part we actually eat — also happen to have a high pectin content, making them ideal for jelly making. Lately, the ingredient has been marketed as a kind of health food, or meat substitute, but the ingredient has deep, ancient roots and stands on its own. Adriana Almazán Lahl, who owns a catering business in San Francisco, rehydrates the flowers and sautés them with onion and chiles, then folds the spicy mixture into flour tortillas with a little cheese. The result is a quick, delicious meal, and an excellent way to use up the entire flower. Be sure to rinse the hibiscus well before you get started; grit hides in its folds.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2019/07/07/magazine/07mag-eat/98ceecea716044c0800cdaead2aa060b-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 quesadillas", "recipeCuisine": "mexican", "recipeCategory": "dinner, easy, lunch, quick, snack, weekday, weeknight, tacos", "keywords": "hibiscus, quesillo, tortilla, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 65}, "recipeIngredient": ["1 (packed) cup dried hibiscus", "3 tablespoons neutral oil, such as canola", "1 yellow onion, thinly sliced", "1 jalapeño, halved, seeded then thinly sliced lengthwise", "Kosher salt and ground pepper", "1/4 pound quesillo, torn into bite-size pieces, or 1 cup grated Monterey Jack", "4 large flour tortillas", "1 handful cilantro leaves and tender stems, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse hibiscus under running water to remove any grit. Bring 2 cups water to a boil in a medium saucepan. Add hibiscus, and simmer for 2 minutes. Strain, reserving liquid for another use (see introduction). Rinse and chop the hibiscus."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat 2 tablespoons of oil over a medium flame. Add the onion and jalapeño, and sauté, stirring occasionally, until the onion is just starting to lightly brown, about 6 minutes. Add the hibiscus, and sauté until the mixture is shiny and most of the water has evaporated, about 2 minutes. Season generously with salt and pepper, and set aside. Wipe out skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the cheese evenly among the tortillas, sprinkling it to cover 1/2 of each. Scatter the hibiscus mixture on top of the\ncheese, followed by the cilantro. Fold the tortillas over the filling into half-moon shapes, pressing down firmly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining oil to the skillet, and heat over a medium flame. Gently slide 2 quesadillas into the hot pan, and cook until the cheese has melted and the tortilla is golden brown underneath, 2 to 3 minutes. Carefully flip quesadillas, and cook until the other side is golden, 1 to 2 minutes. Repeat with the remaining quesadillas, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020328-hibiscus-quesadillas-quesadilla-con-flor-de-jamaica"}