{"@context": "http://schema.org", "@type": "Recipe", "name": "Juicy BLT", "description": "The success of a BLT hangs in its balance of salt, acid, lusciousness and crunch. This version is perfect, with a generous swipe of mayonnaise on each slice of toast, followed by a drizzle of olive oil, tomatoes marinated in red wine vinegar and salt, butter lettuce leaves and thick-cut bacon. Squash this closed and eat while the bacon is still warm. BLTs are often associated with summer, but the vinegar here coaxes flavor and brings brightness to hothouse tomatoes, turning it into a sandwich for all seasons.", "author": {"@type": "Person", "name": "Clare de Boer"}, "image": "https://static01.nyt.com/images/2019/08/28/dining/27Diaryrex4/27Diaryrex4-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "2 sandwiches", "recipeCuisine": "american", "recipeCategory": "sandwiches", "keywords": "bacon, lettuce, tomato, white bread, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 155}, "recipeIngredient": ["8 slices thick-cut, smoked or unsmoked bacon, or 16 slices thin-cut bacon", "2 heirloom tomatoes (in summer season, in winter use smaller vine tomatoes)", "2 teaspoons red wine vinegar", "1 1/2 tablespoons extra-virgin olive oil", "Flaky sea salt", "Freshly ground black pepper", "4 slices good white bread (medium thickness, boule is preferable), heavily toasted", "1/4 cup mayonnaise", "6 butter lettuce leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches if necessary, fry bacon in a large skillet over high heat until golden brown, about 4 minutes. Transfer to a large cutting board."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While bacon cooks, slice tomato crosswise into thin rounds. Transfer to a plate and marinate with red wine vinegar, 1 tablespoon olive oil, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread toast generously with mayonnaise on one side, follow with remaining 1/2 tablespoon olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the tomatoes with some of their vinegar marinade among 2 slices of toast. Top with the lettuce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the bacon on the remaining slices of toast. Form sandwiches by piling the bacon-topped slices on top of the remaining toasts. Squeeze to close, cut in half and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020409-juicy-blt"}