{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Tomato Tart With Ricotta and Pesto", "description": "Save those wider-than-tall, about-to-burst tomatoes for slicing and showering with flaky sea salt. For this recipe, you want smaller, sturdier varieties like kumato, Campari or petite heirlooms. Brushing the uncooked puff pastry with crème fraîche adds a subtle tanginess that you won’t necessarily notice, but the tomatoes will taste better for it. You might be tempted to skip salting your tomatoes, but don’t: It helps prevent a soggy crust while intensifying the flavor of your tomatoes. This tart is best enjoyed straight out of the oven, at its flaky prime, but it’s also great at room temperature, or even cold, devoured directly from the fridge.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/07/29/dining/aw-roasted-tomato-tart-with-ricotta-and-pesto/aw-roasted-tomato-tart-with-ricotta-and-pesto-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, weekday, pastries, pies and tarts, vegetables", "keywords": "appetizer, main course, side dish, basil, crème fraîche, pesto, puff pastry, red onion, tomato, fall, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 461}, "recipeIngredient": ["4 small, multicolored tomatoes, such as heirloom, kumato or Campari (about 12 ounces total), sliced crosswise 1/4-inch thick", "Kosher salt and black pepper", "1 sheet packaged puff pastry, thawed (about 7 ounces) ", "3 tablespoons crème fraîche or sour cream", "1/4 small red onion, very thinly sliced", "Aleppo pepper or red-pepper flakes, for garnish (optional)", "3/4 cup fresh ricotta", "Store-bought or <a href=\"https://cooking.nytimes.com/recipes/2653-basic-pesto\">homemade pesto</a>, for drizzling", "Extra-virgin olive oil, for drizzling", "Fresh basil leaves, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large baking sheet with paper towels. Set the sliced tomatoes on top in a single layer. In a small bowl, combine 1 teaspoon salt and 1 teaspoon pepper. Use it to season the tomatoes evenly on both sides, cover with another paper towel and let sit, 15 minutes, allowing the salt to draw moisture out of the tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the tomatoes sit, heat the oven to 400 degrees and set a rack in the middle of the oven. Working on a large sheet of parchment paper, roll out the puff pastry into a 9-by-11-inch rectangle, trimming any uneven edges. Prick the inside with a fork every few inches, leaving a 1/2-inch border. Using a pastry brush, coat the center of the puff pastry with the crème fraîche, leaving the border unbrushed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working within the border, layer the tomatoes and red onion on top of the tart, allowing them to overlap slightly. Transfer to a sheet pan and bake, rotating halfway through, until puff pastry is browned and puffed, 30 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle tomatoes with Aleppo pepper, if using. Dollop with fresh ricotta. Thin pesto with olive oil until it reaches the proper consistency for drizzling; drizzle on top of tart to taste. Top with basil, if using, and serve warm or at room temperature."}]}