{"@context": "http://schema.org", "@type": "Recipe", "name": "Zuni Café’s Hamburger", "description": "Made to exacting standards, the hamburger at Zuni Café, in San Francisco, is legendary. First, grass-fed beef is salted well in advance of grinding, which gives the meat its succulence. Grilled over coals and flipped three times to prevent it from overcharring or becoming tough, the patty is rested, like a roast. It is then served on a toasted square of rosemary focaccia, smeared with handmade aioli and accompanied by Zuni’s acclaimed house pickles: fuchsia-red onion rings and turmeric-tinged sliced zucchini. With all the attention to detail, you’ll see why a Zuni burger sells for $18. It is wonderful on its own, but toppings like Shelburne Farms Cheddar, Bayley Hazen blue cheese, grilled onions or portobello mushroom are also available, and most customers can’t resist a heaping plate of shoestring potatoes alongside. It’s perfectly possible to make these burgers at home, but know that the full project involves several recipes, so it’s probably best to spread the work out over a few days.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/03/06/dining/06kitchrex4-1-copy/merlin_150550896_37ba3d6a-edde-4060-9285-6865be03e3b3-articleLarge.jpg", "totalTime": "P1DT1H", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, burgers", "keywords": "beef chuck, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 81}, "recipeIngredient": ["1 1/2 pounds boneless beef chuck, well marbled", "1 generous teaspoon kosher salt", "Focaccia (<a href=\"https://cooking.nytimes.com/recipes/1020050-zuni-cafes-focaccia\">see recipe</a>)", "Small-batch aioli (<a href=\"https://cooking.nytimes.com/recipes/1020051-zuni-cafes-small-batch-aioli\">see recipe</a>)", "Red oak leaf or other lettuce leaves, for garnish", "Zucchini pickles (<a href=\"https://cooking.nytimes.com/recipes/1020052-zuni-cafes-zucchini-pickles\">see recipe</a>)", "Red onion pickles (<a href=\"https://cooking.nytimes.com/recipes/1020053-red-onion-pickles\">see recipe</a>) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut meat into 1-inch chunks or strips. Sprinkle with salt, tossing to coat well, and refrigerate, covered, for about 8 hours or up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble your meat grinder, using the grinder plate with 3/16-inch holes. Chill the grinder in a bowl of ice water for 30 minutes or refrigerate for several hours. With motor set to medium speed, drop cold meat into grinding tube and let the machine pull pieces through (resist forcing the meat through with pushing tool) into a chilled bowl. Grind the meat twice. (You may also hand-chop the meat in small batches or use a food processor with a very sharp blade, but the patties will be a bit more fragile.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, form 6-ounce patties by hand, first making spheres, then flattening them to a 3/4-inch thickness. Press patties slightly thinner in the middle. (This ensures an even thickness in the finished burgers.) Keep patties refrigerated until ready to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If grilling, prepare your coals. Grill patties over medium-hot coals, flipping them three times to make sure they don’t char. A cold 6-ounce patty will take about 9 minutes for a rosy medium-rare. Rest for 2 to 3 minutes off the heat, as you would a roast, before serving. If using a preheated cast-iron pan over medium heat, cook burgers for about 10 minutes, also flipping three times, plus resting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, warm a piece of focaccia for each burger and split the bread horizontally. Smear the bottom half with a dab of aioli, the add lettuce leaves and the cooked burger. Top with the other half of the focaccia. Serve with zucchini pickles and red onion pickles."}], "link": "https://cooking.nytimes.com/recipes/1020048-zuni-cafes-hamburger"}