{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto al Salto", "description": "The Italian kitchen is famous for superior ingredients, and for letting nothing go to waste. This recipe for risotto al salto, which uses leftover, day-old risotto, is a perfect example: You start with a creamy, well-made saffron risotto, then make a crispy delicious cake from it the next day. I’m not the first to notice that many people make more risotto than they need just so they can have extras for this golden perfection the next day.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2019/11/24/magazine/24mag-eat/24mag-eat-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 to 3 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, grains and rice", "keywords": "appetizer, main course, side dish, arborio rice, parmesan, rice, saffron, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 128}, "recipeIngredient": ["4 cups chicken stock", "1 tablespoon saffron threads", "Kosher salt", "4 tablespoons unsalted butter", "1 small white onion, minced (about 1/2 cup)", "1 cup carnaroli or arborio rice", "1/4 cup dry white wine", "1/4 cup finely grated Parmesan (use a Microplane)", "6 tablespoons clarified butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a simmer in a medium saucepan. Add the saffron threads and a healthy pinch of salt, and continue to simmer, 2 to 3 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt 3 tablespoons unsalted butter in a large enameled or heavy-bottomed pot over medium heat. Add the onions and sweat them, stirring occasionally, until soft and translucent, 6 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice, and stir to coat with the onion-butter mixture, then add the wine, and continue to stir until the wine is evaporated, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 cups of the warm saffron-chicken stock, and stir continuously until nearly all the stock is absorbed into the rice, 13 to 15 minutes. Continue adding about 1/2 cup of stock at a time, stirring constantly until the stock is absorbed into the rice before adding more, until the rice is creamy and tender yet still al dente, about 18 minutes total. (You may not need to use all of the stock.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the risotto from the heat, stir in the Parmesan and the remaining 1 tablespoon unsalted butter, then season to taste with salt. Transfer to a lidded container, and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons clarified butter in an 8-inch nonstick skillet over medium-low. Add the chilled risotto, and shape into a thick, even pancake using a heatproof rubber spatula. Cook over medium-low heat, swirling the pan often to prevent the rice from sticking, until the underside is lightly browned and crisp, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently shake and swirl the pan to make sure the risotto pancake isn’t sticking at all and remains intact. Carefully slide it out onto a large round plate big enough to accommodate it. Invert another plate on top of the risotto pancake, and quickly flip the plates so that the crispy side of the rice is now facing up. Remove the top plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 3 tablespoons clarified butter to the skillet, and carefully slide the rice into the pan, crispy-side up. Cook over medium heat, and continue swirling the skillet until the bottom side is crispy and lightly browned, 6 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully pour off and discard any extra clarified butter, and gently slide the risotto pancake onto a warm serving plate."}], "link": "https://cooking.nytimes.com/recipes/1020634-risotto-al-salto"}