{"@context": "http://schema.org", "@type": "Recipe", "name": "Seekh Kebab With Mint Chutney", "description": "Served at most traditional Indian restaurants, seekh kebabs are made with ground lamb that’s been seasoned with garam masala, cumin seeds, fresh ginger and fresh cilantro, then grilled and served with raw red onion and bright mint chutney to offset the richness and heat. This recipe comes from Chintan Pandya, the executive chef at <a href=\"https://www.nytimes.com/2018/11/20/dining/adda-indian-canteen-review.html\">Adda Indian Canteen</a>, a New York restaurant that specializes in homestyle Indian food. You’ll need to purchase deggi mirch, an Indian chile powder that tastes somewhat like a smoky paprika, but is mild enough to be used in a quantity large enough to color the meat red. The spiced meat mixture benefits from chilling to help retain its shape on the grill, but you could also roll it into meatballs and pan-sear them on the stovetop or roast them in the oven, if the season dictates.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/09/25/dining/aw-lamb-kebabs/aw-lamb-kebabs-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 kebabs", "recipeCuisine": "indian", "recipeCategory": "dinner, barbecues, finger foods, meat, skewers and kebabs", "keywords": "amul cheese, anardana, cardamom, garam masala, ground lamb, mint, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 44}, "recipeIngredient": ["2 1/4 pounds ground lamb", "1 packed cup shredded Amul cheese or white Cheddar (about 3 ounces)", "1/3 packed cup very finely chopped fresh cilantro", "2 tablespoons plus 2 teaspoons deggi chile powder, plus additional for garnish", "1 tablespoon minced fresh ginger", "3 garlic cloves, minced", "1 tablespoon minced green Thai chile or serrano chile (with seeds)", "2 teaspoons garam masala", "1 teaspoon black cumin seeds (shah zeera) or regular cumin seeds", "3/4 teaspoon ground cardamom", "Kosher salt", "Neutral oil, for greasing", "3 packed cups roughly chopped cilantro, leaves and tender stems", "2 packed cups roughly chopped fresh mint leaves", "1/4 cup finely chopped red onion", "1 tablespoon minced fresh ginger", "1 teaspoon minced green Thai or serrano chile (seeds included)", "2 tablespoons anardana (dried pomegranate seeds), crushed, or very finely chopped fresh mango", "2 teaspoons lemon juice", "1 teaspoon granulated sugar, plus more as needed", "Red onion, very thinly sliced, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the lamb skewers: In a large bowl, combine the lamb with the cheese, cilantro, chile powder, ginger, garlic, green chile, garam masala, cumin seeds, cardamom and 2 teaspoons salt. Shape the meat like a sausage into six 5-inch logs that are just under 2 inches thick. Skewer each and pack them tightly. Refrigerate for 2 hours and up to overnight to firm up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the mint chutney: Add the cilantro, mint, red onion, ginger, green chile and 1/4 cup water to a blender. Puree until smooth, scraping down the sides of the blender as needed. (Add more water by the spoonful, if needed, until mixture is saucy.) Transfer to a small bowl. Stir in the anardana, lemon juice and sugar; season to taste with salt and more sugar, if desired. Refrigerate until ready to use. (The mint chutney is best the day it’s prepared, but it can be refrigerated one day in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the grill with neutral oil and heat over medium. Grill the kebabs, rotating as needed, until browned all over and cooked through, 12 to 15 minutes. Serve with mint chutney, and very thinly sliced red onion, if desired. Sprinkle kebabs and onions (if using) with deggi chile powder and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020472-seekh-kebab-with-mint-chutney"}