{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Cauliflower, Bacon and Sage", "description": "A comforting dinner for a cold night, this hearty pasta has all the makings of a crowd-pleaser like fried sage leaves, crispy bacon and nutty roasted cauliflower. This recipe demonstrates the magic of starchy pasta water: Swirled with lemon juice and Parmesan, it creates a luxurious sauce without the addition of cream or butter. Add more pasta water than you think you need, so the pasta stays moist as it absorbs the sauce.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2019/12/13/dining/lh-cauliflower-pasta/lh-cauliflower-pasta-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, pastas", "keywords": "bacon, cauliflower, parmesan, pasta, sage, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 207}, "recipeIngredient": ["1 medium head cauliflower (2 to 2 1/2 pounds), cored and cut into 3/4-inch florets", "2 to 3 tablespoons olive oil, plus more as needed", "Kosher salt and black pepper", "1/2 pound thick-cut bacon, diced", "1 packed cup fresh sage leaves", "1 pound short pasta, such as gemelli, casarecce or penne", "Zest and juice of one 1 lemon, separated", "1/2 cup grated Parmesan cheese, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Place the cauliflower on a sheet pan. Drizzle with 2 to 3 tablespoons olive oil, sprinkle with 3/4 teaspoon salt and 1/2 teaspoon pepper, and toss to coat. Roast, tossing occasionally, until tender and browned all over, 20 to 25 minutes. While the cauliflower roasts, bring a large pot of water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large (12-inch) skillet over medium-high. Add the bacon and cook, stirring occasionally, until crisp, 5 to 7 minutes. Using a slotted spoon, transfer the bacon to a paper towel-lined plate. Add the sage leaves to pan and fry until they begin to brown, 1 to 2 minutes. Using a slotted spoon, transfer the sage leaves to the plate with the bacon. Drain all but 3 tablespoons of fat from the skillet (or add additional olive oil, if needed) and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 tablespoon salt to the boiling water and cook the pasta until just al dente, reserving 1 1/2 cups of the pasta water. Drain the pasta and add to the reserved skillet; heat over low. Pour or squeeze the lemon juice over the pasta, along with 1 cup pasta water and the 1/2 cup grated Parmesan. Toss until the sauce comes together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the cauliflower, bacon and sage, adding a splash more pasta water if the pasta seems dry. Season with salt and pepper. Sprinkle with lemon zest, and serve with extra Parmesan on the side."}]}