{"@context": "http://schema.org", "@type": "Recipe", "name": "Flag Cake", "description": "Layered with whipped cream, raspberry purée, saltines and fresh fruit, this easy icebox cake balances bright, fresh flavors with tangy cream cheese. The saltines add a nice saltiness, but you can substitute graham crackers or even chocolate wafers if you prefer things on the sweeter side. The addition of cream cheese makes the icebox filling thicker and more stable. And, while the cream firms up, the saltines absorb its moisture, becoming tender and making the cake easy to cut into impressively striped slices.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2019/06/24/dining/em-icebox-cake/em-icebox-cake-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 servings (Makes one 5-by-9-inch cake)", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "blueberries, cream cheese, raspberries, saltine crackers, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 486}, "recipeIngredient": ["18 ounces/510 grams fresh raspberries or thawed frozen raspberries", "2/3 cup/135 grams granulated sugar", "Pinch of fine sea salt", "1 teaspoon vanilla extract", "8 ounces/225 grams cream cheese, at room temperature", "1/3 cup/65 grams granulated sugar", "3 cups/720 milliliters heavy cream, chilled", "48 saltine crackers", "Fresh raspberries and blueberries, for finishing", "Confectioners’ sugar, for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the raspberry purée: In a medium saucepan, stir together the raspberries, sugar and salt. Cook over medium, stirring occasionally, until the berries start to break down, 5 to 6 minutes. Use a potato masher or large fork to smash the berries until they are soft and lumpy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the purée over a large bowl, discarding the solids. (You should have about 1½ cups/360 milliliters of purée.) Stir in the vanilla extract, and let cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: In the bowl of an electric mixer fitted with the whip attachment, whip the cream cheese and sugar on medium speed until light and fluffy, 3 to 4 minutes. Scrape the bowl well. With the mixer still on medium speed, add the cream gradually in a slow, steady stream, pausing for a moment if the milk begins to splash up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue to whip the mixture on medium speed until it forms soft peaks. Scoop about half of the whipped cream (about 3¼ cups) into the bowl with the raspberry purée, reserving the remaining half in the mixer bowl. Use a whisk to mix the raspberry mixture and cream just until combined. (It should still look thick, but also smooth and creamy. Do not overwhip.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 5-by-9-inch loaf pan with plastic wrap, pressing it firmly into the base, corners and sides and leaving enough excess to wrap the surface of the cake later. Transfer ⅓ of the white whipped cream mixture to a disposable piping bag, or a zip-top bag with a ½-inch opening cut from a lower corner of the bag. (Working with a batch at a time keeps the cream from becoming overworked as you squeeze the bag.) Pipe back and forth to fill the base of the pan with an even layer of white cream. (Alternately, you could dollop the cream into the pan and spread into an even layer.) Arrange 8 saltines evenly on top of the cream, pressing gently to affix them. Pour or spoon ⅓ of the raspberry whipped cream mixture into the prepared pan and spread into an even layer. Arrange 8 saltines evenly over the raspberry-cream cheese mixture, pressing gently into it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat this process twice more, layering the white whipped cream, saltines, raspberry whipped cream and saltines again until the pan is full. The final layer or two may rise slightly above the top rim of the pan, which is O.K.! (If you can’t fill your pan any more, and still have a little cream left, save it in the refrigerator to use as a topping for ice cream.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the excess plastic wrap to cover the top of the assembled cake. Transfer it to the fridge for 12 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unwrap the top of the cake, then invert the pan onto a platter or serving dish. The cake should easily pop out of the loaf pan, but if it doesn’t, you can use the plastic wrap to help to pull it away from the pan. Remove and discard the plastic wrap."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate until ready to serve. The cake slices well directly from the refrigerator, but for even cleaner, sharper slices, you can freeze the cake for 15 to 20 minutes before slicing and serving. When ready to serve, pile raspberries and blueberries on top of the cake and dust with confectioners’ sugar."}]}