{"@context": "http://schema.org", "@type": "Recipe", "name": "Lisbon Chocolate Cake", "description": "On my first day in Lisbon, I became a statistic: I lost all my credit cards to a talented thief on the No. 28 tram. After “the incident,” I wanted to leave Lisbon, but instead, my husband Michael and I decided to tackle our must-taste list. It was on our last day in Lisbon that we tasted the cake at Landeau Chocolate. It was intense, but not overwhelming; truly chocolate, but somehow each layer’s chocolateness was different. I returned home and made this cake, my version of the cake that cured my pickpocket blues. It’s a dense-but-not-heavy, brownielike cake topped with a whipped chocolate ganache (think: mousse) and a substantial dusting of cocoa. Because this cake is completely about the chocolate, choose one you love.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2019/11/03/magazine/03mag-eat/03mag-eat-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "One 9-inch cake (about 10 servings)", "recipeCuisine": "", "recipeCategory": "snack, cakes", "keywords": "bittersweet chocolate, cocoa powder, dark chocolate, semisweet chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2063}, "recipeIngredient": ["1/2 cup/115 grams unsalted butter (1 stick), cut into chunks, plus more for greasing the pan", "1/3 cup/30 grams unsweetened cocoa powder", "1 1/2 tablespoons cornstarch", "1/4 teaspoon baking powder", "1/4 teaspoon fine sea salt", "5 ounces/140 grams semisweet or bittersweet chocolate, coarsely chopped", "1/2 cup/100 grams granulated sugar", "3 large eggs, chilled", "1 3/4 cups/420 milliliters heavy cream", "6 ounces/170 grams semisweet or bittersweet chocolate, finely chopped", "3 tablespoons unsweetened cocoa powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Center a rack in the oven, and heat oven to 325 degrees. Butter a 9-inch cake pan, line with parchment paper and butter the paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together the cocoa powder, cornstarch, baking powder and salt in a medium bowl. Whisk to blend."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the 1/2 cup butter in a large heatproof bowl set over a saucepan of simmering water. Scatter the semisweet or bittersweet chocolate on top, and heat, stirring often, until the mixture is smooth and glossy. Remove the bowl from the pan, and stir in the sugar. One by one, energetically stir in the eggs, beating for 1 minute after the last egg is added. The mixture will look like pudding. Stir in the dry ingredients. Scrape the mixture into the cake pan, and give the pan a couple of good raps against the counter to settle the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 18 to 20 minutes, or until a tester inserted into the center comes out clean (or with only a tiny streak of chocolate). Transfer to a rack, cool for 5 minutes, then unmold the cake. Peel off the paper, invert the cake and cool to room temperature. Wash and dry the cake pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the ganache: Pour 1 1/4 cups cream into a small saucepan; refrigerate the rest. Scald the cream over medium heat, turn off the heat and stir in the semisweet or bittersweet chocolate until fully incorporated. Transfer to a heatproof bowl. Refrigerate the ganache for 10 minutes, whisk it, then refrigerate again for 10 minutes. Repeat chilling and whisking steps until the ganache is thick enough to make tracks when you stir, 50 to 60 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut two 3-by-16-inch pieces of parchment or foil, and crisscross them in the cake pan. Carefully return the cake to the pan. (The mousse layer is too soft to stand on its own until it's chilled. It needs the support of the pan sides.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the remaining 1/2 cup cream until it holds medium peaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a whisk, gently beat the ganache until it’s soft and spreadable. With a spatula, fold in the whipped cream. Spread over the cake, and refrigerate for 2 hours (or cover and keep for up to 2 days). The cake is best served cool or at room temperature, so take it out of the fridge about 20 minutes before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish, put the cocoa powder in a fine-mesh strainer, and shake it over the top of the cake. Run a table knife along the sides of the pan. Using the parchment or foil handles, carefully lift the cake out of the pan and onto a serving plate. Discard the strips. Cut the cake using a long knife that has been run under hot water and wiped dry between each cut."}]}