{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potatoes With Tahini Butter", "description": "Carla Lalli Music, a food writer and editor, is vehemently opposed to roasting sweet potatoes. “I don’t understand why people are constantly roasting them,” she says. “Roasting just makes them more fibrous and leathery, and they never, ever really get crispy.” Instead, she posits that steaming performs a kind of alchemy on sweet potatoes that roasting never does — the moist heat fluffs them into absorbent clouds. And to make up for the inherent blandness of the cooking method, she slathers them with a rich tahini butter spiked with soy sauce, which immediately melts into a mouth-smacking sauce. Her simple recipe ends with a shower of golden sesame seeds and a torrent of lime juice. Try it — every bite will surprise you with crunch, salt, umami and acidity to counterbalance the sweetness of the pillowy potatoes.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2020/02/26/dining/nosrat-sweet-potatoes-with-tahini-butter/nosrat-sweet-potatoes-with-tahini-butter-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "butter, lime, sesame seeds, sweet potato, tahini, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1330}, "recipeIngredient": ["2 1/2 pounds sweet potatoes of any color (about 4 medium), washed", "6 tablespoons unsalted butter (3/4 stick), at room temperature", "1/4 cup well-stirred tahini", "2 to 3 tablespoons freshly squeezed lime juice, plus lime wedges, for serving", "2 tablespoons soy sauce", "1 teaspoon toasted sesame oil", "1 clove garlic, finely grated or pounded smooth with a pinch of salt", "Salt and freshly ground black pepper", "2 tablespoons white sesame seeds", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a few inches of water to a boil in a medium pot fitted with a steamer basket or footed colander. Place sweet potatoes in the steamer. Cover, reduce heat to medium and steam until potatoes are completely tender, 35 to 40 minutes. (Use a skewer or paring knife to check for doneness; the potatoes should be soft all the way through.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, whisk butter, tahini, lime juice, soy sauce, sesame oil and garlic until smooth. It might seem as if the butter and liquids will never fully combine, but they will — just keep stirring! Taste, and adjust seasoning with salt, pepper and more lime juice as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a small pan over medium heat. Toast the sesame seeds, swirling the pan continuously, until seeds are golden. They’ll give off some oil and start to clump together, so if needed, stir with a wooden spoon to keep them moving so that they toast evenly. They’ll turn a nice deep-golden shade just as they dry off a bit, about 4 minutes. Transfer seeds to a small bowl to prevent them from overcooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the sweet potatoes are tender, use tongs to transfer them to a large plate or platter. When they are just cool enough to handle, split potatoes in half lengthwise, and season with flaky salt. Spread tahini butter generously onto the flesh, and top with sesame seeds. Serve immediately with lime wedges."}], "link": "https://cooking.nytimes.com/recipes/1020274-sweet-potatoes-with-tahini-butter"}