{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Cacio e Pepe", "description": "This speedy vegan take on <a href=\"https://cooking.nytimes.com/recipes/1017304-cacio-e-pepe\">cacio e pepe</a> utilizes a classic technique: Cook the pasta just short of al dente, reserve some of the starchy pasta water to add body to the sauce, then simmer the pasta in its sauce with a splash of pasta water, stirring vigorously until the sauce is emulsified. While many dairy-free pasta recipes look to puréed, soaked cashews for their creaminess, this one cuts corners by using store-bought cashew butter. A spoonful of miso adds depth, and tangy nutritional yeast adds umami. Toasting the peppercorns boosts their flavor and softens them.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/12/17/dining/aw-vegan-cacio-e-pepe/aw-vegan-cacio-e-pepe-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weeknight, pastas", "keywords": "cashew butter, lemon, nutritional yeast, peppercorns, spaghetti, white miso, dairy-free, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 817}, "recipeIngredient": ["Kosher salt", "1/3 cup nutritional yeast", "1/4 cup cashew butter", "2 tablespoons white miso paste", "1 tablespoon whole black peppercorns", "16 ounces dried spaghetti", "1/4 cup extra-virgin olive oil, plus more for drizzling", "1/2 lemon, squeezed as needed (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of lightly salted water to a boil over high. (Go easy on the salt here, since the miso paste added in Step 4 is high in salt.) Add the nutritional yeast, cashew butter and miso to a small bowl and stir into a thick paste. Crush the peppercorns using the flat side of a knife. (Alternatively, you can roughly chop them, or use a pepper grinder set to a coarse setting.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta to the boiling water, reduce the temperature to medium, and cook, stirring occasionally, about 2 minutes before al dente according to package instructions. Reserve 2 1/2 cups pasta cooking water, then drain the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/4 cup olive oil to the empty pot and heat over medium. Add about two-thirds of the crushed black peppercorns and toast, stirring frequently, until fragrant, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the miso mixture, and stir, then whisk in 1 3/4 cups reserved pasta water until sauce is smooth. Add the pasta to the sauce and cook over medium-high, tossing it constantly and vigorously with tongs, until the sauce is glossy and the pasta is fully al dente, 1 to 2 minutes. Add an extra splash of reserved pasta water to keep the sauce glossy, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide among bowls. Drizzle with olive oil, sprinkle with remaining crushed pepper and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020729-vegan-cacio-e-pepe"}