{"@context": "http://schema.org", "@type": "Recipe", "name": "Japanese-Style Tuna Noodle Salad", "description": "Here’s a simple udon salad I picked up from the chef and entrepreneur Bart van Olphen, who elevates canned tuna to the heights of deliciousness. Van Olphen dresses the noodles in what he calls wafu dressing, which translates roughly as Japanese-style: a sweet-salty vinaigrette of soy, sesame oil, mirin and rice vinegar. I add a little sweet miso for texture and taste, and increase the amount of seaweed in the salad as well. Garnish with sesame seeds or furikake, the Japanese seasoning blend, and you have a superior tuna casserole. It is as good served cold as hot.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2020/03/22/magazine/22mag-eat/22mag-eat-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, noodles, salads and dressings, seafood", "keywords": "main course, scallion, seaweed, sesame oil, sesame seeds, soy sauce, tuna", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 579}, "recipeIngredient": ["1/4 cup cut dried wakame seaweed", "8 ounces dried udon noodles (or whatever noodles you have on hand)", "1 to 2 tablespoons furikake or sesame seeds", "10 to 12 ounces tuna in oil, drained", "2 scallions, trimmed and thinly sliced", "2 tablespoons sesame oil", "2 tablespoons canola oil", "2 tablespoons rice wine vinegar", "1 tablespoon mirin", "1 tablespoon soy sauce", "1 teaspoon sweet miso"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil over high, and set the wakame in a small bowl. Once the water comes to a boil, ladle or pour enough over the wakame to cover it by 2 inches; let the wakame soak for 10 minutes. Transfer the wakame to a colander to drain and cool; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the wakame soaks, cook the noodles according to the package instructions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the dressing: In a measuring cup or bowl, whisk to combine the sesame oil, canola oil, rice wine vinegar, mirin, soy sauce and miso; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet, lightly toast the sesame seeds, if using, over medium-low heat until fragrant; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the cooked noodles in the colander, then transfer to a wide, shallow serving bowl. Add the wakame and about 3/4 of the dressing, and toss to coat. Divide the noodles among 4 bowls. Top each portion with tuna, drizzle with the remaining dressing, then sprinkle with the scallions and furikake or sesame seeds. Serve hot, cold or anywhere in between."}], "link": "https://cooking.nytimes.com/recipes/1020939-japanese-style-tuna-noodle-salad"}