{"@context": "http://schema.org", "@type": "Recipe", "name": "Peppermint Stripe Cookies", "description": "Inspired by a series of <a href=\"https://www.artic.edu/artworks/155990/study-for-cite-brushstrokes-cut-into-twenty-squares-and-arranged-by-chance\">brushstroke paintings</a><span> by Ellsworth Kelly, these sugar cookies are meant to be lined up in a tight grid, painted with bold red stripes and arranged randomly. To paint on cookies, they must be first coated with royal icing and allowed to dry, preferably overnight. Luster dust and petal dust, colored powders used in cake decorating, are mixed with peppermint extract (or lemon extract, if you prefer) as a medium. (The dusts are available from cake-decorating stores, craft stores or online.) Make sure the peppermint extract you use is primarily alcohol, which evaporates immediately, leaving the pigment behind, and not primarily peppermint oil, which might stain the cookies. Flat, soft art brushes work best to apply the color, and a plastic paint tray with wells is best for mixing them.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/11/27/dining/ss-peppermint-cookies/merlin_163737039_887f876e-3127-4a9c-8590-72d919233775-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 2 dozen cookies", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars", "keywords": "confectioners' sugar, egg whites, peppermint extract, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 574}, "recipeIngredient": ["2 cups/245 grams unsifted confectioners’ sugar, plus more if needed", "2 egg whites (or 2 tablespoons meringue powder and 4 tablespoons water)", "A few drops of glycerin, if desired to create more of a sheen (optional)", "1 <a href=\"https://cooking.nytimes.com/recipes/1020651\">recipe Basic Sugar Cookies</a>, dough flavored with 1/2 teaspoon peppermint extract (omit the vanilla extract), cut into 3-inch squares and cooled", "Red and pink petal dust and luster dust"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the royal icing: In the bowl of a stand mixer fitted with the whip attachment, combine the confectioners’ sugar, egg whites and glycerin, if using. Combine on low speed, then raise speed to high and beat until stiff peaks form, about 5 minutes. Remove bowl from mixer, and test some of the royal icing on a cookie: If it doesn’t spread out to a smooth finish within 10 seconds, it’s too thick. Add 1 to 2 tablespoons water as needed to thin the mixture, whipping it by hand using the whip attachment. If the royal icing runs off the edge of the cookie, it’s too thin, so you’ll need to whisk in more sugar to thicken. You should have 1 1/2 cups royal icing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a small airtight container and refrigerate. It can be left out for 1 or 2 days, but you’ll need to refrigerate for longer storage. (The icing will keep, refrigerated, for several weeks.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Decorate the cookies: Pour the royal icing into a wide bowl. (The icing can be used cold, but it may separate, so it needs to be whisked, and may need to be thinned out with water or thickened with confectioners’ sugar.) Holding a cookie by the edges, with the top-side down, dip into the icing, moving the cookie around a bit to make sure the icing coats the whole surface. Gently shake the cookie from side to side to let the excess icing drip off."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a small offset spatula to stop the flow of icing, gently scrape cookie against edge of bowl, and flip the cookie over. Use the spatula to spread the icing to pop any air bubbles, and make sure it goes all the way to the edges. It should quickly smooth out on its own. If not, thin it out a bit until it does. Use your fingers to wipe away any icing on the outside edges. Repeat with all the cookies. Place on a cooling rack set over a parchment- or wax paper-lined baking sheet to dry completely, preferably overnight (or at least 4 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When dry, set up the cookies on a baking sheet or other flat surface in four rows of five cookies (you may have a few extra cookies), so they are abutting one another with no spaces. Mix the petal dust and luster dust with enough peppermint extract to make a very loose “wash” and, using brushes of different widths, make continuous brushstrokes in a few different widths across the entire surface. If you run out of pigment as you’re brushing, dip the brush again, and continue the line, allowing the brush texture to show in places. When dry, rearrange the cookies on a platter so the lines no longer match up. Cookies will keep in an airtight container for up to 2 weeks."}], "link": "https://cooking.nytimes.com/recipes/1020646-peppermint-stripe-cookies"}