{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Ragù With Fennel", "description": "This is a simplified riff on a popular recipe that the food editor Andy Baraghani developed for Bon Appétit magazine. It’s a velvety ragù that relies on chicken thighs, bacon and onions for flavor. It takes a couple of steps — browning the chicken, letting it cool after it braises and then shredding it — but it is not too challenging for a weeknight. The recipe is versatile. Over egg noodles, it serves six for dinner, but it can also make a nice dinner for two or four. The leftovers freeze well, or can turn into a filling for hand pies, which are terrific tucked into lunchboxes the next day.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2019/09/25/dining/23lunchrex1/merlin_160763217_e6d0be5a-8dec-4af8-9150-208889ef2d29-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, poultry, sauces and gravies", "keywords": "bacon, chicken thighs, fennel, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 305}, "recipeIngredient": ["2 tablespoons olive oil", "6 ounces bacon, thinly sliced crosswise", "6 bone-in chicken thighs (about 1 3/4 pounds)", "Kosher salt", "1 medium onion, finely chopped (about 1 cup)", "1 bulb fennel, cored and finely chopped", "6 sprigs fresh thyme", "1/2 cup dry white wine", "Pasta (optional)", "1/2 cup whole milk", "Ground black pepper", "2 tablespoons unsalted butter", "1/2 cup grated Parmesan, plus more for serving", "2 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the oil in a wide saucepan or deep skillet that will fit six thighs snugly and turn the heat to medium. Add the bacon and cook it until it’s crisp, 5 to 6 minutes, then, using a slotted spoon, transfer it to a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the chicken generously with salt. Turn the heat to medium-high and add the chicken, skin-side down, to begin to brown. After 3 or 4 minutes, turn it and cook for another 3 minutes. Transfer the chicken to a plate and pour off all but 3 tablespoons of the fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion and fennel and sprinkle with 1/2 teaspoon salt. Cook, stirring occasionally, until the vegetables are soft and just starting to turn golden, 6 to 7 minutes. Add the thyme and cook for another minute or so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in wine and simmer, stirring and scraping up any browned bits in the bottom of the pan. Reduce the wine by half, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the bacon and then the chicken with any accumulated juices, skin-side up, keeping the thighs in a single layer. Pour in enough water to almost cover the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a simmer and then turn the heat down so the liquid is bubbling very gently. Partially cover with a lid, setting it so some steam can escape. Cook until the chicken is tender, about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken to a plate and set aside to cool. Once you can handle it, remove the bones and skin and shred the chicken by hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you are serving the ragù over pasta, get your water going: Bring a large pot of salted water to a boil. Cook the pasta according to package directions, reserving 1 cup pasta water before draining."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add milk to the pan and turn the burner to medium-high. Cook, stirring occasionally to prevent sticking, until sauce is nearly reduced by half and slightly thickened, 10 to 12 minutes. Add the shredded chicken back to the pan and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the butter, then the Parmesan. If serving over pasta, add some of the starchy pasta water if the sauce seems too thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the parsley, and toss sauce with the pasta, if using. Pass more Parmesan at the table."}], "link": "https://cooking.nytimes.com/recipes/1020476-chicken-ragu-with-fennel"}