{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Oven-Fried Rice With Gochujang and Fried Eggs", "description": "This crunchy, tasty, not-really-fried rice gets a big umami punch from gochujang, the fermented Korean red-pepper paste that’s worth keeping in your fridge to perk up all sorts of dishes. As with any fried rice, you can add raw or cooked vegetables according to what you have on hand (though you’ll want to add cooked vegetables a little later in the cooking process). If you don’t have brussels sprouts, you could use any type of cabbage. Broccoli or cauliflower would be great substitutes for broccolini, and butternut squash can replace the carrots. The fried egg on top makes it feel like a more substantial meal, but you can leave it out for a lighter dinner. If you are a vegetarian, leave out the sausage, or add some smoked tofu. The dish is endlessly customizable.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/10/04/dining/ss-fried-rice/ss-fried-rice-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, weeknight, grains and rice, vegetables", "keywords": "broccolini, brown rice, brussels sprouts, carrot, gochujang, sausage, shiitake, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 422}, "recipeIngredient": ["1 1/2 cups uncooked short-grain brown rice, or 4 cups cooked, chilled white rice", "2 tablespoons neutral oil, such as vegetable, canola or grapeseed oil", "2 links turkey or pork sausage (about 6 ounces total), removed from casings", "2 carrots, peeled and sliced into 1/4-inch-thick coins", "4 scallions, sliced, green and white parts separated", "1/4 pound fresh shiitake mushrooms, stemmed and sliced", "1/4 pound brussels sprouts, thinly sliced (about 1 1/2 cups)", "2 large stalks broccolini, chopped (about 1 cup)", "Kosher salt", "1 tablespoon gochujang (Korean red-pepper paste)", "2 tablespoons low-sodium tamari or soy sauce", "4 fried eggs, for serving (optional)", "Dark sesame oil, for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using uncooked rice, combine the rice and 2 1/2 cups water in a small, deep saucepan and bring to a boil. Reduce the heat to a simmer, cover and cook until all the water has been absorbed, 35 to 40 minutes. Let stand 10 minutes, covered, then spread out on a large baking sheet to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. Add 1 tablespoon neutral oil to a large rimmed baking sheet, and add the sausage. Cut it into smaller pieces right on the baking sheet. Transfer to the oven to cook, 5 minutes. Using a wooden spoon, break the sausage into smaller pieces again, then cook until no longer pink, 2 to 3 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the carrots, scallion whites, mushrooms, brussels sprouts and broccolini to the sheet pan, stir well to coat with the oil, and sprinkle lightly with salt. Cook until the vegetables have wilted, about 10 minutes, stirring halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, whisk together the gochujang, tamari and remaining 1 tablespoon neutral oil in a large bowl. Add the cooked rice and stir until evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the baking sheet from the oven. Add the rice, stirring to combine with the vegetables, then press the mixture down with the back of a spatula. Return to oven and cook until rice is getting crisp on the bottom, 20 to 25 minutes, stirring once about halfway through and pressing down again. (If serving with <a href=\"https://cooking.nytimes.com/guides/18-how-to-make-eggs\">fried eggs</a>, begin cooking them about 5 minutes before the rice is done.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide oven-fried rice among plates or bowls and top each portion with a fried egg, if using. Drizzle with sesame oil, sprinkle with the scallion greens and serve immediately."}]}