{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Parmesan Eggs", "description": "How can you make runny-yolked fried eggs even better? Give them edges of crisp, salty Parmesan. The addition takes just a few extra minutes and adds an incredible layer to a dish that’s already deeply lovable. Make sure to skip preground Parmesan here: You’ll want to shred the cheese yourself on the largest holes of your grater. And use a nonstick skillet or well-seasoned cast-iron pan to fry the eggs. They may never come off a regular pan. Eat them alone, lay them over asparagus, or use them to top <a href=\"https://cooking.nytimes.com/recipes/1020276-crispy-parmesan-eggs-with-radicchio-and-pea-salad\">a sharp, lemony salad</a>. When something’s this perfect, it’s hard to go wrong however you serve it.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/06/19/dining/14appe3/14appe3-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, one pot", "keywords": "eggs, parmesan, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 316}, "recipeIngredient": ["1 teaspoon extra-virgin olive oil", "1/2 cup coarsely grated (not ground) Parmesan", "4 eggs", "Kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush 1 teaspoon olive oil into a thin layer on the bottom of a 10-inch nonstick or well-seasoned cast-iron skillet and place over medium heat. Sprinkle 1/2 cup Parmesan in an even layer covering the bottom of the pan. Cook for 2 minutes until cheese begins to melt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crack eggs onto cheese, then cover pan and cook until eggs are starting to set but are not cooked through, 2 to 3 minutes. Uncover and turn heat to medium-high to finish cooking eggs for another 1 to 2 minutes, until edges are crisp and golden brown. Make sure the cheese doesn’t get too brown; if it goes past light golden, turn down heat. To serve, season eggs with salt and pepper to taste."}], "link": "https://cooking.nytimes.com/recipes/1020369-crispy-parmesan-eggs"}