{"@context": "http://schema.org", "@type": "Recipe", "name": "Pastelitos (Guava and Cream Cheese Pastries)", "description": "In Havana — and in Cuban neighborhoods across the U.S. — pastry shops make many types of cakes and cookies, but the best-sellers are always the pastels and pastelitos, flaky pastries filled with meat, cheese, coconut custard or guava jam. According to “Paladares: Recipes from the Private Restaurants, Home Kitchens, and Streets of Cuba” by Anya von Bremzen (Abrams, 2017), the shape of the pastel correlates with the filling: Triangular pastels are filled with guava paste and cheese, while rectangular ones are filled with just guava. Versailles, a Cuban restaurant in Miami, follows this rule, but at home, just make them rectangular, and add a swipe of cream cheese if desired. You can find guava paste in bricks at Latin American grocers, or swap in about 1/2 cup jam or preserves for a nontraditional take.", "author": {"@type": "Person", "name": "Daniela Galarza"}, "image": "https://static01.nyt.com/images/2020/03/25/dining/dg-pastelitos/merlin_170458821_b5245c9b-4c00-4433-8d18-d41381b7964e-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 pastelitos", "recipeCuisine": "cuban", "recipeCategory": "snack, finger foods, pastries", "keywords": "cream cheese, egg, guava paste, puff pastry, sugar, dessert", "aggregateRating": null, "recipeIngredient": ["1 large egg", "Pinch of kosher salt", "2 sheets frozen puff pastry (about 8 ounces each), defrosted and refrigerated", "All-purpose flour, for rolling", "5 1/2 ounces/160 grams guava paste, cut into 8 even, rectangular slices, or 1/2 cup strawberry jam or other fruit jam or preserves", "3/4 cup/170 grams cream cheese, softened at room temperature (optional)", "2 tablespoons granulated or turbinado sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Line a baking sheet with parchment paper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare an egg wash: In a small bowl, beat the egg with a pinch of salt and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll one sheet of puff pastry into an 8-by-12-inch rectangle roughly the size of a standard sheet of paper. (Keep the other puff pastry sheet in the refrigerator.) Dust off any excess flour and lay the rolled pastry sheet on the parchment-lined baking sheet. Dip a pastry brush into the egg wash, and paint a line in lengthwise along the center of the pastry sheet, followed by three crosswise lines, evenly spaced, forming a grid of 8 rectangles, each approximately 3 inches wide and 4 inches long. Brush edges with egg wash. Lay a slice of guava paste in the center of each rectangle (or dot with dollops of jam or preserves, if using). Spread some of the cream cheese, if using, on top of the guava paste (about 1 1/2 tablespoons cream cheese per pastry)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the second sheet of puff pastry from the refrigerator, and roll it out into an 8-by-11-inch rectangle, dusting with flour as needed to prevent sticking. Lay the second sheet of puff pastry on top of the first. Using the side of your palm, press around and between the mounds of filling, pressing out any excess air, and to glue the top pastry to the bottom, creating 8 even, rectangular pockets. Paint the top sheet of puff pastry with egg wash. Sprinkle the surface with sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a knife or bench scraper, cut out and separate the 8 pastelitos following the original grid in between the indentations in the dough. Trim the perimeter to neaten the rectangles. The dough should still be cool to the touch; if it is warm, return the pastelitos to the refrigerator on the baking sheet for 10 minutes to firm up before baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake pastelitos until puffed and golden brown, about 15 minutes. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1020966-pastelitos-guava-and-cream-cheese-pastries"}