{"@context": "http://schema.org", "@type": "Recipe", "name": "Mashed Sweet Potatoes With Maple and Brown Butter", "description": "This recipe is a grown-up take on sweet potatoes with brown sugar and marshmallows. A generous swirl of browned butter and maple syrup give the potatoes an earthy sweetness and great depth of flavor, while salted, toasted pecans sprinkled on top add a savory crunch. To save time on Thanksgiving, toast the pecans and make the brown butter up to a day in advance. Simply store the pecans in an airtight container, and the brown butter in the refrigerator. (Gently melt the butter in the microwave before using.)", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2019/10/30/dining/lh-mashed-sweet-potatoes/merlin_163577667_e1b268ed-1f3c-4a33-80d6-f158bd3c25c7-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, vegetables", "keywords": "fall, winter, maple syrup, pecan, sweet potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 30}, "recipeIngredient": ["4 pounds sweet potatoes, peeled and cut into 1-inch cubes", "3/4 cup raw pecans (optional)", "2 teaspoons kosher salt, plus more to taste", "10 tablespoons unsalted butter (1¼ sticks)", "1/2 cup whole milk", "3 tablespoons maple syrup, plus more to taste", "1/2 teaspoon black pepper, plus more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Add the sweet potatoes and cook, uncovered, stirring occasionally, for about 15 to 20 minutes, until very tender when pierced with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toast the pecans (optional): Place the pecans in a medium sauté pan. Cook over medium-low heat, tossing often, for 3 to 5 minutes, until lightly toasted. Transfer to a cutting board, and roughly chop. Sprinkle generously with salt, and set aside. Wipe out the pan with a paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pan, melt the butter over medium heat. Cook, watching carefully and stirring occasionally with a silicone spatula, until brown bits appear and the butter gives off a nutty aroma, about 3 minutes. Remove from the heat immediately. Carefully pour the melted butter into a small heatproof bowl, scraping the pan with a spatula to get all of the brown bits. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the cooked potatoes, and add them to the bowl of a stand mixer fitted with the paddle attachment. Add the milk, 3 tablespoons maple syrup, 2 teaspoons salt and pepper and mix on medium-low speed until the potatoes are creamy and smooth. Add the reserved brown butter and mix until just incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the potatoes to a shallow serving bowl, sprinkle with the reserved pecans, and drizzle with maple syrup. Serve warm. (The potatoes may be kept warm, covered, in a low oven for up to 30 minutes. Add the pecans just before serving.)"}]}