{"@context": "http://schema.org", "@type": "Recipe", "name": "Asaro (Yam and Plantain Curry)", "description": "This recipe is an adaptation of asaro, the Yoruba word for a dish of starchy root vegetables simmered in a seasoned tomato- and chile-based sauce. Regional versions of asaro are served all year round across the south of Nigeria and in other parts of West Africa. Traditionally, the dish is made with the West African yam, but you can also use white or purple taro root or unripe plantains. Here, firm, green plantains are combined with white yams in a sauce rich with caramelized shallots, garlic and ginger. There is a slight but welcome heat from a single red habanero dropped in whole to infuse the stew. Coconut milk and an optional spoonful of red palm oil — a floral, slightly smoky oil that is pressed from the fruit of oil palm trees — round out the flavors, and hearty greens cut the richness. Serve topped with crunchy shallots, fresh herbs and a wedge of lime.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2020/05/06/dining/ym-yam-curry/merlin_170459241_3e1c91ec-0292-428e-88b3-cfcc70140079-mediumThreeByTwo440.jpg", "totalTime": "PT50M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, soups and stews, vegetables, main course", "keywords": "canned tomatoes, coconut milk, ginger, plantain, shallot, turmeric, yams, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1616}, "recipeIngredient": ["1/4 cup neutral oil, such as canola or grapeseed", "4 medium shallots, peeled and thinly sliced (about 1 cup)", "Kosher salt", "4 garlic cloves, smashed and peeled", "1 (2- to 3-inch) piece fresh ginger, grated (about 2 tablespoons)", "2 teaspoons ground turmeric", "2 tablespoons tomato paste", "1 whole red habanero or Scotch bonnet chile, pierced all over with a knife", "1 (14-ounce) can whole peeled tomatoes with their juices", "1 1/2 pounds white or orange yams, peeled and cut into 1 1/2-inch pieces", "2 green (unripe) plantains (about 1 pound total), peeled and cut into 1 1/2-inch pieces", "1 (13-ounce) can full-fat coconut milk", "1 tablespoon red palm oil (optional)", "4 cups julienned hearty greens, such as dandelion greens, collards or lacinato kale, tough stems removed", "1/4 cup fresh basil leaves, torn", "1/4 cup fresh cilantro leaves and tender stems", "1 lime, sliced into wedges for squeezing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a medium pot, large saucepan or Dutch oven over medium. Pour in the neutral oil, add the sliced shallots and cook, stirring frequently, until shallots are caramelized and golden brown, about 5 minutes. Remove shallots from the oil and allow to drain on paper towels or a cooling rack. Season with salt and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain all but 2 tablespoons of the cooking oil out of the pot. (Reserve extra oil for another use.) Over medium-low heat, add the garlic, ginger and turmeric to the pot and sauté until softened and fragrant, about 2 minutes. Add the tomato paste and cook, stirring constantly, for an additional 2 minutes or until it begins to stick to the bottom of the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop in the chile and add the whole peeled tomatoes with their juices, crushing the whole tomatoes with your hands as they go in. Stir to combine ingredients and dissolve the tomato paste, then add 3 cups water and bring to a boil over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once boiling, season with salt, reduce heat to medium, add the yams and simmer until the yams are just beginning to soften, about 10 minutes. Add the plantains and cook until both are tender but hold their shape, and the liquid is slightly reduced and thickened, 15 to 18 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the coconut milk and red palm oil, if using, season with more salt and let simmer for another 10 minutes. Add the greens and cook until tender, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, remove and discard the cooked chile. Ladle the curry into bowls, top with the caramelized shallots, a scattering of basil and cilantro, and several squeezes of lime juice."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Yewande Komolafe Makes Nigerian Yam and Plantain Curry", "description": "Yewande Komolafe is a recipe writer who grew up in Lagos and a regular recipe developer for NYT Cooking. Here, she’s making her Yam and Plantain Curry With Crispy Shallots, a take on Nigerian asaro, the Yoruba word for a dish of starchy root vegetables simmered in a seasoned tomato- and chile-based sauce.", "thumbnailUrl": "https://static01.nyt.com/images/2020/05/06/dining/ym-yam-curry/merlin_170459241_3e1c91ec-0292-428e-88b3-cfcc70140079-mediumThreeByTwo440.jpg", "uploadDate": "2020-06-09T14:16:05.000Z", "duration": "PT6M34S", "transcript": "I'm not sure about this, but I think originally, it took like the bits and pieces and the ends of like root vegetables and cooked them in a sauce and that's how the dish was created. This is something my mom told me. So I don't know how true this is. But it sounds like a compelling story. Hi, I'm you on day I'm Yewande Komolafe. A Recipe Developer and soon to be Cookbook Author. So I'm making an adaptation of this dish called Asaro. Asaro is a dish of a starch, a root vegetables cooked in a sauce, a seasoned sauce. My version I'm calling it a yam and plantain curry and so it takes the component into the starchy vegetable. It takes the season sauce and combines that. But this is like a brothy version. My life has been little bursts of, it's kind of like a conglomeration of a bunch of different things. And so when I cook, I draw from my experiences growing up in Nigeria. I draw from my background as a chef. I draw from living in New York City. And to all of those feed into the food that I make. To be honest, I never peel ginger. Yeah, I was just thinking, why am I doing this? I grew up with an awareness of food. Pretty much the things that we ate were from our backyard. So my earliest memories of cooking are with my mom. I think of her as giving in that way, where she didn't hide the kitchen from me or like turn me away. She saw my interest and called me in. My mom also worked as a Recipe Developer for Cadbury's Chocolates. Through her, I gained an understanding of ingredients. Like I remember her just reading the back of if we got a box of cereal she would read the back to see what was in it. I'm choosing this particular potato because they're the most similar to the African yams that I could find. They're a little sweeter, but I do like the sweetness. The sweet potatoes here don't require as much liquid as the yams in Nigeria. And so it just takes adjusting and so there's a lot of adaptation in the recipes that I cook here. So the recipe calls for green plantains, which are starchier, they're denser. They hold up in a soup better. You can also use slightly yellow plantains. I like to make a slit and just, they're pretty easy to peel once you get under the skin. At the very core of my work in food is ingredient curiosity and ingredient discovery. I think that in my exploration of food here, even when I didn't realize that I was constantly looking for something that felt familiar to me and something that felt safe and something that reminded me of home. Food has been able to do that. And you know, I've moved around so much. But I think one consistent thing throughout my life has been like the food that I make or the food that I create. The chili goes in at this point. I poke some holes in it because you really just want a little bit of spice and you want the oils from the habaneros to infuse into the dish. Sometimes a question of authenticity comes up and people want to know how authentic my cooking is. And I laugh because I think it's you know the food that I cook is authentic to me and my experience. But is it authentically Nigerian. I don't know what that means. Food is authentic to whoever is cooking it and whoever...what that person has experienced. So I'm using dandelion greens for this recipe. Typically asaro doesn't necessarily have to have greens. It just depends on the taste and the palate of the person who's making it. I wanted to make this bright and vibrant and really fresh tasting as well. So that's why I'm adding greens to it. So it's just barely going in. You don't want it too soft and too soggy. These take not as much time to cook. These should take about 10 minutes to soften. So I was in Lagos doing some research for my cookbook. I'm writing a cookbook on Nigerian cuisine. Did a lot of cooking in my mom's kitchen. It's a different thing than cooking in my kitchen. You know when I wanted some coconut milk. I literally broke a coconut and graded it to get the milk out of it. There's a process of cooking there where I was using the whole ingredient, which was I guess that's how I grew up. But it's different from how I cook now. Now I go to Whole Foods and grab a can of coconut milk. But I guess that's all, that's part of the charm of Lagos to me. That's the that's the charm of Nigeria to me. So asaro as I know it, is much... it's a thicker version of this. So a lot less liquid, the starch from the yams and the plantains if you're using plantains would thicken up the soup and you wouldn't necessarily add coconut milk to like loosen it up. So this is the consistency you want. Food is something that creates space. It's a tool. You could choose to use that tool. However you want. And I've chosen to use it to remind me of the things that I cherish the great memories that I have of growing up in Lagos. You know it's something that I now introduce to my daughter as something that I grew up with. I live in Brooklyn, which is like so far away from Lagos. But it's something that I could give her. It's like a gift that I could give her that says this is where I'm from and this is where you're also from. And this is something that we share. The coconut milk, the plantains, all of those flavors like hanging out together, just remind me of home. I can't stop eating it. Food is a great way to bring people together. I don't know that it has all the answers to the questions that we have about why we live in the world that we do. But I think it's a gateway to conversation, which is that's enough for me.", "contentUrl": "https://vp.nyt.com/video/2020/06/09/86961_1_YK-Yam-Curry_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1020937-asaro-yam-and-plantain-curry"}