{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Olive Oil Cake With Orange Glaze", "description": "This golden cake makes a persuasive case for baking with olive oil; it is fragrant, peppery and not overly sweet, with an orange glaze that brings all the flavors together. The recipe is from Lior Lev Sercarz, a high-end spice vendor in New York City who says that oil is even better than butter, the favorite of American bakers, at amplifying flavors like citrus and spice. See Tip for his instructions on using whole spices.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2019/09/04/dining/30oilrex3/merlin_159456543_2b34d977-4d91-4aac-babf-4c7943794a8b-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, lunch, snack, cakes", "keywords": "dark rum, extra virgin olive oil, ground ginger, orange, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 324}, "recipeIngredient": ["Nonstick cooking spray", "1 3/4 cups/225 grams all-purpose flour", "1 cup/200 grams granulated sugar", "2 teaspoons ground ginger", "1 1/2 teaspoons baking powder", "1 1/4 teaspoons baking soda", "3/4 teaspoon ground fennel, cardamom or coriander (see Tip)", "1/2 teaspoon kosher salt", "1/4 teaspoon freshly ground black pepper (see Tip)", "3/4 cup/180 milliliters extra-virgin olive oil", "2/3 cup/160 milliliters whole milk", "2 large eggs", "2 tablespoons dark rum", "Freshly grated zest of 1 orange plus 2 tablespoons orange juice", "1/2 cup/60 grams confectioners’ sugar", "2 tablespoons orange juice, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Heat the oven to 375 degrees. Coat a loaf pan with nonstick cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together the dry cake ingredients, including ground spices. In another bowl, whisk the oil, milk, eggs, rum, orange zest and juice until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the wet ingredients into the dry. To prevent clumps, stir together starting from the center of the bowl, gradually drawing in the dry ingredients. Mix just until smooth. The batter will be thick. Pour into the prepared loaf pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake in the center of the oven for 1 hour, rotating after 30 minutes. When done, the cake will be just firm and dry on top and a tester inserted into the center will come out clean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the glaze: In a measuring cup with a pouring spout, whisk together the confectioners’ sugar and 2 tablespoons orange juice until smooth. The texture should be runny; add more orange juice if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the cake cool in the pan on a wire rack for 10 minutes, then turn out. While it is still warm, drizzle the glaze over the top, making messy, Jackson Pollock-style zigzags by moving the cup back and forth over the cake. Let cool completely to set."}], "link": "https://cooking.nytimes.com/recipes/1020430-spiced-olive-oil-cake-with-orange-glaze"}