{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Fish With Lemon, Sesame and Herb Breadcrumbs", "description": "Trout is an ideal weeknight dinner because its thin fillets cook in minutes. All it really needs is some butter and lemon, but an herb-panko mixture adds freshness and crunch. The breadcrumb mixture is inspired by za’atar, a spice blend that includes sesame seeds, dried herbs and tart-citrusy sumac. Using fresh thyme and oregano instead of dried herbs, and lemon zest in place of dried sumac yields a brighter final dish. If you want to use dried za’atar, swap in 3 tablespoons of the blend for the first four ingredients. Serve the fish alongside rice, a green salad, boiled potatoes or <a href=\"https://cooking.nytimes.com/recipes/1019559-olive-oil-braised-chickpeas-and-broccoli-rabe\">braised chickpeas</a>. The fish roasts in about the same time as string beans, broccolini or snap peas would, so you can also roast vegetables on a second baking sheet while the fish cooks.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/12/20/dining/as-sheet-pan-fish-with-crisp-breadcrumbs/as-sheet-pan-fish-with-crisp-breadcrumbs-articleLarge-v3.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, seafood", "keywords": "butter, lemon, oregano, panko, thyme, toasted sesame seed, trout, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 54}, "recipeIngredient": ["2 tablespoons toasted sesame seeds", "1 tablespoon fresh thyme leaves", "1 tablespoon fresh oregano leaves, coarsely chopped", "2 teaspoons lemon zest, lemon cut into wedges for serving", "Kosher salt and black pepper", "1 cup panko bread crumbs", "4 tablespoons unsalted butter, melted", "4 (4 to 6-ounce) trout fillets or 2 whole butterflied trout"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. In a medium bowl, combine the sesame seeds, thyme, oregano, lemon zest, 3/4 teaspoon salt and a few grinds of pepper. Rub the mixture between your fingers until the herbs are bruised and fragrant. Stir in the bread crumbs and butter until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the trout with salt and pepper and place on a parchment-lined baking sheet, skin-side down. Spoon the bread crumbs evenly over the fish and bake until the fish is opaque and the bread crumbs are golden, 10 to 12 minutes. Serve with lemon wedges alongside."}], "link": "https://cooking.nytimes.com/recipes/1020706-roasted-fish-with-lemon-sesame-and-herb-breadcrumbs"}