{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish Larb", "description": "Larb, a boldly flavored Thai dish, often combines <a href=\"https://cooking.nytimes.com/recipes/1012588-thai-larb-gai-chicken-with-lime-chili-and-fresh-herbs\"><span>ground chicken</span></a>, <a href=\"https://cooking.nytimes.com/recipes/1019406-herby-pork-larb-with-chile\"><span>ground pork</span></a> or other ground meat with dried chile, scallions, shallots, fish sauce, lime, fresh herbs and nutty toasted rice, which you can make yourself or find at Asian markets. The dish also works with crumbled tofu, mushrooms, cauliflower or fish. In this quick-cooking fish version, fish fillets are pan-seared until cooked through, then broken into bite-sized pieces and tossed with the rest of the ingredients. Serve with sticky rice, small wedges of salted green cabbage, cucumber spears or lettuce leaves.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/12/10/dining/as-fish-larb/as-fish-larb-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, weekday, seafood", "keywords": "cilantro, fish, fish sauce, jasmine rice, lime, mint, red onion, red pepper flakes, scallion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 94}, "recipeIngredient": ["1 1/2 pounds firm fish fillets, like salmon, striped bass, snapper or haddock", "Kosher salt and black pepper", "1 tablespoon canola oil, plus more as needed", "1 tablespoon fish sauce, plus more as needed", "1 teaspoon granulated sugar", "3 tablespoons raw (uncooked) jasmine rice (or 2 tablespoons store-bought toasted-rice powder)", "1 small red onion or 1 large shallot, thinly sliced (about 1/2 cup)", "2 teaspoons red-pepper flakes", "1/2 cup fresh cilantro leaves, coarsely chopped", "1/4 cup fresh mint leaves, torn if large", "2 or 3 scallions, thinly sliced (about 1/4 cup)", "3 tablespoons lime juice (from about 2 limes), plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat fillets dry and season on both sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large (12-inch) nonstick skillet over high. When the pan is hot, add the oil. Working in batches, if necessary, cook the fillets skin-side down. (To prevent splattering, lay the portion of the fillet closest to you into the pan first, so that any oil will splatter in the direction away from you as you set down the rest of the fillet.) Press down on the fish with a spatula for 20 seconds, then lower heat to medium and cook until golden, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully flip fillets and cook until cooked through, about 90 seconds. (Time will vary depending on the thickness of the fish.) Add additional oil if needed for a second batch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the fish to a cutting board. Remove the skin if desired, then break the fish into bite-size chunks with a knife or fork. Transfer to a serving bowl and stir in the fish sauce and sugar. Set aside to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the fish cools, make the toasted rice powder, if using raw jasmine rice: Wipe out the skillet and return it to medium heat. Toast the rice, stirring frequently, until it starts to smell nutty and turns golden, 4 to 5 minutes. Transfer to a mortar and pestle or spice grinder, cool slightly, then process into a powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the red onion and red-pepper flakes to the fish and stir gently. Add the cilantro, mint, scallions and lime juice and stir gently to combine. Sprinkle with the toasted rice powder and season to taste with more fish sauce and lime juice as needed."}]}