{"@context": "http://schema.org", "@type": "Recipe", "name": "Nishime (Dashi-Braised Vegetables With Chicken)", "description": "Often cooked for the New Year in Japan, nishime is an elegant kind of nimono, a Japanese term that literally means things — vegetables, fish or meat — simmered in seasoned dashi. Dashi can be any broth, but here it’s flavored simply with kombu (kelp). This version is from the chef Sydne Gooden, who has brightened the color of her great-grandmother’s nimono recipe by adding kabocha and purple sweet potato to what is usually a very brown dish. While she skips cutting the carrots and lotus roots into fussy flower shapes, she insists on cooking each vegetable consecutively in the same dashi (rather than throwing them all in together, like everyday nimono), so that each one keeps its distinct shape and color. By the end, the dashi has concentrated and taken on the flavors of all the ingredients. It’s spooned over chicken thighs and the perfectly cooked vegetables.", "author": {"@type": "Person", "name": "Hannah Kirshner"}, "image": "https://static01.nyt.com/images/2019/12/25/dining/25OSECHIREX3/merlin_166106808_dbc51925-dd6d-43dc-86cd-2842825a2ff9-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "japanese", "recipeCategory": "dinner, poultry, vegetables", "keywords": "bamboo shoots, chicken thigh, daikon, kabocha, purple potato, shiitake, taro root, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 47}, "recipeIngredient": ["2 (5-inch-long) pieces kombu (about 1 ounce) (see Note)", "Fine sea salt", "2 bone-in, skin-on chicken thighs (about 1 pound), deboned", "1 medium daikon (about 1 pound)", "6 to 8 small satoimo (Japanese taro) (about 1 pound)", "1/2 teaspoon white vinegar", "1/2 pound lotus root", "1 large carrot", "1/2 kabocha squash (about 1 pound), seeded", "10 fresh shiitake mushrooms (about 6 ounces)", "1 fresh or canned bamboo shoot (about 1 pound)", "1/2 pound purple sweet potato", "1/4 cup usukuchi shoyu (see Note)", "2 tablespoons mirin", "2 tablespoons granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, soak kombu in 4 cups water until the water is flavorful, at least 2 hours (or overnight)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a plate, salt the chicken generously on both sides; set aside in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the vegetables, and keep each in its own separate container: Peel daikon and cut into 1/2-inch-thick rounds. (If the daikon is very large, halve it lengthwise, then cut it into 1/2-inch-thick slices.) Scrub satoimo, then peel using a paring knife. (Satoimo that are smaller than a golf ball can be left whole; larger ones should be halved or quartered.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vinegar and 2 cups water to a bowl. Peel lotus root and slice into 1/4-inch-thick rounds, adding them to the acidulated water. Peel carrot, then cut into rangiri: With your knife held across the carrot at a diagonal, cut it into 1-inch chunks, rolling the carrot a quarter turn between each cut so you end up with irregular, multifaceted pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the kabocha into four wedges, then cut each wedge crosswise into 3/4-inch-thick pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove shiitake stems; carve out thin slivers from the top of the caps to make an asterisk shape (about the diameter of a quarter)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut bamboo shoot lengthwise into 1 1/2-inch-wide spears, then cut each spear crosswise into 1/2-inch-thick pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel purple potato, then cut into rangiri. (If it’s much fatter than a carrot, slice it into spears first.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the kombu from the dashi, saving the kombu for another use. Add usukuchi shoyu, mirin, sugar and 1 teaspoon salt to the kombu dashi and bring to a boil over high heat. Lower the heat to keep the liquid at a simmer. Add chicken and simmer until barely cooked through, about 15 minutes. Cut chicken into 1-inch pieces, and set aside. Skim the dashi."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer each vegetable consecutively in the same dashi, cooking until each is tender but retains its shape, then transfer each vegetable back to its container. Cook the daikon about 20 minutes; satoimo 15 to 20 minutes; lotus root (discarding the acidulated water) 8 to 10 minutes; carrot 5 to 7 minutes; kabocha 12 to 15 minutes; shiitake and bamboo shoots (together), loosely covered if the dashi is low, 4 to 6 minutes; then finally the purple potato 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The remaining dashi will be concentrated, dark and glossy. Add the chicken, cover and remove from heat. Let stand for at least 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, transfer the chicken to a sheet pan, skin-side up, and brown under the broiler, 3 to 4 minutes. Arrange the vegetables and chicken on a platter, in odd-numbered groupings (for better luck and aesthetics). Spoon a little dashi over and serve at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1020735-nishime-dashi-braised-vegetables-with-chicken"}