{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn on the Cob With Coconut and Lime", "description": "Anyone avoiding dairy might notice that corn on the cob served at cookouts usually comes slathered with butter. This vegan alternative uses coconut oil to add richness, lime juice for a little acid, and finely chopped, toasted coconut chips for added texture. Mixing half of the chips into the oil helps them stick to the cob, which is smart because you’ll want them in every bite. If you can’t find coconut chips, toasted unsweetened coconut flakes will add a nutty flavor, but you won’t get the delightful crunch.", "author": {"@type": "Person", "name": "Emily Fleischaker"}, "image": "https://static01.nyt.com/images/2019/07/09/dining/ef-corn-on-the-cob-with-coconut-and-lime/merlin_157388769_254346f7-48fc-4076-85ce-bb3f710bda3f-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "appetizer, side dish, coconut flakes, coconut oil, corn, lime, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "recipeIngredient": ["4 ears fresh corn, shucked", "1 lime", "4 tablespoons coconut oil", "1/2 cup toasted unsweetened large coconut chips, finely chopped (or 3 tablespoons toasted unsweetened coconut flakes)", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your grill to medium-high. Grill corn, turning occasionally, until cooked through and lightly charred, 10 to 12 minutes. (Alternatively, add corn to a large pot of salted boiling water and cook for 5 to 7 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, zest the lime. Set aside the zest then cut the lime in half. Cut one half into four wedges and squeeze the remaining half into a small bowl. Stir the coconut oil and half the chopped coconut chips into the lime juice. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slather hot corn with coconut oil mixture and season with salt. Sprinkle with lime zest and remaining coconut chips. Serve with lime wedges alongside for squeezing."}], "link": "https://cooking.nytimes.com/recipes/1020341-corn-on-the-cob-with-coconut-and-lime"}