{"@context": "http://schema.org", "@type": "Recipe", "name": "Gravlax", "description": "I think of making my own gravlax — the Nordic sugar-salt cured salmon — as the gentle, blue-square cooking analog of an intermediate ski trail: It’s mostly easy, but requires some experience. While butchering a whole salmon and cold smoking what you’ve butchered are also exhilarating milestones in the life of an advancing home cook (both a little farther up the mountain and a little steeper on the run down), buying a nice fillet and burying it in salt, sugar and a carpet of chopped fresh dill for a few days is a great confidence-building day on the slopes, so to speak. The cured gravlax will last a solid five days once sliced, in the refrigerator. If a whole side of salmon is more than you need at once, the rest freezes very satisfactorily.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2020/02/23/magazine/23mag-eat/23mag-eat-articleLarge.jpg", "totalTime": "P5DT30M", "recipeYield": "10 to 12 servings (about 3 pounds)", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, seafood", "keywords": "dill, pumpernickel, salmon, shallot, sugar, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 207}, "recipeIngredient": ["1 side clean, fresh and fat Alaskan king salmon, skin on, pin bones removed, neatly trimmed of all undesirable bits of fat and tissue (about 3 to 3 1/2 pounds total), or 1 fat and gorgeous 2 1/2-pound fillet cut from the widest part of the body", "1/2 cup kosher salt", "1/2 cup granulated sugar", "1/4 cup finely ground black pepper", "2 bunches dill (about 4 ounces each), clean and dry, left intact (no need to pick fronds from stem), coarsely chopped (about 2 cups)", "1 cup unsalted butter (2 sticks), left at room temperature for an hour (not hard from the fridge yet not so warm as to be greasy)", "1 bunch dill (about 4 ounces), clean and dry, fronds removed from stems, fronds finely chopped (about 3/4 cup)", "1 medium shallot, peeled and finely minced", "3 tablespoons Dijon mustard", "Soft dark pumpernickel sandwich bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cure the salmon: Lay salmon skin-side down, flesh-side up in a glass or stainless-steel baking dish. (A large lasagna dish works well.) In a small bowl, toss together the salt, sugar and pepper until blended. Sprinkle the mixture over the salmon evenly, with abandon, until fully covered, as if under a blanket of snow. Use all of it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread all the chopped dill on top of the cure-covered salmon to make a thick, grassy carpet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay plastic wrap or parchment paper over the salmon to cover and press down, then place a heavy weight — such as a 2-gallon zip-top bag filled with water — on top, to weigh heavily on the curing fish. Refrigerate just like this, without disturbing, for 5 days, turning the salmon over midway through the cure — on Day 3 — then covering and weighting it again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, mix together the softened butter, dill, shallot and mustard until well blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove salmon from the cure, which has now become liquid, brushing off the dill with a paper towel, then set fillet on a cutting board."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a long, thin, beveled slicing knife tilted toward the horizon, slice salmon thinly, stopping short of cutting through the skin. Generally, you begin slicing a few inches from the tail end and you slice in the direction of the tail, moving your knife back, slice by slice, toward the fatter, wider belly portion of the fillet. The last slices are always hard to get. Once you have shingled the fillet, run your knife between skin and flesh, releasing all the slices, then transfer them to parchment until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the compound butter on bread, then drape sliced gravlax on top, and eat as open-faced sandwiches."}], "link": "https://cooking.nytimes.com/recipes/1020876-gravlax"}