{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffing-Stuffed Mushrooms", "description": "In this recipe, classic stuffed mushrooms become an excellent vegetarian Thanksgiving appetizer or side dish by replacing Italian bread crumbs with cornbread, and using traditional stuffing flavors like rosemary, celery seeds and poultry seasoning. Two tips for making these extra flavorful: Trim the mushroom caps a bit to provide more surface area for caramelization, and pre-roast them to reduce moisture and prevent them from getting soggy. You can turn these into a main dish by using about eight large portobello mushrooms instead of two-bite cremini mushrooms, and increasing the cooking time accordingly. If you’re lucky enough to have leftover Thanksgiving stuffing, you can use it in place of the cornbread mixture (you’ll need about 4 cups); just add two beaten eggs and grated Gruyère cheese to bind the mixture before piling it onto the mushrooms and roasting.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/10/23/dining/aw-stuffing-stuffed-mushrooms/merlin_162489666_dabb8ac3-e47a-4f54-8788-351b7199f729-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "24 mushrooms (6 to 8 servings)", "recipeCuisine": "", "recipeCategory": "dinner, lunch, finger foods, vegetables", "keywords": "appetizer, side dish, celery, cornbread, egg, gruyère, mushroom, rosemary, shallot, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 109}, "recipeIngredient": ["3 tablespoons olive oil, plus more for greasing pan", "24 large cremini mushrooms (about 1 1/4 pounds), each about 2 inches wide", "1/2 teaspoon garlic powder", "1/4 teaspoon onion powder", "Kosher salt and black pepper", "3 tablespoons unsalted butter", "2 small stalks celery, finely chopped (about 2/3 cup), plus 1 tablespoon minced celery leaves", "2 large shallots, minced", "3 garlic cloves, minced", "2 teaspoons finely chopped fresh rosemary", "1 teaspoon poultry seasoning", "1 teaspoon celery seeds", "6 ounces cornbread, crumbled into small pieces (about 2 loose cups)", "1 to 1 1/2 cups grated Gruyère or Emmental cheese", "4 tablespoons minced fresh parsley", "2 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees and lightly brush a large rimmed sheet pan with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using barely moist paper towels, wipe the mushroom stems and caps clean. Carefully tear off the mushroom stems, setting them aside in a medium bowl. Set each mushroom cap on its side and slice off the excess mushroom cap that curls over the gills. (The goal here is to create a flatter surface area so the mushrooms caramelize instead of steam, and so you can pile more stuffing on top.) Transfer the mushroom scraps to the bowl with the mushroom stems, then transfer the trimmed mushroom caps to the sheet pan, cut-side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the tops of the trimmed mushrooms with 3 tablespoons oil. In a small bowl, stir together the garlic powder, onion powder, 1/2 teaspoon salt and 1/2 teaspoon pepper; sprinkle the mixture over the tops of the mushrooms. Flip the mushrooms so they are cut-side down, and roast until they have released their liquid and are starting to caramelize, about 15 minutes. Remove sheet pan from heat, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the mushrooms roast, prepare the filling: Finely chop the mushroom stems and scraps or transfer them to a food processor and pulse until finely chopped. (You will have about 2 cups.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, melt the butter over medium-high heat. Add the chopped celery, shallots, garlic, rosemary, poultry seasoning and celery seeds. Season generously with salt and pepper, and cook, stirring, about 5 minutes. Add the chopped mushrooms, season with salt and pepper and cook over medium-high, stirring occasionally, until caramelized and tender, 4 to 5 minutes. Transfer vegetable mixture to a large bowl to cool, at least 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the vegetable mixture has cooled, stir in the cornbread, cheese, celery leaves and 3 tablespoons chopped parsley. Season generously with salt and pepper. Whisk the eggs together in a small bowl, then stir into the cornbread filling until combined. (Makes about 4 cups.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe the sheet pan clean, then brush again with olive oil to coat. Mound about 1 to 2 tablespoons filling into each mushroom cap, patting them gently without packing them tightly, then transfer to the sheet pan, spacing them evenly apart. Bake until mixture on top is warmed through, 10 to 15 minutes. Broil until browned in spots, 2 to 4 minutes. Let cool a few minutes, then transfer to a serving platter and sprinkle with remaining 1 tablespoon minced parsley to serve."}], "link": "https://cooking.nytimes.com/recipes/1020554-stuffing-stuffed-mushrooms"}