{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Caramelized Squash With Lemon and Hazelnuts", "description": "This ultimate sweet-and-salty squash recipe can be done with most hearty orange vegetables, like sweet potatoes or even carrots (no need to peel any of these). The vegetables are tossed simply with olive oil and something sticky, like maple syrup or honey, and roasted until tender and caramelized. To add some texture back into the mix, the vegetables are finished with toasted nuts and plenty of fresh lemon zest for some perkiness.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/11/13/dining/11Romanrex2/merlin_161933832_5984343d-2bd4-4dc0-8bed-4a2861da1ce3-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "dinner, vegetables", "keywords": "fall, winter, hazelnut, hot smoked paprika, maple syrup, winter squash, side dish, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 791}, "recipeIngredient": ["1 (3- to 4-pound) winter squash, such as kabocha, red kuri or butternut", "1/3 cup olive oil, plus more for drizzling", "1/4 cup maple syrup, plus more for drizzling", "1 tablespoon hot smoked paprika", "2 teaspoons red-pepper flakes", "Kosher salt and freshly ground black pepper", "3/4 cup hazelnuts, coarsely chopped (no need to remove the skins)", "Flaky sea salt", "1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Cut the squash in half lengthwise. Remove pulp and seeds, if you like. Continue to cut squash into 1 1/2-inch wedges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss squash on a rimmed baking sheet with olive oil, maple syrup, paprika and red-pepper flakes. Season with kosher salt and pepper, and roast, turning each piece once, until both sides are evenly browned and squash is completely tender, 40 to 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toast hazelnuts in a small skillet over medium heat, tossing frequently until they’re evenly browned, about the color of a good piece of toast, and smell almost like popcorn, 4 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and transfer squash to a large serving platter. Drizzle with olive oil and a bit more maple syrup. Sprinkle with hazelnuts, flaky salt and more black pepper. Zest lemon over everything and halve lemon to squeeze over before serving."}], "link": "https://cooking.nytimes.com/recipes/1020601-spicy-caramelized-squash-with-lemon-and-hazelnuts"}