{"@context": "http://schema.org", "@type": "Recipe", "name": "Challah French Toast With Cinnamon-Sugar Glaze", "description": "Thick slices of soft challah bread make for superior French toast, with a plush, custardy center and golden, crisp edges. This version has extra egg yolks for added richness, and a dash of cardamom for spice. Cinnamon-sugar is sprinkled on top of the challah slices as they cook, caramelizing and glazing them (though you can skip this step, if you want). If you want to work ahead, soak the challah slices in the custard mixture the night before, storing everything in the fridge, then add a few extra minutes onto the cooking time to make sure the centers are cooked through.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/09/26/dining/mc-challah-french-toast/mc-challah-french-toast-articleLarge-v3.jpg", "totalTime": "PT50M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, breads", "keywords": "cardamom, challah, challah bread, cinnamon, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 116}, "recipeIngredient": ["2 cups whole milk", "1/2 cup heavy cream or half-and-half (or use more milk)", "4 large eggs plus 2 large egg yolks", "2 teaspoons vanilla extract", "1/2 teaspoon finely grated lemon zest (optional)", "3/4 teaspoon ground cardamom", "Pinch of salt", "1 loaf challah bread (about 1 pound), cut into 1 1/4-inch slices", "4 to 6 tablespoons unsalted butter, plus more as needed", "1/4 cup granulated sugar", "1/2 teaspoon ground cinnamon", "Maple syrup", "Cherry or other jam", "Whipped mascarpone or crème fraîche", "Berries", "Sliced bananas", "Chopped pineapple chunks", "Mini chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together milk, cream, eggs and egg yolks, vanilla, lemon zest (if using), 1/2 teaspoon cardamom and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange challah slices in an even layer on a rimmed baking sheet. Pour custard on top, and let sit at room temperature, uncovered, for 30 minutes, so the bread can absorb the custard, carefully flipping bread slices halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together sugar, cinnamon and remaining 1/4 teaspoon cardamom. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large nonstick or cast-iron skillet over medium, then add 2 tablespoons butter and let it melt. Place 2 to 3 pieces soaked challah in skillet, making sure to not crowd the pan. Cook until golden on bottom, 4 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle a little of the cinnamon-sugar mixture on top of each slice, then flip and cook until bottom is glazed and browned, another 4 to 5 minutes. Transfer to serving plates, glazed-side up. Repeat with remaining butter, challah and cinnamon sugar. Serve warm, with your choice of toppings."}]}