{"@context": "http://schema.org", "@type": "Recipe", "name": "Farro e Pepe", "description": "While cacio e pepe, the classic Roman dish, is simple — made with only pasta and its cooking water; cacio, or Pecorino Romano; and abundant freshly ground black pepper — it’s not always easy to make. The trick to getting a thick, creamy sauce lies in combining the cheese and pepper with starchy pasta water in just the right way; this usually requires a lot of erratic stirring and sweat. This version bucks tradition in favor of simplicity and, well, farro. The technique for the cheese paste comes from Flavio de Maio, a master of cucina Romana and producer of one of Rome’s most beloved bowls of cacio e pepe. Simply blend grated cheese and a little cold water with freshly ground pepper until they come together into a creamy paste. Then toss a spoonful or two into just-cooked farro and watch it melt like butter to coat the grains in a layer of salt, pepper, richness and tang. The farro’s chewy, satisfying texture is a perfect foil for the creaminess of the sauce. Keep the leftover paste in the fridge — stir a spoonful into grits, toss it with boiled green beans and, of course, use it for a bowl of cacio e pepe. Use the technique with other hard cheeses: Asiago, Parmesan and even clothbound Cheddar make for fantastic versions.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2019/07/21/magazine/21mag-eat/21mag-eat-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, lunch, quick, grains and rice", "keywords": "farro, pecorino romano, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 542}, "recipeIngredient": ["Sea salt", "2 cups semi-pearled or pearled farro (about 13 1/2 ounces)", "7 1/2 ounces Pecorino Romano, finely grated (about 1 1/2 cups)", "1 1/4 teaspoons coarsely grated black pepper, plus more for serving", "1/4 cup cold water, plus more if needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Season generously with salt until the water is as salty as the sea. Add farro, and cook until al dente, about 15 to 18 minutes. Set a colander in the sink."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the meantime, place pecorino and pepper in a medium bowl, and add ¼ cup cold water. Use an immersion blender to combine into a thick, smooth paste. Add more cold water if needed, one tablespoon at a time, to encourage blending. If you don’t have an immersion blender, use a food processor for this step."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the farro is cooked, reserve 1 1/2 cups cooking water; transfer farro to colander to drain, then return to pot. Add 3/4 cup pecorino paste and 1/2 cup reserved cooking water, and stir vigorously with a wooden spoon until cheese melts and coats farro with a glossy sheen. Taste, and add cooking water and more pecorino paste to taste until farro is the consistency of a loose risotto. If farro is properly seasoned but too thick, add warm tap water instead of salted cooking water to loosen."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately, garnished with more pepper. Cover and refrigerate any remaining pecorino paste for up to 1 week. Use on pasta, farro or rice, or spread on toast."}], "link": "https://cooking.nytimes.com/recipes/1020356-farro-e-pepe"}