{"@context": "http://schema.org", "@type": "Recipe", "name": "New Mexican Hot Dish", "description": "<i>This is a no-recipe recipe, a recipe without an ingredients list or steps. It invites you to improvise in the kitchen.</i>\n\nI’ve been cooking enchiladas con carne ever since Robb Walsh taught me how to make them in the kitchen of his El Real Tex-Mex Cafe in Houston. But I can’t say I make them the way he taught me any longer.\nFirst, sauté a pound or so of ground beef in a splash of oil, with a little flour and a pinch of salt, then set it aside. Use the same pan to cook chopped onion, garlic and jalapeño. Return the meat to the pan, and hit it with chile powder, ground cumin and oregano, to taste. Add chopped tomatoes and a little water to loosen everything up. Let it reduce a little.\n\nMeanwhile, heat the oven to 425, and grab a casserole dish. You’ll need corn tortillas as well, and grated cheese — I like a mixture of Cheddar and American. Sue me.\n\nEnchiladas can be a drag to assemble. So do as the New Mexicans do, and stack rather than roll. I put a little chili in the bottom of the casserole, warm my tortillas in a dry skillet and lay them across the chili as if building the first layer of a lasagna. Then I do that again and again, and finish with the remaining chili and cheese. Bake in the oven until everything’s bubbling. Serve with chopped raw onions, sour cream and salsa on the side. Enchilada casserole, hon. New Mexican hot dish. I’m telling you, you could make it tonight.\n\n<i>Sam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. <a href=\"https://www.nytimes.com/newsletters/cooking\">Sign up to receive it.</a> You can find more no-recipe recipes <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/14326423-no-recipe-recipes\">here</a>.</i>", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/02/17/dining/17NORECIPE-BEEF-ENCHILADAS/merlin_147762108_51b0b888-c346-4824-8c69-59bb56b7db62-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "american", "recipeCategory": "dinner, weekday, burritos and nachos, tacos", "keywords": "american cheese, cheddar, ground beef, jalapeño, tortilla, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 735}, "recipeIngredient": [], "recipeInstructions": null}