{"@context": "http://schema.org", "@type": "Recipe", "name": "Speedy Fish Chowder", "description": "<i>This is a no-recipe recipe, a recipe without an ingredients list or steps. It invites you to improvise in the kitchen.</i>\n\nThis one calls for something in the neighborhood of a quarter- to half-pound of fish fillets per person and works as well in the heat of South Florida as it does on the frozen Northern Plains. Dice a strip or two of bacon if you’re a meat eater, or grab some butter if you are not (or use both if you are reckless). Add it to a Dutch oven set over medium-high heat and sauté with a few handfuls of diced onions, carrots and potatoes until the onions have gone translucent. Hit the mixture with some salt and pepper and a flash of smoked paprika if you have it. If you can find good corn on the cob, that would be a fine addition. So would a cup of frozen corn.\n\nDo you have any fish stock? No? White wine? Surely you have water. Add enough liquid (of any combination of the above) so that the potatoes are almost swimming, then add a bay leaf and reduce the heat to a simmer. Allow the chowder to bubble along until the liquid has reduced by a third and the potatoes are tender. Add a splash or two of milk or cream and allow it to heat and thicken slightly. Now cut the fillets into chunks and stir them in gently. Five minutes later: chowder. Serve with crusty bread.\n\n<i>Sam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. <a href=\"https://www.nytimes.com/newsletters/cooking\">Sign up to receive it.</a> You can find more no-recipe recipes <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/14326423-no-recipe-recipes\">here</a>.</i>", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/02/17/dining/17norecipe-speedyfish/merlin_147770463_47a2882a-a600-46da-8ae6-0f4cca7413fc-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "dinner, weekday, seafood, soups and stews", "keywords": "corn, fish fillets, fish stock, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 820}, "recipeIngredient": [], "recipeInstructions": null, "link": "https://cooking.nytimes.com/recipes/1020005-speedy-fish-chowder"}