{"@context": "http://schema.org", "@type": "Recipe", "name": "Garlic-Ginger Chicken Breasts With Cilantro and Mint", "description": "This chicken, which is the brainchild of my aunt Sonia, is legendary among our cousins. Until recently, though, no one knew what, exactly, went into it. Whenever my aunt would make it on a family vacation, she’d disappear for a half-hour and reemerge with a Ziploc bag filled with the marinade and the chicken breasts. No one (not even her only daughter, Isha) was allowed to know the contents. The marinating chicken would smell so good, I’d legitimately have thoughts about eating it raw, carpaccio-style (which is disgusting, I know!). Well, folks, I am here to tell you that, after much negotiation, I have finally pried that chicken recipe out of Sonia’s hands. Both the marinade and the cooking method (low and sort of slow) feel ingenious to me, and the payoff is huge: Charred, spicy, slightly funky, juicy chicken that is equally wonderful by itself or rolled up in a roti, taco-style, and served with various salads and chutneys.", "author": {"@type": "Person", "name": "Priya Krishna"}, "image": "https://static01.nyt.com/images/2019/03/29/dining/ml-garlic-ginger-chicken/merlin_152035974_1962c75f-a0c3-482b-8ad4-a9292cf6849c-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "american, indian", "recipeCategory": "dinner, easy, lunch, weeknight, poultry", "keywords": "chicken breast, mango powder, mint, turmeric, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 638}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 460, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "1 gram", "proteinContent": "65 grams", "saturatedFatContent": "3 grams", "sodiumContent": "483 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 garlic cloves, minced", "2 tablespoons minced fresh ginger", "1 tablespoon finely chopped fresh mint leaves, plus more for garnish", "1 tablespoon finely chopped fresh cilantro leaves, plus more for garnish", "3 tablespoons fresh lemon juice (from 1 lemon)", "3 tablespoons plus 1 teaspoon olive oil", "1 tablespoon ground coriander", "1 teaspoon ground turmeric", "1 teaspoon amchur (dry mango powder), optional", "1/2 teaspoon red chile powder, like ground cayenne", "3/4 teaspoon kosher salt", "4 boneless, skinless chicken breasts (1/2 to 3/4 pound each)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the marinade: Add the garlic, ginger, mint, cilantro, lemon juice and 3 tablespoons oil to a large resealable bag. Seal the bag and massage to combine the ingredients into a paste. Add the coriander, turmeric, amchur (if using), red chile powder and salt, and seal the bag. Shake or massage to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken breasts in the marinade and seal the bag tightly. Use your hands to gently massage the marinade onto the chicken breasts until each breast is coated. Refrigerate at least 2 hours and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm a large lidded skillet over medium-high heat. Once the pan is quite hot, add the oil, swirling the pan to coat the entire surface. Reduce the heat to medium, remove the chicken from the marinade and shake gently to remove any excess marinade. Add it to the pan. Working in batches if necessary, cook the breasts, undisturbed, until lightly golden underneath, 1 to 2 minutes, then flip them and cook until lightly golden on the second side, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to low, cover, and cook the chicken for 10 minutes (no peeking!). Turn off the heat (if you have an electric stove, take the pan off the heat) and let the chicken sit, covered, for 10 to 15 minutes, depending on the thickness of the breasts. Don’t lift the lid, or you’ll release the hot steam that finishes cooking the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Check to make sure the breasts are cooked through: There shouldn’t be any pink in the middle. If you have a meat thermometer, the chicken should register at least 165 degrees. Place the chicken on a cutting board, and slice each breast into strips. Garnish with mint and cilantro."}]}