{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Shells", "description": "Of all the baked pasta dishes, stuffed shells are beloved for good reason: The fluffy ricotta filling, punchy tomato sauce, melted cheese and oversize noodles creates the ultimate comfort food, and the make-ahead aspect is equally compelling. The tomato sauce can be made and refrigerated five days ahead, or you can save time by swapping in three cups of your favorite store-bought marinara sauce. The shells can be assembled a few hours ahead, then baked from the refrigerator an hour before it’s time to eat. While some versions add frozen spinach, herbs or lemon, you really don’t need anything beyond the basics; this classic version is pure comfort.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2020/01/29/dining/as-stuffed-shells/merlin_168064221_2d4e3fab-b4d6-4138-9eb1-c02ad83a8e29-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "dinner, casseroles, pastas", "keywords": "fall, winter, main course, mozzarella, parmesan, pasta, ricotta, tomato sauce, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 233}, "recipeIngredient": ["1/4 cup extra-virgin olive oil", "1 medium onion, finely chopped", "Kosher salt", "4 garlic cloves, peeled and thinly sliced", "3 tablespoons tomato paste", "1 (28-ounce) can tomato purée", "Kosher salt and black pepper", "1 pound fresh ricotta (about 2 cups)", "10 ounces fresh mozzarella, grated (about 2 1/2 cups)", "5 1/2 ounces Parmesan, finely grated (about 2 cups)", "2 egg yolks", "1 garlic clove", "12 ounces jumbo shells"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: In a large Dutch oven or pot, heat the olive oil over medium. Add the onion and a pinch of salt and cook, stirring occasionally, until softened, 5 to 7 minutes. Add the garlic and tomato paste and cook, stirring frequently, until the paste turns one shade darker, about 2 minutes. Stir in the tomato purée, season with salt, then bring to a simmer. Cover halfway to reduce splattering, and cook, stirring occasionally, until the sauce has thickened slightly, 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Bring a large pot of salted water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a medium bowl, combine the ricotta with 1 1/2 cups mozzarella, 1 cup Parmesan and the egg yolks. Grate the garlic directly into the bowl, then season with 1 teaspoon salt and 1/2 teaspoon pepper. Stir to combine, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shells to the boiling water and cook until just shy of al dente. (You’ll want to cook the shells about 2 minutes less than the minimum time listed on the package, as the shells will continue to cook in the oven in Step 5.) Reserve 1/2 cup pasta water, then drain the pasta and rinse it under cold water to cool. Count out 24 shells. (You will have cooked off more shells than will fit in the dish; that’s insurance in case any rip. Reserve extras for another use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the pasta water into the sauce, then add half the sauce to a 3-quart/9-by-13-inch baking dish and spread it in an even layer. Spoon about 2 tablespoons filling into each of the 24 shells, lining up the stuffed shells in the dish as you go. Spoon the remaining sauce over the shells, then sprinkle with the remaining 1 cup mozzarella and 1 cup Parmesan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the dish tightly with foil and bake for 30 minutes. Remove the foil and bake, uncovered, until the cheese is melted and the sauce is bubbling, 15 to 20 minutes. (If you’d like to brown the cheese, you can broil for a few minutes.) Let sit 5 minutes, then serve."}], "link": "https://cooking.nytimes.com/recipes/1020833-stuffed-shells"}