{"@context": "http://schema.org", "@type": "Recipe", "name": "XO Sauce", "description": "In Hong Kong in the 1980s, when expensive Cognac was all the rage, legend has it that some smart cook at the Spring Moon restaurant in the Peninsula Hotel on Kowloon got it into his head to name the funky new condiment he’d come up with after the status mark on the bottle of Remy Martin at the bar: “XO,” extra old, rare, very expensive. The stuff was a hit: dried scallops and dried shrimp, a ton of chiles, a faint pork-smokiness and a whisper of allium, expensive to make and worth it for the flavor-enhancing pop. By the end of the decade, XO sauce was on menus all over Hong Kong and eventually the world. Recipes for XO vary wildly, save for those scallops and shrimp. Mine derives from the teachings of Diana Kuan, who included a formidable XO in her 2019 cookbook, “Red Hot Kitchen.”", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/04/21/magazine/21mag-eat-slideshow-slide-XVL1/21mag-eat-slideshow-slide-XVL1-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "2 1/2 cups", "recipeCuisine": "asian, chinese", "recipeCategory": "easy, quick, sauces and gravies", "keywords": "bacon, chiles, dried scallops, dried shrimp, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 385}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 123, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "2 grams", "sodiumContent": "294 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 ounces dried scallops (ideally dinner-size)", "30 dried red chiles, like Japones, Tien Tsin or cayenne, tough stems removed, roughly chopped", "2 small jalapeño or Fresno chiles, roughly chopped", "2 garlic cloves, peeled and roughly chopped", "2 shallots, peeled and roughly chopped", "3 ounces medium dried shrimp", "2 ounces bacon, minced", "3 tablespoons neutral oil, such as vegetable or canola", "1 tablespoon dark brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the scallops in a steamer insert, and fit the insert into a small pot with about an inch of water beneath the bottom of the insert. Bring the water to a boil over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the water boils, cover the pot, and steam over medium heat until the scallops are soft, 20 minutes or so. Transfer the scallops to a medium bowl, and save about 1/2 cup of the liquid remaining in the pot. When the scallops are cool to the touch, break them up with your fingers, and transfer to a food processor. Pulse until they have turned into fine threads. Scrape the shredded scallops back into the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dried chiles, fresh chiles and garlic in the food processor, and pulse until the mixture forms a paste that sticks to the sides of the work bowl, scraping down the sides as needed. (This may take a few minutes.) Scrape the chile-garlic paste into the bowl with the shredded scallops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the shallots, dried shrimp and bacon in the food processor, and pulse until minced."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large wok or skillet over medium-high. When it is very hot, add the oil, and swirl to coat the surface of the wok or skillet. Add the shallot mixture, and stir-fry until the mixture is very fragrant and beginning to crisp, 4 to 5 minutes. Add the brown sugar, and stir-fry again until the mixture starts to caramelize, 30 to 45 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shredded scallop mixture and stir-fry for another 30 to 45 seconds, then add the reserved cooking water from the scallops. Cook until the liquid is almost evaporated, about 1 minute. Transfer to a lidded glass container, and let cool. Once mixture has cooled, cover, and refrigerate. Refrigerated, the XO sauce will keep up to 1 month."}], "link": "https://cooking.nytimes.com/recipes/1020182-xo-sauce"}