{"@context": "http://schema.org", "@type": "Recipe", "name": "Pizza con tutti (Pizza with everything)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT45M", "recipeYield": "Two 12- to 13-inch pizzas", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pizza and calzones", "keywords": "cheese, italian sausage, pizza dough, main course", "aggregateRating": null, "recipeIngredient": ["Pizza dough made with four cups of flour (<a href=\"http://www.linktorecipe.com\">see recipe</a>)", "1/4 cup olive oil plus oil for greasing a pizza pan, optional", "2 cups marinara sauce (<a href=\"http://cooking.nytimes.com/recipes/10211-marinara-sauce\">see recipe</a>)", "1 cup thinly sliced mushrooms", "1 cup thinly sliced sausages, such as Italian sausages or salami or Polish sausages", "2 cups coarsely grated low-fat or regular-fat mozzarella cheese", "1/4 cup Parmesan cheese", "Red-pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "There are two recommended ways of cooking pizza at home. It may be prepared and cooked in a 14-inch pizza pan, or it may be baked on a baking stone. If it is to be baked on a pizza pan, preheat the oven to 475 degrees; if it is to be baked on a stone, preheat the oven to 500 degrees and put the stone in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough in half. Flatten, one-half at a time, with the hands into a circle. Start punching it all around with the back of a clinched fist to shape it into a larg er circl e about 12 or 13 inches in diameter. Keep the surface floured lightly but enough so that thedough does not stick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If pizza pans are used, rub the surface of each with one tablespoon of oil. If a baking stone is used, you will place the pizza circle on the wooden paddle. You should bake one pizza first and continue to make the second after the first is baked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange one circle of dough on each pan or on the wooden paddle. Add half of the marinara sauce to the center of each circle of pastry and smooth it almost, but not quite, to the edge. Scatter half of the mushrooms, half of the sausage slices, half of the Mozzarella and half of the Parmesan over the sauce. Sprinkle each pizza with two tablespoons of olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If a pizza pan is used, place it in the oven for 14 minutes or until the pizza is well done. If the baking stone is used, slide the pizza off onto the stone and bake 14 minutes or until the pizza is well done. Repeat with the second pizza. Serve with red-pepper flakes on the side."}]}