{"@context": "http://schema.org", "@type": "Recipe", "name": "Citrusy Cheesecake", "description": "The nice thing about this cheesecake is that it doesn’t require a water bath or any sort of special baking pan: More shallow than a traditional version, it gets baked right in a pie plate (or tart pan, if you’ve got that). While there are zest and juice inside the cream cheese filling, it’s the fresh sliced citrus on top that makes this cake Creamsicle-like, so don’t skip it. The ultimate do-ahead dessert, this cheesecake can be baked three or so days in advance, just make sure to wrap it tightly as cream cheese tends to easily pick up on that “fridge” scent.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/12/18/dining/17Romanrex4/merlin_162383931_8ab8d59f-884c-4b48-a51a-82884244413e-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "cream cheese, grapefruit, sour cream, vanilla wafers, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 379}, "recipeIngredient": ["8 ounces/225 grams vanilla wafers or graham crackers ", "3 tablespoons light brown sugar", "6 tablespoons/85 grams unsalted butter, melted", "Pinch of kosher salt ", "1 pound/455 grams (two 8-ounce/225-gram packages) cream cheese, not the whipped kind, preferably at room temperature ", "1 cup/240 milliliters sour cream or full-fat Greek yogurt", "1/2 cup/100 grams granulated sugar", "2 large eggs", "3 tablespoons fresh grapefruit, lemon, lime or orange juice", "3 tablespoons finely grated grapefruit, lemon, lime or orange zest", "Pinch of kosher salt ", "Sliced citrus, for serving ", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Heat oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulse cookies in a food processor until you’ve got a nice fine crumb (but not a powder). You can also do this by hand if you like, by placing the cookies in a resealable bag and crushing or smashing with a skillet or rolling pin, but you will need a food processor for the filling. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer crumbs to a medium bowl and add brown sugar and butter, followed by a pinch of salt. Using your hands, mix until the crumbs are evenly coated and the mixture has a nice, wet-sand texture. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press the crust onto the bottom and up the sides of a 9-inch pie plate, tart pan or springform pan. (Alternatively, you could use a cake pan lined with parchment. You can even use an 8-by-8-inch baking dish here, although expect a slightly thicker outcome.) Use the bottom of a measuring cup or small bowl to make sure the crust is really pressed in there, otherwise the cake could be challenging to cut later on. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the crust until it is lightly golden brown at the edges (it gets baked one more time, so best not to overdo it here), 10 to 12 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Combine cream cheese, sour cream and granulated sugar in the bowl of a food processor and process until the mixture is extremely smooth and well blended, a minute or two, scraping down the sides as needed to incorporate any stubborn chunks of cream cheese. Add eggs, grapefruit juice, zest and a pinch of kosher salt and keep processing until it’s even smoother and creamier than before (a miracle!), another 30 seconds or so. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour filling into baked crust (you may have some leftover filling depending on your chosen vessel) and bake until mostly set (a little jiggle is fine), 20 to 30 minutes. The filling should not brown at all."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn oven off and open the door a crack. Let the tart sit in the oven for a few minutes before transferring it to a wire rack on the counter to cool completely. Then place the tart in the refrigerator to chill for at least 1 hour. (This is to prevent any unsightly cracks from appearing on the surface, which can happen when there is a sudden or drastic change in temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, scatter fresh citrus slices on top and sprinkle with a little flaky salt."}], "link": "https://cooking.nytimes.com/recipes/1020711-citrusy-cheesecake"}