{"@context": "http://schema.org", "@type": "Recipe", "name": "Banoffee Pie", "description": "With generous layers of dulce de leche, bananas and whipped cream, this dazzling pie is not for the faint of heart. The banoffee or banoffi pie, a mash-up of banana and toffee, was created in 1971 by the chef Ian Dowding and Nigel MacKenzie, the owner of the Hungry Monk, a now-closed restaurant in Sussex, England. The original recipe called for a traditional pie crust, homemade dulce de leche and coffee-flavored whipped cream, but we’ve simplified it for the home cook by using a graham cracker crust, store-bought dulce de leche and plain whipped cream. If you like, you could add a teaspoon of instant coffee granules to the whipped cream.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2019/07/18/dining/ml-banoffee-pie/ml-banoffee-pie-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "One 9-inch pie", "recipeCuisine": "british", "recipeCategory": "pies and tarts", "keywords": "banana, dulce de leche, graham cracker crumbs, instant coffee, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 406}, "recipeIngredient": ["1 1/4 cups/155 grams graham cracker crumbs (about 10 whole graham crackers)", "5 tablespoons/70 grams unsalted butter, melted", "1/3 cup/65 grams granulated sugar", "1/2 teaspoon kosher salt", "2 1/2 cups/600 milliliters store-bought dulce de leche (about 20 ounces)", "3 large bananas, peeled and sliced about 1/4-inch thick", "1 1/2 cups/360 milliliters cold heavy cream", "2 tablespoons granulated sugar", "1 teaspoon vanilla extract", "1 teaspoon instant coffee granules (optional)", "Chocolate shavings or fresh coffee grounds, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Make the crust: In a medium bowl, combine graham cracker crumbs, melted butter, sugar and salt. Stir until fully incorporated and sandy. (When you pinch a bit of it between your fingers, it should hold together.) Transfer to a 9-inch pie plate. Using your fingers or a flat-bottomed cup, press the mixture into the pie plate and up the sides. Make sure it is well packed. Bake until set, 12 to 15 minutes. Let cool at room temperature for 30 minutes, or cover with plastic wrap and refrigerate up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the dulce de leche into the pie crust and spread into an even layer. Pile in banana slices into a relatively even layer (they should overlap). Transfer the pie to the refrigerator while you make the whipped cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the whipped cream: Using a handheld mixer or stand mixer fitted with a whisk attachment, whip the heavy cream, sugar, vanilla extract and instant coffee, if using, on medium-high speed until firm peaks form, 1 to 2 minutes. Spread the whipped cream on top of the bananas, making sure to spread the whipped cream to the edge, totally covering the bananas (this will help prevent them from browning). Chill the pie, uncovered, for 2 hours and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, sprinkle the pie with chocolate shavings or fresh coffee grounds, if desired. Store leftover pie in the refrigerator, covered, for up to 5 days. The whipped cream may lose some height, but the pie will be no less delicious."}]}