{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked ‘Paella’ With Shrimp, Chorizo and Salsa Verde", "description": "This nontraditional recipe features the ultimate paella cheat: The dish cooks in the oven, as opposed to being actively monitored on the stovetop over a flame. Cooking it this way won’t get you the familiar socarrat on the bottom of the skillet, but the wonderfully crispy bits that develop at the edges of the roasting pan are delightful in their own way.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2019/03/27/dining/27ottorex/merlin_152255505_744ed6f1-4ff7-4f9e-948e-d7aadcd52413-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "grains and rice, seafood", "keywords": "artichoke hearts, chorizo, halibut, parsley, rice, saffron, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 373}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 980, "unsaturatedFatContent": "36 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "53 grams", "fiberContent": "6 grams", "proteinContent": "53 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1822 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["9 tablespoons/135 milliliters olive oil", "1/2 packed cup/30 grams chopped fresh parsley", "2 mild red or green chiles, such as Anaheim chiles, halved lengthwise, seeded and thinly sliced", "7 garlic cloves, 2 roughly chopped and 5 thinly sliced lengthwise", "Kosher salt and black pepper", "1 1/3 pounds/600 grams whole, shell-on tiger or jumbo shrimp (prawns)", "3/4 pound/340 grams boneless, skinless halibut fillet, cut into 6 equal pieces", "2 lemons, 1 squeezed to get 1 1/2 tablespoons juice and 1 cut into 6 wedges", "1/2 pound/225 grams fresh chorizo, casing discarded and chorizo roughly crumbled", "2 large vine tomatoes (14 ounces/400 grams), roughly grated and skins discarded", "1 medium yellow onion, finely chopped (about 5 ounces/150 grams)", "1 tablespoon tomato paste", "14 ounces/400 grams bomba rice", "10 ounces/285 grams jarred or canned artichoke hearts marinated in oil, drained and halved", "1 red bell pepper, stemmed, seeded, then cut into 1/2-inch/1-centimeter strips", "1 1/4 teaspoons smoked sweet paprika", "1 teaspoon saffron threads", "3 1/4 cups/780 milliliters fish stock, warmed", "2 cups/480 milliliters hot water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees Fahrenheit/230 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 6 tablespoons/90 milliliters oil, the parsley, half the chile, the roughly chopped garlic, 1/4 teaspoon salt and a grind of pepper to the bowl of a food processor and pulse until finely chopped, scraping down the sides of the bowl as needed. Scrape half the salsa verde into a medium bowl and reserve the remaining salsa verde."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Keeping the heads and tails intact, remove and discard the shrimp shells and transfer the head-on shrimp into the medium bowl with the salsa verde. Add the halibut, lemon juice, 3/4 teaspoon salt and a good grind of pepper to the bowl with the shrimp and gently toss to combine. Transfer to the refrigerator to chill while you continue with the rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chorizo, tomatoes, onion, tomato paste and the remaining sliced garlic, chile and 3 tablespoons oil to a large (about 15-by-10 inches/40-by-28 centimeters), deep metal roasting pan and toss to coat. Transfer to the oven and cook until sauce is thickened and browned at the edges, stirring once halfway through, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the rice, artichokes, bell pepper, paprika, saffron, 1 1/2 teaspoons salt and a good grind of pepper into the pan. Pour in the stock and hot water and stir well to combine. Cover with foil and return to the oven until the rice is cooked through and most of the liquid has been absorbed, about 25 minutes. Increase the oven temperature to 500 degrees Fahrenheit/260 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the oven, remove the foil and top with the marinated shrimp and halibut, gently pushing them into the rice without mixing it around too much. Return to the oven, uncovered, until the shrimp and halibut have cooked through, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the reserved salsa verde over the paella. Serve warm, with the lemon wedges alongside."}], "link": "https://cooking.nytimes.com/recipes/1020108-baked-paella-with-shrimp-chorizo-and-salsa-verde"}