{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Spinach-Artichoke Pasta", "description": "Toss spinach-artichoke dip with pasta, and it feels right at home on the dinner table. This recipe, which nixes the traditional cream cheese for a blend of salty Parmesan and heavy cream, is prepared on the stovetop and requires only 10 minutes of active cooking before it’s slid into the oven. As with any baked pasta, the key is to cook the shells until pointedly shy of al dente and to toss them with a sauce that seems excessively wet, as the pasta will tenderize and the sauce will thicken in the oven. These ingredients skew classic, but there is infinite room to riff: Swap in chopped kale or mustard greens in place of the spinach, experiment with cheese combinations, stir in mustard or caramelized onions or top with crumbled bacon.", "author": {"@type": "Person", "name": "Aaron Hutcherson"}, "image": "https://static01.nyt.com/images/2019/03/06/dining/ah-spinach-artichoke-pasta/merlin_151074951_6612441a-3235-490b-a684-192724bb91ae-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, weeknight, casseroles, pastas", "keywords": "artichoke hearts, mozzarella, parmesan, pasta, spinach, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1096}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 630, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "6 grams", "proteinContent": "21 grams", "saturatedFatContent": "25 grams", "sodiumContent": "638 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["Kosher salt", "8 ounces medium pasta shells", "2 tablespoons olive oil", "2 garlic cloves, minced", "1/4 teaspoon red-pepper flakes", "10 ounces fresh baby spinach, or frozen chopped spinach, defrosted and drained", "1 (14-ounce) can artichoke hearts, drained and roughly chopped", "2 cups heavy cream (1 pint)", "4 ounces grated Parmesan (about 1 cup)", "Black pepper", "4 ounces grated mozzarella (about 1 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Bring a large pot of salted water to a boil over high. Turn down to medium-high, and cook the pasta according to package instructions until 2 minutes short of al dente (the pasta will finish cooking in the oven). Drain and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the oil in a large skillet over medium. Add the garlic and red-pepper flakes and cook until fragrant, about 1 minute. Add the spinach little by little until wilted, stirring frequently, about 3 minutes. Stir in the chopped artichokes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the cream and bring to a simmer over medium-high heat. Stir in the Parmesan until melted. Remove from the heat then carefully stir in the cooked pasta, or transfer to a large bowl to mix together, if necessary. The liquid might appear wet and loose, but it will thicken up as it bakes. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pasta to a 2-quart casserole dish or individual casseroles or ramekins. Sprinkle with the mozzarella and bake until bubbling, 20 to 25 minutes. Broil until browned in spots, 1 to 2 minutes, if desired. Let cool slightly before serving."}], "link": "https://cooking.nytimes.com/recipes/1020080-baked-spinach-artichoke-pasta"}