{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Polenta With Crispy Leeks and Blue Cheese", "description": "Baking polenta in the oven means you don’t have to stand over the pot, stirring the extremely hot, bubbling mass. Here, the polenta is cooked in stock for the deepest flavor. Then it’s topped with piquant crumbles of Gorgonzola dolce and crisp fried leeks, which add sweetness and crunch. You can serve this as a warming main course along with a crisp green salad, or as a rich and flavorful side dish to simple roasted meats or fish.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/03/27/dining/27apperex1/22apperex1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, grains and rice", "keywords": "gorgonzola, leek, polenta, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 534}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 350, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "9 grams", "sodiumContent": "578 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons unsalted butter, plus more for pan", "1 quart chicken or vegetable stock, preferably homemade", "1/2 teaspoon fine sea salt, plus more as needed", "1 cup polenta (coarse or regular, not instant)", "3 tablespoons extra-virgin olive oil, plus more for serving", "2 medium leeks, halved and sliced", "4 ounces Gorgonzola dolce or other creamy blue cheese, cut into 1/2-inch pieces (about 1 cup)", "Chopped parsley or basil, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and butter a 9-by-9-inch baking dish. In a large pot, bring stock, 2 tablespoons butter and salt to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to medium, then slowly add polenta, stirring constantly until slightly thickened, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape polenta into prepared dish, cover with foil, and bake for 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As polenta bakes, prepare the leeks: Heat remaining 1 tablespoon butter and 3 tablespoons oil, in a large skillet over medium-high heat. Stir in leeks and a large pinch of salt, and cook until dark golden and crisped, stirring frequently, and lowering heat if they start to brown too quickly, 10 to 12 minutes. Season with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove polenta from oven. Stir in half the Gorgonzola, then cover again with foil, and let sit for 10 minutes to melt the cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, taste polenta and stir in more salt, if needed (this will depend on how salty your cheese and stock are). Drizzle polenta with olive oil, and sprinkle with remaining Gorgonzola, crispy leeks, and parsley or basil."}], "link": "https://cooking.nytimes.com/recipes/1020104-baked-polenta-with-crispy-leeks-and-blue-cheese"}