{"@context": "http://schema.org", "@type": "Recipe", "name": "Zucchini Muffins With Cinnamon Crunch Topping", "description": "A touch of honey complements the nutty flavor of the whole-wheat flour in these muffins. The zucchini and applesauce provide moisture and flavor, and the crunchy cinnamon topping makes for the perfect textural contrast against the soft cake. These muffins are a great addition to your morning cup of coffee. Store them on the counter, uncovered, to help preserve their crunchy coating. They also freeze well and can be reheated in a low-temperature oven or thawed at room temperature.", "author": {"@type": "Person", "name": "Jerrelle Guy"}, "image": "https://static01.nyt.com/images/2019/08/27/dining/jg-zucchini-muffins/jg-zucchini-muffins-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "12 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, snack, finger foods, pastries", "keywords": "applesauce, cinnamon, honey, turbinado sugar, whole wheat flour, zucchini, fall, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 136}, "recipeIngredient": ["2 tablespoons/30 grams unsalted butter, softened, plus 1/2 cup/115 grams unsalted butter, melted", "2 medium zucchini (about 1 pound)", "1 cup/120 grams plus 1 tablespoon whole-wheat flour", "1 1/4 cups/160 grams all-purpose flour", "3/4 cup/150 grams granulated sugar", "2 1/2 teaspoons baking powder", "1 teaspoon kosher salt", "2/3 cup/160 milliliters whole milk, at room temperature", "1/2 cup/120 milliliters unsweetened applesauce", "1/4 cup/60 milliliters honey", "2 eggs, beaten, at room temperature", "1 tablespoon lemon juice", "2 teaspoons vanilla extract", "1/3 cup/65 grams turbinado sugar", "1 tablespoon ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Using 1 tablespoon softened butter, generously butter the cups and the top of a standard 12-cup muffin tin. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tips off the zucchini and grate the zucchini into shreds on a box grater. Pile the zucchini onto a clean dish towel and squeeze tightly over the sink to remove any excess water. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, sift 1 cup whole-wheat flour with the all-purpose flour, granulated sugar, baking powder and salt, then whisk to combine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To a medium bowl, add the melted butter, milk, applesauce, honey, eggs, lemon juice and vanilla, and whisk to combine. Make a well in the center of the dry ingredients and pour the liquid inside. Using a rubber spatula, gently fold everything together, being careful not to overmix. Just before completely combined, sprinkle the zucchini over the top, breaking up any clumps with your hands, and finish folding the batter until combined. Using a spoon or scoop, divide the batter evenly among the muffin cups. (It should come to the top of each cup)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the remaining 1 tablespoon whole-wheat flour with the turbinado sugar and cinnamon. Using your fingers, work in the remaining 1 tablespoon softened butter until everything is evenly moist. Sprinkle the mixture over the tops of the muffins, then carefully brush away any crumbs that spill onto the top of the muffin tin. Bake the muffins, rotating halfway through, until the tops form firm domes, the sugar topping caramelizes and the muffins are cooked through, 24 to 26 minutes. (The tops should spring back when lightly pressed.) Remove from the oven and allow to cool in the tin for 15 minutes before using a small offset spatula to transfer them to a wire rack to cool for at least another 10 minutes. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1020432-zucchini-muffins-with-cinnamon-crunch-topping"}