{"@context": "http://schema.org", "@type": "Recipe", "name": "Sopa de Albóndigas (Mexican Meatball Soup)", "description": "Ask 10 people for a recipe for a particular dish, and you’ll probably get 10 different recipes. Mexican sopa de albóndigas is no exception. Most variations are likely to involve vegetables, rice, a tomato-based broth and, inevitably, meatballs. Wesley Avila, the chef of Guerrilla Tacos in Los Angeles, learned this recipe from his mother, who learned it from her grandmother. His meatballs are hefty in size but light in density, and follow his family’s tradition of adding uncooked white rice to the pork-beef mixture before shaping it into balls and cooking: “My mom always told me that when the rice is done, the soup is ready,” Mr. Avila said. “She used it almost as a timer.” The toppings — piled on as you would atop chili — skew cheffy, but they are entirely optional.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2020/01/14/dining/aw-albondigas/aw-albondigas-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, soups and stews", "keywords": "beef, cumin, garlic, mint, onion, oregano, pork, potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 350}, "recipeIngredient": ["2 pounds ground beef", "1 pound ground pork", "1/2 cup uncooked long-grain rice", "1/3 cup chopped fresh mint", "3 garlic cloves, minced", "1 tablespoon kosher salt", "1 1/2 teaspoons black pepper", "2 tablespoons olive oil or vegetable oil", "1 medium yellow onion, peeled and diced (about 1 1/2 cups)", "4 medium carrots, peeled and cut on an angle into 1/2-inch slices", "3 medium celery stalks, peeled and cut on an angle into 1/2-inch slices", "1 large red potato, cut into 1-inch cubes", "Kosher salt and black pepper", "3 tablespoons tomato paste", "3 garlic cloves, minced", "2 bay leaves", "2 teaspoons dried oregano, preferably Mexican", "2 teaspoons ground cumin", "8 cups chicken stock (2 quarts)", "1 (8-ounce) can tomato sauce", "Crumbled queso fresco, panela or cotija", "2 avocados, halved lengthwise, pitted and thinly sliced crosswise or diced", "Mini sweet peppers, thinly sliced into rounds", "Serrano and habanero chiles, very thinly sliced", "Small fresh cilantro sprigs or chopped fresh cilantro", "Lime wedges, for squeezing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the meatballs: In a large bowl, combine the beef, pork, rice, mint, garlic, salt and pepper. Using your hands, gently mix until well combined. Pinch off 2-ounce portions and gently roll between your palms to form golf ball-size rounds, transferring rounds to a sheet pan. (You should have about 28 meatballs.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In large pot, combine the olive oil, onion, carrots, celery and potato; season with salt and pepper. Cook over medium-high, stirring occasionally, until slightly softened, about 5 minutes. Add the tomato paste, garlic, bay leaves, oregano and cumin, and cook over medium, stirring frequently, until fragrant and tomato paste starts to caramelize, about 3 minutes. Add the chicken stock and tomato sauce and bring to a simmer over high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the stock begins to bubble, reduce the heat to medium-low. Carefully add the meatballs, one by one, distributing them evenly in the pot until they’re all submerged. If necessary, reduce the heat to reach a low simmer (this will keep the meatballs tender), and cook until the meatballs and rice are cooked through, about 40 minutes. (Resist the urge to stir for the first 20 minutes, otherwise you risk breaking the meatballs apart before they’ve firmed up.) Skim any impurities from the surface as the soup simmers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season to taste with salt. Divide the soup among bowls, about four or five meatballs per portion, and set out bowls of whatever garnishes you like."}], "link": "https://cooking.nytimes.com/recipes/1020777-sopa-de-albondigas-mexican-meatball-soup"}