{"@context": "http://schema.org", "@type": "Recipe", "name": "Midnight Pasta With Roasted Garlic, Olive Oil and Chile", "description": "This recipe is a version of aglio e olio pasta, which is often known as midnight pasta because it can be made quickly with a few pantry staples: garlic, olive oil, red-pepper flakes and pasta. This recipe takes a bit more time because it calls for roasting the garlic first, but doing so adds a complex, mellow flavor to the entire dish. If you’re a planner, you could even roast a couple of heads of garlic in advance. (Roasted garlic will keep in an airtight container in the refrigerator for up to two weeks and in the freezer for up to two months.) Add whatever vegetables or proteins look good to you.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/11/25/dining/as-Pasta-With-Caramelized-Garlic--Olive-Oil-and-Chile/merlin_161591019_30ca057a-225a-4635-a0ba-059da1d10806-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "garlic, olive oil, parsley, pasta, red pepper flakes, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 257}, "recipeIngredient": ["1 large head of garlic", "Kosher salt", "1/2 cup plus 1 teaspoon extra-virgin olive oil", "1 cup firmly packed parsley leaves", "1 pound spaghetti or other long pasta", "1/2 teaspoon red-pepper flakes, plus more for garnish", "Black pepper", "Freshly grated Parmesan, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Cut off the top 1/4 inch of the head of garlic to expose the top of the cloves, then place on a piece of foil, cut-side up. Sprinkle exposed cloves with salt, then drizzle with 1 teaspoon oil. Wrap the garlic in the foil and roast until soft and golden brown, 40 to 50 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to make the pasta, bring a large pot of salted water to a boil. Finely chop the parsley leaves. Add pasta to the boiling water and cook according to package instructions until al dente. Reserve 1 cup of the pasta water, then drain the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta cooks, in a large Dutch oven or skillet, heat the remaining 1/2 cup oil over medium heat. Squeeze the roasted garlic cloves into the oil and cook, breaking them up with your spoon, until very fragrant, 2 to 3 minutes. Add the red-pepper flakes and a few generous grinds of pepper. Remove the pan from the heat to infuse the oil while the pasta finishes cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pasta’s done, heat the garlic oil over medium, then add the cooked pasta, 1/2 cup reserved pasta water and the parsley, and simmer, tossing constantly and adding more pasta water as needed, until the pasta is glossed with sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with more red-pepper flakes, black pepper and Parmesan."}], "link": "https://cooking.nytimes.com/recipes/1020668-midnight-pasta-with-roasted-garlic-olive-oil-and-chile"}