{"@context": "http://schema.org", "@type": "Recipe", "name": "French Onion Macaroni and Cheese", "description": "This outrageously good macaroni and cheese fuses two classic comfort foods into one dish. Caramelizing onions can be a time-consuming affair, but here, the process is sped up by using high heat and and a little water to prevent scorching. The sauce is made with a combination of Gruyère, to remind you of French onion soup, and white Cheddar, to make it melty and smooth. Instead of topping the dish with a dusting of diminutive bread crumbs, it’s dotted with Gruyère toasts that become melty and crisp after a few minutes under the broiler. (You’ll want to slide a sheet pan underneath before baking, in case some of the sauce bubbles over.) This is over-the-top richness at its best.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/10/22/dining/as-french-onion-mac-and-cheese/merlin_162800874_a013024f-1d26-4eaa-8157-a25db2e0db74-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, casseroles, pastas", "keywords": "gruyère, onion, pasta, white cheddar, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1007}, "recipeIngredient": ["Kosher salt", "4 tablespoons unsalted butter, plus more for greasing the pan", "2 pounds yellow or Vidalia onions, peeled, halved and thinly sliced", "5 sprigs fresh thyme, plus more thyme leaves for garnish", "1 fresh or dried bay leaf (optional)", "Black pepper", "1 pound cavatappi or elbow pasta", "1 baguette, cut into 1/2-inch slices", "1 garlic clove", "2 tablespoons sherry vinegar, red wine vinegar or white wine vinegar", "3 tablespoons all-purpose flour", "4 cups whole milk", "16 ounces Gruyère, grated (about 5 cups)", "12 ounces white Cheddar, grated (about 4 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. (If you’re planning to bake the macaroni and cheese in a baking dish instead of a skillet, butter 9-by-13-inch baking dish or other 3-quart casserole.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a deep, large (12-inch) ovenproof skillet, melt 2 tablespoons butter over medium-high heat. Add the onions, thyme sprigs and bay leaf, if using, and season with salt and pepper. Cover with a lid, baking sheet or foil and cook, stirring once or twice, until the onions are softened, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover and continue to cook on medium-high, stirring occasionally, until deep golden brown, 20 to 25 minutes. If the onions look dry, add a few tablespoons of water at a time to prevent them from burning, scraping up any browned bits that are stuck to the bottom of the skillet. (You will need to do this several times.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the onions are cooking, heat the oven to 450 degrees. Cook the pasta in the boiling water until 2 minutes shy of al dente; drain and set aside. Rub one side of each baguette slice with garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the onions are a deep golden brown, discard the thyme sprigs and bay leaf and deglaze the skillet with the vinegar until evaporated, scraping up browned bits as you go, about 30 seconds. Add the remaining 2 tablespoons butter. When melted, add the flour and cook, stirring, until the flour begins to stick to the bottom of the pan and has turned a light golden brown, about 3 minutes. Slowly whisk in the milk and season with salt and pepper. Bring to a simmer, whisking often."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve 1 cup of the Gruyère. Carefully add the remaining Gruyère and all the Cheddar to the caramelized onion mixture and carefully stir until melted. If your pan is big enough, add the cooked pasta and stir to combine, or combine the sauce and pasta in the prepared dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the pasta mixture in an even layer in the prepared dish, then top with the baguette slices, garlic-side up. Sprinkle the toasts with the reserved 1 cup Gruyère and season with pepper. Place the skillet or dish on a sheet pan and bake until bubbly and brown in spots, 10 to 15 minutes. If you like a crispier top, broil for a few minutes. Let cool slightly, then garnish with fresh thyme leaves."}]}