{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamed Spinach Pasta", "description": "This pasta nods to everyone’s favorite steakhouse side, and it comes together in no time, making for a fine weeknight meal. One full pound of fresh spinach is cooked down in garlicky butter before cream is added, then simmered until thickened. The cooked pasta is added directly to the sauce, then tossed with ricotta cheese for even more richness. Fettuccine or tagliatelle pasta work best, but the creamy sauce will cling to any long noodles. Top with pine nuts, walnuts or hazelnuts for crunch, or leave the nuts out entirely. Serve as a side to grilled steak, chicken or fish, or serve it on its own, paired simply with a glass of bubbles.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/11/25/dining/ch-creamed-spinach-pasta/ch-creamed-spinach-pasta-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 to 6", "recipeCuisine": "american", "recipeCategory": "dinner, easy, pastas", "keywords": "fettuccine, nutmeg, pasta, ricotta, spinach, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 460}, "recipeIngredient": ["1 cup whole-milk ricotta", "Kosher salt and black pepper", "1 pound long pasta, such as fettuccine or tagliatelle", "3 tablespoons pine nuts (optional)", "4 tablespoons unsalted butter", "3 garlic cloves, thinly sliced", "1 pound fresh baby spinach", "1 cup heavy cream", "1/4 teaspoon grated nutmeg", "Grated pecorino or Parmesan, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the ricotta to a large bowl; season well with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to a boil. Add the pasta and cook according to package instructions until al dente. Reserve 1 cup of pasta cooking water and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare your sauce while the pasta cooks: If using, cook the pine nuts in a deep 12-inch skillet over medium heat until toasted, stirring occasionally to make sure they do not burn, 2 to 3 minutes. Transfer to a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe skillet clean and melt the butter over medium-low heat. Add the garlic and sauté until pale golden, about 2 minutes. Add the spinach, stirring it in by the handful if needed<strong></strong>, and cook until it wilts, adding a few tablespoons of the pasta water to help it along if needed, about 4 minutes. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cream, bring to a simmer over medium heat and cook until sauce begins to thicken slightly, about 2 minutes more. Stir in the nutmeg then season with salt and pepper. Add the cooked pasta directly to the skillet and toss until the noodles are glossy with sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off heat and stir in the prepared ricotta, thinning the sauce with a bit of pasta cooking water if needed. Taste and adjust seasonings as needed. Divide among bowls. Top with pine nuts, if using, and pass grated pecorino or Parmesan at the table."}], "link": "https://cooking.nytimes.com/recipes/1020672-creamed-spinach-pasta"}