{"@context": "http://schema.org", "@type": "Recipe", "name": "Seis Leches Cake", "description": "This recipe for a tres leches cake (a traditional syrup-soaked confection from Latin America) takes a good thing — namely the combination of milks that saturate its crumb — and doubles it. Instead of just the usual three milks (sweetened condensed, evaporated and heavy cream), it calls for six, adding coconut milk, condensed coconut milk and dulce de leche. Like the original version, it’s a dense, puddinglike cake flavored with cinnamon and rum. But here, notes of coconut and caramel lend complexity and even more richness. Serve this in small squares, preferably with a bitter espresso or some tea to sip between syrupy bites.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/01/22/dining/17apperex/17apperex-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "18 servings", "recipeCuisine": "latin american", "recipeCategory": "cakes", "keywords": "coconut milk, dulce de leche, evaporated milk, sweetened condensed coconut milk, sweetened condensed milk, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 506}, "recipeIngredient": ["5 tablespoons/75 grams melted unsalted butter, plus more softened butter for greasing the pan", "1 1/2 cups/190 grams all-purpose flour", "1 cup/200 grams granulated sugar", "2 teaspoons baking powder", "1/2 teaspoon ground cinnamon, plus more for sprinkling", "1/4 teaspoon grated nutmeg", "1/4 teaspoon fine sea salt, plus a pinch", "6 large eggs, separated", "3 tablespoons/45 milliliters whole milk", "2 teaspoons vanilla extract", "1/4 teaspoon cream of tartar", "1 (14-ounce) can unsweetened coconut milk", "1 cup/240 milliliters evaporated milk", "3/4 cup/180 milliliters sweetened condensed coconut milk (a 7-ounce can, or use more regular condensed milk)", "2/3 cup/160 milliliters sweetened condensed milk", "3 tablespoons dark or amber rum", "1 cup/240 milliliters dulce de leche", "1 1/2 cups/360 milliliters heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Butter a 9-by-13-inch baking pan. In a medium bowl, whisk together the flour, 3/4 cup/150 grams sugar, the baking powder, cinnamon, nutmeg and 1/4 teaspoon salt. In a large bowl, whisk together the egg yolks, melted butter, milk and vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer fitted with the whisk or beaters, set on medium speed, beat the egg whites until frothy, about 2 minutes. Add the cream of tartar, and beat until thick, fluffy and white but before peaks form, another 2 to 3 minutes. Add remaining 1/4 cup/50 grams of sugar, a little at a time, and continue beating until the whites are glossy and firm peaks form when the beaters are lifted, another 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk half the flour mixture into the yolks (it will seem like paste). Whisk a quarter of the egg whites into the yolk mixture to lighten it. Using a rubber spatula, gently fold in another quarter of the whites. Sift half of the remaining flour mixture over the batter and fold in. Fold in another quarter of the egg whites followed by the rest of the sifted flour and finally the rest of the whites. Scrape batter into the pan and smooth the top with the spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the cake is golden and a toothpick inserted into the center comes out clean, about 25 minutes. Transfer to a wire rack to cool for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake is cooling, in a small saucepan over medium heat, stir together the coconut milk, evaporated milk, condensed coconut milk, condensed milk, rum and a pinch of salt. Heat until steaming, stirring to dissolve any lumps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a fork to poke holes all over the top of the warm cake, then cut it into 18 pieces but don’t take the pieces out of the pan. Pour milk mixture evenly over the cake. Cover and chill cake for at least 8 hours or preferably overnight (or up to 3 days)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "No more than 4 hours before serving, spread 3/4 cup/180 milliliters dulce de leche over top of the cake. Whip the cream with the remaining 1/4 cup/60 milliliters dulce de leche until thick and mousse-like. Spread the whipped cream on the cake, and sprinkle with more cinnamon."}], "link": "https://cooking.nytimes.com/recipes/1020805-seis-leches-cake"}