{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Truffle Tart", "description": "This special occasion dessert takes a little time to put together, but it's much easier to make than it looks. It starts with a simple press-in chocolate cookie crust that doesn’t require a rolling pin or chilling. The crust is filled with dark chocolate ganache and a layer of milk chocolate truffles. The truffles can be finished simply with cocoa powder, or coated in finely chopped nuts, powdered sugar or a colorful, tart powder made by crushing freeze-dried fruit. (Or you can skip the truffle recipe entirely and instead use store-bought truffles.) This is the moment to splurge on high-quality chocolate, as you’ll taste it in the final result. Don’t be tempted to use chocolate chips, as the added stabilizers make it difficult to achieve a shiny, creamy ganache. For picture-perfect slices, dip your knife in warm water before each cut and wipe it dry after.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2020/02/11/dining/em-truffle-tart/em-truffle-tart-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "One 9-inch tart", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "butter, chocolate, cocoa powder, dark chocolate, heavy cream, milk chocolate, sugar, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "recipeIngredient": ["2/3 cup/160 milliliters heavy cream", "14 ounces/400 grams high-quality bar milk chocolate (not chips), finely chopped", "1 tablespoon unsalted butter, at room temperature", "Cocoa powder, powdered sugar, finely chopped nuts, unsweetened shredded coconut, or freeze-dried fruit powder (see Tip), for finishing", "1/2 cup/115 grams unsalted butter (1 stick), at room temperature", "1/4 cup/50 grams granulated sugar", "1 large egg, at room temperature", "1 teaspoon vanilla extract", "1 1/2 cups/200 grams all-purpose flour", "1/3 cup/30 grams cocoa powder", "1/2 teaspoon fine sea salt", "1/2 cup/120 milliliters heavy cream", "6 ounces/170 grams high-quality, bar dark chocolate (not chips), finely chopped", "2 tablespoons unsalted butter, at room temperature", "2 to 3 pinches kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the milk chocolate truffles: In a small pot, bring the cream to a simmer over medium heat. Place the milk chocolate and butter in a medium bowl. Pour the hot cream over the chocolate and let sit for 1 to 2 minutes. Start to stir the chocolate in the center in small circles, gradually widening the circles as the mixture comes together and stirring until mixture is shiny, smooth and glossy. (If the chocolate doesn’t fully melt, place the bowl over a medium pot of barely simmering water or in the microwave for 15 to 20 seconds and gently stir until smooth.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the mixture into a 9-inch cake pan or other shallow baking dish. Let firm for 25 to 30 minutes until it appears set but is firm enough to be scooped. If it’s still not set, pop it into the refrigerator until it reaches desired consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the ganache firms, make the crust: In the bowl of a stand mixer fitted with the paddle attachment, cream the butter and sugar on medium-low speed until smooth, 2 to 3 minutes. Add the egg and vanilla, and mix on medium speed to combine. Scrape the bowl well. Add the flour, cocoa and sea salt, and mix on low speed until dough is smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a 9-inch tart pan (preferably with a removable base) on a baking sheet. Turn out the dough into the prepared tart pan and use your fingers to press it into the pan and up the sides in an even layer. Smooth the dough with your fingers to even out any thicker spots, taking particular care in the corners to make sure it’s not too thick. Use a paring knife held flush against the rim of the pan, and trim away the excess dough, leaving a clean edge. Dock the base of the dough a few times with a fork. (The crust is ready to be baked now, or it can be chilled for 30 minutes or up to overnight, if desired.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill the crust while you heat the oven to 350 degrees and place a rack in the center of the oven. Place the tart pan onto a baking sheet and bake until the crust appears firm and set, 18 to 20 minutes. Cool completely. If desired, gently slide the outside ring off the tart to remove it, and slide an offset spatula around the base of the tart to release it from the base of the pan. Gently transfer the crust to a serving plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the crust bakes, shape the milk chocolate truffles: Line a baking sheet with parchment paper. Scoop heaping teaspoon-size rounds of the ganache onto the baking sheet; you should have about 40 (1-inch) truffles. Chill for 5 to 10 minutes to firm slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add your desired truffle coatings to small, shallow bowls. Working a few at a time, roll the chilled truffles between your hands to form them into neat 1-inch spheres. (Dust your hands and the balls lightly with cocoa powder in between rolling if it’s too sticky.) Place each truffle into the coating of choice and roll until fully coated, then return them to the baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the ganache: In a small pot, bring the cream to a simmer over medium heat. Place the dark chocolate and butter in a medium bowl. Pour the hot cream over the chocolate and let sit for 1 to 2 minutes. Start to stir the chocolate in the center in small circles, gradually widening the circles as the mixture comes together and stirring until shiny, smooth and glossy. (If the chocolate doesn’t fully melt, place the bowl over a medium pot of barely simmering water, or in the microwave for 15 to 20 seconds, and gently stir until smooth.) Pour the mixture into the cooled tart crust and spread into an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the truffles to the tart crust, packing them relatively tightly into the crust and pressing them into the ganache in a single, even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill the tart for 30 minutes. When ready to serve, dip your knife in warm water before each cut and wipe it dry after. Store the finished tart at room temperature, in an airtight container or wrapped tightly with plastic wrap, for up to 4 days."}], "link": "https://cooking.nytimes.com/recipes/1020872-chocolate-truffle-tart"}