{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate-Chip Banana Bread", "description": "This recipe uses four bananas, which is more than is typical for a single loaf. The natural sugars from the ripe, brown bananas keep the bread incredibly moist for up to one week, even sliced. The high moisture of the batter can make it tricky to determine doneness, so take care not to underbake the the loaf. It should have a dry, shiny, cracked surface, and a tester inserted into the thickest portion should come out with a few moist crumbs attached. Serve this banana bread for breakfast or brunch, or even as a simple dessert, topped with a scoop of coffee ice cream.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2020/02/25/dining/em-chocolate-chip-banana-bread/em-chocolate-chip-banana-bread-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "One 9-inch loaf", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, snack, cakes", "keywords": "banana, brown sugar, chocolate, greek yogurt, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 498}, "recipeIngredient": ["Nonstick spray, as needed", "4 very ripe medium bananas, peeled", "6 tablespoons/85 grams unsalted butter, melted", "1/3 cup/80 milliliters plain Greek yogurt", "1 cup/220 grams light or dark brown sugar", "2 large eggs", "2 teaspoons vanilla extract", "2 cups/255 grams all-purpose flour", "1 1/2 teaspoons baking soda", "1/2 teaspoon fine sea salt", "1 cup/135 grams finely chopped chocolate or mini chocolate chips (see Tip)", "3/4 cup/130 grams coarsely chopped toasted nuts, such as almonds, walnuts or pecans (optional)", "Coarse sanding or turbinado sugar, as needed for finishing (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Lightly grease a 9-by-5-inch loaf pan with nonstick spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mash the bananas coarsely using a fork. They should be fully broken apart, but it’s OK if some larger lumpy pieces remain. Whisk in the melted butter, yogurt, brown sugar, eggs and vanilla until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the flour, baking soda and salt to combine. Add the flour mixture to the banana mixture and stir to combine using a silicone spatula or wooden spoon. Scrape the sides and base of the bowl well to make sure the mixture is uniformly combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently stir in the chocolate until combined, then pour the batter into the prepared loaf pan and spread into an even layer. If using, sprinkle the surface generously with coarse sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pan to the oven and bake until the edges of the loaf start to pull away from the edge of the pan, and a tester inserted into the center comes out with just a few moist crumbs attached, 60 to 75 minutes. If the top of the loaf is becoming too dark before it’s baked through, loosely cover with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer from the oven to a cooling rack and run a thin knife around the edge of the banana bread to separate it from the pan. Let cool in the pan for 10 minutes before unmolding and cooling completely."}], "link": "https://cooking.nytimes.com/recipes/1020899-chocolate-chip-banana-bread"}