{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Glass Noodles With Shiitake Mushrooms and Cabbage", "description": "Glass noodles readily soak up their surrounding seasonings — and this dish delivers a smack of umami with curry powder, soy sauce, sesame oil and fresh ginger. Also known as bean thread noodles or cellophane noodles, gluten-free glass noodles are often combined with vegetables and used as a filling for dumplings or spring rolls, or added to soups, braised dishes or stir-fries for heft. Here, the transparent threads are tossed with curry-spiced Napa cabbage and dried shiitake mushrooms, which have more complex, earthy notes than fresh. Bright cilantro and ginger round out the dish, which is equally good warm or at room temperature.", "author": {"@type": "Person", "name": "Corinne Trang"}, "image": "https://static01.nyt.com/images/2019/04/02/dining/ct-cellophane-noodles/ct-cellophane-noodles-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "noodles, vegetables", "keywords": "cilantro, curry powder, ginger, glass noodles, napa cabbage, shiitake, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 72}, "recipeIngredient": ["4 bundles dried glass noodles (about 5 ounces)", "8 dried shiitake mushrooms (about 1/2 ounce)", "3 tablespoons grapeseed oil", "2 garlic cloves, peeled and minced", "1 (2-inch) piece fresh ginger, peeled and julienned", "1 scallion, trimmed and finely chopped", "1 pound Napa or green cabbage (about 1/3 medium cabbage), cored and thinly sliced into 1/4-inch-wide strips", "1 teaspoon Indian or Vietnamese curry powder", "4 tablespoons soy sauce", "1 tablespoon toasted sesame oil", "3 tablespoons fresh cilantro leaves and stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the noodles in a large bowl, cover with room-temperature water and soak until pliable, about 30 minutes. Drain. Place dried shiitakes in a medium bowl, cover with room-temperature water and soak until hydrated and soft, about 30 minutes. Drain the mushrooms, remove their stems, and julienne the caps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the noodles and mushrooms soak, heat the grapeseed oil in a large lidded skillet over medium-high, uncovered. Stir-fry the garlic, ginger and scallion until light golden, about 1 minute. Add the shiitakes and continue to stir-fry until golden, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the cabbage and curry powder, then 3 tablespoons soy sauce. Reduce heat to medium, cover and cook until the cabbage is wilted and has given up its natural juices, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the drained noodles and remaining 1 tablespoon soy sauce. Increase heat to high, and stir-fry until noodles absorb the juices and are cooked through yet still chewy, 1 to 2 minutes. Drizzle with sesame oil, toss well, sprinkle with cilantro and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020148-spicy-glass-noodles-with-shiitake-mushrooms-and-cabbage"}