{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Ribollita With Smoked Mozzarella Toasts", "description": "This classic Italian vegetable soup is a wonderful way to use up stale bread and leftover vegetables — and can be prepared <a href=\"https://cooking.nytimes.com/recipes/1016052-ribollita\">in a pot</a>, <a href=\"https://cooking.nytimes.com/recipes/1020826-pressure-cooker-ribollita-with-smoked-mozzarella-toasts\">in a pressure cooker</a>, or in a slow cooker. With the exception of sliced sandwich bread (which is too flimsy), any crusty bread will work here: sourdough, ciabatta, multigrain and so on. (Since you’re toasting it, it’s not necessary for the bread to be stale, but it certainly can be.) The olive-oil-rich sautéed vegetables melt into the soup as it simmers, but you can throw in other leftover cooked vegetables at the end, with the greens.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/01/22/dining/sg-slow-cooker-ribollita/merlin_167531598_27df73c1-f80e-4d12-ac4d-cdff5ac668f8-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, soups and stews", "keywords": "cannellini beans, celery, fennel, kale, leek, lemon, mozzarella, onion, rosemary, thyme, tomato, white wine, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 62}, "recipeIngredient": ["1/4 cup olive oil, plus more for drizzling", "1 large yellow or red onion, finely chopped", "Kosher salt and black pepper", "1 large leek, trimmed, white and light green parts sliced", "3 celery stalks, finely chopped", "1 small fennel bulb, bulb cored and finely chopped, fronds reserved", "14 garlic cloves, smashed and roughly chopped", "2 dried bay leaves", "1 teaspoon red-pepper flakes, plus more for serving", "1 cup dry white wine", "5 cups chicken or vegetable stock", "1 1/2 cups dried white beans, such as cannellini or great Northern (no need to soak)", "1 (15-ounce) can crushed tomatoes", "3 fresh thyme sprigs or 1 teaspoon dried thyme", "1 fresh rosemary sprig or 1/2 teaspoon dried rosemary", "2 tablespoons fresh lemon juice (from about 1/2 lemon)", "1 bunch kale, chard or collards (about 12 ounces), stemmed and finely chopped, or 1 (10-ounce) bag frozen chopped spinach or kale", "2 teaspoons balsamic vinegar, preferably aged", "8 thick slices crusty bread", "1 garlic clove, cut in half", "Olive oil", "8 ounces smoked or regular mozzarella, cut into 8 (1/4-inch-thick) slices"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large Dutch oven or skillet over medium. Add the onion, season with salt, and cook, stirring occasionally, until limp and translucent, 6 to 8 minutes. Add the leek, celery and fennel, season with salt, and cook, stirring occasionally, until softened and fragrant, about 8 minutes. Add the chopped garlic, bay leaves, red-pepper flakes and white wine; season generously with black pepper. Stir well and let the wine come to a simmer before turning off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the mixture into a 6- to 8-quart slow cooker. Add the stock, beans, tomatoes, thyme, rosemary and lemon juice. Cook until the beans are tender and creamy, about 6 hours on high or 12 hours on low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before serving, remove and discard the bay leaves and herb sprigs. Switch the slow cooker to high (if it’s not already), and stir in the greens and vinegar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the greens cook while you make the toasts: Turn on your broiler. Rub the bread slices with the halved garlic and drizzle them with olive oil. Position a rack 6 inches from the broiler, then toast sliced bread under the broiler until very light golden, 1 to 2 minutes. Add 1 slice of mozzarella to each toast and broil until softened and browned in spots. Taste the soup and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the soup among bowls and add a mozzarella toast to each bowl. Garnish with the reserved fennel fronds, and additional black pepper or red-pepper flakes, if desired."}], "link": "https://cooking.nytimes.com/recipes/1020825-slow-cooker-ribollita-with-smoked-mozzarella-toasts"}