{"@context": "http://schema.org", "@type": "Recipe", "name": "Puff Puff", "description": "The genius of puff puff is in the simplicity of the dough: A nutmeg-spiked batter, a bit of patience for the yeast to rise and time to fry up the balls will result in the most delightful little puffs. If the batter seems wet, you are on the right track. The consistency should be similar to a yeasted pancake or waffle batter. Tossing the fried dough in spiced sugar is optional, but recommended: The added layer creates an irresistible crunch. Enjoy warm or at room temperature.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2019/06/26/dining/24Nigerianrex11/merlin_156460035_2fc9b7f7-a6a5-4ead-8ff7-177d150e5ebc-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "8 to 10 servings (about 32 puffs)", "recipeCuisine": "african", "recipeCategory": "snack, finger foods, pastries", "keywords": "active dry yeast, allspice, cloves, nutmeg, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 86}, "recipeIngredient": ["1 1/2 cups/360 milliliters warm water or whole milk (110 degrees)", "4 teaspoons/15 grams active dry yeast", "2/3 cup/135 grams granulated sugar", "3 cups/385 grams all-purpose flour", "1 tablespoon/10 grams kosher salt", "1/2 teaspoon grated nutmeg", "3 to 4 cups canola oil or other neutral oil, for frying", "1/2 cup/100 grams granulated sugar", "1/2 teaspoon freshly grated nutmeg", "1/4 teaspoon ground allspice", "Pinch of ground cloves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the warm water, yeast and 1 tablespoon sugar. Let sit until foamy, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, combine the flour, salt, nutmeg and the remaining sugar. Make a well in the center and pour in the yeast mixture once it’s foamy. Combine, stirring with a wooden spoon, to incorporate all the ingredients into a smooth batter. The batter should be wet and slightly loose, similar to a yeasted waffle batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the bowl with a clean kitchen towel, and allow dough to double in size, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the spiced sugar: In a medium bowl, toss the sugar, nutmeg, allspice and cloves to combine; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 1 inch of oil into a large, deep skillet. Line a baking sheet with a rack or paper towels to absorb excess oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the batter has doubled in size, heat the oil over medium-high to 350 degrees. Drop tablespoonfuls of batter into the hot oil, working in batches to avoid crowding the skillet. Fry the puff puff, turning frequently until golden brown all over and cooked through, 5 to 6 minutes per batch. (Be careful not to let the oil get too hot or the exteriors will become overly dark before the interiors are cooked through.) Move the puff puff to the rack or paper towels to drain and repeat the process until all the batter has been fried."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the puff puff in the spiced sugar to coat while still warm. Enjoy warm or at room temperature."}]}