{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish With Sizzling Olive Butter", "description": "Sizzling butter is an excellent base for several classic sauces for fish, including amandine and meunière. Here, garlic, sliced olives (try a mix of green and black), fennel seeds and lime juice are thrown into the pan, adding tangy, bright and aromatic flavors. You can use this sauce for any kind of fish, whether pearly fillets of cod or meaty tuna or salmon. It even works with shrimp and chicken breasts. After all, there are few things that aren’t improved by a drizzle of garlicky melted butter. Serve this over rice or with crusty bread to catch all that butter.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/01/29/dining/24appe1/merlin_167225676_7b095de0-51c7-4d27-b5fb-fb5208979918-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weekday, seafood", "keywords": "cilantro, dill, olives, whitefish fillet, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 270}, "recipeIngredient": ["1/4 cup unsalted butter (1/2 stick)", "1 tablespoon extra-virgin olive oil", "1 cup mixed olives, such as Kalamata, Castelvetrano, Moroccan or Picholine, pitted and sliced", "2 garlic cloves, minced or finely grated", "1/2 teaspoon fennel or coriander seeds, coarsely crushed (use the flat side of your knife or a mortar and pestle)", "4 (1-inch-thick) pieces flaky white fish fillet, such as cod (about 6 ounces each), patted dry", "Kosher salt and freshly ground black pepper", "2 lime wedges, plus more for serving", "1/4 cup chopped cilantro or parsley, leaves and tender stems", "1/4 cup chopped dill, leaves and tender stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Heat a large, oven-safe skillet over medium. Add butter and oil, and cook until butter melts and starts to sizzle, 1 to 2 minutes. Stir in olives, garlic and fennel or coriander, and cook until fragrant, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season fish fillets with salt and pepper, then nestle them in one layer in the skillet. Carefully spoon some of the butter mixture over the fish, basting the fillets, then transfer pan to the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until fish is opaque and flaky, 8 to 13 minutes, basting halfway through. Remove from oven and transfer fillets to serving plates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze a wedge or two of lime into the butter mixture and spoon sauce over fish. Top with black pepper, cilantro and dill, with extra lime wedges on the side for squeezing."}], "link": "https://cooking.nytimes.com/recipes/1020813-fish-with-sizzling-olive-butter"}