{"@context": "http://schema.org", "@type": "Recipe", "name": "Sous-Vide Rib Steaks With Spicy Salsa Verde", "description": "When you invest in really good rib steaks, you don’t want to mess things up. Cooking them with a sous-vide machine until they are done to taste, then searing them on the grill until charred at the edges gives you the ultimate control.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/07/10/dining/05sousviderex1/05sousviderex1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, barbecues, meat", "keywords": "cilantro, harissa, mint, rib steak, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 185}, "recipeIngredient": ["2 bone-in rib steaks, each 1 1/2-inch thick", "Kosher salt and freshly ground black pepper", "2 garlic cloves, mashed to a paste or finely grated", "6 fresh thyme sprigs", "Flaky sea salt, for serving (optional)", "1/2 cup finely chopped fresh cilantro leaves and tender stems", "3 tablespoons chopped fresh mint", "1 tablespoon minced fresh thyme leaves", "2 scallions, white and light green parts only, thinly sliced", "1 serrano chile or jalapeño, halved, seeded and minced", "1 garlic clove, finely grated or mashed to a paste", "1 1/2 tablespoons fresh lime juice, plus more as needed", "1 teaspoon harissa or other hot sauce", "1/4 teaspoon ground cumin", "1/2 teaspoon fine sea salt, plus more as needed", "1/4 teaspoon freshly ground black pepper", "1/3 cup extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously season steaks all over with salt and pepper. Rub garlic paste evenly over meat, then cover with thyme sprigs. Place steaks in a sous-vide bag and refrigerate for at least 6 hours and preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a pot with water, add the sous-vide machine and set the temperature to your ideal steak temperature, 122 to 126 degrees for rare."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower bag into heated water, weighing it down if necessary to submerge. Cook steaks for 1 1/2 hours. If you’d like to dry out the cooked meat to get a better char, place it on a wire rack set over a baking sheet and refrigerate for 6 to 36 hours. Otherwise, you can go straight to searing and serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, light the grill, or heat the broiler and place a rack 4 inches from heating element."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove thyme from meat and pat meat dry if you didn’t already let it dry out. Grill or broil steaks until charred all over, 2 to 5 minutes total. (Make sure to char the fat on the bone as well as both meaty sides.) Transfer to a cutting board and let rest for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the salsa verde: In a large bowl, stir together the cilantro, mint, thyme, scallions, chile, garlic, lime juice, harissa, cumin, salt and pepper until well combined. Whisk in the olive oil, then taste and add more salt and lime juice, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, slice steak and drizzle with salsa verde, making sure to stir it well to distribute the herbs before using. Season with flaky salt if you like, and freshly ground black pepper."}]}