{"@context": "http://schema.org", "@type": "Recipe", "name": "Antoni Porowski’s French Omelet With Cheese and Chives", "description": "There’s nothing quite like a classic omelet. On Netflix’s “Queer Eye,” Antoni Porowski, the food-focused member of the Fab 5, teaches the people he helps make over how to nourish themselves in an accessible way. This simple but sophisticated recipe, adapted from his cookbook, “Antoni in the Kitchen,” follows in that vein. It requires few ingredients and a dextrous hand: You’ll want to consider your ingredients carefully, and take care to not overmix the eggs. Keep it simple, or add mix-ins. Serve it alone, or pair it, as he suggests, with a favorite salad.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2019/09/12/dining/ap-omelet/ap-omelet-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "1 serving", "recipeCuisine": "french", "recipeCategory": "breakfast, brunch, dinner, for one, weekday", "keywords": "butter, chives, eggs, gruyère, pepper, salt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "recipeIngredient": ["2 large eggs", "2 1/2 tablespoons unsalted butter, preferably European-style or cultured", "Pinch of kosher salt", "1/3 cup coarsely grated Gruyère, sharp Cheddar or Fontina", "Flaky sea salt, such as Maldon or kosher salt", "Black pepper", "1 tablespoon finely chopped fresh chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk eggs in a medium bowl until well combined and smooth, taking care not to whip in too much air. The point is to combine the yolks and whites very well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small nonstick skillet over medium-low, heat 1 tablespoon butter until the butter has melted and just begins to foam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in the eggs. Working quickly with one hand, gently move the pan in a circular motion over the heat (this will keep the eggs moving and evenly cooking). With your other hand, use a small rubber spatula (or chopsticks) to stir the eggs in a loose figure-eight pattern, creating small curds and scraping down the side of the skillet as you go. Continue until the eggs are mostly cooked through but just a little runny on top, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the heat and sprinkle the omelet with a pinch of salt, then sprinkle the cheese down the center. Gently shake the pan so that the omelet shifts toward the side of the pan opposite the handle and up the side of the pan. The part of the omelet above the edge of the pan should fold back over on itself – use your rubber spatula to give it a hand, if it doesn’t."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide 1 tablespoon of butter underneath the omelet that’s still in the pan. (This will help keep the omelet tender and soft – and it tastes really good.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the spatula, roll up the omelet, then flip it seam-side down onto a warm serving plate. Slide the remaining 1/2 tablespoon butter across the top, then sprinkle with a pinch each of salt and pepper and the chives. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1020461-antoni-porowskis-french-omelet-with-cheese-and-chives"}