{"@context": "http://schema.org", "@type": "Recipe", "name": "Tostones (Fried Green Plantains)", "description": "A staple dish throughout the Caribbean and Latin America, tostones are crisp, flattened plantains that are often served as appetizers and side dishes. Unlike sweet maduros, which are made with very ripe, almost black, yellow plantains, savory tostones are made with unripe green plantains. Tostones are fried twice: The first fry sears the cut sides of the plantains, establishing a base layer of color; the second fry ensures that every edge is golden and crunchy. Tostoneras, wooden tools designed to create the perfect tostone shape, come in handy here, but a flat-bottomed cup will do just fine in its place.", "author": {"@type": "Person", "name": "Kiera Wright-Ruiz"}, "image": "https://static01.nyt.com/images/2019/10/03/dining/kwr-tostones/merlin_161590410_e9698edc-b306-4d49-8a92-88fba092a627-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "3 to 4 servings", "recipeCuisine": "caribbean, latin american", "recipeCategory": "finger foods", "keywords": "appetizer, side dish, plantain, oil, salt, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 55}, "recipeIngredient": ["2 green (unripe) plantains (about 6 ounces each)", "Neutral oil, such as vegetable or canola oil, for frying", "Kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim and discard the ends of the plantains. Use a paring knife to cut a slit along the length of the plantain to easily remove the peel, carefully avoiding cutting into the flesh. If the peel is too firm, use a spoon to lift the edges, then discard the peel. Slice the plantain crosswise into 1-inch rounds (about 8 pieces per plantain)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat about 1/8-inch vegetable oil over medium. When the oil shimmers, add the plantains, flat-side down. Fry until beginning to turn golden, about 1 minute per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While keeping the heat on, transfer plantains to a cutting board. Working with one piece at a time, use a tostonera or large flat-bottomed cup to gently press each plantain to about 1/2-inch thick. (If using a cup, keep it as centered as possible to flatten the plantains evenly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches if necessary to avoid crowding the pan, pan-fry the flattened plantains until golden-brown, 1 to 2 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, transfer tostones to a paper towel-lined plate to drain. While hot, season with salt to taste. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1020516-tostones-fried-green-plantains"}