{"@context": "http://schema.org", "@type": "Recipe", "name": "Boozy Cherry Walnut Tart", "description": "Cherries in winter may sound counterintuitive, but like frozen peas and corn, frozen cherries are, well, pretty good. Baked on a bed of easy press-in crust, the boozy cherries sink into the almost-frangipane mixture which soaks up much of the juiciness cherries are known for. The trick to a nice, crunchy bottom tart shell is baking longer than you think, so make sure you give it the full time recommended. ", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/12/18/dining/17Romanrex2/merlin_162383766_eaed364a-a79a-47fd-83c1-4f7d82df9db1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings ", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "bourbon, cherries, walnut, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 115}, "recipeIngredient": ["1 2/3 cups/215 grams all-purpose flour", "2 tablespoons granulated sugar", "1 1/2 teaspoons kosher salt", "3/4 cup/170 grams unsalted butter (1 1/2 sticks), melted", "1 cup/90 grams walnut pieces or halves (or use almonds)", "2 tablespoons unsalted butter, chilled ", "1/4 cup plus 1/3 cup/115 grams granulated sugar, plus more for finishing the tart", "5 tablespoons/40 grams all-purpose flour", "Kosher salt", "1 large egg ", "1 pound/455 grams pitted cherries, thawed if frozen ", "2 tablespoons bourbon ", "2 tablespoons finely grated orange zest "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Mix flour, sugar and salt in a medium bowl. Pour butter over the dry ingredients and, using your hands, mix together until you’ve got a Play-Doh-like texture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press crust into a 9-inch tart pan with a removable bottom. (Alternatively, use a 9-inch cake pan lined with parchment; the crust can go about 3/4 inch up the sides of the pan.) Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Heat oven to 350 degrees. Toast walnuts on a rimmed baking sheet until well browned and fragrant, 5 to 8 minutes; remove from heat and let cool. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulse walnuts, butter, 1/4 cup/50 grams sugar, 2 tablespoons flour and a pinch of kosher salt in a food processor until finely ground. Add the egg and pulse just to blend. Spread walnut mixture on the bottom of the prepared crust. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss cherries with bourbon, orange zest, remaining 1/3 cup/65 grams sugar, remaining 3 tablespoons flour and a pinch of salt. Scatter cherries over the walnut mixture and sprinkle with a bit more sugar to finish. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place tart on a rimmed baking sheet lined with foil and bake until the crust is golden brown at the edges and the cherries are thick and saucy, 55 to 65 minutes. Let cool at least 30 minutes before removing from the pan and slicing. (If you can wait an hour to let the juices fully settle, even better.)"}], "link": "https://cooking.nytimes.com/recipes/1020709-boozy-cherry-walnut-tart"}