{"@context": "http://schema.org", "@type": "Recipe", "name": "Salted Apricot-Honey Cobbler", "description": "Unlike most cobblers, which ask you to chop or slice the fruit, this one is meant to preserve the integrity of the apricots, which bake until totally tender, jammy and saucy, while still maintaining their shape and texture. The idea is to spoon out one of the barely sweetened, oaty shortcakes from the pan and then top it with the roasted, honey-sweetened fruit. Ice cream is optional but recommended.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/08/14/dining/13romanrex4/13romanrex4-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "apricot, honey, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 79}, "recipeIngredient": ["1 1/3 cups/175 grams all-purpose flour", "1/2 cup/55 grams quick-cooking oats", "1/4 cup/50 grams granulated sugar, plus more for sprinkling", "1 tablespoon baking powder", "3/4 teaspoon kosher salt", "1/2 cup/115 grams unsalted butter (1 stick), cut into 1-inch pieces, chilled", "1/2 cup/120 milliliters heavy cream, plus more for brushing shortcakes", "Flaky sea salt, for sprinkling", "2 pounds/900 grams apricots, pitted and halved (or quartered if very large)", "1/4 cup/60 milliliters honey", "1 tablespoon cornstarch", "2 tablespoons fresh lime or lemon juice", "Pinch of kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the shortcake topping: Combine flour, oats, sugar, baking powder and salt in a large bowl. Using your hands, rub the butter into the flour mixture until there are no large chunks left. Add 1/2 cup heavy cream and mix just until blended, then turn the dough out onto lightly floured work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Knead dough just until it’s no longer super-sticky, and then pat the dough out so it’s 1-inch thick. (The shape here doesn’t matter; you’ll be cutting out circles.) Using a 2-inch-round cutter, or something approximately that size (water glasses and Mason jars also work), punch out as many shortcakes as you can. Gently gather and re-pat the scraps so they’re 1-inch thick and repeat until all the dough is used. You should have 8 or 9 shortcakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: Toss apricots with honey, cornstarch, lime juice and kosher salt in a 2-quart baking dish (an 8-by-11-inch or 9-by-13-inch dish will work), then flip the fruit so they are all cut-side up. The apricot pieces will overlap a bit, and this is fine. Top with shortcakes; they will puff and spread quite a bit, so leave them well spaced. The idea is to have lots of fruit exposed once baked, so don’t worry about the shortcakes covering every square inch. Brush the shortcakes with cream, and sprinkle with a little bit of sugar and flaky sea salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until shortcakes are golden brown and the juices of the apricot have thickened and bubbled up around the edges of the baking dish, 40 to 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and let cool slightly before eating (though it’s even better at room temperature). This cobbler is the best the day it’s made, but it can be baked a day ahead and stored tightly wrapped at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1020393-salted-apricot-honey-cobbler"}