{"@context": "http://schema.org", "@type": "Recipe", "name": "Sous-Vide Peanut-Ginger Pork With Celery Slaw", "description": "Using a sous-vide machine to cook lean cuts like pork tenderloin produces silky, pink-centered meat that is juicy and tender. Here, the pork is cooked in a peanut-sesame sauce spiked with loads of ginger and garlic. As a crunchy, cool contrast, the pork is served with a slawlike mix of thinly sliced celery and fennel, and plenty of cilantro. Serve this with coconut rice or rice noodles, with more of the spicy sauce drizzled on top.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/07/05/dining/05sousviderex2/05sousviderex2-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, meat", "keywords": "fennel, peanut, peanut butter, pork tenderloin, sesame oil, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 189}, "recipeIngredient": ["3 tablespoons smooth peanut butter", "2 tablespoons sesame oil", "2 tablespoons soy sauce", "2 tablespoons fresh lime juice", "1 tablespoon finely grated ginger", "2 teaspoons dark brown sugar", "2 teaspoons Sriracha or chile-garlic paste", "1 1/2 teaspoons fish sauce", "3 garlic cloves, finely grated or minced", "2 (1-pound) pork tenderloins, trimmed", "Extra-virgin olive oil, as needed", "2 teaspoons toasted sesame oil, plus more as needed", "2 teaspoons rice vinegar or lime juice, plus more as needed", "1/2 teaspoon freshly ground black pepper", "1/4 teaspoon fine sea salt, plus more as needed", "1 large or 2 small celery stalks, cut crosswise into thirds, then very thinly sliced lengthwise", "1 cup thinly sliced fennel bulb", "1/4 cup thinly sliced scallions", "1/4 cup fresh cilantro leaves, plus more for garnish", "Chopped roasted peanuts, for garnish", "Sesame seeds, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a pot with water, add the sous-vide machine and set the temperature to 135 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the sauce: In a small bowl, whisk together peanut butter, sesame oil, soy sauce, lime juice, ginger, sugar, Sriracha, fish sauce and garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pork in a sous-vide bag, then pour sauce all over meat. Lower bag into heated water, weighing the bag down if necessary, and cook pork for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat broiler and place a rack 4 inches from heating element."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pork from sous-vide bag and transfer to a rimmed baking sheet. Pour remaining cooking liquid into a small saucepan. Bring sauce to a simmer over high and let cook until slightly thickened, about 2 minutes. Cover to keep warm, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle pork with olive oil and broil until charred in spots, 2 to 3 minutes. Transfer to a cutting board and let rest, 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the celery salad: In a large bowl, whisk together sesame oil, rice vinegar, pepper and salt. Toss with celery, fennel, scallions and cilantro. Taste and add more salt, sesame oil and rice vinegar if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, slice pork and drizzle with sauce. Top with celery salad, peanuts and sesame seeds, if you like. Garnish with cilantro leaves."}], "link": "https://cooking.nytimes.com/recipes/1020300-sous-vide-peanut-ginger-pork-with-celery-slaw"}