{"@context": "http://schema.org", "@type": "Recipe", "name": "Carne Guisada con Papas", "description": "Adapted from Adán Medrano, a Houston-based chef and writer, this steak-and-potato guisada, or stew, uses technique and time to draw out flavor from just a handful of ingredients. Beef and potatoes are centuries-old pantry essentials in South Texas, and this dish is served in homes and family-run restaurants all over the region. While many restaurants tend to cook the steak in large pieces, cutting the meat into small cubes allows the beef to soak up more flavor. The key is the Texas Mexican spice blend — black peppercorns, cumin and garlic — plus a little fresh Serrano. Serve with tortillas and an optional garnish of cilantro and chile.", "author": {"@type": "Person", "name": "Rachel Wharton"}, "image": "https://static01.nyt.com/images/2019/04/24/dining/22mexicanrex1/merlin_151791759_4b7356f8-215a-4b11-ba24-8a689f8d0570-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "american, mexican", "recipeCategory": "dinner, meat, soups and stews", "keywords": "bottom round steak, serrano chile, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 141}, "recipeIngredient": ["2 large garlic cloves, peeled and minced", "1 Serrano chile, minced, plus additional sliced Serrano for garnish (optional)", "15 whole black peppercorns", "1/4 teaspoon cumin seeds", "2 tablespoons canola oil", "1 1/2 pounds bottom round steak or beef chuck, fat trimmed and meat cut into 1/2-inch cubes", "1 large white onion, halved and sliced 1/4-inch thick", "1 1/2 teaspoons all-purpose flour", "Kosher salt", "2 medium waxy potatoes, cut into 1/2-inch cubes", "Warmed corn or flour tortillas, for serving", "Fresh cilantro leaves, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a mortar and pestle to mash the garlic, minced chile, peppercorns and cumin seeds into a smooth paste. Add 1/4 cup water and mash until the paste is incorporated into the water. Transfer the mixture to a measuring cup. (Alternately, blend the garlic, minced chile, peppercorns and cumin seeds in a blender with about 1/4 cup water, occasionally scraping down the sides of the blender until very well blended, about 5 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon oil in a Dutch oven or large pot over medium. Add half the steak and cook, stirring occasionally, until browned on all sides, about 8 minutes. Transfer the browned meat to a plate and repeat with the remaining oil and meat. Return the browned meat to the Dutch oven then add the onion and cook, stirring occasionally, until translucent, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the flour and 1 teaspoon salt over the beef and stir to incorporate, then add the blended garlicky liquid and just enough water to barely cover the meat (about 2 cups). Increase the heat to medium-high and use a wooden spoon to scrape the bottom of the Dutch oven, releasing any browned bits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the liquid to a boil, then immediately lower the heat so that it cooks at a low simmer. Cover the pot and cook until the meat is tender, 1 1/2 to 2 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lid and stir in the cubed potatoes. Let the guisada cook, stirring occasionally, until the potatoes are tender and the sauce has thickened slightly, about 15 minutes. Season to taste with salt. Divide among bowls and serve with hot tortillas, plus cilantro and sliced chile, if using."}], "link": "https://cooking.nytimes.com/recipes/1020065-carne-guisada-con-papas"}