{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Sausage With Peppers and Tomatoes", "description": "Good, flexible and fast, this recipe is a surefire standby: All you have to do is toss together sausage, tomatoes, peppers, garlic, shallots and olive oil on a sheet pan, then slide the entire thing under the broiler. In just 15 minutes, you’ll have nicely seared sausages, tomatoes and peppers, all of which have released juices that you should dunk bread into or spoon over pasta or rice. Experiment with adding cumin, paprika, oregano or red-pepper flakes in Step 1, or swap the garlic for scallions or red onion. You could also scatter crumbled feta, lemon slices, olives, pickled hot peppers or string beans across the top in the last few minutes of broiling.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/09/25/dining/as-sheet-pan-sausage-with-peppers-and-tomatoes/as-sheet-pan-sausage-with-peppers-and-tomatoes-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday, sausages, vegetables", "keywords": "garlic, peppers, sausage, shallot, tomatoes, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1044}, "recipeIngredient": ["1 pound fresh sausage, such as sweet or hot Italian sausage", "1 pound sweet or mild peppers, such as mini sweet peppers, bell or Cubanelle, seeded and sliced into 2-inch strips if large", "1 pound cherry or grape tomatoes", "4 garlic cloves, peeled and thinly sliced", "2 shallots, peeled and cut into 1/2-inch wedges", "3 tablespoons extra-virgin olive oil", "Kosher salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler with a rack 6 inches from heat source. Score the sausages in a few places on both sides, making sure not to cut all the way through. In a shallow baking dish or baking sheet, toss the sausages with the peppers, tomatoes, garlic, shallots and olive oil. Season with salt and pepper and spread in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil until the sausage is cooked through and the peppers and tomatoes are nicely charred, 10 to 15 minutes. Rotate the pan and ingredients as needed so everything gets under the broiler. If everything is charring too quickly, cover the pan with foil. Serve immediately."}]}