{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetable Pajeon (Korean Scallion Pancakes With Vegetables)", "description": "Crisp at the edges, soft at the center and filled scallions and other vegetables, these irresistible, comforting pancakes (adapted from Sohui Kim of Insa and the Good Fork restaurants in Brooklyn) make for a quick dinner that you can throw together on any given weeknight. It’s extremely forgiving, so feel free to use whatever vegetables you have on hand. Ms. Kim recommends finely shredded raw vegetables, or even leftover cooked vegetables. And if you don’t have the bandwidth to make a dipping sauce, a drizzle of soy sauce and squirt of Sriracha adds verve without any work. Serve pajeon by itself or topped with a fried egg or two, if you want to add protein.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/10/30/dining/25apperex1/merlin_163151043_0149dfbb-1ce6-4e5f-8e3e-490370fb1aa2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "3 to 4 servings", "recipeCuisine": "korean", "recipeCategory": "dinner, weekday, pancakes, vegetables", "keywords": "kimchi, scallion, sesame oil, soy sauce, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 524}, "recipeIngredient": ["1/2 cup all-purpose flour", "1/2 cup potato starch (or 1/4 cup each white rice flour and cornstarch)", "3/4 teaspoon fine sea salt, plus more as needed", "1/2 teaspoon baking powder", "3/4 cup ice water", "1 large egg", "1/4 cup finely chopped kimchi", "4 cups finely chopped or grated mixed vegetables (carrots, zucchini, bell peppers, kale, whatever you’ve got)", "4 scallions, cut into 2-inch-long sections and thinly sliced lengthwise", "2 tablespoons grapeseed or peanut oil, plus more as needed", "3 tablespoons soy sauce", "2 teaspoons rice wine vinegar, plus more to taste", "1 teaspoon finely grated fresh ginger or garlic (optional)", "1/2 teaspoon sesame oil, plus more to taste", "Pinch of granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pancakes: In a large bowl, whisk together all-purpose flour, potato starch, salt and baking powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine water, egg and kimchi. Whisk kimchi mixture into flour mixture, and whisk until smooth. Fold in vegetables and about three-quarters of the scallions. (Save the rest for garnish.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonstick skillet over medium heat, heat 2 tablespoons oil. Scoop 1/4 cup portions of batter into the skillet, as many as will fit while not touching, flatten, and fry until dark golden on the bottom, about 2 to 3 minutes. Flip and continue to fry until other side is browned, 2 to 3 minutes. Transfer to a paper towel-lined plate and sprinkle with a little more salt. Continue with remaining batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before serving, make the dipping sauce: In a small bowl, stir together soy sauce, vinegar, ginger or garlic (if using), sesame oil and sugar. Sprinkle sliced scallion over pancakes, and serve with dipping sauce on the side."}], "link": "https://cooking.nytimes.com/recipes/1020550-vegetable-pajeon-korean-scallion-pancakes-with-vegetables"}