{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemony Shrimp and Bean Stew", "description": "With minimal prep and a quick cook time, this shrimp stew feels elegant for such an easy weeknight meal. You can also take the dish in a number of directions: Substitute the shrimp with an equal amount of flaky white fish or even seared scallops, or stretch the dish into a meal for six by stirring in some butter and serving over cooked spaghetti or rigatoni. A good glug of your best olive oil would also be a welcome.", "author": {"@type": "Person", "name": "Sue Li"}, "image": "https://static01.nyt.com/images/2020/01/24/dining/sl-shrimp-and-bean/sl-shrimp-and-bean-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, quick, weeknight, beans, one pot, seafood, vegetables", "keywords": "bread, cannellini beans, chicken broth, leek, lemon, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1357}, "recipeIngredient": ["1 teaspoon fresh lemon zest and 2 tablespoons juice", "1 teaspoon sweet or smoked paprika", "2 garlic cloves, grated", "Kosher salt and black pepper", "1 pound peeled, deveined large shrimp (tails removed)", "4 tablespoons unsalted butter (1/2 stick)", "2 large leeks, trimmed, then halved lengthwise, white and light green parts sliced crosswise 1/2-inch thick (or 1 large onion, minced)", "1 (15-ounce) can cannellini beans or other white beans, rinsed", "2 cups chicken stock or vegetable stock", "2 tablespoons finely chopped fresh parsley (optional)", "Toasted bread, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine lemon zest, paprika, garlic, 3/4 teaspoon salt and 3/4 teaspoon pepper in a medium bowl. Add shrimp and toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, melt butter over medium-high heat. When butter is foaming, add shrimp and cook, stirring occasionally, until pink and starting to curl, 2 to 3 minutes. Using a slotted spoon, transfer shrimp to a plate; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add leeks, season with salt and pepper, and cook over medium until leeks are soft and starting to brown on the edges, 4 to 5 minutes, stirring occasionally. Add beans and chicken broth and bring to a boil over high. Lower heat and simmer, 8 to 10 minutes. Stir in reserved shrimp and any juices from the plate, parsley and lemon juice, and season with salt and pepper. Serve with toasted bread."}]}