{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Chops in Lemon-Caper Sauce", "description": "Here’s my favorite recipe in Toni Tipton-Martin’s excellent and invaluable “Jubilee: Recipes From Two Centuries of African American Cooking” (2019). It’s a remix of one that the chef Nathaniel Burton collected into his 1978 opus, “Creole Feast: Fifteen Master Chefs of New Orleans Reveal Their Secrets,” and one that Tipton-Martin glossed-up with lemon zest, juice and extra butter, a technique she learned from the restaurateur B. Smith’s 2009 collection of recipes, “B. Smith Cooks Southern-Style.” It’s a dish of smothered pork chops, essentially, made into something glorious and elegant. “The food history of blacks in America has been a story of the food of survival,” she told me in an interview. “We need to start celebrating the food they made at work.\"", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/11/10/magazine/10mag-eat/10mag-eat-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, weeknight, meat", "keywords": "capers, lemon, pork, pork chop, white wine, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2274}, "recipeIngredient": ["4 bone-in pork chops (about 8 ounces each)", "Kosher salt and freshly cracked black pepper, to taste", "1/2 teaspoon dried thyme leaves", "2 tablespoons olive oil", "4 tablespoons unsalted butter", "1 very small shallot, minced (about 1 tablespoon)", "2 garlic cloves, minced (about 1 teaspoon)", "2 teaspoons all-purpose flour", "1 cup dry white wine", "1 1/2 cups chicken stock, homemade or low-sodium, if store-bought", "2 tablespoons drained capers", "2 tablespoons minced fresh parsley, plus more for garnish", "1 teaspoon freshly grated lemon zest, plus 2 tablespoons juice", "Hot sauce (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dry the chops with paper towels, and season aggressively with salt, pepper and the thyme. Swirl the olive oil into a large skillet, and heat over medium until the oil begins to shimmer. Add chops, and cook until well browned on each side and cooked through, about 5 minutes per side. Transfer chops to a plate, and cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the fat from the skillet, then melt 2 tablespoons of butter in it over medium heat until sizzling. Add the shallot and garlic, and sauté until the aromatics soften, reducing the heat if necessary, about 1 minute. Sprinkle in the flour, and cook, stirring, for 2 minutes. Whisk in the wine and chicken stock, raise heat to high and bring the liquid to a boil, scraping up the browned bits on the bottom of the pan. Reduce heat to medium-high and cook, uncovered, until the liquid is reduced by half, 7 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the capers, parsley, lemon zest and juice and hot sauce to taste (if you’re using it), and simmer for 1 to 2 minutes. Stir in the remaining 2 tablespoons of butter until it’s melted and the sauce looks smooth. Nestle the pork chops into the sauce, and allow them to warm up for a couple of minutes, then serve, pouring sauce over each pork chop to taste. Garnish with more fresh parsley."}]}