{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Mushroom and Wild Rice Soup", "description": "Making creamy soups in the slow cooker can be tricky because it’s not possible to simmer them with the top off and reduce the liquid. One easy way to thicken without reducing is to use a roux, a mix of flour and butter. Heat the roux in the microwave, then whisk it into the stock in the slow cooker before adding the other ingredients. (If you don’t have a microwave, simply melt the butter in a small saucepan, stir in the flour, let it bubble, then proceed.) This soup is best prepared on the high setting for two reasons: First, when cooked on low, the wild rice becomes too soft before the mushrooms are tender. Second, the roux doesn’t thicken as effectively on low. If you need a longer cook time, omit the rice, put the soup on low for 8 hours, and turn the heat up to high before serving. Cook the rice separately according to package directions, then stir it in before serving. <span>Find a pressure cooker version of this recipe</span> <a href=\"https://cooking.nytimes.com/recipes/1021942-pressure-cooker-mushroom-and-wild-rice-soup\">here</a>.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2021/03/02/dining/sdg-creamy-mushroom-soup/merlin_182444493_7ccbe83a-aede-4bd3-8cdf-58c3ab71d1e6-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, main course", "keywords": "dry white wine, mushroom, slow cooker, soup, sour cream, wild rice, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1847}, "recipeIngredient": ["4 tablespoons unsalted butter (1/2 stick)", "1/4 cup all-purpose flour", "5 cups vegetable or chicken stock, plus more as needed", "1/4 cup dry white wine (see Tip)", "2 pounds mixed mushrooms (such as cremini and shiitake), tough stems removed, chopped into 1/2- to 1-inch pieces", "1 cup wild rice (about 6 ounces)", "2 celery stalks, finely chopped", "1 small yellow or red onion, grated or minced", "1 large carrot, peeled and finely chopped", "6 garlic cloves, smashed and chopped", "3 sprigs fresh thyme or 1 teaspoon dried thyme", "1 teaspoon garlic powder", "Kosher salt and black pepper", "1/2 cup sour cream", "Chopped scallions or chives and fresh dill, for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the butter in a microwave-safe container (a liquid measuring cup works well) and microwave until the butter is completely melted, 30 seconds to 1 minute. With a fork, whisk the flour into the butter to make a smooth mixture the texture of cake batter, then microwave until the roux is steaming hot and bubbling slightly around the edges, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the roux into a 6- to 8-quart slow cooker and whisk in the stock and wine. Stir in the mushrooms, wild rice, celery, onion, carrot, chopped garlic, thyme and garlic powder. Season with 1 teaspoon salt and several generous grinds of black pepper. Cook on high until most of the rice grains are just slightly split open and the vegetables are tender, about 4 hours. (The soup can hold for 1 to 2 hours on the warm setting, but eventually the wild rice will overcook.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to warm. Put the sour cream in a small bowl and slowly whisk in a few spoonfuls of the hot soup until smooth, then stir the mixture into the soup. (This prevents the sour cream from separating.) If you’d like the soup to be thinner, whisk in warm broth or water to the desired consistency. Taste the soup and add more salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the soup among bowls and top with chopped scallions or chives and dill. Reheat any leftovers on low until warm. (Boiling can cause the sour cream to break.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021941-slow-cooker-mushroom-and-wild-rice-soup"}