{"@context": "http://schema.org", "@type": "Recipe", "name": "Arancini", "description": "There’s no way around it: To make arancini, you have to make risotto, although you could also use any kind of leftover risotto, as long as the mixture isn’t loose from excess liquid. This recipe employs a simple base of Parmesan risotto that is chilled, rolled, breaded and fried, but the classic version starts with saffron risotto, which explains the Italian name arancine, or little oranges, named for their shape and hue. Simmering risotto and frying the arancini are simple tasks, but the step in between is crucial: Do not skimp on chilling your risotto. If it is not properly chilled, it will fall apart in the hot oil instead of forming crisp, glistening, orbs filled with molten cheese. Serve these arancini with warmed tomato sauce or even pesto, and crown them with a flurry of gremolata or plain lemon zest for brightness.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2020/05/20/dining/aw-arancini/aw-arancini-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "About 2 dozen", "recipeCuisine": "italian", "recipeCategory": "dinner, finger foods, grains and rice, appetizer, side dish", "keywords": "arborio rice, italian seasoning, mozzarella, tomato sauce, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 561}, "recipeIngredient": ["1/4 cup unsalted butter (1/2 stick)", "1/2 medium white or yellow onion, minced (about 3/4 cup)", "2 garlic cloves, minced", "3/4 teaspoon dried Italian seasoning or dried parsley", "Kosher salt and black pepper", "1 cup arborio rice (about 7 ounces)", "1/3 cup white wine or white vermouth", "2 cups chicken stock, warmed", "1 cup freshly grated Parmesan, plus more for garnish", "3 tablespoons finely chopped fresh parsley leaves, plus more for garnish", "4 ounces whole-milk or part-skim mozzarella, cut into 24 (1/2-inch) cubes", "1/3 cup all-purpose flour", "2 eggs", "1 cup panko or bread crumbs", "2 teaspoons Italian seasoning or dried parsley (optional)", "Kosher salt and black pepper", "1 1/2 quarts canola or vegetable oil", "1 cup arrabiata sauce or other tomato sauce (fresh or store-bought), warmed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the risotto: In a medium saucepan, melt 2 tablespoons butter over medium. Add onion, garlic and Italian seasoning. Season with salt and pepper, and cook, stirring occasionally, until softened, about 5 minutes. Stir in rice until coated, about 1 minute, then add wine. Cook, stirring frequently, until absorbed, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in 1/2 cup stock. Cook, stirring frequently, until stock is almost absorbed, about 4 minutes. Repeat with remaining stock, adding 1/2 cup at a time and stirring until absorbed before adding the next cup, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once all the stock has been absorbed — the rice should be tender but still slightly toothsome and the risotto creamy — stir in the Parmesan, the remaining 2 tablespoons butter and parsley. Season to taste with salt and pepper. Transfer to a parchment-lined baking sheet, spread out in an even layer and let cool, at least 20 minutes. Cover tightly in plastic wrap (or transfer to a lidded container) and refrigerate until thoroughly chilled, at least 1 hour or up to 2 or 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the risotto is chilled, slice it into about 24 even portions. Working with one at a time, gently roll each into a ball, then press between your palms to flatten slightly. Press one cube of mozzarella into the center and shape the risotto up and over it, sealing the cheese in the center. Roll the ball in your palms until round. Repeat with remaining risotto balls. (If you’re not planning to fry them right away, arrange them on a small baking sheet in a single layer, cover and refrigerate until cooking, up to 2 or 3 days in advance. If the risotto mixture isn’t cold, it can fall apart in the hot oil.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, heat the oil over medium. (If you have a candy thermometer, now is a good time to use it: Heat the oil to about 350 degrees.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the breading: Add the flour to a shallow bowl, then add the eggs to another shallow bowl and beat the eggs to combine. In a third bowl, combine the panko and Italian seasoning, if using, with 1/2 teaspoon salt and 1/2 teaspoon pepper. Stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one arancini, roll it first in the flour, shaking off any excess, then in the egg, then in the panko, taking care to coat it on all sides with each roll. Transfer to a clean baking sheet. Repeat with the remaining arancini."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry the arancini in batches, leaving at least one inch between each ball, until golden and crisp on the outside, about 5 minutes. (By the time the crust crisps, the cheese filling will melt.) Transfer to a paper-towel-lined baking sheet and repeat with remaining arancini. (If the crust is cooking to quickly, you can turn off the heat momentarily and continue to cook in the oil, which will maintain residual heat. Turn the stove back on if needed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon warmed tomato sauce onto small plates or into bowls and top with warm arancini, or set sauce in a bowl for dipping and arrange arancini on a serving platter. Sprinkle arancini with finely grated Parmesan and more parsley, if desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021102-arancini"}