{"@context": "http://schema.org", "@type": "Recipe", "name": "Maple-Pecan Galette With Fresh Ginger", "description": "Like a cross between a giant Danish and a frangipane-filled tart, this not-too-sweet galette is perfect for the holidays and beyond. Maple sugar gives it a warm and toasty note, and fresh ginger and allspice, a delicately spicy nuance. You can substitute other nuts for pecans, and walnuts or slivered almonds would work particularly well. And both the dough and filling can be made a few days ahead. Serve this with whipped cream or ice cream for a sophisticated dessert, then save the leftovers for breakfast the next day. An unadorned slice is fantastic with coffee.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/10/28/dining/23apperex1/merlin_178579398_e4e940be-576d-4a5d-9b2a-004ca8bc29bf-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts, dessert", "keywords": "bourbon, butter, maple sugar, pecan, fall, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 566}, "recipeIngredient": ["1 large egg, at room temperature", "1 2/3 cups/215 grams all-purpose flour, plus more for rolling", "1 tablespoon granulated sugar", "1/2 teaspoon fine sea salt", "10 tablespoons/145 grams unsalted butter (1 1/4 stick), cold and cut into 1-inch cubes", "1 1/2 cups/150 grams whole pecans, lightly toasted (see Note)", "3/4 cup/110 grams maple sugar (or use brown sugar, preferably muscovado or powdered jaggery), plus more for sprinkling", "6 tablespoons/85 grams unsalted butter (3/4 stick), at room temperature and cut into 1-inch cubes", "1 large egg, at room temperature, beaten", "1 tablespoon bourbon, brandy or rum (optional)", "2 teaspoons vanilla extract", "2 teaspoons finely grated fresh ginger", "1/4 teaspoon ground allspice", "1/4 teaspoon fine sea salt", "Flaky sea salt, for sprinkling", "Whipped cream or ice cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Crack the egg into a measuring cup and beat it with a fork. Add enough cold water to measure 1/3 cup. Transfer 1 tablespoon of the egg mixture to a small covered container and reserve it in the refrigerator for brushing the crust before baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dough in a food processor, combine the flour, sugar and salt in the work bowl and pulse two or three times to combine. Add cubed butter, then pulse until the mixture has formed lima bean-size pieces. Drizzle in the egg mixture and pulse just to combine, taking care not overprocess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dough by hand, put the flour, sugar and salt in a large bowl and whisk to combine. Add cubed butter, then mix it in with your hands, pinching and squeezing with your fingers (or use a pastry blender) until the largest pieces are the size of peas. Drizzle in the egg mixture a little at a time, mixing until the dough starts to come together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dump the dough onto a lightly floured surface, and squeeze it once or twice to form a ball. (Add a few drops of water if needed to help the dough come together.) Flatten into a disk, cover in plastic wrap and chill for at least 2 hours or up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Set aside 1/2 cup pecans for the topping. Put remaining 1 cup pecans in a food processor with the sugar and process until finely ground. (If you’ve made the crust in a food processor, don’t bother washing it out.) Pulse in the butter, egg, bourbon, vanilla, ginger, allspice and fine sea salt until smooth. Chill for at least 1 hour and up to 3 days, until the mixture is cold and solid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a piece of parchment paper on a work surface. Unwrap the dough and place it in the center of the paper. Top with another piece of parchment paper. Using a rolling pin, roll the dough into an 11-inch round. (It can be ragged at the edges.) Leaving the dough sandwiched in the parchment paper, transfer it to a rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the top piece of parchment paper from the dough. Spoon the pecan mixture onto the dough circle, leaving a 1 1/2-inch border. Top with reserved whole pecans. Gently fold the pastry over the filling, pleating to hold it in. (Casual folds are fine: The aim is to make sure the filling stays in the tart.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the galette, uncovered, in the refrigerator for another 20 minutes (and up to 1 hour). It should be cold and firm to the touch when you put it in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the galette chills, heat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush pastry with reserved egg mixture. (Add a little water if it thickened as it sat.) Sprinkle the pastry very lightly with flaky sea salt and very generously with maple sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the galette for 25 to 35 minutes, until the crust is golden brown. Transfer baking sheet to a wire rack to cool for at least 30 minutes before cutting. Serve warm or at room temperature, with whipped cream or ice cream."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021571-maple-pecan-galette-with-fresh-ginger"}