{"@context": "http://schema.org", "@type": "Recipe", "name": "Coconut Caramels", "description": "Making your own candy may seem daunting, but time and attention are all you need. This recipe calls for two sugars: granulated, which provides the base for your caramel, and an inverted sugar, corn syrup, which stabilizes and keeps the caramel from crystalizing. The line between soft-chewy and hard candy is a delicate one, so a candy thermometer is recommended for precision. Ginger and cardamom will add a nice zing, but lean into other warm spices, such as cinnamon, black pepper or chili powder, if that’s what you have on hand. A final coat of toasted, finely shredded coconut lends an almost buttery crunch, and prevents the pieces from sticking. Wrap up individually if you have the time: These are made for sharing and can be frozen for up to a month.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2020/05/29/dining/yk-coconut-caramels/merlin_172221651_5e11547b-2f4c-4e82-bf09-64da1d5c1731-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "About 72 pieces", "recipeCuisine": "", "recipeCategory": "snack, candies, dessert", "keywords": "cardamom, coconut cream, coconut flakes, ginger, halloween", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 416}, "recipeIngredient": ["1 cup/85 grams shredded, unsweetened coconut flakes", "Coconut oil or nonstick cooking spray, for greasing the pan", "1 (13-ounce/390-gram) can coconut cream or full-fat coconut milk", "2 cups/400 grams granulated sugar", "1/4 cup/60 milliliters corn syrup", "1/2 teaspoon fine sea salt", "1 teaspoon ground ginger", "1/4 teaspoon ground cardamom"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Spread the coconut flakes in an even layer on a rimmed baking sheet, and toast until light golden brown, 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush an 8-inch baking dish generously with coconut oil or coat with cooking spray. Sprinkle about 3 to 4 tablespoons of toasted coconut in an even layer on the bottom of the pan, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium heavy saucepan, combine the coconut cream, sugar, corn syrup and sea salt. Bring to a boil over medium heat, stirring to dissolve the sugar. Boil, stirring frequently especially toward the end, until a candy thermometer reaches 250 degrees and caramel is a light golden brown and thickened, about 20 to 30 minutes. Remove from heat and stir in the ginger and cardamom."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the caramel into the prepared pan. Once the caramel stops bubbling and the surface forms a thin skin, about 3 minutes, sprinkle another 4 tablespoons toasted coconut across the surface. Allow to cool at room temperature and set completely, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a spatula around the sides of the baking dish, loosen and lift the caramel, and move onto a board or clean surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the caramel into 8 (1-inch-wide) strips, then across into 1/2-inch pieces, so you have about 72 caramels. Roll the sides of each piece in more toasted coconut. Wrap as individual sweets using 4- to 5-inch squares of parchment, wax paper, or cellophane, or use store-bought candy wrappers, twisting the ends to seal. Store at room temperature in a cool dry place. Caramels will keep stored at room temp for up to 7 days or frozen after wrapping for up to 1 month."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Coconut Caramels", "description": "Yewande Komolafe grew up buying coconut caramels from the street vendors of Lagos. In this recipe, adapted from one she got from her mom, soft, chewy caramel is rolled in toasted coconut flakes for a contrast between textures, and ginger and cardamom add warming spices to the rich sweetness. Follow along as she shows us how to make it at home.", "thumbnailUrl": "https://static01.nyt.com/images/2020/05/29/dining/yk-coconut-caramels/merlin_172221651_5e11547b-2f4c-4e82-bf09-64da1d5c1731-mediumThreeByTwo440.jpg", "uploadDate": "2020-12-02T20:42:58.000Z", "duration": "PT6M40S", "transcript": "Like what is caramel? I don't want to say caramel is a caramel, but it kind of is I don't know how else to say that Hi, I'm Yewande Komolafe and today, I am making coconut milk caramels with ginger and cardamom. The recipe is essentially a cooked coconut milk with sugar. You can make them a soft caramel and have them soft and chewy or you can cook it longer and make it a hard caramel. I'm cooking these as a soft caramel and rolling them and toasted coconut to add some contrast to it. This is an adaptation of a recipe that I got from my mom. My version has ginger and cardamom because I like spicing things up a little bit. These camels are found on the streets of Lagos. They are something that I ate as a child growing up. I didn't let my parents know I was eating because they're so sugary, but now I can make them by myself in my kitchen and I can have as many as I want. I use coconut oil and a pastry brush because you don't want your candy to stick to the bottom. So you can also use cooking spray. But I like coconut oil. You're making a coconut candy. It's coconut flavored like, why not? I prefer unsweetened shredded coconut I'm going to spread it in an even layer. My first memory of this is getting out of school and running to the roadside seller who sells them and buying them before my mom picked me up. So my first memory of it is actually like sneaking around to eat these. You want a nice even layer on the bottom. So the first thing that hit the pan is the coconut milk. Corn syrup. This is, this is an ingredient that I love to hate but it stabilizes the sugars in this recipe. Once all the ingredients are combined it kind of looks like a clear liquid. You can still feel in the beginning that the sugar hasn't dissolved into the liquid. It's a little gritty on the bottom of the pan. So you want to keep stirring until the sugar dissolves. That's a good indicator. As the liquid heats up, it's going to start to bubble and foam and you stir it to let out some of that air. And so it reduces back down every so often I'll check back on my caramel to make sure it's not foaming over the top of the container. So you want to crush the shells. I'm going with ginger and cardamom. You don't have to add the spices to it. I've also tried it with a chili pepper with some turmeric. You know you can go wild with your flavors. You can also use store bought ground cardamom. You don't always have to pound your own cardamom but gosh, that smells so amazing. That was about three pods. I like smell. I'm adding my spices in at the very end because the spices are like the most delicate part of this recipe and you don't really want to cook them too much. You want to check this out. It takes about 20 to 30 minutes to cook to the desired temperature. So if you don't have an instant read thermometer, you could still make this recipe. You just have to watch it closely because once it starts to brown from caramelization to burning happens really quickly. So you don't want your thermometer to touch the bottom of the pan because then you're reading the temperature of the bottom of the pan. And not the contents of the pan. Right now, it's about 228. So we have a bit of a ways to go So you're looking for a nice light golden brown, which would happen at about 250 degrees. You want to stand by your caramel at this point. And stir at constantly make sure you get the bottom of the pan. You also want to have everything ready because there's not a lot of time once it starts to change color. That's the color you want. And like spices are going to go in. The camels formed a little bit of a skin on top. When I tip it over, it wrinkles. So you want it just enough of a skin to hold the coconut on the surface. This also just helps when you're cutting it. Because the camel so sticky. Leave it to sit on your countertop and cool completely at room temperature. Don't put it in the fridge or the freezer. That takes about an hour. So I'm loosening the caramel from the edges. It's completely cool, but I just need to get it out my 8 inch pad There's some coconut on the bottom and the top, but the sides are really sticky. And so I roll them in additional coconut for flavor. I think the toasted coconut also gives it some crunch to it. So some texture and it helps you pick it up easier. So these are candy wrappers. You can also get parchment paper or wax paper and cut them into little squares to wrap up your candy. It's super time consuming and it takes a lot of mental energy, but it's a labor of love. You know, seeing this like full jar of 72 caramels is...it makes me feel good. And now for tasting. These days, I make it as a treat to just have at home for guest or just for myself. I feel like I always taste things the same way. I'm like, \"mhmm.\"", "contentUrl": "https://vp.nyt.com/video/2020/12/02/90343_1_Yewande-Coconut-Caramels-Video_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021130-coconut-caramels"}