{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramelized Onion Galette", "description": "This rich, autumnal galette takes its inspiration from the flavors of French onion soup. Seasoned with Gruyère and lots of cracked black pepper, the galette dough takes the place of the crostini, and the caramelized onion filling is fortified with beef broth and sherry. The dish is great for entertaining — it can be prepared in advance — but requires a little bit of patience: You’ll need to let the dough rest for at least four hours, which allows the flour to hydrate and will make the dough less crumbly to work with. Let the tart rest for about 10 minutes before slicing and serving. Eat it while it’s hot or serve at room temperature alongside a salad or steak.", "author": {"@type": "Person", "name": "Sue Li"}, "image": "https://static01.nyt.com/images/2020/11/17/dining/sl-caramelized-onion-galette/sl-caramelized-onion-galette-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, appetizer, main course, side dish", "keywords": "fall, winter, gruyère, make-ahead, party, plan-ahead, sweet onion, tart, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2397}, "recipeIngredient": ["1 1/2 cups/190 grams all-purpose flour", "2 tablespoons granulated sugar", "Kosher salt and black pepper", "1/2 cup/115 grams unsalted butter (1 stick), cut into 1/2-inch cubes", "1 1/3 cups/4 ounces grated Gruyère", "1/4 cup ice water", "1/4 cup/55 grams unsalted butter (1/2 stick)", "4 large sweet onions, peeled and sliced into 1/2-inch rings", "4 fresh thyme sprigs, plus more fresh thyme leaves for serving", "Kosher salt and black pepper", "1 cup beef broth (or vegetable broth)", "1/4 cup dry sherry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: In a large bowl, whisk together flour, sugar, 1 1/2 teaspoons kosher salt and 1 1/2 teaspoons black pepper. Add butter and 1 cup grated Gruyère to the flour mixture and toss to coat. Using your fingertips, pinch the butter and cheese into the flour to make pebble-size pieces. Drizzle in the ice water and stir to make a shaggy dough. Dump the dough onto a large sheet of plastic wrap and knead a few times to combine. Wrap in plastic and refrigerate for at least 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the onions: In a large skillet, melt the butter over medium-high heat. Add onions and thyme sprigs, season with 1 teaspoon salt and 1/2 teaspoon pepper and cook, stirring occasionally, until the onions are translucent and lightly golden on the edges, 20 to 25 minutes. Reduce the heat to medium, add broth and sherry and cook until the onions are browned and the liquid has mostly evaporated but the mixture is still saucy, 16 to 18 minutes. Transfer to a bowl and set aside to cool for at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Roll the dough into a 13-inch round on a sheet of parchment. Spread the cooled caramelized onions on the dough, leaving a 1- to 2-inch border. Fold the edges in, over the onions, transfer to a baking sheet and bake until the dough is golden brown and some of the onions have browned on the edges, 40 to 50 minutes, rotating the galette halfway into the baking process."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove galette from the oven and sprinkle remaining 1/3 cup grated Gruyère on the crust. Bake another 5 minutes to melt the cheese. Remove and let rest for 10 minutes before slicing. Top with remaining thyme leaves, for garnish."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021593-caramelized-onion-galette"}