{"@context": "http://schema.org", "@type": "Recipe", "name": "Joanne Chang’s Maple-Blueberry Scones", "description": "These scones, created by Joanne Chang for her Flour Bakery & Cafe in Boston, are studded with fresh blueberries, sweetened with maple syrup and made with a blend of whole-wheat and all-purpose flours — but don’t think of them as health food. They’ve also got crème fraîche and plenty of butter. They’re big. They’re glazed. And they’ve got a singular texture: tender, like a layer cake, but also flaky, like a traditional scone. It wasn’t until I made them myself that I realized that their texture is different because the technique is different: Most scone recipes call for the butter to be rubbed into the flour mixture until it’s coated with flour. In Ms. Chang’s recipe, half the butter gets this treatment, which makes the scones characteristically flaky. The other half of the butter is beaten into the dry ingredients so that it becomes the coating for the flour, making the scones tender.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2020/07/05/magazine/05mag-eat/05mag-eat-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 scones", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, snack, dessert", "keywords": "blueberries, butter, crème fraîche, maple syrup, scone, whole wheat flour, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2520}, "recipeIngredient": ["1 2/3 cups/240 grams whole-wheat flour", "1 cup/130 grams all-purpose flour", "1 1/2 teaspoons baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon kosher salt", "3/4 cup/170 grams unsalted butter (1 1/2 sticks), cold, cut into 1/2-inch pieces", "1/2 cup/120 grams crème fraîche, Greek yogurt or sour cream, at room temperature", "1/2 cup/120 milliliters maple syrup", "1/3 cup/80 milliliters buttermilk, at room temperature", "1 large egg yolk, at room temperature", "1 cup/125 grams fresh blueberries", "1/2 cup/60 grams confectioners’ sugar", "2 to 3 tablespoons maple syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a stand mixer fitted with the paddle attachment, briefly mix both flours, the baking powder, baking soda and salt on low speed. Add half the butter and paddle until fully mixed into the flour, 2 to 3 minutes. (This will coat the flour with butter so the scones are tender.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining butter to the bowl of the stand mixer. Pulse the mixer three or four times to mix the pieces into the dough while keeping them whole. (This step will give you small pieces of butter in the dough, which will help the scones be a bit flaky.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the crème fraîche, maple syrup, buttermilk and yolk until thoroughly mixed. Stir in the blueberries. With the mixer on low, pour the blueberry mixture into the flour mixture, and paddle on low for about 10 seconds to get some of the liquid mixed into the flour. Stop the mixer, and mix the rest of the loose flour into the dough by hand: Gather and lift the dough with your hands and turn it over in the bowl several times until all the loose flour is mixed in. Shape the dough into a ball, wrap it well and refrigerate for at least 1 hour or for up to 1 day. (This gives the flour time to fully absorb the liquid.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees, and position a rack in the center. Line a baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a 1/2-cup measuring cup or ice cream scoop, scoop out 8 mounds of chilled dough, and place them on the baking sheet a few inches apart. Bake scones for 35 to 45 minutes, rotating the baking sheet midway through the baking time, until the scones are evenly golden brown and firm when you press them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the scones are baking, make the glaze: In a small bowl, whisk together the sugar and enough maple syrup to make a thick, spreadable glaze. Use immediately, or store in an airtight container at room temperature for up to 1 week. Rewhisk before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as you remove the scones from the oven, use a pastry brush to brush them with the glaze while they’re warm. Let cool on the baking sheet for 30 minutes, then serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021206-joanne-changs-maple-blueberry-scones"}