{"@context": "http://schema.org", "@type": "Recipe", "name": "Soft Sugar Cookies With Raspberry Frosting", "description": "In 1994, Lofthouse Cookies hit American grocery store shelves like a frosted meteorite. If you grew up in the suburbs, then you may have had one: soft, cakey, melt-in-your-mouth. Unlike their clamshell counterparts, which contain margarine, these homemade versions are made with butter and cream cheese, both of which add wonderful flavor that margarine alone does not. Be sure to freeze your dough for the full 15 to 20 minutes: Not only does this chill the fat, helping the cookies maintain their shape in the oven later, but it also allows the flour to hydrate and the flavors to concentrate. A relic of childhood shored into the present, these cookies are not unlike the tops of vanilla cupcakes, devoid at last of their dry, frosting-less bottoms. Freeze-dried raspberries lend a welcome tartness to the buttercream, not to mention a plush, candy-pink hue. (<a href=\"https://www.youtube.com/watch?v=vDC0fbY3JJo\">Watch Eric Kim make his Soft Sugar Cookies With Raspberry Frosting here</a>.)", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2020/12/13/dining/ek-lofthouse/merlin_180932583_7cf08465-f282-4d4c-a1c7-4a770fd10a72-articleLarge.jpg", "totalTime": "PT55M", "recipeYield": "About 15 cookies", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "cake flour, cream cheese, raspberry, sugar cookie, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 2101}, "recipeIngredient": ["1/2 cup/115 grams unsalted butter (1 stick), at room temperature", "3 ounces/85 grams cream cheese, at room temperature", "1 cup/200 grams granulated sugar", "1/2 teaspoon kosher salt", "2 large eggs, at room temperature", "1 tablespoon vanilla extract", "2 1/4 cups/285 grams cake flour", "2 teaspoons baking powder", "Sprinkles, for garnish", "1 cup/30 grams freeze-dried raspberries, finely ground in a food processor or spice grinder", "1 cup/225 grams unsalted butter (2 sticks), at room temperature", "2 cups/245 grams confectioners’ sugar", "1 teaspoon vanilla extract", "Pinch of kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cookies: In a large bowl, using a spoon, cream the butter, cream cheese, sugar and salt until smooth and fluffy. Add the eggs and vanilla extract, and whisk to incorporate some air and to dissolve the sugar crystals, about 1 minute. Stir in the flour and baking powder until just incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and line two rimmed sheet pans with parchment paper. Using two spoons or a cookie scooper, plop out 2-tablespoon/50-gram rounds spaced a couple of inches apart. (You should get about 7 to 8 cookies per sheet pan.) Place the sheet pans in the freezer for 15 to 20 minutes until the dough is no longer sticky and easier to handle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the dough chills, make the frosting: In a fine-mesh sieve set over a medium bowl, sift the ground raspberries, using a spoon to help pass them through, until most of the ruby-red powder is in the bowl and most of the seeds are left behind in the sieve. (Discard the seeds.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the bowl, add the 1 cup butter, confectioners’ sugar, vanilla extract and salt and, with an electric hand mixer, mix on low speed until the butter absorbs the sugar. Then, turn the speed up to high and beat until the frosting doubles in size, about 2 minutes, scraping down the sides of the bowl with a rubber spatula to ensure all the ingredients are incorporated. Transfer the frosting to a small container, cover tightly, and set aside. (You should have about 2 cups of frosting.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the sheet pans from the freezer. Roll the chilled dough into even balls and flatten them slightly with your fingers so they’re about 2 inches wide and 1 inch high. Bake the cookies for 13 to 15 minutes, rotating the pans and switching racks halfway through, or until they no longer look wet on top, are still light in color and spring back to the touch. They will puff up and crack slightly. Let cool completely on the sheet pan. (They will continue to cook as they sit.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a butter knife or offset spatula, frost each cooled cookie with the raspberry frosting and adorn with the sprinkles."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021714-soft-sugar-cookies-with-raspberry-frosting"}