{"@context": "http://schema.org", "@type": "Recipe", "name": "Pernil", "description": "Perhaps the best known and most coveted dish from Puerto Rico, pernil is a positively sumptuous preparation for pork shoulder. It’s marinated (ideally overnight) in garlic, citrus and herbs, then slow-roasted on high heat to achieve a crisp chicharrón, or skin. Traditionally, it’s prepared for Thanksgiving or Christmas, but for those of us in the diaspora, it’s made for most special occasions. Shoulder is also a relatively inexpensive cut of meat, and it yields a lot of servings, leading to exciting leftovers. This recipe is deeply indebted to the chef Maricel Presilla and her recipe in “<a href=\"https://wwnorton.com/books/Gran-Cocina-Latina/\">Gran Cocina Latina</a>,” her cookbook published in 2012. Her method is a foolproof way to get that chicharrón as well as tender meat that falls off the bone. It’s blessed by her brilliance. (Watch the video of <a href=\"https://www.youtube.com/watch?v=EqF90XGnMAQ\">Von Diaz making pernil here</a>.)", "author": {"@type": "Person", "name": "Von Diaz"}, "image": "https://static01.nyt.com/images/2021/03/24/dining/22Puertoricanrex3-pernil/merlin_184863150_fdc41442-45cd-4cc2-8585-f3e4dcc57972-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, meat, main course", "keywords": "christmas, thanksgiving, garlic, plan-ahead, pork shoulder, puerto rican", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1472}, "recipeIngredient": ["8 to 9 large garlic cloves, finely minced", "3 tablespoons olive oil", "5 teaspoons fresh sour orange juice (or equal parts lime and orange juice)", "4 teaspoons dried oregano", "8 to 9 teaspoons kosher salt", "1 teaspoon black pepper", "1 (8- to 9-pound) bone-in, skin-on pork shoulder, preferably with skin covering the entire top layer", "1 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the adobo by combining all the ingredients and grinding in a large pilón or mortar and pestle, or simply mixing together well in a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pork: Rinse and dry meat well with a clean towel. Place pork skin-side down on a large rimmed sheet pan and poke deep, 1-inch holes throughout the meat and in the fatty layer with a paring knife, being careful not to pierce the skin. You can’t have too many holes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour over adobo in batches, using your fingers to push adobo deep into the meat. If you’re worried about your hands smelling like garlic — which they will! — wear gloves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set out a long sheet of plastic wrap, layering with subsequent sheets as needed to ensure you can securely wrap the entire pork shoulder. Transfer pork to plastic wrap and wrap tightly, adding sheets of plastic as needed to ensure pork is completely airtight and juices are contained. Let marinate in the fridge overnight if possible, or at least least 2 to 3 hours. Set on a rimmed baking sheet or disposable aluminum foil pan in case it leaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the pork has marinated, heat oven to 400 degrees. Working over the sink, carefully remove pork from plastic wrap, discarding any remaining adobo. Place the marinated pork shoulder skin-side up in a deep roasting pan, and wipe the skin with a clean cloth. Rub skin with 1 teaspoon salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Loosely tent foil over the pork shoulder, spraying the foil with cooking spray or brushing with oil in any areas that may touch the skin, as it will stick. Transfer to the center of the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast in the oven for 1 hour, then carefully remove the foil and rotate the pan. Continue roasting for another 2 to 3 hours, rotating every hour or so, and watching closely. Add water to the pan as needed when juices evaporate. The meat is done cooking when the juices run clear and the thickest part of the shoulder registers 160 degrees with a meat thermometer. The skin may take more time to crisp, but watch closely so that it does not burn. Tap the top of the skin with the back of a knife or metal spatula, and listen for a decidedly hollow sound."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and let rest for 10 to 15 minutes, then transfer to a large cutting board. (For cleaning instructions for the pan, see Notes.) If desired, remove the skin from the roast by slicing it along the underside of the bone with a long, sharp, slender knife. Run the knife underneath the skin starting from the bottom until loosened, then lift the skin from the meat. Use kitchen shears to cut into serving pieces, and let them rest in the warm oven until ready to eat. Trim excess fat from the meat if desired, and slice as desired, in large chunks or slices, to serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021998-pernil"}