{"@context": "http://schema.org", "@type": "Recipe", "name": "Wild Mushroom Tart", "description": "This savory tart features a quickly made puff pastry. (You can use store-bought, if you wish, but this dough is easy and fun.) There’s enough for two tarts, so store half in the freezer, rolled out, for later use. Make the dough up to a day or two in advance, and use chanterelles or other pale wild mushrooms, if possible. If using cultivated mushrooms, a combination of sliced shiitake, white button, oyster or king trumpet would be nice, as portobellos or cremini make a dark, somber-looking tart. Serve as a first course or as a light lunch, accompanied by a simple green salad.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2021/02/10/dining/05Tanisrex1/05Tanisrex1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 generous or 6 restrained portions", "recipeCuisine": "", "recipeCategory": "pies and tarts, vegetables, appetizer", "keywords": "crème fraîche, mushroom, onion, thyme, valentine’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 779}, "recipeIngredient": ["2 cups/255 grams all-purpose flour, plus more for rolling", "Pinch of fine sea salt", "1 cup/225 grams cold unsalted butter (2 sticks), cut in 1/4-inch cubes", "1/2 cup/120 milliliters ice water", "2 tablespoons extra-virgin olive oil, plus a little more as needed", "1 onion, any kind, sliced into 1/4-inch half-moons (about 1 1/2 cups)", "Kosher salt and black pepper", "10 ounces/300 grams wild mushrooms, such as chanterelle, or cultivated shiitake, oyster or king trumpet mushrooms, sliced (about 4 cups)", "2 garlic cloves, minced", "2 teaspoons chopped thyme", "Pinch of red-pepper flakes (optional)", "1/2 cup/120 milliliters crème fraîche", "3 tablespoons grated Parmesan", "2 tablespoons chopped flat-leaf parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tart dough: Put the 2 cups flour and salt in the chilled bowl of a stand mixer fitted with the paddle attachment. (If you don’t have one, you can prepare the dough by hand.) With the mixer set on low speed, work half of the butter into the flour until the mixture resembles wet sand. Add remaining butter cubes and ice water, and mix just until the dough comes together. The dough will be very soft, studded with butter chunks and a bit sticky — this is correct."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "You should have 550 grams/20 ounces of dough. Divide into 2 (275-gram/10-ounce) balls. Dust each with a little flour and press into a disk about 1-inch thick. Cover with plastic wrap and chill for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust the work surface with flour. Press one disk into a rough square, then roll it into a 6-by-12-inch sheet. Fold the sheet in half, making a 6-inch square. Dust with flour lightly, as necessary, and roll the square into a 6-by-12-inch sheet again, then fold in half to make a 6-inch square. Finally, roll dough into a 6-by-18-inch sheet, place on a parchment-lined baking sheet and refrigerate, wrapped, for 30 minutes to keep dough from shrinking when baked, or freeze. (Roll out the rest of the dough at your leisure, then freeze for the future, or refrigerate and use within 2 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Set a wide skillet over medium-high heat and add olive oil. When oil is wavy, add onions. Season with salt and pepper, and cook, stirring, until softened and beginning to brown, about 10 minutes. Remove onions and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pan over medium-high heat, add mushrooms (and a little more oil if necessary). Season with salt and pepper, and cook, stirring, until softened and beginning to brown, 5 to 8 minutes. Add garlic, thyme and red-pepper flakes (if using), stir well and turn off heat. Combine mushrooms and onions, set aside and let cool to room temperature. (Filling can be made several hours in advance and left at room temperature, if desired.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Using a small rubber spatula, spread crème fraîche over the pastry sheet, leaving a 1-inch border. Distribute onion-mushroom mixture evenly over the crème fraîche. Dust with Parmesan and fold pastry edges up, pinching at the corners to form a low rim. Bake until pastry is crisp and golden and top of mixture is lightly browned, about 30 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide baked tart onto a cutting board and pull away the parchment. Let tart cool slightly before cutting. Sprinkle with parsley and cut tart crosswise into wide slices (or, if preferred, into wedges). Serve warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021832-wild-mushroom-tart"}