{"@context": "http://schema.org", "@type": "Recipe", "name": "Herby Tomato Salad With Tamarind-Maple Dressing", "description": "Collect the juiciest, ripest tomatoes you can find for this salad (the sweeter and fruitier, the better), which is amplified by an herby, piquant dressing. Start with cilantro, scallions, and Thai basil; perilla leaves lend a grassy, aniseed note. You can find them at Asian grocery stores or greenmarkets, but, if they’re unavailable, substitute shiso or mint. Tamarind is very sour, too tart to enjoy on its own, but paired with a sweetener, such as maple syrup, honey or brown sugar, it sings with citrusy, smokey notes. Don’t be afraid to add more maple, chile, salt or vinegar until you strike that harmonious sweet-sour balance. And, two final notes: If you’re looking for a heartier salad, add 2 cups of cooked grains, like farro or quinoa, and feel free to use store-bought crispy fried shallots if tight on time.", "author": {"@type": "Person", "name": "Hetty McKinnon"}, "image": "https://static01.nyt.com/images/2020/09/06/dining/hm-tomato-salad/merlin_175613094_4e606174-1e36-444d-8203-c765befbdff5-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "lunch, weekday, salads and dressings, main course", "keywords": "basil, cilantro, perilla, tamarind, tomatoes, summer, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 377}, "recipeIngredient": ["2 pounds mixed tomatoes, such as cherry, heirloom, Sungold or beefsteak", "Kosher salt and black pepper", "1/2 bunch cilantro, leaves picked and stalks finely chopped", "1 packed cup fresh basil leaves, preferably Thai", "12 perilla, shiso or mint leaves, finely chopped", "2 scallions, finely sliced", "3/4 cup neutral oil, such as grapeseed or vegetable", "4 shallots, sliced into 1/16-inch-thick rounds", "Sea salt", "4 tablespoons tamarind concentrate", "2 tablespoons maple syrup", "1 tablespoon sesame oil", "1 tablespoon rice wine vinegar", "1 (1-inch) piece fresh ginger, grated", "1 garlic clove, grated", "1/2 teaspoon red-pepper flakes", "1 teaspoon sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start the salad: Cut the tomatoes into different shapes — this creates different textures and visual interest — and place them in a colander. Sprinkle with a big pinch of salt, and set in the sink to drain as you prepare the rest of the ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a strainer over a heatproof bowl. Line a baking sheet or large plate with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the fried shallots: Add the oil and shallots to a medium saucepan, and place over low heat. Bring the oil to a simmer, stirring the shallots with a fork to separate the rings. Cook for 10 to 15 minutes until the shallots are light golden brown, watching them closely, as they will brown quickly toward the end of their cooking. (Don’t let the shallots brown too much, as they will continue to cook after you take them out of the oil.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the shallots to the strainer to drain, then transfer them to the paper towels. Season with salt and allow to cool. Reserve the oil. Shallots can be fried 5 days ahead and stored in an airtight container at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dressing: Whisk together all the ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the salad: Combine the tomatoes, two-thirds of the herbs and scallions, and half the dressing. Season with salt and pepper, and toss to combine. To finish, top with the remaining dressing, a drizzle of the shallot cooking oil and the rest of the herbs and scallions, then finally with the fried shallots. (Reserve remaining shallot oil for other uses, like vinaigrettes, stir-fries and soups.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021340-herby-tomato-salad-with-tamarind-maple-dressing"}