{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Tomato, Mozzarella and Pesto Calzones", "description": "The secret to crispy calzones: Bake them in a very hot oven, and use drier ingredients in the filling to prevent the dough from becoming soggy. Slow-roasting the tomatoes for the filling concentrates their flavor and pulls out their juices, while pesto adds punch without contributing too much moisture. Fresh mozzarella is just right for many things, but it’s too wet for a calzone, so use drier whole-milk mozzarella instead. If you prefer to use store-bought pizza dough, you’ll need three (8-ounce) balls for this recipe.", "author": {"@type": "Person", "name": "Jessica Battilana"}, "image": "https://static01.nyt.com/images/2020/09/02/dining/02Handheld-Calzone-a/02Handheld-Calzone-a-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, breads, appetizer, main course, side dish", "keywords": "flour, garlic, pesto, tomatoes, yeast, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 374}, "recipeIngredient": ["1 cup/240 milliliters warm water", "1 tablespoon granulated sugar", "1 1/2 teaspoons active dry yeast", "3 3/4 cups/480 grams all-purpose flour", "1 1/2 teaspoons kosher salt", "2 tablespoons olive oil", "2 pounds/905 grams small tomatoes, halved", "2 tablespoons olive oil", "2 garlic cloves, slivered", "Kosher salt", "1/2 cup plus 1 tablespoon <a href=\"https://cooking.nytimes.com/recipes/2653-basic-pesto\">basil pesto</a>", "1 pound/455 grams whole-milk mozzarella (not fresh mozzarella), shredded", "1 large egg, beaten with 1 teaspoon water, for egg wash", "Flaky salt, such as Maldon, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In the bowl of a stand mixer fitted with the dough hook attachment (or in a large bowl with a wooden spoon), combine the water and sugar. Sprinkle yeast on top and let stand 5 minutes until foamy. With the mixer on low speed, add the flour, salt and olive oil, and mix until combined. Increase speed to medium and mix until the dough comes together in a smooth ball. Cover the bowl with plastic wrap and let stand in a warm place until doubled in size, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the dough rises, prepare the tomatoes: Heat oven to 300 degrees. Arrange tomatoes cut-side down on a rimmed baking sheet. Drizzle with olive oil, scatter with garlic and season generously with salt. Bake for 40 to 45 minutes, until the tomato skins are wrinkly. Let cool slightly, then use your fingers to pull the skins off each tomato. (Count the number of tomato pieces now, then you’ll have an easier time dividing them among the 6 calzones.) Discard skins, then transfer tomatoes and garlic to a strainer set over a bowl. (You won’t need the accumulated juices for this recipe, but save them — you can whisk them with a bit more olive oil and vinegar for a vinaigrette.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently punch down the dough and transfer to a not-floured work surface. Divide into 6 pieces, each about 4 1/4 ounces/120 grams. Working with one piece of dough at a time, cup the dough ball on a work surface (almost as though you were forming a cage around the dough). Rotate your hand in clockwise circles, exerting a bit of pressure on the top of the dough ball, until it’s a smooth sphere. Repeat with the remaining balls of dough and let stand 15 minutes, loosely covered with plastic wrap or a clean dish towel. (The dough can be prepared up to this point, transferred to a baking sheet, covered with greased plastic wrap and refrigerated overnight. Let come to room temperature before proceeding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have a large pizza stone, place it in the oven and heat oven to 500 degrees. (If you don’t have a pizza stone, lightly oil a rimmed 13-by-18-inch baking sheet). Working with one piece of dough at a time, roll into an 8-inch circle using a rolling pin. Spoon 1 1/2 tablespoons pesto in the center of the dough and use the back of the spoon or an offset spatula to spread it in a thin, even layer, leaving a 1-inch border. Pile 2/3 cup mozzarella on half of the dough, then top with some of the tomatoes. Fold the dough in half, over filling, then roll and crimp the edge of the dough together to seal. Repeat with the remaining dough, pesto, mozzarella and tomatoes until all 6 calzones have been formed. Brush each calzone with egg wash and sprinkle with flaky salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a large spatula, transfer the calzones to the pizza stone (or baking sheet) and arrange them diagonally to fit. Bake until puffed and deep brown, 18 to 23 minutes. (Tent with foil if the tops become too dark before the rest of the dough is browned.) Remove from the oven and let cool 5 minutes before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021391-roasted-tomato-mozzarella-and-pesto-calzones"}