{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheesy Bread Balls in Tomato Sauce", "description": "It’s hard not to love this combination of tomato sauce, melted cheese, bread balls and garlic oil, which is sort of like a pizza, deconstructed. If you prefer not to stuff the bread balls, you can skip that part and simply roll them until round, baking them in the same way. The extra cheese can then be added to the sauce around the bread balls just before broiling. This dough method isn’t complicated, but you could work with store-bought pizza dough to save on time.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2020/12/08/dining/Ottolenghi-dough-balls/merlin_180342117_f6e804e2-64fe-49bd-971e-725012b57f14-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "snack, appetizer", "keywords": "bread flour, garlic, mozzarella, tomato, yeast", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 250}, "recipeIngredient": ["3/4 cup/100 grams white bread flour", "1/4 cup/60 milliliters lukewarm water", "1 1/2 teaspoons olive oil, plus more for brushing", "1/2 teaspoon active (fast-action) dry yeast", "1/4 teaspoon kosher salt", "1/3 cup/80 milliliters olive oil", "7 garlic cloves, peeled and minced", "1 (14-ounce/400-gram) can plum tomatoes, well crushed by hand", "3 tablespoons fresh oregano leaves, plus 1 tablespoon for garnish", "2 tablespoons roughly chopped fresh basil leaves, plus 2 tablespoons for garnish", "1 teaspoon granulated sugar", "Kosher salt and black pepper", "3 1/2 ounces/100 grams low-moisture mozzarella"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the bread balls: Add the flour, lukewarm water, 1 1/2 teaspoons oil, the yeast and salt to the bowl of a stand mixer. Using the dough hook, knead on medium-high speed for 7 minutes, scraping the bottom of the bowl to distribute the ingredients as needed, until soft and elastic. Transfer to a medium, lightly oiled bowl, and brush the top of the dough with a little oil. Cover with a damp tea towel and let rise in a warm place for 1 hour, or until soft and pillowy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the sauce: Add the 1/3 cup/80 milliliters oil and garlic to a medium ovenproof skillet and heat over medium-low, gently frying for 4 to 5 minutes, until soft and fragrant. (You don’t want the garlic to brown, so turn the heat down if necessary.) Transfer 3 tablespoons of the garlic-oil mixture to a small bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes with their juices, oregano, basil, sugar and 1/4 teaspoon salt to the skillet and simmer over medium-high heat, stirring occasionally, for 4 minutes. Add 2/3 cup/160 milliliters water, turn the heat to medium-low and continue to simmer for 15 minutes, stirring every now and then, until thickened slightly. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut the mozzarella into 20 cubes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dough to a clean work surface and use a pastry cutter or sharp knife to cut it into 8 equal pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use your hands to flatten each piece into a 2 1/2-inch/6 centimeter-wide round, then place a piece of mozzarella into the center. Fold the dough up and around, pinching the dough tightly to enclose the cheese. Turn the dough ball over, pinched side down, and use the palm of your hand to roll the dough against your work surface to make a smooth, neat ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a parchment-lined baking sheet (baking tray), and form the remaining dough balls, spacing them evenly apart as you place them on the baking sheet. Cover with a damp tea towel and leave to proof in a warm place for another 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees Fahrenheit/200 degrees Celsius. Brush the top of the dough balls with a little olive oil to coat, then bake for 10 minutes, or until golden brown. Set aside and heat the broiler (turn the oven grill setting to medium-high)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the sauce to medium-high heat and bring to a simmer. Once simmering, add the baked bread balls to the sauce, and arrange the remaining cheese cubes around them. Transfer to the middle rack of the oven and broil (grill) for 2 to 4 minutes, until the cheese is melted and bubbling and the bread balls are nicely browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the reserved garlic oil over the bread balls and season lightly with salt and pepper. Sprinkle with the extra oregano and basil, and serve right away."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021656-cheesy-bread-balls-in-tomato-sauce"}