{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato Cinnamon Swirl Bread", "description": "Roasted, puréed sweet potatoes lend moisture, flavor and a rich golden color to this hybrid breakfast bread and pastry. Here, a batter-like layer added to the yeasted dough, referred to as a wine loaf, helps prevent those gaps that often form in swirled breads. This recipe bakes beautifully in a small Pullman loaf pan, but any 1 1/2-pound-capacity loaf pan will do. If you can spare a slice, it makes a beautiful overnight French toast.", "author": {"@type": "Person", "name": "Laurie Ellen Pellicano"}, "image": "https://static01.nyt.com/images/2020/09/29/dining/lep-sweet-potato-loaf/merlin_176510394_51d02fb2-018a-499e-b237-93917b6cb034-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "One 9- to 10-inch loaf", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, lunch, snack, breads, pastries", "keywords": "active dry yeast, bread flour, brown sugar, cinnamon, nutmeg, raisin, sweet potato, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 171}, "recipeIngredient": ["3 tablespoons warm water", "2 1/4 teaspoons active dry yeast (from a 3/4-ounce packet)", "2 3/4 cups/390 grams bread flour, plus more for kneading", "2 1/2 teaspoons kosher salt", "1/2 teaspoon freshly grated nutmeg", "1/4 teaspoon ground mace", "5 tablespoons/70 grams unsalted butter, at room temperature, plus more for greasing", "1/3 cup/75 grams dark brown sugar", "1 large egg", "3/4 cup/210 grams sweet potato purée (from about 1 large sweet potato; see Tip)", "1 tablespoon heavy cream, half-and-half or milk, for brushing", "1 cup/150 grams golden or dark raisins (or a combination)", "1/3 cup/40 grams bread flour", "1/4 teaspoon baking powder", "1/4 teaspoon kosher salt", "1 teaspoon ground cinnamon, plus more for sprinkling", "1 1/2 tablespoons/20 grams unsalted butter, room temperature", "2 tablespoons dark brown sugar", "1 large egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: In a small bowl, mix together the warm water and yeast. Let sit, undisturbed, for 1 minute, then whisk to dissolve. Let sit until frothy, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together 2 3/4 cups flour, salt, nutmeg and mace. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, using a wooden spoon, beat together the 5 tablespoons butter and the sugar to form a paste. You are not looking for a lot of air; you just want the mixture to look cohesive."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break the egg into a small bowl or cup and stir with a fork to break up the yolk a bit, then add to the creamed sugar base. Beat with a sturdy wooden spoon to combine. Add the sweet potato purée and continue beating until mostly incorporated; the mixture will look curdled. Stir in the yeast mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour mixture and stir to create a soft, shaggy dough. Turn it out onto a flour-dusted surface and knead and fold the edges of the dough into the center until it comes together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue kneading for about 8 minutes, adding flour as necessary if the dough gets sticky until you form a smooth but tender ball. This is a wetter dough and may absorb up to 1/4 cup more flour, so keep adding as you knead. (Alternately, this whole process can be done in a mixer, using the beater attachment on low to combine the butter and sugar until creamy. Stream in the beaten egg, followed by the sweet potato purée and finish with the flour. Once all the flour is added, switch to the dough hook and mix on medium-low for 6 to 8 minutes. Three minutes into kneading, check for tackiness and add flour if the dough does not come cleanly off the hook.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape any leftover bits from the large bowl and discard. Grease with a little butter or oil, nest the dough in the bowl turning it once to coat lightly. Cover with a plate, pot lid or wet towel and let sit in a warm place until doubled in volume 1 1/2 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch down the dough, fold the edges into the center, flip the dough over and cover with a pot lid or an inverted plate. Chill overnight in the refrigerator (or at least 8 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next morning, soak the raisins in boiling water to cover and let them sit for 10 minutes to plump. Drain well and set aside. Grease a 1 1/2-pound-capacity loaf pan (such as a 9-by-4-inch small Pullman or a 10-by-5-inch loaf pan) with softened butter or oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the wine loaf: In a small bowl, whisk together the flour, baking powder, salt and cinnamon. In a separate small bowl, beat together the butter and sugar to make a paste. Add the egg and beat to combine. Add the flour mixture and stir until smooth and uniform. Keep at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove dough from the fridge; it should be puffy and nearly doubled in size. Turn the dough out onto a lightly floured surface. Roll the dough out into an oblong sheet that is about 18-by-6 inches, using a little flour if necessary to keep it from sticking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the wine loaf across the surface of the dough in a thin, even layer, using an offset spatula or sturdy rubber spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the plumped raisins over the battered dough, pressing lightly to adhere, then sprinkle very lightly with additional cinnamon to lightly coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the dough up lengthwise, shaping it into a tight 6-inch-long log. When finished, rock the loaf back and forth a bit on the surface and press on both ends with your hands to even it out. You want the loaf to fit snugly in the bottom of the pan. To adjust the dimensions, roll it a little more to elongate it or press the ends a few more times to make it shorter. Lift it up and slip the loaf into the buttered loaf pan, seam-side down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let rise at room temperature, covered loosely with a sheet of lightly greased plastic wrap, until doubled and brimming in your pan, about 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When your loaf looks close to ready, heat the oven to 375 degrees and position a rack in the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the surface of the loaf with cream, and bake for 50 minutes to 1 hour 15 minutes, rotating after 30 minutes to ensure even coloring. The loaf should be a deep golden brown and register 200 degrees when tested with a thermometer. (If the loaf is browning too quickly, you can tent with aluminum foil halfway through baking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and, using oven mitts or towels, bang the pan on all sides on the counter to release the loaf, carefully unmolding it onto a cooling rack. Let loaf cool completely before slicing. (If you cut it when hot, you may dry out the interior.) Store bread in an extra large sealed bag for 2 to 3 days, slice it before bagging for easy toasting. You can also freeze it in resealable freezer-safe plastic bags, whole or sliced."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021492-sweet-potato-cinnamon-swirl-bread"}