{"@context": "http://schema.org", "@type": "Recipe", "name": "Tsaramaso Malagasy (White Bean Tomato Stew)", "description": "Jeanne Razanamaria, a cook from Madagascar, transforms three ingredients with some oil and salt into a rich dish that tastes like it has secret seasonings hidden in its depths. Her simple technique of collapsing tomatoes with sautéed red onion then simmering both with beans and their cooking liquid concentrates them into a tangy, earthy stew. She shared this recipe with Hawa Hassan for the book “In Bibi’s Kitchen,” written with Julia Turshen. It works with any dried white bean, large or small, and tastes great on its own or with steamed rice.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2021/01/06/dining/04cookbooksrex-white-beans/merlin_181830831_89593d64-43f8-487a-bac1-6c064744c014-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "african", "recipeCategory": "dinner, easy, lunch, beans, soups and stews, main course, side dish", "keywords": "fall, spring, winter, nut-free, vegan, vegetarian, red onion, tomato, white beans", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 270}, "recipeIngredient": ["1/2 pound dried white beans, rinsed well and drained (see Tip)", "3 large tomatoes, preferably Roma", "Kosher salt", "1/4 cup canola oil", "1 large red onion, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the beans in a large pot and add enough cold water to cover them by 1 inch. Set the pot over high heat and bring to a boil, then turn the heat as low as it can go and partly cover the pot so steam can escape. Simmer the beans, stirring them every so often, until they’re tender, anywhere from 1 to 2 hours, depending on whether they’ve been soaked and how old they are. Make sure the beans are covered with water at all times, adding more hot water to the pot as needed if too much evaporates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, slice off and discard the tops of the tomatoes, and squeeze out and discard the seeds. Thinly slice the tomatoes and set them aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the beans are done cooking, season them to taste with salt. Reserve 1 cup of the cooking liquid, then drain the beans. (Discard the remaining liquid or reserve for another use, such as adding to a soup.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the oil in a large Dutch oven or other heavy pot and set over medium-high heat. Add the onion and cook, stirring occasionally, until the onion sizzles and starts to take on a little color at the edges, 2 to 4 minutes. Stir in the sliced tomatoes, cover and cook until the tomatoes begin to break down, about 2 minutes. Stir in the beans with the 1 cup reserved cooking liquid. Cover the pot and bring the mixture to a boil. Uncover and allow the beans to boil until the mixture has thickened significantly but remains soupy, 5 to 10 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the beans to taste with salt one final time and serve hot. Leftovers can be stored in an airtight container in the refrigerator for up to a few days. You can rewarm any remaining soup in a pot set over low heat, stirring occasionally while you heat and adding water if needed."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021759-tsaramaso-malagasy-white-bean-tomato-stew"}