{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Apple Pies", "description": "These little pies are filled to the brim with juicy caramel apple filling, fried, then tossed in cinnamon sugar. You may need to adjust the temperature as you fry them: If the oil is too hot, they’ll look golden on the outside, but the dough may not fully cook through. If the oil is too cool, they may be greasy. If you don’t have a thermometer, use a piece of scrap dough to test the oil for frying; it should rise to the top immediately.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2020/10/23/dining/ejm-apple-hand-pies/merlin_178770834_84d23b76-91f6-4174-a378-7eb6a68a2a50-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "14 individual pies", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "apple, apple pie, cinnamon, fall, winter, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 197}, "recipeIngredient": ["2 1/2 cups/320 grams all-purpose flour", "1/2 teaspoon fine sea salt", "1 cup/225 grams cold unsalted butter (2 sticks), cut into ½-inch cubes", "1/2 cup/120 milliliters ice water, plus more as needed", "2 tablespoons unsalted butter", "3 medium apples (about 1 pound), such as Honeycrisp, Granny Smith or Gala, peeled, cored and cut into 1/2- inch dice (about 3 cups/375 grams)", "1 tablespoon lemon juice", "1 teaspoon vanilla extract", "1/2 cup/110 grams light or dark brown sugar", "1 1/2 teaspoons ground cinnamon", "1 teaspoon ground ginger", "1/4 teaspoon ground nutmeg", "1/2 teaspoon fine sea salt", "3 tablespoons granulated sugar", "2 tablespoons all-purpose flour", "About 2 to 3 quarts vegetable or canola oil, as needed, for frying (see Tip)", "1/2 cup/100 grams granulated sugar", "2 teaspoons ground cinnamon", "Pinch of fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pie dough: In the bowl of a food processor, pulse the flour and salt to combine. Add the cubed butter and pulse until the butter is well distributed throughout, and the largest pieces are no larger than a pea. (You can also do this by hand with a pastry cutter in a large bowl.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mixture to a large bowl and make a well in the center. Add the ice water and toss the mixture with your hands to distribute the water throughout the flour. Once the mixture is very fine, press and knead it a few times until it comes together. If there are portions of the dough that are more hydrated, use your hands to break them up, then incorporate the drier portions of the dough. The dough should not be totally smooth, or overly wet. If needed, add more ice water, 1 tablespoon at a time, until the mixture comes together easily in a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough in half and form each into a disk about ½-inch thick. Wrap tightly in plastic wrap and chill for at least 1 hour and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a medium pot, melt butter over medium heat. Add apples, tossing to coat in the butter. Add lemon juice, vanilla, brown sugar, cinnamon, ginger, nutmeg and salt and stir to combine. Continue to cook, stirring occasionally, until the sugar dissolves and the apples start to soften, 5 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together granulated sugar and flour. Add to the pot and stir well to combine. Stir constantly until the mixture thickens, 2 to 3 minutes. (If you’d like to make it ahead of time, the filling will keep refrigerated for up to 3 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the dough is chilled, and using a lightly floured rolling pin on a lightly floured surface, roll out one disk about ¼-inch thick. Use a 4-inch round biscuit cutter or cup to cut about five circles from the dough. (You can also use a plate or stencil as a guide and use a knife to cut.) Wrap the scraps in plastic wrap and chill while you fill the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a fork or small slotted spoon to transfer about 1 heaping tablespoon filling into the center of each circle. (Try to scoop just the apples, leaving behind most of the syrup.) Brush the outside edge of one half of the dough with cool water, then fold the circle in half to encase the filling. Press the edges firmly to seal, then crimp with a fork. Transfer to a parchment-lined baking sheet, and refrigerate, uncovered, while you shape the remaining pies. Repeat this process with the other disk of dough and combine the dough scraps with the others in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Re-roll the combined scraps to create about another 4 circles of dough and repeat the process with the remaining filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 3 to 4 inches oil in a medium, heavy-bottomed pot over medium heat. When the oil reaches 350 degrees on an instant-read thermometer, you’re ready to fry. (You can also test the temperature with a scrap piece of dough; it should immediately rise to the surface.) Line a baking sheet with a few layers of paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the sugar, cinnamon and salt. Remove the pies from the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry 3 to 4 pieces at a time (or fewer if necessary to avoid crowding) until evenly golden brown, 3 to 4 minutes. Watch the temperature of the oil. You may need to adjust the heat as you work. When the hand pies are evenly browned, use a spider or slotted spoon to remove them from the oil and transfer to the towel-lined baking sheet to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After about 1 minute, while the pies are still warm, toss them in the cinnamon sugar to coat, then set on a serving platter. Repeat the frying and coating process with the remaining pies. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021578-fried-apple-pies"}