{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin Roll With Coffee-Caramel Cream", "description": "A roulade is a classic dessert made by rolling a thin cake around a flavorful filling, which creates an inviting swirl once sliced. This roulade starts with a subtly spiced, moist pumpkin cake that is wrapped around a rich filling made with cream cheese, heavy cream, caramel and coffee. The filling is bittersweet and slightly savory, which works nicely with the earthy pumpkin sponge. Make sure to use very finely ground coffee, like what you would use to make a cup of pour-over.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2020/11/17/dining/sse-pumpkin-roll/merlin_179685645_2437644b-4356-4f8e-bec6-0fecb17a1e68-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "cakes, dessert", "keywords": "cinnamon, coffee, cream cheese, flour, heavy cream, pumpkin purée, sugar, pumpkin,, fall, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 409}, "recipeIngredient": ["Unsalted butter, for greasing", "1 1/4 cups/160 grams all-purpose flour", "1 teaspoon ground cinnamon", "3/4 teaspoon baking powder", "1/4 teaspoon baking soda", "1/2 teaspoon kosher salt", "1 cup/240 grams canned pumpkin purée", "3 large eggs", "1/2 cup/100 grams granulated sugar", "1/2 cup/110 grams dark brown sugar", "1 teaspoon pure vanilla extract", "Confectioners’ sugar, for dusting", "1/2 cup/100 grams granulated sugar", "1/4 cup/60 milliliters heavy cream", "1 tablespoon unsalted butter", "2 teaspoons very finely ground coffee", "8 ounces cream cheese, cut into cubes and softened to room temperature", "1/4 cup/30 grams confectioners’ sugar", "1/2 cup/120 milliliters heavy cream", "Confectioners’ sugar, for dusting (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Butter a 13-by-18-inch rimmed baking sheet. Line it with parchment paper, then butter the parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake: In a medium bowl, whisk together the flour, cinnamon, baking powder, baking soda and salt. In a large bowl, whisk together the pumpkin purée, eggs, granulated sugar, brown sugar and vanilla extract until smooth. Fold the dry ingredients into the wet ingredients, whisking gently if needed to eliminate any lumps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the batter onto the prepared sheet in an even layer. (It won’t look very thick.) Bake until the cake is puffed, set and springs back when pressed gently in the center, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, set a clean dish towel on a work surface. Dust until evenly coated with confectioners’ sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cake from the oven and use a paring knife to loosen it from the edges. Immediately flip the cake out onto the prepared towel and peel off the parchment paper. Starting from one of the short edges of the towel, roll the cake and towel up into a spiral, taking care not to compress the cake. Transfer the towel-wrapped cake to a rack to cool completely, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake bakes, prepare the filling: Add 1 tablespoon water to a small saucepan. Add the granulated sugar and bring to a simmer, without stirring, over medium-high heat. Once the sugar starts to turn amber in spots, swirl the pan to help the sugar cook evenly. Continue to cook the sugar mixture, swirling occasionally, until it turns a deep amber color, 6 to 8 minutes. Remove it from the heat and immediately stir in the cream, butter and ground coffee. (Be careful, as the mixture will steam and bubble.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook for another minute or two over medium heat, stirring until the mixture is smooth and creamy, then carefully pour it into the bowl of a stand mixer fitted with the paddle attachment. Let the caramel cool for a few minutes but don’t let it cool completely, as it will harden."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer on low, add the cream cheese a few pieces at a time until it’s all incorporated, scraping down the sides of the bowl as needed. (Don’t worry if the first few pieces melt a bit when they hit the caramel.) Beat in the confectioners’ sugar. Transfer to a smaller bowl, if you’d like, cover and chill until completely cold, at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to assemble, whip 1/2 cup heavy cream to stiff peaks. Fold the whipped cream into the chilled cream cheese mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully unroll the cooled cake. Spread the filling evenly over the cake and then roll it back up without the dish towel. Trim about 1 inch from each end of the cake. Transfer to a serving plate, dust with confectioners’ sugar, if using, and serve immediately. (You can also make the cake in advance and refrigerate up to 24 hours, but wait to dust with confectioners’ sugar until you’re ready to serve.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021591-pumpkin-roll-with-coffee-caramel-cream"}