{"@context": "http://schema.org", "@type": "Recipe", "name": "Gingery Grilled Chicken Thighs With Charred Peaches", "description": "Coated in a balsamic vinegar glaze that’s spiked with ginger, garlic and soy sauce, these chicken thighs are sweet-tart and irresistibly sticky. They’re served with grilled thyme and honey butter-basted peaches, which become soft and wonderfully jammy on the fire. The yogurt is optional. It adds a cool and creamy counterpart to the char and smoke, but the dish is just as satisfying without it.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/07/01/dining/01Appetite-Chicken-Peach/01Appetite-Chicken-Peach-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry, main course", "keywords": "balsamic vinegar, chicken thigh, peach, fourth of july, labor day, memorial day, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1750}, "recipeIngredient": ["5 tablespoons balsamic vinegar (preferably the good, syrupy kind)", "2 tablespoons finely grated fresh ginger and any ginger juice from a 2-inch piece", "Kosher salt", "2 1/2 pounds boneless, skinless chicken thighs", "8 fresh thyme sprigs, or 4 fresh rosemary sprigs", "3 garlic cloves, finely grated or mashed to a paste", "2 tablespoons soy sauce", "1 teaspoon fresh lime juice, plus more as needed", "Olive oil, for brushing", "Plain whole-milk yogurt, for serving (optional)", "3 scallions, white and green parts, thinly sliced (optional)", "Handful of torn fresh basil (optional)", "2 tablespoons unsalted butter, melted", "1 tablespoon chopped fresh thyme, or 2 teaspoons chopped fresh rosemary", "1 teaspoon honey", "3 to 4 ripe peaches or nectarines, halved and pitted", "Flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Marinate the chicken: In a small bowl, mix together balsamic vinegar, grated ginger and a pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken all over with salt, and put it in a larger bowl or resealable bag. Add 2 tablespoons of the balsamic mixture. (Give it a stir before measuring in case any of the ginger has fallen to the bottom. Save remaining balsamic for serving.) Add the thyme, garlic, soy sauce, and 1 teaspoon lime juice. Cover bowl or close bag, and let chicken marinate in the refrigerator for at least 2 hours and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light the grill or heat the broiler, arranging the rack about 4 inches from the heat source."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the peaches: In a bowl, combine butter, thyme and honey. Brush peaches lightly with butter mixture and place in a grilling basket, if you have one, or directly on the grill. Grill over direct heat until just charred, 2 to 4 minutes per side. You’ll know they are done when the skin curls back and the flesh starts to melt. Transfer to a serving platter or plates, and, if you like, drizzle with a little more of the butter mixture and sprinkle with flaky sea salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If there’s room on the grill, cook the chicken at the same time (or wait until peaches are done). Brush off any clinging pieces of marinade from chicken, pat it dry, and coat lightly with oil. Grill or broil until charred and browned, 4 to 6 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer chicken to a platter or serving plates, along with the peaches. Serve with dollops of yogurt on the side if you like, and a drizzle with some of the remaining gingery balsamic and a little more olive oil. Scatter with scallions and basil, if using, for garnish."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021197-gingery-grilled-chicken-thighs-with-charred-peaches"}