{"@context": "http://schema.org", "@type": "Recipe", "name": "Jalapeño Jangjorim With Jammy Eggs", "description": "Jangjorim is a Korean dish of soy sauce-braised meat, often studded with pulled eye of round (sometimes sold as “jangjorim meat” at Korean grocery stores), hard-boiled eggs and wrinkly kkwarigochu (shishito peppers), which are mild enough to eat whole. This version, inspired by my mother’s recipe, uses eggs that are just boiled enough that they’ll peel easily and the yolks will remain fudgy. In place of the shishitos are fat, juicy jalapeños, adding a welcome freshness and fruity heat. And the beef is brisket, shredded into long, pleasurably chewy strands, which soak up the umami-rich soy sauce brine. As a banchan, this dish is an ideal accompaniment to a bowl of fresh white rice. Any leftover sauce you might have is a large part of the joy of making jangjorim: It tastes fabulous when soaked into rice with a drizzle of toasted sesame oil, or as a sweet, saline base for soba noodles.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2020/09/30/dining/28banchanrex1/merlin_177434073_4c7a9612-2947-4fbe-9e2d-d1ee10f1341e-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "korean", "recipeCategory": "dinner, lunch, snack, meat, side dish", "keywords": "beef brisket, garlic, ginger, jalapeño, small plate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 158}, "recipeIngredient": ["Ice, as needed", "5 large eggs", "1 pound beef brisket, cut into 3-inch cubes", "1/2 medium yellow onion, unpeeled", "2 large scallions, halved crosswise", "1 (5-inch) square dasima (dried kelp)", "1 (2-inch) piece fresh ginger, unpeeled and thinly sliced", "1 cup low-sodium soy sauce", "3 packed tablespoons dark brown sugar", "1 tablespoon mirin", "4 large jalapeños, halved lengthwise, deseeded if you don’t like heat", "7 large garlic cloves, peeled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot over high heat, bring 6 cups water to a boil. Set up an ice bath in a medium bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spoon, gently lower the eggs into the boiling water, reduce the heat to medium-high and cook at a moderate boil for 8 minutes. Immediately transfer the eggs into the ice bath. Let the eggs cool for 5 minutes, then peel and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently nestle the beef brisket into the pot of hot water; add the onion, scallions, dasima and ginger. Bring to a boil again, then reduce the heat to medium and cook at a gentle boil until the meat is tender, about 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a pair of tongs, transfer the meat onto a cutting board and let cool slightly. As the meat cools, strain the broth through a fine-mesh strainer into a large bowl and discard the aromatics. Add 3 cups of broth back to the pot. (Any remaining broth can be reserved for soup or noodles.) Add the soy sauce, brown sugar and mirin to the pot and stir until combined. With your hands, shred the beef into thin strands, and add to the pot as well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the pot to a boil and cook over medium-high heat until the soy sauce brine reduces slightly, about 10 minutes. Nestle in the peeled eggs along with the jalapeños and garlic. Turn off the heat and let the mixture cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve at room temperature. (If preparing in advance, transfer the mixture to a resealable container, such as a Mason jar, and keep in the refrigerator for up to 1 week. This dish tastes great cold, straight out of the fridge.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021440-jalapeno-jangjorim-with-jammy-eggs"}