{"@context": "http://schema.org", "@type": "Recipe", "name": "Brown Sugar Roulade With Burnt Honey Apples", "description": "If the flavors of winter could be rolled into one, then this meringue roulade would be the result: Warming cinnamon, burnt honey, sweet apples and tangy orange come together to make a dessert fit for the festive season. Make sure all your individual components have completely cooled before assembling, as you don’t want to create any excess moisture in the roulade. Get ahead by making the apples and cream the day before, then keeping them refrigerated until needed. Feel free to make this roulade your own by swapping out pears for apples, cardamom for cinnamon or more whipping cream for mascarpone. So long as you stick to the basic technique, the flavors are yours to play with.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2020/12/11/dining/11Ottolenghirex1/11Ottolenghirex1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "snack, cakes, dessert", "keywords": "apple, bay leaves, egg, honey, mascarpone, orange, vanilla, christmas, new year’s day, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 498}, "recipeIngredient": ["1/2 cup/150 grams runny honey", "1 vanilla bean (vanilla pod), halved, seeds scraped out and bean reserved", "5 fresh bay leaves", "1 cinnamon stick", "1/2 teaspoon ground cinnamon", "1/2 teaspoon flaky sea salt", "3 1/2 tablespoons orange juice", "2 1/2 pounds/1.1 kilograms Braeburn apples (about 7 to 8), peeled, cored and each cut into 8 wedges (or 10 if the apples are larger)", "1 tablespoon olive oil", "9 ounces/250 grams chilled egg whites (from 6 to 8 large eggs, or an egg white carton)", "1 1/4 cups/250 grams superfine sugar (caster sugar)", "1/2 cup/100 grams soft light brown sugar", "1 tablespoon vanilla bean paste", "2 teaspoons white wine vinegar", "2 teaspoons cornstarch (cornflour)", "1 1/2 teaspoons ground cinnamon", "1 cup plus 2 tablespoons/250 grams mascarpone, cold", "2/3 cup/160 milliliters cold whipping cream", "2 tablespoons/20 grams confectioners’ sugar (icing sugar)", "1 tablespoon orange zest, plus 1 teaspoon to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven 425 degrees Fahrenheit/220 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the apple filling: Add the honey, vanilla seeds and bean (pod), bay leaves, cinnamon stick, ground cinnamon and flaky salt to a large, oven-proof sauté pan. Cook over medium heat until the honey is deeply brown and almost burned, stirring often. (Don’t be afraid to take it to the edge; you want it to be very dark.) This process can take anywhere from 6 to 10 minutes, so make sure you keep an eye on it. Off the heat, whisk in the orange juice. Gently pour 5 tablespoons/65 grams of the burnt honey into a heatproof bowl. Pick out the bay leaves and vanilla beans (pods), and add them to the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the sauté pan with the remaining burnt honey, stir in the apples and olive oil. Transfer to the oven for 20 minutes, stirring halfway through, until the apples have softened and caramelized but still retain their shape. Set aside to cool completely. Pick out the cinnamon stick and add it to the reserved burnt honey bowl. Keep the oven on."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the roulade: Line an 11-by-15-inch (30-by-40-centimeter) baking sheet (baking tray) with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the egg whites to the bowl of a stand mixer fitted with the whisk attachment and beat on medium-high speed for 1 to 2 minutes, until soft peaks form. Combine both sugars in a bowl, then gradually add them to the mixer, 1 tablespoon at a time, whisking continuously on medium-high for 5 to 6 minutes, until the mixture becomes a thick, glossy meringue. Reduce the speed to low and add the vanilla, vinegar, cornstarch (cornflour) and cinnamon, then scrape the sides of the bowl, if needed. Turn the speed to medium and whisk for 1 minute to fully combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the meringue onto the prepared tray and use an offset spatula to spread it out evenly about 3/4-inch thick so it measures about 10 by 14 inches (25 by 35 centimeters). Once the apples have cooked, transfer the meringue to the oven and immediately turn the heat to 375 degrees Fahrenheit/200 degrees Celsius. Bake for 32 minutes, until the meringue is crusty on top and lightly browned. Set aside to deflate and cool completely, about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the cream: Add the mascarpone, whipping cream and confectioners’ sugar (icing sugar) to a stand mixer fitted with the whisk attachment. Beat on medium speed for about 1 minute, until soft peaks form. Stir in 1 tablespoon orange zest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a clean tea towel on top of the cooled meringue and quickly invert the whole thing onto a work surface. Lift off the pan (tin) and peel away the parchment paper. Spread three-quarters of the cream evenly all over the meringue. Top evenly with the burnt honey apples. (Reserve any liquid released from the apples for another use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Starting with the longest side closest to you and using the tea towel to assist you, roll the meringue up and over, so that the edges come together to form a log, gently pulling away the tea towel as you roll. Slide the meringue onto a long tray or platter, seam-side down. Use a serrated knife to trim off 3/4 inch (2 centimeters) from the sides to create neat edges. (You can nibble on these, if you like!) Refrigerate to firm up, at least 30 minutes (and up to 3 hours if you’re getting ahead)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon the remaining cream down the length of the roulade. Top artfully with the bay leaves, vanilla pods and cinnamon stick. Drizzle with the reserved burnt honey syrup and sprinkle with the extra zest."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021695-brown-sugar-roulade-with-burnt-honey-apples"}