{"@context": "http://schema.org", "@type": "Recipe", "name": "Tamales de Chile Rojo (Red Chile Tamales With Meat)", "description": "Tamales are often served with complementing salsas and soups, but Claudia Serrato serves her exquisite tamales de chile rojo — made with freshly ground nixtamalized blue corn and filled with tender, braised bison — plain, exactly as they are, with nothing else on the plate. The tamal is so deeply flavored, so perfumed with corn and chiles, that it doesn’t need a thing to hold your attention. Eat these the day you steam them, when they’re still piping with steam from the tamalera, and the next day, fry leftover unwrapped tamales in a hot pan for a perfect holiday breakfast.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2020/12/23/dining/18Tamalesrex2/merlin_181221021_efd57f54-ddd2-445c-80a2-5c93c8d58b09-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "About 20 tamales", "recipeCuisine": "", "recipeCategory": "", "keywords": "corn husks, masa de maiz azul, vegetable shortening", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "recipeIngredient": ["40 dried corn husks (from about 1 pound)", "4 cups harina de maíz nixtamalizado azul (blue corn masa flour); see Notes", "1 tablespoon baking powder", "2 cups meat or vegetable broth or water; see Notes", "1 pound vegetable shortening (2 1/4 cups)", "1 tablespoon coarse sea salt", "3 3/4 cups Carne con Chile Rojo, for filling <a href=\"https://cooking.nytimes.com/recipes/1021732-carne-con-chile-rojo-chuck-braised-in-chile\">(see recipe)</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sort through the husks to get 20 large ones and place in a large bowl, along with 10 additional smaller husks. Add enough boiling water to cover and weigh down with a plate to soak until softened, at least 30 minutes or up to 3 hours. Drain and wipe dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the harina de maíz nixtamalizado azul and baking powder in a large bowl and gradually add 1 1/2 cups broth while mixing and kneading with your hands. Add the remaining broth as needed to achieve a smooth dough that feels neither moist nor dry. It shouldn’t stick to your fingers but should hold together in a single mass."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the vegetable shortening in a large bowl by hand or with an electric stand or handheld mixer on medium-high speed until it becomes very smooth and brighter in color, 3 to 5 minutes. Beat in the salt until incorporated. Add the masa by the handful and beat, on low speed if using an electric mixer, until evenly incorporated. Beat on medium-high speed, scraping the bowl occasionally, until fluffy, about 5 minutes. The mixture should be the texture of buttercream. To see if the dough is ready, fill a small cup with water and drop in a 1/4 teaspoon dough. It should immediately rise and float."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the tamales: Place a large corn husk on your work surface or in your hand. Using the back of a spoon or a small palette knife, spread about 1/3 cup masa (2 ounces) in a rectangle (about 5- by 6-inches) in the center, leaving a few inches empty on the long sides. Add 3 tablespoons meat filling (2 ounces) in a line down the center of the masa. Wrap the tamal: Hold the long sides of the husk and bring them together, so the masa meets in the center and encloses the filling, then fold those sides of the husk together over and around the enclosed filling. Fold the pointed end over the tamal to secure and place on a sheet pan. Repeat with the remaining ingredients, stacking the folded tamales on the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To steam the tamales: Place a few coins in the bottom of a tamalera or other deep steamer pot and add enough water to come to the bottom of the steamer insert and no higher so the water won’t touch the tamales. The coins will stop clattering if your water runs low and let you know that you need to replenish with more hot water. Arrange the tamales upright in the steamer, open-side up, leaving a space in the center. The tamales should be touching. Cover the tops with the remaining corn husks, then cover the steamer with the lid. Bring the water to a boil and steam for 1 hour, pouring in more water through the empty center as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To test for doneness, remove one tamal, unwrap and cut through the center. There should be no raw masa remaining, and the tamal should peel away easily from the husk as you unwrap it. If not, continue steaming, checking for doneness every 15 minutes. When cooked, remove from the heat and let stand in the steamer for 15 minutes before serving. The tamales can be kept warm in the steamer off heat for up to an hour. Steamed tamales can be cooled completely, wrapped tightly, and frozen for up to 3 months. Thaw overnight in the refrigerator, then steam again in husks or unwrap and pan-fry until heated through, about 15 minutes."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021731-tamales-de-chile-rojo-red-chile-tamales-with-meat"}