{"@context": "http://schema.org", "@type": "Recipe", "name": "Tian", "description": "The tian is both a vessel and the name of what’s cooked in it: summer vegetables, sliced quite thin, arranged in careful layers, drenched in quality olive oil and then cooked in a slow oven until each individual vegetable surrenders to the others, becoming one. The true and complete melding of earthy zucchini, sweet onion, waxy potato, juicy and acidic tomatoes is the great achievement of a well-made tian, and resting the finished dish after cooking is no small part of that success. By using a cast-iron pan and starting on the stovetop during the build, covering with a lid along the way, you speed up the cooking significantly. Season every layer and generously drizzle each with olive oil to bring out tremendous flavor and aroma. The Sungold tomatoes are beautiful and bright and quite acidic — perfect against the other flavors — but I find the skins unpleasantly leathery-papery when they are cooked, so simply peel them first. Dropping the tomatoes for 30 seconds into seasoned boiling water splits their skins readily and they slip off effortlessly. I would even say it’s kind of fun.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2020/08/30/magazine/30mag-eat/30mag-eat-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, vegetables, main course, side dish", "keywords": "bread crumbs, cherry tomatoes, onion, potato, zucchini, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1412}, "recipeIngredient": ["2 tablespoons unsalted butter", "3 medium Yukon Gold potatoes (about 12 ounces)", "Kosher salt and freshly ground black pepper", "1/4 cup extra-virgin olive oil", "1 large yellow onion (about 12 ounces)", "2 zucchini (about 12 ounces), washed and wiped free of any clinging grit", "1 pint yellow Sungold cherry tomatoes", "1/3 cup coarse bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pot, boil 2 inches of water for blanching tomatoes. Place an 8- or 9-inch cast-iron skillet on a burner over low heat, and add butter to melt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the potatoes, and slice on a Japanese mandoline into 1/4-inch-thick disks, then arrange in a single layer circle covering the bottom of the cast-iron skillet with its melted butter, keeping the skillet on the burner and leaving the heat on while you start to build the tian."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a second layer of potato slices, and season with salt and pepper, add a drizzle of olive oil and cover with a lid to slightly steam while you slice the yellow onion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the onion, then slice into even 1/4-inch or thinner rounds. The Japanese mandoline is sometimes too narrow to use for this, so you may have to use a sharp knife and do it manually."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Layer abundantly half the onion rings evenly around the pan on top of the steamed potatoes, season with salt and pepper and a drizzle of olive oil, and recover the pan with a lid while you slice the zucchini."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the zucchini into 1/4-inch-thick rounds, and layer half of them in concentric, just-overlapping shingled circles over the onions to create a neat layer. Season with salt and pepper, drizzle with oil and recover with the lid while you blanch the tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the now-boiling water with a few good pinches of salt, and drop the tomatoes into the boiling water. As soon as their skins split — about 30 seconds — retrieve the tomatoes and run under cold water to quickly cool enough to handle; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Build another ring of potato around the tian on top of the now-steaming zucchini, this time just a single layer. Drizzle with oil, season with salt and pepper and recover with the lid to steam a bit while you slip the skins off the tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Layer the other half of the onions as before, season and drizzle and replace the lid as before, while you split the tomatoes in half horizontally with a small sharp knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add final layer of zucchini to the tian, and season with salt and pepper and a drizzle of olive oil. Cover, and let steam while you heat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tomatoes around the top of the tian evenly, and sprinkle the bread crumbs over the top evenly. Drizzle with oil, season with salt and pepper and place in the oven to bake for 30 minutes. (If your skillet threatens to bubble over, slip a sheet pan underneath to prevent any burned wreckage in the bottom of your oven.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a spoon, baste, and drizzle the pan juices that accumulate in the tian over the top when you remove it from the oven at the end. Allow the tian to cool, settle and kind of meld for an hour before eating."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021395-tian"}