{"@context": "http://schema.org", "@type": "Recipe", "name": "Pure Potato Latkes", "description": "Perfect for Hanukkah or any time of year, these latkes bring out the pure flavor of potato, because that is basically the only ingredient in them. Making latkes can be a last-minute nightmare, with overeager cooks putting too many patties in hot oil, thus taking longer to fry and resulting in a greasy mess. But these can be prepared in advance. This recipe, adapted from the chef Nathaniel Wade of the <a href=\"https://www.outermostinn.com/\">Outermost Inn</a> on Martha’s Vineyard, starts with parbaked potatoes, which are cooled, grated, seasoned with just salt and pepper, pressed into patties and refrigerated, then fried just before serving. You can either serve them with crème fraîche or sour cream, smoked salmon and tiny flecks of chives, or <a href=\"https://cooking.nytimes.com/recipes/1016867-brisket-in-sweet-and-sour-sauce\">traditional brisket</a> and homemade applesauce.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2020/12/16/dining/04latkerex/merlin_180333147_6a3d81ad-b056-4c35-b146-e1221f077e14-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 latkes", "recipeCuisine": "", "recipeCategory": "dinner, appetizer, main course, side dish", "keywords": "fall, winter, hanukkah, plan-ahead, russet potatoes, smoked salmon, vegetable pancake", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2820}, "recipeIngredient": ["4 large Idaho or russet potatoes, washed and dried", "Kosher salt and freshly ground black pepper", "Canola oil, for frying", "8 ounces sliced smoked salmon (optional)", "Crème fraîche or sour cream, for serving (optional)", "Chopped fresh chives, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust the rack in the middle of the oven and heat to 350 degrees. Bake the potatoes directly on the rack for 30 minutes, then flip and bake for another 15 minutes until they are hot throughout but still raw in the middle. Remove and let cool for about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the potatoes in half widthwise. Holding the curved peel side with one hand, grate the flat, flesh side of each piece using the large holes of a box grater. The grating process should open them up like a jacket, leaving you with potato skins perfect for frying later, if you’d like. (You could also use a food processor with a grating blade instead; just peel your potatoes beforehand.) Sprinkle the grated potatoes with 1 teaspoon salt and 1/2 teaspoon pepper. Adjust the seasoning to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take about 1/2 cup grated potato in your hands and gently squeeze between your palms to form a patty. Press the patty until about 1/2-inch thick and carefully set the latke on a plate. Repeat with the remaining grated potatoes to make about 8 latkes. Cover and refrigerate a few hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, heat a large, heavy skillet with about 1/4 inch of canola oil over medium-high. When it is hot, a shred of potato dropped into the oil should sizzle. Working in two batches, gently fry four latkes until crisp and deep golden, about 3 to 4 minutes per side. Transfer to paper towels or a paper bag to drain, and repeat with remaining latkes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot, topped with a slice of smoked salmon, a dollop of crème fraîche or sour cream and a few sprinkles of chives, if you like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021682-pure-potato-latkes"}