{"@context": "http://schema.org", "@type": "Recipe", "name": "Salt-Rising Bread", "description": "Salt-rising bread is an American technique with deep roots: Home bakers who developed the bread in Appalachia didn’t have access to yeast, but found a way to bake without it when they noticed that their milk starters bubbled up overnight. It’s much easier and far more consistent to get a good rise with yeast — even bakers who make salt-rising bread regularly have failures with the finicky technique. But those who continue the tradition are rewarded with light, tender, airy crumbed bread that makes a particularly delicious toast. Be sure to maintain the starter at an even temperature, as directed, or it won’t take.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2020/11/22/magazine/22mag-Eat/22mag-Eat-articleLarge.jpg", "totalTime": "PT13H15M", "recipeYield": "1 (9-inch) loaf", "recipeCuisine": "american", "recipeCategory": "snack, breads", "keywords": "butter, cornmeal, flour, milk, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 419}, "recipeIngredient": ["1/2 cup/120 milliliters whole milk", "1 tablespoon fine cornmeal", "4 cups/510 grams all-purpose flour", "1/8 teaspoon baking soda", "2 tablespoons unsalted butter, at room temperature, plus more for greasing the loaf tin", "1 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the milk in a small saucepan over medium just until the edges start to bubble. Let the milk cool for 5 minutes. Meanwhile, set the cornmeal and 1 teaspoon flour in a medium bowl. Once the milk has cooled, pour it over the cornmeal mixture, and whisk it well. Cover with plastic wrap, and keep warm — 104 to 110 degrees — for about 8 hours. You could use a water bath, a crockpot or an oven that has been turned off, but if the starter isn’t consistently kept warm, it won’t take. When the top of the starter is foamy and it smells a little like cheese, it’s ready for Step 2."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a wooden spoon, mix 1 cup/240 milliliters hot water with 1 1/2 cups/190 grams flour and the baking soda, then add the starter to it, and mix well. Cover, and keep warm in the same way you did for Step 1, for 2 to 4 hours, until the dough is bubbly and has nearly doubled in size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape into the bowl of a stand mixer. Using the beater attachment, with the speed on medium, add butter and salt, then add remaining flour in 1/2-cup increments — you may not need to add it all for the dough to come together. The dough should be smooth and a little soft and sticky after about 5 minutes of beating in the stand mixer on medium speed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to a buttered 9-inch loaf tin, cover again and let it rest somewhere warm in the pan for 2 to 3 hours, until the top is slightly puffed and rounded."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Once the dough is ready, uncover it and bake for 40 to 50 minutes, or until the top is deeply golden and the loaf sounds hollow when tapped. Let cool completely in the pan before turning out and slicing."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021655-salt-rising-bread"}