{"@context": "http://schema.org", "@type": "Recipe", "name": "Cacio e Pepe Cheese Puffs", "description": "Ina Garten’s 12th cookbook, “Modern Comfort Food,” was published in October 2020. As always, she seemed to have her finger on the culinary zeitgeist: Comfort was the order of the day. These puffs, which she adapted from the Brooklyn chef Missy Robbins, combine the richness of classic gougères with the bite of black pepper and Parmesan.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2020/11/18/dining/16Inarex1/merlin_179473275_4d757ab2-6c5b-4399-878d-0e98b78a079d-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "40 to 50 puffs", "recipeCuisine": "american", "recipeCategory": "snack, finger foods, pastries, appetizer", "keywords": "black pepper, freezer friendly, parmesan, pecorino romano, christmas, easter, mother’s day, new year’s day, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2540}, "recipeIngredient": ["1 cup/240 milliliters whole milk, plus 1 teaspoon for the egg wash", "1/2 cup/115 grams unsalted butter (1 stick), diced", "Kosher salt and freshly ground black pepper", "1 cup/130 grams all-purpose flour", "5 large eggs", "1/2 cup/70 grams freshly ground Parmesan", "1/2 cup/70 grams freshly ground aged pecorino cheese, plus 2 tablespoons for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Arrange two racks so they are evenly spaced in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, heat 1 cup milk with the butter, 1 teaspoon salt and 1 teaspoon pepper over medium just until bubbles start to form around the perimeter and the milk is scalded. (Don’t allow it to boil.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour all at once and beat the mixture vigorously with a wooden spoon until it comes together. Lower the heat and cook, stirring constantly, for 2 minutes. Dump the mixture into the bowl of a food processor fitted with the steel blade. Immediately add 4 eggs, the Parmesan and pecorino, and pulse until the eggs and cheeses are completely incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two sheet pans with parchment paper. Working in batches, spoon the dough into a large pastry bag fitted with a 5/8-inch round pastry tip or a large, gallon-size resealable bag, snipping off a lower corner before piping."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pipe the dough onto the sheet pans in 1 1/4-inch-wide, 3/4-inch-high mounds, setting them each 1 inch apart. (You can also use two spoons to scoop the mixture and shape the puffs.) The mounds should be shaped like huge chocolate kisses. Using a wet finger, lightly press down the swirl on top of each puff."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the egg wash: In a small bowl, whisk the remaining egg with the remaining 1 teaspoon milk until combined. Brush the top of each puff lightly with the egg wash and sprinkle with the remaining pecorino; season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cheese puffs until browned, about 15 to 20 minutes, rotating the pans halfway through baking. Serve hot. (If preparing the cheese puffs in advance, you can bake them off, allow them to cool, then freeze them in a sealed resealable bag. Reheat them on a parchment-lined baking sheet at 375 degrees for 10 minutes.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021628-cacio-e-pepe-cheese-puffs"}