{"@context": "http://schema.org", "@type": "Recipe", "name": "Tang Yuan", "description": "This Chinese dessert is a favorite for Lunar New Year, or really, any time. Rice flour rounds filled with black sesame are simmered in sweet ginger soup until bobbing and shiny like pearls. When you scoop a dumpling with a spoonful of soup, then take a bite, you first taste the subtly sweet wrapper, which yields like nougat to the soft, toasty, nutty center. Be sure to refill the spoon with soup before the second bite, because you want the ginger’s warmth to play sharp against the rich filling. Making tang yuan is as fun as eating them and nearly as easy. Soft and forgiving, the glutinous rice flour dough is simple to form and patch, no rolling pin needed.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2021/02/03/dining/01Dumplingrex1/merlin_182770545_350adf92-2333-4616-bdb0-6f2e1e7b1825-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings (about 24 dumplings)", "recipeCuisine": "chinese", "recipeCategory": "dinner, soups and stews, appetizer", "keywords": "black sesame seeds, ginger, lunar new year, peanut butter, rice flour, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 308}, "recipeIngredient": ["1 (2-inch) piece/65 grams fresh ginger, scrubbed and cut into 1/4-inch slices", "3/4 cup/155 grams rock sugar or 1/2 cup/100 grams granulated sugar", "1/2 cup/70 grams roasted black sesame seeds (see Tip)", "3 tablespoons/40 grams granulated sugar, plus more if desired", "3 tablespoons/50 grams creamy peanut butter or unsalted butter", "1 1/4 cups/175 grams glutinous rice flour, plus more as needed (see Notes)", "4 teaspoons grapeseed oil or other neutral oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the soup: Combine the ginger and sugar in a large saucepan with 6 cups water. Bring to a boil over high heat, stirring to dissolve the sugar, then turn the heat to the lowest setting. Let steep until ready to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Process the sesame seeds in a food processor until very finely ground. Add the sugar and pulse until the mixture is as fine as sand, then pulse in the peanut butter until the mixture forms a smooth mass. Taste and add more sugar if you’d like, then pulse to incorporate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a measuring teaspoon, scoop and pack a flat spoonful of the sesame seed mixture, then push it out of the spoon onto a rimmed baking sheet using your fingertip. Repeat with the remaining mixture and note how many pieces you get. (It should be around 24.) Press and gently squeeze each spoonful into a ball. Transfer to the freezer to firm up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Place the flour in a medium bowl and set the bowl on a damp kitchen towel so it won’t slip. Bring 2/3 cup water to a boil in a small saucepan on the stovetop or in a heatproof liquid measuring cup in the microwave. Add the oil to the water, then pour the mixture into the flour in a slow, steady stream while stirring with chopsticks or a fork. Continue stirring until the liquid is incorporated. The mixture should look like floury pebbles. Cover with a damp towel or plastic wrap and let stand 5 minutes to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze and gather the pebbles into a ball in the bowl. Roll onto a clean work surface and knead, flouring the dough and surface if the dough sticks, until very smooth and room temperature, 3 to 5 minutes. The dough should feel supple. Roll into a snake 1 inch in diameter and cut into the number of dough filling balls you have, dividing evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the filling balls out of the freezer. Roll a piece of dough into a ball, then press the edges with your fingertips to form a 2 1/2-inch round with a dime-size belly of thicker dough in the middle. Center a filling ball in the dough, then gather the sides around it to enclose. Pinch the seams shut and gently roll into a smooth ball. Repeat with the remaining filling and dough. (The dumplings can be frozen on a baking sheet until firm, then stored in an airtight container in the freezer for up to 3 months. Cook directly from the freezer.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the ginger soup to a simmer over medium heat. Add the dumplings one at a time, then simmer gently until the balls float, the dough is a little translucent and the filling is steaming hot, about 10 minutes. Divide the dumplings and soup among bowls and serve hot. (The ginger isn’t meant to be eaten.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021844-tang-yuan"}