{"@context": "http://schema.org", "@type": "Recipe", "name": "Brown-Butter Poundcake", "description": "This rich and nutty loaf is deeply flavorful and incredibly tender owing to plenty of brown butter and toasty hazelnuts. A thin layer of crackly lemon icing lightens and brightens it. Enjoy this cake with a cup of tea in the afternoon, or top it with cream and berries for a delicious dessert. Either way, you may find yourself sneaking a little slice every time you walk by the plate.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2021/02/24/dining/ya-browned-butter-lemon-loaf-cake/ya-browned-butter-lemon-loaf-cake-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "1 loaf", "recipeCuisine": "american", "recipeCategory": "breakfast, snack, cakes, dessert", "keywords": "brown butter, confectioners' sugar, egg, flour, hazelnut, lemon, milk", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 252}, "recipeIngredient": ["3/4 cup/170 grams unsalted butter (1 1/2 sticks), plus more for greasing", "1 cup/140 grams toasted, cooled, peeled hazelnuts", "1 cup/130 grams all-purpose flour", "1/2 teaspoon baking powder", "1 cup/200 grams granulated sugar", "1 tablespoon fresh lemon zest and 2 tablespoons lemon juice, plus more juice as needed (from 1 large lemon)", "3/4 teaspoon kosher salt", "3 large eggs, at room temperature", "1/2 cup/120 milliliters whole milk, at room temperature", "1 cup/100 grams confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Brown the butter: Melt the butter in a small skillet set over medium heat. (Use a skillet with a light interior so you can easily see the milk solids change color.) Cook the butter, stirring occasionally and scraping the milk solids off the bottom and sides of the pan as needed, until the milk solids turn golden brown and smell toasty, about 2 minutes. Transfer the butter to a small bowl and refrigerate until slightly firm and creamy looking but not totally hardened, about 30 to 60 minutes. (It should be the texture of a softened stick of butter.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees with a rack set in the center. Butter an 8-by-4-inch loaf pan and line it with a strip of parchment paper that hangs over the two long sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the hazelnuts to the bowl of a food processor and pulse until finely ground. Add the flour and baking powder, and pulse to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the chilled browned butter, sugar, lemon zest and salt in the bowl of a stand mixer fitted with the paddle attachment, or use a large bowl and electric hand mixer. Mix on medium-high speed until light and fluffy, stopping the mixer once or twice to scrape down the sides of the bowl and paddle, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the eggs one at time, completely mixing each egg in before adding the next."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer on low, add the flour mixture in three additions, alternating with the milk, beginning and ending with the flour. Stop the mixer occasionally to scrape the bottom and sides of the bowl to ensure the batter is evenly mixed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the batter into the prepared pan, smooth the top, and bake until golden and a cake tester inserted into the center comes out clean, 55 to 65 minutes. Let the cake cool in the pan for about 15 minutes, then use the parchment paper to lift it out of the pan and onto a rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cake is cool, make the glaze: Whisk the confectioners’ sugar and 2 tablespoons lemon juice until smooth. Add a bit more juice if necessary to make a pourable but opaque glaze. Drizzle the glaze over the cooled loaf and let it set for about 15 minutes before slicing. Store the cake covered, at room temperature, for about 4 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021944-brown-butter-poundcake"}