{"@context": "http://schema.org", "@type": "Recipe", "name": "Matzo Frittata", "description": "This savory matzo brei, loaded with caramelized onions and mushrooms, is made like a frittata that you cut into wedges. While commonly eaten for breakfast during Passover, this one serves as a substantial side dish. Leftovers make a nice brunch or lunch, especially with a green salad. The key to a good matzo brei is soaking the matzo just enough to retain a little bit of chew, but not so much that it becomes soggy. Here, the matzo is submerged in boiling water for one minute to soften. If keeping kosher and making this for a dairy meal, use a tablespoon of butter instead of oil for extra flavor.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2021/03/17/dining/12Passoverrex4/merlin_184703211_85aa83b1-5ab2-4c89-8737-7e26d99769ed-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "jewish", "recipeCategory": "breakfast, brunch, dinner, lunch, breads, appetizer, main course, side dish", "keywords": "eggs, matzo, mushroom, parsley, rosemary, kosher, passover", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 395}, "recipeIngredient": ["4 tablespoons olive oil", "1 extra-large Spanish onion (1 pound), halved and sliced into 1/4-inch half-moons", "Kosher salt and black pepper", "12 ounces white or brown button mushrooms, trimmed and sliced", "1 tablespoon fresh rosemary leaves, chopped", "6 sheets salted or unsalted matzo, broken into small pieces", "6 large eggs", "1/2 cup lightly packed flat-leaf parsley leaves, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Heat a 12-inch nonstick ovenproof skillet over medium-high heat. Add 1 1/2 tablespoons oil and then the onion. Season with 1/2 teaspoon salt and 1/2 teaspoon pepper, and cook, stirring occasionally, until very well browned and starting to caramelize, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 3/4 cup water, stirring the onion and scraping the pan. Reduce the heat to medium and cook, covered, until very soft and golden, about 20 minutes more, stirring occasionally. Stir in 2 tablespoons water, then scrape the onion into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large kettle or saucepan of water to a boil. Meanwhile, return the skillet to medium-high heat (no need to wash). Add 1 1/2 tablespoons oil, then the mushrooms. Season with the rosemary, 1/2 teaspoon salt and 1/4 teaspoon pepper and cook, stirring occasionally, until golden brown, 5 to 10 minutes. Stir in a little water, scraping up any bits in the pan, let it evaporate and transfer to the bowl with the onions. Rinse the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the matzo in a colander set inside a large bowl. Pour in the boiling water and let sit for 1 minute. Pull the colander out of the water and let drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat the eggs well and season with 1/2 teaspoon salt and 1/4 teaspoon pepper. Add the mushroom mixture, the softened matzo and the parsley and stir very thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the rinsed skillet over medium-high heat. Heat the remaining tablespoon oil and then pour in the matzo mixture and smooth the top. Cook, undisturbed, until firm on bottom and edges, 5 to 7 minutes. Transfer to the oven and cook until set in the middle and golden brown on top, 12 to 15 minutes. (If desired, broil for 1 to 2 minutes to brown the top.) Loosen from pan if needed with a rubber spatula and slide onto a cutting board or plate. Sprinkle lightly with salt and cut into wedges to serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021975-matzo-frittata"}