{"@context": "http://schema.org", "@type": "Recipe", "name": "Mrouzia Lamb Shanks", "description": "This recipe for mrouzia, a Moroccan tagine of lamb shanks with a syrupy sauce made with onions, ras el hanout, honey and raisins, is adapted from “Casablanca: My Moroccan Food” by Nargisse Benkabbou (Firefly, 2018). This centuries-old dish has been around so long that traditional recipes call for large amounts of animal fat and honey, which were needed to preserve the meat before the invention of modern refrigeration. Mrouzia is usually served to celebrate Eid al-Adha (also known as Eid el-Kabir), or other special occasions. Enjoy with fluffy couscous or plenty of crusty bread.", "author": {"@type": "Person", "name": "Nargisse Benkabbou"}, "image": "https://static01.nyt.com/images/2020/07/27/dining/nb-mrouzia-lamb-shanks/merlin_174968559_8322cc1f-0723-4075-9925-fc48f3d9c2cf-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "4 servings", "recipeCuisine": "moroccan", "recipeCategory": "dinner, meat, soups and stews, tagine, main course", "keywords": "almond, cinnamon, garlic, honey, lamb, onion, raisins, ras el hanout, saffron, eid al-fitr, ramadan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 377}, "recipeIngredient": ["3 tablespoons olive oil", "4 pounds lamb shanks (about 3 to 4 shanks), trimmed of excess fat", "1 large yellow onion, grated (about 2 cups)", "4 garlic cloves, peeled, crushed and finely chopped", "2 teaspoons ras el hanout", "3/4 teaspoon kosher salt, or more to taste", "1/4 teaspoon ground cinnamon", "Generous pinch of saffron threads", "2 cups vegetable stock, plus more as needed", "1/2 cup blanched almonds", "1 cup/150 grams dark raisins", "1/4 cup honey", "Couscous or crusty bread, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil in a large pot or Dutch oven over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches if needed, add the lamb shanks and cook until browned on each side, about 15 minutes. (Make sure that the oil is very hot before adding the meat; you should hear a sizzle when the meat touches the pan, otherwise it isn’t hot enough.) The meat will be released naturally from the pan once browned on one side, so don’t be tempted to turn it beforehand. Transfer the browned lamb shanks to a dish and set aside until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat under the pot to medium, add the remaining 1 tablespoon olive oil, the onion, garlic, ras el hanout, salt, cinnamon and saffron and cook for about 5 minutes, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the lamb shanks to the pan, add the stock and bring to a boil over high heat. (The meat of the shanks should be mostly covered, but not necessarily fully submerged in the stock.) Cover the pan, reduce the heat to medium-low and simmer gently, stirring occasionally, until the meat is fully cooked and fork tender, about 2 hours, depending on the size of your shanks. If it looks like there isn’t enough liquid in the pan and the tagine is drying out at any point during the cooking process, add a couple tablespoons of water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the oven to 400 degrees. Spread the almonds out on a cookie sheet and roast for 10 to 12 minutes or until lightly golden, giving them a good stir halfway through to make sure that they roast evenly. Remove from the oven and leave until cool enough to handle, then grind using a food processor or crush with a rolling pin until coarsely ground. Set aside until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the lamb shanks are fully cooked, remove them from the pan and set aside. Add the raisins and honey to the sauce and gently stir to combine. Cook, uncovered, over medium-low heat for about 35 minutes, stirring occasionally, until the sauce has reduced to a syrup-like consistency and the raisins are plump."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the sauce is ready, return the lamb shanks to the pan to warm them through and coat them with the sauce. Garnish with almonds and serve immediately with fluffy couscous or crusty bread."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021280-mrouzia-lamb-shanks"}