{"@context": "http://schema.org", "@type": "Recipe", "name": "Kimbap", "description": "Kimbap, or “seaweed rice,” is often mistakenly referred to as sushi, but it is a popular Korean dish with its own unique flavors and history. These rolls can be simple, with just a single sheet of seaweed wrapped around cooked rice, or complex, with entire restaurants dedicated to serving variations of kimbap. This recipe uses traditional fillings, like a mix of vegetables, egg and meat, but other popular fillings include cucumber, imitation crab, bulgogi or canned tuna. It’s very adaptable, and it does well with substitutions. Leftover kimbap can be kept in the refrigerator, but the rice will lose some of its moisture, so to serve a second time, soak each piece in beaten egg, then pan-fry them until golden.", "author": {"@type": "Person", "name": "Darun Kwak"}, "image": "https://static01.nyt.com/images/2020/09/09/dining/dk-kimbap/merlin_176534694_3e9c925a-3854-44c7-b412-9b46714ba583-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 rolls (2 servings)", "recipeCuisine": "korean", "recipeCategory": "dinner, lunch, finger foods, grains and rice, main course, side dish", "keywords": "dairy-free, egg, nori, sesame oil, short grain rice, spinach", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 443}, "recipeIngredient": ["1 1/2 packed cups raw spinach (about 3 ounces)", "1 1/2 teaspoons sesame oil", "Kosher salt and black pepper", "Neutral oil, for sautéeing", "1/2 medium or large carrot, peeled and julienned", "1 thin sheet of eomuk (fish cake), cut into 1/4-inch-thick strips", "3 ounces canned Spam, cut lengthwise into 1/4-inch-thick strips", "2 eggs, beaten", "4 strips of danmuji (pickled yellow radish), see Tip", "4 gim (nori) sheets", "3 cups freshly cooked short-grain rice", "1 tablespoon sesame oil, plus more for brushing", "1/4 teaspoon fine sea salt, or more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the spinach: Bring a pot of water to a boil and blanch the spinach until it turns bright green, about 45 seconds. Transfer the spinach to an ice bath, or transfer it to a colander set in the sink and run the spinach under cold water. Squeeze it to remove excess water and place it in a bowl. Season with 1 1/2 teaspoons sesame oil and 1/8 teaspoon salt. Mix well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the remaining ingredients for the kimbap filling: In a large, well-oiled skillet, working in separate batches, sauté the carrots, eomuk and Spam over high, seasoning the carrots and eomuk with salt and pepper to taste (the Spam does not need extra salt), until just tender and lightly golden. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In an oiled nonstick skillet, cook the beaten eggs with a pinch of salt. Swirl the pan to cover the entire surface area and as soon as the bottom is set, about 2 minutes, use a rubber spatula to carefully flip the egg like a pancake, doing your best to keep it in one piece. Cook just until the egg is no longer runny and has just set, another 30 seconds. Slide the cooked eggs onto a cutting board and let cool. Once cooled, cut into long, 1/4-inch-thick strips and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the rice: Place the warm, freshly cooked rice into a mixing bowl. Add 1 tablespoon sesame oil and 1/4 teaspoon sea salt. Mix well with a large spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the kimbap: Lay 1 sheet of gim on a bamboo mat. (If you don’t have a bamboo mat available, you can lay a clean tea towel on a flat surface and top it with plastic wrap.) Spread about 1/2 to 3/4 cup of rice across two-thirds of the seaweed sheet in an even layer, leaving the top third of the seaweed empty. (You might want to have a small bowl of water handy, so you can wet your fingers to prevent the rice from sticking to them.) Spread the prepared ingredients horizontally in rows, starting from the side closest to you."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the kimbap: Using both hands and the help of the bamboo mat, starting from the side closest to you, lift up the bottom of the seaweed and fold it up to cover the filling, tucking in the filling with your fingers. Use the bamboo mat to apply even and firm pressure, pressing to ensure the filling stays in place. Continue rolling until you reach the end of the rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To close the kimbap roll, using your fingertips, spread a small amount of water at the edge of the empty seaweed and roll to seal. If the kimbap doesn’t close, spread a little rice to use the rice as an adhesive. Repeat with the remaining seaweed and ingredients. Each time you roll, reposition the kimbap at the bottom of the bamboo mat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, lightly brush the rolls with sesame oil. (This will keep your kimbap moist and shiny.) Using a sharp knife and applying even pressure, cut the kimbap into 1/2-inch pieces. Serve and enjoy! (If preparing in advance, prepare the fillings except the rice and store in the refrigerator. When you're ready to eat, make the rice and assemble your kimbap. Avoid assembling your kimbap too far in advance as refrigerating your kimbap will cause the rice to harden.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021373-kimbap"}