{"@context": "http://schema.org", "@type": "Recipe", "name": "Best Thanksgiving Leftovers Sandwich", "description": "The sandwich you make with all the prized leftovers the day after Thanksgiving might be even better than the main event. Assembling this leftover Thanksgiving sandwich is easy, but the details matter. The white and dark turkey meat each get special love and attention: The breast is warmed in butter, while the dark meat is shredded, then warmed in gravy. This club ditches the usual third slice of bread for a slab of crisp, fried stuffing instead. When heating the stuffing, make sure your pan is good and hot so the stuffing fries up fast without falling apart in the skillet. A generous swipe of cranberry mayo brings the whole thing together.", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "image": "https://static01.nyt.com/images/2020/11/25/dining/23leftoversrex1/merlin_179868645_ccb9d1b4-9544-4368-afa4-c5fa354aa794-articleLarge.jpg", "totalTime": "PT8H20M", "recipeYield": "4 sandwiches", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, sandwiches, main course", "keywords": "bread, cranberry sauce, gravy, thanksgiving leftover, turkey, fall, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 672}, "recipeIngredient": ["2 tablespoons unsalted butter, plus more for greasing the pan", "4 cups leftover stuffing", "1/2 cup mayonnaise", "1/2 cup homemade, canned or jarred cranberry sauce", "1 cup shredded dark-meat turkey", "1/2 cup leftover gravy", "4 teaspoons neutral oil", "1 cup sliced turkey breast", "Kosher salt and freshly ground black pepper", "8 slices sandwich bread (preferably 4- to 5-inch square slices), toasted if desired", "2 cups assorted Thanksgiving leftovers (any combination of cooked green beans, sweet potatoes, mashed potatoes or other sides), warmed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a 8- or 9-inch square baking pan with butter, then line it with parchment paper, covering the bottom and 2 sides with one sheet, creasing it into the corners to ensure a snug fit. If the stuffing is cold, warm it in the microwave for 1 minute or covered in a 350-degree oven for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the stuffing into the prepared pan and press into an even layer using an offset spatula or the back of a spoon. Top with a sheet of parchment and press firmly with your hands, tightly compacting the stuffing. If you have a second pan of the same size, use that to pack down the stuffing. Cover and chill overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, prepare your sandwich fillings: In a small bowl, whisk together the mayonnaise and cranberry sauce. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine the shredded dark-meat turkey and the gravy. Gently heat over medium-low, stirring occasionally, until warmed through, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonstick skillet or well-seasoned cast-iron skillet over medium-high, warm the oil until hot and shimmering. (The stuffing needs to be cooked hot and fast, or it will stick to the skillet and fall apart.) Meanwhile, remove the stuffing from the pan by lifting the parchment overhang, and cut the stuffing into four squares."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook stuffing until browned and crisp on one side, gently pressing it down using the base of the baking pan you chilled it in, about 1 minute. Using a flat spatula, quickly flip each piece of stuffing. Cook the other side until browned and crisp, about 1 minute. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, melt the 2 tablespoons butter over medium-low heat until foamy. Add the sliced turkey breast, flipping occasionally until warmed through, about 3 minutes. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the sandwiches: Evenly spread 2 tablespoons of cranberry mayonnaise on 1 side of each slice of bread. Divide the buttery sliced turkey over the 4 slices of bread. Divide half the assorted leftovers on top of the white meat, then top each with a slab of crisp stuffing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On top of the crisp stuffing, evenly divide the gravy-dressed dark meat and the remaining assorted leftovers. Top with remaining mayo-slathered bread. Using a sharp serrated knife, cut each sandwich on the diagonal and serve right away."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021605-best-thanksgiving-leftovers-sandwich"}