{"@context": "http://schema.org", "@type": "Recipe", "name": "Any Vegetable Stir-Fry", "description": "It’s always a shame to let precious vegetables go to waste. Once they pass their prime, they can form the foundation for a tasty stir-fry. Wrap mature greens like kale, Swiss chard and spinach in a damp towel and refrigerate them and they will keep for about seven days. Once they start to become limp, they may no longer shine raw in salads but they are perfect for stir-frying. This recipe works with what you've got, building an easy stir-fry with any combination of toasted nuts, crunchy vegetables and sturdy greens.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2020/04/14/dining/sc-stirfry/sc-stirfry-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weekday, vegetables, main course", "keywords": "almond, celery, kale, mint, rice, rice wine vinegar, sesame oil, sesame seeds, snap peas, gluten-free, vegan, vegetarian, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 703}, "recipeIngredient": ["2 tablespoons canola oil or other neutral oil", "1 heaping cup whole, skin-on almonds, pistachios or cashews", "Kosher salt", "4 to 6 celery stalks, fennel stalks or bok choy, sliced on the bias", "1 to 2 cups other crunchy vegetables, such as snap peas, snow peas, green beans, carrots or radishes, trimmed and sliced or chopped if large", "1 tablespoons sesame seeds (optional)", "4 packed cups sturdy greens, such as spinach, kale, mustard greens, collards or chard, trimmed and roughly chopped", "1 tablespoon rice wine vinegar or white wine vinegar", "1 to 2 teaspoons toasted sesame oil", "4 cups steamed white or brown long-grain, sushi or basmati rice, for serving", "1/2 packed cup torn or roughly chopped mint, cilantro or basil (optional)", "Tamari or soy sauce, for serving", "Sriracha or other hot sauce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large wok, skillet or cast-iron pan, heat the canola oil over medium-high until shimmering. Add the almonds, season with salt and cook, tossing, until toasted and crisp, 3 to 4 minutes. Add the celery and crunchy vegetables and toss until slightly softened, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with sesame seeds, if using, and toss until toasted, 1 to 2 minutes. Add the sturdy greens, toss until coated in oil, then add the vinegar, scraping the bottom of the wok to release any browned bits. Cover and cook until greens are lightly wilted, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season with sesame oil and salt to taste. Divide the rice among four bowls and spoon the stir-fry over the top. Scatter the herbs and drizzle with soy sauce and Sriracha, if using."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021006-any-vegetable-stir-fry"}