{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Sheet Cake With Raspberry Whipped Cream", "description": "This lovely cake was inspired by the colors and flavors of pink lemonade. Don’t be tempted to skip the first step of this recipe, which asks you to rub lemon zest into granulated sugar: The sugar granules help release the essential oils in the zest, making for a brighter lemon flavor and fragrance. (If you’re really short on time, you can skip using your hands and just mix with the paddle attachment inside the mixer bowl on low speed for 1 minute.) Slather this sunny cake with swoopy, easy-to-make raspberry whipped cream then serve as is, or dressed up with lemon zest or sprinkles.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2020/08/03/dining/ejm-pink-lemonade-sheet-cake/ejm-pink-lemonade-sheet-cake-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "1 (9-by-13-inch) cake", "recipeCuisine": "", "recipeCategory": "cakes, dessert", "keywords": "birthday, fourth of july, labor day, memorial day, mother’s day, butter, buttermilk, flour, heavy cream, lemon, raspberries, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1125}, "recipeIngredient": ["Nonstick cooking spray", "2 cups/400 grams granulated sugar", "3 lemons, zested (about 5 tablespoons), plus 1/3 cup/80 milliliters lemon juice (from about 2 lemons)", "4 cups/510 grams all-purpose flour", "1 tablespoon baking powder", "1 teaspoon fine sea salt", "1/2 cup/115 grams unsalted butter (1 stick), at room temperature", "1/2 cup/120 milliliters vegetable oil", "6 large eggs, at room temperature", "1 1/4 cups/300 milliliters buttermilk, at room temperature", "12 ounces/340 grams (about 2 3/4 heaping cups) raspberries (thawed, if frozen)", "3/4 cup/150 grams granulated sugar", "1 1/2 cups/360 milliliters heavy cream", "Lemon zest or sprinkles, for finishing (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Lightly grease a 9-by-13-inch pan with nonstick spray, then line the pan with parchment paper. Lightly coat the parchment paper with nonstick spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer, use your hands to rub together the sugar and lemon zest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the flour, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter and oil to the bowl with the lemon sugar, and transfer it to the mixer. Using the paddle attachment, cream the mixture on medium speed until light and fluffy, 4 to 5 minutes. With the mixer running, add the lemon juice in a slow, steady stream and mix until well combined, 1 minute more. Scrape the bowl well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the eggs one at a time, mixing on medium speed until each is incorporated before adding the next, about 1 to 2 minutes each. Scrape the bowl well every two to three additions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half of the flour mixture and mix on low speed until fully incorporated. With the mixer running on low speed, add the buttermilk in a slow, steady stream, and mix until fully incorporated. Add the remaining flour and mix until it’s evenly incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan and spread into an even layer. Transfer to the oven and bake until a toothpick inserted into the center comes out clean, 27 to 32 minutes. Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake cools, make the frosting: In a medium bowl, mash the raspberries with a potato masher or large fork until broken down. Stir in 1/2 cup/100 grams granulated sugar, and let macerate for 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the raspberry mixture. (You should have at least 3/4 cup/180 milliliters juice. Reserve any excess for cocktails, stir it into sparkling water, or drizzle over ice cream.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the whisk attachment, whip the cream and the remaining 1/4 cup/50 grams granulated sugar on medium speed until the mixture reaches soft peaks, about 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer still running on medium speed, pour the raspberry juice into the mixer in a slow, steady stream. (Reduce splattering by pouring away from the moving whisk.) Continue to whip until the mixture forms peaks, about 30 seconds to 1 minute more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the frosting over the cooled cake and spread into an even layer. If desired, garnish with lemon zest and sprinkles."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021329-lemon-sheet-cake-with-raspberry-whipped-cream"}