{"@context": "http://schema.org", "@type": "Recipe", "name": "Pistachio Pinwheels", "description": "This recipe, from “Dessert Person” (Clarkson Potter, 2020) is one of those ace-up-your-sleeve, slice-and-bake cookie recipes every baker needs. The pinwheels are super tasty, need no decoration and require no major assembly. These buttery, nutty, shortbready cookies achieve the highest calling for any recipe: They look and taste as if they are harder to make than they are. (<a href=\"https://www.youtube.com/watch?v=4nshlz1FL-E\">Watch Claire make them here</a>.)", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2020/12/07/dining/cs-pistachio-pinwheels/merlin_180932526_f83d4853-083b-4b02-947d-dfa06b746508-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "32 cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars, dessert", "keywords": "almond extract, almond flour, pistachio, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1296}, "recipeIngredient": ["2/3 cup/85 grams shelled raw unsalted pistachios", "3/4 cup/170 grams unsalted butter (1 1/2 sticks), cut into 1/2-inch pieces, at room temperature", "3/4 cup plus 2 tablespoons/105 grams confectioners’ sugar", "2 large egg yolks", "1/2 teaspoon almond extract", "1 cup/130 grams all-purpose flour", "1/2 teaspoon kosher salt", "1 1/3 cups/150 grams almond flour", "1/2 cup/105 grams demerara sugar, for rolling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, pulse the pistachios until they’re very finely ground but not yet forming a paste, about 25 second-long pulses. Transfer the ground pistachios to a small bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the same food processor (no need to wash after grinding the pistachios), add the butter and confectioners’ sugar, and process until the mixture is smooth and creamy. Add the yolks and almond extract, and process until the mixture is smooth and light. Add the flour and salt, and pulse, scraping down the sides of the bowl once or twice, until you have a stiff, uniform dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer two-thirds of the dough (about 10 ounces/240 grams) to a medium bowl and add the almond flour to the bowl. Use a flexible spatula to work the almond flour into the dough until you have a uniform mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the almond dough onto a piece of parchment paper. Pat it down with your hands into a thinner layer, then place a piece of parchment paper on top. Roll out the dough between the sheets of parchment into a slab measuring about 12-by-8 inches and ¼-inch thick. (Uncover the dough and use a small offset spatula to shape the dough into a rectangle if necessary.) Slide the parchment paper onto a baking sheet and refrigerate the slab until firm, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add the ground pistachios to the food processor with the remaining dough and pulse until the mixture is thoroughly blended and the dough has taken on a green color, about 7 pulses. Set aside at room temperature while the almond dough chills."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the almond dough from the refrigerator and plop tablespoon-size pieces of the pistachio dough across the surface of the slab. Use the offset spatula to spread the pistachio dough across the length of the slab in an even layer, leaving a 1/2-inch border along the longer sides. Starting at one of the longer sides and using the parchment paper to help you, roll the dough into a tight spiraled log. Wrap the log in parchment paper and transfer to the refrigerator. Chill until the dough is very firm, at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, arrange two oven racks in the upper and lower thirds of the oven and heat to 350 degrees. Line two large rimmed baking sheets with parchment paper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the demerara sugar across a cutting board. Remove the log from the refrigerator, unwrap, and roll across the board in the sugar, pressing down very firmly as you roll so the sugar adheres. Continue to roll and press until the entire log is coated. Using a sharp knife, shave a thin crosswise slice off of each end so you have straight sides with the full spiral exposed. Cut the log in half crosswise, then cut each half in half again to make quarters, and cut each quarter in half again for eighths. (This ensures even, equal slices.) As you cut, roll the pieces on the cutting board to prevent the pinwheels from gaining a flat side and losing their round shape. Cut each piece into 4 equal slices to make 32 cookies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the cookies between the two prepared baking sheets and space them evenly. Bake the cookies on the upper and lower racks until they are golden around the edges, 15 to 20 minutes, switching racks and rotating the sheets front to back halfway through baking. Remove from the oven and let cool completely on the baking sheets."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021709-pistachio-pinwheels"}