{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Cafreal", "description": "Galinha cafreal or chicken cafreal is a classic dish that’s often included in Goan Christmas and other noteworthy celebrations, accompanied by bread or rice. This dish is widely believed to have its origins in Mozambique and was brought by the Portuguese to their former colony of Goa in India. The signature hallmark of this dish is the fragrant concoction of spices and fresh herbs that’s used as the marinade and then cooked to form a very thick “dry” sauce, in which most of the water is driven out through evaporation to form a thick, flavorful coat on the chicken. Typically, the potatoes are fried, but boiling them in water and then roasting them in the oven produces a creamier interior and crispy exterior. ", "author": {"@type": "Person", "name": "Nik Sharma"}, "image": "https://static01.nyt.com/images/2020/12/23/dining/18Cafrealrex/merlin_181228716_b30fe3f4-2779-479e-89ca-be16ce3d31e4-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "poultry, vegetables, main course", "keywords": "chicken thigh, chiles de árbol, cilantro, cloves, ginger, potato, christmas, fall, spring, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 514}, "recipeIngredient": ["3 1/2 pounds bone-in, skin-on chicken thighs, skin removed, or 3 pounds boneless, skinless thighs", "2 medium white or yellow onions, peeled", "1 bunch fresh cilantro", "1 whole head of garlic (about 12 cloves), peeled and roughly chopped", "1 (2-inch) piece fresh ginger, peeled and roughly chopped", "1 green chile, such as serrano, stemmed and roughly chopped", "10 whole cloves", "1 tablespoon fresh lime or lemon juice", "1 tablespoon coriander seeds", "1 teaspoon cumin seeds", "1 teaspoon whole black peppercorns", "1/2 teaspoon ground cinnamon (or 1/2-inch cinnamon stick)", "1/2 teaspoon fennel seeds", "Fine sea salt and freshly ground black pepper", "2 medium russet potatoes", "4 tablespoons extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prick the chicken all over with a fork and place in a resealable plastic bag or large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut 1 onion into quarters and transfer to a blender. Reserve 2 tablespoons of cilantro leaves for garnish, then add the remaining cilantro leaves and stems to the blender along with the garlic, ginger, chile, cloves, lime juice, coriander, cumin, peppercorns, cinnamon, fennel and 1 teaspoon salt. Pulse on high until the mixture is smooth. (You might need to add 1 to 2 tablespoons of water and give it a stir to get the ingredients to move.) Pour the blended mixture over the chicken in the bag, seal or cover, and refrigerate to marinate for at least 1 hour, or up to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 45 minutes before you are ready to cook the chicken, prepare the potatoes: Heat the oven to 400 degrees. Peel the potatoes and quarter them lengthwise. Add them to a large saucepan, cover them with cold tap water by about 1 inch, and add 1 teaspoon salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water to a boil over medium-high heat, then reduce to a simmer and cook until the potatoes are just tender, about 5 minutes. A knife should pass through the center of the potato with only slight resistance. The potatoes should not be too soft or they will fall apart during seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, transfer the potatoes to a large baking sheet and discard the water. Let the potatoes cool for a few minutes, then season them generously with salt and pepper. Drizzle 2 tablespoons of oil over the potatoes and toss gently to coat. Spread the potatoes out and roast them until golden-brown and crispy, about 30 minutes. If the potatoes are cooked before the chicken, remove them from the oven and cover them with foil to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the potatoes roast, cook the chicken: Heat the remaining 2 tablespoons oil in a large saucepan or Dutch oven over medium-high. Chop the remaining onion and sauté until translucent, about 4 minutes. Add the chicken with its marinade and cook, stirring occasionally and scraping the bottom of the pot to prevent burning, until the thighs are golden brown, completely cooked through, and most of the liquid has dissipated, leaving behind a thick coating (or dry sauce), about 30 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken to a serving plate, garnish with the reserved cilantro leaves and serve the potatoes on top or alongside."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021737-chicken-cafreal"}