{"@context": "http://schema.org", "@type": "Recipe", "name": "No-Bake Mango Lime Cheesecake", "description": "This creamy mango cheesecake has the unmistakable scent and taste of fresh limes and cardamom — and, best of all, it doesn’t require you to turn on the oven. Avoid using fresh mango pulp here: An enzyme in raw mango can prevent the gelatin from setting. (Canned mangoes don’t have that enzyme; it’s destroyed when they’re heated to high temperatures to be preserved.) If you must use fresh mangoes, purée the pulp, then bring it to a boil over medium heat, stirring constantly, and cool before using.", "author": {"@type": "Person", "name": "Nik Sharma"}, "image": "https://static01.nyt.com/images/2020/01/28/dining/ns-mango-lime-cheesecake/merlin_182770455_79cb7321-1af1-4236-95d7-1d0854ac668d-articleLarge.jpg", "totalTime": "PT6H45M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "birthday, cheesecake, cream cheese, gelatin, graham cracker, lime, mango, plan-ahead", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1474}, "recipeIngredient": ["1/4 cup/55 grams unsalted butter (1/2 stick), melted, plus more at room temperature for greasing the pan", "5 ounces/140 grams graham crackers or speculoos", "2 tablespoons dark brown sugar", "1 (1/4-ounce/7-gram) packet granulated gelatin", "1/4 cup/60 milliliters hot water (120 to 140 degrees)", "1 cup/240 milliliters heavy cream", "1 cup/200 grams granulated sugar", "2 (8-ounce/225-gram) packages cream cheese, cubed, at room temperature", "1/2 cup/120 milliliters canned unsweetened, puréed mango pulp", "1 lime, zested and juiced", "1/2 teaspoon ground cardamom", "1 (1/4-ounce/7-gram) packet granulated gelatin", "1/4 cup/60 milliliters hot water (120 to 140 degrees)", "1 cup/240 milliliters canned unsweetened puréed mango pulp", "2 tablespoons granulated sugar", "1 teaspoon lime juice and 1 teaspoon zest (from 1 lime)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously butter the sides and bottom of an 8- or 9-inch round springform pan. Line the base and the sides with parchment paper and grease again with butter. Chill pan in the refrigerator. (This helps the butter firm up and the cake release more seamlessly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Start the crust: Pulse the crackers in a food processor until they’re a fine powder. Add the brown sugar and pulse to combine, then add the melted butter and pulse again until fully incorporated. Transfer the mixture to the prepared pan and use your fingers or a measuring cup to press it into an even layer. Freeze the pan for 10 to 15 minutes until completely chilled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: Add 1/4 cup/60 milliliters room temperature water to a small, wide bowl, sprinkle the gelatin over the water and let sit for 5 minutes, until gelatin granules swell. (There should be no dry flecks of gelatin.) Pour the 1/4 cup/60 milliliters hot water over the hydrated gelatin and stir to dissolve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As gelatin hydrates, add the heavy cream and 1/2 cup/100 grams sugar to the bowl of a stand mixer fitted with the whisk attachment, and mix at medium speed until the cream forms stiff peaks, about 2 to 3 minutes. Transfer to a medium bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe down the stand mixer bowl and the whisk attachment. Add the cream cheese and remaining 1/2 cup/100 grams sugar, and whisk on medium-high until smooth, light and fluffy, about 5 minutes. Scrape down the bowl. Add the mango pulp and lime juice, and beat on medium-low, gradually increasing the speed to medium-high once the mango is incorporated, about 2 minutes. Stop the mixer and scrape down the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the gelatin mixture and whisk over medium-high until completely incorporated. Remove the bowl from the mixer. Add the whipped cream, lime zest and the cardamom. Fold the cream into the mango mixture until there are no flecks of cream. (The mixture will be very light and airy, resembling a mousse.) Pour this mango mixture over the chilled crust, and level the top with an offset spatula. Return pan to the refrigerator and chill for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As cheesecake chills, prepare the glaze: Add 1/4 cup/60 milliliters room temperature water to a small, wide bowl, sprinkle the gelatin over the water and let sit for 5 minutes, until gelatin granules swell. (There should be no dry flecks of gelatin.) Pour 1/4 cup/60 milliliters hot water over the hydrated gelatin and stir to dissolve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate medium bowl, whisk the mango pulp with the sugar. Whisk in the gelatin mixture. Add 1 teaspoon lime juice and 1 teaspoon lime zest, and whisk to thoroughly combine. Pour this mixture over the top of the cheesecake, swirl the pan to coat evenly, cover the top of the pan with plastic wrap. Refrigerate the cheesecake until the gelatin layer is completely set and firm, at least 6 hours and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, remove the plastic wrap, and carefully release the cheesecake from the springform pan. Slice the cheesecake with a sharp, serrated knife. (For cleanest slices, wash the knife with warm water, and wipe dry with a towel between each cut.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021843-no-bake-mango-lime-cheesecake"}