{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Smoked Shiitakes", "description": "Most vegetable charcuterie involves several days of curing and smoking, but these crispy smoked shiitakes — mushroom bacon, if you will — can be made from start to finish in less than a half hour. The recipe comes from a terrific vegan restaurant in Washington D.C., called Fancy Radish, by way of the chef and co-owner Rich Landau. It involves a two-step process: First you fry thinly sliced shiitakes to make them crisp, then you smoke them to make them taste like bacon. You can do the smoking in your smoker or a charcoal grill, or indoors with a handheld or stovetop smoker. You’ll love the crisp crunch and rich, baconlike mouthfeel, with a smoky flavor that’s similar to bacon’s but with distinct mushroom overtones. Make shiitake crispy smoked shiitakes for a vegan snack or BLT, or serve it with eggs if you eat them.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2020/08/26/dining/24charcuterierex3/24charcuterierex3-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "1 1/2 cups", "recipeCuisine": "american", "recipeCategory": "vegetables, appetizer, side dish", "keywords": "shiitake, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 43}, "recipeIngredient": ["1/2 pound fresh shiitake mushrooms (pick the largest caps you can find)", "2 cups grapeseed or canola oil, or as needed, for frying", "Hardwood chips, chunks or sawdust, as needed for smoking", "Sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stem the shiitake mushrooms (you can save the stems for stock or another use), then thinly slice the caps into thin strips on a mandolin or by hand. The slices should be no more than 1/8-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the oil to a depth of 1/2 inch in cast-iron skillet (or other frying pan) and heat over medium-high to a temperature of 350 degrees. (To test the temperature, add a mushroom slice to the oil. When the temperature is right, bubbles will dance around the mushroom slice.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches to avoid overcrowding, fry the shiitake slices until golden and crisp, stirring with a slotted spoon, about 3 minutes. Transfer the fried shiitakes to paper towel-lined plate to drain, repeating until all the mushrooms are cooked. Let the fried shiitakes cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Smoke the fried shiitake slices in a grill or outdoor smoker, or using stovetop or handheld smoker. To smoke the shiitakes on a grill, set it up for indirect grilling and heat to medium (350 degrees). Add wood chips or chunks to the coals and hot smoke the bacon long enough to apply a discernible smoke flavor, 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using an outdoor smoker, set it up following the manufacturer’s instructions and heat to 250 degrees. Add wood as specified by the manufacturer. Arrange the shiitake slices on a wire rack or in a grill basket, transfer to the smoker and smoke long enough to apply a discernible smoke flavor, 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To smoke the shiitakes using a stovetop or handheld smoker, follow the manufacturer’s instructions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the smoked shiitakes cool to room temperature, season with sea salt then store in an airtight container until serving. They taste best the same day they’re smoked."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021377-crispy-smoked-shiitakes"}