{"@context": "http://schema.org", "@type": "Recipe", "name": "Salt-Baked New Potatoes With Pink-Peppercorn Butter", "description": "This way of cooking recently harvested new potatoes, by burying them in a plaster of damp salt and baking them, is a triple pleasure: effortless, tasty and very fun. The salt crust seasons the potatoes perfectly, just as it would if you’d boiled or steamed them in salted water, but the airtight seal concentrates their special flavor and texture. They come out dense, waxy and almost creamy. Bring the pan of cooked potatoes to the table right from the oven as is, so everyone can puzzle over the curious-looking white crust, and then delight over the discovery of the piping hot little beauties revealed inside once the surface is cracked. Dig them out and swoop through the butter before popping into your mouth, their skins so paper-thin they snap when you bite into them. Their appeal is irresistible.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2020/10/04/magazine/04mag-Eat/04mag-Eat-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "dinner, vegetables, side dish", "keywords": "pink peppercorns, potato, rosemary, waxy potato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1276}, "recipeIngredient": ["2 pounds small, yellow-fleshed waxy potatoes (it’s fine if skins are red or purple or yellow)", "2 pounds kosher salt", "2 tablespoons fresh rosemary needles, stripped from their branch", "2 tablespoons pink peppercorns", "1 tablespoon pink peppercorns", "1 or 2 soft, velvety branches of rosemary (versus the very stiff, broom-bristle kind)", "4 ounces salted Irish butter, tempered at room temperature until cool and waxy"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Wash the potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mix the salt, rosemary needles, peppercorns and 1 cup water together with your hands, crushing the peppercorns a little between your fingers and bruising the rosemary needles to release their sticky oil, making a moist, fragrant and pink-and-green speckled sand. (You might have to add a few splashes of water if the mixture needs more moisture to feel like wet sand.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer a little less than half this salt mixture into the bottom of a wide, shallow, heavy ovenproof skillet or casserole to make a salt bed about 1/2-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Nestle the potatoes into the sand, close to one another but not quite touching, if possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pack the rest of the salt mixture over the nestled potatoes, and rub and brush and smooth it with your hands until you have tightly encased the potatoes in a little salt sarcophagus. The rounded tops of the potatoes will just show as bumps under the salt cast."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the potatoes for 30 to 40 minutes, until a cake tester easily pierces the potatoes and tests warm on your chin or the back of your hand. The salt casing will dry and harden like clay — and smell delicious while baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the potatoes roast, prepare the compound butter: Grind the peppercorns in a mortar and pestle with the whole branches of rosemary to create an oily, coarse powder. Remove the bruised rosemary sprigs, shaking off any clinging pink peppercorns, and discard. (You just want to extract the oily flavor from the rosemary, not the needles themselves.) In a small bowl, mash the oily peppercorn powder with the salted butter using a fork until well blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, rap the salt-packed potatoes forcefully on a sturdy surface that can handle it, to crack the salt crust from the force. A few solid raps will loosen the potatoes inside. If the cast needs a little more help, use a regular dinner knife like a spade to just pop open the salt crust along its fault lines. The potatoes are easily plucked from the dry salt. Set out with the compound butter in a small bowl on the side."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021483-salt-baked-new-potatoes-with-pink-peppercorn-butter"}