{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheesy Baked Polenta in Tomato Sauce", "description": "This recipe is quite forgiving in that there’s plenty of wiggle room to play. Use whatever herbs and cheeses you have on hand, for example, adjust the spice levels as preferred, and opt for fresh tomatoes if they’re in season, or chopped canned tomatoes instead of whole. You can also veganize the dish entirely by using a nondairy milk and vegan cheese, adding some nutritional yeast if you like. This hearty main needs nothing more than some lightly cooked greens to eat alongside.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2021/03/17/dining/12Ottorex/merlin_184820133_1d127984-655c-4f8f-a209-5953b39a7dc0-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, casseroles, main course", "keywords": "canned tomatoes, fontina, onion, oregano, parmesan, polenta", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 572}, "recipeIngredient": ["2 3/4 cups/660 milliliters whole milk", "3 garlic cloves, minced", "3 1/2 tablespoons olive oil", "Kosher salt and freshly ground black pepper", "1 1/3 cups/200 grams instant polenta", "2/3 cup/60 grams roughly grated Parmesan", "1/4 cup/60 milliliters olive oil", "2 small yellow onions, peeled and finely chopped (about 2 1/2 cups/360 grams)", "6 garlic cloves, minced", "1 teaspoon red-pepper flakes", "1/3 packed cup/10 grams fresh oregano leaves", "2 (14-ounce/410-gram) cans (tins) plum tomatoes, roughly crushed by hand", "1 teaspoon granulated sugar", "7 ounces/200 grams fontina cheese or buffalo mozzarella, very thinly sliced", "1/3 cup/30 grams finely grated Parmesan", "2 scant tablespoons/5 grams finely chopped fresh parsley", "1/3 teaspoon red-pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut out a piece of parchment paper about 16-by-12 inches/40-by-30 centimeters in size and lay onto a clean work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the polenta: Add the milk, garlic, 1 1/2 tablespoons oil, 1 teaspoon salt and a good grind of pepper to a medium saucepan. Bring to a bare simmer, stirring occasionally, over medium-high heat. Turn the heat to medium-low and slowly pour in the polenta, whisking continuously, until completely incorporated and there are no lumps. Cook for 2 to 3 minutes, stirring all the while with a spatula. When cooked, the mixture should pull away from the sides of the pan and be quite thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the Parmesan, stirring for another 30 seconds to melt. Remove from the heat and transfer the mixture to the parchment paper. Use your hands to quickly shape the polenta into a large cylindrical shape, about 13-inches/32-centimeters long. Use the parchment paper to help you tighten the cylinder and then gently roll the whole thing in the paper, tightening as you go, then twisting in opposite directions at both ends. Refrigerate to set for about 1 hour, or longer if time allows."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the sauce: Add the olive oil to a large, ovenproof cast-iron pan that is roughly 11-inches/28-centimeters wide, and heat over medium-high. Once hot, add the onions and cook, stirring occasionally, for 6 minutes, or until softened and lightly colored."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the garlic, red-pepper flakes and oregano, and cook until fragrant, about 1 minute. Add the tomatoes and their juices, sugar, a scant 1/2 cup/100 milliliters water, 3/4 teaspoon salt and a good grind of pepper. Bring to a simmer over medium-high. Turn the heat down to medium and cook, stirring occasionally, for 20 minutes or until the sauce has thickened slightly. Set aside until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees Fahrenheit/230 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently unwrap the chilled polenta and transfer to a cutting board. Trim about 1 inch/2 to 3 centimeters off the ends and then cut the polenta into 24 (1-centimeter-thick) slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top the tomato sauce evenly with the sliced fontina, then fan out the polenta slices, overlapping slightly, so that they’re spiraled to cover the top, leaving a 1-centimeter gap from the edge of the pan. Drizzle the polenta with the remaining 2 tablespoons oil and bake for 30 to 35 minutes, or until polenta is golden in places and the sauce is bubbling. Remove from oven and let sit for 10 minutes to settle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the polenta cools, in a small bowl combine all the topping ingredients. Sprinkle a handful of the topping over the polenta and serve the remaining in a bowl alongside. Serve warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021955-cheesy-baked-polenta-in-tomato-sauce"}