{"@context": "http://schema.org", "@type": "Recipe", "name": "Sparkly Gingerbread", "description": "Made with a combination of fresh and ground ginger, cardamom, cinnamon and cloves, these gingerbread cookies are extra-spicy and very crisp. You could leave them plain, if you like, but painting them with brightly colored royal icing and sprinkling them with sugar makes them shine. Gingerbread keeps better than many other kinds of cookies. These will last for at least 2 weeks — probably even longer — stored in an airtight container at room temperature.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/12/02/dining/30cookiesrex7-gingerbread/merlin_180366969_75f39051-067e-420d-a72f-4404c0e15cb1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "12 dozen cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars, dessert", "keywords": "cardamom, cinnamon, cloves, flour, ginger, nutmeg, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 455}, "recipeIngredient": ["3 cups/375 grams all-purpose flour, plus more for rolling the dough", "1 teaspoon baking soda", "1/4 teaspoon fine sea salt", "2 teaspoons ground ginger", "1 teaspoon ground cinnamon", "1 teaspoon ground cardamom", "1/2 teaspoon freshly grated nutmeg", "1/4 teaspoon ground cloves", "3/4 cup/165 grams dark brown sugar", "3/4 cup/170 grams unsalted butter (1 1/2 stick), at room temperature", "1 large egg", "1/2 cup/120 milliliters light molasses", "1 teaspoon finely grated fresh ginger", "Nonstick cooking spray (optional)", "Royal Icing, for decorating (<a href=\"https://cooking.nytimes.com/recipes/1017887-royal-icing\">recipe on NYT Cooking</a>)", "Food coloring, for decorating", "Colored sugar, sprinkles and dragées, for decorating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together flour, baking soda, salt and spices. Using an electric mixer fitted with the paddle attachment or hand-held electric beaters, beat brown sugar and butter on medium speed until light and fluffy, 2 to 3 minutes. Add egg, molasses and fresh ginger, and mix until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce speed to low and gradually add dry ingredients. Mix until just incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough in half and scrape onto two pieces of plastic wrap, wrapping each piece separately into a flat disk. Refrigerate for at least 2 hours, or up to 5 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, heat oven to 350 degrees. Use parchment paper or nonstick liners to line 3 baking sheets, or lightly grease them with nonstick cooking spray. (You may need to bake the cookies in batches.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a clean, lightly floured work surface, roll one disk of dough 1/8-inch thick. Using cookie cutters, cut out all the dough. With a small metal spatula, place the gingerbread cut-outs onto the prepared baking sheets, leaving about 1 inch between cookies. Repeat with remaining dough. You can reroll the scraps once. Collect them from both pieces of dough, smush them together into a disk and chill before rerolling again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake small cookies for 8 to 12 minutes, and larger ones for 10 to 15 minutes, or until cookies are firm to the touch and their edges are slightly darker in color. Rotate cookie sheets halfway through for even baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cookies cool on baking sheets until firm enough to lift, about 5 minutes. Using a metal spatula, transfer cookies to wire rack to cool completely before decorating."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To decorate, thin the royal icing with water until it’s as thick as heavy cream (thinner than you’d use for piping). Divide it into small bowls (or a muffin tin), and use food coloring to tint it different colors. Use a brush to paint the cookies with icing, and, if you like, use toothpicks to apply more icing to make patterns. Sprinkle with colored sugar or other decorations, if you like, while the icing is still wet. Put the decorated cookies on baking sheets to set, then move them to tins or other airtight containers with parchment between the layers."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021666-sparkly-gingerbread"}