{"@context": "http://schema.org", "@type": "Recipe", "name": "Keo Lac Vung (Peanut and Sesame Candy)", "description": "Gifting and eating sweets during Lunar New Year is an integral part of the Vietnamese Tet tradition. People often buy festive treats from confectioners equipped with particular skills and specialty ingredients, but you can make this easy, crunchy, delicately fragrant candy from readily available ingredients. This version of northern Vietnamese keo lac vung calls for corn syrup in place of maltose, which is often used in Vietnam. Sometimes, butter is added for a touch of fattiness, but coconut oil also works and makes the candy dairy-free.", "author": {"@type": "Person", "name": "Andrea Nguyen"}, "image": "https://static01.nyt.com/images/2021/02/03/dining/29Tetrex5-candy/merlin_182848410_e022829c-2449-464b-a9e9-ac5b173d6f64-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 2 dozen pieces", "recipeCuisine": "vietnamese", "recipeCategory": "candies, dessert", "keywords": "coconut oil, lunar new year, make-ahead, peanut, roasted white sesame seeds", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 165}, "recipeIngredient": ["1 tablespoon unsalted butter or virgin coconut oil", "1 cup/150 grams roasted, unsalted shelled peanuts", "1/2 cup/60 grams roasted white sesame seeds (see Note)", "1/4 teaspoon fine sea salt", "1/4 teaspoon baking soda", "3/4 cup/150 grams granulated sugar", "2 tablespoons corn syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a saucepan over medium-low heat or in a bowl in the microwave. Remove from the heat and add the peanuts, sesame seeds, salt and baking soda, then stir to combine. Set near the stove, along with a rolling pin and 2 sheets of parchment paper (each roughly 12-by-15 inches), one of which is set atop a cutting board."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, use a silicone spatula to stir together the sugar, corn syrup and 2 tablespoons water. If anything clings to the spatula, scrape it into the saucepan. Clip a candy thermometer to the saucepan. Bring the mixture to a frothy boil over medium heat, then let bubble, undisturbed, until golden and the thermometer registers 300 degrees, 2 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat and immediately dump and scrape in the nut mixture. Stir vigorously for 5 to 10 seconds to combine well. (If it seizes up, rewarm the pan to loosen.) Pour the candy mass onto the parchment on the cutting board."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately use the spatula to press the mixture into a 3/4-inch-thick slab. Put the other piece of parchment on top, then use the rolling pin to flatten the slab to 1/4-inch thickness. To smooth out the subtle ridges on top, use the warm saucepan like an iron, running it over the candy. So long as the candy is warm-hot, you can manipulate it; nudge and neaten its sides with the broad side of a knife or metal bench scraper, if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the top parchment layer. While the candy is warm, cut into 1- by 2-inch rectangles or any other shape you desire. Let cool at least 30 minutes before snapping the pieces apart. The candy tastes best once totally cool. Store in an airtight container at room temperature for up to 2 weeks."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021837-keo-lac-vung-peanut-and-sesame-candy"}