{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Caramelized Peppers, Anchovies and Ricotta", "description": "Caramelized slivers of soft bell peppers and whole cloves of garlic serve as the sweet vegetable-based sauce for this summery pasta. The ricotta gives everything creaminess and body, while herbs and scallions lend freshness, and anchovies depth. If you have an open bottle of wine on hand, you can add a splash to deglaze the tasty browned bits on the bottom of the pan. But don’t bother opening something new: A little water or dry vermouth does the trick nearly as well.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/07/22/dining/17apperex/merlin_173816508_dca62e01-bdf2-45f3-9c15-e27dc2963206-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "weekday, pastas, main course", "keywords": "anchovies, bell pepper, garlic, ricotta, rosemary, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1069}, "recipeIngredient": ["Kosher salt", "12 ounces short pasta, such as radiatori, fusilli or campanelle", "3 tablespoons extra-virgin olive oil, plus more for drizzling", "8 to 10 anchovy fillets, chopped, or use a dash or two of soy sauce", "2 large rosemary sprigs", "6 garlic cloves, smashed and peeled", "Large pinch of red-pepper flakes", "2 sweet bell peppers (red, orange or yellow), thinly sliced", "2 tablespoons dry red, white or rosé wine, or use dry vermouth or water", "1 tablespoon unsalted butter", "Fresh lemon juice", "1/2 cup fresh ricotta", "2 scallions, thinly sliced, or 1/4 cup sliced red onion", "Freshly ground black pepper", "1/4 cup finely chopped fresh mint, basil or thyme, plus torn mint or basil leaves and tender sprigs, for garnish", "Freshly grated Parmesan (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of heavily salted water to a boil. Add the pasta and cook, according to package instructions, until the pasta is just al dente."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As pasta cooks, heat a large sauté pan over medium-high, and add 3 tablespoons olive oil. When the oil is hot, add the anchovies and rosemary, and sauté until the anchovies start to dissolve, about 1 minute. Add the garlic and red-pepper flakes, and sauté until the garlic turns pale golden in spots, about 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the bell peppers and a large pinch of salt to the pan, and sauté until the bell peppers are very soft and well caramelized, 10 to 15 minutes, lowering the heat if the peppers start becoming too dark. Add the wine (or water) and the butter, and sauté, scraping up the browned bits on the bottom of the pan. Taste and season with lemon juice and more salt as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 1/4 cup ricotta and the scallions in a large serving bowl, and season aggressively with black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a coffee mug or measuring cup to scoop about 1/2 cup pasta water from the pot. Drain the pasta, then add it to the bowl with the ricotta and scallions, tossing well. Add the bell pepper mixture and the herbs, and toss well, adding a splash or two of pasta water if the mixture looks dry. Taste and season with more salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon pasta into bowls, and top with dollops of the remaining 1/4 cup ricotta, a drizzle of oil and a little Parmesan, if you like. Shower torn herb leaves over all."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021246-pasta-with-caramelized-peppers-anchovies-and-ricotta"}