{"@context": "http://schema.org", "@type": "Recipe", "name": "Spice-Rubbed Baby Back Ribs With Chipotle-Bourbon Barbecue Sauce", "description": "The baby back (sometimes called top loin) is the perfect rib for neophytes. Cut from high on the hog — literally, it abuts the backbone — it’s intrinsically tender and generously marbled, which keeps it moist during smoking. Thanks to these attributes, you can cook it at a higher temperature than the low-and-slow heat favored in the American barbecue belt. This shortens the cooking time and lets you cook the ribs on a common charcoal kettle grill. (However, you can certainly smoke these ribs low and slow at 250 degrees, in which case, you’ll need 3 1/2 to 4 hours of cooking time — and a smoker.) The higher heat and shorter cooking time produce ribs with a firmer, meatier consistency. Add a chile-stung spice rub and a sweet, spicy chipotle-bourbon barbecue sauce, and you wind up with textbook barbecued ribs with a distinctive sweet, hot, smoky finish.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2020/07/29/dining/24ribrex1/24ribrex1-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "2 racks (2 to 4 servings)", "recipeCuisine": "american, barbecue", "recipeCategory": "dinner, barbecues, finger foods, meat, main course", "keywords": "baby back ribs, chipotle, dijon mustard, ketchup, molasses, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 238}, "recipeIngredient": ["2 racks baby back ribs (2 to 2 1/2 pounds each)", "2 tablespoons Dijon mustard", "1 tablespoon chile powder", "1 tablespoon dark brown sugar", "2 teaspoons kosher salt", "2 teaspoons black pepper", "1/4 teaspoon celery seeds", "2 large or 4 small hardwood chunks or 3 cups hardwood chips (if using the latter, soak in water to cover for 30 minutes, then drain)", "1/2 cup apple cider in a spray bottle (optional)", "1 1/4 cups ketchup", "1/3 cup Thai sweet chile sauce", "1/4 cup bourbon", "3 tablespoons dark brown sugar", "3 tablespoons molasses", "1 tablespoon Dijon mustard", "1 tablespoon Worcestershire sauce", "1 to 2 canned chipotle chiles en adobo, minced, plus 1 to 2 teaspoons sauce", "1 teaspoon finely grated lemon zest, plus 1 tablespoon lemon juice", "1/2 teaspoon liquid smoke", "Sea salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the ribs on a rimmed baking sheet. If the concave side of your ribs still has its papery membrane intact, remove it: Pry it up at the end of the bones using the tip of a meat thermometer or butter knife, then pull it off with a paper towel. Lightly brush the ribs on both sides with the mustard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the rub: In a small bowl, combine the chile powder, brown sugar, salt, pepper and celery seeds. Reserve 1 1/2 teaspoons rub for serving, then sprinkle the remaining rub on the ribs, coating both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up your charcoal grill for indirect grilling and heat to 300 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the grill comes to temperature, add half the wood chunks or chips to the coals. Arrange the ribs meat (rounded) side up on the grate away from the heat, then cover the grill. Grill the ribs over indirect heat for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the ribs have grilled for 1 hour, spray on both sides with apple cider (if using), turning the ribs with tongs. Add the remaining wood chunks or chips to the fire and close the grill again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the ribs grill, prepare the barbecue sauce: Place all the sauce ingredients, along with 1/4 teaspoon salt and 1/2 teaspoon pepper, in a heavy saucepan and whisk to mix. Bring to a boil over medium-high heat, whisking often. Reduce the heat and gently simmer the sauce, uncovered, until thick and richly flavored, 6 to 8 minutes. Correct the seasoning, adding more salt and pepper to taste; set aside. (Makes about 2 cups.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue grilling the ribs over indirect heat, rounded side up, until sizzling, browned, tender, and the meat has shrunk back from the ends of the bones by 1/4 to 1/2 inch. This normally takes 2 to 2 1/2 hours in all, but sometimes you’ll need a full 3 hours. The last 20 minutes, brush the ribs on both sides with some of the barbecue sauce. When ready, the meat should be tender enough so you can pull the individual ribs apart with your fingers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush each rack on both sides with more barbecue sauce. Move each rack directly over the fire and direct grill to sizzle the sauce into the meat, 2 to 4 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the ribs to a platter for serving. Brush once more with barbecue sauce and sprinkle the ribs with the remaining rub. Serve the remaining sauce in a bowl on the side."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021242-spice-rubbed-baby-back-ribs-with-chipotle-bourbon-barbecue-sauce"}