{"@context": "http://schema.org", "@type": "Recipe", "name": "Iga Babi Bali (Balinese Sticky Glazed Pork Ribs)", "description": "The smell of Balinese barbecued pork ribs is a harmonious scent typically associated with trips to the picturesque island, but this recipe from the chef Lara Lee’s book, “Coconut & Sambal,” brings the aroma to your home kitchen. Juicy, tender pork is glazed in sticky kecap manis (a sweet condiment that’s typically made with palm sugar and soy sauce, commonly used throughout Indonesia and found at most Asian markets), yielding ribs that are sweet, smoky and viscid. The garlic and chile marinade packs additional heat. (Look for moderately hot red chiles, such as cayenne, that are the length and width of your index or middle finger.) Ms. Lee loves preparing the dish for dinner parties, as they can easily be made in advance and reheated (cover the ribs with foil and place in a 300 degree oven for 10 minutes). You can serve these with potato wedges or morning glory (water spinach).", "author": {"@type": "Person", "name": "Kayla Stewart"}, "image": "https://static01.nyt.com/images/2020/10/28/dining/27leerex3/merlin_177925245_298f9eac-2a24-4157-bf8f-4172cea58091-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "indonesian", "recipeCategory": "dinner, finger foods, meat, main course", "keywords": "ginger, palm sugar, pork, rice vinegar, shallot, spare ribs", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 212}, "recipeIngredient": ["8 long red chiles (about 5 ounces), such as cayenne, trimmed, roughly chopped and deseeded, if you prefer less heat", "12 garlic cloves, peeled and roughly chopped", "1 (5-inch) piece fresh ginger, peeled and roughly chopped", "4 shallots, preferably Thai, or 2 small banana shallots, peeled and roughly chopped", "1/2 cup rice vinegar or white wine vinegar", "1/2 cup plus 1 tablespoon store-bought or homemade kecap manis (see Note for recipe)", "Scant 1/2 cup palm sugar or brown sugar", "1 teaspoon flaky sea salt", "2 racks (1 1/2-pound) pork spare ribs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Prepare the marinade: In a food processor, blend all the ingredients except the pork with 1/2 cup water until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a roasting pan with four long layers of foil in the shape of a cross (two overlapping horizontal strips and two overlapping vertical strips), with enough excess foil spilling over the sides to wrap the ribs. Lay the ribs onto the foil in a single layer and pour over 1/2 the marinade, massaging it into each rack. Wrap the ribs with the foil and roast in the oven on the top or middle shelf for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the ribs roast, pour the remaining marinade into a small saucepan and bring it to a boil. Reduce the heat and simmer the sauce until it has thickened to the consistency of gravy and is deeply flavorful, 5 to 10 minutes. Remove from the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To check if the ribs are done, test an end rib: When you tug the end bone, the meat should start slipping off the bone. If they are not yet tender, return them to the oven and continue cooking until tender, testing every 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the ribs have finished roasting, remove the roasting pan from the oven and turn on the broiler. Open the foil and brush some of the reduced marinade onto the ribs, reserving the rest as a dipping sauce. Broil the ribs for 5 to 7 minutes, uncovered, until they darken and the marinade caramelizes. Serve immediately, with the remaining marinade in a dipping bowl."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021519-iga-babi-bali-balinese-sticky-glazed-pork-ribs"}