{"@context": "http://schema.org", "@type": "Recipe", "name": "Rendang Daging (Beef Rendang)", "description": "Rendang is one of the national dishes of Indonesia, and its tender, caramelized meat is usually reserved for special events, such as weddings, dinners with important guests, and Lebaran, the Indonesian name for Eid al-Fitr, which marks the end of Ramadan. Bathed in coconut milk and aromatics like galangal and lemongrass then reduced until almost all moisture is evaporated, rendang can be served with turmeric rice. Rendang, a dish designed to keep for hours on a journey, has traditionally fed young Indonesians leaving home for the first time on merantau, a right of passage that teaches them about the bitterness and sweetness of life. Created by the Minangkabau, an ethnic group native to West Sumatra, this version from Lara Lee’s cookbook, “Coconut & Sambal,” is a nod to the multiple iterations of rendang across the nation, culminating in a rich and hearty slow-cooked meal. Rendang keeps in the fridge for several day or frozen for up to three months; to reheat, cover the beef with foil and heat in the oven at 300 degrees for about 25 minutes, or until piping hot, or microwave uncovered for three minutes stirring halfway through.", "author": {"@type": "Person", "name": "Kayla Stewart"}, "image": "https://static01.nyt.com/images/2020/10/28/dining/27Leerex1/merlin_177925263_f70efedc-ebc2-45d8-b56c-1c35c59514b2-articleLarge.jpg", "totalTime": "PT3H15M", "recipeYield": "4 servings", "recipeCuisine": "indonesian", "recipeCategory": "dinner, casseroles, meat, soups and stews, main course", "keywords": "beef, brisket, coconut milk, galangal, ginger, lemongrass, lime leaves, turmeric, eid al-fitr", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 211}, "recipeIngredient": ["7 long red chiles (about 4 ounces), such as cayenne, trimmed, sliced and deseeded if you prefer less heat", "6 shallots, preferably Thai, or 3 small banana shallots, peeled and sliced", "5 garlic cloves, peeled and sliced", "1 (3-inch) piece fresh ginger, peeled and sliced", "1 (3-inch) piece fresh galangal (optional), woody stem removed then thinly sliced", "1 (1-inch) piece fresh turmeric, peeled and sliced, or 1 teaspoon ground turmeric", "2 teaspoons ground coriander", "1 teaspoon ground cumin", "2 1/4 pounds braising beef, such as shin or brisket", "3 1/3 cups full-fat coconut milk", "2 fresh lemongrass stalks, bruised and tied in a knot", "5 fresh makrut lime leaves (optional)", "3 fresh or dried bay leaves", "1 teaspoon sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the spice paste: In a small food processor, combine the spice paste ingredients and blend until they form a smooth paste. If the texture is too coarse, you can add a splash of the measured coconut milk and blend again. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the beef: Trim the meat of any excess fat, then cut the meat into 1 1/2-inch chunks, discarding any additional excess fat, and transfer the cubed meat to a deep, heavy Dutch oven or pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the prepared spice paste along with the coconut milk, lemongrass, makrut lime leaves (if using), bay leaves and salt. Bring the mixture to a boil over high, then reduce to a gentle simmer and continue to cook for 2 to 2 1/2 hours until the meat is tender, stirring every 20 minutes or so to ensure the rendang doesn’t stick to the bottom of the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 2 to 2 1/2 hours, the oil from the coconut milk will split and rise to the surface, appearing as a reddish-orange oil; Indonesians call this stage “kalio.” (Depending on the oil content of your coconut milk, this may be a subtle film of oil or there can be a pool of it.) Discard the lemongrass stalks. (If they cook any further, they may disintegrate and be impossible to remove.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat up to medium-high to reduce the sauce. Stir the rendang continuously until the sauce has thickened and turned a deep brown, about 15 minutes. As more oil separates, you are nearly there. Continue stirring the beef so it absorbs the sauce and caramelizes on the outside. Taste and adjust the seasoning if needed before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021518-rendang-daging-beef-rendang"}