{"@context": "http://schema.org", "@type": "Recipe", "name": "Sancocho", "description": "Sancocho, a word often used as slang by Puerto Ricans to mean a big old mix of things, is a rustic stew eaten across the Caribbean and made with every imaginable combination of proteins and vegetables. My father cooked his with beef, corn and noodles; my mom with chicken breasts, lean pork and sweet plantains; my grandmother with beef, pork on the bone and yautia. As such, I’ve rarely used a recipe, so this one is based largely on observation, taste memory and what I like. Pretty much every ingredient can be swapped out, and it also makes for a sumptuous vegetarian dish without meat. Sancocho epitomizes <a href=\"https://www.nytimes.com/2020/10/26/dining/puerto-rican-food.html\">the resilience of Puerto Rican people</a>, as it is often prepared in times of crisis — such as after a hurricane — and made with whatever you have on hand.", "author": {"@type": "Person", "name": "Von Diaz"}, "image": "https://static01.nyt.com/images/2021/03/22/dining/22Puertoricanrex8-Guisada/merlin_184863222_11e57d4a-1d01-43c7-ab98-1d722c75733b-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "caribbean", "recipeCategory": "meat, soups and stews, vegetables, main course", "keywords": "beef stew meat, calabaza, plantain, pork, spanish chorizo, squash, taro root, yuca", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 152}, "recipeIngredient": ["1 medium yuca", "1 medium white yautia (taro root)", "1 green plantain", "1 yellow sweet plantain", "10 ounces calabaza (pumpkin) or kabocha squash", "1 to 2 fresh ears sweet corn", "1 pound pork or beef stew meat, trimmed of excess fat and cut into 2-inch pieces", "1 pound boneless chicken thighs, trimmed of excess fat and cut into 2-inch pieces", "1 1/2 tablespoons kosher salt (such as Diamond Crystal), plus more to taste", "1/4 teaspoon freshly ground black pepper", "1 tablespoon olive oil, plus more as needed", "1/2 cup <a href=\"https://cooking.nytimes.com/recipes/1022007-sofrito\">sofrito</a>", "10 cups pork or beef stock", "3 dried bay leaves", "1 cup thinly sliced Spanish chorizo", "Fresh bread or white rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and cut the yuca, yautia, green plantain and yellow plantain into 1-inch pieces. Scrape out the seeds, then chop the calabaza, skin on, into 1-inch pieces. Put each ingredient in a separate bowl, adding water to cover vegetables in order to prevent them from turning brown while you prepare the rest of the soup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Husk the corn, then slice it into 2-inch-thick segments. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season pork (or beef) and chicken with 1/2 tablespoon salt and 1/4 teaspoon black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon oil in a large pot over medium-high. Add the pork and brown on all sides for 5 minutes. Using a slotted spoon, transfer to a clean, large bowl, then add the chicken to the same pot, and brown on both sides for another 5 minutes, adding oil as needed if the pot gets dry. Transfer with a slotted spoon to the same bowl as the pork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to medium and add sofrito to the pot, scraping up any browned bits of meat and incorporating them into the mix. Cook for 5 to 7 minutes, until liquid has evaporated and mixture darkens in color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pork, chicken and any accumulated juices to the pot. Add the stock, bay leaves and remaining 1 tablespoon salt, and bring to a boil over high heat. Once simmering, reduce heat to medium-low and cook uncovered for 15 minutes, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To keep the vegetables from falling apart, add each one in order of firmness, cooking each for 5 minutes before adding the next. Begin with the yuca, then yautia, green plantain, yellow plantain, calabaza and corn, cooking the yuca for a total of 30 minutes and the corn for only 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chorizo and stir well to incorporate. Cook for another 10 to 15 minutes over medium-low heat until meat and vegetables are tender and break easily with a fork. Because of all the starches and meat in this dish, this stew tends to be thick and rich. Some of the vegetables will fall apart, giving it a porridge consistency. This is a good thing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust salt to taste, and serve with fresh bread or white rice on the side."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021999-sancocho"}