{"@context": "http://schema.org", "@type": "Recipe", "name": "Bademjan Kebab", "description": "Bademjan kebab is traditionally pan-fried eggplant stuffed with bieh, a herb-and-nut sauce that, in Northern Iran, uses sour fruit molasses along with the typical sweet and sour pomegranate molasses. An important Northern Iranian spice, Persian hogweed is earthy, sour and slightly bitter, with a pungent scent; you can find it at Middle Eastern groceries. Mr. Sadr sautés the bieh until the herbs and nuts cook down into a dark green, thick paste, which is spooned onto partially roasted eggplant halves then roasted. Northern Iranian cooking doesn’t use a lot of spices, so the herbs, nuts and molasses create a deeply flavored, almost meaty vegan sauce. It’s flexible, so sub in dill, basil, tarragon, savory or scallion for any of the herbs. The bieh will keep for 1 week in the fridge and up to 3 months in the freezer, so you can make it in advance. If eating this dish as a main, Mr. Sadr suggests serving it with plain or turmeric basmati rice.", "author": {"@type": "Person", "name": "Leena Trivedi-Grenier"}, "image": "https://static01.nyt.com/images/2020/09/16/dining/10sadrerex2/merlin_175613238_52b00e20-debc-495f-9735-5375abdec011-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "6 entrée servings or 12 appetizer servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, vegetables, main course, side dish", "keywords": "cilantro, eggplant, hazelnut, molasses, sumac, turmeric, walnut, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 27}, "recipeIngredient": ["2 cups raw walnuts (about 8 ounces)", "Heaping 1/3 cup raw, skinned hazelnuts (about 2 ounces)", "2 cups roughly chopped cilantro leaves and tender stems (from about 2 bunches)", "1 cup roughly chopped flat-leaf parsley leaves and tender stems (from about 1 bunch)", "Scant 1/2 cup roughly chopped chives (from about 1/2 bunch)", "1/3 cup roughly chopped mint leaves (from about 1/2 bunch)", "1/4 cup stemmed, roughly chopped sorrel (from about 1/2 bunch), or 1 cup roughly chopped foraged wood sorrel leaves", "1/2 medium yellow onion, roughly chopped", "3 large garlic cloves, peeled", "1/2 cup neutral oil", "1 teaspoon ground turmeric", "1/2 teaspoon sweet paprika", "1/2 teaspoon ground Persian hogweed (optional)", "Kosher salt and freshly ground black pepper", "1/2 cup Sour Plum Molasses (<a href=\"https://cooking.nytimes.com/recipes/1021283-hanif-sadrs-sour-plum-molasses\">see recipe</a>)", "1/4 cup pomegranate molasses", "6 medium Italian eggplants (about 1 pound each)", "6 tablespoons extra-virgin olive oil", "1 1/2 teaspoons sumac", "Chopped herbs, barberries, sprouts and pomegranate seeds, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the bieh: In a food processor, pulse the walnuts and hazelnuts until very finely ground, then set nuts aside in a small bowl. Add the cilantro, parsley, chives, mint, sorrel, onion and garlic to the food processor, and purée into a fine paste. (You should have about 1 1/4 cups herb paste.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 10-inch nonstick skillet, heat up the neutral oil over high until shimmering, then lower heat to medium and add the herb paste and ground nuts. Cook for 15 minutes, stirring frequently to evaporate the water from the mixture. Stir in the turmeric, paprika, hogweed (if using), 2 1/4 teaspoons salt and 1/2 teaspoon pepper, and cook for another 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the sour plum molasses and pomegranate molasses, and cook for 10 minutes, stirring occasionally. If the mixture is dry and looks like it might stick or burn, add a few tablespoons of water at a time to help (up to 1/2 cup total)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Lower stove heat to medium-low and keep cooking the bieh, stirring occasionally, for an additional 15 to 20 minutes. The bieh is done when it’s a very thick, dark paste. Adjust salt and pepper to taste, if needed. Place bieh in a bowl and set aside. (You should have 2 1/2 packed cups.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the eggplant: Slice all the eggplant in half lengthwise and divide among two sheet pans. Drizzle each with olive oil and toss to coat, then arrange cut-side up. Sprinkle with sumac and season with salt and pepper. Roast 20 minutes, until eggplant is halfway cooked but still holding its shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove eggplant from the oven and spoon 3 to 4 tablespoons of bieh on top of each eggplant half, spreading it evenly; you should use up all the bieh. Roast for another 12 minutes, or until the eggplant is completely tender but still holding its shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish the eggplant with more chopped herbs, barberries, sprouts or pomegranate seeds. If eating as a main, serve with plain or turmeric basmati rice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021284-bademjan-kebab"}