{"@context": "http://schema.org", "@type": "Recipe", "name": "Carne Asada Lorenza", "description": "For centuries, Sonoran carne asada tacos have traditionally been assembled in flour tortillas. However, the corn tortilla, salted and crisped on the same grill that cooks and seasons the meat, has been added to the mix, creating a crunchy open taco called the Carne Asada Lorenza. Not only is it a sight to behold, but it has become such a favorite that it’s starting to rival the flour tortilla taco. Once the corn tortilla is seasoned and grilled, it is slathered with <a href=\"https://cooking.nytimes.com/recipes/1021290-refried-beans\">refried beans</a>, mounted with copious amounts of melty cheese, and placed back on the grill for the cheese to ooze all over. The taco base becomes a sumptuous bed for the carne asada. Finish it with <a href=\"https://cooking.nytimes.com/recipes/1021291-fire-roasted-salsa\">fire-roasted salsa</a> and <a href=\"https://cooking.nytimes.com/recipes/1021293-guacamole\">guacamole</a>, and you will see what the Lorenza hype is all about.", "author": {"@type": "Person", "name": "Pati Jinich"}, "image": "https://static01.nyt.com/images/2020/08/12/dining/10Carneasadarex1-lorenzo/merlin_175265211_99d91d6a-ec87-42e7-a9c5-a28ac31dacd3-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, meat, tacos, main course", "keywords": "beef, cheese, chuck steak, corn tortillas, onion, sirloin, tortilla", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 390}, "recipeIngredient": ["1/4 large white onion, for cleaning the grill", "Beef fat (cut from the meat, if fatty), tallow or vegetable oil, for greasing the grill", "2 pounds chuck roll, sliced into 1/2-inch steaks", "2 pounds top sirloin, sliced into 1/2-inch steaks", "4 teaspoons kosher or sea salt (about 1 teaspoon per pound of meat), or to taste, plus more for salting tortillas", "12 corn tortillas", "Frijoles de Fiesta (Fiesta Refried Beans) (<a href=\"https://cooking.nytimes.com/recipes/1021290-refried-beans\">see recipe</a>)", "12 ounces asadero, quesadilla, Monterey Jack or Oaxaca cheese, grated (about 3 cups)", "Salsa Tatemada Norteña (Fire-Roasted Salsa) (<a href=\"https://cooking.nytimes.com/recipes/1021291-fire-roasted-salsa\">see recipe</a>)", "Chile Verde Guacamole (<a href=\"https://cooking.nytimes.com/recipes/1021293-guacamole\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start a charcoal or gas grill, and get it very hot. For gas, set to high heat. For charcoal, grill is ready when coals are red but entirely covered with gray ash, and you can hold your hand about 5 to 6 inches above the coals for only about 4 to 5 seconds before it becomes too hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and season the grill: Using a pair of tongs, rub a quarter of a white onion over it. Next, rub the beef fat over the grill to season it further. (Alternately, you can do this using tallow or vegetable oil.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches if needed to avoid crowding, place the meat over the hot grill. Season the meat generously with salt on top right before throwing it on the grill, salt-side up. (Alternatively, sprinkle the salt on top of the meat once it’s on the grill.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill for 4 to 5 minutes, until the bottom has seared, deep grill marks have developed, and the meat juices have started rising and bubbling over the top. Flip to the second side and grill for another 3 to 4 minutes for medium. Remove the meat and place in a lidded dish or container. Cover the cooked meat while you grill the remainder. Allow the meat to rest for at least 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "One by one, take out the pieces of meat and cut into about 1/2-inch dice, placing them back in the same lidded dish and covering until the meat has been chopped."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using gas, reduce the heat of the grill to medium. Brush the corn tortillas with water and sprinkle or rub with salt to taste on both sides. Place on the grill — if using charcoal, place them over indirect heat — and let them toast for about 2 to 3 minutes per side, depending on how hot the grill is, until lightly browned and crisped on both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the crisp tortillas from the grill, slather each one with a couple tablespoons of refried beans on one side and cover the beans with 1/4 cup shredded cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place them back on the grill, cheese-side up, and cook until cheese has completely melted and corn tortillas have browned darker and crisped further, about 3 to 4 minutes. Remove from the grill, place on a platter, top with a generous amount of diced meat and bring to the table. Let your guests top with salsa and guacamole to their liking."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021289-carne-asada-lorenza"}