{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemony White Bean Soup With Turkey and Greens", "description": "Bright with lemon and herbs, and packed with hearty greens, this highly adaptable soup can be either light and brothy or thick and stewlike, depending on your preference. Smashing some of the beans to release their starch will give you a thicker soup that’s almost worthy of a fork. To keep it on the brothy side, add a little more liquid and leave the beans intact. Either way, it’s a warming, piquant, one-pot meal that’s perfect for winter.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/03/21/dining/08Apperex/08Apperex-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, one pot, main course", "keywords": "fall, winter, ginger, ground turkey, parsley, soup, sturdy greens, white beans", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 7506}, "recipeIngredient": ["3 tablespoons olive oil", "1 large onion, diced", "1 large carrot, diced", "1 bunch sturdy greens, such as kale, broccoli rabe, mustard greens or collard greens", "1 tablespoon tomato paste", "3/4 teaspoon ground cumin, plus more to taste", "1/8 teaspoon red-pepper flakes, plus more to taste", "1/2 pound ground turkey", "3 garlic cloves, minced", "1 tablespoon finely grated fresh ginger", "1 teaspoon kosher salt, plus more to taste", "1 quart chicken stock", "2 (15-ounce) cans white beans, drained and rinsed", "1 cup chopped fresh, soft herbs, such as parsley, mint, dill, basil, tarragon, chives or a combination", "Fresh lemon juice, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large pot over medium-high for a minute or so to warm it up. Add the oil and heat until it thins out, about 30 seconds. Add onion and carrot, and sauté until very soft and brown at the edges, 7 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, rinse the greens and pull the leaves off the stems. Tear or chop into bite-size pieces and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the onion is golden, add tomato paste, 3/4 teaspoon cumin and 1/8 teaspoon red-pepper flakes to the pot, and sauté until paste darkens, about 1 minute. Add turkey, garlic, ginger and 1 teaspoon salt, and sauté, breaking up the meat with your spoon, until turkey is browned in spots, 4 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add stock and beans, and bring to a simmer. Let simmer until the soup is thick and flavorful, adding more salt if needed, 15 to 25 minutes. If you like a thicker broth, you can smash some of the beans with the back of the spoon to release their starch. Or leave the beans whole for a brothier soup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the greens to the pot and simmer until they are very soft. This will take 5 to 10 minutes for most greens, but tough collard greens might take 15 minutes. (Add a little water if the broth gets too reduced.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir herbs and lemon juice into the pot, taste and add more salt, cumin and lemon until the broth is lively and bright-tasting. Serve topped with a drizzle of olive oil and more red-pepper flakes, if desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021776-lemony-white-bean-soup-with-turkey-and-greens"}