{"@context": "http://schema.org", "@type": "Recipe", "name": "Tsimmes (Beef, Carrot and Sweet Potato Stew)", "description": "Tsimmes is a medieval German Jewish holiday beef stew that spread with the Jews to Eastern Europe. It was originally made with carrots and turnips, then when potatoes came to the Old World, they were added. When the dish came to the New World, sweet potatoes often replaces the white potatoes. Now I’ve tweaked it to my taste: I substitute the yellow yams or sweet potatoes with the white Japanese sweet potatoes that I love. I use flanken, a cut of short ribs found at kosher butchers, but any cut of short ribs will do, as will beef stew meat. I keep the bones in for flavor — and add a bay leaf for the same reason — and, rather than skimming the fat as it cooks, I simply put the stew pot in the refrigerator overnight so I can easily remove the hardened fat the next day. (A generation or two before me, cooks would have saved that fat for cooking and baking.) Instead of adding a little matzo meal to thicken the broth, I find no need for that, especially if I reduce the sauce a little before serving. I add pitted prunes, which are sweet enough to eliminate the need for brown sugar or honey and, at the end, I add parsley for color.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2020/09/09/dining/09rosh-a/merlin_176253231_2d88c873-2930-4ada-8023-098308f27fa9-articleLarge.jpg", "totalTime": "PT11H", "recipeYield": "6 to 8 servings", "recipeCuisine": "jewish", "recipeCategory": "dinner, meat, soups and stews, vegetables, main course", "keywords": "carrot, onion, prune, short ribs, sweet potato, rosh hashana", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 515}, "recipeIngredient": ["3 bone-in flanken, also known as flanken-style ribs, or English-cut short ribs (about 3 pounds)", "1 tablespoon kosher salt, plus more to taste", "1 1/2 teaspoons freshly ground black pepper, plus more to taste", "1 fresh (or dried) bay leaf", "3 pounds sweet potatoes, preferably Japanese white sweet potatoes (3 to 4 large sweet potatoes), peeled and cut into 2-inch chunks", "2 medium white or yellow onions, halved and sliced", "5 to 6 medium carrots, peeled and cut into 2-inch segments", "8 ounces prunes, pitted and left whole", "Chopped fresh parsley, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "A day before serving, heat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the meat with 1 tablespoon salt and 1 1/2 teaspoons pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the meat and the bay leaf in a Dutch oven or other large, heavy pot, and add enough water to cover (about 8 cups). Bake, covered, for about an hour, then remove from heat, let cool and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, the fat will have congealed on top; using a slotted spoon, remove and discard the layer of fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sweet potatoes, onions, carrots and prunes to the meat, and stir to combine. Bake, covered, for another hour, then remove the lid and cook until the potatoes are cooked, the meat is tender and the water is reduced, another 30 minutes to 1 hour. Season to taste. If there is more broth than you’d like, ladle some out and save for another use. Sprinkle with parsley just before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021392-tsimmes-beef-carrot-and-sweet-potato-stew"}