{"@context": "http://schema.org", "@type": "Recipe", "name": "Alcapurrias de Jueyes (Crab-Stuffed Fritters)", "description": "Puerto Rico is famous for its fritters, and alcapurrias are among the most coveted. Imagine a tamale made of green banana and root vegetable masa that is stuffed with savory meat or seafood, and then deep fried. You typically get them from the kioskos, roadside stands along Puerto Rico’s beaches and highways, particularly in Loíza, a town on the northeastern coast that is the island’s African heart</span>. At home, they’re often made over the holidays, as many hands make light work. The flavor is unmistakable: earthy green banana and taro cut by savory <a href=\"https://cooking.nytimes.com/recipes/1022007-sofrito\">sofrito</a>, briny capers and delicate crab meat. The filling, often called a salmorejo, is usually made from local land crabs, but commercially available lump crab is a fitting substitute. This recipe is adapted from one by María Dolores “Lula” de Jesús, the 84-year-old owner of El Burén de Lula in Loíza, who is considered by many to be a madrina, or godmother, of this and other dishes with African origins.", "author": {"@type": "Person", "name": "Von Diaz"}, "image": "https://static01.nyt.com/images/2021/03/24/dining/22Puertoricanrex7-Alcapurrias/merlin_184863117_b1c4ffb5-f50d-4f13-a846-fd67fae9d6ad-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "About 32 fritters", "recipeCuisine": "", "recipeCategory": "finger foods, seafood, appetizer, side dish", "keywords": "annatto seeds, crab, crab meat, puerto rican, taro root", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 17}, "recipeIngredient": ["3/4 cup vegetable oil or lard", "3 tablespoons annatto seeds", "Kosher salt", "2 pounds white yautia (taro root)", "2 green bananas", "1/2 cup annatto oil", "3 tablespoons annatto oil", "1/2 cup <a href=\"https://cooking.nytimes.com/recipes/1022007-sofrito\">sofrito</a>", "2 tablespoons drained capers, chopped", "1 teaspoon store-bought or <a href=\"https://cooking.nytimes.com/recipes/1022006-sazon\">homemade sazón</a>", "1 teaspoon kosher salt, plus more to taste", "1 pound lump crab meat (about 2 cups)", "1 tablespoon annatto oil", "Vegetable oil, as needed (about 4 cups)", "Hot sauce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the annatto oil: In a small saucepan, heat oil and annatto seeds over medium-high. Once the mixture comes to a rolling simmer, remove saucepan from stove, stir to combine, then let rest for 5 minutes. Transfer oil to a heat-safe container, straining out seeds through a fine-mesh sieve, and set aside. (Makes 3/4 cup.) You’ll use this oil in three separate steps to come."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the masa: Fill a large bowl with cold water and a fistful of salt. Peel and chop yautia and green bananas into 1-inch pieces, then soak in the salted water until ready to process."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut at least 32 squares of wax paper about 4 to 5 inches each. (Traditionally, banana leaves are used, but, since they can be difficult to source, wax paper is an appropriate substitute.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain yautia and bananas well, then use a clean cloth to dab any excess water. Working in two batches, add half the drained yautia and bananas to the food processor with 1 tablespoon salt, and pulse until fully incorporated. Repeat with the remaining yautia, bananas and 1 tablespoon salt, processing to the texture of chunky hummus."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the first batch of blended yautia and bananas to the food processor, turn it on and gradually pour in 1/2 cup annatto oil, blending the mixture until smooth and dark yellow in color. Taste for salt, then transfer to a large bowl and refrigerate for an hour or more so it can set. (This will make about 9 to 10 cups of masa.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: In a medium saucepan, bring 3 tablespoons annatto oil to a simmer over medium heat. Add sofrito, capers, sazón and 1 teaspoon salt, and cook, stirring occasionally, for 5 minutes, until most of the liquid has evaporated. Lower heat to medium-low and add crab meat, stirring well to incorporate. Cook for another 3 to 5 minutes, stirring occasionally until flavors blend and crab has soaked up the seasoning. Adjust salt as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Create an assembly line on a long dining table or counter, preferably atop a cloth or towels you don’t mind getting stained. From left to right, arrange the remaining annatto oil, wax paper squares, masa, crab filling and a large plate or baking sheet. Have a finger bowl with water and a clean towel available in case your hands get messy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a small teaspoon, smear about 1/8 teaspoon of annatto oil in a wide oval shape nearly to the edge of the paper. Add about 2 tablespoons of masa, then spread in a wide oval over the annatto oil, leaving at least a 1/2-inch border of paper uncovered. Add about 2 to 3 teaspoons crab to the center of the masa, taking care not to overfill. Fold the paper in half, creating a half-moon shape, and seal the edge by pressing the masa lightly with your fingers, careful not to let the filling spill out. Stack carefully on a plate or baking sheet, and return to the fridge until ready to fry. (These fry up best when they’ve had time to rest in the refrigerator. If you’d like to prepare these ahead of time, you can refrigerate them for several hours, or store in the freezer for several months. They can be fried directly from the freezer.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a deep, heavy-bottomed pan or deep fryer, bring about 2 inches of vegetable oil (at least 4 cups) to a simmer over medium-high heat until it reaches 350 degrees on a candy thermometer. Working in batches, carefully transfer each alcapurria to the simmering oil, sliding it off the paper onto your hand, then carefully dropping in the oil. Gently nudge the alcapurrias with heat-safe tongs to prevent them from sticking. (The filling may burst through the edges, causing oil to splatter, so keep a splatter guard handy, if you have one.) Turn each fritter a few times until evenly dark golden brown, about 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oil and drain on a baking sheet lined with paper towels and cook remaining alcapurrias. Let rest for at least 5 minutes before eating, as they are quite hot. Sprinkle each bite with your hot sauce of choice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021990-alcapurrias-de-jueyes-crab-stuffed-fritters"}