{"@context": "http://schema.org", "@type": "Recipe", "name": "Bacon-Wrapped Grilled Chicken Salad With Avocado and Lime", "description": "Wrap your chicken with bacon, grill it and drizzle it with this nearly green goddess, almost-guacamole dressing and you might even convert burger eaters into salad fiends. Covering the butterflied breasts in bacon helps baste the lean chicken and accelerates char as fat melts onto the coals. Flare-ups are inevitable, but don’t be alarmed: They will ensure rich color on the bacon while protecting the breast from overcooking. When assembling the salad, avoid weighing down the leaves with hot and heavy toppings: Dollop plenty of the dressing on the plate first, and layer most of the chicken and fudgy eggs below the lightly dressed leaves. There should be a little leftover dressing to satisfy the people that will want to dip each bite of chicken into the herby, lime-laced avocado.", "author": {"@type": "Person", "name": "Clare de Boer"}, "image": "https://static01.nyt.com/images/2020/05/20/dining/18chickenrex3/merlin_172407795_1114dced-7293-48fb-b046-bc839122771b-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, poultry, salads and dressings, vegetables, main course", "keywords": "avocado, bacon, chicken breast, herbs, lime, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 536}, "recipeIngredient": ["4 boneless, skinless chicken breasts (about 10 ounces each)", "1 1/2 teaspoons flaky sea salt", "1/8 teaspoon black pepper", "16 slices bacon", "1/2 cup any and all soft herbs, such as tarragon, dill, parsley or cilantro, plus more for garnish", "2 teaspoons sea salt", "1 garlic clove", "1/4 cup fresh lime juice (from 2 limes)", "3 ripe avocados", "1/4 cup extra-virgin olive oil", "1/8 teaspoon black pepper", "2 jalapeños, thinly sliced into rounds", "2 1/2 pounds any mixture of crunchy salad leaves: endive, watercress, radicchio, romaine or Little Gems (about 4 quarts)", "Olive oil, as needed", "Kosher salt", "4 fudgy <a href=\"https://cooking.nytimes.com/recipes/1020468-perfect-boiled-eggs\">soft-boiled eggs</a>, peeled and halved", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the chicken breasts out of the fridge to come to room temperature. Soak wooden toothpicks or skewers in water while you ready your grill. Clean the grate thoroughly and build a hot fire. This chicken needs to be cooked over intense, direct heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the coals heat, butterfly the chicken breasts: On a chopping board, place one hand on top of the breast, and slice into its side, starting at the thick end and moving toward the thin point. Make sure not to cut all the way through. Then, open up the breast, cover with plastic wrap and, using a rolling pin, roll the chicken to an even thickness of 1/2 inch; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dressing: Crush the herbs, salt and garlic in a pestle until you have a thick, bright-green paste (or finely chop them); stir in the lime juice. Scoop the avocados into the pestle and crush, then stir in the oil, pepper and half the jalapeños. Prepare the salad components so they’re ready to be assembled when the chicken is cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the coals are burning red and the grill hisses when you drop water on it, salt and pepper the chicken breasts on both sides. Lay 4 slices of bacon flat on each breast crosswise, then turn the chicken over and fold the bacon ends over like you’re wrapping a parcel. Secure the ends of the bacon with toothpicks or skewers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the bacon-wrapped breasts on the grill, with the side without the toothpicks facing down. There will be some flare-ups as the bacon fat hits the coals; if it’s burning, pull the parcels off the grill and give the coals a few minutes to cool. Otherwise, when the parcels have nice color on the first side, after about 3 or 4 minutes, flip them over. Cook on the second side until cooked through, about 2 to 4 minutes more; transfer to a cutting board to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the salad: Toss the leaves with about 1/3 of the avocado dressing and some additional olive oil to thin it. Use your hands to toss until coated and season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull the toothpicks or skewers out of the bacon-wrapped breasts and slice them into strips. Dollop 1/3 of the avocado dressing onto the serving platter, then arrange the leaves, chicken and eggs on top. Dollop with the remaining avocado dressing to taste. Finish with more herbs, remaining jalapeños, lime wedges and some extra olive oil for gloss."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021083-bacon-wrapped-grilled-chicken-salad-with-avocado-and-lime"}