{"@context": "http://schema.org", "@type": "Recipe", "name": "Succotash With Sausage and Shrimp", "description": "Succotash embodies the proverb “If it grows together, it goes together.” This dish is a celebration of summer: fresh corn, ripe tomatoes and shelled butter beans (also known as lima beans.) Succotash has earned its place of pride in regions across the U.S. — the Midwest, the Eastern Seaboard, and perhaps most notably, the South. This succotash is Cajun-style and a worthy entree, thanks to spicy Andouille sausage and seasoned shrimp. But feel free to leave them out for a satisfying meatless option. The Andouille sausage adds kick, so if you use regular sausage or eliminate it altogether, you can add some heat with ground cayenne and hot sauce.", "author": {"@type": "Person", "name": "Vallery Lomas"}, "image": "https://static01.nyt.com/images/2020/08/21/dining/vl-succotash/merlin_175613226_7b3e4dff-600f-4573-b880-6442ba02a7b4-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "8 servings", "recipeCuisine": "cajun", "recipeCategory": "salads and dressings, vegetables, main course, side dish", "keywords": "andouille sausage, corn, lima beans, okra, shrimp, tomato, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1380}, "recipeIngredient": ["2 1/2 cups/1 pound fresh (shelled) or frozen butter beans or baby lima beans", "2 teaspoons kosher salt, plus more as needed", "3 cups/12 ounces fresh or frozen okra, tops and tails trimmed, sliced into 1/2-inch rounds", "1 tablespoon plus 1 teaspoon extra-virgin olive oil or unsalted butter", "6 ounces Andouille sausage, diced", "1 large yellow onion, diced", "1/2 large green bell pepper, diced", "4 garlic cloves, minced", "5 medium ears corn, kernels sliced off (about 3 1/2 cups)", "2 large ripe tomatoes, coarsely chopped", "3/4 teaspoon black pepper, plus more as needed", "1 pound shrimp (any size), peeled and deveined", "1/2 packed cup fresh basil leaves, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Meanwhile, bring 1 cup water to a boil in a medium saucepan. Once boiling, add the butter beans and return to a boil. Reduce the heat and simmer, covered, until the beans are al dente, about 8 minutes. Remove from heat, strain, and sprinkle with 1/4 teaspoon kosher salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the butter beans are cooking, prepare the okra: Spread the okra in an even layer on a lined baking sheet. Drizzle with 1 teaspoon olive oil, and sprinkle with 1/4 teaspoon kosher salt. Roast the okra for 16 to 18 minutes. Remove from the oven and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large cast-iron skillet or Dutch oven over medium. Add the Andouille sausage and cook until it’s crisp and the fat has rendered. Remove the sausage with a slotted spoon and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion, bell pepper and garlic to the rendered fat in the skillet or Dutch oven, and cook until the vegetables are softened, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the corn, tomatoes, lima beans, okra, 1 teaspoon kosher salt, 1/2 teaspoon black pepper and Andouille sausage. Stir, cover, and cook for about 8 minutes over medium heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As vegetables cook, pat the shrimp dry with paper towels, then generously season with 1/2 teaspoon salt and 1/4 teaspoon black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate large (12-inch) skillet, heat the remaining 1 tablespoon of olive oil over medium-high. Once the oil is shimmering, add the shrimp in a single layer. Cook for 2 minutes, then flip and cook for another 2 to 3 minutes, until pink and cooked through. Stir the cooked shrimp into the succotash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the fresh basil and stir. Taste, and adjust seasoning as needed. Turn off heat and let sit uncovered for about 5 minutes to let the flavors meld. Serve warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021335-succotash-with-sausage-and-shrimp"}