{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Salmon Salad With Lime, Chiles and Herbs", "description": "Made of soft, supple salmon; crisp lettuces and vegetables; and a very savory dressing run through with chiles and lime, this light salad is tangy and full of flavor. The dressing, based on nuoc cham, a traditional Vietnamese dipping sauce, has just enough fish sauce to give it depth and pungency without overpowering the brightness of the lime. You can substitute other fish, or even chicken, for the salmon. Just adjust the grilling time as needed, and toss with the dressing while still warm. Note that if you don’t have a grill, you can roast the fish in the oven.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/08/02/dining/29apperex/merlin_172921854_95aac7f8-5460-4d17-9760-6da36dcc21de-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, salads and dressings, seafood, main course", "keywords": "fish sauce, herbs, lettuce, salmon, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1553}, "recipeIngredient": ["2 limes", "2 small fresh red or green chiles or 1 large one, thinly sliced, seeds removed if you like", "1 shallot (or 2 scallions, or 2 tablespoons red onion), thinly sliced", "2 tablespoons fish sauce", "Kosher salt", "Pinch of granulated sugar", "1/4 cup extra-virgin olive oil or grapeseed oil, plus more for brushing", "1 1/4 pounds salmon fillet, preferably 1 large center-cut piece", "8 cups salad greens, such as Little Gem, bibb or Boston lettuce", "1 cup mixed soft herbs (such as cilantro, mint and basil), leaves and tender stems", "1 cup thinly sliced radishes, cucumbers or both (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Light the grill for indirect heat, or heat the oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the grill or oven heat up, make the dressing: Halve 1 lime, and squeeze its juice into a small bowl. Add the chile slices, half of the sliced shallot (save the rest for serving), the fish sauce and a pinch each salt and sugar. Let sit for 1 minute to dissolve the salt, then whisk in the olive oil. It won’t emulsify, so mix again before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the salmon with oil, and place it in a grilling basket if you have one. Cook over the indirect (unlit) side of the grill, for 2 to 5 minutes per side, depending on how hot the grill is and how thick the salmon is. Note that individual fillets will cook faster than a single large piece. Check the salmon often. (Alternatively, roast the salmon on a baking sheet in the oven, until just cooked to taste, 7 to 12 minutes; you don't have to flip it.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the salmon cooks, halve the other lime. Brush the cut sides with olive oil and grill, cut-side down, over direct heat until charred, about 1 minute. If using the oven, throw the halves, cut-side up, on the roasting pan with the salmon. They won’t char, but they will cook and mellow in flavor, which is the aim."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the salmon is cooked, transfer it to a plate and spoon some dressing over it. Let it cool slightly, then break up the fish into large chunks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place greens, remaining shallots, herbs, and radishes or cucumber, if using, in a large shallow bowl or on a platter, and add a little more of the dressing. Squeeze some of the juice from a charred lime half over it and drizzle with a little olive oil. Toss and taste, adding lime juice, olive oil or salt as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top with the salmon chunks and drizzle with more (or all) of the dressing. Serve with the remaining charred lime half on the side for squeezing."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021127-grilled-salmon-salad-with-lime-chiles-and-herbs"}