{"@context": "http://schema.org", "@type": "Recipe", "name": "Mapo Tofu Nachos", "description": "This twist on nachos doesn’t simply call for putting traditional <a href=\"https://cooking.nytimes.com/recipes/1021459-mapo-tofu\">mapo tofu</a> atop tortilla chips. Instead, you’ll make a creamy, spicy, saucy version using blended silken tofu and all the usual mapo ingredients. Spoon the sauce atop layers of chips, add cheese, then bake it. You could certainly stop there, but finishing with some garnishes makes it especially festive. Save leftover sauce for another round of nachos or a half batch of <a href=\"https://cooking.nytimes.com/recipes/1021487-mapo-spaghetti\">mapo spaghetti</a>. To double this recipe, bake on a large parchment or foil-lined sheet pan in a 350-degree oven for about 10 minutes. You can also make the sauce with lamb, turkey thigh or a plant-based meat alternative, in place of the ground beef or pork, if you like.", "author": {"@type": "Person", "name": "Andrea Nguyen"}, "image": "https://static01.nyt.com/images/2020/10/07/dining/05mapo3/merlin_177593256_579c59d1-33f5-4b10-86ce-772fd3ee25b4-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "appetizer, main course", "keywords": "cheese, doubanjiang, ground beef, ground pork, nacho, scallion, sichuan peppercorns, tofu, tortilla chips", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 324}, "recipeIngredient": ["1 (14- or 16-ounce) package silken tofu", "1 1/2 teaspoons Sichuan peppercorns", "2 tablespoons neutral oil, such as canola oil", "8 ounces ground beef or pork (preferably 80 or 85 percent lean), roughly chopped to loosen", "2 1/2 to 3 tablespoons doubanjiang (fermented chile bean sauce or paste)", "1 tablespoon douchi (fermented black beans, optional)", "1 teaspoon minced fresh ginger", "1/2 teaspoon red-pepper flakes (optional)", "2 teaspoons regular soy sauce", "1 rounded teaspoon granulated sugar, plus more as needed", "Fine sea salt", "1 large scallion, trimmed and sliced on a sharp bias into 2-inch-long pieces", "1 tablespoon cornstarch dissolved in 2 tablespoons water", "5 to 6 ounces corn tortilla chips (about 5 cups)", "2 medium scallions, trimmed and sliced on the bias into 3/4-inch-long pieces", "4 ounces shredded Oaxacan, Monterey Jack or other mild-flavored melty cheese (about 1 1/3 cups)", "1/3 cup sliced or coarsely chopped pitted olives, such as black, green or a combination (optional)", "2 whole pickled jalapeños, sliced (optional)", "1/3 cup coarsely chopped cilantro (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the mapo tofu sauce: If the tofu came as a block in water, discard the water. Cut the tofu into large chunks, then use a stand blender or immersion blender to whirl the tofu into an ivory smoothie."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium (3- or 4-quart) pot over medium heat, toast the Sichuan peppercorns for 2 to 3 minutes, until super fragrant and slightly darkened. (A wisp of smoke is OK.) Let cool briefly, then pound with a mortar and pestle or pulse in a spice grinder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the remaining sauce ingredients and set them near the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm the oil in the pot over high heat. When shimmering, add the meat. Stir and mash into cooked and crumbly pieces, 1 to 2 minutes. Add 2 1/2 tablespoons doubanjiang, the douchi (if using), ginger and red-pepper flakes (if using). Fry about 2 minutes longer, stirring constantly, until the mixture is a rich reddish brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to medium-low, then stir in the soy sauce and 1 rounded teaspoon sugar. Scrape in the blended tofu. (If there’s much left in the blender jar, add 1 tablespoon water and whirl to loosen it.) Stir to combine well, partially cover and bring to simmer. Cook for about 3 minutes, stirring occasionally, to develop flavor throughout. Expect orange oil to appear on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the sauce and if needed, add the remaining 1/2 tablespoon doubanjiang (for heat), or a pinch of salt (for savoriness) or sugar (to tame heat)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the scallion, then add the cornstarch slurry and stir until thickened. Turn off the heat. Stir in half the crushed Sichuan peppercorns for a bit of zing. Let sit for 5 to 10 minutes to deepen flavor and color before using; a little lingering orange oil is normal. This recipe makes about 2 1/2 cups, which is twice the amount that you’ll need for this recipe; save the rest for spaghetti, more nachos or another use. (You can cool the sauce completely then refrigerate it in an airtight container for up to 3 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the nachos: Heat a toaster oven (or standard oven) to 350 degrees. Line the baking pan of the toaster oven (or a small sheet pan) with parchment or aluminum foil, leaving a little overhang on two sides so you may later easily transfer the nachos. Arrange half of the chips on the pan, laying them flat; some overlap is fine. Use a spoon to strew a heaping 1/2 cup mapo tofu sauce onto the chips. Sprinkle with half the scallions, half the cheese and half the remaining Sichuan peppercorns. Repeat with the remaining chips, a heaping 1/2 cup mapo tofu sauce, the remaining scallions, cheese and peppercorns."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 8 to 10 minutes, until the cheese completely melts and there is gentle sizzling. Remove from the oven, then lift the parchment paper or foil to remove the nachos from the pan, then use a spatula to carefully usher the nachos to a platter. Top with any combination of olives, pickled jalapeños and cilantro, if desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021489-mapo-tofu-nachos"}