{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Vegan Polenta With Mushrooms and Kale", "description": "While it may be difficult to imagine many classic Italian dishes without a generous sprinkle of Parmesan, polenta’s creamy nature means it’s easy to make without butter or cheese. Nutritional yeast, when used in moderation, mimics the nutty flavor of Parmesan, but use too much, and it can overpower. Just a tablespoon or two does the trick here, along with a few tablespoons of vegan butter. (You can use olive oil, but vegan butter works best to achieve the richness of traditional polenta.) The red wine braised mushrooms and kale take the place of meat, but the polenta would be equally delicious served with simply sautéed greens or roasted root vegetables. Leftover polenta can be reheated over medium-low with a splash of broth or water.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2021/01/25/dining/lh-vegan-polenta-with-mushrooms/merlin_181989942_f6a81693-9cc2-4afa-a6bb-d3f3c2d96168-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, vegetables, main course", "keywords": "kale, mushroom, polenta, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1058}, "recipeIngredient": ["6 cups low-sodium vegetable broth, plus more as needed", "Kosher salt and black pepper", "1 1/2 cups polenta, medium- or coarse-grind cornmeal, or corn grits", "3 tablespoons vegan butter", "1 to 2 tablespoons nutritional yeast, to taste", "3 tablespoons olive oil, plus more as needed", "1 small yellow onion, finely chopped", "1 pound cremini mushrooms, trimmed and sliced 1/4-inch thick", "2 teaspoons minced fresh rosemary", "4 garlic cloves, minced", "Pinch of red-pepper flakes", "3 tablespoons tomato paste", "2/3 cup full-bodied red wine (see Tip)", "1 cup low-sodium vegetable broth", "1 large or 2 small bunches curly kale, Tuscan kale or Swiss chard (about 10 ounces), stemmed, then leaves torn into bite-size pieces", "1 teaspoon red wine vinegar", "Chopped fresh parsley, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the polenta: Bring 6 cups vegetable broth and 1 teaspoon salt to boil in a large saucepan. Gradually whisk in the polenta, then turn the heat to low and simmer, stirring occasionally with a wooden spoon, until the polenta has thickened to your liking, 10 to 15 minutes. Off the heat, stir in the butter and nutritional yeast. Season to taste with salt and black pepper; cover and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the mushrooms: While the polenta simmers, heat the olive oil in a 12-inch skillet over medium. Add the onions and cook, stirring occasionally, until translucent, about 4 minutes. Raise the heat to medium-high, and add the mushrooms and rosemary to the skillet. Cook, tossing occasionally and adding a splash of olive oil if the pan looks dry, until the mushrooms have released their water and are tender, 4 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the garlic and red-pepper flakes, and cook for 1 minute, until fragrant. (Be careful not to let the garlic burn.) Add the tomato paste and cook, stirring to incorporate, until it turns a rusty brown color and begins to caramelize on the bottom of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the red wine and cook, stirring and scraping the brown bits from the pan, until the liquid is reduced by about half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the 1 cup vegetable broth, and bring to a simmer. Begin adding handfuls of kale, cooking and stirring until the kale wilts. Add 3/4 teaspoon salt and 1/4 teaspoon pepper and cook, stirring occasionally, until the liquid in the pan reduces and thickens, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Off the heat, stir in the vinegar and add salt and pepper to taste. Reheat the polenta over medium-low, adding a splash of broth to loosen it if necessary. Serve the polenta and braised mushrooms and kale in shallow bowls, sprinkled with parsley."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021827-creamy-vegan-polenta-with-mushrooms-and-kale"}