{"@context": "http://schema.org", "@type": "Recipe", "name": "Arroz con Pollo", "description": "Ubiquitous throughout Latin America and beyond, this dish can be as simple or as complex as your ingredients allow. The key is to layer flavor, adding dimension as you go. Boneless, skinless chicken thighs are preferred, but bone-in will also work well. (Chicken breasts lack the same amount of fat and flavor, so they are not recommended here.) Watch the rice carefully as it cooks, absorbing the liquid, as pots and stoves vary greatly. If it starts to smell a little burned, reduce the heat, toss and put the lid on the pot. But don’t worry, as this aroma can be part of creating the coveted pegao, a layer of toasted rice that develops on the bottom of the pan and sticks to it, similar to Persian tahdig, Spanish socarrat or Senegalese xoon.", "author": {"@type": "Person", "name": "Von Diaz"}, "image": "https://static01.nyt.com/images/2020/10/28/dining/26resiliencerex2/merlin_177593448_e98ec7ca-732b-45b3-a840-e9d22fa37a6c-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "latin american", "recipeCategory": "dinner, grains and rice, poultry, main course", "keywords": "chicken thigh, cilantro, frozen peas, puerto rican, rice, tomato sauce", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1560}, "recipeIngredient": ["3 large garlic cloves, finely minced", "1 tablespoon kosher salt", "1 tablespoon olive oil", "2 teaspoons white vinegar", "1 1/2 teaspoons dried oregano", "1/4 teaspoon black pepper", "3 pounds boneless, skinless chicken thighs", "3 cups medium-grain white rice", "3 tablespoons olive oil", "5 cups low-sodium chicken broth (or water)", "2 1/2 to 3 cups fresh sofrito (see recipe below)", "3 dried bay leaves", "1 teaspoon ground annatto or sweet paprika", "1 cup tomato sauce (basic canned tomato sauce is fine)", "3/4 cup medium pimento-stuffed olives, drained (optional)", "2 teaspoons drained capers (optional)", "1 teaspoon kosher salt, plus more to taste", "1/2 teaspoon freshly cracked black pepper", "2 cups frozen peas, thawed", "1 lime, cut into wedges", "Salted, sliced avocado and tomato, for serving", "1 medium red bell pepper, seeded and cut into quarters", "3 ají dulce or amarillo peppers (or mini bell peppers), seeded and coarsely chopped", "6 large garlic cloves", "1 large yellow onion, coarsely chopped", "6 fresh culantro leaves and tender stems, coarsely chopped (see Note)", "6 fresh cilantro stems, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the adobo by whisking the ingredients together in a bowl, or blending in a small food processor, pilón or mortar and pestle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the chicken dry, then place in a large bowl or zip-top bag. Pour prepared adobo over chicken. Toss well to combine, then cover the bowl with a lid or plastic wrap, or seal the bag, and let the chicken rest in the fridge for at least 30 minutes. If you have the time, marinate for several hours or overnight to make the chicken extra tender and flavorful."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sofrito: In a large food processor or blender, blend the peppers and garlic until smooth. Add the onion and blend until smooth, then add the culantro and cilantro and blend until smooth. (The preparation may produce more sofrito than needed for this recipe, but you can store additional sofrito in the fridge for up to 1 week, or in the freezer for up to 3 months.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice to a medium bowl, then rinse with several rounds of cool water, pouring through a fine-mesh strainer until water runs out clear."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once chicken is marinated, heat olive oil in a large heavy pot or Dutch oven over medium-high. When the oil is simmering, working in batches if necessary, add chicken in one layer and brown for 7 to 10 minutes per batch, turning several times to evenly brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring chicken broth (or water) to a boil in a medium saucepan. Reduce to a simmer until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add sofrito, bay leaves and annatto or paprika to pot with chicken and stir well. Reduce heat to medium, and sauté until liquid is mostly evaporated and sofrito thickens to a paste, about 7 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomato sauce and cook for 3 to 5 minutes longer, until the sauce darkens. Add the rinsed rice, olives and capers (if using), and salt and pepper, and fold in to ensure that the rice is fully coated and the chicken is evenly distributed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in hot stock, then simmer, uncovered, over medium heat for about 15 minutes, stirring only 2 to 3 times and shaking the pot every few minutes to keep rice level. (The liquid surrounding the rice will lower by about 1 inch.) Watch the rice very closely: The window between just right and overcooked is small, and difficult to predict, but you’ll become an expert at this over time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once you start to spot lots of little bubbles on the surface but see no more pronounced liquid on top, top with the lid, reduce heat to low and cook until the rice is al dente, about 15 to 20 minutes, shaking pot a few times. Once liquid is almost entirely evaporated, sprinkle thawed peas on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working directly in the pot, using 2 forks, pull apart chicken thighs until shredded. Gently fluff the rice, bringing grains from the bottom to the top. Return the lid and let rest for 10 to 15 minutes before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish with lime wedges, and serve with salted avocado and tomato slices (or a simple green salad). The dish keeps well in the refrigerator for 3 to 5 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021438-arroz-con-pollo"}