{"@context": "http://schema.org", "@type": "Recipe", "name": "Carrot Maqluba", "description": "Maqluba is a traditional Palestinian dish made of rice, meat and fried vegetables, most often eggplants (in summer) or cauliflower (in winter), although some like to combine both, and add carrots as well. There are probably as many variations of this dish as there are families. A very popular, easy version is the one made with only carrots. Although maqluba is usually perceived as a time-consuming dish — you typically make broth, fry all the vegetables, assemble in layers and so on — this version uses a boneless, tender cut of meat, ready-made broth and a single pot. The whole dish is quick, and easy enough that you can make it on any weeknight in under an hour.", "author": {"@type": "Person", "name": "Reem Kassis"}, "image": "https://static01.nyt.com/images/2021/04/07/dining/05Nafasrex2/merlin_185308044_d86614f1-5f30-4124-9d83-85da702bbed9-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "middle eastern", "recipeCategory": "grains and rice, meat, one pot, steaks and chops, vegetables, main course", "keywords": "almond, carrot, cinnamon, jasmine rice, rib eye steak, rice, steak", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 296}, "recipeIngredient": ["1 pound jasmine or other long-grain rice (about 2 1/4 cups)", "2 teaspoons kosher salt, plus more as needed", "1 teaspoon black pepper", "1 teaspoon ground cinnamon", "1/2 teaspoon ground turmeric", "1/2 teaspoon ground cumin", "4 tablespoons olive oil or ghee (or a combination)", "1 pound boneless rib-eye steak, cut into bite-size cubes", "1 yellow onion, halved and sliced into 1/2-inch strips", "14 ounces carrots (about 4 medium-large), peeled and cut into 2 1/2-by-1/2-inch matchsticks", "4 cups good-quality store-bought or homemade chicken broth", "1/4 to 1/2 cup toasted or fried slivered almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the rice until the water runs clear. Add rice to a bowl with water to cover and leave to soak for 15 minutes, then drain. To the drained rice, add 1 teaspoon each salt and pepper, plus all the spices. Mix to combine, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium (9- to 10-inch), lidded nonstick pot (preferably not deeper than 6 inches), heat the olive oil over medium until shimmering but not smoking. Add the steak cubes, onions and the remaining 1 teaspoon salt, and cook, periodically tossing around, until any meat juices evaporate and meat browns nicely all around, about 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the carrots and cook, stirring regularly, until carrots are glossy and just starting to soften, about 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and make sure the meat and carrot mixture is evenly spread in the bottom of the pot. Top with the spiced rice mixture (do not mix)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly pour the broth into the pot (it should rise about 1/2 inch above the rice). Set an inverted (heatproof) plate over the rice to keep the rice and vegetables from mixing when broth boils. Ideally, the plate should be slightly smaller than the width of the pot. Cover the pot with the lid and bring to a gentle boil over medium heat. Taste the broth at this point and salt it to your liking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook for 10 minutes, then reduce the heat to low, remove the plate but return the lid, and simmer until the rice is fully cooked with no remaining bite, about 5 to 10 minutes. Remove from the heat, cover the bottom of the lid with a tea towel or kitchen paper towels and cover again. Set aside to rest for 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, remove the lid and place a large, inverted serving platter over the pot of rice. Using both hands, flip the pot, and slowly lift to reveal a beautiful cake-shaped dish. Garnish with toasted almonds and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021983-carrot-maqluba"}