{"@context": "http://schema.org", "@type": "Recipe", "name": "Taiwanese Beef Noodle Soup", "description": "Flavored with warm spices, sugar and fermented broad bean chile paste, Taiwanese beef noodle soup is traditionally made with gelatinous beef shins and tendons, giving the broth a sticky richness. The flavors and technique suit meaty short ribs, which come out meltingly tender and moist. Adding a packet of powdered gelatin to the braising liquid gives it the same lip-sticking richness that braised tendons offer in the traditional version.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2020/12/09/dining/07kenjirex/merlin_170584203_31872ade-a275-4d74-8852-a0a87b5d1340-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "4 to 6 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, meat, noodles, soups and stews, main course", "keywords": "bok choy, chicken broth, cinnamon, gelatin, short ribs, sichuan peppercorns, soy sauce", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 731}, "recipeIngredient": ["2 cups homemade or store-bought low-sodium chicken broth", "1 cup Shaoxing wine", "3 tablespoons Chinese dark soy sauce or shoyu", "3 tablespoons dark brown sugar", "1 tablespoon doubanjiang (Sichuan fermented chile bean paste; see Note)", "1 (1/4-ounce) envelope unflavored powdered gelatin (about 2 1/2 teaspoons/7 grams)", "3 pounds meaty, bone-in English-cut short ribs (about 4 large pieces)", "Salt", "1 tablespoon neutral oil, such as canola, rice bran or grapeseed", "1 medium yellow onion, peeled and roughly chopped", "2 Roma tomatoes, roughly chopped", "8 to 10 medium garlic cloves, unpeeled, smashed with the side of a cleaver or knife", "1 (2-inch) piece ginger, unpeeled and sliced about 1/4-inch thick", "3 scallions, trimmed and roughly chopped", "3 small hot dried chiles, such as Sichuan facing heaven, Thai bird or chiles de árbol, split open", "1 (3-inch) cinnamon stick (optional; see Tips)", "2 whole star anise pods", "2 teaspoons whole fennel seeds (optional; see Tips)", "2 teaspoons whole coriander seeds (optional; see Tips)", "2 teaspoons whole Sichuan peppercorns (optional; see Tips)", "2 teaspoons whole black peppercorns (optional; see Tips)", "2 dried bay leaves", "2 tablespoons Chinese black or balsamic vinegar, plus more for serving", "1 pound baby bok choy, halved lengthwise (or Chinese water spinach, napa cabbage or other tender greens, cut into strips)", "1 pound fresh Chinese egg noodles or wheat noodles", "1/4 cup chopped ya cai (preserved Chinese mustard greens), zha cai (mustard root), suan cai (pickled cabbage) or plain old sauerkraut", "1/4 cup roughly chopped cilantro leaves and tender stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the braising liquid: Combine chicken broth, wine, dark soy sauce, sugar and doubanjiang in a medium bowl or large liquid measuring cup. Sprinkle gelatin over the top and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sear the beef: Season short ribs lightly with salt on all sides. Heat oil in a large Dutch oven over high until shimmering. Working in batches if necessary, add short ribs in a single layer and cook, turning occasionally, until well browned on all sides, about 8 minutes, reducing heat if the oil smokes excessively. Transfer short ribs to a large plate and set aside. (Do not wash out the pot.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the aromatics: Add onion, tomatoes, garlic, ginger, scallions and dried chiles to the pot, season lightly with salt, and cook, stirring frequently, until the vegetables are starting to brown around the edges and the tomatoes are breaking down, about 4 minutes. Reduce heat if the bottom of the pot starts to blacken or smoke excessively."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bloom the spices: Add cinnamon, star anise, fennel seeds, coriander seeds, Sichuan peppercorns and black peppercorns, and cook, stirring frequently, until aromatic, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the braising liquid to get the sugar off the bottom. (The hydrated gelatin will have formed a raft that will break up a little when you stir. It’s OK if it’s not dissolved at this point.) Pour the braising liquid into the pot, then scrape up any browned bits from the bottom of the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the short ribs to the pot and add enough water to barely cover them (1 1/2 to 2 quarts). Add bay leaves, bring the liquid to a boil, adjust heat to maintain a bare simmer, and cover the pot with a lid, leaving it slightly cracked to allow steam to escape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook until short rib shows very little resistance when poked with a toothpick or skewer but isn’t falling apart, 2 to 2 1/2 hours. Using a spatula and tongs, carefully transfer the short ribs to a plate. Strain the braising liquid through a fine-mesh strainer into a fresh pot. Discard the solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick any stray spices or aromatics off the short ribs and discard. Return the short ribs to the braising liquid. For best results, allow short ribs to cool in the liquid on the countertop, then refrigerate overnight. Once liquid has chilled, using a ladle, skim and discard most — but not all — of the fat from the surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: If you have the right number of ribs for each guest, you can reheat them on the bone. If not, gently separate the meat from the bone (including the tendons) and break the meat into big chunks with your fingers before reheating. Bring broth and short ribs to a simmer. Add vinegar and season broth to taste with salt. Keep hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a large pot of salted water to a boil. Add greens and cook until tender-crisp, about 1 minute. Remove greens with a slotted spoon or tongs and set aside. Return water to a boil and cook noodles according to package instructions. Drain noodles and divide among four serving bowls. Top with short ribs, divide the greens evenly among the bowls, and ladle the broth over the top. Place a small pile of chopped Chinese pickled vegetable or sauerkraut on top of each short rib, sprinkle with chopped cilantro, and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021705-taiwanese-beef-noodle-soup"}