{"@context": "http://schema.org", "@type": "Recipe", "name": "Pescado Frito (Fried Red Snapper)", "description": "Fishing is an extraordinarily complex issue in Puerto Rico. Much of the seafood eaten doesn’t come from the island’s own waters, in part because of arcane legislation that controls fishing rights. And yet, whole deep-fried fish is a staple on the island, particularly along the west and southwest coast. There, you’ll find red snapper, simply marinated in adobo, fried and served with <a href=\"https://cooking.nytimes.com/recipes/1020516-tostones-fried-green-plantains\">tostones</a>, avocado salad and white rice. It is, in my opinion, the absolute best way to enjoy a whole fish. The frying turns the head and the tail into a crunchy fish chicharrón, and the skin and flesh cook evenly, keeping the flesh moist and the skin crisp. While bones are often a concern for those uncomfortable eating whole fish, there’s a simple solution: Eat it with your hands. Your fingers will do a much better job of finding bones than your fork will, and the experience is more visceral, and delicious.", "author": {"@type": "Person", "name": "Von Diaz"}, "image": "https://static01.nyt.com/images/2021/03/24/dining/22Puertoricanrex2-Pescado/merlin_184863111_18544d19-964f-4900-a5be-b1a63c68f66a-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, seafood, main course", "keywords": "lime, puerto rican, red snapper, vegetable oil", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 87}, "recipeIngredient": ["1 lime, juiced (about 2 tablespoons)", "1 tablespoon olive oil", "2 medium garlic cloves, minced", "1/2 teaspoon ground cumin", "1/2 teaspoon dried oregano", "1/4 teaspoon store-bought or <a href=\"https://cooking.nytimes.com/recipes/1022006-sazon\">homemade sazón</a>", "1 teaspoon kosher salt", "1 (1 1/2- to 2-pound) red snapper, cleaned, scaled and gilled", "1 1/2 quarts vegetable oil", "Lime wedges, hot sauce and chopped cilantro leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the adobo: Combine all the adobo ingredients and grind them together in a large pilón or mortar and pestle, or simply mix them together in a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the fish: Make three shallow crosswise cuts on both sides of the surface of the fish skin, then place it in a deep container with a lid or a large resealable bag. Pour adobo over, rubbing it into the skin, head and cavity. Let marinate for at least 30 minutes at room temperature, or 2 to 3 hours in the fridge. If marinating longer, let the fish come to room temperature 30 minutes before frying."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide, heavy-bottomed pot large enough to submerge your fish, pour in enough oil to reach a depth of at least 2 inches. Heat over high until oil is simmering and reaches 350 degrees on a candy thermometer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with paper towels and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the oil comes to temperature, pick the marinated fish up by the tail, shake off excess marinade, and lower it head-first into simmering oil. Use a pair of tongs to gently nudge the fish to prevent it from sticking to the pot. It’ll be very active at first, so have a splatter shield handy, if you’ve got one."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a heat-safe ladle, baste any unsubmerged fish with hot oil repeatedly, ensuring fish cooks evenly. Fry until it turns golden brown, 5 to 10 minutes, watching carefully and removing immediately if it starts to get dark."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an extra-long fish spatula, or a set of heatproof tongs and a heatproof spatula, carefully lift the fish out of the oil and transfer it to the lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let rest for 2 to 3 minutes. Garnish with lime wedges, hot sauce and cilantro."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021997-pescado-frito-fried-red-snapper"}