{"@context": "http://schema.org", "@type": "Recipe", "name": "Café China’s Dan Dan Noodles", "description": "Also known as dan dan mian, these noodles have regional variations — you’re likely to find a peanut-laden, vegetarian version in Taiwan — but this recipe comes from Café China, a beloved Sichuan restaurant in New York City. Popularized in Chengdu, this dish takes its name from the Mandarin verb “dan,” which refers to how vendors once carried the ingredients, hanging from bamboo poles balanced on their shoulders. The dish builds on a complex chile sauce that is more rich and robust than fiery. Though the ingredient list is lengthy, the process is clear-cut: Get the water boiling for your noodles while you prepare the sauce. Sauté the pork, seasoned with suimiyacai (preserved mustard greens), boil your noodles, and dinner is served.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2020/09/30/dining/aw-dan-dan-noodles/merlin_170424111_2e580314-5552-4075-b5ce-2fab7e2a221d-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "asian, chinese", "recipeCategory": "dinner, quick, weeknight, meat, noodles, main course, side dish", "keywords": "ginger, ground pork, scallion, soy sauce, star anise", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 843}, "recipeIngredient": ["1/2 cup canola or vegetable oil", "1 (2-inch) piece fresh ginger, peeled and finely chopped (about 2 tablespoons)", "3 whole star anise", "4 teaspoons red-pepper flakes", "2 teaspoons ground chile, such as cayenne", "2 teaspoons fennel seeds", "8 whole cloves", "1/4 teaspoon ground cinnamon", "1 tablespoon canola or vegetable oil", "3/4 pound ground pork", "1/3 packed cup suimiyacai (Sichuan preserved mustard greens; see Tip)", "2 tablespoons mushroom-flavored dark soy sauce (or regular soy sauce)", "4 teaspoons Chinese sesame paste or tahini, whisked to combine", "4 teaspoons Maggi seasoning, or use soy sauce", "6 ounces snow pea shoots", "16 ounces fresh Shanghai-style wheat noodles, or other fresh noodles", "Thinly sliced scallion greens, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to boil for the noodles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chile oil: In a medium skillet, heat the 1/2 cup oil over high. Add the ginger, star anise, red-pepper flakes, ground chile, fennel seeds, cloves and cinnamon to a medium heatproof bowl. Once the oil is shimmering, about 3 to 5 minutes, pour it over the spices. (The mixture will bubble vigorously.) Set aside for 10 minutes. Strain the mixture through a fine-mesh sieve, pressing to extract as much seasoned oil as possible. Makes 1/3 cup chile oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pork: In a wok or nonstick skillet, heat 1 tablespoon canola or vegetable oil over high. Add the pork and cook, breaking it up the pork and stirring constantly with a wooden spoon, until browned and cooked through, about 4 minutes. Add the suimiyacai and stir quickly until just combined. Set aside. (The goal here is simply to integrate the mustard greens; there is no need to cook them.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once chile oil has cooled, whisk in the soy sauce, sesame paste and Maggi seasoning. Set out four individual serving bowls, and add 2 tablespoons of chile sauce to each."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the water boils, add the snow pea shoots to blanch just until wilted, about 1 minute, then use a slotted spoon to transfer them to a bowl. Add noodles to the boiling water and cook until just softened and tender, about 4 minutes. Drain and rinse under cold water just to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, divide the noodles and pea shoots among the bowls. (It’s OK if the noodles are dripping some water; a little extra moisture is ideal so the noodles remain glossy but not sticky.) Top each with pork mixture, sprinkle with sliced scallions and serve immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the noodles to coat with chile sauce before eating, and serve with additional sauce at the table."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021499-cafe-chinas-dan-dan-noodles"}