{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramelized Corn and Asparagus Pasta With Ricotta", "description": "This summery pasta features caramelized corn, crisp-tender asparagus and earthy turmeric, which provides the dish’s sunny hue. It’s not easy to cook corn to the point of browning without losing all its moisture, but a pinch of sugar helps speed up the caramelization process. Vermouth lends acidity to the light, glossy garlicky sauce, but you could use wine, or even a tablespoon of lemon juice or champagne vinegar for lift. Fresh ricotta provides richness.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2020/06/10/dining/aw-corn-pasta/aw-corn-pasta-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, pastas, vegetables, main course", "keywords": "asparagus, butter, corn, garlic, lemon, ricotta, scallion, spaghetti, sugar, turmeric, vermouth, fall, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1393}, "recipeIngredient": ["Kosher salt and black pepper", "3 ears of corn, husked", "1 pound spaghetti, linguine or any shaped pasta", "1/4 cup olive oil, plus more for drizzling ", "1/4 teaspoon granulated sugar", "16 medium stalks asparagus (about 8 ounces), trimmed and thinly sliced on an angle (about 2 cups)", "3 scallions, trimmed and minced, or 1 small shallot, minced", "2 teaspoons ground turmeric", "6 tablespoons unsalted butter", "3 garlic cloves, minced", "1/3 cup vermouth or white wine", "1 cup fresh ricotta, seasoned to taste with salt", "1 lemon (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil over high. Meanwhile, prepare the corn: Slice the corn kernels off the cobs, and add the cobs to the pot of water. (This lends a hint of sweetness.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the water comes to a boil, add the pasta and cook over medium-high, according to package instructions, until tender but toothsome, just shy of al dente."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, deep skillet, heat the oil over medium-high. Add the corn kernels and sugar, season with salt and pepper, and cook, stirring occasionally, until they begin to caramelize, about 6 minutes. Stir in the asparagus, scallions and 1 teaspoon turmeric, and cook, stirring frequently, until just softened and corn is caramelized, 2 to 3 minutes. Transfer to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the pasta is just short of al dente, reserve 1 1/2 cups pasta water, then drain the pasta, and discard the corn cobs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter, garlic and remaining turmeric to the large skillet and cook over medium until butter melts and starts to foam, about 3 minutes. Whisk in vermouth to deglaze, and cook 1 to 2 minutes, then whisk in 1 cup pasta water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta, and toss with tongs over medium heat until thoroughly coated and al dente, 1 to 2 minutes, adding  pasta water as needed. Remove from heat, stir in half the corn mixture and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide pasta among plates. Dollop with ricotta and top with remaining corn mixture. Drizzle with olive oil. If using lemon, shower the pasta with lemon zest, then cut the lemon into quarters, for squeezing on top, and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021161-caramelized-corn-and-asparagus-pasta-with-ricotta"}