{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin Cheesecake", "description": "This dessert delivers all the warm spices of pumpkin pie along with the tangy creaminess of cheesecake. To help the filling come together easily, make sure your ingredients are at room temperature, and refrain from mixing on high, which will incorporate too much air, causing the cheesecake to rise, then fall. The cake is finished in the oven with the heat turned off; that gentle reduction in heat eliminates the need for a water bath and reduces the likelihood of cracks or a grainy texture.", "author": {"@type": "Person", "name": "Vallery Lomas"}, "image": "https://static01.nyt.com/images/2020/11/09/dining/ya-pumpkin-cheesecake/ya-pumpkin-cheesecake-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "One 9-inch cheesecake", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "cheesecake, cream cheese, graham cracker crumbs, plan-ahead, pumpkin purée, pumpkin spice, christmas, thanksgiving, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 979}, "recipeIngredient": ["Nonstick cooking spray", "2 cups/235 grams finely crushed graham cracker crumbs (from about 15 whole crackers)", "1/4 cup/50 grams granulated sugar", "1/2 cup/115 grams unsalted butter (1 stick), melted", "Dash of kosher salt", "3 (8-ounce/225-gram) packages full-fat cream cheese (not whipped), at room temperature", "1 1/4 cups/250 grams granulated sugar", "3 tablespoons all-purpose flour", "2 teaspoons ground cinnamon", "1 teaspoon ground ginger", "1/2 teaspoon ground nutmeg", "1/4 teaspoon ground cloves", "1/2 teaspoon kosher salt", "1 cup/240 grams canned pumpkin purée", "2 teaspoons vanilla extract", "4 large eggs plus 1 large egg yolk, at room temperature", "1 cup/240 milliliters heavy cream, cold", "2 tablespoons confectioners’ sugar", "1/2 teaspoon vanilla extract", "1/4 teaspoon ground cinnamon", "Fresh nutmeg, for grating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the crust: Heat oven to 350 degrees. Coat a 9-inch springform pan with nonstick cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the graham cracker crumbs, sugar, melted butter and dash of salt in a large bowl; stir until all crumbs are moistened. (If making the crumbs from whole crackers, use a food processor to pulse the crackers to a fine consistency, then add the sugar, melted butter and salt, and pulse again to combine.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the crumb mixture to the springform pan and use the bottom of a measuring cup to press it in an even layer and up the edges of the pan by about 1 inch. Bake until the crust is set, about 10 minutes. Remove from the oven and transfer to a cooling rack. Reduce oven temperature to 300 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the crust cools, make the filling: In the bowl of a stand mixer fitted with the paddle attachment, or in a large bowl using an electric mixer, combine the cream cheese and sugar. Beat on low until smooth and combined, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the flour, cinnamon, ginger, nutmeg, cloves and salt. Continuing to mix on low speed, add the spice mixture, pumpkin purée and vanilla to the filling. Mix until smooth, about 1 minute, using a rubber spatula to scrape the bottom and sides of the bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the mixer speed to medium-low. Add the eggs and egg yolk, one at a time, beating until mostly mixed in before adding the next. Be careful not to overmix!"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease the sides of the springform pan again with cooking spray. Pour the filling into the pan and smooth the top with a rubber spatula. Gently tap the bottom of the pan against the counter to release any air bubbles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake on the middle rack at 300 degrees for 1 hour, or until the sides of the cheesecake are set and the middle jiggles slightly when shaken. To keep from overbaking, look for a 2- to 3-inch round in the center of the cheesecake to jiggle. Try not to open the oven door more than absolutely necessary to check the doneness! The change in temperature can cause the cheesecake to crack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the oven off and keep the oven door shut. Keep the cheesecake in the warm oven with the door closed for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cheesecake from the oven and carefully run an offset spatula or butter knife along the edge of the pan to loosen. Allow the cheesecake to sit at room temperature on a wire rack until no longer warm, about 1 hour. Transfer the cheesecake to the refrigerator and let rest until completely chilled, about 4 hours or until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve as is, or make the optional whipped cream: Combine the heavy cream, confectioners’ sugar, vanilla and cinnamon in a large bowl and whisk with an electric mixer until soft peaks form. Serve each slice of cheesecake with the cinnamon whipped cream, if using, and a grating of nutmeg, if desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021631-pumpkin-cheesecake"}