{"@context": "http://schema.org", "@type": "Recipe", "name": "Flourless Beet Brownies", "description": "Despite being flourless, these beet brownies bridge the gap between fudgy and cakey, offering the best of both worlds. Raw beets make the brownies dense and moist, helping them stay luscious and soft long after they’ve finished baking. Though the beets bring their own natural sweetness, pulsing the chopped raw beets in a food processor with some additional granulated sugar breaks down the hard root into a vibrant red base. In fact, the food processor does most of the work in this recipe. Baked until just cooked through, the resulting brownies are rich, subtly sweet and deeply chocolatey. If you prefer your brownies a little sweeter, sub the bittersweet chocolate baking chips for semi-sweet baking chips. You can top them with a little flaky sea salt out of the oven. Serve them warm with ice cream for dessert or at room temperature with a cup of coffee in the morning.", "author": {"@type": "Person", "name": "Jerrelle Guy"}, "image": "https://static01.nyt.com/images/2021/02/09/dining/jg-beet-brownies/jg-beet-brownies-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "9 brownies", "recipeCuisine": "american", "recipeCategory": "snack, dessert", "keywords": "beet, brownie, chocolate chips, cocoa powder, olive oil, vanilla, christmas, new year’s day, super bowl, valentine’s day, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 512}, "recipeIngredient": ["2 tablespoons olive oil, plus more for greasing", "1 cup/70 grams unsweetened regular or Dutch-process cocoa powder", "1 teaspoon baking soda", "1 medium red beet (about 1/4 pound), peeled and cut into 1/2-inch pieces", "1/2 cup/100 grams granulated sugar", "2 teaspoons vanilla extract (optional)", "1 cup plus 3 tablespoons/7 ounces bittersweet or dark (60 percent cacao) baking chocolate chips", "2 large eggs", "Flaky sea salt, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Lightly grease an 8-by-8-inch baking pan with olive oil and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk the cocoa powder and baking soda together. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chopped beets, sugar and vanilla, if using, to the bowl of a food processor, and pulse until the beets are just puréed but before they begin to liquefy, scraping down the sides of the bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small microwave-safe bowl, add 1 cup/6 ounces chocolate chips and the remaining 2 tablespoons olive oil. Heat in the microwave in 15-second intervals, stirring between each round, until the chocolate is almost completely melted, up to 75 seconds total. Remove the chocolate from the microwave, stir until completely smooth, then immediately add it to the food processor. Blend it with the beets on high until smooth. Add the eggs, blend to incorporate, then add the dry ingredients and blend until just combined, stopping to scrape down the sides of the bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the blade, and using a rubber spatula, scrape the brownie batter into the prepared pan, then smooth it into an even layer. Sprinkle the remaining 3 tablespoons/1 ounce chocolate chips on top and bake until the brownies have puffed and set on top but are still a little fudgy when a toothpick is inserted inside, about 25 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the brownies from the oven and allow to cool for at least 30 minutes before cutting into squares and topping with flaky sea salt."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021604-flourless-beet-brownies"}