{"@context": "http://schema.org", "@type": "Recipe", "name": "Berry Hand Pies", "description": "These hand-held pies are sold at breakfast time at Back in the Day Bakery in Savannah, Ga., but they are also a perfect summery dessert. Cheryl Day, an owner, said that she uses less sugar than many Southern bakers do, and likes to round out the flavor of sweet summer fruit with salt and lemon. The difference between a hand pie and a turnover is in the shape. (Hand pies are half moons, and turnovers are triangles.) You can make this recipe either way.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2020/07/22/dining/22Bakers-Fresh-Fruit-Turnover-a/merlin_174522378_f943804d-5fbb-4c24-97b4-9690e7a34bae-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "8 hand pies", "recipeCuisine": "american", "recipeCategory": "snack, finger foods, pastries, pies and tarts", "keywords": "berries, blueberries, cornstarch, egg, lemon, strawberries, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 263}, "recipeIngredient": ["All-purpose flour, for dusting", "1 recipe <a href=\"https://cooking.nytimes.com/recipes/1021241\">Extra-Flaky Pie Crust</a>", "2 large eggs, lightly beaten with a pinch of fine sea salt, for egg wash", "2 cups mixed fresh berries (about 12 ounces/350 grams), such as sliced strawberries or whole blackberries or blueberries", "1/2 cup/100 grams granulated sugar", "2 tablespoons cornstarch", "1 teaspoon freshly grated lemon zest plus 4 teaspoons fresh lemon juice", "1/4 teaspoon fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: On a floured surface, roll out each disk of dough into a 10-inch square, each about 1/8-inch thick. Using a 5-inch round cookie cutter, cut out 4 disks from each piece of dough. Transfer disks to a baking sheet (it’s OK if they overlap slightly), cover and refrigerate until firm, at least 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the berry filling: In a medium bowl, combine the berries, sugar, cornstarch, lemon zest and juice, and sea salt. Stir gently until evenly coated, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the disks from the refrigerator and lightly brush the edges of each disk with the egg wash. Spoon about 1/4 cup berry filling onto each disk, leaving a 1-inch border around the rim. (You might have some extra filling.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one disk at a time, leaving one half of the dough on the baking sheet, gently fold the other half of each round of dough over the filling to make a half circle and press the edges together with your fingers to seal. If any of the filling is oozing out of the sides, remove a few berries at a time until the hand pie seals easily. Using a fork, crimp the rounded edge of each hand pie. Repeat with remaining disks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the hand pies with plastic wrap and refrigerate for 1 hour to set the crusts. Refrigerate the remaining egg wash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to bake, position a rack in the middle of the oven and heat the oven to 425 degrees. Line another baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the hand pies from the refrigerator and brush the tops with the remaining egg wash. Using a paring knife, cut 3 small slits in the top of each hand pie to create steam vents. Transfer the hand pies to the lined baking sheet. Bake for 20 to 25 minutes, until the hand pies are golden and the filling is bubbly. Let cool for 10 minutes, then serve warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The hand pies can be cooled completely and stored in an airtight container in the refrigerator for up to 3 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021240-berry-hand-pies"}