{"@context": "http://schema.org", "@type": "Recipe", "name": "Fatima’s Fingers (Tunisian Egg Rolls)", "description": "These deep-fried pastries, which are known as “doigts de fatima” in French, are named after the prophet Muhammad’s daughter and her delicate fingers. They are commonly eaten to break the fast during Ramadan, but are also enjoyed year round, especially at weddings. While this particular recipe is Tunisian, many North African and Middle Eastern countries have their own versions. They are typically made with thin, delicate malsouka pastry sheets, but spring roll wrappers are used here instead. The fillings are wide-ranging (you may find versions with tuna, shrimp, ground beef or vegetables) and flexible: Feel free to omit the chicken in this recipe for a tasty vegetarian snack.", "author": {"@type": "Person", "name": "Jamel Charouel"}, "image": "https://static01.nyt.com/images/2020/10/08/dining/jg-tunisian-chicken-roll/merlin_177922671_055cf300-eea2-406b-8aea-2188485ea667-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "african, middle eastern", "recipeCategory": "snack, finger foods, pastries, poultry, appetizer, side dish", "keywords": "chicken, chicken breast, lemon, mozzarella, potato, spring roll wrappers, turmeric, ramadan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 92}, "recipeIngredient": ["2 tablespoons olive oil", "1 boneless, skinless chicken breast (about 8 ounces), cut into 1/2-inch cubes", "1/2 small yellow onion, cut into 1/4-inch pieces", "1 garlic clove, minced", "1/2 teaspoon ras el hanout", "1/8 teaspoon ground turmeric", "1/4 teaspoon kosher salt", "1/4 teaspoon black pepper", "2 small white potatoes (about 6 ounces total), peeled and cut into 1/2-inch pieces", "2 eggs", "1 cup shredded mozzarella (about 4 ounces)", "2 tablespoons chopped fresh parsley", "12 square spring roll wrappers", "1 egg, beaten for egg wash", "About 2 cups vegetable or canola oil, for frying", "1 fresh lemon, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of water to a boil over high heat. Meanwhile, prepare the filling: Heat the olive oil in a large skillet over medium-high. Add the chicken and sauté until golden brown, about 4 minutes. Add the onion and garlic and sauté until the onion is translucent, about 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the ras el hanout, turmeric, salt and pepper to the pan and cook, stirring occasionally, for another 2 minutes. Transfer mixture to a large bowl and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the water comes to a boil, add the potatoes and cook until tender, 5 to 10 minutes. Using a slotted spoon, transfer potatoes to another bowl to cool. Let the water continue to boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the hard-boiled egg: Add 1 egg to the boiling water, reduce the heat to medium and let it cook for 10 minutes. Remove the hard-boiled egg from the water and let cool. Peel the egg and chop it into small pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the chicken mixture in the large bowl, add the cooled potatoes, chopped egg, mozzarella, parsley and the remaining 1 uncooked egg. Stir to combine the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the rolls: Working with one at a time, place one spring roll wrapper on a flat surface. Add a scant 1/4 cup of the chicken filling in the wrapper in one corner, arranging the filling a 4- to 5-inch log. Starting from the same corner, roll the wrapper twice around the filling. Fold in the sides and continue rolling toward the furthest corner. Brush egg wash on the last corner to seal, then roll until the parcel is fully sealed and forms a tight cylinder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vegetable oil to a medium saucepan and heat over medium-high until the oil reaches about 350 degrees. Working in batches, add about 3 rolls to the oil and cook, rotating frequently until golden brown and cooked through, 4 to 5 minutes. (If you prefer to avoid deep frying, you can bake the rolls on a rack-lined sheet pan at 375 degrees until golden brown, about 25 minutes, turning them halfway through.) Place cooked rolls on a paper towel for a few minutes to absorb oil before transferring to a serving platter. Serve warm with fresh lemon wedges to squeeze on top."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021493-fatimas-fingers-tunisian-egg-rolls"}