{"@context": "http://schema.org", "@type": "Recipe", "name": "Earlonne’s Chicken and Brown Rice", "description": "Layered with savory, satisfying flavors, this one-pan recipe was inspired by a dish Earlonne Woods regularly prepared for himself while incarcerated at San Quentin State Prison. Mr. Woods, a co-host of the popular Ear Hustle podcast, generally relied on kitchen connections to secure a raw chicken hindquarter. He’d boil it in a hot pot with whatever seasonings he had available, then use the resulting broth to rehydrate some instant brown rice. Offered as a cooking lesson to Mr. Woods, who is now an amateur home cook, this version instead relies on chicken legs browned in butter, a vibrant mix of spices and aromatics, and rich, homemade broth to pack in flavor. And just as the dish did when Mr. Woods served it, it may prompt your diner to compliment the meal: “You put your foot in it!”", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2021/01/10/magazine/10mag-eat/10mag-eat-articleLarge.jpg", "totalTime": "PT2H45M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, grains and rice, poultry, main course", "keywords": "brown rice, butter, celery, chicken, chicken legs, chicken stock, onion, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 493}, "recipeIngredient": ["4 whole chicken legs", "Fine sea salt and freshly ground black pepper", "1 1/2 cups long-grain brown rice", "1 tablespoon garlic powder", "1 tablespoon onion powder", "1 tablespoon ground coriander", "1 tablespoon smoked paprika", "1 teaspoon ground cayenne", "4 tablespoons unsalted butter (1/2 stick)", "2 medium yellow onions, thinly sliced", "2 celery ribs, thinly sliced", "3 1/2 cups chicken stock, preferably homemade", "2 fresh or dried bay leaves", "1 cup sour cream or Greek yogurt", "2 tablespoons finely chopped cilantro leaves and tender stems, plus more for garnish", "1/2 jalapeño, finely chopped", "1 garlic clove, finely grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the chicken generously with salt and pepper and leave it out at room temperature for at least 30 minutes or up to 1 hour. At the same time, add the brown rice to a bowl, cover with water and set aside to soak for at least 30 minutes or up to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack position to lower third and heat to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the spice mix: Add garlic powder, onion powder, coriander, paprika, cayenne, 1 tablespoon salt and 1 tablespoon pepper to a small jar or other lidded container and whisk to combine. Cover spice mix and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large (10- or 12-inch) cast-iron or other oven-safe skillet (preferably with a lid) over medium-high heat. Add 2 tablespoons butter and allow to melt. Working in batches if necessary to avoid crowding, carefully lay chicken legs in pan in a single layer, skin-side down, and cook until golden-brown, 4 to 6 minutes, then remove from pan and set aside on a plate, skin-side up. Meanwhile, drain the brown rice in a fine-mesh strainer, shaking to remove excess water; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onions and celery to pan along with a generous pinch of salt. Reduce heat to medium and cook until vegetables are tender and lightly golden, 12 to 14 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return heat to medium-high, add remaining 2 tablespoons butter and allow to melt, then add rice and 4 teaspoons prepared spice mix. Toast rice until golden, about 90 seconds, then add stock and bay leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a boil, then taste and adjust for salt — the stock should be a little saltier than you are comfortable with. Turn off flame, nestle chicken legs into the pan, skin-side up, and cover with a lid or foil. (If using foil, take care to create a tight seal to prevent steam from escaping.) Place onto prepared rack in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Check the pan after 15 minutes to make sure the liquid is at a steady simmer and adjust oven temperature as needed. Cook until rice absorbs the liquid and is tender and chicken is falling off the bone, about 80 to 90 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase oven temperature to 450 degrees and remove lid or foil from pan. Adjust rack position to upper third of oven, and place pan on rack. Cook for 8 to 10 minutes until chicken skin is deep golden brown. Remove from oven, and allow to cool for 5 minutes before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the meantime, prepare sauce: In a medium bowl, combine sour cream or yogurt, cilantro, jalapeño, garlic and 1/2 teaspoon salt. Stir, taste and adjust seasoning for salt. Serve with chicken and rice; garnish with cilantro."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and refrigerate leftover chicken, rice and sauce for up to 5 days. Cover and store remaining spice mix in a cool, dry place for up to 3 months."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021775-earlonnes-chicken-and-brown-rice"}