{"@context": "http://schema.org", "@type": "Recipe", "name": "Spring Onion and Cheese Potato Cake, Two Ways", "description": "This potato cake is a great recipe to build on when seeking to feed a hungry crowd resourcefully, pulling whatever cheese, vegetables or spices might need using up. Here, I’ve included two variations, one using frozen peas and thyme, and the other using jarred peppers and harissa. You can get as thrifty as you like by making use of what you have: frozen spinach instead of the peas, for example, or some shredded mozzarella to replace the Parmesan. The recipe is yours: Make what you want of it! Serve this potato cake warm with crème fraîche, a squeeze of lemon and a side salad, if you like.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2020/06/24/dining/22ottorex/22ottorex-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, vegetables, main course", "keywords": "cheddar, feta, heavy cream, olive oil, parmesan, potato, preserved lemon, spring onions", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 691}, "recipeIngredient": ["6 large red bliss potatoes (about 2 3/4 pounds/1 1/4 kilograms), scrubbed clean", "1/2 cup plus 2 tablespoons/150 milliliters olive oil", "16 spring onions or 2 large bunches scallions (about 7 ounces/200 grams), trimmed and thinly sliced (about 2 cups)", "6 garlic cloves, peeled and thinly sliced", "Kosher salt and black pepper", "2/3 cup/160 milliliters heavy cream", "3 large eggs plus 1 yolk, beaten", "3 ounces/85 grams Parmesan, finely grated", "3 tablespoons finely chopped preserved lemon or 1 tablespoon fresh lemon zest", "1 teaspoon ground turmeric", "5 ounces/140 grams mature Cheddar, roughly grated", "7 ounces/200 grams feta (preferably Greek), roughly crumbled", "1 cup/200 grams frozen peas, thawed", "1 tablespoon chopped fresh thyme leaves, plus a few extra sprigs to garnish", "1 (12-ounce) jar roasted red peppers, drained, patted dry and roughly chopped (about 8 ounces/250 grams)", "1/2 cup/20 grams roughly chopped fresh cilantro, plus 1 tablespoon for garnish", "3 tablespoons harissa paste or 1 teaspoon red-pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the potatoes to a large pot and top with enough water to cover by about 1 1/2 inches/4 centimeters. Bring to a boil over medium-high, then lower the heat to medium, cover with a lid and cook until easily pierced with a knife, about 30 minutes. Drain well. Once cool enough to handle, peel the potatoes (saving the skins for another use), and transfer them to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the potatoes are cooking, add half the olive oil to a large (12-inch/30-centimeter) cast-iron skillet or an ovenproof skillet that is at least about 3 inches/8 centimeters deep. Heat over medium. Once hot, add the spring onions and garlic and cook, stirring occasionally, until soft and lightly colored, about 6 minutes. If making with peas, add the peas and thyme; if making with peppers, add the peppers, cilantro and harissa. Add 1/2 teaspoon salt and plenty of pepper, stir to combine and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees Fahrenheit/230 degrees Celsius (non-fan)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cream, eggs and yolk, Parmesan, preserved lemon, turmeric, half the Cheddar and 1/2 teaspoon salt to the potatoes in the large bowl. Use a potato masher to break everything down to a rough mash that is still a bit lumpy. Add the feta and the spring onion mixture and fold everything together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe the skillet clean, add the remaining olive oil, then transfer the skillet to the oven for about 5 minutes to heat up. Remove from the oven and carefully add the potato mix. Level the top, sprinkle with the remaining Cheddar and a few sprigs of thyme, if using, in the center and return to the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the oven temperature to 400 degrees Fahrenheit/205 degrees Celsius and bake the cake until golden and bubbling, 25 to 30 minutes. Remove from the oven and set aside for 15 to 20 minutes to firm up before serving. Sprinkle with the extra cilantro, and serve warm, spooned directly from the pan."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021144-spring-onion-and-cheese-potato-cake-two-ways"}