{"@context": "http://schema.org", "@type": "Recipe", "name": "Suprême de Volaille Fermière à la Crème (Chicken Breast in Cream)", "description": "The author Bill Buford adapted this recipe, which he learned while working with the chef Mathieu Viannay at La Mère Brazier in Lyon, France. (Mr. Buford worked with the chef while researching his book “Dirt.”) If you just made a batch of chicken stock, there are few better things to do with it than poaching chicken breasts in it. You get two benefits: white meat that is about as moist and tender as possible, and stock that is stronger than when you started, particularly if you poach the entire bird and save the legs for another night. The goal is to keep the liquid well below boiling; it’s a stove-top approximation of the sous vide technique.", "author": {"@type": "Person", "name": "Pete Wells"}, "image": "https://static01.nyt.com/images/2020/07/22/dining/21Bufordrex1/merlin_173545848_0b8e6fc6-f1e2-489c-8b04-fbda3692b5f7-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "2 servings", "recipeCuisine": "french", "recipeCategory": "dinner, lunch, poultry, main course", "keywords": "chicken, chicken stock, dijon mustard, light cream, white port", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 93}, "recipeIngredient": ["1 whole large (4-pound) chicken, trussed, or legs tied with kitchen string", "2 quarts (8 cups) chicken stock", "1 tablespoon unsalted butter", "2 tablespoons all-purpose flour", "1 cup light cream", "1/2 teaspoon Dijon mustard", "2 tablespoons fresh lemon juice", "Salt and pepper, to taste", "1 tablespoon white port (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the chicken in a large, deep pot. Add the chicken stock, then add enough water to cover the chicken completely. Heat over high until the temperature of the cooking liquid reaches 160 degrees and is hot enough to steam. Cook the chicken until the inner thighs reach a temperature of 145 degrees, 30 to 40 minutes, monitoring the temperature and reducing the heat as needed throughout the cooking process to make sure the liquid stays under a simmer. Remove chicken from liquid and let rest until cool enough to handle, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While chicken rests, start the sauce: In a medium saucepan, whisk the butter and flour over low heat until the mixture melts into a thick, pale roux, 2 to 3 minutes. Slowly add 3 cups of the hot chicken stock to the roux, whisking constantly over low heat, until roux and the liquid are emulsified. Bring to a simmer and cook, whisking occasionally, until the mixture is reduced to 2 cups, about 15 minutes. (Let the remaining stock cool, then refrigerate or freeze for future use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, remove the legs (they will not be fully cooked) and set them aside for another use (see Note). Carefully remove the skin from the chicken breasts, then, starting with the pointed end of each breast, separate the breasts from the breastbone, with your thumb if possible (or your knife if necessary), gently moving your thumb down the center bone that separates the two breasts on each side. Using a knife, ensure that you remove the rest of the breast meat (including the filets) from the bone without tearing; remove and discard any membranes from the surface of each breast. (The meat nearest the bone might still be slightly uncooked, but it will cook through in Step 6.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the cream into the sauce in the saucepan, and continue to cook at a simmer until the sauce is thick enough to coat the back of a spoon and has reduced to about 2 1/2 cups, another 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in the mustard, then lemon juice. Season to taste with salt and pepper, then add the port, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the breasts to the sauce to reheat, basting them until fully cooked through, about 5 minutes. Transfer each breast to a warmed plate and slice thickly, if desired. Gently spoon the sauce over the breast to serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021177-supreme-de-volaille-fermiere-a-la-creme-chicken-breast-in-cream"}