{"@context": "http://schema.org", "@type": "Recipe", "name": "Eventide Fish Chowder", "description": "Clam chowder is the New England classic everyone knows, but fish chowder is also popular — and a lot easier to make. This recipe comes from Eventide, in Portland, Maine, a combination of a seafood shack, an oyster bar and a modern farm-to-table restaurant with Japanese influences. Dashi, the Japanese fish stock, has an oceanic taste that is perfect here, and the instant kind is easy to buy online and keep on hand.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2020/05/22/dining/jm-chowder/jm-chowder-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, seafood, soups and stews, appetizer, main course", "keywords": "cod, fish stock, nori, potato, scallops, seaweed, thyme", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 621}, "recipeIngredient": ["1 teaspoon black peppercorns", "1 pound boneless, skinless cod fillet, about 1-inch thick", "Kosher salt", "1 pound sea scallops (or use more cod, some hake or another firm fish)", "2 tablespoons unsalted butter", "1 medium white or yellow onion, diced into 1/4-inch cubes", "1 pound all-purpose potatoes, such as Yukon Gold, peeled and diced into 1/2-inch cubes", "1/4 pound bacon, sliced crosswise into 1/2-inch strips (optional)", "2 quarts fish stock or dashi (Japanese fish broth, such as Hondashi bonito soup stock)", "1 to 2 fresh thyme sprigs, or 1/4 teaspoon dried thyme", "1 cup heavy cream", "Toasted nori sheets or seaweed snacks, crumbled into very small pieces, or dried seaweed flakes (optional)", "Snipped chives or minced scallion greens, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pan over low heat, toast the peppercorns until fragrant, about 5 minutes. Coarsely grind and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim cod of any pin bones or bits of skin and cut into 1-inch cubes. Lightly salt the cubes all over and set aside on paper towels to drain. Rinse scallops very lightly under cold water. Cut into half-moons and set aside on paper towels to drain. Keep seafood refrigerated until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, melt butter over medium-high heat. When the butter is just sizzling, add onion and potatoes and cook, stirring, until the onions start to melt and the potatoes are gold at the edges, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, if using bacon, cook the strips in a hot skillet over medium-low heat, stirring occasionally, until nicely browned, about 5 minutes. Set aside on paper towels to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add stock, thyme and toasted peppercorns to pot and bring to a simmer. Reduce the heat and simmer for 3 to 5 minutes. The potatoes should not be cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in cream and heat through over low heat. Taste and adjust the seasonings with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, with the chowder simmering over low heat, stir in seafood and simmer until potatoes are soft and seafood is just cooked through, about 5 minutes. Stir in the bacon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the chowder into bowls. You want each serving to be around 2 parts broth to 1 part chunky goodness. Use your fingers to crush the nori into powdery bits, if using, and sprinkle over the top of each serving. Place about 1 teaspoon chives in the center of each bowl and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021074-eventide-fish-chowder"}