{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Cherry Upside-Down Cake", "description": "There’s a little black pepper in this cake, which provides just enough heat to enhance the sweetness of the cherries. If you’re worried about the pepper, cut back on the amount called for, but if you’re excited about it, you may want to double it. This is a sweet, rustic and rich upside-down cake that’s sturdy enough to hold up to its juicy fruit topping. Once the finished cake gets inverted onto a platter, the extra cherry juice soaks back into the cake as it cools, which means it gets better as it sits. Serve the cake with lemon whipped cream made by beating cold heavy cream with the leftover lemon juice and some sugar until stiff. It’s helpful for covering up any imperfections in the cake, too!", "author": {"@type": "Person", "name": "Jerrelle Guy"}, "image": "https://static01.nyt.com/images/2020/08/03/dining/jg-cherry-upside-down-cake/jg-cherry-upside-down-cake-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "", "recipeCuisine": "american", "recipeCategory": "snack, cakes, one pot, dessert", "keywords": "black pepper, cherries, lemon, pepper, sour cream, sugar, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 246}, "recipeIngredient": ["Yields One 9-inch cake", "1 pound/450 grams sweet cherries, halved and pitted (about 2 1/2 cups)", "1/4 packed cup/55 grams light brown sugar", "2 teaspoons lemon juice", "3/4 teaspoon kosher salt", "1/4 teaspoon coarse ground black or white pepper, plus more if you like", "8 tablespoons/115 grams unsalted butter (1 stick), melted and cooled to room temperature", "2 large eggs, whites and yolks separated", "3/4 cup/150 grams granulated sugar", "1/2 cup/120 milliliters sour cream", "1 teaspoon vanilla extract", "1/2 teaspoon baking soda", "1 3/4 cups/225 grams all-purpose flour", "1 cup/240 milliliters cold heavy whipping cream", "1 tablespoon lemon juice", "1 tablespoon granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. In a 9-inch cake pan (or cast-iron skillet), add the cherries, brown sugar, lemon juice, 1/4 teaspoon salt, the pepper, and 2 tablespoons melted butter; toss gently to combine. Place in the oven for up to 10 minutes to begin softening the cherries while you make the cake batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk the egg yolks, granulated sugar, sour cream, vanilla and baking soda with the remaining 6 tablespoons melted butter and 1/2 teaspoon salt until smooth. Sprinkle the flour over top then fold it in until evenly combined and a thick batter is formed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with a whisk attachment or in a medium mixing bowl with a handheld electric beater, beat the egg whites on medium-high speed for about 2 minutes or until stiff. Add 1/3 of the beaten egg whites to the cake batter and gently fold, then add the remaining egg whites and fold until fully incorporated, trying to keep as much air as possible in the whites."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the hot pan from the oven, shake it gently to toss the fruit a final time, then dollop the cake batter over the top, and gently spread it evenly to the edges. (It’s OK if some fruit juice or cherries pool over the edges of the batter.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for about 25 minutes, or until a toothpick inserted into the center comes out clean. Remove the cake from the oven, run a butter knife around the edges, and then allow it to rest for 10 minutes in the pan before inverting it onto a lipped platter to catch any juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the cake has cooled, make the lemon whipped cream, if desired: In the cleaned bowl of a stand mixer fitted with a whisk attachment or in a medium mixing bowl using a handheld beater, add the heavy cream, lemon juice and granulated sugar, and beat on medium speed for 30 seconds to thicken and combine, then turn the speed to high and beat until desired stiffness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the cake at room temperature, with lemon whipped cream, if using."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021265-sweet-cherry-upside-down-cake"}