{"@context": "http://schema.org", "@type": "Recipe", "name": "Superiority Burger’s Crispy Fried Tofu Sandwich", "description": "Ranging from silken and creamy to firm and chewy, tofu comes in many forms and is prized around the world for its <a href=\"https://cooking.nytimes.com/search?q=tofu\">versatility</a>. In this recipe, which is adapted from the “Superiority Burger Cookbook” (W.W. Norton & Company, 2018) by chef Brooks Headley, extra-firm tofu is pressed, marinated, breaded and fried, to make the “tofu-fried tofu” sandwich at Superiority Burger, his popular vegetarian restaurant in New York City. To achieve a dense tofu patty with plenty of flavor and bite, Mr. Headley starts with extra-firm tofu, presses out any excess liquid, then marinates it in a spicy pickle juice brine. It’s then double-battered and deep-fried until crisp. This sandwich is best enjoyed on a sunlit stoop in the East Village, just steps outside Superiority Burger, but it’s also achievable in any home kitchen.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2020/07/09/dining/aw-tofu-sandwich/aw-tofu-sandwich-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 sandwiches", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, sandwiches, main course", "keywords": "all-purpose flour, dijon mustard, extra-firm tofu, gochugaru, plan-ahead, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 3945}, "recipeIngredient": ["1 (14-ounce) package extra-firm tofu, drained", "1 1/2 cups pickle juice", "1 tablespoon hot sauce", "1 tablespoon Dijon mustard", "1 teaspoon gochugaru or red-pepper flakes", "2 tablespoons grapeseed oil or other neutral oil", "1/2 cup Dijon mustard", "2 cups all-purpose flour", "1/2 teaspoon baking powder", "1 teaspoon smoked paprika", "1/2 teaspoon onion powder", "1/2 teaspoon garlic powder", "1/2 teaspoon ground cayenne", "1 teaspoon kosher salt, plus more as needed", "1 teaspoon black pepper", "Grapeseed oil or other neutral oil, for frying", "6 potato buns or other soft rolls", "Vegan mayonnaise and hot sauce, as needed", "Thinly shredded green cabbage and dill pickles, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the marinated tofu: Line a baking sheet with paper towels or a clean kitchen towel. Cut the tofu crosswise into two rectangles that are each about 2 1/2 inches wide and 4 inches long. Slice each rectangle into three 1/2-inch thick slabs and arrange in a single layer on the baking sheet. Cover the sliced tofu with more towels and gently press each piece to extract some of the moisture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the pickle juice, hot sauce, mustard and gochugaru."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the grapeseed oil in a large nonstick or cast-iron skillet over high heat until shimmering. Sear the tofu to form a golden-brown crust, 4 to 5 minutes per side. Immediately drop the hot tofu into the pickle juice mixture. Refrigerate and let the tofu marinate for at least a few hours, or even overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the fried tofu: In a medium shallow bowl, stir the mustard with 1/4 cup water until it’s the consistency of heavy cream and set aside. In a large shallow bowl, whisk together the flour, baking powder, spices, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a Dutch oven or sturdy pot, heat 2 inches of grapeseed oil over medium heat and set a wire rack on top of a baking sheet. Remove the tofu from the brine and pat dry. Dip the tofu in the mustard mixture, turning until coated all over, then the flour mixture; dip it again in the mustard then flour until twice coated. When the oil temperature reaches 350 degrees, carefully place the battered tofu into the hot oil and fry, flipping as needed, until golden brown, about 5 minutes. Transfer the fried tofu to the wire rack and sprinkle with a little salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, toast the buns and spread generously with mayo and dot with hot sauce, if desired. Top with fried tofu, cabbage and dill pickles, and eat immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021237-superiority-burgers-crispy-fried-tofu-sandwich"}