{"@context": "http://schema.org", "@type": "Recipe", "name": "Amu’s Chicken Korma", "description": "This Bangladeshi-style chicken korma, named for my mother, Amu, is gently spiced and enriched with yogurt instead of cream or nuts, resulting in a light and bright sauce. This style of braising adds very little liquid, allowing the chicken to stew in its own juices. For full flavor, cook the korma until the fat breaks out of the sauce and pools on the surface. Keep it traditional and serve with paratha or rice, or pull the meat off the bones and pile between mayo-slathered white bread to make a chicken korma sandwich — and, of course, cut on a diagonal.", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "image": "https://static01.nyt.com/images/2020/09/11/dining/sew-korma/merlin_176822808_0502d943-6e09-4485-8d57-9f2a797e294c-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry, main course", "keywords": "bay leaves, cardamom, chicken, chiles, cinnamon, coriander, ginger, onion, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 966}, "recipeIngredient": ["1 large onion, peeled, plus more for serving", "1 (2-inch) piece ginger, peeled and thinly sliced", "4 garlic cloves, smashed and peeled", "1/3 cup whole-milk plain or Greek-style yogurt, plus more for serving", "2 teaspoons kosher salt, plus more to taste", "1 (4-pound) chicken, cut into 10 pieces, skin removed, or 3 pounds bone-in chicken parts, skin removed", "1/4 cup ghee or neutral oil", "1 tablespoon ground coriander", "1 bay leaf", "1 (3-inch) cinnamon stick, snapped in half", "3 green cardamom pods, cracked", "3 small green chiles, stemmed, plus more for serving", "White bread, mayonnaise, paratha or steamed rice, for serving", "<a href=\"https://cooking.nytimes.com/recipes/1014916-cucumber-and-tomato-salad-with-cilantro-and-mint\">Cucumber-Tomato Salad</a>, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut onion in half, trim off the root, and thinly slice one half from root to stem. Set aside. Roughly chop the remaining onion half and purée in a blender, adding as little water as needed to blend until smooth. Pour into a small bowl. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same blender (no need to wash it out), purée ginger, garlic, yogurt and kosher salt, adding as little water as needed to blend until smooth. Pour into a large bowl. Set aside. Pat chicken dry with paper towels, add to bowl with yogurt purée and toss with your hands to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium Dutch oven, pot or karahi over medium-high heat, add ghee and reserved sliced onions, and cook, stirring often, until crisp and deeply browned, about 10 to 12 minutes. (The onions will continue to brown after removing from heat, so scoop them out of the pot when they are a shade lighter than the desired final color.) Leaving behind the fat, transfer to a plate with a slotted spoon, and spread them out so they cool down quickly and don’t clump together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion purée, coriander, bay leaf, cinnamon stick, cardamom pods and a big pinch of kosher salt to remaining ghee and cook over medium-high heat, stirring frequently, until deeply browned and aromatic, about 10 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chicken, scraping in all the yogurt marinade, and stir to coat in onion paste. Reduce heat to medium-low, cover and simmer until the chicken releases its liquid, about 10 minutes. Partly cover, and cook, stirring occasionally, until the chicken is falling off the bone, the sauce is thick and creamy, and the fat breaks out of the sauce, about 30 to 35 minutes. (You want it to be saucy but thick. Add water a splash as a time, if needed, while cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add green chiles, three-fourths of the reserved frizzled onions and more kosher salt to taste. Gently stir to combine. Cook until fragrant, 2 to 3 minutes. Top with remaining frizzled onions, and serve with paratha, rice, or as a sandwich by pulling the meat off the bone, dressing in the korma sauce, and placing between mayonnaise-slathered sliced of untoasted bread. Serve with <a href=\"https://cooking.nytimes.com/recipes/1014916-cucumber-and-tomato-salad-with-cilantro-and-mint\">Cucumber-Tomato Salad</a> or additional raw onion, green chile and yogurt. Leftovers can be stored in the refrigerator for up to 3 days. Reheat in the microwave or on the stovetop over medium-low heat with a splash of water."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021424-amus-chicken-korma"}