{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Lamb With Squash and Brandied Fruit", "description": "Lamb shanks, braised until tender, are coated in a rich sauce of tomatoes, caramelized shallots and brandied dried fruit. The squash roasts as the lamb cooks, which is a time-saving perk, and its sweet custardy flesh rounds out the meal. Bone-in lamb shanks are ideal, but a similar weight of boneless leg of lamb will work just as well. Potatoes, carrots and parsnips will do well in place of the squash. Serve over steamed rice or couscous or with thick slices of crusty bread to mop up the sauce.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2020/11/19/dining/yk-lamb-with-brandied-fruit/merlin_180213342_c0e66312-9121-4316-a998-2aabd7b9f24c-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "meat, main course", "keywords": "butternut squash, lamb, sage, shallot, thyme, christmas, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 136}, "recipeIngredient": ["1 (3- to 4-pound) butternut squash", "5 tablespoons olive oil", "Kosher salt", "6 fresh thyme sprigs", "6 sage sprigs", "6 shallots (5 peeled and quartered, 1 minced)", "4 bone-in lamb shanks (about 3 1/2 to 4 pounds total)", "Black pepper", "4 garlic cloves, peeled and sliced", "1 (28-ounce) can whole peeled tomatoes", "2 cups beef or chicken stock or water", "1/2 cup brandied dried fruit", "1/4 cup fresh mint leaves", "Steamed rice, couscous or thick slices of sourdough, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the racks in the top and bottom thirds of the oven, and heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve the squash lengthwise, then scoop out the seeds and discard them. Rub the flesh of the squash with 1 tablespoon oil and season with salt. Place 3 sprigs each of thyme and sage on a small baking sheet. Place the cut side of the squash directly on top of the herbs. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons oil in a large Dutch oven over medium-high. Add the quartered shallots cut-side down and cook until golden brown, about 2 to 3 minutes per side, adjusting the heat as necessary to avoid scorching. Season with salt and transfer to a plate. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the lamb dry and season generously with salt and pepper. Heat the remaining 2 tablespoons olive oil in the pot over medium-high. Cook the lamb on both sides until browned, about 10 to 12 minutes. Work in batches if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the minced shallots and garlic to the pan, season with salt and stir to coat with the pan drippings. Add the whole peeled tomatoes and their juices, then add the stock or water and bring to a boil. Return the lamb shanks to the pot and add the remaining thyme and sage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the pot with a lid or a piece of foil and move the pot to the bottom rack of the oven. Place the squash on the top rack. Bake the squash until the flesh is tender and a thin knife can be easily inserted, about 75 to 90 minutes. Remove from the oven and cover with foil. Continue to cook the lamb until the meat is tender enough to pull with a fork, about 1 1/2 to 1 3/4 hours total."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop out the squash with a spoon and place on a serving plate, then transfer the lamb to the plate and cover to keep warm. Remove the braised tomatoes from the lamb cooking liquid and discard along with any excess fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the pot over medium heat and reduce the liquid to about 3/4 of its volume, about 5 minutes. Add the browned shallots and brandied fruit. Cook until shallots are tender and sauce is warmed through, about 5 to 6 minutes. Spoon the sauce over the lamb and squash and garnish with mint leaves. Serve with steamed rice, couscous or thick slices of a crusty sourdough loaf."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021679-braised-lamb-with-squash-and-brandied-fruit"}