{"@context": "http://schema.org", "@type": "Recipe", "name": "Salsa Tatemada Norteña (Fire-Roasted Salsa)", "description": "Every region of Mexico has its way of making a chunky, fire-roasted salsa, with the classic tomato, onion and chile trio; it goes by tatemada, if charred, or martajada, if mashed. With only three ingredients, regional variations taste radically different based on the chile of choice, which becomes the soul of the salsa, defining its personality. In the Yucatan, the feisty habanero rules, but in Mexico’s north (as well as Arizona and New Mexico), the king is Anaheim chile, whose crisp bite and mild, peppery taste embody this salsa tatemada norteña, a favorite for carne asada cookouts. The secret to making this salsa shine is to be generous with the salt; the charred juicy ingredients will appreciate it. Dip your chips in it, top your quesadillas with it or ladle it on sunny-side-up eggs sitting on refried beans for a northern style variation of huevos rancheros.", "author": {"@type": "Person", "name": "Pati Jinich"}, "image": "https://static01.nyt.com/images/2020/08/12/dining/10Carneasadarex3-salsa/merlin_175265259_f88b904d-4584-4203-8678-d9483d460d3e-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 2 cups (6 servings)", "recipeCuisine": "mexican", "recipeCategory": "condiments, appetizer, side dish", "keywords": "anaheim chiles, onion, tomato, summer, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 271}, "recipeIngredient": ["1 pound ripe Roma tomatoes", "1/2 pound whole, fresh Anaheim chiles (2 to 3 large chiles); see Note", "1/4 peeled large white onion (about 3 ounces)", "1 teaspoon kosher or sea salt, plus more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start a charcoal or prepare a gas grill. Once hot, place the whole tomatoes, chiles and onion on the grill. Let the ingredients char for about 12 to 15 minutes, flipping every 3 to 4 minutes. Pull them off the grill once cooked: The tomatoes should be completely mushy, as their skins start to break and their juices start to come out. The chiles should be wilted, charred and wrinkled. The onion should be darkened and softened. (Alternatively, ingredients can be charred under the broiler on an aluminum foil-covered baking sheet, or directly on a preheated comal or a cast-iron pan set over medium heat.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place charred chiles in a plastic bag, and close the bag well. Let chiles steam and sweat for 5 to 10 minutes. As soon as they have cooled enough to handle, remove them from the bag, slip off their skins, make a slit down the side of each and remove their seeds and stems. You could rinse the chiles under a thin stream of water, to help remove the seeds, or rinse them off by dipping them into a bowl of water. (Don’t remove or discard the skin, seeds or juices from the tomatoes and onion.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the charred tomatoes, onion and cleaned chiles on a chopping board, and finely chop. Place in a bowl, add salt, and mash and mix with a fork. (Alternatively, ingredients can be mashed in a molcajete.) Taste for salt and add more, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately, or cover and refrigerate for up to 5 days. The salsa can be eaten cold, though is best consumed lukewarm or hot. If desired, you can reheat it in a small saucepan until warmed."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021291-salsa-tatemada-nortena-fire-roasted-salsa"}