{"@context": "http://schema.org", "@type": "Recipe", "name": "Rhubarb Custard Bars", "description": "Imagine lemon bars, but made with a tangy rhubarb curd instead of citrus, and you’ll get a sense of this sweet-tart confection. The rhubarb curls on top make it pretty, but they don’t add much in terms of flavor, so feel free to skip Step 5. With their crisp crust and soft topping, the bars are at their absolute best when served within a day of baking. But you can store leftovers in the fridge for up to five days. They’ll get a little soggy, but the flavor will still be excellent.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/05/06/dining/01appetite-rhubarb/merlin_171960135_baba2429-ba96-47c8-9bb9-025c189d41fc-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "1 (9-inch) square pan", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 813}, "recipeIngredient": ["1 1/2 cups/190 grams all-purpose flour", "1/3 cup/65 grams granulated sugar", "1/4 teaspoon fine sea salt", "3/4 cup/170 grams cold unsalted butter (1 1/2 sticks), cut into 1-inch pieces", "10 ounces rhubarb, sliced (2 1/2 cups), plus 1 slender red stalk for the top", "1 1/4 cups/250 grams granulated sugar", "4 large eggs", "2 tablespoons freshly squeezed lemon juice (1 to 2 lemons)", "3 tablespoons all-purpose flour", "1 tablespoon finely grated orange or lemon zest", "Pinch of fine sea salt", "Confectioners’ sugar, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees and line a 9-by-9-inch pan with parchment paper, leaving two edges long so they overhang the pan by at least 1 inch. (This is for lifting the bars out later.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, pulse together flour, sugar and salt. Add butter and process until a crumbly dough forms. Press dough into the lined pan in an even layer. Don’t clean out the food processor, you’re going to need it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake crust until golden at the edges, 35 to 40 minutes, rotating halfway through. Transfer to a wire rack and raise oven temperature to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the crust is baking, make the filling. In a medium saucepan, combine the rhubarb slices and 1 cup sugar. Cook, stirring frequently, over medium-low heat until rhubarb releases its juices. Raise heat and bring to a simmer. Keep simmering, stirring once in a while, until the rhubarb breaks down completely, about 15 to 20 minutes. Transfer the rhubarb and juices to the food processor, and let it sit with the cover off until it cools down a bit, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, using a vegetable peeler, lay the very pink rhubarb stalk on its narrower side. From the edge of the stalk, peel a long strip from the stalk. Continue to peel strips from the stalk, flipping it around the other side to keep it even. (This makes it easier to peel, but don’t worry too much about getting uniform strips.) Line up peeled strips and cut into 1 1/2-inch lengths. Some may curl up, and that’s fine. You’ll have about 1 cup strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the food processor, add the eggs, remaining 1/4 cup sugar, lemon juice, flour, zest and salt, and pulse until mixture is puréed. Pour into baked shortbread base, and carefully scatter the rhubarb strips on top. It should look a little like confetti. Bake until the filling is set and puffy, 20 to 30 minutes. Transfer to a wire rack to cool completely in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cool, use a butter knife to cut at the edges of the crust to release them from the pan, then use the parchment “handles” to lift up and transfer the pastry to a cutting board. Cut into 1 3/4-inch squares. Dust with confectioners’ sugar before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021054-rhubarb-custard-bars"}