{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Pizza", "description": "This is a vegan spin on classic pizza margherita, adorned simply with tomato sauce and rounds of cashew “mozzarella” cheese. Right after you make the cheese, it will be smooth and spreadable — more like ricotta than mozzarella — but as it bakes, it will firm up, resulting in pockets of creaminess that hold their shape in a sea of tomato sauce. If you’re short on time, there are a couple ways to make the pizza come together more quickly: Use store-bought crust or dough (enough for 1 large or 2 smaller pizzas), or try one of the many shredded vegan mozzarella cheeses available in stores these days. You can use a heaping cup on each pizza.", "author": {"@type": "Person", "name": "Gena Hamshaw"}, "image": "https://static01.nyt.com/images/2020/04/20/dining/gh-vegan-pizza/merlin_171739674_697084cc-d19a-4d07-8983-5804a56204f2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, pizza and calzones, main course", "keywords": "cashew, flour, lemon juice, olive oil, sugar, tomato sauce, yeast, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 125}, "recipeIngredient": ["2 cups/255 grams all-purpose or 00 flour, plus more for dusting", "1 1/2 teaspoons kosher salt", "1 teaspoon granulated sugar", "1 teaspoon instant yeast", "3/4 cup lukewarm water (see Tip)", "Olive oil, for greasing the bowl", "1 heaping cup (about 5 ounces) raw cashews, soaked in water for at least 2 hours then drained", "1 teaspoon kosher salt", "1 tablespoon lemon juice", "Black pepper, to taste", "13 to 15 ounces pizza sauce or tomato sauce", "Fresh basil leaves (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pizza crust, whisk together the flour, salt, sugar and yeast in a mixing bowl. Add the water and use a spoon or your hands to mix everything into a shaggy dough ball. Cover the bowl with a damp dish towel and allow the dough to rest for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dough to a floured work surface and knead a few times. At this point, you can transfer the dough to the bowl of a stand mixer fitted with a dough hook and knead on medium-high for 5 minutes, or you can continue to knead by hand for 8 to 10 minutes. The dough is ready when it has a silky smooth surface and can be stretched without tearing easily."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dough to a bowl that’s been well coated with olive oil. Cover the bowl with a damp dish towel or plastic wrap. At this point, you can keep the dough covered in the refrigerator for up to two days. When you are ready to bake, allow the dough to rise in a warm part of your home for about 1 1/2 hours, or until it has doubled in size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cashew mozzarella, place the drained cashews into a food processor and pulse briefly until the cashews break down into a coarse meal. Scrape down the bowl of the processor and add salt and lemon juice. Continue processing the cashews as you drizzle 1/3 cup water into the processor’s spout. Process the cashews for 1 to 2 minutes, stopping once or twice to scrape the sides of the bowl. You’re aiming for a texture that’s slightly looser than hummus; add an extra tablespoon or two of water as needed. When the cashew mixture is creamy but easily spreadable, stop and season it to taste with black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 500 degrees. Place a pizza stone, baking steel or sheet pan turned upside-down in your oven and heat it to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oven is ready and your dough has doubled in size, divide your dough into two pieces and shape them into balls. Flour a work surface and a rolling pin. Roll each piece of dough into a 10-inch round."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer one round to a piece of floured parchment or a well-floured pizza peel. Spread a scant cup of the tomato or pizza sauce onto the dough. Add about 5 or 6 heaping tablespoons of the cashew mozzarella to the pizza. Use the back of your spoon to spread each dollop into a flat circle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use your pizza peel to transfer the pizza, or carefully transfer the parchment paper with the pizza on top, to your preheated pizza stone, baking steel or baking sheet. Bake each pizza for 10 minutes, or until the edges begin to brown. Top the pizza with basil leaves, if using, and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021008-vegan-pizza"}