{"@context": "http://schema.org", "@type": "Recipe", "name": "Cream Cheese Swirl Tart With Chocolate Crust", "description": "This eye-catching tart nods to a classic fruit-topped cheesecake, but is far easier to put together and starts with a cocoa-and-oat streusel press-in crust, instead of traditional graham crackers. Fruit preserves are folded into the tangy no-bake filling to create swirls. You can serve the tart immediately, or keep it in the refrigerator for up to 24 hours. Using a pan with a removable base allows you to unmold the tart and serve it on a platter, but you could also use a glass or ceramic pan and serve the dish directly from the pan. Serve alone, or top with fresh berries.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2020/05/06/dining/ejm-cream-cheese-streusel-tart/ejm-cream-cheese-streusel-tart-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "One 9-inch tart (8 to 12 servings)", "recipeCuisine": "", "recipeCategory": "pies and tarts, dessert", "keywords": "almond extract, brown sugar, butter, cocoa, confectioners' sugar, cream, cream cheese, flour, jam, oats, vanilla, christmas, mother’s day, valentine’s day, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 175}, "recipeIngredient": ["3/4 cup/95 grams all-purpose flour", "1/2 cup/40 grams old-fashioned oats", "1/4 cup/55 grams light brown sugar", "3 tablespoons unsweetened cocoa powder", "1/2 teaspoon fine sea salt", "1/4 teaspoon baking powder", "1/2 cup/115 grams cold unsalted butter (1 stick), cut into 1/2-inch/1-centimeter cubes", "6 ounces/170 grams cream cheese, at room temperature", "3/4 cup/90 grams confectioners’ sugar", "1 1/4 cups/300 milliliters cold heavy cream", "1 teaspoon vanilla extract", "1/4 teaspoon almond extract", "1/2 cup/120 milliliters jam or preserves (such as strawberry, raspberry, blackberry or cherry)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: In a medium bowl, stir the flour, oats, brown sugar, cocoa powder, salt and baking powder to combine. Add the butter to the bowl and mix with your hands (or a fork or pastry cutter) until the butter is incorporated and the mixture starts to look crumbly. (Try to work quickly, so the butter stays chilled.) Add 2 tablespoons cool water and mix until the mixture comes together to form large clumps. (It should hold together firmly when squeezed.) If the mixture looks dry, add more water, 1 tablespoon at a time, until it comes together. If it feels too soft, transfer to the refrigerator to firm up for a few minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your fingers, press the prepared streusel into the bottom and up the sides of a 9-inch tart pan with a removable base. Work your way around the edges of the tart pan, pressing firmly to make sure it is evenly thick. Break away any excess that pops over the edge of the pan so that it is relatively flush. Crumble the excess streusel into the base of the pan, and press it into an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the crust in the tart pan to the freezer while you heat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chilled crust to a baking sheet and bake until it appears set and dry to the touch in the center, 20 to 23 minutes. Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the crust cools, prepare the filling: In the bowl of an electric mixer fitted with the whip attachment (or if using a hand mixer, in a large bowl), whip the cream cheese and confectioners’ sugar on medium speed until light and fluffy, 2 to 3 minutes. Scrape down the sides of the bowl with a silicone spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer running on medium-low speed, gradually add the cream a little at a time, allowing each addition to incorporate before adding more. Continue to whip on medium-high speed until the mixture is thick and creamy, 3 to 4 minutes. Scrape down the sides of the bowl well. Add the vanilla and almond extract and whip until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pot, heat the jam until warm; this should loosen the mixture considerably. If the jam contains large pieces of fruit, you can use a fork or potato masher to crush them slightly, once the mixture is warm. Strain the jam through a fine-mesh sieve, pressing firmly to extract as much as possible. Discard any solids or seeds that remain in the strainer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle about 1/2 of the warm, strained jam over the cream cheese filling. (Don’t worry about adding the warm mixture to the cold filling; it will set up as it hits the cold mixture). Gently fold it a few times to loosely combine the two. Scoop the filling into the cooled crust and spread into a relatively even layer. Drizzle the remaining jam over the surface of the filling. Use a small offset spatula or the back of a small spoon to swoop across the filling back and forth a few times to lightly swirl the jam into the filling, leaving some large streaks of jam. (Note: If you mix too much, the two mixtures will combine and you’ll end up with a tinted filling rather than a streaky filling.) Serve immediately, or chill for up to 24 hours, loosely covered, before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To remove the tart from the pan, support the base with one hand and push upward to release it from the outer ring. If desired, run a small offset spatula around the bottom to help release the tart from the base and slide it onto a serving platter. (Alternately, you can leave the tart on its base and simply set on top of a serving platter.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021067-cream-cheese-swirl-tart-with-chocolate-crust"}