{"@context": "http://schema.org", "@type": "Recipe", "name": "Tuna-Salad Sandwich, Julia Child Style", "description": "This was one of Julia Child’s favorite dishes for a working lunch. For decades, Julia was on the road more than she was home and, when she returned to her beloved kitchen, she craved simple foods. For Julia, the important ingredients for this sandwich were the tuna (it had to be packed in oil) and the mayo (she preferred Hellmann’s). Her longtime assistant, Stephanie Hersh, said, “The rest was up for grabs.” Make it with capers, cornichons and chopped onion, a squirt of lemon juice and some herbs, serve it open-face on an English muffin or between slices of white bread, and you’ll have Julia’s midday signature.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2020/10/25/magazine/25mag-eat/25mag-eat-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "2 sandwiches", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, sandwiches, main course", "keywords": "bread, canned tuna, capers, celery, cornichons, mayonnaise, tuna salad", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1174}, "recipeIngredient": ["1 (5-ounce) can tuna packed in oil, drained", "3 to 4 tablespoons mayonnaise, preferably Hellmann’s, plus more for spreading", "3 tablespoons finely chopped celery", "2 to 3 tablespoons finely chopped onion, preferably Vidalia", "3 to 4 cornichons, finely chopped", "1 tablespoon capers, rinsed, patted dry and chopped if large, or 5 olives, pitted and chopped", "Fresh lemon juice", "Salt", "Freshly ground pepper, preferably white", "1 to 2 tablespoons minced fresh chives or parsley (optional)", "2 toasted English muffins (preferably Bays) or 4 untoasted white bread slices", "4 soft lettuce leaves, such as Boston", "4 tomato slices", "4 thin slices onion (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the tuna salad: Using a fork, mash the tuna with 3 tablespoons mayonnaise. Add the celery, as much onion and chopped cornichons as you’d like, and the capers or olives, and toss to combine. Add a squirt of lemon juice, some salt (go easy at first) and pepper. Taste and see if you'd like more mayo, onion or cornichons. Add more lemon juice, salt and pepper to taste. Stir in the chives or parsley, if you’re using either. (Makes 1 1/2 cups.) The tuna salad is good to go as soon as it’s made, but it’s even better after a couple of hours in the fridge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to serve, spread the muffins or bread with a little mayonnaise. If you’re using English muffins, do what Julia did: Make open-face sandwiches. Put a leaf of lettuce on each muffin half, top with tuna salad and finish with tomato and onion. If you’re using sliced bread, prepare traditional sandwiches: Top each of 2 slices of bread with 1 piece lettuce, tomato and onion, then spread over the tuna and finish with remaining onion, tomato, lettuce and bread."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021561-tuna-salad-sandwich-julia-child-style"}