{"@context": "http://schema.org", "@type": "Recipe", "name": "Shalom Japan’s Lox Bowl", "description": "The lox bowl at Shalom Japan, a Brooklyn restaurant created by chef-owners Sawako Okochi and Aaron Israel, shows how the combination of ingredients can tell a story. Lox, a Jewish-American staple, is set over a bed of sushi rice, inspired by Japanese chirashi bowls, in a meal that marries the cultures of both chefs. The dish combines lox, avocado and spicy mayo with crunchy cucumber, tangy pickles, sweetened kombu and fresh herbs, in a pile of salty, sweet and acidic umami. It takes some prep and quite a few ingredients, but you can pick and choose toppings to taste: “There aren’t too many rules, other than doing fish over rice,” Mr. Israel said. They cure their own salmon with parsley and dill, coriander and bonito flakes at Shalom Japan, but you can top your rice with store-bought gravlax, or even cooked salmon, tuna or scallops, before piling on your desired garnishes.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2020/06/26/dining/aw-lox-bowl/aw-lox-bowl-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "4 servings", "recipeCuisine": "japanese, jewish", "recipeCategory": "brunch, dinner, lunch, grains and rice, seafood, vegetables, main course", "keywords": "cilantro, lox, mirin, pickles, rice, salmon, seaweed, short grain rice, sriracha, dairy-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 281}, "recipeIngredient": ["3/4 cup rice wine vinegar", "1/4 cup granulated sugar", "3 tablespoons kosher salt", "1 (1-inch) square dried kombu (optional)", "1 large piece dried kombu (about 4-by-8 inches/20 grams)", "1/4 cup soy sauce", "1/4 cup mirin", "1/4 cup granulated sugar", "1/3 cup mayonnaise, preferably Kewpie brand", "1 teaspoon Sriracha", "1/2 teaspoon rice wine vinegar", "2 cups Japanese short-grain rice (about 14 ounces)", "8 to 12 ounces store-bought lox", "1 avocado, halved, peeled and thinly sliced", "1 small Japanese or Persian cucumber, halved lengthwise and thinly sliced", "1/4 cup assorted Japanese pickles (optional)", "2 tablespoons drained capers", "1 packed cup cilantro leaves and tender stems", "3 scallions, trimmed and thinly sliced on the bias", "Ikura (salmon roe), optional", "1/4 cup kizami nori (or sushi nori, cut into thin strips)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sushi zu: Combine the vinegar, sugar, salt and kombu (if using) in a pint-size plastic container. Stir to combine, put a lid on it, then let sit at room temperature before using. (The mixture mellows with time and is best prepared a few hours in advance.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sushi zu sits, prepare the sweet kombu: Add the kombu to a medium saucepan and cover with water by a couple of inches. Bring to a boil over high. Once the water comes to a boil, reduce the heat to medium and cook until the kombu is tender, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the chile mayo: In a small bowl, stir together the mayo, Sriracha and vinegar. Refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the kombu has simmered until tender, drain it, pat it dry, then cut it into very thin, 1-inch-long strips. Return the kombu to the saucepan. Add the soy sauce, mirin and sugar, and cook over medium heat until the sugar dissolves and the liquid reduces slightly, about 5 minutes. Let cool, transfer kombu and liquid to a lidded container, and store in the refrigerator for up to 1 month."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the rice: Place the rice in a medium bowl. Cover with several inches of cold water, swirl the rice vigorously using your hand, then pour off the cloudy water. Repeat two or three more times until the water still looks milky but is more transparent. Drain the rice and transfer to a medium pot with a tight-fitting lid. (A heavy-duty, enamel-coated cast-iron pot is ideal, because it distributes heat evenly.) Add 2 cups water, cover with the lid, and bring to a boil over high heat, which should take about 5 minutes. Once it boils, reduce the heat to low and cook for exactly 10 minutes. Turn the heat off, but do not remove the lid. Let sit, covered, for 10 minutes. (Alternately, you can cook the rice in a rice cooker according to manufacturer’s instructions.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the rice cooks, prep the garnishes and measure 6 tablespoons sushi zu. (Store the remaining sushi zu at room temperature for future use for up to 1 year.) As soon as the rice is cooked, dump it into a large mixing bowl and pour the 6 tablespoons sushi zu on top. Using a rice paddle or the back of a wooden spoon, gently break up the rice with a cutting and folding motion, delicately coating the grains with sushi zu."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the rice evenly among four shallow bowls and cover it with an even layer of lox. Using a squeeze bottle, piping bag or a spoon, drizzle the chile mayo over the lox."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the selected garnishes in clockwise clusters: First, the avocado, then the sweet kombu, followed by the cucumbers and pickles. Sprinkle the capers and cilantro around the rim, and place the scallions in the center. Set the ikura (if using) in a nice mound next to the scallions, and sprinkle the nori on top."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021207-shalom-japans-lox-bowl"}