{"@context": "http://schema.org", "@type": "Recipe", "name": "Mughlai Paratha", "description": "Mughlai paratha is a popular street food found in Bangladesh that traces back to the Mughal Empire. It’s a crisp, flaky, pan-fried flatbread that’s stuffed with fluffy eggs and fiery chiles, and gently spiced with earthy turmeric. Paratha is extremely customizable, so you can use what you have; this version is vegetarian, but <a href=\"https://cooking.nytimes.com/recipes/1020913-keema-spiced-ground-meat\">keema</a>, a spiced ground meat mixture, is often added. Vegetables like diced bell pepper or a handful of baby spinach are untraditional and welcome, but be mindful of the water content of the vegetables you choose or the eggs will weep. The end result is satisfyingly savory and addictive in its contrasting textures.", "author": {"@type": "Person", "name": "Fahima Haque"}, "image": "https://static01.nyt.com/images/2020/10/08/dining/fh-mughlai-paratha/merlin_177593343_8829b4e7-f3c2-478e-927d-e5ab263ae515-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 to 4 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, lunch, snack, breads, finger foods, pastries, quick breads, appetizer, main course, side dish", "keywords": "all-purpose flour, cilantro, egg, olive oil, onion, thai chili, turmeric, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 349}, "recipeIngredient": ["1 cup/130 grams all-purpose flour, plus more for dusting", "1/2 teaspoon kosher salt", "1/8 teaspoon baking powder", "3 to 4 teaspoons olive oil, ghee or melted butter", "1/4 cup cold water", "1 whole egg plus 1 yolk", "1/4 red, white or yellow onion, finely chopped (about 1/3 cup)", "3 tablespoons finely chopped fresh cilantro leaves", "2 to 3 Thai chiles (or 1 Fresno chile or 1 jalapeño to tone down the heat), finely chopped", "1/4 heaping teaspoon ground turmeric", "1/8 teaspoon kosher salt", "1/4 teaspoon black pepper", "1/4 cup neutral oil, such as canola or vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: In a medium bowl, combine the flour, salt and baking powder with 2 teaspoons olive oil. Whisk to combine. Form a well in the center of the flour mixture and add the water. Using a wooden spoon or rubber spatula, stir gently until the dough comes together. Transfer the dough to a lightly floured surface and knead for a few minutes until it forms a smooth ball. Rub the ball of dough in 1 to 2 teaspoons olive oil. Cover the dough loosely in plastic wrap or a damp kitchen towel and let rest at room temperature for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the dough rests, prepare the filling: In a medium bowl, combine the egg and egg yolk, onion, cilantro, chile, turmeric, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out dough on a lightly floured surface into a rough 12-by-12-inch square."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the filling in the center and spread in an even layer, leaving a 2-inch border on each side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently lift the left side of the dough toward the middle and fold it, bringing the left edge slightly to the right of the middle of the filling. Repeat on the right side, folding the right edge of the dough toward the middle of the filling, so both sides slightly overlap at the center. Reinforce the seams by gently pinching them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish sealing in the filling: Fold the top edge of the dough down toward the middle, just far enough to safely seal in the filling, about 2 inches down, then fold the bottom edge up to seal in the filling, about 2 inches up, gently pressing to seal. Your end result should look like a rectangle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry the paratha: In a large skillet, heat the neutral oil over medium-high. Place paratha in the skillet, seam-side up, carefully spooning the hot oil on top of the paratha to baste it, tilting the pan if need be. Fry until golden brown, about 5 minutes, then carefully flip the paratha over and baste and cook until golden, another 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot, ideally, or at room temperature, cut in half into two rectangular pieces."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021460-mughlai-paratha"}