{"@context": "http://schema.org", "@type": "Recipe", "name": "Banh Xeo", "description": "Banh xeo are Vietnamese rice pancakes filled with various vegetables and meats. Thin and crispy, the finished pancakes are cut into pieces, tucked into lettuce wraps, and finished with fragrant herbs and a spicy nuoc cham dipping sauce. This recipe features the classic shrimp and pork, using bacon for the hit of smoky flavor. If bean sprouts are unavailable, try finely shredded cabbage instead. The batter can be made two days ahead and stored in the refrigerator. When ready to use, bring it to room temperature and whisk until well blended, adding water if needed to thin the batter. (It should be slightly thicker than the texture of heavy cream.) Banh xeo are best eaten as they are made, but if you need to keep them warm while making all four pancakes, heat the oven to 200 degrees and set a rack over a baking sheet. As you make the pancakes, transfer them to the rack to keep warm.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2020/08/10/dining/kc-banh-xeo/merlin_175276515_31f8fd55-34e5-4835-9707-cb6a809c6841-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "vietnamese", "recipeCategory": "dinner, lunch, seafood, vegetables, main course", "keywords": "bacon, bean sprouts, coconut milk, fish sauce, herbs, rice flour, scallion, shrimp, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 254}, "recipeIngredient": ["1 cup stoneground white rice flour (about 140 grams), such as Bob’s Red Mill", "1 tablespoon cornstarch", "1 teaspoon kosher salt", "1/4 teaspoon ground turmeric", "1 1/2 cups boiling water", "1/4 cup plus 2 tablespoons unsweetened coconut milk", "1 cup thinly sliced scallions", "1/4 cup fresh lime juice (from 2 limes)", "3 tablespoons Asian fish sauce", "1 tablespoon turbinado sugar", "1 teaspoon minced garlic (about 2 cloves)", "1/2 teaspoon minced fresh chiles, such as Thai, serrano or jalapeño, or red-pepper flakes", "1/2 pound medium peeled and deveined shrimp, halved lengthwise", "3 slices bacon (about 3 ounces), chopped into 1-inch pieces", "Kosher salt", "2 cups bean sprouts (about 4 ounces)", "1/4 cup canola oil", "Lettuce leaves, such as green-leaf, red-leaf or butter lettuce", "1 cup mixed herbs (mint, basil and cilantro leaves)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the batter: In a small bowl, whisk flour, cornstarch, salt and turmeric. In another small bowl, combine boiling water with coconut milk, then slowly drizzle into dry mixture, whisking constantly until smooth. Cover bowl tightly with plastic wrap, and let stand at room temperature for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the dipping sauce: In a small bowl, combine all ingredients and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pancakes: Divide the shrimp and bacon into 4 equal portions and season with salt. Season bean sprouts separately with salt. In a large nonstick skillet, heat 1 tablespoon oil over medium. Add a single portion of shrimp and bacon and cook, stirring, until no longer raw, about 2 minutes. Spread shrimp and bacon in a single layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk scallions into batter until well blended. The batter should be slightly thicker than heavy cream. Add a little water, if needed. Pour 1/2 cup batter into skillet, distributing over and around the filling. Tilt pan to coat the bottom of the skillet. (Pancakes should be 8 to 9 inches wide.) Fill in holes with more batter, if necessary. Scatter 1/2 cup bean sprouts over the pancake, cover skillet and cook until sprouts soften, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover and cook over medium-low until pancake is golden and crispy underneath, about 3 minutes longer. Slide a spatula underneath the pancake and fold it in half to enclose the filling. Transfer pancake to a serving plate. Repeat with the remaining batter and fillings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve pancakes with lettuce leaves, herbs and nuoc cham. Using scissors, cut pancakes into small pieces. Lay out a lettuce leaf and fill with a piece of pancake. Top with herbs, wrap and dip into nuoc cham."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021267-banh-xeo"}