{"@context": "http://schema.org", "@type": "Recipe", "name": "Olive Oil Refried Beans", "description": "Use whatever variety of beans and chiles you’ve got in your pantry to make this recipe, which is inspired by the silky, lard-fried, pinto bean version available at nearly every Southern Californian taqueria. Eat these however you like, whether alongside rice and greens, smeared onto garlic-rubbed toast or spread onto a warm tortilla and with a perfectly fried egg on top. The overnight soak allows the time for both water and salt to penetrate the beans, cutting down the cooking time and leading to better seasoned, more evenly cooked beans. But if you’re short on time, you can skip the presoak; the beans will just take longer to cook through, and might not cook as evenly, which isn’t the end of the world if you’re mashing them up. You can also skip simmering altogether and use the drained, rinsed beans from two (15-ounce) cans and begin with Step 3.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2021/02/07/magazine/07mag-eat/07mag-eat-articleLarge.jpg", "totalTime": "PT11H30M", "recipeYield": "1 quart beans and 4 toasts", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, snack, beans, appetizer, main course, side dish", "keywords": "country bread, dried beans, garlic, olive oil", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 543}, "recipeIngredient": ["2 cups dried beans of any variety", "Fine sea salt", "A generous pinch of baking soda", "4 fresh or dried bay leaves", "10 garlic cloves, peeled", "1 small dried chile of any variety", "2/3 cup extra-virgin olive oil", "4 thick slices country-style bread, grilled or toasted", "1 garlic clove, peeled", "Calabrian chile paste, for garnish", "Small handful of fresh basil leaves, torn (optional)", "Freshly grated Parmesan (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The night before cooking, remove any debris from beans. Rinse them, then place them in a 4-quart Dutch oven or pot of similar size. Add 6 cups water, 1 teaspoon salt and the baking soda. Cover and set aside in a cool place for 8 to 12 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook, add bay leaves, garlic and chile to the beans and bring the pot, uncovered, to a boil. Taste the cooking water and adjust seasoning as needed; it should taste pleasantly salty. Reduce heat to a gentle simmer, partly cover with a lid and cook until beans are completely tender and just beginning to fall apart. Depending on the variety and age of your beans, this can take anywhere from 1 to 3 hours. Throughout the cooking time, monitor the pot to ensure the beans are always submerged, adding more water as needed. When you suspect the beans might be done, taste five of them. If they are not all creamy through to the center, keep on simmering. No one likes an underdone bean!"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To fry the beans, remove the bay leaves and chile from the bean pot. Discard the bay leaves, and mince the chile. Set a large cast-iron or similar frying pan over high heat, and add about half the oil. Add the minced chile. Use a slotted spoon or sieve to add beans and garlic — but not their cooking liquid — to the pan. Reduce heat to medium, and, with a potato masher or wooden spoon, stir and mash the beans into a silky paste, constantly stirring and scraping to keep them from sticking to the bottom of the pan. Add about 1/4 cup bean cooking liquid to loosen the mixture, then gradually add remaining oil. If the bean paste is too thick, continue adding cooking liquid as needed, being mindful that it is seasoned with salt. When the mixture is rich and velvety, taste, and adjust seasoning with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, lightly rub warm toasts with raw garlic, then slather with a generous amount of bean paste. Garnish with chile paste and, if desired, torn basil and a heap of grated Parmesan. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021847-olive-oil-refried-beans"}