{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Chicken With Apricots and Olives", "description": "This festive dish is a fairly easy main course for the Seder meal — or anytime. Marinating overnight leaves very little work on the day of serving, but two hours is enough to infuse the chicken with tangy citrus and the sumac. Dried apricots, already more tart than sweet, are marinated along with the chicken and become almost savory in the oven. Using pitted Castelvetrano olives will save you a lot of elbow grease, and their meaty texture and mild flavor are perfect here. After roasting together, everything goes under the broiler to deeply brown and thicken the cooking juices into a tasty sauce.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2021/03/17/dining/12Passoverrex1/merlin_184703202_ceadb25e-bc60-43bf-a895-a823f01a429d-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry, main course", "keywords": "apricot, blood orange, chicken, olives, shallot, sumac, passover", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 932}, "recipeIngredient": ["3 1/2 to 4 pounds bone-in chicken pieces (see Note)", "1 tablespoon kosher salt", "1 1/2 teaspoons freshly ground black pepper", "1/4 cup fresh lemon juice, plus 1 lemon, sliced and seeded", "1/4 cup fresh blood orange or regular orange juice", "1/4 cup honey", "4 to 6 garlic cloves, thinly sliced", "3/4 teaspoon dried thyme", "3 tablespoons ground sumac", "4 tablespoons olive oil", "1 cup (6 ounces) dried apricots", "1 cup (4 ounces) pitted Castelvetrano olives with 2 tablespoons brine", "4 large or 8 small shallots, roots trimmed, peeled and cut lengthwise into quarters or halves", "1/4 cup dry white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slash each piece of chicken through the skin a few times, about 1 inch deep. Season with the salt and pepper and place in a large bowl or large resealable plastic bag. Whisk lemon juice, orange juice, honey, garlic, thyme, sumac and 3 tablespoons olive oil in a bowl to combine. Add lemon slices, apricots, olives and olive brine. Pour the marinade over the chicken and cover tightly or remove as much air as possible before sealing it. Set on a small sheet pan and refrigerate for at least 2 hours and up to 24 hours, turning the bag from time to time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position a rack 8 inches from the broiler heat source. Place an oven rack in the lower third of the oven and heat oven to 450 degrees. Toss shallots with remaining tablespoon oil and spread out on a large sheet pan, cut sides down. Place on the lower rack and cook, turning once, until starting to turn golden, 10 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the oven and use your hands and a slotted spoon to scoop the chicken, apricots, lemon slices and olives onto the pan, reserving the marinade. Arrange in an even layer with the chicken skin side up and return to the oven. Cook for 15 minutes, baste the chicken with the drippings, and cook until chicken juices run clear, about 10 minutes longer. Remove the pan from the oven. Heat the broiler to high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the reserved marinade and wine over the chicken, and broil until the chicken is browned and the liquid is thickened, 3 to 5 minutes. If the apricots start to get too dark, turn them over in the sauce. Transfer to a platter. If you used chicken breasts, cut them in half. Pour the sauce over everything or serve it on the side."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021962-roast-chicken-with-apricots-and-olives"}