{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoky Eggplant Croquettes", "description": "By placing whole, unwashed, plain and naked globe eggplants directly onto the stovetop burner grate and letting them burn until charred, hissing and collapsed, you bring a haunting smokiness and profound silkiness to the interior flesh that will have you hooked for the rest of your life. This way of cooking eggplant is a revelation in itself — easy, yet exciting and engaging — and requires nothing more of the home cook than a little seasoning at the end to be enjoyed, as is. But biting into a warm, crisp, golden fried croquette with that smoky, silken purée at its center is what restaurant-level complexity and satisfaction is all about. One key ingredient, but 11 steps to prepare it — that about sums up the difference between home cooking and restaurant excitement.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2020/08/02/magazine/02mag-eat/02mag-eat-articleLarge.jpg", "totalTime": "PT9H30M", "recipeYield": "About 16 croquettes", "recipeCuisine": "american", "recipeCategory": "finger foods, vegetables, appetizer, side dish", "keywords": "eggplant, flour, garlic, lemon, olive oil, panko", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 522}, "recipeIngredient": ["2 large globe eggplants (about 2 1/2 pounds total)", "3 tablespoons extra-virgin olive oil", "4 garlic cloves, peeled", "Kosher salt", "1 cup all-purpose flour", "3 whole eggs, beaten with 1/4 cup water", "2 cups panko bread crumbs, ground as fine as freeze-dried instant milk, or plain fine bread crumbs", "Canola, grapeseed or other neutral oil, for stovetop shallow frying", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the whole eggplants directly on the burner grids of the stovetop, and turn the flames to high. Let each eggplant start to blister, and steam, and char, turning each one a quarter turn every 3 or 4 minutes, until softened and hissing inside, the skins utterly blackened and cracked, and the flesh collapsing, 12 to 15 minutes. (You could also blister them under the broiler, set on an aluminum-foil-lined baking sheet a couple of inches from the heat and cook until charred all over.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the eggplants to a bowl. Cover with a lid or overturned bowl, and let them rest until cool enough to handle, about 30 minutes. Give this the time it takes; it will help with peeling them later and also lets them steep in their smoky juices. You can do this step ahead and let them cool in the refrigerator overnight as well, to be peeled the next day, which works beautifully."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the scorched, carbonized skin from the soft, cooked-through eggplant. Discard all the black, bitter charred bits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the remaining eggplant, and save all the viscous smoky liquid that accumulates. I usually “rinse” the peeled eggplants in this strained liquid to remove any lingering flakes or chips of charred skin from the eggplant flesh. (Sometimes people are tempted to run the eggplant under the faucet for a second to remove the flecks, but using the liquid in the bowl is much better at retaining flavor.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the flesh to a fine dice, and place in a bowl. (I generally never remove the seeds unless I have bought an intensely loaded eggplant, in which case I’ll remove them if the seed sacs are pronounced and distracting.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in 3 tablespoons of the reserved smoky liquid, and the olive oil, then Microplane the garlic into the mixture. Season with salt, and stir well until the mixture is a bit creamy. Taste, and season to your palate by adding a few more drops of the smoky liquid or a few more of olive oil. I like mine rather smoky, rather salty, rather unctuous."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the eggplant mixture into an 8-inch square, about 1/2-inch thick, on a quarter sheet pan lined with a quarter-cut Silpat mat. Most people will not have these two things, so alternatively you can form a neat square or rectangle on a cookie sheet, or spoon the mixture into generally quenelled shapes onto a cookie sheet. Freeze overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the croquettes: Set up a standard breading procedure of three containers: flour, egg and water mixture, and the ground panko."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the frozen block of smoky eggplant into 2-inch squares, or batons or planks if you prefer. Refreeze for a bit if needed after cutting; they tend to defrost rather quickly. Bread each piece with care, dipping in flour, egg mixture then panko, leaving no bald spots, and refreeze the finished, breaded croquettes. (These can live in your freezer for months.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add enough neutral oil to a deep-sided sauté pan to reach a depth of 1 1/2 to 2 inches, and heat over medium until shimmering, or when a thermometer reads 350 degrees. Working in batches, fry the frozen croquettes until golden on all sides and piping hot in the center, raising and lowering the heat under the oil accordingly. Adding frozen products to hot oil brings the temperature down, as does crowding, so it is up to the cook to control the temperature of the fry oil accordingly. Remove cooked croquettes with a slotted spoon, and drain on a baker’s rack to maintain crispness (rather than a paper towel or plate, which will encourage steaming and sogginess)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with a little salt while still very hot, and serve with a squeeze of lemon."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021285-smoky-eggplant-croquettes"}