{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Meatballs With Peaches, Basil and Lime", "description": "You can make these gingery meatballs with any kind of ground meat (or vegan meat), but rich, brawny pork goes especially well with juicy peaches and the fresh basil. Make sure to use ripe or even overripe peaches (or nectarines). They should be very soft so they cook quickly, and very sweet so they contrast with the savory meatballs and tangy lime juice. Rice or rice noodles would fill this meal out perfectly and substantially, as would a crisp-leafed salad for a lighter, more summery supper.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/09/13/dining/28appetite-meatballs2/merlin_176001795_081fd9a5-e477-4647-8726-6b8d769da811-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, meat, meatballs, main course", "keywords": "basil, garlic, ginger, peach, pork, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 4191}, "recipeIngredient": ["1 1/2 tablespoons finely grated or minced fresh ginger", "3 garlic cloves, grated or minced", "1 1/4 teaspoon ground cumin, plus more for serving", "1 1/4 teaspoons kosher salt, plus more as needed", "1 pound ground pork (or turkey or chicken, or vegan meat)", "1/3 cup panko or other plain bread crumbs", "3 tablespoons finely chopped fresh basil, plus basil leaves for serving", "2 tablespoons extra-virgin olive oil", "2 tablespoons wine (dry white, rosé or red), or use broth, orange juice or water", "2 cups diced ripe peaches or nectarines (about 3)", "1/4 cup thinly sliced white or red onion, or scallions", "1 lime, halved", "White rice or coconut rice, rice noodles, or crisp salad greens, for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mix together ginger, garlic, cumin and salt. Add pork, panko and basil. Using your hands, gently mix everything together, making sure not to overwork the mixture. (Otherwise, the meatballs get tough.) Form into 1 1/4-inch balls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large skillet over medium-high, then add the oil and let it heat up until it thins out. Add meatballs in one layer. Cook, turning and shaking the pan, until meatballs are browned all over, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the wine into the skillet and move meatballs over to one side of the pan, scraping up the browned bits. Add peaches, a pinch of salt and 2 tablespoons water to the empty side of pan. When peaches are simmering, cover the pan, lower the heat to medium, and let cook until the meatballs are no longer pink at their centers, and the peaches juicy and tender, about 5 to 10 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the pan. If the mixture seems too runny, let it cook down for another minute or so. The peaches should break down into a chunky sauce. Hard or unripe peaches may take a few extra minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onions to the pan and mix them in so they wilt slightly. Squeeze lime juice all over everything, then taste and add salt and lime juice, as needed. Sweeter peaches will need more lime juice, tart ones, less."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the meatballs sprinkled with more cumin and garnished with torn basil leaves, over the rice or greens."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021402-skillet-meatballs-with-peaches-basil-and-lime"}