{"@context": "http://schema.org", "@type": "Recipe", "name": "Arroz con Gandules (Puerto Rican Rice With Pigeon Peas)", "description": "Every step and ingredient adds something important to this recipe from the Puerto Rican-born chef and writer Reina Gascón-López. Annatto seeds steeped in oil give the rice its signature marigold hue. The banana leaf imparts a subtle tropical aroma to the rice as it cooks. Olives, ham, beer and peppers with their brine offer salt, fat, acid, umami and a bright pop of color. The sheer number of flavors layered into this dish make it a delight to unpack. The most exhilarating layer is the last one: pegao, the crisp, glassy shards of rice at the bottom of the pot. Gandules (pigeon peas) make this version of rice and beans distinctly Caribbean. Ms. Gascón-López prefers to start with dry gandules, which her family sometimes ships to her from Puerto Rico, then flavors the pot with some sofrito, a bay leaf or two and a smoked pork neck. If you have trouble finding dry pigeon peas, they are often labeled as toor at Indian grocery stores.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2020/12/06/magazine/06mag-eat/06mag-eat-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "latin american", "recipeCategory": "dinner, grains and rice, vegetables, main course", "keywords": "annatto seeds, banana leaf, beer, ham, olives, pigeon peas, red bell pepper, rice, roasted canned pepper", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 211}, "recipeIngredient": ["Fresh or thawed frozen banana leaves, washed and wiped for steaming and serving", "1/4 cup neutral oil, such as canola", "2 teaspoons annatto seeds", "1 1/2 ounces ham or pork fatback, small diced (about 1/4 cup)", "1/4 cup sofrito (recipe below)", "2 tablespoons sliced manzanilla olives", "1 tablespoon store-bought or homemade sazón spice blend with achiote (see Tip)", "1 1/2 cups cooked pigeon peas, drained (reserve 2 1/2 cups cooking liquid, if possible)", "Store-bought or homemade adobo spice blend (see Tip), to taste", "Fine sea salt and freshly ground black pepper", "1 1/2 cups medium-grain or jasmine rice", "1/2 cup pale, lager-style beer", "1 jarred roasted red pepper, thinly sliced, plus 3 tablespoons brine", "1 teaspoon extra-virgin olive oil", "1/2 large yellow onion, large diced (about 1 cup)", "1/2 medium red bell pepper, stem, ribs and seeds removed, then large diced", "1/2 medium green bell pepper, stem, ribs and seeds removed, then large diced", "1/2 large cubanelle or Italian frying pepper, stemmed and seeded, then large diced", "5 garlic cloves", "1 loosely packed cup cilantro, roughly chopped", "3 scallions, trimmed and roughly chopped", "1 1/2 ají dulce peppers, stemmed and seeded (optional)", "1/4 loosely packed cup roughly chopped culantro (optional)", "3/4 teaspoon store-bought or homemade sazón spice blend with achiote (see Tip)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay 1 banana leaf (or more, if needed) flat on a large cutting board, then set the lid of a large Dutch oven or similar pot on top. Use a paring knife to trace around the lid, and cut the leaf (or leaves) so that they will fit properly inside the pot. Cover with a clean dishcloth and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, cook the neutral oil and annatto seeds over medium heat, allowing the seeds to infuse the oil. After 2 to 3 minutes, when the oil begins to bubble and the seeds start to crackle, turn off the heat and allow the oil to cool completely. Pour the cool oil through a fine-mesh strainer, reserving seeds for another round of infusing, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sofrito: Use a food processor or high-speed blender to pulse the onion, red and green bell peppers, cubanelle pepper, garlic, cilantro, scallions, ají dulce peppers (if using) and culantro (if using), adding 1 to 2 tablespoons of water if needed to achieve a smooth, salsa-like consistency. Stir in 3/4 teaspoon sazón and set aside. (The sofrito makes about 2 cups. Refrigerate it for up to 5 days or portion it into ice cube trays or plastic containers, and freeze up to 6 months.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the large Dutch oven or similar pot over medium-high heat. Add 3 tablespoons annatto oil and the ham or fatback. Sauté until crisp and most of the fat has rendered, about 6 minutes. Add 1/4 cup sofrito, the olives and 1 tablespoon sazón, stirring until sofrito is fragrant, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Next, add pigeon peas and sauté for another 3 minutes. Season with adobo, salt and black pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to medium. Add rice, stirring until grains are all coated, seasoned and starting to toast. If there isn’t enough oil to generously coat all of the rice and peas in the pot, add the remaining tablespoon of annatto oil. This will help form a delicious golden bottom crust called pegao."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the rice is toasted, stir in the beer and cook for about 3 minutes, then add the reserved pigeon-pea liquid (or 2 1/2 cups water) and roasted red pepper brine. Taste the cooking liquid and adjust salt as needed; it should be pleasantly salty."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently stir rice, then spread about half the thinly sliced roasted red pepper over the rice. Drizzle with olive oil. Cover rice with prepared banana leaves, then cover pot with its lid and cook for 22 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the time has passed, remove the lid, open the banana leaves and gently fold the rice onto itself from the outside in to form a mound in the center of the pot. Reduce heat to medium-low, replace banana leaves and lid and continue cooking for 20 to 25 minutes to allow pegao to form at the bottom of the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon rice atop a platter layered with fresh banana leaves. Garnish with remaining sliced roasted peppers. Use a metal spatula to scrape pegao out of the pot and serve on a separate plate. Be careful, because everyone will fight over it!"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021694-arroz-con-gandules-puerto-rican-rice-with-pigeon-peas"}