{"@context": "http://schema.org", "@type": "Recipe", "name": "Buttermilk-Brined Roast Turkey", "description": "With only two ingredients — buttermilk and salt — this might be the least complicated turkey brine recipe ever. The trickiest step will be pulling out your kitchen scale to weigh out the salt, but it's worth doing if you can to ensure a properly seasoned turkey. The acid in the buttermilk leads to moist, tender meat throughout, while the sugars result in a gorgeous golden-brown skin. This turkey is spatchcocked, which might sound like a lot, but it’s just another way to simplify the recipe: By removing the backbone before brining, you’ll be able to fit the turkey, placed in a 2-gallon plastic resealable bag, in the fridge more easily. And you’ll get a lot more of that beautiful lacquered skin in about half the cooking time. It’s a total win-win situation. Just make sure you don’t skimp on the brining time; 48 hours is essential to make sure the bird gets seasoned through and through. (Watch the video of Samin Nosrat preparing the turkey  <a href=\"https://www.youtube.com/watch?v=qVMpiPp28ls\">here</a>.)", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2020/11/11/dining/11buttermilk-whole-turkey/merlin_178579095_1322ed28-5243-4f8c-bec5-faac39de3c8a-mediumThreeByTwo440.jpg", "totalTime": "P2DT2H", "recipeYield": "10 to 14 servings", "recipeCuisine": "american", "recipeCategory": "dinner, poultry, main course", "keywords": "buttermilk, plan-ahead, sea salt, whole turkey, christmas, new year’s day, thanksgiving, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 4293}, "recipeIngredient": ["1 (10- to 14-pound) turkey", "3 quarts buttermilk", "128 grams fine sea salt (about 7 tablespoons)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Two to three days before you plan to cook, spatchcock the turkey: Put the turkey on a stable cutting board, breast-side down, and use heavy-duty kitchen shears to snip along both sides of the backbone to release it. You can start from the tail or neck end, whichever you prefer; just keep the blades of the scissors as close to the spine as possible. It helps to work incrementally, snipping a little on one side, then a little on the other, rather than completing one side entirely and then doing the second side without the advantage of the opposing pressure."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After removing the backbone, remove wingtips, neck and giblets, setting them all aside for stock and gravy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn turkey over so breast faces up. Splay out its legs and press hard on breastbone until you hear the cartilage pop and the bird lies completely flat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a 2-gallon resealable bag in a large bowl, stock pot or sink. Pour buttermilk and salt in bag and stir to dissolve salt. Place turkey in bag and seal carefully, expelling out air. Double-bag the turkey as needed to prevent leakage, then squish the inner bag to distribute buttermilk all around the turkey. Place it on a rimmed baking sheet and refrigerate for 48 hours. Turn the bag every 12 hours so that every part of the turkey gets marinated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Three hours before you plan to start cooking, remove the turkey from the plastic bag and scrape off as much buttermilk as you can without being obsessive, discarding buttermilk. Set the turkey on a rimmed baking sheet and bring it to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position a rack in the upper third of the oven and heat to 400 degrees. Transfer turkey, breast-side up, to another rimmed baking sheet lined with a wire rack or parchment paper. Tuck thighs inward."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place baking sheet on the prepared oven rack and roast the turkey, occasionally rotating the pan 180 degrees, until an instant-read thermometer inserted into the deepest part of the breast registers 150 degrees and the thickest part of the thigh without touching bone registers 165 degrees, about 80 to 100 minutes, depending on size. (You may want to tent the breast or other hot spots with aluminum foil, if darkening too quickly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer turkey to a cutting board or platter and allow to rest at least 20 minutes before carving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Buttermilk-Brined Roast Turkey", "description": "With only two ingredients — buttermilk and salt — this might be the least complicated turkey brine recipe ever. The trickiest step will be pulling out your kitchen scale to weigh out the salt, but it’s worth doing if you can to ensure a properly seasoned turkey. The acid in the buttermilk leads to moist, tender meat throughout, while the sugars result in a gorgeous golden-brown skin. This turkey is spatchcocked, which might sound like a lot, but it’s just another way to simplify the recipe: By removing the backbone before brining, you’ll be able to fit the turkey, placed in a 2-gallon plastic resealable bag, in the fridge more easily. And you’ll get a lot more of that beautiful lacquered skin in about half the cooking time. It’s a total win-win situation. Just make sure you don’t skimp on the brining time; 48 hours is essential to make sure the bird gets seasoned through and through.", "thumbnailUrl": "https://static01.nyt.com/images/2020/11/11/dining/11buttermilk-whole-turkey/merlin_178579095_1322ed28-5243-4f8c-bec5-faac39de3c8a-mediumThreeByTwo440.jpg", "uploadDate": "2022-11-21T22:30:58.000Z", "duration": "PT7M14S", "transcript": "", "contentUrl": "https://vp.nyt.com/video/2022/11/17/104367_1_SN-Buttermilk-Turkey-Video_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021523-buttermilk-brined-roast-turkey"}