{"@context": "http://schema.org", "@type": "Recipe", "name": "Toum (Garlic Whip)", "description": "This toum recipe comes from Marjayoun, Lebanon, where Sameer Eid grew up eating it with shawarma. Samy, Sameer’s son, learned how to make it after he started working at Phoenicia, the family’s restaurant in Birmingham, Mich. “It took me more attempts than any recipe in my life to get it right,” he said. The key is to be patient during Step 1, to be sure the garlic breaks down enough to later become a creamy, fluffy condiment. Toum is called “garlic whip” on Phoenicia’s menu. It’s served with roasted chicken and kebabs; some customers even request it with babyback ribs. It’s versatile, and also great drizzled over roasted vegetables and avocado toast.", "author": {"@type": "Person", "name": "Brett Anderson"}, "image": "https://static01.nyt.com/images/2020/05/22/dining/ba-garlic-whip/ba-garlic-whip-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 1/2 cups", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, snack, condiments, side dish", "keywords": "canola oil, garlic, grapeseed oil, lemon, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 443}, "recipeIngredient": ["1 cup peeled garlic cloves (about 32 cloves, from 3 to 4 whole heads)", "2 1/2 teaspoons kosher salt", "1/2 cup fresh lemon juice (from 3 to 4 lemons)", "3 1/2 cups canola oil or grapeseed oil", "2 tablespoons ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place peeled garlic and salt in the bowl of a food processor. Pulse the garlic for 30 seconds, scrape down the sides of the bowl, then repeat three more times until garlic is finely chopped."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 tablespoons lemon juice and continue processing until a smooth paste forms, about 3 minutes, scraping down the sides of the bowl every 45 seconds or so. You want the wet, finely chopped garlic mixture to end up with a texture similar to mashed potatoes. Pinch it between your fingertips, and it should no longer feel gritty. (If you don’t blend the garlic enough at this stage, it won’t become fluffy and emulsified later.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the food processor running, start incorporating 1 cup oil, drizzling it in at a slow, steady stream. Once the oil is incorporated, slowly add another 2 tablespoons lemon juice. Repeat this step with another 1 cup oil, then another 2 tablespoons lemon juice. By the end, the mixture should have a fluffy consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the food processor running, alternate adding 1/2 cup oil in a slow, steady stream, then 1 tablespoon lemon juice. This should happen twice. Next, with the food processor running, add the remaining 1/2 cup oil in a slow stream until totally incorporated, then do the same for the ice water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once finished, transfer to a lidded container and refrigerate for at least 1 hour. Toum will keep, refrigerated, for up to 3 weeks."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021075-toum-garlic-whip"}