{"@context": "http://schema.org", "@type": "Recipe", "name": "Larder’s Smoked Carrots With Roasted Yeast", "description": "Jeremy Umansky is a master meat curer from Cleveland, where he runs a new wave deli called Larder. New wave? The guy serves smoked carrots and burdock root “meat sticks” alongside house-cured pancetta, pastrami and bresaola. His passion for — and obsession with — koji, the miracle spore used by the Japanese to turn soybeans into soy sauce and miso, runs so deep, he not only gave a TED Talk on the topic, he wrote a whole book about it, “Koji Alchemy” (Chelsea Green Publishing, 2020). Most of his vegetable charcuterie involves a complex curing, smoking and aging process, plus fermentation with koji, but these carrots can be smoked from start to finish in about an hour. The roasted yeast rub gives them an otherworldly flavor that’s smoky, malty and absolutely unique.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2020/08/26/dining/24charcuterierex2/merlin_175804941_79d57951-2b55-4575-b01a-5cbbc6b4f987-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "vegetables, side dish", "keywords": "carrot, cocoa powder, granulated baker's yeast, maple syrup", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 39}, "recipeIngredient": ["Hardwood chunks or chips (Mr. Umansky uses shagbark hickory), for smoking (if using chips, soak them in water to cover for 30 minutes then drain)", "2 pounds medium carrots, preferably organic or from your local farmers’ market", "1/4 cup active dry yeast", "2 teaspoons freshly ground black pepper", "1 teaspoon unsweetened cocoa powder", "1 teaspoon cumin seeds", "1 teaspoon caraway seeds", "5 juniper berries, lightly crushed with the side of a cleaver", "3 tablespoons maple syrup (or to taste)", "3 tablespoons extra-virgin olive oil or vegetable oil", "Sea salt", "1/4 cup chopped celery leaves for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up your smoker following the manufacturer’s instructions and heat to 250 degrees. Alternatively, set up your charcoal grill for indirect grilling and heat to 250 degrees, using half the normal amount of charcoal (you need less charcoal to keep the heat low). Add the wood to the fire."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the carrots on the grate away from the heat and smoke until pliable but still al dente, about 1 hour. To test for doneness, bend a carrot from the ends. The carrot is ready when you can bring the ends to within 2 inches of each other without the carrot breaking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the carrots smoke, make the roasted yeast rub: Heat a dry cast-iron skillet over medium-low. Add the yeast, pepper, cocoa powder, cumin, caraway and juniper berries, and toast, shaking the pan frequently and stirring steadily with a wooden spoon to prevent scorching, until the yeast darkens a few shades to chestnut brown and the spices are fragrant, about 5 minutes. Transfer the mixture to a large but shallow mixing bowl and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the hot smoked carrots to the yeast mixture and toss to coat. Stir in the maple syrup and oil and mix well. Add salt to taste. Let the carrots rest for 10 to 15 minutes to cool while absorbing the yeast and spice flavors."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with the chopped celery leaves, if using, and serve at room temperature. Mr. Umansky recommends eating the carrots with your fingers."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021376-larders-smoked-carrots-with-roasted-yeast"}