{"@context": "http://schema.org", "@type": "Recipe", "name": "Saffron Fish With Red Peppers and Preserved Lemon", "description": "This very flexible recipe is often served by Moroccan Jews and their descendants. Many who moved to France, for example, tend to prepare it with preserved lemons and olives. Others living in Jerusalem, like Danielle Renov, author of “Peas, Love & Carrots” (Mesorah Publications, 2020), might incorporate more spice. (Ms. Renov omits the saffron for Passover.) With the addition of red peppers and tomatoes coming from the Americas, it became the rich Moroccan dish it is today. Traditionally made with white fish, it also works with salmon or shad. Serve this as an appetizer, symbolic of the wish for abundance. Assemble it in the morning and cook it just before serving, or eat the fish at room temperature. For a main course, add quinoa or couscous to soak up the flavorful juices.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2021/03/17/dining/15Passoverfamilyrex/merlin_184858569_fdc69ff3-d333-4bde-a2e0-8d231bf3fe70-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 8 servings", "recipeCuisine": "jewish, moroccan", "recipeCategory": "dinner, seafood, appetizer, main course", "keywords": "cilantro, fish, olives, preserved lemon, red bell pepper, saffron", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 742}, "recipeIngredient": ["A few pinches to 1/2 teaspoon saffron strands", "2 tablespoons olive oil", "3 red bell peppers, trimmed, quartered, seeded, then halved crosswise", "1 large red or yellow onion, diced", "2 tomatoes, diced", "6 garlic cloves, peeled and left whole ", "1 bunch cilantro, leaves and delicate stems separated and chopped", "Kosher salt and coarsely ground black pepper", "8 skinless fish fillets (about 4 ounces each), such as salmon, sea bass, striped bass, whitefish or rockfish", "1 teaspoon ground sweet paprika", "1/2 teaspoon red-pepper flakes (optional)  ", "1/4 cup pitted kalamata or green Moroccan olives", "1 preserved lemon, rinsed, chopped (peel and flesh) and seeded (or the juice of 1 fresh lemon)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 2 cups of boiling water into a bowl and sprinkle with the saffron strands. Use a spoon to press the saffron strands against the side of the bowl to release the flavor. Cover the bowl with a plate and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large skillet over low. Add the bell peppers, onion, tomatoes, garlic and cilantro stems, and season to taste with salt and pepper. Increase the heat to medium-high and cook for about 5 minutes, stirring occasionally, until the onion is transparent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Nestle the fish into the vegetables, sprinkle with the paprika, red-pepper flakes (if using), 1 teaspoon salt and 1/2 teaspoon pepper. Pour the prepared saffron water over everything. (You can do all of this in advance 1 day in advance, and refrigerate until ready to finish.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, add the olives and preserved lemon (if using — but if using fresh lemon, that will come in Step 5). Bring the mixture to a boil over high, reduce to low, cover the pan and simmer for 15 to 20 minutes, basting the fish every 5 minutes. Sprinkle with the cilantro leaves during the last few minutes of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste for seasoning and serve, setting the fish on top of the vegetables. Sprinkle with fresh lemon juice, if not using the preserved lemon. Serve warm or at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021974-saffron-fish-with-red-peppers-and-preserved-lemon"}