{"@context": "http://schema.org", "@type": "Recipe", "name": "Simple Roast Chicken With Greens (and Bonus Stock)", "description": "This thrifty dinner is a a crisp-skinned treat that leaves leftovers for lunch, and, if you like, a 2-quart container of golden broth. Reserve the bones, and let them simmer in salted water with a few simple aromatics, while you answer emails, check the news or drink some wine. The chicken here is first roasted in a skillet, so even the drippings don't go to waste, used to sauté some hearty greens as a side. But you can use any pan you like, as long as it has a rim to catch the juices. (This recipe is part of the <a href=\"https://www.nytimes.com/column/from-the-pantry\">From the Pantry</a> series, started in the days after the coronavirus lockdown.)", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/11/01/dining/mc-chicken/merlin_177006387_e63f0b42-1206-4b8b-8632-02186c477095-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry, main course", "keywords": "chicken, garlic, leeks", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 251}, "recipeIngredient": ["1 (3- to 4-pound) chicken", "Kosher salt and black pepper", "Grated garlic, lemon zest, cumin or garam masala, chopped thyme or rosemary (optional)", "Sturdy, woody herbs (sage, thyme, rosemary, bay leaf) (optional)", "Oil or butter", "2 leeks, white and light green parts, thinly sliced, tops reserved for stock (or use a large sliced onion)", "2 to 3 garlic cloves, thinly sliced", "1 bunch kale, Swiss chard or other greens, stems removed, leaves torn into bite-size pieces", "Kosher salt", "Onion or other alliums", "Reserved leek tops", "1 carrot (optional)", "Herbs, such as 2 bay leaves, some parsley stems, a few tarragon and thyme sprigs", "1 teaspoon black peppercorns", "2 celery stalks, preferably with the leaves still attached"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season your chicken all over (including the cavity) with about 2 teaspoons kosher salt and a lot of black pepper. If you like, add the grated garlic clove or two, some lemon zest, some spices like cumin or garam masala, or chopped thyme or rosemary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If time permits, let the chicken rest uncovered in the fridge for a few hours to dry out the skin. Stuff the woody herbs, if using, in the cavity either before or after resting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to roast, heat the oven to 425 degrees, and, at the same time, heat a skillet on your stovetop for a few minutes. Coat the pan with a little oil or butter, and add the bird so it’s lying on its back. Let it cook for about 5 minutes, then move it to the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the bird until it’s burnished all over and the wing tips — if your chicken still has them attached — are a little singed, about 45 minutes for a small bird, and up to 75 minutes for a larger bird. The juices should run clear if you prick the thigh with a fork. (An instant-read thermometer inserted in the thickest part of the thigh should read 165 degrees.) Move the bird to a cutting board and let it rest for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the same pan to the stove and set it over medium heat until the drippings sizzle. Add the leeks and garlic and sauté until tender and golden, 4 to 5 minutes. Add the kale and a splash of water and cook until the leaves are very tender and the water evaporates. If the kale is still tough and the pan is dry, add another splash of water. Season with salt and serve with the chicken. Pick any remaining meat off the carcass and save it for another meal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the optional stock: Put the chicken bones in a medium pot. Add a teaspoon of salt and whatever aromatics you have around: an onion or other alliums, leftover leek tops, a carrot, a bay leaf, herbs or herb stems, peppercorns, a celery stalk or the tops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover with cold water and let it all simmer for 2 or 3 hours. Or use an electric pressure cooker and let it cook at high pressure for 1 hour, or a slow cooker for 3 to 6 hours. Strain it after it cools, if you like. Stock will keep in the freezer for up to 6 months."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021455-simple-roast-chicken-with-greens-and-bonus-stock"}