{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Lemony Chicken With Brussels Sprouts", "description": "This is a true oven-to-table sheet-pan dinner full of tender, crunchy brussels sprouts and crispy, lemony chicken. A simple lemon-and-herb compound butter seasons both the chicken and sprouts, which are then topped with thin lemon slices that become crunchy in the oven, offering a nice textural element and a bright splash of color and flavor. The key is to cut the lemon rounds almost paper-thin, so they can crisp up and lose their bitterness. This recipe is easily adjustable for a larger batch: Add 4 drumsticks (about 1 ½ pounds) to the chicken thighs, increase the butter by 1 tablespoon and adjust seasonings as needed.", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "image": "https://static01.nyt.com/images/2020/12/02/dining/yf-lemony-roasted-chicken-thighs-and-brussels/yf-lemony-roasted-chicken-thighs-and-brussels-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, for two, weekday, weeknight, main course", "keywords": "brussels sprouts, chicken thigh, lemon, roast chicken, sheet-pan, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 3293}, "recipeIngredient": ["3 tablespoons unsalted butter or ghee, at room temperature", "2 lemons, both zested (about 2 tablespoons), 1 cut into very thin rounds and 1 halved, seeds removed", "1/2 cup flat-leaf parsley leaves and tender stems, finely chopped", "Kosher salt and black pepper", "3 tablespoons plus 1 teaspoon olive oil", "4 bone-in, skin-on chicken thighs (about 1 1/2 to 2 pounds)", "1 1/2 pounds brussels sprouts, trimmed and halved, tough outer leaves removed", "1 small red onion, peeled, quartered and cut into 1-inch wedges", "1/2 teaspoon red-pepper flakes", "1/4 cup grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees, set one rack 6 inches from the broiler and place another rack in the lower third of the oven. In a large bowl, combine the butter, zest of both lemons, half the parsley and 1 teaspoon salt. Rub 1 teaspoon oil on a sheet pan. Pat the chicken dry, then transfer to the sheet pan and season well with salt and pepper. Reserve about 1 teaspoon of the compound butter in the bowl, then rub the rest all over the chicken and under the skin by lifting it up, pushing a tiny amount of compound butter underneath, then pressing on top. Arrange the chicken pieces skin-side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the brussels sprouts, onion wedges, lemon rounds, red-pepper flakes and the remaining 3 tablespoons olive oil to the bowl with the compound butter; toss to coat. Season with salt and pepper. Arrange the brussels sprouts mixture around the chicken, placing some lemon rounds on top of the vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast on the lower rack, 30 to 35 minutes, stirring the vegetables halfway through, until the chicken is crispy, the chicken juices run clear when the meat is pierced with a fork, and the brussels sprouts are browned and crunchy. If the chicken skin is not as crispy as you’d like, transfer the vegetables to a serving platter, then place the chicken under the broiler for 1 to 3 minutes. Transfer the chicken to the serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze one of the lemon halves over the chicken and vegetables and cut the remaining lemon half into quarters. Garnish the chicken and vegetables with the cheese and the remaining parsley, and serve with the lemon wedges."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021697-sheet-pan-lemony-chicken-with-brussels-sprouts"}