{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Pan Chicken Thighs With Coconut Creamed Corn", "description": "If it’s possible to upstage crispy-skinned chicken thighs, the coconut creamed corn in this dish comes close. The sweetness of caramelized corn and coconut milk is balanced by the brightness of the ginger, chile, scallions and lime. As the corn simmers, the browned chicken thighs finish cooking right on top, so the flavors meld and deepen. It’s a complete summery meal in one skillet, although you can make it anytime. Just use frozen corn. Garnish it with cilantro, chives, fried shallots or coconut flakes, and serve it with a green side. If you feel like it, you could use shrimp instead of chicken. (Use </span><a href=\"https://cooking.nytimes.com/recipes/1020330-shrimp-scampi-with-orzo\"><span>this recipe</span></a><span> as a guide.)", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2020/06/04/dining/as-one-pan-chicken-thighs-with-coconut-creamed-corn/merlin_172953168_fec4706e-3f39-43a0-ac71-89519bafc252-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry, vegetables, main course", "keywords": "chicken thigh, coconut milk, corn, garlic, ginger, lime, scallion, serrano pepper, fall, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1587}, "recipeIngredient": ["2 pounds bone-in, skin-on chicken thighs (4 to 6 pieces)", "Kosher salt and black pepper", "1 tablespoon extra-virgin olive oil", "5 cups fresh or frozen corn kernels (from about 7 ears)", "3 scallions, thinly sliced, white and green parts separated", "1 (2-inch) piece fresh ginger, peeled and finely grated or chopped", "3 garlic cloves, peeled and finely grated or chopped", "1 serrano chile or chipotle in adobo, finely chopped, or 1/2 teaspoon red-pepper flakes", "1 (15-ounce) can full-fat coconut milk", "1 lime, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the chicken dry, and season with salt and pepper. Drizzle the olive oil in a large (12-inch) skillet. Add the thighs, skin-side down, and set over medium heat. (It’s OK if they’re slightly squeezed in the skillet; as the fat renders, they’ll shrink.) Cook, undisturbed, until the skin is deep golden brown, and the thighs release easily from the pan, about 15 minutes. (If your stove is getting splattered with oil, cover the skillet.) Transfer the chicken, skin-side up, to a plate. Reserve the skillet and fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat to high, add the corn, scallion whites, ginger, garlic and serrano. Season with salt and pepper and cook until the corn starts to brown in spots, 2 to 3 minutes, adding an extra minute or two if using frozen corn."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to medium, add the coconut milk, scrape up any browned bits from the pan and season with salt and pepper. Put the chicken on top of the corn mixture, skin-side up. Simmer until the coconut milk is slightly thickened and the chicken is cooked through, 7 to 10 minutes. (If your corn has reduced too much before your chicken is done cooking, just add a few tablespoons of water or chicken stock.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with a squeeze of lime and reserved scallion greens on top."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021157-one-pan-chicken-thighs-with-coconut-creamed-corn"}