{"@context": "http://schema.org", "@type": "Recipe", "name": "Mapo Tofu", "description": "You can order mapo tofu from many Chinese restaurants, but it’s also quite doable at home. You can find the pivotal fermented chile and broad (fava) bean sauce or paste called doubanjiang (sometimes rendered as “toban djan”) at a Chinese market. Look for a doubanjiang from Pixian, in Sichuan, and bear in mind that oilier versions have extra heat but may lack an earthy depth. Sichuan peppercorns add mala — tingly zing — and fermented black beans, called douchi, lend this dish a kick of umami. Ground beef is traditional, but many cooks choose pork; you can also try lamb, turkey thigh or a plant-based meat alternatives. Add chile flakes for extra fire, and balance mapo’s intensity with rice and steamed or stir-fried broccoli.", "author": {"@type": "Person", "name": "Andrea Nguyen"}, "image": "https://static01.nyt.com/images/2020/10/07/dining/05mapo1/merlin_177593325_1efeecd0-e478-4f8a-ab03-36a9553ca3c9-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings (about 4 cups)", "recipeCuisine": "chinese", "recipeCategory": "dinner, lunch, weeknight, grains and rice, meat, one pot, main course", "keywords": "doubanjiang, ground beef, scallion, sichuan peppercorns, tofu", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1907}, "recipeIngredient": ["16 ounces medium or medium-firm tofu (if unavailable, go with firm)", "1 rounded teaspoon Sichuan peppercorns", "3 tablespoons canola oil", "6 ounces ground beef or pork (preferably 80 or 85 percent lean), roughly chopped to loosen", "2 1/2 to 3 tablespoons doubanjiang (fermented chile bean sauce or paste)", "1 tablespoon douchi (fermented black beans, optional)", "1 teaspoon minced fresh ginger", "1/2 teaspoon red-pepper flakes (optional)", "2 teaspoons regular soy sauce", "1 rounded teaspoon granulated sugar, plus more if needed", "Fine sea salt", "2 large scallions, trimmed and cut on a sharp bias into thin, 2-inch-long pieces", "1 1/2 tablespoons cornstarch dissolved in 3 tablespoons water", "Cooked white rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the tofu: Cut the tofu into 3/4-inch cubes and put into a bowl. Bring a kettle of water to a rolling boil. Turn off the heat and when the boiling subsides, pour hot water over the tofu to cover. Set aside for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large (14-inch) wok or (12-inch) skillet over medium heat, toast the peppercorns for 2 to 3 minutes, until super fragrant and slightly darkened. (A wisp of smoke is normal.) Let cool briefly, then pound with a mortar and pestle, or pulse in a spice grinder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a strainer over a measuring cup, then add the tofu to drain; reserve 1 1/2 cups of the soaking water, discarding the rest. Set the tofu and reserved soaking water near the stove with the peppercorns and other prepped ingredients for swift cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat the wok or skillet over high. When hot — you can flick water in and it should sizzle and evaporate within seconds — swirl in the oil to evenly coat, then add the meat. Stir and mash into cooked and crumbly pieces, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 1/2 tablespoons doubanjiang, the douchi (if using), ginger and red-pepper flakes (if using). Cook about 2 minutes longer, stirring constantly, until things are vivid reddish brown. Add the soy sauce and sugar, stir to combine, then add the tofu. Gently stir or shake the pan to combine the ingredients without breaking up the tofu much."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the reserved 1 1/2 cups soaking water, bring to a vigorous simmer, and cook for about 3 minutes, agitating the pan occasionally, to let the tofu absorb the flavors of the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slightly lower the heat and taste the sauce. If needed, add the remaining 1/2 tablespoon of doubanjiang for heat, a pinch of salt for savoriness, or a sprinkle of sugar to tame heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the scallions and stir to combine. Stir in the cornstarch slurry, then stir in enough to the mapo tofu to thicken to a soupy rather than a gravy-like finish. Sprinkle in the ground peppercorns, give the mixture one last stir to incorporate, then transfer to a shallow bowl. Serve immediately with lots of hot rice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021459-mapo-tofu"}