{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Fish With Creamed Kale and Leeks", "description": "This satisfying weeknight meal involves three simple components — fish, kale and rice — and builds flavor from just one versatile element requiring a little labor: leek-infused cream. Sauté leeks, garlic and thyme in butter until softened, then simmer with heavy cream until thickened. Strain the mixture, saving the leeks to add flavor to cooked rice, polenta or pearl couscous, then combine the fragrant cream with blanched kale and a little mustard. Season the skin of your fillets early to help them develop a particularly crisp, crackly crust. If you can’t find fresh char, any mild fish fillets will work well in their place.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2021/02/04/dining/aw-seared-char-with-creamed-greens-and-leeks/merlin_183049518_41ed1d2c-bb63-4b74-8b72-526e69b73499-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, seafood, main course", "keywords": "char, fish, kale, leeks, thyme", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 311}, "recipeIngredient": ["4 (5- to 6-ounce) Arctic char or other mild fish fillets, such as salmon", "Kosher salt and black pepper", "1 1/2 pounds curly kale", "3 tablespoons unsalted butter", "1 large leek (about 1/2 pound), trimmed, white and pale greens quartered lengthwise then thinly sliced", "6 large fresh thyme sprigs", "3 garlic cloves, minced", "1 cup heavy cream", "1 1/2 teaspoons Dijon mustard", "1 teaspoon chicken or vegetable stock concentrate, like Better Than Bouillion", "Cooked white rice or pearl couscous, warmed, for serving", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare your fish: Pat the fish dry, then salt the skin side to help draw out moisture. Set on a plate and refrigerate, uncovered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil over high. Prepare your kale: Pull the leaves off the stems and tear leaves into bite-size pieces. Wash vigorously, drain, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, melt the butter over medium. Add the leek, thyme and garlic, season with salt and pepper, and cook, stirring frequently, until soft, about 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the cream and bring to a boil over high. Continue to cook on high until thickened, about 5 minutes. Using a fine-mesh sieve set over a liquid measuring cup or small bowl, strain the sauce, pressing to extract as much liquid as possible. (You should have about 1/2 cup sauce.) Set aside the solids and return the sauce to the saucepan. Whisk in the mustard and stock concentrate, and season with salt and pepper. Cover and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard the thyme sprigs and stir the cooked leek mixture into cooked rice, if desired. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the sauce is done, blanch the kale in the boiling water until just wilted, about 2 minutes. Transfer to a colander to drain and rinse under cold water. Once cool enough to handle, squeeze out the excess liquid. Add to the strained cream, then season with salt and pepper. Cover, and warm over low, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the fish: Heat the oil in a large nonstick skillet over medium-high. Pat the fish dry a second time, then season the skin with pepper, and the flesh with salt and pepper. Add to the hot oil, skin-side down, and cook until the skin is crispy and golden, about 3 to 4 minutes. Carefully flip the fish and cook until the outside starts to turn golden, but the thickest part of the fish is still slightly translucent, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the rice (if using), creamed kale and fish among plates and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021871-seared-fish-with-creamed-kale-and-leeks"}