{"@context": "http://schema.org", "@type": "Recipe", "name": "Bricklayer-Style Nachos", "description": "Bricklayer-style beef, or puntas al albañil, made with tender pieces of beef, salty bacon and sometimes chorizo in a chunky fire-roasted salsa, is a beloved taco filling in Mexico. Once a common snack available near construction sites in central Mexico, it became popular beyond street food stands, expanding into homes and restaurants over the years. Here it’s used as the foundation for nachos, topped with mounds of melted cheese, tangy queso fresco, creamy avocado and crunchy scallions for a hearty, delicious meal.", "author": {"@type": "Person", "name": "Pati Jinich"}, "image": "https://static01.nyt.com/images/2020/12/27/dining/29nachosrex4/merlin_179172897_0f430a5e-29ae-44c7-8525-2f75dd470b75-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "mexican", "recipeCategory": "snack, weeknight, appetizer, main course", "keywords": "bacon, beef, cheese, chorizo, monterey jack cheese, mozzarella, nacho, onion, tomato, tortilla chips", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1530}, "recipeIngredient": ["2 pounds ripe Roma tomatoes or 2 (15-ounce) cans fire-roasted tomatoes", "8 ounces thick-cut bacon, thinly sliced", "8 ounces fresh Mexican chorizo, casing removed, coarsely chopped", "1 1/2 pounds beef sirloin, excess fat removed, meat cut into 1/2-inch pieces", "Kosher or sea salt and black pepper", "1 medium white onion, halved and slivered (about 1 1/2 cups)", "1 to 2 jalapeños or serrano chiles, halved, deseeded if desired, and sliced", "2 garlic cloves, finely chopped", "1 to 1 1/2 pounds store-bought or Homemade Tortilla Chips (<a href=\"https://cooking.nytimes.com/recipes/1021579-homemade-tortilla-chips\">see recipe</a>)", "12 ounces shredded Mexican melty cheese, like Oaxaca, Asadero or quesadilla, or even Monterey Jack or mozzarella (about 3 cups)", "1 ripe avocado, halved, pitted and finely chopped", "1 cup crumbled queso fresco", "8 scallions, trimmed and thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using fresh tomatoes, place them on a small baking sheet covered with aluminum foil. Place them under the broiler for 8 to 10 minutes, turning halfway through, until charred, mushy and juices have begun to run. Remove from heat. Once cool enough to handle, chop them without discarding any of the juices, seeds or charred skin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large (12-inch) skillet over medium-high. Add the bacon and cook, stirring occasionally, until it browns slightly and renders some of its fat, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chorizo to the bacon, and cook, breaking the sausage into smaller pieces using a wooden spoon as it begins to brown and crisp, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beef, season with salt and pepper and cook, stirring a couple times, until it begins to brown, about 4 minutes. Incorporate the onion and jalapeño and cook until they begin to wilt, 2 to 3 minutes. Add the garlic and stir until fragrant but not browned, less than 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the fresh or canned chopped tomatoes with their juices and cook over high, stirring occasionally, until saucy, 2 to 3 minutes. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the rack in the middle of the oven and heat to 400 degrees. Place all the tortilla chips in a half sheet pan or large baking sheet in an even layer. Cover the chips with the bricklayer meat mixture and all of its chunky salsa. Cover with the shredded cheese. Bake until cheese has completely melted, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish with the avocado, crumbled queso fresco and scallions. Dig in while hot!"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021580-bricklayer-style-nachos"}