{"@context": "http://schema.org", "@type": "Recipe", "name": "Sonoran Carne Asada Tacos", "description": "If you’re trying to replicate the carne asada experience in Sonora, there are rules to follow: Diezmillo (chuck roll) and palomilla or aguayón (top sirloin) are the traditional meats of choice. The first brings a deep beef flavor and a sturdy chew, while the second has a milder taste and a tender bite. Use one or the other, or a combination. Either way, they need to be sliced to 1/2-inch thickness, grilled over high heat, and seasoned with a generous amount of salt — and only salt — right as they are thrown on the grill. They should be flipped just once, when meat juices rise and start to bubble, allowed to rest covered, and then thinly sliced or diced into bite-size pieces. There is no carne asada just for the meat, though the meat turns out as tasty as can be, but it should end up in a taco that should have trouble closing (with its proper accompaniments of refried beans, guacamole and salsa) and should be eaten in good company.", "author": {"@type": "Person", "name": "Pati Jinich"}, "image": "https://static01.nyt.com/images/2020/08/12/dining/10carneasadarex6-tacos/merlin_175265379_59bb2696-835f-43fe-8f19-d03031e29894-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, meat, tacos, main course", "keywords": "chuck steak, flour tortillas, guacamole, refried beans, sirloin, white onion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 380}, "recipeIngredient": ["1/4 large white onion, for cleaning the grill", "Beef fat (cut from the meat, if fatty), tallow or vegetable oil, for greasing the grill", "2 pounds chuck roll, sliced into 1/2-inch steaks", "2 pounds top sirloin, sliced into 1/2-inch steaks", "4 teaspoons kosher or sea salt, or to taste (about 1 teaspoon per pound of meat)", "Frijoles de Fiesta (Fiesta Refried Beans) (<a href=\"https://cooking.nytimes.com/recipes/1021290-refried-beans\">see recipe</a>)", "Salsa Tatemada Norteña (Fire-Roasted Salsa) (<a href=\"https://cooking.nytimes.com/recipes/1021291-fire-roasted-salsa\">see recipe</a>)", "Chile Verde Guacamole (<a href=\"https://cooking.nytimes.com/recipes/1021293-guacamole\">see recipe</a>)", "12 to 16 large (8-inch) flour tortillas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start a charcoal or gas grill, and get it very hot. For gas, set to high heat. For charcoal, grill is ready when coals are red but entirely covered with gray ash, and you can hold your hand about 5 to 6 inches above the coals for only about 4 to 5 seconds before it becomes too hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and season the grill: Using a pair of tongs, rub a quarter of a white onion over the grill. Next, rub the beef fat over the grill to season it further. (Alternately, you can do this using tallow or vegetable oil.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches if needed to avoid crowding, place the meat over the hot grill. Season the meat generously with salt on top right before throwing it on the grill, salt-side up. (Alternatively, sprinkle the salt on top of the meat once it’s on the grill.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill for 4 to 5 minutes, until the bottom has seared, deep grill marks have developed, and the meat juices have started rising and bubbling over the top. Flip to the second side and grill for another 3 to 4 minutes for medium. Remove the meat and place in a lidded dish or container. Cover the cooked meat while you grill the remainder. Allow the meat to rest for at least 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "One by one, take out the pieces of meat and cut into about ½-inch dice, placing them back in the same lidded dish and covering until all the meat has been chopped."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before the meat is brought to the table, make sure the refried beans are hot. Set them on the table along with the salsa and guacamole, in separate bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat of the grill to medium if using gas, or, if using charcoal, set the flour tortillas on a cooler part of the grill. Heat the flour tortillas about 1 minute or so per side, until puffed, lightly browned and completely heated through. Keep warm in a clean kitchen towel or tortilla warmer and bring to the table."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the tacos, a common practice is to grab a warm flour tortilla, spread some refried beans on the middle, add a generous amount of meat, then add salsa and guacamole on top to taste — but everyone can choose how they want to build or eat their tacos. (If the taco doesn’t easily close, your assembly was successful!)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021295-sonoran-carne-asada-tacos"}