{"@context": "http://schema.org", "@type": "Recipe", "name": "Hearty Beef Stew With Red Onions and Ale", "description": "In this cozy beef stew, tender chunks of meat in a silky, savory, ale-tinged sauce share the pot with wedges of red onion and sweet nuggets of carrot. A little coriander and allspice add fragrance and depth to the mix, while a spoonful of tomato paste deepens and rounds out the flavors. Like all stews, it tastes even better a day or two later, and can be frozen for up to two months. Serve it over something soft and buttery to soak up the sauce: a mound of mashed potatoes, noodles or polenta.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/11/04/dining/04apperex/merlin_178770741_300da621-a32e-4894-adc7-4ae660af6d3c-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, meat, soups and stews, main course", "keywords": "ale, allspice, beef, carrot, coriander, garlic, stock, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2055}, "recipeIngredient": ["2 pounds boneless beef stew meat, cut into 1-inch chunks", "Kosher salt and black pepper", "3 medium red onions", "1 to 2 tablespoons all-purpose flour", "2 tablespoon unsalted butter", "1 tablespoon olive oil, plus more as needed", "4 garlic cloves, thinly sliced", "1 tablespoon tomato paste", "1 teaspoon ground coriander", "1/4 teaspoon ground allspice", "2 cups beef or chicken stock, preferably homemade", "1 cup ale or beer (nonalcoholic is fine)", "1 rosemary sprig", "3 carrots, sliced", "1 tablespoon cider vinegar or sherry vinegar, plus more to taste", "Chopped chives, for garnish", "Flaky sea salt, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the beef all over with salt and pepper. Set aside while you prepare the onions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the onions. Cut 2 of them in half root to stem, then thinly slice them crosswise into half-moons. Cut the third onion, root to stem, into 1/2-inch wedges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust the beef cubes lightly with flour. Heat butter and 1 tablespoon oil in a large Dutch oven or other pot over medium-high. Add beef, in batches taking care not to crowd the pan, and sear until it’s good and dark all over, 5 to 6 minutes per batch. Transfer beef cubes to a bowl as they brown. Add more oil and adjust heat if necessary to prevent burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in sliced onions and raise heat to medium-high if you lowered it. Cook until pale golden brown and soft, 10 to 15 minutes, stirring occasionally. Add garlic and sauté until fragrant and lightly golden at the edges, 2 to 3 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a well in the center of the onions, then stir in tomato paste, coriander and allspice; cook, stirring until paste is darkened, 1 minute. Stir in stock, ale, 1 cup water and rosemary sprig. Return beef and any juices to the pot and bring to a simmer. Partly cover the pot and simmer gently for 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Give the beef a stir, then add onion wedges. Simmer for 15 minutes, then stir in carrots and continue to simmer until the meat, onions and carrots are tender, 30 to 45 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the sauce seems thin, use a slotted spoon to transfer meat and vegetables to a platter; cover with foil to keep warm. Discard the rosemary. Return pot with liquid to stove and simmer until thickened, 5 to 10 minutes. Stir in vinegar. Taste and add more salt and vinegar if you like. Spoon sauce over meat and garnish with chives, flaky sea salt and more black pepper."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021592-hearty-beef-stew-with-red-onions-and-ale"}