{"@context": "http://schema.org", "@type": "Recipe", "name": "Lobster Salad With Green Beans, Tomatoes and Basil", "description": "This summery salad makes a fine celebratory lunch or cold supper and makes great use of seasonal vegetables. Everything is dressed with a bright basil vinaigrette. A dab of aioli on the side is a welcome option, too. The hardest part here is steaming the lobsters, but don’t worry. It’s easy — and economical — to do it yourself. Still, if the idea doesn’t appeal, many fishmongers sell steamed lobsters for an additional fee. Or you can buy prepared lobster meat, though that’s a bit more expensive. If you decide to do that, you’ll need at least one-third pound per person.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/08/19/dining/14Tanisrex-salad/merlin_175528659_47cf9de4-8647-4887-a567-67b800e3454d-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings as a main course", "recipeCuisine": "", "recipeCategory": "seafood, main course", "keywords": "cherry tomatoes, green beans, heirloom tomatoes, lobster, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 138}, "recipeIngredient": ["4 (1 1/2- to 2-pound) live lobsters", "Kosher salt and black pepper", "3 bay leaves, 1 teaspoon black peppercorns and 1 teaspoon allspice berries (optional)", "1 or 2 small garlic cloves, roughly chopped", "1 teaspoon Dijon mustard", "3 tablespoons red wine vinegar", "1/2 cup extra-virgin olive oil", "1 loosely packed cup parsley leaves", "1 cup green basil leaves, loosely packed, plus 1 small bunch green or purple basil, for garnish", "1/2 pound cherry tomatoes, halved", "1 pound small green beans (haricots verts), briefly cooked and cooled", "1 1/2 pounds heirloom tomatoes, cut into thick slices", "4 hard-boiled eggs, peeled, halved and lightly salted", "1 pound new potatoes, cooked and cooled", "Arugula or salad leaves, for garnish", "Aioli, optional (see Note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot or in batches, so as not to crowd them, steam or boil the lobsters in seawater or heavily salted water. Add the bay leaf, peppercorns and allspice berries, if you wish. Depending on their size, cook the lobsters for 13 to 15 minutes. (Ask your fishmonger for recommended cooking time.) Let lobsters cool to room temperature on rimmed baking sheets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using lobster crackers, kitchen shears or a mallet, crack shells and remove meat. Place the claw meat and knuckle meat in a container. Slice tail meat 1/2-inch thick and add to the container. Cover and refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the vinaigrette: Add garlic, mustard, vinegar, olive oil, parsley and basil leaves to a blender jar or food processor. Whiz until slightly thickened. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put cherry tomatoes in a small bowl, season with salt and pepper and add 3 tablespoons vinaigrette. Toss to combine. To another small bowl, add green beans and 3 tablespoons vinaigrette. Toss to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange lobster meat in the center of a platter or divide among individual plates. Surround with tomato slices, and season lightly with salt and pepper. Spoon cherry tomatoes over the tomato slices. Scatter green beans artfully. Tuck eggs and potatoes here and there (or serve potatoes separately). Finish with arugula or salad leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle remaining vinaigrette over everything. Garnish with the prettiest basil leaves. Serve aioli on the side, if using."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021322-lobster-salad-with-green-beans-tomatoes-and-basil"}