{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate-Stuffed Oatmeal Cookies", "description": "These big, chewy oatmeal cookies filled with soft chocolate ganache are perfect for sharing. To make the process a little simpler, you can prep and refrigerate the dough and the filling up to three days in advance. (You could also freeze them for even longer; just let them warm up a bit at room temperature to make them easier to work with.) The assembly is easy: Simply enrobe the truffled filling by stacking it between two pieces of dough and pressing the edges to seal. The stuffed cookie balls can be frozen for up to a month. Bake off a few at a time for warm, gooey cookies whenever the mood strikes.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2020/12/14/dining/ss-chocolate-filled-oatmeal-cookies/merlin_178579281_446eb888-c84f-44b4-bb31-b2e5bc515cc7-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "12 cookies", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars", "keywords": "butter, chocolate, dark brown sugar, oats, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 606}, "recipeIngredient": ["1/2 cup/115 grams unsalted butter (1 stick), at room temperature", "3/4 cup/165 grams dark brown sugar", "1/2 cup/100 grams granulated sugar", "1 large egg", "2 teaspoons pure vanilla extract", "1 1/2 cups/150 grams quick-cooking or old-fashioned oats", "1 cup/130 grams all-purpose flour", "1/2 teaspoon baking powder", "1/2 teaspoon ground cinnamon", "1/2 teaspoon kosher salt", "3 tablespoons heavy cream", "3/4 cup/115 grams finely chopped semisweet or bittersweet chocolate", "1/2 teaspoon pure vanilla extract", "A generous pinch kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cookie dough: In the bowl of a food processor, combine the butter and both sugars and process until combined. Add the egg and vanilla and pulse to combine, scraping down the sides of the bowl with a rubber spatula as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the oats, flour, baking powder, cinnamon and salt, and process until combined and the oats have broken down a bit, scraping down the sides of the bowl occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dough to a large piece of plastic wrap and use the sides of the plastic to shape it into a flat, 8-inch square that is about 1/2-inch thick. Chill until firm, at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: Heat the cream in a small saucepan or in a bowl in the microwave until hot. (Be careful: Cream loves to boil over.) Add the chocolate, vanilla and salt to the hot cream and let stand 2 minutes, then stir until smooth and uniform. (If not fully smooth, carefully heat a bit longer on the stovetop, stirring until smooth, or heat in the microwave in 5-second spurts, stirring after each blast, until smooth.) Transfer the filling to a large piece of plastic wrap and use the sides of the plastic to shape it into a 4- to 6-inch square. Chill until firm, at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Line two rimmed baking sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the cookie dough into 24 equal pieces. Cut the chocolate filling into 12 equal pieces. (It’s OK if the chocolate breaks a bit; just make sure you have 12 equal piles.) Flatten one piece of cookie dough slightly. Set a piece of chocolate filling into the center. Flatten another piece of cookie dough and set it on top of the chocolate filling. Use your hands to shape the cookie dough around the filling and then roll it into a neat ball. Repeat with the rest of the dough and filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set 6 dough balls onto one of the prepared sheets. Bake until set and relatively flat, with just-golden edges, 14 to 16 minutes. Let cool for 5 minutes on the baking sheet, then transfer to a rack to cool completely. Repeat with the remaining cookies on the other baking sheet. Serve cookies warm or at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021516-chocolate-stuffed-oatmeal-cookies"}