{"@context": "http://schema.org", "@type": "Recipe", "name": "Sauerkraut Jeon (Korean Pancakes)", "description": "Jeon are savory Korean vegetable, meat or seafood pancakes bound with the most basic batter: flour, cornstarch and water. Because the mixture is completely unleavened (no baking powder, yeast or even eggs), they run the risk of turning dense and gummy if you overwork the batter. This is good news for the lazy: The less work you put in, the better they come out. They can be made with virtually any meat or vegetable odds and ends, but they’re especially great with that crunchy sauerkraut languishing in the back of your fridge from that cookout you had last year.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2021/01/13/dining/12Kenjirex/merlin_181993518_c1bebde2-3555-4691-a19d-113132906e76-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american, korean", "recipeCategory": "dinner, lunch, quick, weeknight, pancakes, vegetables, appetizer, main course", "keywords": "cornstarch, pickled cherry peppers, red onion, rice vinegar, sauerkraut, toasted sesame oil, nut-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 618}, "recipeIngredient": ["3 tablespoons light soy sauce or shoyu", "2 tablespoons rice vinegar or black vinegar", "2 tablespoons warm water", "1 scallion, trimmed and thinly sliced", "1 tablespoon granulated sugar", "1 teaspoon toasted sesame oil", "1 cup sauerkraut (about 6 ounces), plus 1/4 cup sauerkraut juice", "1/4 medium red onion (about 2 ounces), thinly sliced", "2 scallions, split lengthwise and cut into 1 1/2-inch pieces", "3/4 cup all-purpose flour", "1/4 cup cornstarch or potato starch", "2 teaspoons granulated sugar", "Small handful of thinly sliced pickled cherry peppers or peperoncini", "3/4 cup cold water", "Peanut, rice bran or soybean oil, as needed, for pan-frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dipping sauce: In a small bowl, stir together all ingredients until the sugar dissolves. Set aside, or prepare in advance and store in a sealed container in the refrigerator for up to several weeks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pancakes: In a large bowl, combine sauerkraut and sauerkraut juice. (If you don’t have enough sauerkraut juice, you can make up the difference with cold water.) Add onion, scallions, flour, starch, sugar, pickled peppers and the cold water. Stir rapidly with a spoon just until no dry flour remains. (Do not overmix the batter.) The batter should be thin enough to flow around when you tilt the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons oil in the bottom of a flat-bottomed wok or an 8- to 10-inch nonstick skillet over medium-high until shimmering. You should be able to make about two 10-inch pancakes or three 8-inch pancakes, or several smaller pancakes. Add enough batter that you can spread it into a thin pancake with the back of a spoon. Let the pancake cook, undisturbed, until the bottom of the pancake is set, about 2 minutes. Use a thin spatula to gently release the pancake from the pan if it is sticking at all. Continue to cook, swirling pancake around to encourage even browning until the first side is well browned with a few darker spots, another 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a wide spatula to carefully flip the pancake. Continue cooking until second side is well browned, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide the pancake out onto a cutting board, and cook remaining pancake batter, repeating Steps 3 and 4. Once cooked, cut into wedges with a pizza slicer or knife and serve with the prepared dipping sauce."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021774-sauerkraut-jeon-korean-pancakes"}