{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Tofu With Cashews and Blistered Snap Peas", "description": "A ginger and coconut milk reduction can coat pretty much anything that browns nicely on its own. Here, it’s pieces of pan-seared tofu, but small morsels of chicken and pork will work just as well. The soy and the teaspoons of molasses give the sauce a little caramelization, and a little shine and gloss. For a fresh side, add some blistered snap peas, tossed with sliced scallions, a little mint and a splash of rice vinegar. Snow peas, green beans, broccoli or asparagus? If it’s fresh and green, it’ll work just fine.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2020/07/01/dining/26tofurex1/26tofurex1-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, beans, main course", "keywords": "cashews, cast iron, coconut milk, extra-firm tofu, firm tofu, fresh ginger, skillet, sugar snap peas, dairy-free, vegan, vegetarian, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7581}, "recipeIngredient": ["1 (14-ounce) block firm or extra-firm tofu, drained", "3 tablespoons neutral oil, such as grapeseed, vegetable or canola, plus more as needed", "Kosher salt and black pepper", "3/4 pound snap peas, trimmed", "1 (2-inch) piece fresh ginger, peeled and grated (about 2 tablespoons)", "2 garlic cloves, grated", "1 (13-ounce) can unsweetened coconut milk (light or full-fat)", "1 tablespoon soy sauce", "2 teaspoons molasses, dark brown sugar or honey", "1/2 cup toasted cashews", "1 tablespoon rice vinegar", "4 scallions, trimmed and thinly sliced", "1/4 cup mint leaves, torn if large", "1/2 to 1 teaspoon red-pepper flakes (optional)", "Rice or any steamed grain, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the tofu in half horizontally, and leave on paper towels to dry any excess liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium skillet or cast-iron pan, heat 1 tablespoon oil over medium-high until it shimmers. Season both sides of the tofu with salt and black pepper, place in the pan and sear without moving until tofu is browned and golden on both sides, turning once halfway through, about 8 minutes total. Move the tofu to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 tablespoon oil to the pan, and add the snap peas. Cook, stirring occasionally, until blistered and just tender, about 3 minutes. Season with salt and move to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining 1 tablespoon oil, add the ginger and garlic, and cook until fragrant, about 30 seconds. Pour in the coconut milk, soy sauce and molasses. Simmer, stirring frequently until the sauce reduces and its color deepens to a dark brown, about 6 to 8 minutes. It should coat a spoon without running right off. Stir in the cashews, break the tofu into 1-inch pieces and toss in the pan to coat with sauce. Remove from heat, and taste and adjust seasoning, if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the snap peas with the rice vinegar, scallions, mint and red-pepper flakes, if using. Divide among plates, along with the tofu and cashews. Serve with rice or any steamed grain."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021200-crispy-tofu-with-cashews-and-blistered-snap-peas"}