{"@context": "http://schema.org", "@type": "Recipe", "name": "Will Horowitz’s Watermelon Ham", "description": "When Will Horowitz, a chef and an owner of Ducks Eatery in Manhattan, unveiled his watermelon ham in 2018, he sparked an Instagram revolution, inspiring foodies from as far away as Germany and Japan to try incarnadine slabs of his brined, smoked watermelon. It sure looked like ham, right down to the crosshatch scoring on the surface. It sure smelled like ham, fragrant with the smoky scent of hickory. It even had some of the briny umami tang you associate with ham. Though it didn’t really taste like ham, it did firmly establish plant-based charcuterie as a big thing. This watermelon “ham” starts with a tamari-herb brine, is smoked low and slow for the first four hours, then seared. This recipe is adapted from “Salt Smoke Time” by Will Horowitz, Julie Horowitz and with Marisa Dobson (William Morrow, 2018).", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2020/08/26/dining/24charcuterierex1/24charcuterierex1-articleLarge.jpg", "totalTime": "P4DT5H", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "main course, side dish", "keywords": "summer, tamari, watermelon, wood ash, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 362}, "recipeIngredient": ["1 medium seedless watermelon (10 to 12 pounds)", "1 cup wood ash (from your smoker or fireplace) or 2 teaspoons food-grade sodium hydroxide (lye) (see Note)", "3/4 cup kosher salt", "1/4 cup dried oregano leaves", "2 tablespoons cracked black peppercorns", "4 juniper berries, lightly crushed with the side of a cleaver or knife to release the flavor", "3 whole cloves", "2 fresh or dried bay leaves", "3/4 cup tamari", "2 tablespoons extra-virgin olive oil, plus 2 tablespoons for basting", "6 garlic cloves, peeled", "4 (4- to 5-inch) sprigs fresh rosemary", "2 hardwood chunks or 1 1/2 cups wood chips (if using the latter, soak in cold water for 30 minutes then drain), plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the watermelon: Using a sharp knife, cut the top and bottom off the watermelon, removing enough rind just to expose the red flesh. Stand the watermelon upright on one flat end and pare off the rind, cutting using long strokes of the knife from top to bottom. (The strips you remove will look like barrel staves.) Place the watermelon in large stockpot or bucket."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the brine: Add 2 quarts of water to a large pot along with the wood ash, salt, oregano, peppercorns, juniper berries, cloves and bay leaves; bring to a boil. Remove from heat, stir in another 4 quarts of water and let cool to room temperature. Once cooled, stir in the tamari. Pour the brine over the watermelon, placing a saucepan or other weight on top to keep the watermelon submerged. Transfer to the refrigerator and brine the watermelon for 4 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the brined watermelon to a wire rack set over a sheet pan. Let it rest in the refrigerator until the surface feels tacky, 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up your smoker following the manufacturer’s directions and heat to 250 degrees. Alternatively, set up your charcoal grill for indirect grilling and heat to 250 degrees, using half the normal amount of charcoal (you need less charcoal to keep the heat low)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread 2 tablespoons olive oil in a sturdy foil pan large enough to hold the watermelon. Add the watermelon and arrange the garlic and rosemary alongside it in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a charcoal grill, add the wood chunks or chips to the coals. Place the watermelon in its pan in the smoker or on the grill grate. Smoke the watermelon for 2 hours, basting with the pan juices, replenishing the wood as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the watermelon and score the surface in a 1-inch diamond crosshatch pattern, just as you would a ham, cutting no more than 1/4 inch deep."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue smoking the watermelon in the smoker or on the grill until the outside is firm and bronzed with smoke, 2 hours more, basting every 30 minutes with the pan juices and the remaining 2 tablespoons olive oil. Remove the pan from the smoker or grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finally, you’ll want to finish cooking at a high temperature to add color to the watermelon. If working on a grill, add more charcoal and heat it to high (400 degrees). If you have a smoker, increase the heat to 400 degrees, if your smoker will go that high. Alternately, you can finish the watermelon ham in an oven heated to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill, smoke or roast the watermelon until darkly browned on the outside, basting with pan juices every 15 minutes, about 45 minutes. Allow the watermelon ham to cool slightly, about 15 minutes, before slicing. To serve, cut the ham crosswise into 1-inch slices. Spoon the pan juices over the watermelon and serve warm or cold."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021375-will-horowitzs-watermelon-ham"}