{"@context": "http://schema.org", "@type": "Recipe", "name": "Pepperoni Rolls", "description": "Found throughout West Virginia, the pepperoni roll was born in the early 20th century in the north-central part of the state as a convenient lunch for Italian coal miners. Giuseppe Argiro is credited with first selling the rolls commercially, sometime between 1927 and 1938, and his Country Club Bakery, in Fairmont, W.Va., still uses his recipe, the standard by which all other rolls in the state are judged. The recipe remains a secret, but this version — from the chef Travis Milton and featured in Ronni Lundy’s cookbook, “Victuals” (Clarkson Potter, 2016) — is a close approximation. Look for a hunk of pepperoni to slice into sticks, as it gives the roll more chew. Many West Virginians add cheese to their versions, so feel free to experiment once you’re comfortable with the recipe.", "author": {"@type": "Person", "name": "Sara Bonisteel"}, "image": "https://static01.nyt.com/images/2020/05/22/dining/sb-pepperoni-rolls/sb-pepperoni-rolls-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 rolls", "recipeCuisine": "american", "recipeCategory": "breads, pizza and calzones", "keywords": "maple syrup, pepperoni, yeast", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 102}, "recipeIngredient": ["1 cup/240 milliliters warm water (110 to 115 degrees)", "2 1/4 teaspoons active dry yeast (from 1 individual packet)", "1 teaspoon maple syrup, sorghum syrup or honey", "2 3/4 cups/350 grams all-purpose flour, plus more for rolling", "1 teaspoon kosher salt", "1 teaspoon olive oil, plus more as needed", "Nonstick cooking spray", "1 (8-ounce/225-gram) pepperoni stick or 6 ounces pepperoni slices", "1/4 cup/55 grams unsalted butter (1/2 stick), melted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the warm water to a measuring cup. Stir in the yeast and syrup, then let stand for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the dough hook, add the flour, salt, 1 teaspoon oil and yeast mixture. Pulse several times on low to combine, then knead on low until the dough pulls away from the sides of the bowl, about 5 minutes. The dough will be sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a large bowl with cooking spray or olive oil. Use floured hands to remove the dough from the mixing bowl and transfer it to the greased bowl. Cover the bowl using a damp towel, and let the dough sit in a warm place for 45 minutes to rise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As dough rises, prepare the stick pepperoni (if using): Cut the pepperoni into 2 (5-inch) lengths. Cut each piece lengthwise into 3 slabs, then cut each of those slabs lengthwise into 3 even batons, forming a total of 18 pieces, each 5 inches long and about 1/3-inch wide."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly spray or oil a baking sheet. When the dough is ready, use floured hands to remove the dough from the bowl and transfer it to a floured surface. Cut it into 6 equal portions, about 4 ounces each, and roll them into balls. Place the balls on the prepared baking sheet. Spray or lightly oil the top of each ball of dough and cover the baking sheet lightly with plastic wrap. Let sit for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Uncover the dough. Using floured hands, remove a dough ball and place it on a floured work surface. Either roll or stretch the dough into a 6-by-8-inch rectangle. (Be careful not to make the dough too thin, or it will be hard to roll up the pepperoni.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a 6-inch edge of the rectangle facing you. Starting about 1 1/2 inches from the short edge closest to you, place 3 pepperoni sticks crosswise on the dough, leaving about 1 1/2 inches between each stick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the dough edge closest to you, fold it over the first pepperoni stick, adhering the top layer of dough to the bottom layer of dough, and then proceed to make 2 more folds away from you to enrobe the remaining 2 pepperoni sticks. If using slices, imagine separating your dough into thirds by creating 2 crosswise rows of pepperoni, each overlapped like a spread of cards, 6 pepperoni slices wide. Fold the dough closest to you over the first row of pepperoni slices, then fold up the dough to cover the second row of pepperoni slices, so the pepperoni and dough form alternating layers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the roll to the baking sheet, setting it seam-side down. (Resist the urge to tuck in or fold over the shorter ends.) Repeat this process with the remaining dough balls and pepperoni sticks or slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the rolls with the melted butter and bake until golden brown and cooked through, 30 to 35 minutes. Remove from the oven and brush with any remaining butter. Let cool completely before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021064-pepperoni-rolls"}