{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Chickpea, Red Pepper and Tomato Stew", "description": "This vegan stew is inspired by romesco, the Spanish sauce made from roasted red peppers, tomatoes, almonds, garlic, olive oil and vinegar. Here, those flavors combine in a ragout that pulls from the pantry, with fast prep and little waste. Instead of stock, this stew relies on the thick liquid from the canned chickpeas, sometimes called aquafaba. And the marinating oil in jarred sundried tomatoes is delicious, especially when augmented with herbs and vinegar. Give yours a little taste to make sure you like it, and then throw that in, too. (If you don’t like it, make up the difference with regular olive oil.) The smoked almonds on top are key, adding necessary crunch and richness, so be generous with them. (If you would like to make this stew on the stovetop, just sauté the onion then add the remaining stew ingredients and simmer until the flavors are blended, about 30 minutes. You can also use <a href=\"https://cooking.nytimes.com/recipes/1021904-slow-cooker-chickpea-red-pepper-and-tomato-stew\">this recipe</a> to prepare the dish in a slow cooker.)", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2021/02/10/dining/sdg-pressure-cooker-chickpea-stew/merlin_182444373_ed075c84-19e3-4cac-b883-ff37dea67020-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews, main course", "keywords": "almond, chickpea, instant pot, roasted red pepper, tomato, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 316}, "recipeIngredient": ["1 tablespoon olive oil, plus more for serving", "1 red onion, chopped", "1 (6- to 7-ounce) jar sun-dried tomatoes, drained and chopped (about 1 cup), oil reserved (about 3 tablespoons)", "5 garlic cloves, smashed and finely chopped", "1/2 teaspoon smoked paprika", "3 (15-ounce) cans chickpeas, with liquid (or about 4 1/2 cups cooked chickpeas and 1 cup cooking liquid)", "2 (12-ounce) jars roasted red peppers, drained and finely chopped (2 cups)", "1 (14-ounce) can crushed or diced tomatoes", "1 tablespoon sherry vinegar or red wine vinegar, plus more to taste", "Kosher salt and black pepper", "Red-pepper flakes, for serving", "Chopped smoked almonds, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on the sauté setting on a 6- to 8-quart electric pressure cooker. Add 1 tablespoon olive oil, then add the onion. Cook, stirring occasionally, until translucent, about 5 minutes. Stir in the sun-dried tomatoes and their oil, garlic and smoked paprika, and cook, stirring, until fragrant, about 3 minutes. Stir in the chickpeas and their liquid, roasted red peppers and canned tomatoes. Cook, stirring and scraping the bottom of the pot to make sure nothing is sticking, until fragrant and combined, about 1 minute. Stir in the vinegar, 1 teaspoon salt and several grinds of pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the sauté setting. Put the lid on the pressure cooker and turn the steam valve to sealed. Set to cook on high pressure for 5 minutes. After the cook time, turn off the heat and let the pressure reduce naturally for 10 minutes, then release the remaining pressure manually by twisting the steam valve to vent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the stew, and add additional salt, pepper or vinegar, if you like. Serve the stew in bowls, topped with a drizzle of olive oil, red-pepper flakes and smoked almonds."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021907-pressure-cooker-chickpea-red-pepper-and-tomato-stew"}