{"@context": "http://schema.org", "@type": "Recipe", "name": "Soup Joumou", "description": "For Haitians, soup joumou is synonymous with freedom. The story goes that during French colonial rule of Haiti, enslaved Africans were forced by their oppressors to cultivate squash for this dish but were not allowed to eat it. When Haitians won their independence on Jan. 1, 1804, they ate soup joumou to celebrate. The formula varies slightly from family to family, but usually includes calabaza squash, beef marinated in a bright epis seasoning of onions, peppers and herbs, an assortment of other vegetables and pasta. This classic version is adapted from “Let’s Speak Haitian Food: Stories from the Haitian Diaspora on Cuisine, Community and Culture” by Cindy Similien, a Haitian-American author and community advocate. The inclusion of both vermicelli and homemade dumplings adds a springy bite and thickens the broth of this one-pot dish, which can be made on Haitian Independence Day, or for any special occasion.", "author": {"@type": "Person", "name": "Priya Krishna"}, "image": "https://static01.nyt.com/images/2020/12/29/dining/29Haitianrex1/merlin_181421682_e4bc0c50-cc2a-4ccb-a8c8-3d9ff0c67410-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 10 servings (about 20 cups)", "recipeCuisine": "caribbean", "recipeCategory": "dinner, meat, soups and stews, main course", "keywords": "beef, cabbage, flour, lime, potato, vermicelli", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 347}, "recipeIngredient": ["1 large green bell pepper, stemmed and chopped", "1 medium red bell pepper, stemmed and chopped", "1/2 white onion, chopped", "1/4 cup white vinegar", "1/4 cup extra-virgin olive oil", "1 celery stalk, chopped", "2 scallions, trimmed and chopped", "1 fresh parsley sprig", "5 garlic cloves, peeled", "1 chicken bouillon cube", "1/2 teaspoon fresh or dried thyme leaves", "1 1/2 teaspoons kosher salt", "1 pound boneless beef chuck, cut into 1/2-inch pieces", "1/2 cup fresh lime juice (from about 3 limes)", "5 tablespoons epis seasoning", "2 pounds calabaza squash, peeled and roughly chopped", "1 tablespoon extra-virgin olive oil", "2 tablespoons tomato paste", "1 chicken bouillon cube", "5 medium Idaho or russet potatoes, peeled and cut into 3/4-inch cubes", "1/2 small head green cabbage, shredded (about 3 cups)", "4 medium carrots, peeled and sliced", "1 large white onion, finely chopped", "2 celery stalks, cut into 1/2-inch pieces", "2 scallions, trimmed and sliced", "3 fresh parsley sprigs", "1 Scotch Bonnet pepper", "1/4 teaspoon fresh or dried thyme leaves", "2 teaspoons kosher salt", "1/4 teaspoon freshly ground black pepper", "1/2 cup vermicelli", "1 1/4 cups all-purpose flour", "1 teaspoon extra-virgin olive oil", "1/4 teaspoon kosher salt", "1/4 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the epis seasoning: Combine all of the ingredients in a blender and purée. Use epis or transfer to a large jar and refrigerate for up to 6 weeks. (Similar to sofrito, epis is versatile and adds extra kick and flavor. It can be used to marinate beef, fish or chicken, or stirred into rice or soup.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the soup: Rinse the beef with lukewarm water, then transfer the meat to a large bowl. Add the lime juice and rub it into the meat until coated. Add 5 tablespoons epis seasoning and toss to coat. Cover and refrigerate to marinate, ideally overnight or for at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, purée the calabaza squash with 1 cup water in a blender; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, heat the oil over medium. Add the meat with its marinade, the tomato paste and bouillon cube, crushing it between your fingertips. Cook the meat, stirring occasionally, until the mixture caramelizes and darkens, about 10 minutes. Transfer the meat to a bowl to set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 6 cups water to the pot and bring to a boil over high heat. Stir in the squash purée, potatoes, cabbage, carrots, onion, celery, scallions, parsley, Scotch Bonnet pepper, thyme, salt and pepper, and bring to a boil again. Stir in the meat with its juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the mixture comes to a boil, cover the pot, reduce the heat to simmer over low, and cook for 30 minutes, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and discard the Scotch bonnet pepper. (Do not let it burst. If it does, your soup will be very spicy!) Stir in the vermicelli. Cook, stirring occasionally, for another 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the dumplings: Combine the flour, oil, salt, pepper and 1/2 cup water in a medium bowl and stir to combine. (You can knead slightly, if needed, to get the dough to come together.) Take about 1 tablespoon of dough and roll it between your palms into an elongated shape the width of your palm, about 4 inches long. Add the dumpling to the soup and continue to make dumplings with the remaining dough, dropping them into the soup as they are rolled. Cook over low heat, stirring occasionally, until dumplings are softened and cooked through but still firm, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the soup is too thick for your taste, stir in water, about 1 cup or as desired. Remove pot from heat and serve warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021716-soup-joumou"}