{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggplant Caponata Pasta With Ricotta and Basil", "description": "This weeknight pasta is inspired by traditional caponata, a tangy, salty-sweet Italian dish made with sautéed eggplant, tomatoes, caramelized onions, capers, anchovies, olives and vinegar. Though caponata is often served as a side, salad or relish, this eggplant sauté forms the foundation of a hearty vegetarian pasta. For the best results, taste and season your eggplant mixture with salt and pepper as you cook little by little — or even recklessly. It should taste quite salty and tangy on its own, but will mellow when tossed with pasta, pasta water and creamy ricotta.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2020/09/25/dining/aw-eggplant-caponata-pasta/merlin_174184335_b52b1bc8-b8a0-42f5-9f0d-2ba5700df1e2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas, main course", "keywords": "basil, capers, eggplant, garlic, pasta, pine nuts, raisins, sugar, vinegar, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1599}, "recipeIngredient": ["Kosher salt and black pepper", "1/3 cup raisins, preferably yellow", "2 tablespoons granulated sugar", "1/2 cup plus 2 tablespoons olive oil, plus more if desired", "2 small Italian eggplants (2 pounds total), trimmed and cut into 3/4-inch cubes", "12 ounces orecchiette (or other shaped pasta)", "1/3 cup finely chopped shallot (about 1 small shallot)", "1/4 cup pine nuts", "3 tablespoons drained brined capers", "2 garlic cloves, finely chopped", "1/4 teaspoon red-pepper flakes", "1/3 packed cup thinly sliced fresh basil leaves, plus more torn leaves for garnish", "2 tablespoons red wine vinegar", "1 cup fresh ricotta or burrata (about 8 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil over high heat. Add the raisins, sugar, 1 tablespoon salt and 1 cup water to a small saucepan. Bring to a boil over high heat and let cook about 2 minutes, then cover and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonstick skillet, heat 1/4 cup olive oil over medium-high. Stir in half the eggplant to coat evenly in the oil, season generously with salt and pepper, and cook, stirring occasionally, until tender and browned in spots, 7 to 8 minutes. Transfer to a large bowl. (Eggplant should brown and tenderize but still maintain its shape.) Heat another 1/4 cup oil, then add remaining eggplant; season and repeat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the eggplant cooks, add the pasta to the boiling water and cook until al dente. Reserve 1 cup pasta water, then drain pasta. (You might not use all the pasta water.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another 2 tablespoons oil to the skillet and reduce the heat to medium. Cook the shallot, pine nuts, capers, garlic and red-pepper flakes, stirring frequently, until the shallot is tender, 2 to 3 minutes. Transfer to the bowl with the eggplant, along with the sliced basil and vinegar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the soaked raisins, discarding the soaking liquid, then add the raisins to the eggplant mixture and toss to coat. Season generously with salt and pepper. The mixture should taste quite aggressively salty and tangy, but it will mellow when tossed with pasta and ricotta. (Eggplant mixture can be made in advance and refrigerated for up to 2 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add eggplant mixture, pasta and 1/2 cup reserved pasta water to the pot. Toss to coat over medium heat until eggplant is warmed, adding extra pasta water if necessary. Divide among shallow bowls, top with ricotta and additional torn basil and serve immediately. Pass with additional olive oil for drizzling, if desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021486-eggplant-caponata-pasta-with-ricotta-and-basil"}