{"@context": "http://schema.org", "@type": "Recipe", "name": "Mofongo", "description": "Easily the most popular classic Puerto Rican dish, mofongo is flavorful, satisfying and layered with history. The ingredients and process reference the island’s Indigenous and African roots alongside Spanish flavors. While this preparation uses chicharrón or pork cracklings, you can easily make it vegan by omitting the pork and adding a little extra garlic and olive oil. The trick to great mofongo is to work quickly: Heat your garlic and olive oil mojo while your plantains are frying, and smash everything together as soon as they’re done. You can stuff mofongo with seafood or roast pork, if you like, and serve it with guiso, a flavorful, sofrito-scented tomato sauce, or even use it to stuff a Thanksgiving turkey. The included recipe for guiso is optional but recommended, as it adds dimension and moisture, particularly for a vegan preparation.", "author": {"@type": "Person", "name": "Von Diaz"}, "image": "https://static01.nyt.com/images/2020/10/28/dining/26resiliencerex3/merlin_177593391_6fdc0429-d428-42f6-b570-75679c3f3431-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, vegetables, main course", "keywords": "cracklings, garlic, lime, plantain, puerto rican", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 211}, "recipeIngredient": ["1 teaspoon olive oil", "2 tablespoons fresh sofrito (see <a href=\"https://cooking.nytimes.com/recipes/1021438-arroz-con-pollo\">Arroz con Pollo</a> recipe for instructions)", "1 cup tomato sauce (basic canned tomato sauce is fine)", "4 to 6 cups vegetable oil", "3 to 5 large garlic cloves", "1 teaspoon kosher salt, plus more to taste", "1/4 cup olive oil", "1 tablespoon fresh lime juice, plus more to taste", "3 green plantains (see Note)", "1 1/2 cups chicharrón or pork cracklings, plus more for garnish (optional)", "Lime wedges and cilantro, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the guiso, if using: Heat olive oil in a small saucepan over medium heat for 1 to 2 minutes, until simmering. Add sofrito, reduce heat to medium-low and sauté for 3 to 5 minutes until liquid is evaporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in tomato sauce, partially cover with a lid, and simmer over low for 7 to 10 minutes. Sauce will thicken and darken in color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While sauce simmers, prepare the mofongo: Pour vegetable oil into a medium saucepan until it reaches a 3-inch depth, then heat over medium-high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, crush garlic and 1 teaspoon salt in a pilón or large mortar and pestle until a wet paste forms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate, small saucepan, heat 1/4 cup olive oil over medium until just simmering, about 5 minutes. Slowly pour this hot oil on top of the garlic, carefully stirring to incorporate. It’ll sizzle, and the garlic may turn light green. Add lime juice to complete the mojo."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel plantains by cutting off both ends, then make three lengthwise slices through the skin. Carefully pull up the peel and remove it, starting at one of the corners with the edge of your fingernail or the tip of your knife if tough, then cut the plantains into 1 1/2-inch rounds. (Be careful: Plantain skins will stain your hands and clothing.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the vegetable oil is simmering somewhere between 350 and 375 degrees — you can test by adding a small piece of plantain; it will sizzle when the oil is hot enough — add plantains in 2 or 3 batches, taking care not to crown the pot. Fry each batch for 6 to 9 minutes, stirring lightly a few times, until the plantains begin to brown. Be careful not to let them get too dark, or they’ll be hard and dry. Use a slotted spoon or mesh strainer to transfer plantains to a towel-lined bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have a large enough pilón, add fried plantains and chicharrón, if using, until pilón is three-quarters full. Mash together, alternating pounding and grinding. Once mixture has condensed to about half its original size, add 1 heaping tablespoon of the prepared mojo (or to taste), and continue grinding and mashing until fully combined. The mixture will look like stuffing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you don’t have a pilón, combine plantains, chicharrón and mojo in a large wooden bowl. Using the bottom of a slender jar, such as an olive jar, mash together to incorporate, rotating the bowl after each mash. Pound, grind and mash until mofongo is blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form the mashed mixture into 4 individual mofongos, each roughly the size of a baseball, or press into the bottom of a small rice bowl, then turn each onto a plate or into a larger bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately, garnished with extra chicharrón, lime wedges and cilantro, if you like. Spoon over guiso as desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021437-mofongo"}