{"@context": "http://schema.org", "@type": "Recipe", "name": "Tamales de Pollo (Chipotle Chicken Tamales)", "description": "Guadalupe Moreno’s <a href=\"https://cooking.nytimes.com/recipes/1021734-tinga-de-pollo-chicken-with-chipotle-and-onions\">tinga de pollo</a> makes for a delicious filling in this tamales formula from Alicia Villanueva of Alicia’s Tamales Los Mayas in Hayward, Calif. Ms. Villanueva shared her recipe with Leticia Landa and Caleb Zigas for their cookbook “We Are La Cocina.” Her tamales are made with corn masa flour that’s softened and flavored at the same time with both fat and broth. The recipe is a project, but once you’ve done the work of preparing the husks, filling and masa, the process of filling and wrapping the tamales goes quickly.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2020/12/23/dining/18Tamalesrex4-chicken/merlin_181221105_51e97f8a-b262-454c-9d69-7cc170ab4d7e-articleLarge.jpg", "totalTime": "PT4H15M", "recipeYield": "12 to 16 tamales", "recipeCuisine": "mexican", "recipeCategory": "project", "keywords": "christmas, corn husk, harina de maíz nixtamalizado, lard", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 198}, "recipeIngredient": ["20 dried corn husks (from about 8 ounces)", "3 1/2 cups/410 grams harina de maíz nixtamalizado (such as Maseca)", "1 teaspoon fine salt", "1/2 teaspoon baking powder", "6 tablespoons lard or vegetable oil", "2 1/2 to 3 cups <a href=\"https://cooking.nytimes.com/recipes/1021734-tinga-de-pollo-chicken-with-chipotle-and-onions\">chicken broth</a>  or water", "1 1/2 cups <a href=\"https://cooking.nytimes.com/recipes/1021734-tinga-de-pollo-chicken-with-chipotle-and-onions\">Tinga de Pollo</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the corn husks in a large bowl and add enough warm water to cover. Weigh down with a plate if needed and soak until softened, at least 1 hour and up to 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, whisk the harina de maíz nixtamalizado, salt and baking powder in a large bowl. Add the lard and rub into the dry ingredients with your fingers until thoroughly incorporated and the mixture is sandy. Add 2 1/2 cups broth, 1/2 cup at a time, and mix and knead in each addition with your hands until fully incorporated before adding the next. The dough should be soft and tacky but not sticky. If needed, continue adding broth 1/4 cup at a time, kneading well after each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble a tamal, remove a husk from the water and pat dry. Use your fingers or a palette knife to spread a handful of masa (about 1/4 cup) in the center of the husk, covering about two-thirds of the husk with masa about 1/4-inch thick. Leave at least 3 inches clear at the pointed end and at least an inch on the other sides. Put 1 heaping spoonful of the chicken tinga filling lengthwise down the center of the masa. Wrap by bringing the right side of the dough over the filling and folding in half. Continue rolling tightly to the long end of the husk, then fold the pointed bottom end over the tamal towards the open top. Set aside folded ends down. Repeat with the remaining ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a large steamer by setting a steamer insert or rack above gently boiling water. Stack the tamales flat seam side down on the insert, leaving an empty space in the center. Cover with remaining husks, then the lid. Steam, replenishing the water as needed, until the tamales are firm and the masa comes away easily from the husk, about 45 to 55 minutes. Remove from the heat and keep warm in the steamer until ready to serve. Steamed and cooled tamales can be wrapped individually and frozen for up to 3 months. Thaw overnight in the refrigerator and steam until heated through to serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021733-tamales-de-pollo-chipotle-chicken-tamales"}