{"@context": "http://schema.org", "@type": "Recipe", "name": "Suon Kho (Pork Ribs in Savory Caramel Sauce)", "description": "A richness permeates these ribs, which are first marinated, then grilled until charred and finally simmered in a bittersweet caramel sauce. They become so dark and savory that some people mistake them for beef. For Tet festivities in northern Vietnam, pigs are often slaughtered to celebrate the Lunar New Year, and this preparation is among the best ways to use the ribs. It reheats and freezes well, a perfect make-ahead dish for the holiday since it’s a time when everyone is supposed to relax rather than work hard in the kitchen. Pair the ribs with a side of <a href=\"https://cooking.nytimes.com/recipes/1021835-dua-hanh-pickled-shallots\">dua hanh</a> to cut their richness, and serve with rice and stir-fried greens to round out the meal.", "author": {"@type": "Person", "name": "Andrea Nguyen"}, "image": "https://static01.nyt.com/images/2021/01/29/dining/29Tetrex2-suon/merlin_182848542_990d0f78-6d11-4a64-9fef-170ca58a2a4b-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "4 servings", "recipeCuisine": "vietnamese", "recipeCategory": "dinner, meat, main course", "keywords": "fish sauce, lunar new year, onion, scallion, spareribs", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 208}, "recipeIngredient": ["3 pounds pork spareribs, cut across their bones into 2-inch-wide strips (see Note)", "1/2 large yellow onion, minced", "1 teaspoon freshly ground black pepper", "6 tablespoons fish sauce", "7 tablespoons granulated sugar", "1/8 teaspoon unseasoned rice vinegar or distilled white vinegar", "Chopped scallion greens, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut each rib strip between the bones or cartilage into individual ribs. In a large bowl, combine the onion, pepper, 3 tablespoons fish sauce and 1 tablespoon sugar. Mix well. Add the ribs and use your fingers or a large spoon to mix well, coating all the ribs evenly. Cover with plastic wrap and refrigerate for at least 2 hours or up to overnight. (Set out at room temperature for 45 minutes before proceeding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, heat an outdoor grill or broiler with a rack set 4 inches away from the heat source to high. When the grill is ready, you should be able to hold your hand over the grate for only 2 to 3 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the caramel sauce: In a large pot, stir together the vinegar, remaining 6 tablespoons sugar and 1 tablespoon water over medium heat until the sugar nearly dissolves, 60 to 90 seconds. Cook without stirring until champagne yellow, about 3 minutes, then continue cooking for another 1 to 2 minutes, frequently picking up the pan and swirling it to control the caramelization. When the mixture is a dark tea color (expect faint smoking), turn off the heat and keep the pan on the burner. Let the caramelization continue until the mixture is burgundy in color, 1 to 2 minutes. Slide the pan to a cool burner and add 3 tablespoons water, stirring to dissolve the sugar. (If needed, rewarm over medium heat to loosen.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the ribs from the marinade, reserving the onion, and sear the ribs on the grill, turning as needed, so they pick up some charred edges and grill marks on all sides, 10 to 15 minutes total. (Or broil the ribs on a foil-lined rimmed baking sheet until tinged brown and a bit charred, 6 to 8 minutes per side.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the ribs with any cooking juices to the pot with the caramel sauce. Add the reserved onion, the remaining 3 tablespoons fish sauce and enough water to almost cover the ribs, about 4 cups. Bring to a boil over medium-high heat. Don’t skim the scum that rises to the surface or you will remove some of the seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the heat to maintain a simmer, cover and cook for 45 minutes. Uncover, stir the ribs and adjust the heat so that the liquid simmers vigorously. Cook until the ribs feel tender when pierced with the tip of a sharp knife, about 20 minutes. Lower the heat if you need to cook longer. The sauce will have reduced somewhat, but there will still be a generous amount."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat and let stand for a few minutes so that the fat collects on the surface, then use a ladle or spoon to skim it off. (Or, to make the task much easier, let cool, cover and refrigerate overnight. Discard the congealed chilled fat.) Return to a simmer and taste the sauce. Add extra fish sauce to create a deeper savory flavor, or water to lighten the flavor. Transfer to a shallow bowl and sprinkle the scallion greens on top. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021834-suon-kho-pork-ribs-in-savory-caramel-sauce"}