{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Creamy Leek Pasta", "description": "This four-ingredient leek pasta coaxes as much flavor and texture as possible out of a few leeks, a box of pasta, some olive oil and lemon (plus salt and pepper). Though it doesn’t take long, this recipe is not fast — it’s even a little bit fussy. You’ll julienne and fry the leek whites to create a crispy garnish, then blend the resulting leek oil with boiled leek greens to create a silky sauce. You could absolutely make this dish on a weeknight, but since the recipe revolves around technique, it’s best not to rush. It’s about enjoying the process as much as the results.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2021/01/27/dining/22pasta1/merlin_182443629_34ef2b16-9791-4184-bc28-82092d6c6e8c-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas, main course", "keywords": "bucatini, leek, lemon, fall, winter, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1091}, "recipeIngredient": ["Kosher salt and black pepper", "3 medium leeks (about 1 to 1 1/4 pounds total)", "1/2 cup extra-virgin olive oil", "1 pound bucatini, fettuccine or linguine", "1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil over high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare your leeks: Trim 1/2 inch off both ends, then cut each leek crosswise, separating the bottom third of the white portion from the top two-thirds of light and dark leek greens. Halve the greens lengthwise, wash them, then set them aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve your leek whites lengthwise, cut them crosswise into 2-inch segments, then slice those segments thinly lengthwise to create matchsticks. (If you notice any grit in the sliced leek whites, wash them thoroughly, transfer them to a dish towel, squeezing to remove excess moisture, then spread them out to dry.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small, deep saucepan, heat the olive oil over medium-high and line a baking sheet with paper towels. Working in three to four batches for even cooking, add about 1/4 of the white leek strips and cook, stirring frequently, until golden, about 4 minutes. The key here is to keep residual cooking in mind: Since your delicate leeks will continue cooking after being removed from the hot oil, you want to pull them from the hot oil when about a third of each batch is fully golden, a third is lightly golden and another third is still green. (They won’t cook perfectly evenly; it’s not you, it’s them and the nature of cooking.) Remove them swiftly, using a slotted spoon and tilting the saucepan to transfer the leeks to the paper towel-lined plate. Season to taste with salt. Repeat with the remaining batches. Set the oil aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta and leek greens to the boiling water, reduce the heat to medium-high and cook, stirring occasionally, until the pasta is just shy of al dente, about 8 minutes. Reserve 1 cup pasta cooking water. Using tongs, transfer the leek greens to a blender, then pour the pasta into a colander set in the sink."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the reserved leek oil to the leek greens, along with 2/3 cup pasta water and a generous pinch each of salt and pepper, and blend until creamy. Add the sauce to the pot and stir in the pasta. Season to taste with salt and pepper, and add more pasta water, if desired, to thin the sauce. Divide among plates and sprinkle with frizzled leeks. Grate fresh lemon zest on top, if desired, then squeeze with lemon. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021815-vegan-creamy-leek-pasta"}