{"@context": "http://schema.org", "@type": "Recipe", "name": "Bananas Foster Poundcake", "description": "Named after a customer at <a href=\"https://www.nytimes.com/2015/01/21/dining/brennans-in-new-orleans-walks-the-tightrope-of-tradition.html\">Brennan’s</a> restaurant in New Orleans, <a href=\"https://cooking.nytimes.com/recipes/1017148-bananas-foster?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=1\">bananas Foster</a> is traditionally served over vanilla ice cream or over pound cake. But what if we told you that you could have your bananas Foster baked into cake and glazed with that same sauce? This slightly dense, buttery cake is delicious warm, and super moist. Take care when flambéing — keep a lid nearby to smother any flames — or skip it altogether: Bypass adding the alcohol in Step 3 and simply reduce the sauce on the stovetop. And don’t forget to add that scoop of ice cream and a dollop of fresh whipped cream. You’ll thank us later.", "author": {"@type": "Person", "name": "Millie Peartree"}, "image": "https://static01.nyt.com/images/2020/11/06/dining/mp-bananas-foster-poundcake/merlin_179305296_adb5899f-8141-4b3b-a312-2a10d3d0d92c-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "snack, cakes, dessert", "keywords": "banana, buttermilk, cinnamon, eggs, sour cream, kwanzaa", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 431}, "recipeIngredient": ["Nonstick cooking spray", "3 cups/600 grams granulated sugar", "1 cup/225 grams unsalted butter (2 sticks), at room temperature", "3 cups/375 grams self-rising flour", "1/2 cup/120 milliliters sour cream, at room temperature", "1/2 cup/120 milliliters buttermilk, at room temperature", "6 large eggs, at room temperature", "1 teaspoon pure vanilla extract", "4 ripe bananas", "1/4 cup/55 grams unsalted butter (1/2 stick)", "1/4 cup/55 grams light or dark brown sugar (not packed)", "1/2 teaspoon ground cinnamon", "1 nip bottle/50 milliliters dark liquor (such as cognac, bourbon or whiskey) or buttermilk (about a scant 3 1/2 tablespoons)", "1 teaspoon vanilla extract", "1 1/2 cups/185 grams confectioners’ sugar", "Ice cream or whipped cream and candied pralines, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees and generously coat a 10-inch/12-cup Bundt cake pan with nonstick cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the bananas Foster filling: Peel the bananas and cut them crosswise into 1/2-inch slices. Melt butter in a medium (10-inch) skillet over medium heat. Stir in the brown sugar and cinnamon, then add the sliced bananas. Cook, stirring occasionally, until a sugary syrup forms, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the flame (or if using an electric stove, pull the skillet off the heat) and add the liquor, if using. Return pan to the heat and, if using a gas stove, slightly tilt the pan near the flame to flambé. (If using an electric stove, light the liquid with a long-reach lighter.) Let the flames die down, swirling the pan until the alcohol burns off. Reduce heat to low and stir briefly with a wooden spoon. (Alternatively, skip adding the alcohol, add buttermilk and cook sauce just until the liquid reduces slightly.) Strain liquid from bananas into a medium bowl to separate bananas and sauce; set both aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: In a stand mixer or with a hand-held mixer on medium speed, cream together granulated sugar and butter until light and fluffy, about 4 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift the flour into a medium bowl. In a small bowl or liquid measuring cup, mix together the sour cream and buttermilk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the butter is creamed, add 1 egg at a time and mix until each is fully incorporated, scraping down the sides of the bowl after each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half the flour and mix on low speed until fully incorporated. With the mixer running, add the buttermilk mixture in a slow, steady stream and mix until fully incorporated. Add the remaining flour and mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once fully combined, add the vanilla and mix to incorporate. By hand, fold in strained bananas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan and smooth evenly. Bake for 65 to 80 minutes, until a toothpick or cake tester comes out clean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake cools, prepare the glaze: Sift the confectioners’ sugar into the bowl with the reserved banana sauce and whisk to combine. If the glaze is too thick, thin with water (or buttermilk), 1 tablespoon at a time, until it’s smooth, drizzles easily and coats the back of a wooden spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cake has cooled, invert it onto a large serving plate, and spoon the glaze over. Slice the cake and serve with ice cream or whipped cream and candied pralines, if desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021627-bananas-foster-poundcake"}