{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Party Mix", "description": "When a recipe for a seasoned snack mix first appeared on the back of the Chex cereal box in the 1950s, people went crazy for it. Years later, a Google search for the recipe yields more than two million results for various riffs, from savory to spicy to sweet. Many call for tossing the dry ingredients with the wet, then letting the mix dry on paper towels, but baking it at a low temperature yields crisper, more flavorful results. Hot sauce gives this version a bit of a kick, but if you don’t like heat, you can leave it out. View this recipe as a template to tweak as you see fit: Use crunchy, roasted edamame or green peas in place of the nuts, substitute Thai red curry paste or Sriracha for the hot sauce, or double up on whatever ingredients you like best. Keep the dry-to-wet ratios the same and you can’t go wrong.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2021/02/04/dining/ml-party-mix/merlin_183223977_890fbe6c-4c26-476c-9d6d-8db2fabda4d0-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "About 15 cups", "recipeCuisine": "american", "recipeCategory": "snack, finger foods, appetizer, side dish", "keywords": "butter, crackers, hot sauce, nuts, super bowl, tailgate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 489}, "recipeIngredient": ["9 cups rice, corn or wheat Chex or Crispix cereal, or a combination", "2 cups any kind of lightly salted nut", "2 cups small pretzels", "3 cups add-ins, such as cheese crackers, rice crackers, bagel chips, sesame sticks or a combination", "1/2 cup unsalted butter (1 stick)", "2 tablespoons Worcestershire sauce", "1 to 2 tablespoons hot sauce, plus more to taste", "1 teaspoon garlic powder, plus more to taste", "1 teaspoon onion powder, plus more to taste", "1/4 teaspoon sweet or smoked paprika", "1 1/2 teaspoons fine sea salt", "1/4 teaspoon black pepper, plus more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange racks in the top and bottom thirds of the oven and heat to 250 degrees. Line two sheet pans with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine cereal, nuts, pretzels and add-ins in a very large bowl. In a medium, microwave-safe bowl, melt butter in the microwave in 20-second increments, about 1 minute. (You can also do this in a small saucepan over low heat on the stovetop.) Add Worcestershire sauce, hot sauce, garlic powder, onion powder, paprika, salt and pepper. Stir until well mixed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half of the melted butter mixture to the cereal mixture. Gently and thoroughly fold to combine. Add the rest of the melted butter mixture and stir until evenly coated. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the mixture evenly across the prepared pans. Bake, stirring and switching racks every 15 minutes, until crisp and slightly darkened in color, about 1 hour. Cool completely on the pans on wire racks before serving (if you can wait that long). Store in an airtight container for up to 3 weeks."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021861-spicy-party-mix"}