{"@context": "http://schema.org", "@type": "Recipe", "name": "White Borscht", "description": "This white borscht, a nod to the tradition of sour soups in Ukrainian cooking, is simply a perfect meal: rich and satisfying, yet bright and delicate and clean all at once. It’s given its distinct tang up front, by soaking a hunk of sourdough bread in the simmering broth, and also at the end, by whisking in a little crème fraîche before serving. At the center is the delicious, subtle, complex broth. The better the kielbasa, the better the broth, obviously, and it’s worth using the whole garland for that complex smoky seasoning it imparts. There’ll be extra for snacking. The chopped dill keeps it all bright and fresh and lively in the mouth. A year-round classic to have in your repertoire, it’s especially beloved in colder months. When weather forecasters announce a dismal spell of sleeting days in a row, you’ll think, oh, good! White borscht weather!  ", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2020/12/13/magazine/13mag-eat/13mag-eat-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "5 quarts", "recipeCuisine": "eastern european", "recipeCategory": "dinner, lunch, sausages, soups and stews, appetizer, main course, side dish", "keywords": "bay leaves, butter, crème fraîche, kielbasa, leek, potato, sourdough, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1301}, "recipeIngredient": ["2 1/2 pounds full horseshoe link of high-quality smoked kielbasa", "5 fresh bay leaves", "3 pounds leeks (6 long, lively leeks)", "3 pounds russet potatoes", "1 cup unsalted butter (2 sticks)", "1 large yellow onion, small-diced (about 2 cups)", "6 garlic cloves, minced", "Kosher salt, such as Diamond Crystal", "1 (4-ounce) hunk of dense, very sour sourdough bread, crusts removed", "1 full tablespoon finely ground black pepper", "1/2 cup crème fraîche", "1 bunch fresh dill, woody stems removed, fronds minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut kielbasa into 4 equal lengths, and cover in a pot with 3 quarts cold water and the bay leaves. Bring to a boil, then let gently boil for 25 minutes more until swollen and cooked through and beads of oil have formed. Pull sausages from the now smoky and seasoned water, and set aside. Save that water!"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the kielbasa simmers, split leeks in half lengthwise, then soak and rinse in cold water to thoroughly remove all sand. Slice leeks into 3/8-inch half-moons from whites to dark greens, as far up as is viable."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel potatoes, trim all four sides to stabilize on the cutting board and trim both ends to “box” the potato. Save the scraps. Cut the boxes into large cubes, about 3/4-inch square."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a sturdy soup pot, melt 1 stick butter over low heat until foaming. Stir in onion, garlic and a healthy pinch of salt, and let them sweat for a full 5 minutes until translucent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in remaining butter, the sliced leeks and another generous pinch of salt, then let sweat slowly over low heat for 8 minutes until moist, bright green and glossy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potato scraps, the cube of bread and half the kielbasa boiling liquid. Let gently simmer 10 minutes while the potato scrap softens and the bread hunk becomes flabby and swollen. If you need to increase the heat to get a little simmer going, do so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, slice kielbasa in half lengthwise. Place two pieces back into the soup pot as is, and then slice the remaining 6 pieces into very thin, 1/8-inch half-moons, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Retrieve the soggy lump of sourdough bread with a slotted spoon, and don’t worry if you also get a few bits of leek or onion or whatever is floating in the soup when you pull it out. Also remove about 1 cup of liquid, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potato cubes and the rest of the kielbasa liquid to the pot. Add another pinch of salt and half the black pepper. Let it come back to temperature, and then to simmer until potatoes are cooked through, about 25 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using either a stick blender or a traditional blender, purée the sodden hunk of bread until foamy, using some of the liquid you pulled in Step 8, if needed. Stir this back into the soup pot once the potatoes are cooked through, and add the sliced kielbasa as well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the crème fraîche with 1/2 cup of the hot reserved liquid; stir mixture into the soup. Stir in the chopped dill and the remaining 1/2 tablespoon pepper. Serve very hot."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021711-white-borscht"}