{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Rolls", "description": "These extremely soft and fluffy potato rolls make excellent slider buns or a perfect accompaniment to just about any meal. Creamy and starchy Yukon Gold potatoes work well here, as do russets. Boil them until tender, then make sure to save the water you boiled them in, because you’ll use that in the dough, too. Eat the rolls warm, slathered with butter, or turn them into a delicious sandwich. Either way, they stay soft and delicious for a couple of days at room temperature.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2021/02/18/dining/ya-potato-rolls/merlin_183942219_3d37c507-cf3d-47ca-831f-75720a6c50c3-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "9 rolls", "recipeCuisine": "american", "recipeCategory": "snack, breads, side dish", "keywords": "active dry yeast, butter, egg, flour, potato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 345}, "recipeIngredient": ["1 medium Yukon Gold or russet potato (about 6 ounces), peeled and cut into 1-inch pieces", "1 teaspoon active dry yeast", "4 teaspoons granulated sugar", "1/4 cup/57 grams unsalted butter (1/2 stick), melted and cooled, plus more for greasing ", "1 large egg, at room temperature", "3/4 teaspoon kosher salt", "2 1/2 cups/320 grams all-purpose flour, plus more for dusting", "Olive oil, for greasing the bowl"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the potato in a medium pot or saucepan and cover with water. Bring to boil over high and cook until the potato pieces are very tender, about 10 to 15 minutes. Use a slotted spoon to transfer to a bowl, then use a fork to thoroughly mash the potato. Measure 2/3 cup/130 grams of mashed potato and set aside until cooled. Measure 1/2 cup/120 milliliters of the potato cooking liquid and add it to a large bowl. Let the water cool to about 100 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the yeast and 1 teaspoon sugar over the top of the reserved potato cooking liquid. Let sit until the yeast is activated and foamy, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 3 teaspoons sugar, the reserved mashed potato, and the butter, egg and salt to the bowl. Stir to combine. Add the flour and stir to combine. The dough will be shaggy at first, but it will come together. Turn the shaggy dough out onto a surface and knead until the dough is smooth and slightly tacky, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dough into a clean, oiled bowl and rub the surface of the dough with a bit of oil. Cover with plastic wrap or a kitchen towel and let rise in a warm spot until doubled in size, 1 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a 8-inch square metal baking pan. Turn the dough out onto a work surface, and cut into 9 even pieces (about 75 grams each). Fold the edges of each piece of dough toward the center and pinch together the edges. Place each ball, seam side down on a surface, then cup your hand over the dough and use the surface and your hand to roll the dough into a tight ball. Use a very light dusting of flour, if necessary, to keep the dough from sticking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dough balls into the prepared pan, cover, and let rise in a warm place until the dough balls are puffy and touching one another and almost doubled in size, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees with a rack set in the center. Bake the rolls until golden brown and cooked through, about 20 to 25 minutes. Let rolls cool in the pan for about 5 minutes before serving. These rolls will keep for a day or two in an airtight container at room temperature. Rewarm before serving, if desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021937-potato-rolls"}