{"@context": "http://schema.org", "@type": "Recipe", "name": "Cabbage, Feta and Dill Piroshki", "description": "There are as many possible fillings for piroshki as there are countries that claim the yeasted, stuffed buns as their own. In Russia and Ukraine, where they are an especially popular street food, you’ll find versions that are baked and versions that are fried with fillings both sweet and savory. In this baked version, the slightly sweet, butter- and egg-enriched dough encloses a filling of silky cooked green cabbage, which provides a nice counterpoint to salty feta. Once you’ve made these a couple times, you might start dreaming up your own fillings. Piroshki are a wonderful way to use up odds and ends.", "author": {"@type": "Person", "name": "Jessica Battilana"}, "image": "https://static01.nyt.com/images/2020/08/20/dining/jb-piroshki/jb-piroshki-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "15 piroshki", "recipeCuisine": "eastern european", "recipeCategory": "breads, appetizer, side dish", "keywords": "butter, cabbage, dill, egg, feta, flour, onion, yeast", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 119}, "recipeIngredient": ["1 cup/240 milliliters milk, warmed", "1 tablespoon granulated sugar", "1 1/2 teaspoons active dry yeast", "3 to 3 1/4 cups/385 to 415 grams all-purpose flour, plus more for rolling the dough", "1 large egg, at room temperature", "1 tablespoon unsalted butter, softened", "1/2 teaspoon kosher salt", "Nonstick cooking spray", "1 large egg, beaten with 1 teaspoon water, for egg wash", "4 tablespoons/55 grams unsalted butter (1/2 stick)", "1 onion, thinly sliced", "1 small green cabbage (about 1 1/2 pounds/680 grams), cored and cut into 1/2-inch ribbons", "Kosher salt and black pepper", "1 cup/about 225 grams crumbled feta ", "1/2 cup/30 grams finely chopped fresh dill", "Flaky salt, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In the bowl of a mixer fitted with the dough hook attachment (or in a large bowl with a wooden spoon), combine the milk and sugar. Sprinkle the yeast on top and let stand 5 minutes until foamy. With the mixer on low speed, add 3 cups/385 grams of the flour, the egg, the butter and the salt, and mix until combined. Increase the speed to medium, and mix until the dough comes together in a smooth ball. The dough will be soft but should not stick to your fingers. If it does, add more flour by tablespoons. Cover the bowl with plastic wrap and let stand in a warm place until doubled in size, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the dough rises, make the filling: In a large (12-inch) high-sided skillet over medium heat, melt the butter. Add the onion, cabbage and a few generous pinches of salt, stir to coat with butter and cook, stirring frequently, until the cabbage is soft and tender but not browned, and all the liquid has cooked off, 15 to 20 minutes. Remove from the heat and let cool, then stir in the feta, dill, and more salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 2 baking sheets with parchment paper. Gently punch down the dough, transfer to a work surface and divide into 15 pieces, each about 1 1/2 ounces/45 grams. Roll the pieces into balls, then cover them loosely with a clean dish towel. Working with one piece of dough at a time, roll into a 4-inch/10-centimeter circle using a rolling pin. (If your dough is particularly sticky, you can dust your work surface with a bit of flour, but adding too much flour makes rolling the dough difficult, so be cautious.) Add 2 to 3 tablespoons filling to the center of each dough round. Pull the dough up and around the filling, pinching the dough firmly to enclose the filling. Place seam-side down, 2 inches apart, on the prepared baking sheets. Repeat with the remaining dough and filling. (The piroshki can be made up to this point and frozen for up to 1 month. Freeze on the baking sheet, then transfer to a resealable freezer storage bag. Bake as directed below, adding 2 to 3 minutes to the total baking time.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the racks in the top and bottom third of the oven, and heat oven to 375 degrees. Lightly spray a sheet of plastic wrap with nonstick cooking spray, cover each pan of piroshki and let stand at room temperature until puffy, 30 minutes. Brush the tops of each with egg wash and sprinkle with flaky salt, if using, or kosher salt. Bake until browned, 20 to 25 minutes, rotating the pans and switching oven racks halfway through baking. Transfer the piroshki from the sheet pan to a wire rack and let cool. Serve warm or at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021382-cabbage-feta-and-dill-piroshki"}