{"@context": "http://schema.org", "@type": "Recipe", "name": "Spam Macaroni and Cheese", "description": "This decadent yet simple recipe pairs creamy macaroni and cheese with crispy, salty-sweet diced Spam for a dish that bridges Puerto Rico and the South. It’s much quicker than most homemade macaroni and cheese recipes (which often require making a roux and cream sauce), without sacrificing texture or flavor. It is also incredibly adaptable, because it will work with most cheeses. If you have the time and the will, sprinkle the finished macaroni with extra cheese and bake under a low broil for 5 to 10 minutes until toasted. During tough times, a box of instant mac and cheese and a can of Spam will also yield delicious results.", "author": {"@type": "Person", "name": "Von Diaz"}, "image": "https://static01.nyt.com/images/2020/10/28/dining/26resiliencerex1/merlin_177593415_6b0acdb5-2f59-418e-921b-01165996e76e-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "american, southern", "recipeCategory": "dinner, casseroles, meat, noodles, main course, side dish", "keywords": "cheddar, cheese, macaroni, milk, monterey jack cheese", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 111}, "recipeIngredient": ["1 (12-ounce) can Spam, cut into 1/4-inch cubes", "Kosher salt", "1 pound dried macaroni", "3 cups whole milk", "3 tablespoons all-purpose flour", "4 1/2 to 5 cups shredded cheese (about 20 to 24 ounces), preferably a combination of Monterey Jack and sharp yellow Cheddar", "1/4 teaspoon ground white pepper", "1/4 teaspoon ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 4 quarts of water to a boil over high heat in a large, heavy pot or Dutch oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat a large nonstick skillet or wok over medium-high, then add Spam and fry for about 10 minutes, stirring often, until the meat is evenly browned and crispy. (Feel free to taste along the way until the Spam reaches your desired crispness.) Remove from heat until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once water has come to a rolling boil, add a fistful of salt, then stir in the macaroni. Cook according to package instructions, stirring several times, until al dente, about 7 to 9 minutes. Drain the noodles in a large colander, then rinse the noodles and the pot with lukewarm water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pot to stovetop over medium heat and add 2 cups milk. While the milk is warming, combine remaining 1 cup milk and the flour in a medium bowl and whisk together until there are no lumps. Once the milk starts to steam, whisk in the milk-and-flour mixture, and continue to whisk gently until a béchamel forms as thick as plain yogurt, about 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the sauce is thickened, reduce heat to low and slowly whisk in 4 cups shredded cheese until fully melted. Add white and black pepper, then season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Off heat, add Spam and cooked macaroni, and fold a dozen or so times until thoroughly mixed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately, passing the extra cheese at the table, or transfer the macaroni to a casserole, sprinkle with the remaining cheese, and bake under low broil until toasted on top, about 5 to 10 minutes."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021436-spam-macaroni-and-cheese"}