{"@context": "http://schema.org", "@type": "Recipe", "name": "Classic Trifle With Berries or Citrus", "description": "Trifles are as adaptable as desserts get. As long as you have layers of cake, custard, some kind of fruit or jam, and a fluffy cloud of whipped cream on top, they make festive desserts that you can vary as much as you like. While most trifles are boozy — the cake soaked with sherry or other spirits — orange juice makes a fine alternative, especially if you pair it with syrupy sugared orange segments. Or go more traditional, and use berries and sherry. This trifle is more about the interplay of soft vanilla-scented custard, whipped cream and fruit, with only one layer of cake at the bottom of the dish. If you’d like a higher cake-to-custard ratio, add more ladyfingers as directed in Step 9. And don’t neglect the garnish. Topping the trifle with sliced almonds or amaretti lends crunch and looks pretty, too.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/12/16/dining/11apperex/merlin_180930069_5941ee28-f525-45fd-a147-ad8152565adb-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "british", "recipeCategory": "parfaits and trifles, dessert", "keywords": "berries, cream, ladyfingers, orange, sherry, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 354}, "recipeIngredient": ["1/3 cup/65 grams granulated sugar", "2 1/2 tablespoons/20 grams cornstarch", "Pinch of fine sea salt", "4 egg yolks", "1 cup/240 milliliters heavy cream", "3/4 cup/180 milliliters whole milk", "Optional flavorings: 1 teaspoon orange or lemon zest, 1 cinnamon stick or 6 cardamom pods", "2 teaspoons vanilla extract", "1 1/2 cups berries or 3 oranges (a mix of blood oranges and navel is pretty)", "1 to 2 teaspoons granulated sugar", "About 6 to 8 ladyfingers (also called Savoiardi or boudoir biscuits, or use sponge cake or poundcake), plus more if desired", "Berry jam or orange marmalade", "1/4 cup sherry, Madeira, dessert wine, brandy or orange juice, plus more as needed", "1 cup/240 milliliters heavy cream", "1 tablespoon confectioners’ sugar", "Sliced almonds, candied citrus peel, crumbled amaretti or berries, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the custard: In a large bowl, combine sugar, cornstarch and salt. Add egg yolks and whisk until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, heat cream, milk and any of the optional flavorings over medium heat until simmering."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly whisk 1/2 cup hot cream mixture into yolk mixture until well mixed. Whisking egg mixture constantly, slowly pour in remaining cream. Pour the egg mixture back into the saucepan and place it over medium-low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook custard, stirring continuously especially around the bottom and edges of the pot, until the custard has thickened enough to mound on the spoon, 5 to 10 minutes. Don’t let it come to a boil, but a few simmering bubbles is fine. If it starts to curdle at any point, remove pot from the heat and whisk it intensely. It should smooth out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the custard is thick, scrape it into bowl, whisk in vanilla, and press a piece of plastic wrap directly onto its surface. Let the custard cool for at least 30 minutes. At this point, custard can be chilled for up to 3 days, or used to assemble the trifle. Pluck out cinnamon stick or cardamom pods, if using, just before assembling trifle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the fruit: If using berries, put them in a bowl, sprinkle with sugar to taste, and use a fork to mash them. If using oranges, supreme them: Cut the tops and bottoms off each one, squeezing the juice from the severed pieces into a bowl. Using a paring knife, cut the peel and all the white pith off the fruit. Working over the bowl to catch the juices, slice the segments away from the membrane, letting fruit fall into the bowl. It’s OK if the segments fall apart; you’re going to break them up anyway. When all the segments are cut out of the membranes, squeeze the membranes over the bowl to release as much of the juice as possible. Sprinkle oranges with sugar, to taste, and, using your hands, break the segments up into pieces. You want a pulpy, juicy mix in the bowl. There should be a lot of liquid. Let oranges or the berries macerate for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the trifle, spread the ladyfingers on one side with a thick layer of jam or marmalade. Put the ladyfingers, jam-side down, in the bottom of a medium (6- to 8-cup) trifle dish or any other serving bowl or dish (or use individual dishes, cups or glasses). You want to cover the bottom completely and, if you are using a bowl, go a little bit up the sides; break up the ladyfingers if needed to make them fit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle sherry (or whatever liquid you are using) over the ladyfingers, making sure they are well moistened. Be generous: You don’t want any dry bits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon fruit and all their juices over ladyfingers. Top with custard. If you like a higher cake-to-custard ratio, you can break up a few more ladyfingers and scatter them on top of the custard, then drizzle with more sherry. Press a piece of plastic wrap directly onto the surface and refrigerate for at least 3 hours or up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, using an electric mixer or a whisk, beat the cream and confectioners’ sugar until fluffy; it should hold a light peak. Spoon whipped cream on top of trifle and garnish as you like. Serve immediately. (Leftovers will keep covered in the refrigerator for 2 or 3 days.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021727-classic-trifle-with-berries-or-citrus"}