{"@context": "http://schema.org", "@type": "Recipe", "name": "Crème Fraîche Poundcake", "description": "Old-fashioned poundcake recipes don’t typically contain any chemical leavening, relying on the power of eggs and elbow grease to raise the crumb. Modern recipes often mix in a little baking powder or soda to lighten things up — but how much can be up to the cook. Adding 1/2 teaspoon baking powder will give the cake a dense and velvety interior; using the whole teaspoon makes it slightly airier and softer. Either way, this buttery loaf cake has a gentle tang from the crème fraîche, which is also featured in the candylike glaze. You’ll need a 9-by-5-inch loaf pan to accommodate all the batter. If your loaf pan is smaller, bake any extra batter in a greased ramekin on the side.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/08/26/dining/21apperex/merlin_175613250_8228bb1a-68cb-44dd-8752-4fb497175f7d-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "cakes, quick breads, dessert", "keywords": "butter, crème fraîche, egg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1087}, "recipeIngredient": ["1 cup/225 grams unsalted butter (2 sticks), at room temperature, plus more for greasing the pan", "1 1/4 cups/250 grams granulated sugar, plus more for coating the pan", "1 1/2 cups/190 grams all-purpose flour", "1 1/2 tablespoons/10 grams cornstarch", "1/2 to 1 teaspoon baking powder", "1/2 teaspoon fine sea salt", "4 eggs, at room temperature", "1/3 cup/80 milliliters crème fraîche (or sour cream), at room temperature", "1 tablespoon vanilla extract or dark rum", "1 1/2 cups/185 grams confectioners’ sugar", "1 tablespoon vanilla extract or dark rum", "2 tablespoons crème fraîche"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Thoroughly butter a 9-by-5-inch loaf pan, including the rim. Sprinkle a little sugar into the pan, tilting to coat the bottom and sides in a thin, even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the flour, cornstarch, baking powder and salt. (Using 1/2 teaspoon baking powder yields a dense and velvety interior, while 1 teaspoon makes the cake slightly airier and softer.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl using an electric mixer, either hand-held or a stand mixer fitted with the paddle attachment, cream the butter and sugar until light and fluffy, 3 to 4 minutes. Beat in the eggs, one at a time, beating well between additions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer set on low speed, beat in half the flour mixture. Beat in the crème fraîche, then the remaining flour mixture, scraping down the sides of the bowl with a rubber spatula. Beat in the vanilla extract."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the mixture into the prepared pan and smooth the top. (Depending on your pan, it may fill it all the way to the top, and that is OK.) Bake until the cake is browned on top and a cake tester inserted into the center comes out clean, 55 to 65 minutes. Transfer to a wire rack to cool for a few minutes while you make the syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine 1 cup/120 grams of the confectioners’ sugar, vanilla extract or rum, and 2 tablespoons water, whisking until smooth. (It should be quite thin. Add more water, if needed.) Using a long, thin paring knife, pierce the cake all over about 20 times, poking all the way through. Spoon 4 tablespoons of the syrup over the warm cake. Reserve remaining syrup in the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the cake has cooled in the pan for an hour, run a thin metal spatula or butter knife around the edges to release them from the pan, then unmold the cake onto the rack to finish cooling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk crème fraîche and remaining 1/2 cup/60 grams confectioners’ sugar into the syrup until you get a thick glaze, as thick as heavy cream. Add a little more confectioners’ sugar or water if needed to get the right texture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the glaze over the top of the cake, letting it drip down the sides. Let the glaze set for at least 15 minutes before slicing."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021389-creme-fraiche-poundcake"}