{"@context": "http://schema.org", "@type": "Recipe", "name": "Applejack Butter Pecan Bundt Cake", "description": "A traditional flavor combination (butter pecan) melds with a modern one (salted caramel) in this magnificently burnished golden cake. Brian Noyes opened Red Truck bakery in 2008 on the eastern edge of Virginia’s Shenandoah Valley, where plentiful local produce was part of the draw. A dose of aged apple brandy (he uses a local product, Catoctin Creek) keeps the sweetness in check, but bourbon or any aged brandy will do the job. For a nonalcoholic version, simply omit the brandy from the sauce, and swap in apple juice or cider in the cake batter.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2021/02/03/dining/1applejackrex2/1applejackrex2-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "cakes, dessert", "keywords": "apple brandy, applejack, cream cheese, egg, flour, heavy cream, pecan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 101}, "recipeIngredient": ["3/4 cup/150 grams granulated sugar", "1/2 cup/120 milliliters heavy cream, at room temperature", "1/4 cup/60 milliliters applejack or apple brandy, plus more to taste", "1/2 cup/115 grams unsalted butter (1 stick), at room temperature", "1 1/2 teaspoons pure vanilla extract", "1/4 teaspoon kosher salt, plus more to taste", "Nonstick cooking spray", "2 cups/400 grams granulated sugar", "1/2 cup/115 grams unsalted butter (1 stick), at room temperature", "1/4 cup/55 grams cream cheese, at room temperature", "4 large eggs, at room temperature", "1 teaspoon pure vanilla extract", "2 1/2 cups/320 grams unbleached all-purpose flour", "2 teaspoons baking powder", "1/4 teaspoon kosher salt", "3/4 cup/180 milliliters whole milk", "1/4 cup/60 milliliters applejack or apple brandy", "1 cup/120 grams coarsely chopped pecans"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the caramel sauce: This calls for close attention; don’t wander off, but do use the time to measure out the ingredients for the cake. In a medium saucepan, combine the sugar with 1/4 cup water. Swirl together and bring to a boil over high heat, brushing down the sides of the pan with a wet pastry brush to prevent sugar crystals from forming (or use a nonstick saucepan)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once it comes to a boil, cook over medium-high heat (do not stir, but it’s OK to swirl the pan occasionally) until the mixture is bubbling at a slower pace and has turned a deep golden brown, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat, then gradually and carefully stir in the cream (it will splatter a bit). Add the applejack, butter, vanilla and salt, stirring until thoroughly combined and smooth. Taste and add more applejack and salt, if desired. You’ll use 1/4 cup of this caramel sauce in the cake batter, and the rest for brushing on the cake after baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Heat the oven to 350 degrees. Grease the inside of a 9- or 10-inch Bundt-style pan, preferably nonstick, with nonstick cooking spray. If your pan is not nonstick, refrigerate the greased pan for 10 minutes, then grease it again to thoroughly coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, cream the granulated sugar, butter and cream cheese on medium speed until light and fluffy, about 3 minutes. Scrape down the sides of the bowl. Reduce the speed to medium-low, add the 1/4 cup caramel sauce and beat until combined. Add the eggs one at a time, beating well after each addition, then add the vanilla and beat until just combined. Scrape down the sides of the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, sift together the flour, baking powder and salt. With the mixer running on low speed, add a third of the flour mixture, then the milk, then another third of the flour mixture, then the applejack, and finally the remaining flour mixture, mixing until well combined after each addition. Remove the bowl from the mixer and stir in the pecans by hand just until evenly distributed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared Bundt pan. Bang the filled pan on the counter a couple of times to release any air bubbles. Bake for 45 to 60 minutes, until the cake is well browned and starts pulling away from the sides of the pan, and a toothpick inserted into the thickest part of the cake comes out clean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool in the pan for 5 minutes; the steam will help with release. Set a wire rack on a rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flip the cake (still in the pan) onto the rack and let cool another 5 to 10 minutes. The cake may drop out of the pan as it cools. If not, shake the pan to loosen it, running a knife around the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, warm the remaining caramel sauce. When the cake is turned out on the rack, brush sauce over the entire surface. Let it soak in, then repeat once or twice more until the cake is well coated. Let cool for 1 hour before serving; the caramel will become somewhat set and be much less sticky."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021802-applejack-butter-pecan-bundt-cake"}