{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Roasted Beef", "description": "With the aid of a digital thermometer and plenty of hands-off time, this recipe makes the best of an inexpensive beef roast, which really shines when thinly sliced and reused in flavor-packed dishes over the next week. Though the recipe suggests a 2- to 3-pound roast, it will work for one of any size. (Just be aware that the timing will change accordingly.) As the beef rests in the fridge, it will initially darken in color and may later turn brown or gray; this is due to the oxidation of muscle pigments and is expected. Once you start cooking, always rely on your thermometer, not your timer. To test for doneness without a thermometer, insert a thin metal skewer all the way through the meat and hold it there for 10 seconds. Rapidly remove the skewer and touch it to the skin under your lower lip. It will feel like a hot bath water at rare.", "author": {"@type": "Person", "name": "J. Kenji López Alt"}, "image": "https://static01.nyt.com/images/2020/05/05/dining/05Kenjirex2/05Kenjirex2-articleLarge-v3.jpg", "totalTime": "P1DT3H", "recipeYield": "1 (2- to 3-pound) roast", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, meat, roasts, sandwiches, main course", "keywords": "eye round, top round beef, tri-tip steak", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 426}, "recipeIngredient": ["1 (2- to 3-pound) inexpensive lean beef roast, such as tri-tip, top round or eye round", "Kosher salt and freshly ground black pepper", "2 tablespoons vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat roast dry with paper towels. Rub generously with salt (at least 1/4 cup) and pepper on all sides. Shake the roast gently, allowing any excess salt and pepper to fall off."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a wire rack in a small rimmed baking sheet or lay 5 to 6 metal skewers across a large plate or baking sheet. Place roast on top of rack or skewers, making sure it is fully elevated above the bottom of the baking sheet. Place elevated roast on the bottom rack of your refrigerator, uncovered (or loosely covered with foil, if you are squeamish about raw meat), and let rest undisturbed for at least 24 hours and up to 48 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer baking sheet with elevated roast directly from the refrigerator into a cold oven and set oven temperature to 225 degrees. Cook until the center of the roast reaches 120 degrees for rare, or 130 degrees for medium, as tested with a digital thermometer. Depending on the oven and the exact geometry of the roast, this will take 1 to 2 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove baking sheet with roast from oven and set on a trivet or on top of your stovetop. Let the roast rest on the baking sheet for at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat vegetable oil in a large skillet (any heavy skillet without a nonstick coating will do) over high until lightly smoking. Sear roast, turning occasionally, until well browned on all sides, about 4 minutes total."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carve into thin slices with a sharp knife and serve what you’ll eat today. When finished, carve remaining roast. Carefully lay fanned slices into zipper-lock freezer bags in layers no thicker than 1/2 inch. Squeeze out as much air as possible and stack sealed bags on an aluminum baking sheet. Place in freezer until completely frozen. Store frozen for up to 2 months."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To thaw, place one bag of frozen sliced steak on an aluminum baking sheet at room temperature until defrosted, about 45 minutes. It is important to use an aluminum sheet, as the high thermal conductivity of aluminum greatly speeds up the thawing process. Use thawed sliced steak as desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021032-slow-roasted-beef"}