{"@context": "http://schema.org", "@type": "Recipe", "name": "Maque Choux", "description": "This classic Cajun side dish is a sweet, hot, juicy, milky, buttery combination of corn, onions and peppers. It’s often cooked in rendered bacon fat and enriched with heavy cream, but this version relies upon only butter and a little water in their place, which allow the ingredients’ flavors to sing more clearly. While it is commonly understood that Fat Equals Flavor, there is a point at which too much fat actually masks complexities in flavors and dulls their vibrancy. Try the maque choux this way and see if you notice how bold and lively it tastes. If you miss the smokiness that bacon imparts, try instead a pinch of smoked paprika stirred in at the end.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2020/06/21/magazine/21mag-eat/21mag-eat-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "About 1 generous quart", "recipeCuisine": "american", "recipeCategory": "dinner, easy, quick, weeknight, vegetables, main course, side dish", "keywords": "bell pepper, butter, celery, corn, poblano chile, red onion, serrano chile, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 737}, "recipeIngredient": ["3 fresh ears of corn, shucked", "8 tablespoons unsalted butter (1 stick)", "1/2 red onion, cut into small dice", "2 celery ribs, cut into small dice", "Kosher salt", "1 red bell pepper, cored, seeded and cut into small dice", "1 small poblano pepper, cored, seeded and cut into small dice", "1 small serrano chile, very thinly sliced", "Freshly ground black pepper", "Smoked paprika (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with 1 corn cob at a time, set the ear of corn upright in a medium bowl. Shave the corn from the cob by slicing down the sides using the tip of a sharp chef’s knife, holding the knife almost vertical. (This gives you neat tablets of corn that land squarely in the bowl and keeps the kernels from scattering all over the counter.) Using the back of the knife, scrape each cob to release all the nibs and the “milk” of the kernels into the bowl. Repeat with remaining ears of corn, then snap the cobs in half, and add them to the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, deep sauté pan, melt 3 tablespoons butter over medium heat until foaming. Add onion and celery, and season with 1 or 2 pinches of kosher salt. Stir constantly until softened and translucent but not browned, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 tablespoons butter and the bell pepper, poblano and serrano, and stir constantly, adding another pinch of kosher salt, letting the butter melt and the peppers soften and become translucent, about 2 or 3 minutes. You will smell the peppers’ sweetness and their mild capsaicin releasing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the final 3 tablespoons butter and the corn mixture from the bowl, cobs included, and another pinch of kosher salt. Stir constantly to coat with the butter and combine thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When everything starts to hiss and sound hot, but isn’t cooking so hard as to take color, add 1/2 cup water and a healthy few grinds of black pepper, and cover the pan for a couple of minutes to steam/shallow braise the mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lid, and stir well, noticing the corn releasing its liquid and the kernels softening, and the cobs turning somewhat translucent, if however vague. You will notice a general softening and melding together. Return the lid, and let cook a few more minutes, noticing the water evaporating and the remaining liquid reducing and gaining some “body” and gloss. Discard the corn cobs, but do suck them before tossing — those buttery juices make a nice cook’s treat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste for salt, and serve. It should be sweet, spicy, a bit wet and surprisingly complex, given the few ingredients and their ordinariness. If you want a smoky taste, add a good pinch of smoked paprika."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021176-maque-choux"}