{"@context": "http://schema.org", "@type": "Recipe", "name": "Ramen With Charred Scallions, Green Beans and Chile Oil", "description": "Scallions can be so much more than a garnish. Raw scallions bring an assertive pungency, but when cooked, they take on a sweet tenderness that is very pleasing to the palate. In this vegan recipe, treat scallions as you would a bunch of greens. Take cues from the Chinese cooking technique used for stir-fries, and add the scallions to very hot oil to let them “bao” (to crack, explode or burst), drawing out their natural aroma. Those packets of ramen noodles stashed in your pantry are perfect for this quick yet intensely satisfying weeknight noodle dish. The chile oil makes just enough for this dish, so if you want extra for future meals, make double.", "author": {"@type": "Person", "name": "Hetty McKinnon"}, "image": "https://static01.nyt.com/images/2020/08/23/dining/hm-ramen/hm-ramen-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weekday, weeknight, noodles, main course", "keywords": "green beans, ramen noodle, red pepper flakes, scallion, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2699}, "recipeIngredient": ["2 tablespoons red-pepper flakes (see Tip)", "1 1/2 teaspoons kosher salt", "1/2 cup neutral oil, such as grapeseed, vegetable or canola", "1 (1-inch) piece ginger, peeled and finely chopped", "2 garlic cloves, finely chopped", "2 teaspoons toasted white sesame seeds", "1 teaspoon sesame oil", "Kosher salt ", "4 (3-ounce) packages ramen noodles, seasoning packs discarded", "2 bunches scallions (10 to 12 scallions), white and green parts separated and cut into 2-inch pieces", "2 to 3 tablespoons neutral oil, such as grapeseed, vegetable or canola", "10 ounces green beans, trimmed and halved diagonally", "1 (2-inch) piece ginger, peeled and julienned", "White pepper", "1 tablespoon toasted white sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chile oil: Add the red-pepper flakes and salt to a heatproof bowl. Place the oil, ginger and garlic in a small saucepan, and heat over medium until it bubbles, 2 to 3 minutes. Remove from the heat and very carefully pour the hot oil over the red-pepper flakes. Add the sesame seeds and sesame oil, and stir well. Set aside while you make the rest of the dish. (Chile oil can be stored in an airtight jar at room temperature for up to a month and indefinitely in the refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the noodles: Bring a large pot of salted water to a boil. Add the ramen and cook according to package instructions, about 3 minutes, until the noodles are just tender. Drain, rinse with cold water and drain well again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the white parts of your scallions lengthwise, in half or quarters, depending on thickness, to make cooking faster."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wok or large (12-inch), deep skillet on high. When smoking hot, add 1 tablespoon of oil, toss in the green beans and season with salt. Cook, tossing the beans, for 2 to 3 minutes, until charred. Remove the beans from the wok, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the same wok or skillet over high, and when smoking, add 1 to 2 tablespoons of oil, along with the scallions (white and green parts) and the ginger. Allow the scallions and ginger to sizzle for 20 to 30 seconds, to release their aromas, then stir-fry for 2 to 3 minutes, until the scallions have a nice scorch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the green beans and noodles back to the pan, along with 2 or 3 tablespoons of the chile oil (reserve some for serving), and season with salt and pepper. Toss well to combine, just until the noodles are heated through. To serve, divide the noodles into bowls, top with toasted sesame seeds and more chile oil."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021339-ramen-with-charred-scallions-green-beans-and-chile-oil"}