{"@context": "http://schema.org", "@type": "Recipe", "name": "The Crunchiest Summer Fruit Crumble", "description": "The secret to this fruit crumble is to bake the sweet, cinnamon-scented topping separately, to dry it out. Then when you pile those crumbs over a mound of juicy summer fruit, they won’t absorb as much liquid, and stay crisp and cookielike. You can make the crumbs a day ahead. But the crumble is best baked on the day you serve it, preferably while still a little warm and brimming with syrupy fruit. Make sure to taste your fruit before adding the sugar. Sweeter fruit like strawberries, cherries and blueberries need less sugar than tart plums and nectarines. A spoonful of whipped cream or ice cream makes this even better.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/07/08/dining/08Appetite-a/merlin_173816487_47d9353f-99db-471b-acc0-de545e6c3d24-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "easy, cookies and bars, pies and tarts, dessert", "keywords": "berries, cherries, ice cream, nectarine, peach, rolled oats, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 985}, "recipeIngredient": ["1 1/2 cups/190 grams all-purpose flour", "1/2 cup/50 grams rolled oats", "1/3 cup/75 grams light or dark brown sugar", "1/3 cup/65 grams granulated sugar", "1/4 teaspoon kosher salt", "1 teaspoon ground cinnamon", "1/2 teaspoon ground cardamom, ginger or allspice, or use lemon zest", "1/2 cup/115 grams unsalted butter (1 stick), melted and cooled", "2 to 5 tablespoon light brown sugar (or granulated sugar), depending on the sweetness of the fruit", "2 tablespoons cornstarch", "8 cups mixed berries (fresh or frozen), or cubed peaches, plums, nectarines, apricots, or pitted sweet cherries (or a combination)", "Ice cream or whipped cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the topping: In a large bowl, whisk together flour, oats, sugars, salt and spices. Stir in butter. Using your hands, squish mixture until coarse crumbs form. Some should be about 1/2-inch in size, some smaller."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread topping in one layer onto a rimmed baking sheet. (You don’t have to grease it first.) Bake until crumbs are solid when you gently poke them, and are fragrant, about 15 minutes. They won’t change appearance very much. Transfer baking sheet to a wire rack to cool while you make the filling. (Crumbs can be baked up to 2 days ahead and stored in an airtight container at room temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: In a large bowl, whisk together sugar and cornstarch until well combined. Add fruit and gently toss to coat with the sugar mixture. Pour filling into an ungreased 2-quart gratin dish or 10-inch cake pan, mounding the fruit in the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon crumbs over filling and place the crumble dish on a rimmed baking sheet to catch any overflowing juices. (You can use the same baking sheet you cooked the crumbs on.) Bake until filling bubbles energetically around the edges, about 55 to 65 minutes. Let cool slightly. Serve warm or at room temperature with ice cream or whipped cream, if you like. Crumble can be made up to 8 hours ahead and kept at room temperature, or warmed up briefly in a 350-degree oven."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021225-the-crunchiest-summer-fruit-crumble"}