{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Tomato and Corn Pie With Cheddar Crust", "description": "In this large-scale galette, cherry tomatoes, fresh corn and scallions are wrapped in a flaky Cheddar crust. The extra step of roasting the tomatoes first yields a pie that’s on the just-right side of juicy. Make sure you bake it long enough, and don’t be afraid to let the crust get deeply golden brown and allow the base to cook through. A good way to test for doneness is to gently shake the baking sheet: A crust that’s not fully baked will stay in place on the baking sheet, whereas a well-baked crust will easily slide from one end to the other. Feel free to substitute another kind of grated cheese for the Cheddar; Gruyère, Monterey jack and Parmesan are all delicious options.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2020/08/04/dining/ejm-corn-and-tomato-pie/ejm-corn-and-tomato-pie-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "1 (15-inch) pie", "recipeCuisine": "", "recipeCategory": "dinner, pies and tarts, vegetables, main course", "keywords": "butter, cheddar, corn, flour, scallion, tomato, fall, summer, father’s day, fourth of july, labor day, memorial day, mother’s day, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 565}, "recipeIngredient": ["2 1/2 cups/320 grams all-purpose flour, plus more for dusting", "1/2 teaspoon kosher salt", "1 cup/225 grams cold unsalted butter (2 sticks), cut into 1/2-inch cubes", "8 ounces/225 grams shredded Cheddar (about 2 cups)", "3/4 cup/180 milliliters ice water, plus more as needed", "7 cups/1 kilogram cherry or grape tomatoes", "1 tablespoon unsalted butter, melted", "2 tablespoons extra-virgin olive oil", "1 teaspoon kosher salt", "3/4 teaspoon black pepper, plus more to taste", "3 cups/435 grams fresh (3 to 5 ears), frozen or canned corn kernels", "1 bunch/120 grams scallions, trimmed and sliced into 1/4-inch pieces", "1 large egg", "Fresh basil, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the Cheddar crust: In the bowl of a food processor, pulse the flour and salt until well combined. Add the butter and pulse until the mixture resembles a coarse meal. There will be visible pieces of butter, but they should be quite small. (You can also do this in a medium bowl with your fingers or a pastry cutter.) Add the shredded cheese and pulse to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mixture to a medium bowl, make a well in the center of the bowl and pour in the ice water. Toss the mixture with your hands to distribute the water throughout the flour. Once the mixture becomes very fine crumbs, knead it a few times until it comes together. If there are portions of the dough that are more hydrated, use your hands to break them up, then incorporate the drier portions of the dough. The dough should not be totally smooth, or overly wet. If needed, add more ice water, 1 tablespoon at a time, until the mixture holds together easily in a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form the dough into a 1-inch-thick disk, and wrap tightly in plastic wrap. Refrigerate for at least 1 hour, or up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Heat the oven to 400 degrees with racks in the upper and lower thirds of the oven. On a baking sheet, combine the tomatoes, melted butter and olive oil; season with salt and pepper. Transfer to the top rack of the oven and roast until the tomatoes have become wrinkly, the skins have browned slightly and they've collapsed, 25 to 30 minutes. Cool completely. (You can complete this step in advance and refrigerate for up to 5 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the tomatoes have cooled completely, gently transfer them to a medium bowl. If they’ve released a lot of liquid, drain the tomatoes in a colander before placing in the bowl. Stir the corn kernels and scallions into the tomatoes; season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with parchment paper. On a lightly floured surface and using a lightly floured rolling pin, roll out the dough into a round about 1/4-inch thick and about 17 inches wide. Roll up the dough onto the rolling pin, wrapping it around the pin, and gently transfer the dough to the prepared baking sheet; unroll. (It will be larger than the baking sheet in the some places; just allow the excess to drape over the edge of the pan.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently transfer the cooled tomato and corn mixture to the center of the dough and spread into an even layer, leaving the outside 2 inches uncovered. Working a little bit at a time, fold the outside edges over the filling, pleating the edges as you work."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk the egg and 1 tablespoon water together to combine. Brush the egg wash around the outside edge of the crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pie to the lower rack of the oven and bake until the crust is deeply golden brown, 50 minutes to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool at least 15 minutes before serving. Serve directly on the baking sheet, or use the parchment paper to slide it onto a cutting board, then slide the parchment away to slice and serve. Serve warm or at room temperature, and garnish with basil just before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021333-roasted-tomato-and-corn-pie-with-cheddar-crust"}