{"@context": "http://schema.org", "@type": "Recipe", "name": "Sesame Tofu With Coconut-Lime Dressing and Spinach", "description": "Coated in panko and sesame seeds, tofu takes on a splendid crunchiness that contrasts with sautéed spinach in this 30-minute dish. It comes together under a fragrant coconut-lime dressing — which you can double, then toss with salad. Swap out the spinach to your taste: Try this with mustard greens or chopped collard greens, adjusting the cooking time accordingly. Be careful when handling the uncooked tofu once it is breaded, as the breading is delicate. Using a pair of kitchen tongs or two forks to grab the tofu from the sides will help prevent its crumbling or falling apart. Serve this satisfying main by itself, or alongside a bowl of rice.", "author": {"@type": "Person", "name": "Nik Sharma"}, "image": "https://static01.nyt.com/images/2021/03/11/dining/ns-crispy-tofu-2/ns-crispy-tofu-2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weekday, beans, main course", "keywords": "coconut milk, egg whites, extra-firm tofu, lime, panko, sesame oil, sesame seeds, spinach, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1495}, "recipeIngredient": ["1/4 cup unsweetened coconut milk", "1 lime, zested and juiced (1 teaspoon zest and 2 tablespoons juice)", "2 tablespoons sambal oelek", "1 tablespoon dark brown sugar", "1/4 cup pure sesame oil (or toasted sesame oil, for stronger flavor)", "Fine sea salt", "1 (12-ounce) package extra-firm tofu, cut into 8 equal rectangles", "1/2 cup panko bread crumbs (or 1/4 cup cornstarch, for a gluten-free option)", "1/2 cup white sesame seeds (or a mix of black and white)", "1/2 teaspoon black pepper", "Fine sea salt", "2 large egg whites", "1/4 cup neutral oil, such as grapeseed, for pan-frying", "2 tablespoons neutral oil, such as grapeseed", "1 shallot, peeled and minced", "2 garlic cloves, peeled and thinly sliced", "20 ounces spinach", "1 tablespoon low-sodium soy sauce", "1/2 teaspoon ground black pepper", "Fine sea salt", "2 tablespoons minced chives, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dressing: In a medium bowl, whisk together coconut milk, lime zest and juice, sambal oelek and brown sugar until sugar dissolves completely. Slowly stream in the sesame oil and whisk until the mixture is emulsified and creamy. Taste and season with salt as needed; set aside. (You’ll have 3/4 cup dressing. Save any extra in an airtight container in the refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the tofu: Pat the tofu dry with a clean kitchen towel or paper towel. In a medium bowl, whisk together panko, sesame seeds and black pepper. Season the mixture generously with salt. In a second medium bowl, lightly whisk the egg whites. Using a pair of kitchen tongs, dip the tofu slices one at a time in the egg whites and coat well. Transfer to the bowl with the panko mixture, coating well on all sides, then move to a clean plate. Repeat with remaining tofu slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large plate with paper towels. Heat 2 tablespoons oil in a medium (10-inch) cast-iron or stainless-steel skillet over medium-low. Working in batches to avoid crowding, pan-fry the tofu until golden brown, about 2 minutes per side. (Don’t overcook, or the sesame seeds will turn bitter.) Transfer the fried tofu slices to the prepared plate. Repeat with the remaining tofu, adding oil and wiping out the pan as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the spinach: Wipe out the skillet, and heat 2 tablespoons oil over medium. Add the shallot and sauté until translucent, 2 to 3 minutes. Add garlic and cook until fragrant, 45 seconds, taking care not to scorch the garlic. Add the spinach by the handful, increasing the heat after the first handful and allowing the greens to wilt before adding more. Sauté until wilted and most of the liquid evaporates, about 10 minutes. Add the soy sauce and black pepper, and fold to coat well. Taste and add salt as needed. Remove the skillet from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place spinach in a serving bowl. Add fried tofu on top, and drizzle with half of the coconut-lime dressing. Sprinkle the chives over the tofu, and serve immediately, with more dressing on the side."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021982-sesame-tofu-with-coconut-lime-dressing-and-spinach"}