{"@context": "http://schema.org", "@type": "Recipe", "name": "Peach Poundcake", "description": "This recipe proves that the perfect summer pound cake takes no special equipment or skill to pull off. Once you’ve prepared the peaches, this is essentially a dump-and-whisk cake. Puréed peaches (plus an extra egg yolk) keep the cake from drying out. Diced peaches add bursts of fresh fruit,  and a peach glaze lends another layer of flavor. Use sweet, ripe peaches for best results, but frozen work fine here, too. If you’re looking for a spin on classic peaches and cream, serve a slice with lightly sweetened whipped cream.", "author": {"@type": "Person", "name": "Jerrelle Guy"}, "image": "https://static01.nyt.com/images/2020/06/28/dining/jg-peach-pound-cake/jg-peach-pound-cake-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "1 (9-by-5-inch) cake", "recipeCuisine": "american", "recipeCategory": "cakes, dessert", "keywords": "butter, flour, peach, vanilla, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2812}, "recipeIngredient": ["1 cup/230 grams unsalted butter (2 sticks), melted and cooled to room temperature, plus more for greasing the pan", "2 1/2 cups/320 grams all-purpose flour, plus more for dusting the pan", "3 medium, ripe, red-hued peaches (about 1 pound), pitted (see Note)", "1 tablespoon fresh lemon juice", "3 large eggs plus 1 large egg yolk, beaten", "1 1/2 teaspoons vanilla extract", "1 cup/125 grams unsifted confectioners’ sugar, plus more as needed", "1 1/2 cups/300 grams granulated sugar", "2 1/2 teaspoons baking powder", "3/4 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Lightly butter and flour a 9-by-5-inch loaf pan, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dice 1 peach into 1/3-inch pieces. Pat the pieces dry with a paper towel and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 2 peaches and the lemon juice to a food processor or blender, and blend on high until completely puréed. Measure out 1 leveled cup of the purée and transfer it to a mixing bowl along with the melted butter, eggs, egg yolk and vanilla. Whisk to combine and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Completely scrape down the sides of the food processor, and make the icing using the small amount of puréed peaches still remaining: Add 1 cup of the confectioners’ sugar to the remaining peach purée in the food processor and blend on high until combined. The icing should be thick but thin enough to drizzle. Add more confectioners’ sugar to thicken or a splash of water to thin, as needed. Cover and set aside until it’s time to ice the cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, add the flour, granulated sugar, baking powder and salt, and whisk to combine. Pour the peach mixture into the flour mixture, and whisk well until the batter is thoroughly combined, then fold in the diced peaches. Transfer the batter to the loaf pan, spread evenly to the edges, and bake until crusty and golden brown on the top and a toothpick inserted into the center comes out clean, 75 to 80 minutes. Remove from the oven and allow to cool for 10 minutes before transferring to a wire rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the icing a final time and spread it on top of the warm cake, allowing the extra icing to drip down the sides. Cool the cake to room temperature. Slice and serve, or wrap tightly with plastic wrap and store on the counter for up to 3 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021204-peach-poundcake"}