{"@context": "http://schema.org", "@type": "Recipe", "name": "Fufu (Swallows)", "description": "Making swallows can be a labor of love. Throughout West Africa, swallows, which are a satisfying accompaniment to vegetable soups and stewed meats, are traditionally prepared by pounding cooked starchy roots or tubers in a large mortar with a heavy pestle. As the vegetables break down, hot water is added and the mixture becomes stretchy and soft, with a texture like yeast dough. All swallows are not fufu, but fufu is the term commonly used in the diaspora to describe the method in this recipe: continuous cooking, stirring and kneading turns finely milled starch into a smooth, elastic mass. The result, like that of the classic method, is notably neutral in taste and always served warm.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2021/03/10/dining/05Fufurex/merlin_184316781_ae6f56ec-609a-451c-8da5-064b8e235da4-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, one pot, side dish", "keywords": "kwanzaa, yam flour, cassava flour, cocoyam flour, plantain flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 514}, "recipeIngredient": ["1 cup yam, cassava, cocoyam or plantain flour (see Tip)", "Vegetable soups and stewed meat, such as <a href=\"https://cooking.nytimes.com/recipes/1020297-efo-riro-stewed-amaranth-greens\">efo riro</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 3 cups of water into a medium pot and make a slurry by stirring in the flour all at once with a wooden spoon. Set the pot over medium-low heat. Cook the batter, stirring continuously as it thickens and begins to form a dough, 4 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to low and fold the batter over itself, smoothing out any lumps as you fold. You should have a thick and chalky-looking dough at this point. Continue to cook while folding until the dough begins to stiffen and pull away from the sides of the pot, and a thin film forms on the bottom, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the dough across the bottom of the pot, then use the wooden spoon to poke a few deep indents on the surface. Pour 1/4 cup of water around the edges and over the top of the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and cook without stirring until the dough is heated through, translucent and all the starchy granules have absorbed the water, 6 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lid and mix until a smooth, slightly glossy and sticky dough forms. If the dough is too firm, you can add up to 1/4 cup additional water. It should be soft and somewhat pliable, but not runny. Remove from heat, cover and let sit to set and cool slightly, at least 5 minutes and up to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form the mixture into spheres to serve: Fill a bowl with water and dip a large serving spoon to wet it, then scoop the dough. Press the scooped dough in the spoon against the side of the pot to shape the dough into a round, then transfer to a shallow bowl. Repeat with the remaining dough to form 2 to 3 more spheres, dipping the spoon into the water before each scoop. Fufu and swallows are typically served with a vegetable soup, such as <a href=\"https://cooking.nytimes.com/recipes/1020297-efo-riro-stewed-amaranth-greens\">efo riro</a>, egusi soup or okra soup, and topped with any <a href=\"https://cooking.nytimes.com/recipes/1020284-braised-goat-leg-in-obe-ata\">stewed meats</a>."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021958-fufu-swallows"}