{"@context": "http://schema.org", "@type": "Recipe", "name": "Marbled Shortbread With Ginger and Turmeric", "description": "This cookie combines ground ginger and turmeric with roasted cashews and white chocolate. A simple shortbread dough, made with a larger ratio of butter to sugar, allows the complex flavors to shine. Shaping the dough into a rectangular block and cutting it into logs keeps things compact in the freezer while also allowing for easy and even slicing and baking. Thanks to the spices and aromatics, the cookies even get a little better with age. Don't worry about getting your swirls perfect. No matter how you do it, these cookies will be as beautiful as they are delicious.", "author": {"@type": "Person", "name": "Laurie Ellen Pellicano"}, "image": "https://static01.nyt.com/images/2021/04/05/dining/lep-marbled-shortbread/merlin_184806285_f6ebe641-81a5-4ccb-9dc8-59894977ff37-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 90 small cookies", "recipeCuisine": "", "recipeCategory": "snack, cookies and bars, dessert", "keywords": "cashew, flour, ginger, turmeric, white chocolate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 48}, "recipeIngredient": ["3 1/3 cups/425 grams unbleached all-purpose flour", "1 1/2 teaspoons ground ginger", "1/2 teaspoon baking powder", "1 cup/225 grams unsalted butter (2 sticks), at room temperature", "1 1/2 cups/180 grams confectioners’ sugar (no need to sift)", "1 teaspoon kosher salt", "1 packed teaspoon orange zest (from about 1 orange)", "1 large egg", "1 1/2 teaspoons finely grated fresh ginger", "1 cup/120 grams toasted salted cashews, lightly crushed with a rolling pin", "4 ounces/115 grams good-quality white chocolate, roughly chopped (about 3/4 cup from a bar, block or fèves)", "1 1/2 teaspoons fresh orange juice or vanilla extract", "1 tablespoon ground turmeric"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together flour, ground ginger and baking powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment or with a hand mixer, beat together butter, sugar, salt and orange zest until lightened and fluffy, about 3 minutes, using a spatula to scrape down the sides of the bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, crack the egg and whisk to lightly break up the yolk. With the mixer running on low speed, stream the egg into the creamed butter base to combine. Stop and scrape once again, paying close attention to the bottom of the bowl where the batter likes to sit, then add the freshly grated ginger and mix again on low speed just to incorporate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stop the mixer, scrape the bottom of the bowl with a spatula and add the flour mixture. Turn the mixer back to low speed to combine. When the mixture has just come together (about 30 seconds), remove the bowl from the mixer and clean off the beater with a spatula. Fold the mixture well to make sure there are no pockets of flour. Remove one quarter of the dough (about 8 ounces/225 grams) back to one of the bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the larger portion of dough to the mixer and add the cashews and white chocolate just until just incorporated, 10 to 15 seconds; transfer the dough to a cutting board or work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the quarter portion of dough to the mixer; add the orange juice and turmeric and mix until just incorporated, scraping with a rubber spatula as needed to combine mixture evenly. Remove the bowl from the mixer, fold over the dough a few times in the bowl, and place on your work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roughly divide the larger piece of dough into 3 pieces and your smaller turmeric-stained piece in half. Starting and ending with the larger pieces, sandwich the turmeric dough in an alternating pattern. Roll this sandwiched cookie formation into a log just to round, then fold it in half over itself, twisting it slightly as you do, and roll the log out again. (If the dough feels too sticky, use a bench knife or bowl scraper to help you move the dough around or sparingly dust the log with flour.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Twist and fold the dough one more time (do not roll out). You should end up with a striated yellow-and-off-white mound of dough. Transfer to a parchment-lined 9-by-13-inch sturdy baking sheet with a 1-inch depth, and shape the dough into a 6-by-8-inch rectangle. Layer another piece of parchment over the dough, and use a rolling pin, roll back and forth over the edges of the pan to level and smooth the surface of the dough. (The pan edges support in creating an even thickness. If you do not have a pan with 1-inch depth, use a ruler to check your thickness.) Remove the parchment paper and use a bench knife or your hands to square off the edges slightly. No need to obsess, you’ll trim later, cover once more with parchment and roll over with your pin to smooth the surface again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Leaving the parchment paper on top, transfer the dough on the pan to the freezer for 1 to 2 hours to chill until firm. (If you are chilling it overnight or longer, it’s best to wrap the dough with plastic wrap.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When your dough is chilled, heat the oven to 300 degrees and move the racks to lower and upper middle positions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the block of dough from your freezer. Trim one long side and the adjoining short side to make a right angle, discarding scrap. Orient the block like a portrait and, using a ruler, measure and mark at 2-inch intervals at the top and bottom of your block. Using these markings and the ruler for a straight edge score, cut the block into three long, 2-by-8-inch logs of dough. (If you’re not baking the logs right away, you can wrap them tightly in plastic wrap and freeze them for up to 1 month.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one log at a time, slice into 1/4-inch-thick cookies. Lay sliced cookies onto parchment-lined baking sheets with at least 1/2 inch in between. (They do not spread much during baking). Bake cookies until they appear set, are bright yellow on top and the white chocolate appears a deep golden on the bottom, 13 to 15 minutes total, rotating trays at 8 minutes to ensure even coloring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove trays from the oven and let cookies cool. (Transfer to a cooling rack if you’d like to speed this process up.) Repeat with remaining cookies, unless freezing for future use. Store cooled cookies in covered tins or other airtight containers for several weeks."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021187-marbled-shortbread-with-ginger-and-turmeric"}