{"@context": "http://schema.org", "@type": "Recipe", "name": "Crab Toast", "description": "Like the very best crab cakes on earth, which have as little dulling, distracting or deadening filler as possible, these crab toasts take that ethos to the extreme. There is no call for bell pepper or bread crumbs or diced celery; just the best fresh, sweet, saline crab meat you can buy, gently seasoned with a little lemon juice, bound with a tiny amount of tangy crème fraîche, then piled onto a slab of good toast, still warm. The toast is made ever so luxurious with a slathering of nutty brown butter mayonnaise. These two simple components — crab and brown butter toast — act in concert, and a glass of cold rosé to wash them down makes for the most exhilarating, satisfying spring supper imaginable.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2020/04/26/magazine/26mag-eat/26mag-eat-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "brunch, dinner, easy, lunch, quick, finger foods, sandwiches, seafood, appetizer, main course, side dish", "keywords": "brown butter, chives, crab meat, crème fraîche, egg, lemon, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 707}, "recipeIngredient": ["1/2 cup unsalted butter (1 stick)", "1 whole egg plus 1 egg yolk", "2 tablespoons plus 1 teaspoon fresh lemon juice", "Kosher salt", "1/2 cup grapeseed oil", "12 ounces crab meat", "4 teaspoons extra-virgin olive oil", "2 teaspoons finely minced chives", "1 teaspoon crème fraîche, sour cream, heavy cream or half-and-half", "4 to 6 slices pane Francese, black pumpernickel or other rustic bread, toasted on both sides"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small sauce pot, brown the butter over medium heat, swirling the pot, until the butter is caramel-colored and has a nutty fragrance, about 5 minutes. Transfer to a bowl, scraping up all the milk solids from the bottom and sides of the pot while the butter is still hot, and let cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the egg and egg yolk, 2 tablespoons lemon juice, a healthy pinch of salt and 1 tablespoon cold water in the bowl of a food processor. With the processor running, slowly drizzle in the grapeseed oil. Once all the oil has been added, the mayonnaise should be loose yet emulsified. While the processor is still running, slowly drizzle in the brown butter and any toasted milk solids. Season to taste with salt and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the crab salad, gently and quickly mix crab meat, olive oil, chives, crème fraîche and remaining 1 teaspoon lemon juice together in a bowl. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Schmear each piece of toasted bread with the brown butter mayonnaise evenly — as we like to say, “wall to wall.” Divide the crab mixture among the slices, piling it evenly on top."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021016-crab-toast"}