{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Vietnamese Caramel Pork and Eggs", "description": "Called thit heo kho trung in Vietnamese, this rich combination of pork and eggs in bittersweet caramel sauce and coconut water is a must-have on many southern Vietnamese Tet menus, though people enjoy it as cozy year-round fare, too. It is typically made well in advance of Lunar New Year, so you’re free to relax when the holiday comes around. If you didn’t plan ahead to <a href=\"https://cooking.nytimes.com/recipes/1021833-thit-heo-kho-trung-pork-and-eggs-in-caramel-sauce\">make it on the stovetop</a>, follow this pressure cooker version to make the braise in a flash. Serve it with <a href=\"https://cooking.nytimes.com/recipes/1021836-dua-gia-pickled-bean-sprout-salad\">crunchy pickled bean sprout salad</a>, <a href=\"https://cooking.nytimes.com/recipes/1021378-smoky-stir-fried-greens\">stir-fried greens</a> and steamed rice.", "author": {"@type": "Person", "name": "Andrea Nguyen"}, "image": "https://static01.nyt.com/images/2021/02/03/dining/29Tetrex6/merlin_182848560_951f4e6c-402c-4255-86ab-9042ca6a4d9e-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "vietnamese", "recipeCategory": "meat, main course", "keywords": "coconut water, egg, instant pot, lunar new year, pork shoulder", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 445}, "recipeIngredient": ["1/4 cup granulated sugar, plus more as needed", "1/8 teaspoon unseasoned rice vinegar or distilled white vinegar", "1 1/2 pounds boneless pork shoulder, belly or leg (see Note) ", "2 tablespoons canola or other neutral oil", "2 1/2 tablespoons fish sauce, plus more as needed ", "1/2 medium yellow onion, thinly sliced", "5 garlic cloves, smashed", "1 1/2 teaspoons black peppercorns", "2 cups unsweetened coconut water, strained if pulpy", "4 large hard-boiled eggs, peeled", "2 fresh Thai chiles or 1 serrano chile, thinly sliced (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a caramel sauce: In a small saucepan, stir together the sugar, vinegar and 1 tablespoon water over medium heat until the sugar nearly dissolves, 60 to 90 seconds. Cook without stirring until champagne yellow, about 3 minutes, then continue cooking for another 1 to 2 minutes, frequently picking up the pan and swirling it to control the caramelization. When the mixture is a dark tea color (expect faint smoking), turn off the heat and keep the pan on the burner. Let the caramelization continue until the mixture is burgundy in color, 1 to 2 minutes. Slide the pan to a cool burner and add 3 tablespoons water, stirring to dissolve the sugar. Warm over medium heat to loosen, if needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the pork into chunks about 1-inch thick and 2 to 3 inches long, making sure each piece has both lean meat and fat. Warm the oil in a 6-quart multicooker on the highest heat setting, such as “Saute.” Working in 2 or 3 batches, cook the pork on all sides until lightly browned, about 2 minutes per side, holding the seared meat on a plate. When done, return all the pork and any accumulated juices to the pot, then add the caramel sauce, fish sauce, onion, garlic, peppercorns and coconut water. Lock the lid, then set to high pressure for 12 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Naturally depressurize for 10 minutes before releasing pressure. Use tongs to retrieve the pork and hold in a bowl, loosely covered to prevent drying. If peppercorns cling to the pork, leave them for zing, or knock them off and discard. To quickly filter and remove fat from the cooking liquid, set a mesh strainer over a large heatproof bowl, line with a double layer of paper towels and pour the liquid through. After most of the liquid passes through and a layer of fat remains above the solids, set the strainer aside. (Save the fat for cooking if you like.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the liquid to the pot, bring to a boil on the highest heat setting (Saute) and cook until reduced to 1 cup, 15 to 18 minutes. Lower the heat to maintain a simmer, then add the pork and eggs. Cook, gently stirring now and then, to heat through and coat with the dark sauce, 3 to 5 minutes. Turn off the heat and let rest 5 minutes, uncovered, to concentrate flavors. Taste and add up to 1 1/2 teaspoons of fish sauce or 1 1/2 teaspoons sugar, or both, as needed for a pleasant savory-sweet finish. Transfer to a shallow bowl for serving. Invite diners to halve the eggs themselves. If you’d like spicy heat, gently smash the chiles in individual dishes for dipping sauce with some sauce from the pot, and use it to dip the pork and egg or to drizzle into the bowls. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021840-pressure-cooker-vietnamese-caramel-pork-and-eggs"}