{"@context": "http://schema.org", "@type": "Recipe", "name": "Hearty Bean Nachos With Spicy Salsa", "description": "According to Dr. Adalberto Peña de los Santos, the director of the International Nacho Festival, in Piedras Negras, Mexico, there are three timeless nacho essentials: crispy corn tortilla chips, mounds of melted cheese and at least one chile. If you want to go big, here are some unofficial guidelines: Nacho toppings should be good enough to stand on their own, the nachos should be saucy (maybe even messy) and they should be so delicious together that you can’t have just one bite. In this recipe, nachos take a vegetarian turn, with buttery pinto beans, tender carrots or sweet potatoes (or both), and a tomato-and-tomatillo salsa. Melty cheese, Mexican crema and chopped onion and cilantro take it over the top.", "author": {"@type": "Person", "name": "Pati Jinich"}, "image": "https://static01.nyt.com/images/2020/11/04/dining/29nachosrex2/merlin_179172954_f28f94f2-a915-4df4-8605-441f8d1ab276-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "mexican", "recipeCategory": "appetizer, main course", "keywords": "carrot, cheese, nacho, pinto beans, sweet potato, tomatillo, tomato, tortilla chips", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 440}, "recipeIngredient": ["1 1/2 pounds ripe Roma tomatoes (about 5 or 6)", "1/2 pound tomatillos (about 3 or 4), husked and rinsed", "1 to 2 jalapeños, destemmed", "1 to 2 chiles de árbol, destemmed", "2 garlic cloves, peeled", "1/2 cup coarsely chopped cilantro, leaves and upper stems, plus 1 cup reserved for garnish", "1/8 teaspoon ground cumin", "Kosher or sea salt", "1 tablespoon vegetable oil", "3 cups (1/2-inch) diced peeled carrot or sweet potato (or a combination)", "3 tablespoons vegetable oil", "1 cup finely chopped white onion, plus 1/2 cup reserved for garnish", "1 cup finely chopped celery", "1 1/2 cups cooked, drained pinto beans (from about 3/4 cup dried beans or a 15-ounce can)", "1 to 1 1/2 pounds store-bought or Homemade Tortilla Chips (<a href=\"https://cooking.nytimes.com/recipes/1021579-homemade-tortilla-chips\">see recipe</a>)", "1 pound shredded cheese (any combination of Oaxaca, Monterey Jack and Cheddar)", "1 cup Mexican crema"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the salsa: Place the tomatoes, tomatillos, jalapeños, chiles de árbol and garlic in a medium saucepan. Cover with at least 6 cups water and bring to a simmer over medium-high. Reduce heat to medium and simmer until the tomatoes and tomatillos are cooked through and mushy, the jalapeños have softened and the chiles de árbol have plumped up, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, transfer the cooked vegetables to a blender, setting aside the cooking liquid. Add the cilantro, cumin and 3/4 teaspoon salt to the blender; purée until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the vegetables: Bring the reserved vegetable cooking liquid back to a simmer over medium-high heat and season generously with salt. Once it comes to a boil, add the carrots or sweet potatoes, or both, and cook until tender, 7 to 8 minutes. Pour the cooked vegetables into a colander, discarding liquid, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe the saucepan dry, then add 1 tablespoon oil and heat over medium. Once the oil is hot, pour in the salsa, partly cover it with the lid, and cook, stirring occasionally, until thickened and the color has deepened, 8 to 10 minutes. Set salsa aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the beans: In a large skillet, heat 3 tablespoons oil over medium. Once hot, add the onion and celery, and cook, stirring occasionally, for 7 to 8 minutes, until completely softened. Raise the heat to high, add the cooked carrots and/or sweet potatoes, sprinkle with 1/2 teaspoon salt and cook, stirring a couple times, until beginning to brown, 5 to 7 minutes. Add the pinto beans and cook, stirring occasionally, until warmed, another 3 to 4 minutes. Season to taste with salt, then remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the nachos: Set a rack in the middle of the oven and heat to 400 degrees. Place all the tortilla chips in a half sheet pan or large baking sheet. Cover the chips with the bean mixture, ladle the salsa all over the top and cover with shredded cheese. Bake until cheese has completely melted, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the crema over the top and garnish with reserved cilantro and chopped white onion. Serve hot!"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021574-hearty-bean-nachos-with-spicy-salsa"}