{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Zucchini With Crispy Parmesan and Black Pepper", "description": "This summery side dish is inspired by the flavors of cacio e pepe, Rome’s beloved pasta dish. Zucchini or summer squash is seared in a very hot pan until golden, and while it cooks, coarsely ground black pepper is separately toasted and butter is added to brown. (Be sure to salt your zucchini just before you add it to the hot pan — not sooner — as they can release water and become mushy if salted and left to sit.) If you can, take the time to grate your own Parmesan for a lighter, almost pillowy-like consistency that melts into the butter and forms chewy-like nuggets of cheese. (This will not be a smooth, emulsified sauce.) Like many good summer dishes, this one is finished with torn basil. Serve with a side of grilled sausages or pearled couscous tossed with pesto. A tumbler of rosé would make this dinner worthy of eating outside on the back porch, dish in lap.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2020/07/16/dining/ch-seared-zucchini/ch-seared-zucchini-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, vegetables, side dish", "keywords": "basil, black pepper, butter, parmesan, zucchini, fall, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1472}, "recipeIngredient": ["3 tablespoons olive oil", "Kosher salt", "1 1/2 pounds baby zucchini or summer squash (or use regular zucchini on the smaller side), ends trimmed and halved lengthwise ", "2 teaspoons coarsely ground black pepper", "4 tablespoons unsalted butter, cut into 4 pieces", "2 ounces freshly grated Parmesan or Grana Padano cheese", "1/4 cup torn basil or mint leaves, or a combination", "Flaky sea salt (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 12-inch cast-iron skillet over medium-high for 2 minutes. (This will help you get a good sear.) Heat the oil, and when it shimmers, salt the zucchini and add it cut-side down in one layer (you will need to do this in two batches), and cook, undisturbed, until it begins to turn golden brown, about 2 to 3 minutes. Flip and cook 2 to 3 minutes more on the other side. Remove from the pan and set aside on a serving plate; repeat with remaining zucchini."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the second batch cooks, add the pepper to a small saucepan and toast over medium heat until it becomes fragrant, about 2 minutes. Add the butter (it will quickly foam), and stir until the butter melts and the foam subsides. Remove from heat. Quickly add the grated cheese and stir vigorously to prevent the cheese from sticking to the bottom of the pan. It will melt in spots, it will crisp in spots and it will form frico-like clumps.These are all good things!"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the butter over the seared zucchini, making sure to catch all the black pepper and fried cheese bits, and shower with the herbs. Season with flaky salt, if you please."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021248-seared-zucchini-with-crispy-parmesan-and-black-pepper"}