{"@context": "http://schema.org", "@type": "Recipe", "name": "Birria Tacos With Chile Broth", "description": "Birria is one of Mexico’s most beloved dishes, and eating it is a tradition, a way of life. A signature dish from Jalisco, it now extends through the entire country and north of the border. In this version from Oaxaca, goat or lamb is first marinated in vinegar to moderate its gamey flavors, then it’s cooked gently for so long that it falls apart. Guajillo chiles and aromatic avocado leaves coax delicate flavors from the meat and result in an intense, fragrant broth. The shredded meat is tucked into tacos here, but can also make its way into quesadillas and tortas. In every form, the meat tastes best garnished with chopped onion and cilantro, and chased with the broth mixed with a generous squeeze of fresh lime juice.", "author": {"@type": "Person", "name": "Pati Jinich"}, "image": "https://static01.nyt.com/images/2021/02/05/dining/pj-birria-tacos/merlin_183102915_7bdeedac-14e5-46f9-98fa-4024b16a535e-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "8 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, meat, soups and stews, tacos, main course", "keywords": "cilantro, corn tortillas, goat shoulder, guajillo chiles, lamb shoulder, lime", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 234}, "recipeIngredient": ["4 to 5 pounds bone-in goat or lamb shoulder, cut into 3-inch pieces", "1/4 cup distilled white vinegar", "6 teaspoons fine sea salt or coarse kosher salt, plus more to taste", "4 to 5 large dried avocado leaves", "3 ounces guajillo chiles (10 to 15), stemmed and seeded", "16 corn tortillas, warmed", "2 cups finely chopped white onion", "2 cups chopped cilantro leaves", "2 to 3 limes, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the meat in a large bowl and cover with cold water. Add the vinegar and 2 teaspoons salt, and let sit for 20 to 30 minutes. Drain, then rinse well with cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rinsed meat in a Dutch oven or other ovenproof pot, cover with water (at least 3 quarts), add 4 teaspoons salt and stir. Bring to a rolling boil over high heat, then reduce the heat to low and skim foam from the surface. Cover and cook for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat a medium saucepan over medium-low. Once hot, toast the avocado leaves, flipping them as they cook, until fragrant, about 1 minute. Remove from the saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chiles in the saucepan, cover with water and bring to a simmer over medium-high heat. Simmer until the chiles are completely rehydrated and plumped, about 10 minutes. Transfer the chiles to a blender, add 1 cup of the cooking liquid and purée until completely smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the meat, stir in the guajillo chile purée and drop in the toasted avocado leaves. Cover again and continue to simmer until the meat is so tender it falls apart when a fork is inserted, 1 1/2 to 2 more hours. Discard the avocado leaves and season the broth to taste with salt. (At this point, the birria can be cooled to room temperature, then covered and chilled for up to 3 days. If you’d like, you can remove and discard the solidified fat from the broth before reheating on the stovetop.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the meat from the broth to a platter, discard the bones, shred the meat and moisten with some broth. Season the meat to taste with salt and divide the remaining broth among serving bowls or cups. If you’d like, you can skim the fat from the surface of the broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, set out the tortillas, onion, cilantro and lime wedges to assemble tacos with the meat and to season the broth. Eat the tacos and drink the broth as a chaser."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021874-birria-tacos-with-chile-broth"}