{"@context": "http://schema.org", "@type": "Recipe", "name": "Oven-Fried Patatas Bravas (Crispy Potatoes With Two Sauces)", "description": "Served with spicy salsa brava and garlicky allioli, crispy hot patatas bravas are traditionally served in tapas bars throughout Spain. The salsa brava is made with pimentón, the smoked Spanish paprika sold as picante (hot) and dulce (sweet). Some cooks include a lot of chopped tomato, but my friends in Madrid tell me they prefer this version, which looks a bit like rusty gravy. As for the allioli, you can mount it by hand with a whisk, or use a stick blender as most Spaniards do. Though patatas bravas are typically pan-fried on the stovetop, I came up with this easier, oven-fried method. The potatoes emerge beautifully browned and crisped, and their flavor is sensational cooked in extra-virgin olive oil. This is not fancy fare. Grab a fork and dip the hot potatoes in both sauces for the optimal experience.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/05/13/dining/08Tanisrex-bravas/08Tanisrex-bravas-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 appetizer servings", "recipeCuisine": "spanish", "recipeCategory": "snack, vegetables, appetizer, side dish", "keywords": "egg yolks, garlic, pimenton, potato, small plate, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1147}, "recipeIngredient": ["2 pounds yellow-fleshed or russet potatoes, peeled and cut in 1 1/2-inch chunks", "Kosher salt", "1/2 cup extra-virgin olive oil", "1 head garlic, separated into cloves but not peeled", "2 tablespoons extra-virgin olive oil", "2 garlic cloves, minced", "2 tablespoons all-purpose flour", "1 tablespoon tomato paste", "1 tablespoon pimentón dulce, or use sweet paprika", "1 teaspoon pimentón picante, 1/2 teaspoon chipotle chile powder or 1/4 teaspoon cayenne", "1 cup chicken broth or water", "1 tablespoon sherry vinegar", "Kosher salt", "2 egg yolks", "4 garlic cloves, pounded, finely minced or grated", "1 1/2 cups extra-virgin olive oil", "Kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Put potato chunks in a large bowl, season generously with salt and toss to coat. Leave for a few minutes to let potatoes absorb salt. Add olive oil and unpeeled garlic cloves and toss to coat well. (Don’t skimp on the oil; it can be strained and saved after cooking for future use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer potatoes (and garlic cloves) and oil to a large cast-iron skillet or heavy roasting pan. Make sure to have potatoes in a single layer without crowding. (If necessary, use two pans.) There should be a good 1/2-inch oil in the bottom of the pan. Add more if required."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pan in oven and roast for 15 to 20 minutes, until potato chunks are well browned on the bottom. With a metal spatula, carefully turn chunks over. Reduce heat to 400 degrees, and continue roasting until potatoes are well browned and crisp, about another 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While potatoes are roasting, make the two sauces: For the salsa brava, put 2 tablespoons olive oil in a small saucepan over medium heat. Add garlic and let sizzle without browning, then stir in flour and let mixture sizzle. Stir in tomato paste, pimentón dulce and pimentón picante, then add chicken broth gradually, stirring well as the sauce thickens. Bring to a gentle simmer, add vinegar and cook for 5 minutes until the sauce has a gravylike consistency, but isn't too thick. Thin with a little more broth or water, if necessary. Season with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the allioli, put egg yolks and garlic in a mortar or small bowl and whisk together. (Alternatively, use a mini food processor or stick blender, see note.) Add oil a few drops at a time, whisking vigorously with each addition. As the sauce thickens, add olive oil a teaspoon at a time. If the aioli gets too thick, whisk in 1 tablespoon water, then continue to whisk in remaining oil. The finished sauce should have the consistency of softly whipped cream. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When potatoes are ready, use spatula to transfer to a pan lined with paper towels to blot, then to a warm serving dish. Sprinkle lightly with salt. Serve warm with the two sauces."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021018-oven-fried-patatas-bravas-crispy-potatoes-with-two-sauces"}