{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Bean Burger With an Egg on Top", "description": "This is a vegetarian burger that does not mimic the texture or look of ground meat, but it isn’t meant to. It’s more like the most excellent refried beans. Though you can serve this well-seasoned patty like a traditional burger, on a bun with the usual condiments, it is at its best topped with a fried egg. Dusted with fine cornmeal, the burgers are pan-fried as the mixture is too soft to grill. After frying, they are baked until crisp. For convenience, they may be fried in advance and reheated.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/07/15/dining/10tanis2/merlin_174283629_0d31e066-8eb1-4043-8a48-d6978882e0cd-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "burgers, grains and rice, vegetables, main course", "keywords": "black beans, rice, fourth of july, labor day, memorial day, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 824}, "recipeIngredient": ["2 (15-ounce) cans black beans, or 4 cups cooked black beans, on the firm side", "1 cup cooked brown rice, cooled", "1 cup chopped cilantro, leaves and tender stems, plus sprigs for garnish", "1 serrano chile, finely chopped", "1 cup chopped scallions, both white and green parts", "1/2 teaspoon chipotle chile powder or pimentón picante", "2 teaspoons cumin seeds, toasted and ground, or 1 1/2 teaspoons ground cumin", "Pinch of ground cayenne", "Salt", "1 large egg, beaten", "2 tablespoons cornstarch dissolved in 1 tablespoon cold water", "Neutral oil, such as grapeseed or safflower, for frying", "Fine cornmeal, for coating patties", "1 sunny-side up egg per person (optional, but recommended)", "Toasted buns, lettuce leaves and condiments (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put beans in a colander set over a bowl and drain well. (Reserve juices for another purpose or discard.) Pat the beans dry with paper towels, then mash them a bit with a wooden spoon or potato masher, but leave them chunky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer beans to a large bowl with the rice and toss together. Add chopped cilantro, serrano chile, scallions, chipotle powder, cumin and pinch of cayenne, to taste. Season generously with salt and mix well to incorporate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the egg to the cornstarch solution and beat together, then drizzle it all over the bean mixture and mix well to distribute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form mixture into six thick patties of equal size. Each patty should weigh about 4 1/2 ounces. Place patties on a baking sheet and place in freezer for 10 minutes to firm. (For a firmer mixture, prepare a day in advance of cooking and refrigerate.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Add 1/2-inch oil to a heavy skillet over medium heat. Dust patties lightly on both sides with fine cornmeal. (It’s OK if they are slightly frozen.) When oil is shimmering, slip the patties into the pan; work in batches to avoid crowding, or use two pans. Fry the burgers gently, about 3 minutes per side until nicely browned, adjusting heat as necessary. Transfer burgers to a baking sheet and let them crisp further for about 20 minutes in the oven (or let them cool and reheat later)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, fry the eggs, if using. Put a sunny-side-up egg on top of each warm burger, and serve on buns or warm plates with lettuce and condiments, if using. Garnish with cilantro sprigs."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021209-black-bean-burger-with-an-egg-on-top"}