{"@context": "http://schema.org", "@type": "Recipe", "name": "Mapo Tofu Spaghetti", "description": "Conventional <a href=\"https://cooking.nytimes.com/recipes/1021459-mapo-tofu\">mapo tofu</a> calls for cubed tofu, but, if you blend silken tofu for a twist on the Sichuan favorite, you’ll yield a creamy pasta sauce with deep numbing, spicy mala flavor. For velvety results, select silken tofu that’s molded into its refrigerated tub. Shop at a Chinese market for the doubanjiang (fermented chile bean sauce or paste). Look for the kind that is jarred and labeled as toban djan or packaged as plastic-sealed paper cubes, and originating from Pixian. Also grab some Sichuan peppercorns, and for extra umami oomph, some douchi (fermented black beans), too. If beef or pork isn’t your thing, try ground turkey, lamb or a plant-based meat alternative. Chefs (Mei Lin of Nightshade in Los Angeles, and Yu Bo of Yu’s Family Kitchen in Chengdu) and home cooks (the family of Zhong Yi, a former graduate student at Sichuan University) alike have tinkered with mapo tofu, pushing its definition and inspiring this cross-cultural iteration.", "author": {"@type": "Person", "name": "Andrea Nguyen"}, "image": "https://static01.nyt.com/images/2020/10/07/dining/05mapo2/merlin_177593271_16f2d766-e655-44bc-a88f-afa8e95c5b81-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, meat, noodles, pastas, main course", "keywords": "doubanjiang, ginger, ground beef, parmesan, scallion, sichuan peppercorns, spaghetti, tofu", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 468}, "recipeIngredient": ["1 (14- or 16-ounce) package silken tofu", "1 1/2 teaspoons Sichuan peppercorns", "2 tablespoons neutral oil, such as canola oil", "8 ounces ground beef or pork (preferably 80 or 85 percent lean), roughly chopped to loosen", "2 1/2 to 3 tablespoons doubanjiang (fermented chile bean sauce or paste)", "1 tablespoon douchi (fermented black beans, optional)", "1 teaspoon minced fresh ginger", "1/2 teaspoon red-pepper flakes (optional)", "2 teaspoons regular soy sauce", "1 rounded teaspoon granulated sugar, plus more as needed", "Fine sea salt", "1 large scallion, trimmed and sliced on a sharp bias into 2-inch-long pieces", "1 tablespoon cornstarch dissolved in 2 tablespoons water", "1 tablespoon fine sea salt", "12 ounces dried spaghetti", "1 large scallion, trimmed and cut on a sharp bias into 2-inch-long pieces", "2 to 3 tablespoons grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the mapo tofu sauce: If the tofu came as a block in water, discard the water. Cut the tofu into large chunks, then use a stand blender or immersion blender to whirl the tofu into an ivory smoothie."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium (3- or 4-quart) pot over medium heat, toast the Sichuan peppercorns for 2 to 3 minutes, until super fragrant and slightly darkened. (A wisp of smoke is OK.) Let cool briefly, then pound with a mortar and pestle or pulse in a spice grinder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the remaining sauce ingredients and set them near the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm the oil in the pot over high heat. When shimmering, add the meat. Stir and mash into cooked and crumbly pieces, 1 to 2 minutes. Add 2 1/2 tablespoons doubanjiang, the douchi (if using), ginger and red-pepper flakes (if using). Fry about 2 minutes longer, stirring constantly, until the mixture is a rich reddish brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to medium-low, then stir in the soy sauce and sugar. Scrape in the blended tofu. (If there’s much left in the blender jar, add 1 tablespoon water and whirl to loosen it.) Stir to combine well, partly cover and bring to simmer. Cook for about 3 minutes, stirring occasionally, to develop flavor throughout. Expect orange oil to appear on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the sauce and if needed, add the remaining 1/2 tablespoon doubanjiang (for heat), or a pinch of salt (for savoriness) or sugar (to tame heat)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the scallions, then add the cornstarch slurry and stir until thickened. Turn off the heat. Stir in half the crushed Sichuan peppercorns to seed a bit of zing. Let sit for 5 to 10 minutes to deepen flavor and color before using; a little lingering orange oiliness is normal. Makes about 2 1/2 cups. (You can also cool completely then refrigerate in an airtight container for up to 3 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the spaghetti: Fill a large pot about halfway with water and add no more than 1 tablespoon of salt to lightly season. Bring to a boil over high heat, then add the spaghetti and boil until al dente according to package instructions. Ladle out about 3/4 cup of the pasta cooking water, then drain the spaghetti. Briefly rinse to remove some of the starch and shake to expel excess water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pot (or a clean large skillet, if you wish), warm the tofu sauce and 1/3 cup of the reserved pasta cooking water over medium heat. When hot and bubbling, add the spaghetti to the sauce. Use tongs to stir and coat the strands. Stir in extra pasta water by the tablespoon for a creamier, silkier finish, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When satisfied, stir in the scallion and cook very briefly until just softened. Divide the pasta among plates or shallow bowls and serve topped with the cheese and the remaining ground peppercorns."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021487-mapo-tofu-spaghetti"}