{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Tomato-Coconut Bisque With Shrimp and Mushrooms", "description": "A full-bodied, mildly spiced tomato soup with sweetness and depth from roasted red peppers, this is a tasty base for lightly poached shrimp or pieces of any firm white fish. The gingery, herbed mushroom gets with a citrusy lift from makrut lime leaves, ensuring this dish is packed with flavor. As a substitute, lime zest will work in a pinch. Serve over steamed rice or dig in with torn pieces from a crusty loaf of bread.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2020/09/17/dining/yk-tomato-bisque-with-shrimp/merlin_176822853_6157e6c0-80df-4142-9e90-a799bc52ac71-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, main course", "keywords": "canned tomatoes, coconut milk, makrut lime leaf, mushroom, roasted red pepper, shrimp, soup, white fish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1852}, "recipeIngredient": ["1 (14-ounce) can whole peeled tomatoes", "1 (12-ounce) jar roasted red bell peppers, stemmed, seeded and roughly chopped (about 1 cup)", "4 tablespoons olive oil, plus more for drizzling", "8 ounces mixed fresh mushrooms, such as oyster, maitake or shiitake, cut into 2-inch pieces (about 4 loose cups)", "2 garlic cloves, peeled and sliced", "1 (1-inch) piece fresh ginger, peeled and thinly sliced", "2 fresh makrut lime leaves (or 1 tablespoon lime zest)", "Kosher salt", "1/4 cup sliced scallions", "2 shallots, peeled and diced", "1 tablespoon tomato paste", "1 (13-ounce) can coconut milk", "1/2 red habanero chile, seeds removed", "1 pound large (tail-on) shrimp, peeled and deveined (or 1 pound any firm white fish, such as halibut, cut into 2-inch pieces)", "Steamed white or brown rice, for serving", "1 cup mixed fresh herbs, such as cilantro, mint, basil and dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the whole peeled tomatoes and their juices and the roasted red peppers to a food processor or blender and purée until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot or Dutch oven, heat 3 tablespoons olive oil over medium-high. Add the mushrooms and cook without stirring until lightly browned, about 2 to 3 minutes. Add the garlic, ginger and lime leaves. (If using zest, don't add it yet.) Cook until garlic is softened and lime leaves fragrant, about 2 minutes. Move the mushroom mixture to a bowl. Season with salt and stir in a drizzle of oil. Add lime zest, if using, and scallions. Toss and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the remaining 1 tablespoon oil into the pot and heat over medium. Sauté the shallots until softened and translucent, 3 to 4 minutes. Add the tomato paste, cook until it darkens and begins to stick to the bottom of the pot, about 2 minutes. Stir in the puréed tomato mixture, coconut milk, chile and 1 cup water. Scrape the bottom of the pot with your spatula to remove any paste stuck to the bottom. Simmer, uncovered, to allow flavors to meld and sauce to reduce slightly, about 20 minutes. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shrimp (or pieces of fish) and cook until just opaque, about 2 to 3 minutes. Season to taste with salt. Remove and discard the chile."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide soup and shrimp (or fish) among bowls filled with steamed rice. Discard lime leaves, then combine the fresh herbs with the mushrooms and top stew with spoonfuls of the herby mix. Drizzle with more olive oil and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021453-spicy-tomato-coconut-bisque-with-shrimp-and-mushrooms"}