{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Cherry-Pistachio Salad With Charred Scallion Vinaigrette", "description": "The experience of biting into a juicy black cherry embodies summer. For cherry recipes, dessert may come to mind first, but how about something savory? Bursting bites of cherry star in this five-ingredient salad, with scallions, pistachios, oil and vinegar. The recipe puts scallions to work in two ways: Their raw greens bring bright, grassy notes, while the charred bottoms bring sweetness and bitterness when pulverized into paste. Raw, coarse chopped pistachio lends an interesting chew that develops into a complex fat for the salad. This salad is elegant and simple — and deserves to be among your new summer classics. Use your best extra-virgin olive oil, and try adding fresh, organic rose petals to the dish for a delicate strawberry-rose flavor, and a Baroque, sensual layering of flavors.", "author": {"@type": "Person", "name": "Angela Dimayuga"}, "image": "https://static01.nyt.com/images/2020/07/29/dining/27Cherryrex/merlin_174807387_f56121da-3993-46ec-ac6c-985e88a80402-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weeknight, salads and dressings, side dish", "keywords": "apple cider vinegar, cherries, cherry, pistachio, scallion, sea salt, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 639}, "recipeIngredient": ["1 1/2 pounds black cherries, washed", "1/2 cup raw pistachios (about 3 ounces)", "1 bunch scallions", "2 tablespoons apple cider vinegar", "1 tablespoon extra-virgin olive oil", "Ice water, as needed", "Flaky sea salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a knife, score all the cherries in half at the seam. Next, twist each cherry apart as you would an avocado, tossing the pitted half into a large mixing bowl. Using your fingertips on your spare hand, pop the pits out of the unpitted cherry halves, discarding the pits, then adding the halved cherries to the bowl. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the pistachios into a coarse crumble, leaving no pistachio whole. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the scallions into two parts, slicing about 4 inches above the root to separate the white stalks from the tender green tops. On a stovetop burner, char the scallion bottoms over high heat, rotating every 2 to 3 minutes, until the completely charred on the outside and soft and cooked in the middle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the charred scallions to a cutting board, and finely mince. Gather into a pile, and repeat mincing until the scallion bottoms turn into a fine, green-black paste. Transfer to a small bowl, and stir in apple cider vinegar and olive oil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take a few pieces of the green scallion tops and stack them directly on top of one another. Using a sharp chef’s knife, cut very, very thin slices of the scallion on a hard bias about 1 1/2 inches long, then transfer to a bowl of ice water. Repeat with the remaining scallion tops. Fluff the scallions in the ice water, so the scallions have enough room to curl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape all of the charred scallion vinaigrette into the bowl with the halved cherries. Using your fingertips, lightly massage the dressing into the cherries so they reach the cavities of each half. Add chopped pistachio, curly scallions, and a couple pinches of salt to taste. Transfer to a large flat dish, so you can enjoy all the colors and ingredients in the simple dish."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021253-black-cherry-pistachio-salad-with-charred-scallion-vinaigrette"}