{"@context": "http://schema.org", "@type": "Recipe", "name": "Lowcountry Okra Soup", "description": "Representing ingredients from at least four continents and five spiritual traditions, this okra soup is a true amalgamation of global culinary influences, from West Africa to Peru, all of which intersect in the Lowcountry kitchen. This version belongs to Amethyst Ganaway, a chef and writer of Gullah Geechee ancestry, a direct descendant of people once enslaved on the lower Atlantic Coast. Ms. Ganaway’s okra soup is not your Louisiana-style gumbo, thick with roux and rich with sausage and shrimp. It’s a simple, wholesome dish that, like the best Gullah Geechee cooking, emphasizes the freshness of its ingredients. As Ms. Ganaway advised, “The okra will naturally thicken the broth, and the fresher it is, the better it’ll do the job.’’ Since the vegetable is cooked for just 10 minutes, it grows tender but not slimy, while the pod’s caviar-like seeds add a textural pop with every bite.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2020/09/27/magazine/27Eat/27Eat-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "About 3 1/2 quarts", "recipeCuisine": "american", "recipeCategory": "dinner, poultry, soups and stews, vegetables, main course", "keywords": "butter beans, cayenne pepper, corn, okra, paprika, turkey, turkey legs, turkey necks", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 459}, "recipeIngredient": ["2 tablespoons neutral oil", "2 pounds turkey necks", "1 pound smoked turkey leg or thigh meat", "1 medium white or yellow onion, quartered", "Salt", "1 teaspoon onion powder", "1/2 teaspoon smoked paprika", "1/2 teaspoon ground cayenne", "1/2 teaspoon freshly ground black pepper", "15 ounces (fresh or canned) diced tomatoes (about 2 cups)", "1 pound okra (fresh or frozen), trimmed and sliced into 1/2-inch pieces", "3 ears sweet corn, sliced off the cob", "2 cups cooked fresh or canned butter beans (about 15 ounces), drained", "Freshly cooked long-grain white rice, cornbread and hot sauce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set an 8-quart Dutch oven or similar pot over medium-high heat. When it is hot, add oil. When oil shimmers, lay in turkey necks and sear until evenly golden brown, about 4 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 4 quarts water, smoked turkey, onion and a generous pinch of salt. Bring to a boil, then reduce to a heavy simmer, with the lid ajar to ensure the pot doesn’t boil over. Check pot every 30 minutes to remove any scum that forms, and add water as needed to ensure that the meat is always submerged. Cook for about 3 hours or until all the meat is tender and broth is flavorful."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While it’s traditional to leave onion and bones in the soup (and suck meat off turkey neck as you eat), you can strain broth, remove onion and pick meat off bones at this point if desired, returning meat to broth. Either way, reduce broth to about 3 quarts, then stir in onion powder, paprika, cayenne and pepper, and season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in tomatoes, then simmer uncovered for 20 minutes. Taste, and adjust seasoning for salt, then add okra, reduce heat to low and cook until okra is just tender, not mushy, and still has bite to it, no more than 10 minutes. The okra will naturally thicken the broth as it cooks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in corn and beans, cook for another minute or 2, then serve immediately with rice, cornbread and hot sauce. Refrigerate leftovers for up to 5 days, or freeze for up to 1 month. Return to a boil for 3 minutes before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021456-lowcountry-okra-soup"}