{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffing Panzanella With Cranberry Vinaigrette", "description": "The best way to reheat leftover stuffing? Press it into a pan, cut it into cubes and fry it in oil until crisp. The exterior browns and caramelizes, while the inside remains tender and creamy, just like the best bread pudding. This trick works best with stuffing made from smaller pieces of bread, but even if you don’t end up with perfect cubes, they will still be delicious. Serve them warm, on top of a fresh, raw salad tossed in a tangy cranberry-mustard vinaigrette, with fried pepitas running throughout for even more crunch. If you use a homemade cranberry sauce for the dressing, you may want to sweeten it with a touch of honey.", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "image": "https://static01.nyt.com/images/2020/11/25/dining/23leftoversrex2/merlin_179865849_4490e58a-65d5-4005-8ff0-c98b602e4799-articleLarge.jpg", "totalTime": "PT8H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, weeknight, salads and dressings, appetizer, main course, side dish", "keywords": "celery, cranberry sauce, fennel, greens, pear, radish, thanksgiving leftover, fall, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 85}, "recipeIngredient": ["2 tablespoons olive oil, plus more for greasing the pan", "3 cups leftover stuffing", "1/4 cup pepitas (or another seed or chopped nut)", "2 tablespoons olive oil", "3 tablespoons homemade, jarred or canned cranberry sauce", "2 teaspoons Dijon mustard", "2 teaspoons apple cider vinegar", "Kosher salt and freshly ground black pepper", "5 ounces shaved crunchy vegetables, such as radish, fennel, celery, cauliflower or carrot (about 2 lightly packed cups)", "1 medium, ripe pear, halved lengthwise, cored and thinly sliced", "4 ounces assorted crisp-tender greens, such as endive, radicchio, escarole, watercress, arugula, Little Gem or butter lettuce, torn if large (about 6 lightly packed cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start the stuffing croutons: Using olive oil, grease a 9-by-5-inch loaf pan, then line it with parchment paper, covering the bottom and 2 long sides with one sheet, creasing into the corners to ensure a snug fit. If the stuffing is cold, warm in the microwave for 1 minute, or covered in 350-degree oven for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the stuffing into the prepared loaf pan and press into a 1-inch layer using an offset spatula or the back of a spoon. Fold the parchment over, covering the top of the stuffing, and press firmly with your hands, tightly compacting the stuffing. If you have a second loaf pan of the same size, use that to pack down the stuffing and set something heavy on top — like a couple cans of beans — to weigh it down. Chill overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cranberry vinaigrette: In a medium nonstick or cast-iron skillet over medium heat, cook the pepitas in the 2 tablespoons olive oil, stirring frequently, until the seeds puff and lightly toast, 3 to 5 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together the cranberry sauce, mustard, vinegar and a big pinch of kosher salt. Scrape in the pepitas and oil, and whisk to combine. Season the vinaigrette to taste with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the stuffing croutons: To the same skillet, add 1 tablespoon olive oil and heat over medium-high. (The stuffing needs to be cooked hot and fast or it will stick and fall apart.) While the pan heats up, lift the stuffing out of the loaf pan and onto a cutting board. Cut the chilled stuffing into 1-inch cubes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the stuffing cubes to the hot skillet and cook until crisp and golden brown underneath, 1 to 2 minutes. Using a spatula or 2 spoons, flip the cubes, which will have sucked up all the oil, then drizzle them with the remaining 1 tablespoon olive oil. Cook on the second side until browned, 1 to 2 minutes. (No need to fry on more than two sides; the croutons are delicate and could fall apart.) Remove pan from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shaved vegetables and pear to the large bowl with the vinaigrette and toss to coat. Add the tender greens and gently toss to combine. Divide the salad across plates, top with stuffing cubes and serve right away."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021606-stuffing-panzanella-with-cranberry-vinaigrette"}