{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Yassa", "description": "Popular across West Africa, chicken yassa coaxes deep flavor from a handful of simple ingredients: smoky grilled chicken, sweet caramelized onions, tangy lime, bright ginger and spicy Scotch bonnet chile. This version comes from “The Fonio Cookbook” by chef Pierre Thiam (Lake Isle Press, 2019). Mr. Thiam, who was born and raised in Dakar, is the chef and owner of Teranga, a West African restaurant in Harlem. His recipe calls for bone-in chicken legs, but, in southern Senegal, where the dish originated, you might be served other chicken parts, fish yassa or even lamb yassa. The cooking method is flexible: The chicken develops the best smoky char when grilled, but will still be delicious seared in a grill pan or cast-iron skillet.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2020/04/29/dining/aw-chicken-yassa/merlin_171959976_0402c77f-140e-489f-823e-0a7f3caf93e1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "african", "recipeCategory": "dinner, poultry, main course", "keywords": "bay, chicken, dijon mustard, garlic, ginger, lime, onion, pepper, scallion, scotch bonnet chile, thyme, vinegar, kwanzaa", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1375}, "recipeIngredient": ["4 bone-in, skin-on chicken legs (2 1/2 to 3 pounds)", "4 scallions, trimmed, whites and greens finely chopped", "2 tablespoons fresh thyme, finely chopped (or 2 teaspoons dried)", "1 tablespoon white vinegar or apple cider vinegar", "1/2 cup lime juice (from 3 or 4 limes), plus more as needed", "4 tablespoons peanut, vegetable or canola oil, plus more as needed", "Kosher salt and black pepper", "2 pounds yellow onions, halved and sliced 1/2-inch thick", "1 green bell pepper, halved, seeded and cut into thin matchsticks", "1 whole Scotch bonnet chile, poked with a fork (or 1 whole habanero chile, 1 to 2 minced jalapeños, or 1/2 to 1 teaspoon red-pepper flakes)", "4 garlic cloves, finely chopped", "4 teaspoons finely chopped fresh ginger", "3 fresh or dried bay leaves", "2 teaspoons Dijon mustard (optional)", "Cooked rice or fonio, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the chicken legs with the scallions, thyme, vinegar, 1/4 cup lime juice and 1 tablespoon oil. Marinate in the fridge for at least 2 hours or up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a grill or grill pan, heat it over high; if using a cast-iron skillet, heat 1 tablespoon oil over medium-high. (If cooking indoors, pat the chicken dry, discarding marinade, then brush the chicken lightly with oil.) Season the chicken all over with salt and pepper. Working in batches if necessary, grill or sear the chicken until browned on both sides, 6 or 7 minutes per side. Transfer the chicken to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large pot, heat the remaining 3 tablespoons oil over medium-high. When the oil is hot, add the onions in an even layer, season with salt and pepper, and let sear without stirring for 3 to 4 minutes. Using a wooden spoon, stir occasionally to prevent onions from burning at the bottom of the pot, and allow onions to cook until they start to caramelize and take on some color, 10 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the bell pepper, chile, garlic, ginger, bay leaves and the mustard (if using), and continue stirring, adding 1 to 2 tablespoons of water as needed to avoid scorching at the bottom of the pot, another 5 minutes. Stir in another 1/4 cup lime juice, and season with 1 tablespoon salt and 2 teaspoons pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the grilled chicken into the pot, tucking it under the onions, then top with 1 cup water. Stir well, smooth mixture gently into an even layer, cover and simmer over medium until chicken is cooked through and tender, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season to taste and add more lime juice to taste, if desired. Serve chicken over rice, with onion mixture and sauce drizzled generously on top."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021053-chicken-yassa"}