{"@context": "http://schema.org", "@type": "Recipe", "name": "Kongguksu (Cold Soy Milk Noodle Soup)", "description": "Traditionally enjoyed during the summertime in Korea, this refreshing cold noodle dish requires just five ingredients: cucumbers, dried soybeans, pasta, salt and water. The base of the dish is a nutty and rich homemade soy-milk broth, which is served ice-cold over thin wheat noodles. There’s minimal hands-on work, but overnight soaking time is required, so plan ahead. Once the beans are fully soaked, the meal comes together in just 30 minutes. Adjust the thickness of the broth by adding more or less water, and for extra earthy flavor, try adding 1/4 cup of roasted pine nuts, peanuts or sesame seeds before blending. If you like, you can make the broth ahead of time and keep it in the refrigerator until ready to serve. You can also freeze it, but once thawed, whiz it in the blender to restore its smooth texture.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2020/09/02/dining/kc-kongguksu/merlin_176001786_ec55788a-47e0-42cd-89f3-ba55cab8964a-articleLarge.jpg", "totalTime": "PT8H30M", "recipeYield": "4 servings", "recipeCuisine": "korean", "recipeCategory": "dinner, lunch, noodles, main course, side dish", "keywords": "cucumber, soup, soybeans", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 173}, "recipeIngredient": ["1 cup dried soy beans (about 6 ounces)", "8 ounces somyeon or somen (thin wheat noodles)", "3 1/2 cups chilled water", "2 teaspoons kosher salt, plus more to taste", "2 Persian cucumbers, cut into 2-inch matchsticks", "Toasted black or white sesame seeds, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine soy beans with enough water to cover by 3 inches and refrigerate for 8 hours or up to overnight. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, cover soaked soy beans with enough water to submerge by 2 inches and bring to a boil over high. Reduce heat to medium and simmer, stirring occasionally and skimming foam and skins that rise to the top, until beans have softened but are still slightly crunchy, 10 to 12 minutes. (The beans should still have a little snap to them.) Drain beans and transfer to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the bowl with cold water, swish the beans around, then drain, pouring off any skins that rise to the top. Repeat until the beans are cold and the loosened skins are gone. (Not all skins need to be removed, just the ones that fall off on their own.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook noodles according to package instructions until al dente. Drain and run under cold water to stop the cooking. Divide among 4 bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender, combine soy beans with the chilled water and salt, then purée until smooth. Season to taste with more salt, if desired. If the broth isn’t cold, stir in a few ice cubes to chill it down before pouring it over the noodles. (Remove the ice first.) Garnish with cucumbers and sesame seeds, if using, and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021320-kongguksu-cold-soy-milk-noodle-soup"}