{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Fried Salmon With Green-Coconut Chutney", "description": "Coastal flavors from India permeate this crispy-skin salmon. The coconut chutney carries the buzz of ginger and green chile, while a drizzle of tadka — a hot, bright red oil infused with mustard seeds, curry leaves and Aleppo flakes — is the crowning glory of the dish. For perfectly crisp skin, resist the urge to fidget with the fish until the appropriate amount of time has passed; the skin will start to crisp at the edges and the fillet will release with ease. Use fresh or frozen coconut to make the chutney. (Desiccated coconut simply doesn’t work as well here.) You can use freeze-dried curry leaves instead of fresh, but you might need to double or even triple the amount, as their intensity is noticeably weaker in comparison.", "author": {"@type": "Person", "name": "Nik Sharma"}, "image": "https://static01.nyt.com/images/2020/09/02/dining/ns-pan-fried-salmon-with-green-coconut-chutney/merlin_175270404_c5e83ae4-8444-4f91-9816-e80df052fc9b-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, seafood, main course", "keywords": "cilantro, coconut, curry leaves, ghee, ginger, mustard seed, salmon", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 162}, "recipeIngredient": ["1 cup packed fresh or frozen (thawed) grated coconut", "1 cup packed cilantro stems and leaves", "1 fresh, hot green chile, such as a serrano or Thai chile, stemmed", "2 tablespoons grated fresh ginger", "2 tablespoons lime juice", "Kosher salt", "2 skin-on salmon fillets (about 6 ounces each)", "1 tablespoon ghee or unsalted butter", "1 tablespoon olive oil", "Kosher salt", "2 tablespoons grapeseed or canola oil", "1 teaspoon black or brown mustard seeds", "10 to 12 fresh curry leaves (or 25 to 36 dried curry leaves)", "1 teaspoon red-pepper flakes, such Maras, Urfa or Aleppo"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chutney: In a food processor, blend the coconut, cilantro, chile, ginger and lime juice with 2 to 3 tablespoons of water for a couple of seconds to get a coarse mixture. Add a little water (about 1 tablespoon) if needed to loosen. If you prefer a smoother texture, blend the ingredients in a high-speed blender until smooth. Taste and season with salt. Transfer to a bowl. (This chutney can be made a day in advance and stored in an airtight container in the refrigerator for up to 3 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the salmon: Place the salmon skin-side down on paper towels. Heat the ghee and oil together in a medium skillet over medium and swirl the pan to coat the surface well. When the pan is hot, season the fillets on both sides with salt and place them in the skillet, skin-side down. Reduce the heat to medium-low and let the fish cook undisturbed for 8 minutes, until the edges of the skin start to turn crispy and golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tilt the skillet slightly and, using a spoon, collect the hot fat that collects at the edge and ladle it over the top of the fish several times. Continue basting the fish until the tops turn opaque and a digital thermometer inserted into the center of the fish reads 125 degrees, about 2 minutes. (The exact cooking time will vary depending on the thickness of the fillet.) Use a spatula or a pair of kitchen tongs to carefully release the fish from the pan. (It should release easily if the skin is crisp.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide the chutney between two serving plates. Place the cooked fish on top, skin-side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the tadka: Heat the oil in a small saucepan over medium. When the oil is hot, drop in one or two mustard seeds; they should sizzle if the oil is hot enough. Add the remaining mustard seeds and swirl. The seeds should pop, and turn fragrant in 30 to 45 seconds. Add the curry leaves and cover the saucepan with a lid, swirl the contents of the saucepan, cook for 15 seconds until the curry leaves release their aroma. Remove from heat, add the red-pepper flakes and let the mixture sit for 1 minute. Pour the oil and spices over the fish and the chutney. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021405-pan-fried-salmon-with-green-coconut-chutney"}