{"@context": "http://schema.org", "@type": "Recipe", "name": "Onion Tart", "description": "The chef André Soltner served this classic warm onion tart almost every day for 43 years at Lutèce, his world-famous restaurant in New York City. It was for a whole generation the pinnacle of elegant French cuisine in the United States, and yet the tart is straightforward and uncomplicated, rustic and refined all at once. Let the onions slowly caramelize — don’t hasten the cooking by jacking up the heat — and you will be rewarded with a haunting savory-sweet tart in the end that is still irresistible decades later, the very definition of an enduring classic.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2020/11/08/magazine/08mag-Eat/08mag-Eat-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "brunch, dinner, lunch, pies and tarts, vegetables, main course", "keywords": "butter, heavy cream, nutmeg, pepper, yellow onion, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 948}, "recipeIngredient": ["2 cups/255 grams all-purpose flour", "Pinch of kosher salt", "1/2 cup/115 grams unsalted butter (1 stick), cut into thumbnail cubes", "1/2 cup/120 milliliters ice-cold water", "1 pound yellow onions", "2 tablespoons rendered bacon fat or lard", "1 large egg", "1/2 cup/120 milliliters heavy cream", "Freshly ground black pepper", "Freshly grated nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend flour and salt in the bowl of a food processor. Scatter butter over flour, top with lid and pulse 12 pulses to cut butter into flour to a coarse meal consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dump butter-flour mixture into a medium stainless bowl. Make a well in the center and pour ice-cold water into the well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a flexible plastic dough scraper instead of your warm hands, bring the dough together by folding and pressing. Be firm and brisk and get the dough past its shaggy stage into a neat disk, trying to avoid using your hands or too much kneading. Refrigerate the dough for 30 minutes. Heat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut the onions in half and peel them. Slice the halves with the ribs (root end to sprout end direction), not against, to create julienne slices rather than half moons."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide sauté pan over medium-low heat, melt the bacon fat and slowly sweat the onions until they are caramelized. Take all the minutes you need — 25 or so — to let them soften to translucent, then to let the water they release start to evaporate, then to allow the sugars they contain to start to brown in the pan, so that you end up with soft, sweet and evenly browned onions. This is achieved by a slow caramelization. Set onions aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll tart dough out to a 1/4-inch-thick round, and drape over a round 10-inch fluted false-bottom tart pan. Lay dough into the pan, gently pressing into the bottom, and roll the pin across the pan to cut off the excess dough. Use your fingers to press the edges into the flutes, accentuating the shape of the dough edge. Dock the bottom of the dough with the tines of a fork, weight the pastry with beans or weight and blind-bake for 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, beat the egg with the cream. Stir in the caramelized onions. Season with pepper, nutmeg and salt to taste. Stir well, and make sure the onions are all evenly coated with the custard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove tart shell from oven, and slip it onto a baking sheet. Remove weights, fill with the onion-custard mixture and distribute it evenly. Return tart to oven on the sheet, and bake for 25 minutes, or until custard has set, the tops of the onions start to achieve a deeper brown and the dough is dark golden brown at the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the ring, and allow to cool just a few minutes on the rack, so that the piping hot tart shell can kind of tighten up enough to be sliced with a sharp chef’s knife. (In the first few minutes straight out of the oven, the dough is kind of soft from the heat, possibly giving you the false impression that you have a soggy tart. Let it sit on the rack just to shake off this initial soft stage and to recrisp and refirm, which it will.) Cut into wedges, and serve while hot."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021594-onion-tart"}