{"@context": "http://schema.org", "@type": "Recipe", "name": "Mini Gingerbread Houses", "description": "If you’re looking for the sturdiest of gingerbread houses, this recipe will get you there. (Here's a <a href=\"https://int.nyt.com/data/documenttools/mini-gingerbread-houses/0212db588eb57244/full.pdf\">printable cut-out template</a>.) A high quantity of shortening is the secret to a strong house that will last for weeks (or more). If you like to nibble on your gingerbread house, use unsalted butter in place of shortening for a tastier and more cookie-like flavor. Whichever you choose, be sure to bake the cookies until they’re very crisp; doing so will reduce the moisture in the dough, which is important for the house’s stability. This recipe will produce more dough than you need for one large house or three small houses. Re-roll the scraps and make an extra small house, or create decorative elements like a door, window ledges, shutters, a chimney, or gingerbread people to snack on while you decorate.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2020/12/07/dining/ejm-gingerbread-village/merlin_180930123_4a3f05c0-f63a-4567-8626-0cef3090a636-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "About 3 1/4 pounds/1475 grams dough (3 small houses or 1 large house)", "recipeCuisine": "american", "recipeCategory": "cookies and bars, dessert", "keywords": "allspice, cinnamon, cloves, ginger, molasses, nutmeg, shortening, christmas, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 167}, "recipeIngredient": ["5 1/2 cups/700 grams all-purpose flour", "2 teaspoons ground cinnamon", "1 teaspoon ground ginger", "1/2 teaspoon ground cloves", "1/2 teaspoon ground allspice", "1/4 teaspoon ground nutmeg", "1 teaspoon baking soda", "1/2 teaspoon fine sea salt", "6 ounces/170 grams shortening, at room temperature", "6 tablespoons/85 grams unsalted butter, at room temperature", "1 cup/200 grams granulated sugar", "1/2 cup/120 milliliters molasses", "2 large eggs, at room temperature", "1 large egg yolk, at room temperature", "Royal icing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together the flour, cinnamon, ginger, cloves, allspice, nutmeg, baking soda and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the paddle attachment on medium speed, cream the shortening, butter and sugar until light and fluffy, 3 to 4 minutes. Add the molasses to the bowl and mix until fully incorporated, about 1 minute. Scrape the bowl well, and mix for 30 seconds more to ensure it’s uniformly combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the eggs one at a time, scraping down the sides of the bowl after each addition. Add the yolk and mix well to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add about half of the dry ingredients, and mix on low speed until it begins to incorporate. Add the remaining dry ingredients and continue to mix, scraping down the sides of the bowl once or twice as needed, until the dough comes together uniformly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For a large house, divide the dough into two pieces and shape into 1-inch-thick rectangles. If making three small houses, divide the dough into three pieces and shape into 1-inch-thick rectangles. Wrap tightly in plastic wrap and refrigerate at least 3 hours or up to overnight. Let the dough soften at room temperature for a few minutes before rolling out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out a rectangle of chilled dough between two sheets of parchment paper to 1/4-to 1/3-inch thick. (Don't roll it too thin; thicker dough will be sturdier and easier to work with.) You can use a little flour when rolling the dough if needed, but only if necessary. (Chilling the dough for 5 to 10 minutes can also help if it becomes too sticky.) Use the parchment to slide the dough onto a baking sheet. If any of the dough rips or tears, use your hands to gently press it back together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the top parchment paper and set aside to use for lining the sheet pans for baking. Using a template as a guide, cut out the gingerbread house pieces with a paring knife, being careful to get as many pieces out of one piece of dough as you can. Refrigerate the cut shapes as you repeat with the remaining piece(s) of dough. Set aside the dough scraps to re-roll and use for decorative elements."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the oven rack in the center of the oven, and heat oven to 375 degrees. Line two sheet pans with parchment, and using an offset spatula, transfer the pieces to the sheet pans, about 2 inches apart. Return one pan to the refrigerator while you bake the other."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the gingerbread pieces until they appear evenly brown with slightly darker edges, rotating the pans halfway through baking, about 15 to 25 minutes. Repeat with the remaining pieces. (Exact baking time will depend on the size of your pieces, but it's best to err on the side of overbaking. They should appear set, but will firm up as they cool. Cool completely before assembling.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, you’ll need a base like a cutting board or a cake board. Start with the front or back piece of the house. Fill a pastry bag or a resealable plastic bag with royal icing. Snip off the corner and pipe icing along the bottom of the piece (where the wall would meet the floor). Place it upright, frosting-side down, onto the base and hold it for about 1 minute. (The icing will not fully set, but it will begin to dry. You can use a can or jar to support the wall as it dries and you add the other pieces.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Next, take a long side wall piece. Pipe icing along the bottom and along the short side that will connect to the first wall you just erected. Press the two pieces firmly together perpendicularly and hold for about 1 minute. Use another can or jar to support the walls if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat this process with the remaining walls. Let the walls set until the icing is firm, at least 15 to 20 minutes, before adding the roof."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Apply icing to the edges of both roof pieces. Apply the roof pieces one at a time, and hold in place for 1 to 2 minutes to allow the icing to set a bit before adding the other, then add more icing where they meet. Hold them firmly for 1 to 2 minutes. Let the icing dry completely before you add any other decor, about 30 minutes."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021708-mini-gingerbread-houses"}