{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Roasted Tomatoes With Olive Oil and Lime", "description": "Inspired by a meal at Le Jardin des Plumes in the French town of Giverny, where the artist Monet lived and worked, this dish is as beautiful as it is unusual: It’s simply a tomato gently roasted and basted with olive oil. It tastes vegetal and rich, as you’d expect, but it’s also sweet and citrusy. The surprise is at the core, which gets filled with sugar and lime zest. During the hours in the oven, the oil, sugar and zest find their way into every fiber of the tomato, technically making it a kind of confit, a dish usually cooked in fat or sugar — or, in this case, both. Serve the tomato warm or at room temperature as a starter, perhaps with a tiny salad, or, for your most adventurous friends, serve it chilled for dessert, topped with vanilla ice cream, a drizzle of oil and some flaky salt.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2020/09/20/magazine/20Eat/20Eat-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "appetizer, dessert, side dish", "keywords": "extra virgin olive oil, lemon oil, lime, sea salt, tomato, summer, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 497}, "recipeIngredient": ["Ice cubes, as needed", "4 medium, ripe but firm round tomatoes", "2 tablespoons granulated sugar", "2 limes", "1/4 teaspoon pure lemon or lime oil or extract (see Tip), optional", "1/2 cup extra-virgin olive oil, preferably mild and fruity", "Maldon or other flaky sea salt", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven and heat to 200 degrees. Have a nonreactive baking pan at hand that can hold the tomatoes comfortably, such as a 9-inch, deep-dish pie plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large saucepan of water to boil and fill a large bowl with cold water and ice cubes. Cut a shallow X in the bottom of each tomato, and one by one, drop them into the boiling water. Count 15 to 20 seconds, then transfer the tomatoes to the bowl of ice water. Peel each tomato. Using a small knife, remove each tomato’s core, creating a V-shaped hollow an inch or so deep. Arrange the tomatoes in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the sugar in a small bowl, then finely grate the zest from both limes over it. Rub the ingredients together between your fingertips until the sugar is moist and aromatic and maybe colored. Spoon an equal amount of sugar into each tomato."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re using lemon or lime oil or extract, stir it into the olive oil. Spoon the olive oil over the tomatoes, allowing just a few drops to fall into the tomatoes’ hollows."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 2 to 3 hours, basting a couple of times each hour, until the tomatoes are soft all the way through but still hold their shape. (You can poke them with a bamboo skewer or the tip of a thin knife to test.) Remove the dish from the oven, and season the tomatoes with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "These are best served at room temperature, but can also be enjoyed warm or even chilled. Spoon a little oil from the baking dish over each tomato just before serving. These are at their peak the day they are made, but they’ll hold for a day in the refrigerator. If you’ve refrigerated the tomatoes, it’s best to serve them either chilled or at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021432-slow-roasted-tomatoes-with-olive-oil-and-lime"}