{"@context": "http://schema.org", "@type": "Recipe", "name": "Mixed Apples Pie", "description": "This is essentially a classic double-crusted apple pie, packed tight with fruit, but it calls for a wide variety of apples, giving it far more flavor. For the most nuanced filling, use as many different types as possible: A mix of sweet, tart, crunchy and tender apples will yield complex tastes and textures. The sharp acidity of lime juice heightens the tanginess of your blend, half of which should be firm apples to keep the filling from collapsing. To ensure success with the crust, keep the ingredients cold, popping them into the freezer if needed, and work quickly with a gentle touch. A generous layer of spiced cookie crumbs prevents the bottom crust from getting soggy and lends even more warmth.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2020/11/11/dining/06pierex/merlin_179623644_e2d1cc90-0e54-43f7-942f-bfef9067d394-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "One 9-inch pie", "recipeCuisine": "american", "recipeCategory": "dessert", "keywords": "apple, apple pie, cardamom, cinnamon, cookie crumbs, birthday, christmas, thanksgiving, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 738}, "recipeIngredient": ["1 tablespoon granulated sugar", "2 1/3 cups/300 grams all-purpose flour, plus more for rolling the dough", "3/4 teaspoon fine sea salt", "1 cup/225 grams cold unsalted butter (2 sticks), preferably high-fat European-style, cut into 1/2-inch cubes", "1/3 cup/40 grams spiced cookie crumbs, crushed from crunchy varieties such as Biscoff or gingersnaps", "2/3 cup/130 grams granulated sugar", "1/3 cup/45 grams cornstarch", "1 teaspoon ground cinnamon", "1/2 teaspoon ground cardamom", "1/4 teaspoon fine sea salt", "3 1/2 pounds/1.5 kilograms apples (about 8), a mix of tart, sweet, crunchy and soft varieties such as Granny Smith, Gala, Opal and Jazz, peeled and cored", "1 tablespoon fresh lime juice", "2 tablespoons cold unsalted butter, cut into 1/4-inch cubes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Whisk sugar and 1/3 cup/80 milliliters water in a small bowl until sugar dissolves, then place in the freezer. In a large bowl, whisk flour and salt, then toss the butter cubes until evenly coated. Using your fingertips, quickly flatten and rub the butter into the flour, while tossing the smushed pieces to coat until the mixture is mostly thick, powdery flakes and pebbles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a well in the center of the mixture and add the chilled water all at once. Using your fingers, rake the dry ingredients into the wet and stir until mixed. Continue stirring with your fingers, occasionally squeezing the blend gently, until large, shaggy clumps form."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press the clumps together and into the remaining dry bits to gather into a single mass. Divide the dough in half and pat each half into a 1-inch-thick disk. Wrap tightly in plastic wrap and refrigerate until firm, at least 1 hour and up to 1 day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, use a floured rolling pin to roll out a dough disk into a 12-inch round. Fit into a standard 9-inch pie plate, gently tucking and pressing the dough against the bottom and sides without stretching it. Sprinkle the cookie crumbs in an even layer across the bottom and gently press into the dough. Transfer to the refrigerator. Roll out the other disk into a 12-inch round, slide onto a parchment paper-lined baking sheet, and refrigerate while you prepare the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Place a rimmed baking sheet on the lowest oven rack and heat oven to 425 degrees. Whisk the sugar, cornstarch, cinnamon, cardamom and salt in a large bowl. Cut each apple into 8 wedges, then cut each piece into 1/4-inch-thick slices crosswise. Add to the bowl and pour the lime juice over, then toss until evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape half the apples into the chilled bottom crust and press down firmly to eliminate any gaps. Top with the remaining apples, pressing firmly into a mound. Scatter the chilled butter bits evenly on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flip the other dough round over the apples to cover and peel off the parchment. Using scissors, trim the edges together 1/2 inch past the plate’s rim. Fold and tuck the edges under so that they’re flush with the rim and crimp, decoratively if you’d like. Using a sharp paring knife, cut 8 (3-inch-long) slits in the center of the top dough, spacing evenly. Think of these slits as a guide for cutting the baked pie into wedges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pie on the heated baking sheet and bake for 30 minutes. Reduce oven temperature to 325 degrees and bake until the crust is brown and the filling is bubbling, 55 to 60 minutes longer. A thin paring knife should slide through the apples easily. Transfer the pie plate to a wire rack to cool completely before slicing."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021614-mixed-apples-pie"}