{"@context": "http://schema.org", "@type": "Recipe", "name": "Sour Plum Molasses", "description": "Often made from sour varieties of pomegranates, apples, cherries, oranges and plums, sour fruit molasses is a staple in Northern Iranian cooking. Hanif Sadr uses wild plums that he forages in the Bay Area, which make his molasses extra sour, but store-bought plums work just as well. It’s a simple but long process, though it doesn’t take all day, as it would in Iran. Similar to preparing a fruit butter without sugar, this recipe calls to cook the fruit once to soften and release juices, then cook again to thicken. A nonstick pot prevents the molasses from burning on the sides and means less stirring. This molasses is worth the effort: You get a thick, spreadable sauce with a deep, caramelized plum flavor. Leftovers keep for a year refrigerated; use them for a variety of Iranian kebabs and stews, or mix with butter and rub on a whole chicken before roasting, as Mr. Sadr does.", "author": {"@type": "Person", "name": "Leena Trivedi-Grenier"}, "image": "https://static01.nyt.com/images/2020/09/09/dining/10Sadrrex1/merlin_175613172_17d5aa21-8d67-4917-8a41-f428c84a072a-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "About 1 1/4 cups", "recipeCuisine": "middle eastern", "recipeCategory": "condiments", "keywords": "kosher salt, plum, summer, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "recipeIngredient": ["2 pounds plums (about 6 large), wild if possible, a mix of ripe and unripe plums (up to one third can be totally unripe)", "3/4 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash and dry the plums, then add the whole plums to a medium nonstick pot. Add 1 cup water, then cover with a lid. Bring to a boil over high heat, then reduce heat so the pot is barely at a simmer. Cook for 1 hour, stirring occasionally. You should end up with a pot full of juice and soft fruit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the plums and juice through a fine-mesh strainer into a medium bowl. Use a rubber spatula to press as much fruit through the strainer as possible, then discard remaining skins and pits. (You should have about 3 1/4 cups pulpy plum mixture.) Rinse out and dry the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the pulpy plum mixture back into the clean pot and bring to a simmer over high heat while stirring and scraping the sides of the pot. Lower heat so the pot is barely bubbling. Continue to cook, uncovered, for about 1 3/4 hours, stirring occasionally, scraping down the sides of the pot and adjusting the heat as necessary to keep it barely bubbling. As the molasses thickens in the last 20 minutes, stir and scrape down the pot more frequently to prevent the mixture from sticking and burning. Depending on the size of your pot, you may not need the full amount of time; watch closely toward the end."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the salt, then cook for another 10 minutes, stirring frequently. The finished molasses will be sour, with a deep, caramelized plum flavor, and spreadable, holding its shape on a spoon. Remove from heat and ladle into a warm, dry lidded jar that has been sanitized in boiling water. Seal it while still warm, then let the jar come to room temperature before refrigerating. Store in the fridge for up to 1 year."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021283-sour-plum-molasses"}