{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb and Eggplant Pide", "description": "Sometimes referred to as Turkish pizza, pide (pronounced pea-DAY) is made with a simple yeast dough. You can make your own dough, or use two 8-ounce balls of store-bought pizza dough, if you like. Spiced ground lamb is a typical Turkish topping, but we use some diced eggplant and a bit of yogurt and mint as a nod to moussaka. Adding an egg to the yogurt thickens it, so when it’s cooked it becomes an almost-cheesy layer between the meat and dough. If you can’t find ground lamb, you can substitute ground beef, and for a vegetarian version, omit the meat and double up on the eggplant.", "author": {"@type": "Person", "name": "Jessica Battilana"}, "image": "https://static01.nyt.com/images/2020/08/20/dining/jb-pide/merlin_175805178_4e3493fc-4297-4ce5-82b0-4d57a2f9056b-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "12 pide or 6 servings", "recipeCuisine": "turkish", "recipeCategory": "dinner, lunch, snack, breads, appetizer, main course, side dish", "keywords": "eggplant, flour, lamb, sugar, yeast, yogurt, fall, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 126}, "recipeIngredient": ["3/4 cup/180 milliliters warm water", "1 tablespoon granulated sugar", "1 1/2 teaspoons active dry yeast", "2 1/4 cups/290 grams all-purpose flour, plus more for rolling", "1 1/2 teaspoons kosher salt", "2 tablespoons olive oil", "3 tablespoons olive oil", "1 small onion, diced", "1 small eggplant (8 ounces/225 grams), diced", "Kosher salt", "2 tablespoons tomato paste", "1/2 teaspoon ground cumin", "1/2 teaspoon black pepper", "1/4 teaspoon ground cinnamon", "1/4 teaspoon red-pepper flakes", "1/8 teaspoon ground allspice", "1/2 pound/225 grams ground lamb", "2 garlic cloves, minced", "1/2 cup/15 grams fresh mint, finely chopped", "1 tablespoon olive oil, for brushing the pans and the pides", "1/2 cup/120 milliliters plain full-fat yogurt", "1 large egg", "Kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In the bowl of stand mixer fitted with the dough hook attachment (or in a large bowl with a wooden spoon) combine the water and sugar. Sprinkle the yeast on top and let stand 5 minutes until foamy. With the mixer on low speed, add the flour, salt and olive oil and mix until combined. Increase the speed to medium, and mix until the dough comes together as a smooth ball. Cover the bowl with plastic wrap and let stand in a warm place until doubled in size, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the dough is rising, make the filling: Heat the olive oil in a large (12-inch) skillet over medium. Add the onion and eggplant and several pinches of salt, and cook, stirring frequently, until softened and beginning to brown, 8 to 10 minutes. Stir in the tomato paste, cumin, black pepper, cinnamon, red-pepper flakes and allspice and cook for 1 minute. Add the lamb, increase the heat to high and cook, breaking up the chunks of meat with a wooden spoon, until the meat is barely pink, 5 to 6 minutes. Stir in the garlic and cook 1 minute more, stirring constantly (or removing from the heat as necessary) to keep the garlic from scorching. Let cool slightly, then stir in the mint. Season to taste with more salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the racks in the top and bottom third of the oven, and heat oven to 400 degrees. Lightly grease 2 rimmed baking sheets. In a small bowl, whisk together the yogurt and egg, and season with salt and pepper. Set aside. Transfer the dough to a lightly floured work surface and divide into 12 pieces, each about 1 1/2 ounces/45 grams. With a floured rolling pin, roll each piece of dough into an even oval measuring about 6-by-4 inches/15-by-10 centimeters. Working with one piece of dough at a time, spoon a scant tablespoon of the yogurt mixture into the center of the oval, then use the back of the spoon to spread it in a thin layer, leaving a 1/2-inch border. Spoon some of the lamb mixture on top of the yogurt and spread in an even layer. Fold the edges of the dough up and pinch the ends so the pide resembles a canoe. With a large spatula (or the bottom of a removable bottom tart pan) transfer the pide to the prepared baking sheet. Repeat with the remaining dough, yogurt and lamb."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush each pide with some of the remaining 1 tablespoon olive oil. Bake until the dough is deep brown, 18 to 23 minutes, rotating the pans and switching oven racks halfway through baking. Transfer to a wire rack and let cool. Eat warm or at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021387-lamb-and-eggplant-pide"}