{"@context": "http://schema.org", "@type": "Recipe", "name": "Dumplings With Chile Crisp", "description": "Great dumplings are as much about texture as taste, and these double the welcome contrast of tenderness and crunch. Simultaneously fried and steamed in a covered skillet, the wrappers develop crackling brown bases, while the tops become delicately chewy. Inside, the crunch of spicy chile crisp punctuates soft tofu and greens. Wringing water out of both fillings first allows them to soak in the soy sauce and chile crisp and ensures the filling doesn’t end up watery or bland. Another benefit to this vegan filling is the ability to taste it raw and adjust the seasonings before wrapping.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2021/02/03/dining/01Dumplingrex3/merlin_182770566_40458909-be4a-4dd7-afe9-7eb27906aa0b-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 35 dumplings", "recipeCuisine": "asian, chinese", "recipeCategory": "dinner, lunch, snack, dumplings, appetizer, side dish", "keywords": "celeriac, firm tofu, lunar new year, soy sauce, spinach, tofu, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1014}, "recipeIngredient": ["8 ounces firm tofu, cut into 1/4-inch slices", "6 ounces spinach, watercress or baby bok choy, finely chopped (3 cups)", "3 ounces garlic chives or scallions, thinly sliced (1 cup)", "1 teaspoon kosher salt", "2 celery stalks, finely chopped (1/2 cup)", "1 tablespoon soy sauce, plus more for serving", "1 tablespoon chile crisp, plus more for serving", "35 <a href=\"http://cooking.nytimes.com/recipes/1021845-homemade-dumpling-wrappers\">homemade dumpling wrappers</a> or store-bought round wrappers", "Grapeseed or other neutral oil, for frying", "Chinese black vinegar or rice vinegar and sesame oil, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the tofu slices in a single layer on a clean kitchen towel or between double layers of paper towels. Roll tightly in the towel as if rolling a sleeping bag, then squeeze it over the sink to remove as much liquid as possible. Let stand 10 minutes for the tofu to continue releasing liquid. If the towel gets soaked, transfer the tofu to another dry towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the spinach, chives and salt in a colander. Let stand for 10 minutes, then squeeze the greens in the colander over the sink to release as much liquid as possible. Transfer the greens mixture to a large bowl. Add the drained tofu, squeezing it to crumble into bits as you add it, then mix evenly with the greens. Add the celery, soy sauce and chile crisp, and stir until evenly mixed. Taste, and add more soy sauce and chile crisp, if you’d like. The filling on its own should be very flavorful because the wrappers are not seasoned at all."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up a dumpling assembly line with the bowl of filling, wrappers and a small bowl of water. Using a dessert spoon or other small spoon, scoop a mound of filling, then press it against the side of the bowl into a tiny football. Set the filling in the center of one wrapper. Use your fingertip to dampen the edges with water. Bring together the sides over the filling to enclose in a half-moon. Pinch the center together, then press the edges together to seal, pleating decoratively if you’d like. Sit the dumpling upright on your work surface. Repeat with the remaining filling and wrappers. Cook immediately or freeze in a single layer on a rimmed baking sheet until hard, then transfer to airtight containers and freeze for up to 3 months."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "You can cook as many or as few dumplings at a time as you’d like. Choose your pan size accordingly: An 8-inch skillet will fit 8 to 10; a 10-inch will fit 14 to 16. When ready to cook, coat a well-seasoned cast-iron pan or nonstick skillet with a thin, even layer of oil. Arrange the dumplings in the pan, pleated side up, spacing 1/3 inch apart, and filling the pan. Add enough cold water to the pan to come 1/3 inch up the sides (about 1/4 cup for an 8-inch pan; 1/2 cup for a 10-inch)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the skillet and cook over medium until the rapid firecracker popping diminishes to a steady, low crackle, indicating that all the water has evaporated, about 10 minutes. Uncover and check to see if the bottoms are browned and the dough is slightly translucent all the way to the top. If so, remove from the heat. If not, cook uncovered 1 to 2 minutes longer. Let stand for a minute so the dumplings release from the skillet naturally. Transfer to a plate, browned side up. Make your own dipping sauce with any combination of soy sauce, chile crisp, vinegar and sesame oil, and enjoy with the hot dumplings."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021846-dumplings-with-chile-crisp"}