{"@context": "http://schema.org", "@type": "Recipe", "name": "Small-Batch Blueberry Muffins", "description": "Michelle Lopez, the author of “Weeknight Baking: Recipes to Fit Your Schedule” (Simon & Schuster, 2019), was inspired by the oversize muffins at Levain Bakery when she developed this recipe. The keys to the loftiest muffins? Plenty of batter and a high oven temperature, which ensures that they rise quickly and bake with a beautiful top and a tender interior. For the best results, rest your batter before baking. One very important tip: Spray the muffin pan and its edges generously with nonstick cooking spray. When the muffins come out of the oven, immediately use a small offset spatula to gently release their edges from the pan, then let them cool completely before removing them. You can use frozen blueberries instead of fresh, but be sure to thaw and drain them, then let them come to room temperature before adding them to the batter.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2021/02/10/dining/10SmallBatch-blueberry-muffins/merlin_183223992_ce1e2a41-06af-4731-af1c-ae8094820c2a-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 muffins", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, breads, pastries, dessert, main course, side dish", "keywords": "blueberries, butter, mother’s day, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 897}, "recipeIngredient": ["1 1/4 cup/160 grams all-purpose flour", "1 teaspoon baking powder", "1/4 teaspoon kosher salt", "4 tablespoons/55 grams unsalted butter (1/2 stick), at room temperature", "1/2 cup/100 grams plus 4 teaspoons granulated sugar", "1 large egg, at room temperature", "1/4 teaspoon vanilla extract", "1/4 cup/60 milliliters whole milk, at room temperature", "1 1/4 cup/180 grams fresh blueberries, at room temperature", "Nonstick cooking spray"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the flour, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, cream the butter and 1/2 cup sugar on medium-high until light and fluffy, 2 to 3 minutes. Scrape down the sides of the bowl. Add the egg and vanilla, then mix on low speed until fully incorporated, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer on low, add the dry ingredients in 3 additions, alternating with the milk. Mix until just combined, scrape down the sides of the bowl, then mix for 30 seconds more. Scrape down the sides of the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using clean hands, mash 3/4 cup blueberries while adding them to the batter. Beat on low speed until they are just incorporated. Add the remaining berries, mixing until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At this point, the muffin batter can be covered and allowed to rest at room temperature for up to 1 hour. If not resting the batter, heat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously spray the corner 4 cavities of a muffin pan (preferably nonstick) with nonstick cooking spray. (Make sure to spray around the top edges of those cavities, too, since the tops spread.) Evenly divide the batter across the prepared cavities. (They will appear very full.) Sprinkle each muffin with 1 teaspoon granulated sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the muffins until the tops are domed and golden brown at the edges and a skewer inserted into the center comes out with a few moist crumbs, 22 to 24 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the muffins come out of the oven, immediately run a small offset spatula very gently under the edges of the muffin top, being careful not to separate it from the bottom. Allow the muffins to cool completely, about 1 hour, before unmolding the muffins by placing a wire rack or platter on top of the muffins, holding the muffin tin and rack together, and flipping it over. Store the muffins in an airtight container at room temperature for up to 2 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021868-small-batch-blueberry-muffins"}