{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Chops With Onion Gravy", "description": "<em>This is a no-recipe recipe, a recipe without an ingredient list or steps. It invites you to improvise in the kitchen.</em></p>\n<p>Start with the pork chops, as many as you need, on the bone if possible. Dredge them in flour that you’ve mixed with chile powder, salt, black pepper, smoked paprika and red-pepper flakes, or with Lawry’s seasoned salt or Old Bay seasoning or any spice you like, really. (Save what’s left of the flour; you’ll use it later.) Then sear the chops, in batches if you have to, in an oil-slicked Dutch oven or heavy cast-iron pan, over fairly high heat. You want a big, flavorful crust on the meat before you braise it with the onions, to enhance the taste of the sauce and provide a little texture. Set the seared chops on a platter. Throw away what oil is left in the pot, and wipe out the pot. Return it to the stove, and set over medium heat. Add some butter, and when it melts and foams, use it to sauté an enormous number of sliced onions, allowing them to wilt and soften and almost start to go brown. Sprinkle a scant handful of the leftover dredging flour over the onions, then keep stirring for a few minutes to dampen the rawness of the flour. Add about half an inch of chicken stock (or water) to the pot, along with a bay leaf, perhaps, then stir to thicken. If the sauce is too thick for your liking, add a little more liquid. Nestle the pork chops into the sauce, remove from heat, cover the pot and put it into a 350-degree oven for 45 minutes to an hour.\nWhile the pork cooks, make the mashed potatoes, with hot milk, melted butter, plenty of salt and enough lemon zest to give them a real brightness. So: pork, gravy, potatoes. I like some hearty sautéed greens moistened with chicken stock. Maybe a drizzle of red-wine vinegar too? You’ll know what to do when you get there. This is not a recipe. It’s your dinner. Make it however you like.</p>\n<p><em>Sam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. <a href=\"https://www.nytimes.com/newsletters/cooking\">Sign up to receive it.</a> You can find more no-recipe recipes <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/14326423-no-recipe-recipes\">here</a>.</em></p>", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2021/03/07/magazine/07mag-eat/07mag-eat-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Varies", "recipeCuisine": "american", "recipeCategory": "dinner, meat, vegetables, main course", "keywords": "fall, spring, winter, greens, lemon, onion, pork chops, potato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 609}, "recipeIngredient": [], "recipeInstructions": null, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021956-pork-chops-with-onion-gravy"}