{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Turkey Skewers With Cumin-Lime Yogurt", "description": "This recipe is a twist on the kebabs, kofte and grilled meats that are staples of Middle Eastern cuisines. Sumac powder, which is made from dried, ground sumac berries, is sprinkled on the kebabs to add a tart, lemony brightness to them, but if you don’t have sumac, you can leave it out. Eat the skewers with a knife and fork, or, better yet, make little pita sandwiches with all of the fixings — the crunch of the cucumbers, cooling yogurt and the refreshing bite of mint are essential to balancing the dish. If you have trouble finding Persian cucumbers, use English cucumbers instead.", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "image": "https://static01.nyt.com/images/2020/07/26/dining/yf-turkey-kebabs/merlin_174609744_01bf4de9-487c-4428-a2e1-e4cee9a6b119-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, weekday, meat, skewers and kebabs, main course", "keywords": "cucumber, lime, mint, pita, red onion, sumac, turkey, turmeric, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 883}, "recipeIngredient": ["4 large pitas", "1 tablespoon olive oil, plus more as needed", "1 cup full-fat (at least 5 percent) Greek, skyr or other thick yogurt", "1 lime, halved", "1 tablespoon plus 1/2 teaspoon ground cumin", "Kosher salt", "1 pound ground turkey, preferably dark", "1 tablespoon ground turmeric", "1 medium red onion, peeled and halved (one half grated and strained, and the other sliced into 1-inch wedges)", "1/2 tablespoon sumac powder (optional)", "1 packed cup fresh mint sprigs", "2 Persian cucumbers, thinly sliced into thin coins"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak 8 bamboo or wooden skewers in water for 10 to 30 minutes before you begin the recipe."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Lightly brush the pitas with oil, place on a sheet pan under the broiler for 1 to 2 minutes per side, then wrap in foil to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small serving bowl, stir together the yogurt, juice of 1/2 lime, 1/2 teaspoon cumin and 1/2 teaspoon kosher salt. Scoop out 1/4 cup of the yogurt mixture and place in a large mixing bowl. Place the remaining yogurt in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently combine the turkey, remaining cumin, turmeric, grated onion and 1 teaspoon kosher salt in the bowl with the yogurt until most of it has a mustard-orange hue. Divide the meat into 8 similar-sized loose balls. Lightly wet your hands so the meat doesn’t stick, then shape the meat around the skewers by placing the meat in one hand, pressing the skewer in the center, then using the fingertips and thumb of the bottom hand to shape the meat by lightly pressing it to create an oblong shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the skewers in the center of a sheet pan and sprinkle the sliced onion on the outskirts. Use your hands to rub the onions and the outside of the skewers with oil, then season the onions with salt. Place the remaining 1/2 lime on the pan cut-side up, and roast until the outside of the meat is a darker mustard color and no longer pink inside, 11 to 14 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze the lime juice on top of the turkey and slide the meat off the skewers. Place the pitas on a serving plate, spoon some of the reserved yogurt on them, then place the turkey and onion slices on top. Sprinkle all over with the sumac, if using, and serve with mint, cucumbers and the remaining yogurt."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021251-spiced-turkey-skewers-with-cumin-lime-yogurt"}