{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Stewed Tripe With Scallions", "description": "This spicy, slippery tripe begs to be slurped like a bowl of noodles, so you may want a roll of paper towels nearby. Slicing the tripe as thinly as possible provides a soft, tender texture, and the collagen that yields from the calf’s foot makes the broth itself slick and full-bodied. The mix of chiles creates a great and powerful warmth that spreads across your chest and leaves a bold, pleasant zing on the tongue, but it is not the kind of sharp or angry spicy that makes your eyes water or your nose run. The paper towels are for tidying up around your enthusiasm, not for dabbing your tears.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2021/01/17/magazine/17mag-eat/17mag-eat-articleLarge-v2.jpg", "totalTime": "PT6H", "recipeYield": "2 quarts", "recipeCuisine": "", "recipeCategory": "meat, soups and stews, main course", "keywords": "calf's foot, chiles de árbol, guajillo chiles, scallion, tripe, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 103}, "recipeIngredient": ["4 pounds honeycomb tripe", "1 medium yellow onion, unpeeled but cut in half horizontally", "1 whole head garlic, unpeeled but cut in half horizontally", "1/2 ounce chiles de árbol (about 20 chiles), plus 1 more chile de árbol", "1 calf’s foot (about 1 1/2 pounds), split, cut crosswise into 2-inch pieces and well rinsed to remove any grit and blood", "2 quarts broth of any kind (mixed meats, chicken or beef)", "3/4 ounce guajillo chiles (about 3 large)", "1/4 ounce ancho chile (1 chile)", "1 tablespoon dried oregano", "1/2 teaspoon ground cumin", "Kosher salt", "2 big bunches scallions or green onions, cleaned, roots snipped, then sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the stewed tripe: Put tripe in a heavy pot and cover with 1 inch cold water. Bring to boil over high heat, then drain and set aside. Put onion, garlic and 1 chile de árbol into a cheesecloth sachet. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add foot pieces and 2 quarts water to the pot, and bring to boil over high heat. Reduce heat to medium, and simmer, skimming any foam that rises to the surface, for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, slice the flat sections of tripe into thin, 4-inch-long ribbons resembling noodles — wider than linguine but not quite as thick as fettuccine — and any folds and thick creases into skinny coins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tripe and onion sachet to calf’s foot, cover with 2 quarts broth and simmer, uncovered, for 4 hours until soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the chile powder: Heat the oven to 375 degrees. Lay the guajillo chiles, ancho chile and remaining chiles de árbol on a sheet pan and heat them through for 8 to 10 minutes — enough time for them to become hot and fragrant but not enough time for them to take on dark color. Let the chiles cool completely until they again feel dry and brittle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull off the chile stems and tap out the seeds, or split the chiles like a vanilla bean to let out the seeds. Pulse the dry skins in a spice mill to fine flakes the same texture as fish meal. (It makes about 6 tablespoons chile powder.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and discard feet and sachet. (A majority of the flesh and fat and tendon of the foot should have turned gelatinous and fallen off; what’s left on the foot is mostly stark, bare bone.) Stir in the chile powder, plus the oregano, cumin and a little salt to taste. Simmer, uncovered, 45 minutes more until tripe is slippery soft and broth is dark as leather."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle tripe and broth into bowls, and positively shower each portion with a mountain of sliced scallions."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021785-spicy-stewed-tripe-with-scallions"}