{"@context": "http://schema.org", "@type": "Recipe", "name": "Chile-Oil Fried Eggs With Greens and Yogurt", "description": "This recipe, adapted from a dish served at MeMe’s Diner in Prospect Heights, Brooklyn, is a brunch power move. Eggs sit atop wilted greens on a bed of yogurt, all surrounded by seeded chile oil. The fresh yogurt cuts through the chile oil’s heat, and the seed mix adds layers of flavor and crunch. If you’re feeling lazy — it is brunch after all — skip the greens, or use everything spice mix and peanuts, for the seed mix. But don’t skimp on the chile oil: It’s the best part. Scale it up to have extra on hand for future use, or use store-bought if you like. (You’ll need about 1 cup for four servings.) Serve with toast, to sop up the extra oil.", "author": {"@type": "Person", "name": "Krysten Chambrot"}, "image": "https://static01.nyt.com/images/2020/04/22/dining/kc-meme-diner-eggs/merlin_171456846_e6f0020f-831f-4890-85ef-9f573a60d1d2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, lunch, main course", "keywords": "cinnamon stick, egg, egg dish, ginger, greek yogurt, kale, red pepper flakes, sesame seeds, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 438}, "recipeIngredient": ["3 tablespoons red-pepper flakes", "1 small cinnamon stick", "1 whole star anise", "3/4 teaspoon green cardamom pods (about 15 pods), optional", "1/2 teaspoon whole fennel seeds", "1/4 teaspoon whole black peppercorns", "1 cup neutral oil, such as canola or safflower", "1 garlic clove, peeled and smashed", "1 (1/4-inch) piece fresh ginger, thinly sliced (optional)", "2 tablespoons black or white sesame seeds (or a mix)", "2 tablespoons pepitas or sunflower seeds (or a mix)", "2 tablespoons whole roasted, salted peanuts", "1 1/2 teaspoons garlic flakes, chopped dried garlic chips or onion flakes", "2 tablespoons neutral oil, such as canola, plus more as needed", "1 large bunch curly kale (about 1/2 pound), stems removed and leaves torn into bite-size pieces", "Kosher salt", "1 tablespoon apple cider vinegar, champagne vinegar or white vinegar", "1/2 tablespoon toasted red-pepper flakes (from the bottom of the chile oil)", "Neutral oil, such as canola", "4 to 8 eggs", "1 cup plain Greek yogurt, at room temperature", "Flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chile oil (or skip to Step 4 if using store-bought chile oil): Add red-pepper flakes to a heatproof container that can balance a fine-mesh sieve and comfortably hold at least 1 cup oil. (A 12- or 16-ounce Mason jar works well.) Set aside. In a medium saucepan over medium heat, toast cinnamon stick, star anise, cardamom (if using), fennel seeds and peppercorns, gently shaking the pan, until fragrant, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add oil, garlic and ginger (if using), reduce the heat to low and allow the oil to come to a gentle simmer. Cook until the garlic is deeply golden brown and the ginger is tender, about 20 minutes. (The longer and more gently it cooks, the more flavorful the oil will be.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully pour hot oil through sieve directly onto the red-pepper flakes, which will sizzle and fry in the hot oil. Discard strained spices. (You should have a little more than 1 cup oil.) Allow mixture to cool at least 1 hour or, for the best flavor, make it the night before."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As chile oil simmers, prepare the seed mix: Heat oven to 425 degrees. On a rimmed sheet pan, lay out sesame seeds and pepitas in a single layer, transfer to the oven and toast until golden and fragrant, about 6 minutes. Let cool slightly, then mix in peanuts and garlic flakes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sautéed kale: In a large skillet over medium heat, warm oil until it shimmers. Add kale to the skillet, a couple of handfuls at a time, stirring to combine and adding more kale to the skillet as it wilts and space permits. (Kale will release liquid, but if you think it needs more oil, add it to the pan.) When the last batch has been added, season generously with salt. Add vinegar and about 1/2 tablespoon red-pepper flakes scooped from the chile oil, and stir to incorporate. You want some wilted bits and some crunchier drier bits. Set over low heat as you fry your eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the eggs: In another large nonstick skillet over medium-high, heat 1 tablespoon neutral oil. Working in batches, cook 1 to 2 eggs per person, adding oil as needed, until the yolk is a desired consistency, 2 to 3 minutes for sunny-side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Plate the dish: Dollop about 1/4 cup yogurt onto the center of each plate, spread it in a circle, leaving space around the edge of the plate for the seeded oil and a divot in the middle for the greens. Spoon 3 to 4 tablespoons chile oil around the edge of the yogurt, and sprinkle seed mix over the oil. Divide warm greens on top of yogurt, and top with eggs. Sprinkle with flaky sea salt and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021034-chile-oil-fried-eggs-with-greens-and-yogurt"}