{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Tart With a Touch of Lime", "description": "This is a classic French dessert — impressive, but easy to make, if you are organized and get ahead on the prep work. It’s essential to make the tart dough and lemon curd in advance, up to 2 days ahead; otherwise it becomes too much of a project. The buttery cookielike dough is pressed into the pan, not rolled with a pin.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/10/14/dining/09Tanisrex3-tart/merlin_178081638_4d4a8276-16a0-4673-a373-d6d803308f22-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts, dessert", "keywords": "birthday, butter, egg, flour, lemon, lime", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 246}, "recipeIngredient": ["1 cup plus 2 tablespoons/150 grams all-purpose flour", "2 tablespoons granulated sugar", "Pinch of fine sea salt", "1/2 cup/115 grams unsalted butter (1 stick), sliced thinly", "1 large egg, beaten in a measuring cup, with enough cold water added to make 1/4 cup liquid", "1 tablespoon grated lemon zest (from 2 lemons)", "1/2 tablespoon grated lime zest (from 1 lime), plus more for garnish", "3/4 cup/180 milliliters lemon juice (from 5 or 6 large lemons)", "1/4 cup/60 milliliters lime juice (from 2 or 3 large limes)", "3/4 cup/150 grams granulated sugar", "3/4 cup/170 grams unsalted butter (1 1/2 sticks)", "4 large eggs", "4 large egg yolks", "Confectioners’ sugar, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a food processor, pulse flour, sugar and salt. Add butter and pulse briefly until well combined. Add egg and pulse just until dough comes together. Dough will be rather soft. Wrap with waxed paper or plastic wrap, and press to make a 1-inch-thick disk. Refrigerate for at least 1 hour, or it will be too soft to handle. (Make the dough up to 2 days in advance, if desired.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove dough from the refrigerator and let soften at room temperature until pliable and soft, about 15 minutes. Using your fingertips, press dough into a 9-inch fluted tart pan with removable bottom, making sure it is pressed evenly across the bottom and up the sides, about 1/8-inch thick. Press the dough against the sides to the very top. Pinch off any excess and smooth the edge. You’ll have slightly too much dough — save any left over to patch cracks after blind baking. Chill the tart dough in the pan until ready to bake. (You can also freeze it at this point, if you like, for up to a week.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to blind bake, heat oven to 350 degrees. Place the dough-lined tart pan on a baking sheet, and bake to a pale golden brown, about 30 minutes. (Pie weights shouldn’t be necessary, but check the dough during baking, to make sure sides are not slumping. If so, press the sides back up with a wooden spoon.) For even browning, turn the tray halfway through the baking. Remove from oven, and cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Put lemon and lime zest, lemon juice, lime juice, sugar and butter in a heavy saucepan over medium heat. Cook until butter is melted and mixture is hot, 4 to 5 minutes. In a medium bowl, beat together eggs and yolks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the hot mixture gradually into the eggs to temper them. Then pour everything back into the saucepan and return to heat. Cook, whisking constantly, until mixture thickens to a milkshake consistency, about 5 minutes. (Do not overcook, or it will curdle.) Pour through a fine-meshed sieve into a bowl and allow to cool to room temperature, whisking occasionally. Mixture will continue to thicken as it cools. (At this point, you can continue with the recipe, or cover the filling and refrigerate for up to 2 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the lemon curd into the baked tart shell. Using a spatula, spread the curd evenly into the shell. Bake in a 350-degree oven until filling is set (not jiggly), about 10 minutes. Cool to room temperature. (This can be done several hours before serving.) Just before serving, top tart with lime zest and dust edges with confectioners’ sugar, if desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021505-lemon-tart-with-a-touch-of-lime"}