{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetarian Kofta Curry", "description": "Kofta curry — a saucy dish of gently spiced meatballs — is often made with meat. But this one, based on my grandfather’s, swaps in a mash of beans. Bound with bread crumbs and seasoned with ginger, garlic, green chile and herbs, it’s a variation full of flavor and texture. Have it with some flatbread and some sliced cucumber in yogurt, or spooned over a bowl of rice. It’s also delicious in a sandwich the next day. Note: To make it with lamb, as in his original version, substitute 1 1/2 pounds ground lamb for the beans. Soak the bread crumbs in 1/2 cup whole milk first, then squeeze out any extra liquid before adding them to the mixing bowl.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2020/09/13/magazine/13mag-eat/13mag-eat-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, beans, vegetables, main course", "keywords": "black beans, cilantro, ginger, mint, spring onions, tomato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1715}, "recipeIngredient": ["4 garlic cloves", "1 (2-inch) piece fresh ginger, peeled", "2 green chiles (such as jalapeño or serrano), stems removed", "1 (14-ounce) can black beans, rinsed and drained", "4 spring onions or scallions, trimmed and chopped", "1 bunch fresh cilantro, chopped, 1 tablespoon reserved for garnish", "1 bunch fresh mint, chopped, 1 tablespoon reserved for garnish", "1/2 cup bread crumbs", "1 egg", "1 teaspoon garam masala, plus more for garnish", "1/2 teaspoon red chile powder", "1 teaspoon sea salt, plus more as needed", "1/2 cup neutral oil, such as canola or grapeseed", "1 medium white onion, finely chopped", "8 to 10 ripe Roma tomatoes (about 3 pounds) or 1 (28-ounce) can crushed tomatoes", "1 teaspoon ground coriander", "1 teaspoon ground cumin", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the garlic, ginger and green chiles in a food processor, and pulse until you have a coarse paste. Put half the paste into a large bowl. Set the rest aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans, spring onions, fresh herbs, bread crumbs, egg, garam masala, chile powder and salt to the large bowl with the paste. Mix well with a fork, mashing up the beans as you go into small pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees and line a sheet pan with parchment paper. Shape the mixture into 1-inch balls and arrange on the pan. Drizzle with 2 tablespoons oil, and bake until lightly browned, about 25 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the remaining oil in a large skillet over medium. Sauté the onion until soft and translucent, about 5 minutes. Add the remaining garlic, ginger and chile paste, and sauté until light golden brown, about 10 minutes. If using fresh tomatoes, purée them until smooth in the food processor. Stir the tomato purée or crushed tomatoes, coriander and cumin into the skillet, and simmer for about 20 minutes, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the kofta to the skillet, and turn the heat to low. If necessary, add enough water for the liquid to come about two-thirds of the way up the sides of the meatballs, then simmer another 15 minutes, stirring occasionally, until the kofta are warmed through and the sauce has thickened. Season with salt and pepper, and garnish with a light dust of garam masala and some extra herbs."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021415-vegetarian-kofta-curry"}