{"@context": "http://schema.org", "@type": "Recipe", "name": "Malt Chocolate and Marshmallow Sandwiches", "description": "These cookies contain three distinct textures in each bite: a chocolate malt shortbread cookie, a soft marshmallow center, and a smooth dark chocolate ganache topping. They are sophisticated cookies, but the flavors are inspired by a favorite childhood treat: malted milk balls. The secret ingredient is malted chocolate drink powder such as in Ovaltine, Milo or Bournvita powder. The gold leaf or flaky sea salt topping is optional, but don’t hold back if you’re ready to dive into something that looks as exquisite as it tastes.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2020/12/08/dining/yk-malt-sandwich-cookies/merlin_180932466_22f6aec2-4c33-498d-9b35-57d9cb6d1bd1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "16 to 18 sandwiches", "recipeCuisine": "", "recipeCategory": "cookies and bars, dessert", "keywords": "christmas, valentine’s day, dark chocolate, gelatin, honey, malted-milk powder", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 636}, "recipeIngredient": ["2 cups/255 grams all-purpose flour, plus more for rolling the dough", "1/2 cup/45 grams malted chocolate powder, such as Ovaltine", "1/4 teaspoon baking powder", "3/4 cup/170 grams unsalted butter (1 ½ sticks), at room temperature", "1/2 cup/110 grams dark brown sugar", "1 tablespoon honey", "1/2 teaspoon kosher salt", "2 tablespoons heavy whipping cream", "4 ounces/115 grams 70 percent dark chocolate, chopped, or baking squares or pistoles", "1/2 cup plus 2 tablespoons/150 milliliters heavy whipping cream", "Edible gold leaf, luster dust or flaky sea salt (optional)", "1/2 cup/100 grams granulated sugar", "1/4 cup/60 milliliters honey", "1/4 teaspoon kosher salt", "1 1/2 teaspoons powdered gelatin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cookies: In a small bowl, whisk together the flour, malted chocolate powder and baking powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer, combine the butter, brown sugar, honey and salt. Mix with the paddle attachment on low speed until completely incorporated, scraping down the sides of the bowl as necessary. Add the flour mixture and heavy cream. Mix on low speed until it comes together in a smooth dough. Transfer to a work surface and pat into a 1-inch disk. Wrap with plastic wrap and refrigerate for at least 30 minutes. Wash and dry the mixing bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the ganache topping: Transfer the chocolate pieces to a small bowl. In a small pot, heat the cream gently over low heat until it just begins to steam, about 4 to 5 minutes. Pour the hot cream mixture over the chocolate pieces. Allow the chocolate and cream mixture to sit for 5 minutes. Stir until the chocolate is completely melted and the ganache is smooth. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position oven racks near the center and heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the dough is chilled, unwrap and place the dough in the center of a sheet of parchment. Place the second sheet of parchment on top and roll the dough to 1/4-inch thickness. Peel off the top layer of parchment and use it to line one of the baking sheets. Line a second baking sheet with parchment. Using a 2-inch round biscuit cutter, cut out cookies and transfer them to the lined baking sheets, spacing them about 1 ½ inches apart. Press scraps together, and fold the remaining parchment over the dough. Reroll and cut out rounds. (You can reroll the dough up to 2 times.) Bake until the cookies are set and the tops lose their shine, about 12 minutes, rotating the pans and switching racks halfway through baking. Let cool on the baking sheets for 5 to 10 minutes before moving the cookies to a wire rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the marshmallow filling: In a small pot, combine the sugar, honey, salt and 1/4 cup water. Stir to incorporate and cook over medium-high until the sugar dissolves and the temperature of the syrup reaches 240 degrees, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/4 cup water to the bowl of a stand mixer fitted with the whisk attachment. Sprinkle in the gelatin and gently stir to moisten the grains. Allow the gelatin to bloom, about 3 minutes, while the sugar mixture cooks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the sugar reaches 240 degrees and the gelatin has bloomed, turn the mixer on low, and slowly add the syrup in an even stream. Increase the speed to high and whip the mixture until the meringue is thick and doubled, about 5 to 7 minutes. Scoop the mixture into a piping bag, seal the top by twisting, snip the end and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the cookies: Pipe a 1-inch mound of meringue on the flat side of half the cookies, leaving a 1/8-inch border. Allow to set for 2 to 3 minutes, then top each with another cookie. Thoroughly stir the ganache until smooth. Spoon a tablespoon of ganache in the center of each top cookie and spread evenly over the surface, allowing the ganache to drip down the sides. (If your ganache is completely cooled and set at this point, you can stir and spread it like frosting, or see Tip below for loosening.) Once all the cookies have been topped with ganache, allow the ganache to set slightly, about 5 minutes, and top each with gold leaf accents or luster dust, if using. Allow the cookies to set before serving, about 15 minutes."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021713-malt-chocolate-and-marshmallow-sandwiches"}