{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Cider-Caramel Dumplings", "description": "This may not be the dish you think of when you see the words “apple dumplings,” but this delicious dessert couldn’t be simpler to make, or more comforting to eat. It starts with a basic dumpling batter. Just stir together the ingredients, then cook them in liquid on the stovetop until they become fluffy all the way through. Poaching the dumplings in a combination of apple cider, brown sugar and cinnamon means they take on a jammy exterior and absorb some of sweetness in the process. As the dumplings cook, they release some starch into the liquid, which thickens the poaching liquid into a sauce. It’s topped with a lightly whipped vanilla cream, which has a consistency similar to melted ice cream and coats each and every bite.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2020/11/19/dining/ejm-caramel-apple-dumplings/merlin_179656146_8459c180-5b2b-4712-992e-c6ae7e62e37c-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings (about 5 to 6 dumplings per person)", "recipeCuisine": "american", "recipeCategory": "custards and puddings, dumplings, dessert", "keywords": "apple, apple cider, brown sugar, heavy cream, fall, winter, thanksgiving, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 68}, "recipeIngredient": ["3 tablespoons heavy cream", "2 tablespoons unsalted butter", "1 cup/220 grams packed light or dark brown sugar", "4 cups/960 milliliters apple cider", "2 cinnamon sticks", "Pinch of kosher salt", "2 3/4 cups/350 grams all-purpose flour", "1/2 cup/110 grams light or dark brown sugar", "1 tablespoon baking powder", "1/2 teaspoon kosher salt", "1/4 teaspoon ground nutmeg", "1 cup/240 milliliters whole milk", "4 tablespoons/55 grams unsalted butter, melted", "1 large egg", "1 teaspoon vanilla extract", "1 1/2 cups/165 grams Honeycrisp or Granny Smith apples, peeled, cored and diced (from about 2 medium apples)", "1 cup/240 milliliters cold heavy cream", "1/3 cup/40 grams confectioners’ sugar", "1/2 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the apple cider-caramel sauce: In a medium pot, heat the cream and butter over medium until the butter is melted. Add the brown sugar and bring to a simmer over medium-low. Once simmering, cook, stirring constantly for 2 minutes. Add the apple cider and stir well to combine. (The sugar will seize, but just keep stirring and it will dissolve back into the liquid.) Add the cinnamon sticks and salt, and bring to a simmer over medium-low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the mixture comes to a simmer, make the dumplings: In a medium bowl, whisk together the flour, brown sugar, baking powder, salt and nutmeg. Make a well in the center and add the milk, melted butter, egg and vanilla. Whisk to combine, then switch to a spatula or wooden spoon as the mixture comes together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to a low simmer. Add a single layer of tablespoon-size scoops of batter to the pot (about 5 to 6 dumplings), cover the pot and set a timer for 8 minutes. (If desired, you can test one dumpling by cutting it in half to make sure it’s cooked through.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After each batch, use a slotted spoon to drain and transfer to a medium bowl. Cover the bowl with plastic wrap or foil to help keep the dumplings warm. Repeat with the remaining batter, poaching the dumplings in batches until all of the batter is used. (The poaching liquid will thicken slightly and decrease as you cook the dumplings, even with the pot covered.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once all the dumplings are fully cooked and removed from the pot, add the apples to the pot and simmer on low heat, uncovered, for 20 to 30 minutes, depending on how toothsome or soft you like your apples."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the apples cook, make the whipped cream: In a medium bowl, whisk the cream, confectioners’ sugar and vanilla until it thickens enough to coat a spoon, but is still fluid. Chill the whipped cream until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the warm dumplings among serving dishes. Spoon the sauce, apples and cream sauce over each portion and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021674-apple-cider-caramel-dumplings"}