{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffing Dumpling Soup", "description": "Smash it up with eggs and flour, and leftover stuffing transforms into a tender dumpling dough. A simple bone broth made from your turkey carcass creates a savory base, which you then load up with kale and sweet potatoes for a hearty, healthy post-Thanksgiving meal. If you prefer to roll your dumplings into visually perfect balls, leave out the 1/3 cup turkey stock for a sturdier dough, but if you don’t mind a rustic look, that additional moisture ensures a lighter dumpling.", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "image": "https://static01.nyt.com/images/2020/11/25/dining/23leftoversrex3/merlin_179865786_a2d9e2f3-2bc6-459e-be11-40d0b97dcc17-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, soups and stews, main course", "keywords": "egg, kale, onion, sweet potato, thanksgiving leftover, turkey, fall, winter, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 370}, "recipeIngredient": ["1 turkey carcass, picked clean (about 4 pounds)", "1 tablespoon apple cider vinegar, plus more to taste", "2 tablespoons unsalted butter", "2 medium sweet potatoes (about 1 pound), peeled and cut into bite-size cubes", "1 medium yellow or white onion (about 10 ounces), chopped", "Kosher salt", "1 pound kale (any type), stripped from stems and coarsely chopped (about 6 lightly packed cups)", "4 garlic cloves, smashed, peeled and chopped", "1/2 teaspoon red-pepper flakes, plus more to taste", "2 cups cubed leftover turkey", "2 1/2 cups leftover stuffing, slightly warmed", "2 large eggs", "1/2 cup all-purpose flour", "1/2 teaspoon baking powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the stock: Roughly chop the carcass so you don’t have any pieces bigger than your hands. (This is just so the pieces fit more compactly in the pot — don’t overthink it.) Place in a pressure cooker. Add the vinegar and cover with 2 1/2 quarts water. Bring to full pressure and cook for 1 1/2 hours. Allow the pressure cooker to cool down naturally, pluck out and discard the larger bones, then strain the stock through a fine-mesh sieve, discarding solids. You should have 9 to 10 cups of stock. (You can also prepare the stock on the stovetop in a large pot, simmering for 3 1/2 to 4 hours, and topping off with water as needed.) Leftover stock can be kept in the refrigerator for 3 days or frozen for up to 3 months."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the soup: In a large Dutch oven or heavy pot over medium-high heat, melt the butter until foamy. Add the sweet potatoes, onion and a big pinch of kosher salt. Cover and cook, stirring occasionally, until the onion is tender and translucent, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the kale, garlic and red-pepper flakes, and season with a big pinch of kosher salt. Cover the pot and cook until the greens are wilted, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 quarts of the prepared turkey stock and season with kosher salt to taste. Increase the heat to bring the soup to a boil, then reduce to an active simmer and cook, partly covered, until the greens and sweet potatoes are tender, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the soup simmers, prepare the dumplings: In a medium bowl, combine the stuffing and 1/3 cup of the turkey stock, and mash with a potato masher until the stuffing is broken up. Add the eggs, flour, baking powder and a big pinch of kosher salt, and mix until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the soup and adjust the seasoning to taste with more salt, red-pepper flakes and vinegar, if needed. Stir in the turkey."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using two big spoons, plop the stuffing mixture into the soup like big drop biscuits. Cover the pot, reduce heat to low, and gently simmer until dumplings feel set and firm, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide soup across bowls. (If storing leftovers, scoop the dumplings out of the soup and store separately to prevent them from soaking up all the broth as they sit. Dumplings and soup will keep refrigerated for up to 2 days.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021607-stuffing-dumpling-soup"}