{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Shortbread and Cream", "description": "In this summery dessert, golden-edged cookies are paired with syrupy strawberries and fluffy whipped cream for a result that’s a bit like strawberry shortcake, but crunchier and a lot more buttery. These cookies have a little more sugar than most shortbread recipes, so they’re especially crisp, but since they are on the sweet side, use a light hand when adding sugar to the berries. You just need enough to get the juices flowing. A few pinches should do it. And if you use cultured butter, the cookies will be even richer.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/06/10/dining/05apperex/05apperex-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings, plus extra shortbread", "recipeCuisine": "", "recipeCategory": "cookies and bars, parfaits and trifles, dessert", "keywords": "birthday, fourth of july, memorial day, heavy cream, strawberries, vanilla, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 484}, "recipeIngredient": ["1 cup/225 grams unsalted butter (2 sticks), preferably cultured (European-style), at room temperature", "3/4 cup/150 grams granulated sugar", "1 egg yolk", "1/2 teaspoon fine sea salt", "1 vanilla bean, split lengthwise and seeded with the tip of a knife, or 1 tablespoon vanilla extract", "1/2 teaspoon orange blossom water or grated orange zest (optional)", "2 cups/255 grams all-purpose flour", "1 pint strawberries, sliced", "Granulated sugar, to taste", "1 cup/240 milliliters heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric stand mixer fitted with the paddle attachment, or an electric hand mixer, cream butter and sugar until light and fluffy, about 2 minutes. Beat in egg yolk, salt, vanilla seeds and orange blossom water, if using. Beat in flour until smooth, scraping the sides of the bowl with a rubber spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the dough onto a 12-inch-long piece of plastic wrap and form it into a log, 1 1/2 inches in diameter. It will be very sticky, so use the plastic wrap to help form the log (or make two shorter logs if that’s easier). Then wrap it up and chill until it’s thoroughly cold, at least 3 hours (and up to 5 days)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, heat oven to 350 degrees and line two baking sheets with parchment paper or nonstick liners."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unwrap the dough log and slice it into 1/4-inch-thick rounds. Arrange them on the prepared baking sheets and bake until the cookies are golden at the edges, 10 to 15 minutes. Transfer baking sheets to a wire rack to cool completely. Cookies can be bake up to 4 days ahead and stored in an airtight container at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, sprinkle strawberries with a little sugar and let them sit for 15 minutes to release their juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer fitted with the whisk, or a whisk and elbow grease, whip the cream, adding a teaspoon or two of sugar, if you like. Note that the cookies are very sweet so you may not want to add any sugar at all."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the strawberries into serving bowls and top with whipped cream. Drizzle cream with juices from the strawberry bowl. Tuck a cookie or two in each bowl and serve with spoons."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021137-strawberry-shortbread-and-cream"}