{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Sweet Potato and Cheddar Croquettes", "description": "Sweet potatoes and cheese are flavored with cumin, smoked paprika, black pepper and cayenne for warmth, smokiness and a little bit of a kick. Once these croquettes are breaded and deep fried, a crisp crust delicately encapsulates the soft and gooey mixture within. They are very straightforward to prepare, but the process makes them a labor of love, perfect for entertaining or simply showing off your kitchen prowess.", "author": {"@type": "Person", "name": "Aaron Hutcherson"}, "image": "https://static01.nyt.com/images/2020/10/08/dining/ah-sweet-potato-croquettes/ah-sweet-potato-croquettes-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "About 30 croquettes", "recipeCuisine": "american", "recipeCategory": "snack, finger foods, vegetables, appetizer", "keywords": "bread crumbs, cheddar, flour, sweet potato, fall, kwanzaa", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 474}, "recipeIngredient": ["2 pounds sweet potatoes (about 4 medium), peeled and cut into 1-inch chunks", "2 teaspoons kosher salt", "4 ounces sharp Cheddar, shredded (about 1 packed cup)", "1/2 cup/65 grams all-purpose flour", "1 teaspoon ground cumin", "1 teaspoon smoked paprika", "1/2 teaspoon black pepper", "1/4 teaspoon ground cayenne", "1 cup/130 grams all-purpose flour", "3 whole eggs, beaten with 2 tablespoons vegetable oil", "1 1/4 cups/125 grams plain fine bread crumbs", "About 4 cups vegetable, canola, peanut or other neutral oil, for stovetop shallow frying", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the sweet potatoes and 1 teaspoon salt in a pot and cover with an inch or two of water. Bring to a boil, reduce to a simmer and cook until tender, 10 to 12 minutes. Drain the potatoes, transfer to a bowl, mash with a fork, and let cool for at least 30 minutes. (You can also do this step ahead and let the mashed sweet potatoes cool in the refrigerator overnight.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cheese, flour, cumin, paprika, black pepper and cayenne to the mashed sweet potatoes and mix until evenly combined. Use a medium cookie scoop (a scant 2 tablespoons) to portion the mixture onto a baking sheet lined with parchment. Freeze until solid, at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare to bread the croquettes: Set up a standard breading procedure in three bowls — flour, egg-and-oil mixture and bread crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip each piece in the flour, shaking off any excess, in the egg mixture (turning it a few times to make sure it is completely coated), then in the bread crumbs. Set each breaded croquette on the baking sheet. Refreeze the finished, breaded croquettes until firm. (These can live in your freezer for months.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add enough neutral oil to a deep-sided pot or pan to reach a depth of 1 1/2 to 2 inches, and heat over medium until shimmering, or when a thermometer reads between 325 and 350 degrees. Working in batches, fry the frozen croquettes, stirring occasionally, until nicely browned all over and piping hot in the center, about 5 minutes. (When frying, it’s important to moderate the heat to keep as steady a temperature as possible. Adding frozen products to hot oil brings the temperature down, as does crowding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, remove cooked croquettes to a baking rack and immediately sprinkle with a little salt before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021474-spicy-sweet-potato-and-cheddar-croquettes"}