{"@context": "http://schema.org", "@type": "Recipe", "name": "Korean Braised Spare Ribs With Soy and Black Pepper", "description": "These St. Louis-style spareribs are braised until tender and lacquered in a savory Korean soy sauce glaze that’s spiked with fragrant garlic, ginger, scallions and lots of black pepper. There’s no marinating required and little hands-on work, but you will need to make sure the tough membrane on the back of each rack has been removed before cooking. (That task is easy: Set the ribs meat side down and find the thin, translucent skin that sits over the bones. Gently pull it up at one corner, inserting a sharp knife to loosen it at one end if necessary, then peel the membrane off in one piece.) The potatoes and carrots sit underneath the ribs and soak up the meaty drippings. The pork and vegetables all release flavorful juices as they roast, resulting in a rich, assertive pan sauce. A quick broil at the end achieves golden, crispy edges.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2020/12/14/dining/kc-korean-short-ribs/merlin_180213510_80c5e583-9a1d-49b3-8f97-01b0d1c0c18e-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "korean", "recipeCategory": "dinner, meat, vegetables, main course", "keywords": "carrot, garlic, ginger, kimchi, potato, ribs, scallion, soy sauce, spare ribs", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 239}, "recipeIngredient": ["1/2 cup low-sodium soy sauce", "1/2 cup finely chopped scallions (from about 4 scallions), plus more for garnish", "1/4 cup minced garlic", "1/4 cup minced fresh ginger (from one 4-inch piece)", "2 tablespoons safflower or canola oil", "2 tablespoons turbinado or brown sugar", "Kosher salt and black pepper", "2 (3-pound) St. Louis-style sparerib racks, each halved crosswise into 2 equal pieces", "2 small yellow onions, thinly sliced into 1/8-inch-thick rounds (about 2 cups)", "1 1/2 pounds Russet potatoes, peeled and sliced crosswise 1-inch-thick", "1 1/2 pounds carrots, peeled and halved lengthwise", "Any combination of kimchi, pickles or cooked rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. In a small bowl, combine soy sauce, scallions, garlic, ginger, oil, sugar, 2 teaspoons salt and 2 teaspoons pepper and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide ribs and onions between 2 large rimmed baking sheets and season with salt and pepper. Divide the sauce between the 2 baking sheets and toss to coat the onions and ribs, rubbing the sauce into the ribs. Spread onions in an even layer on the bottom and top with ribs, meat side-up. Add 1/2 cup water to each baking sheet and cover tightly with aluminum foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast for 1 hour, then transfer ribs to a cutting board or platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season potatoes and carrots with salt and pepper and divide between the 2 baking sheets. Toss with onions and pan juices until coated. Place the ribs back on top of vegetables, meat-side up, and baste with the pan juices. Cover tightly and roast until vegetables and ribs are tender, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer ribs to a cutting board or platter. Transfer vegetables to a serving platter. Pour pan sauce into a bowl for serving, skimming off any excess oil. Return all of the ribs to one baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat broiler and set an oven rack 5 to 6 inches from the heat. Baste ribs with some of the reserved pan sauce and broil, meat side-up, until golden and caramelized, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide ribs among plates. Drizzle with some of the sauce and garnish with more scallions. Serve with the roasted vegetables, and any combination of kimchi, pickles or rice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021477-korean-braised-spare-ribs-with-soy-and-black-pepper"}