{"@context": "http://schema.org", "@type": "Recipe", "name": "Polenta Lasagna With Spinach and Herby Ricotta", "description": "With a dense, creamy texture and sweet corn flavor, this hearty and unexpected variation on the usual lasagna uses layers of Parmesan-topped baked polenta in place of pasta. This meatless recipe is speckled green with baby spinach and lots of parsley and basil. Be sure to get a good brand of marinara sauce, preferably a chunky one with bits of tomato, for the richest flavor and texture. Or even better, if you have <a href=\"https://cooking.nytimes.com/recipes/1015987-classic-marinara-sauce\">homemade marinara sauce</a> tucked away in the freezer, use it here instead.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/01/27/dining/22Apperex/merlin_182444001_d76082a7-8017-419c-a800-62dc382e14fa-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner, casseroles, main course", "keywords": "baby spinach, marinara sauce, mozzarella, parmesan, polenta, ricotta, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1528}, "recipeIngredient": ["4 tablespoons unsalted butter, plus more for greasing the pan", "1 tablespoon plus 1/2 teaspoon kosher salt", "2 cups polenta (not instant)", "5 ounces baby spinach (about 5 cups)", "2 cups grated Parmesan", "1 pound whole-milk ricotta (about 1 2/3 cups), preferably fresh", "3 tablespoons finely chopped parsley", "2 tablespoons finely chopped fresh basil (or use more parsley)", "1 large egg", "1/2 teaspoon black pepper", "1/8 teaspoon grated fresh nutmeg", "1 (25-ounce) jar good-quality marinara sauce (3 cups)", "Large pinch of red-pepper flakes, 1 pinch of dried oregano, 1 grated garlic clove or a drizzle of good extra-virgin olive oil, or a combination (optional)", "1 pound shredded mozzarella (about 4 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees and butter an 13-by-18-inch rimmed baking sheet pan. Grease a rubber spatula with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the polenta: In a large pot, bring 6 cups water and 1 tablespoon salt to a boil over high heat. Reduce heat to medium, then slowly pour in polenta, whisking constantly. Cook, whisking often, until polenta thickens, 8 to 12 minutes. Whisk in 4 tablespoons butter until melted. Whisk in spinach until wilted, about 2 minutes. Remove from heat and mix in 1 cup grated Parmesan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape polenta onto the prepared baking sheet. Using the greased rubber spatula, spread the mixture into a thin, even layer to cover the entire pan, all the way to corners. Sprinkle 1/2 cup grated Parmesan on top. Bake until polenta is firm and cheese has melted, 12 to 18 minutes. Let cool in the pan on a wire rack until completely cooled, about 1 to 1 1/2 hours, or place in refrigerator until cool to touch, about 40 to 50 minutes. (Polenta can be baked the day before and refrigerated until needed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake the lasagna, heat oven to 400 degrees. Butter a 9-by-13-inch baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the ricotta filling: In a small bowl, mix ricotta, parsley, basil, egg, black pepper, nutmeg and the remaining 1/2 teaspoon salt. Mix until well combined and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the marinara sauce. If it needs some zip, stir in any or all of the optional ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the lasagna: Using a knife or pizza cutter, cut cooled polenta in half widthwise, creating 2 pieces roughly 9 by 13 inches each. Using a large spatula, gently place one half in prepared baking dish. (It is important for polenta to be completely cooled and firm; otherwise, the pieces may break when transferring to baking dish. If anything breaks, just reassemble it in the pan. It won’t make much of a difference once it’s covered in sauce and baked.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread about half the ricotta mixture in an even layer on top of polenta. Pour about half of marinara sauce on top of ricotta, sprinkle with about half of the shredded mozzarella. Repeat with remaining polenta, ricotta, marinara and mozzarella. Once assembled, sprinkle the remaining 1/2 cup Parmesan on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place baking dish on top of a rimmed sheet pan in case the lasagna bubbles over. Bake until cheese melts, about 30 minutes. If you like, you can broil lasagna for 2 minutes after baking until cheese starts to bubble and develop brown spots."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and let lasagna stand for about 15 minutes to firm up before serving. Leftovers can be refrigerated for up to 1 week or frozen for up to 3 months."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021809-polenta-lasagna-with-spinach-and-herby-ricotta"}