{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate-Peppermint Shortbread", "description": "In this vibrant holiday dessert, cocoa shortbread is pressed into an even layer, baked, then topped with swoops of peppermint meringue (optionally swirled with red food coloring). Back into a low oven it goes for about 2 hours, until the meringue becomes crisp and chewy. Once cooled, it's cut into rough, jagged pieces. If you don’t have a stand mixer, the shortbread and meringue can be made with a hand mixer or entirely by hand. The mixing times will be significantly longer, so follow the visual cues instead. (<a href=\"https://www.youtube.com/watch?v=ZYTogw5yGkw&amp%3Bt=417s\">Watch Sohla make her Chocolate-Peppermint Shortbread here</a>.)", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "image": "https://static01.nyt.com/images/2020/12/08/dining/sew-peppermint-cookies/merlin_180932835_baa26b7f-4f70-4999-9abf-91abf8f450f5-mediumThreeByTwo440.jpg", "totalTime": "PT4H", "recipeYield": "One 8-by-8-inch pan", "recipeCuisine": "", "recipeCategory": "cookies and bars, dessert", "keywords": "christmas, christmas cookie, cocoa powder, peppermint extract", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 821}, "recipeIngredient": ["1/2 cup/115 grams unsalted butter (1 stick), at room temperature, plus more for greasing the pan", "1/3 cup/75 grams light brown sugar", "3/4 teaspoon kosher salt", "1 egg yolk", "1 teaspoon vanilla extract", "1 cup/130 grams all-purpose flour", "1/3 cup/30 grams Dutch-processed cocoa powder", "2 large egg whites", "Pinch of kosher salt", "6 tablespoons/85 grams granulated sugar", "1/2 teaspoon peppermint extract", "Red food coloring (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease an 8-by-8-inch brownie pan with butter and line the bottom and two sides with parchment. Set a rack in the lower-middle position of the oven and heat to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with a paddle attachment and set on medium-high speed, beat the butter, brown sugar and salt until creamy, about 1 minute. Stop the mixer and scrape down the bowl and paddle with a rubber spatula. Add the yolk and vanilla, and mix until well combined, about 1 minute. Add the flour and cocoa, and mix until everything comes together, about 1 minute, stopping once during mixing to scrape down the paddle and the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the dough into the prepared pan. Using an offset spatula and your hands, press the dough into the pan as evenly as possible. Use a fork to prick the dough all over. Bake until the shortbread smells chocolatey and feels set and dry, 30 to 35 minutes. Wash and dry the mixing bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove shortbread from oven and cool in the pan for 10 minutes. Reduce oven temperature to 225 degrees. Using the parchment, lift the cookies out of the pan onto a wire rack set in a rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meringue: Pour water into a medium saucepan to come 1 1/2 inches up the sides and bring to a bare simmer over medium-low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the egg whites, salt and sugar in the bowl of a stand mixer just to combine. Set the bowl over the simmering water (bowl should not touch water) and heat the egg mixture, stirring and scraping constantly with a heatproof rubber spatula, until the sugar dissolves, the mixture is hot and steamy, and the temperature registers 175 degrees on an instant-read thermometer, about 4 to 6 minutes. (Be patient and cook the egg whites slowly so they don't curdle.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the bowl to the stand mixer, and whip the mixture until stiff and glossy, 5 to 7 minutes. Whip in the peppermint extract and scrape the meringue onto the shortbread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Evenly spread the meringue with an offset spatula or the back of a spoon. If using liquid food coloring, add a few random drops onto the meringue. If using gel food coloring, use the tip of a toothpick to randomly dab the tiniest bit of food coloring onto the meringue. Using the tip of an offset spatula or spoon, swirl the color into the meringue, creating peaks and streaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake on the wire rack set on the sheet pan until the meringue feels dry and crisp, about 2 hours. Turn off the oven and prop open the door with a wooden spoon. Allow the cookies to cool in the oven, about another hour. Remove from oven and transfer to a cutting board. Cut the cookies into random pieces. The cookies will keep for 1 week stored in an airtight container at room temperature."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Chocolate-Peppermint Shortbread", "description": "In this vibrant holiday dessert, cocoa shortbread is pressed into an even layer, baked, then topped with swoops of peppermint meringue (optionally swirled with red food coloring). Back into a low oven it goes for about 2 hours, until the meringue becomes crisp and chewy. Once cooled, it’s cut into rough, jagged pieces. If you don’t have a stand mixer, the shortbread and meringue can be made with a hand mixer or entirely by hand. The mixing times will be significantly longer, so follow the visual cues instead.", "thumbnailUrl": "https://static01.nyt.com/images/2020/12/08/dining/sew-peppermint-cookies/merlin_180932835_baa26b7f-4f70-4999-9abf-91abf8f450f5-mediumThreeByTwo440.jpg", "uploadDate": "2023-01-09T16:00:46.000Z", "duration": "PT9M36S", "transcript": "", "contentUrl": "https://vp.nyt.com/video/2023/01/06/105321_1_SE-Peppermint-shortbread-CV_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021710-chocolate-peppermint-shortbread"}