{"@context": "http://schema.org", "@type": "Recipe", "name": "Carne con Chile Rojo (Chuck Braised in Chile)", "description": "Claudia Serrato’s work studying the history of indigenous Mexican foodways informs her annual holiday tamaladas, where family and friends in her community gather to fill tamales with cacao, vegetables, flowers or bison braised in red chile. The meat is first braised until very tender, then dressed in a purée of smoky chiles and garlic, before it’s stuffed into fresh masa. Ms. Serrato makes her own nixtamal with blue corn, soaking it with cal and grinding it in her outdoor kitchen, though you can buy fresh masa or hydrate freshly ground nixtamal if you prefer.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2020/12/23/dining/22Tamalesrex3-shredded/merlin_181220943_1aea8bc8-9a8d-4eaf-a1d3-cfdfcd945fc4-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "Serves 4 to 6 (about 4 cups)", "recipeCuisine": "", "recipeCategory": "", "keywords": "bison, California chiles, chiles de árbol, guajillo chiles, maple sugar, sage", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 160}, "recipeIngredient": ["2 tablespoons maple or raw sugar", "1 tablespoon coarse sea salt", "2 pounds boneless bison or beef chuck roast", "1/4 cup olive oil", "4 cups vegetable broth", "2 ripe tomatoes", "1/2 medium white onion", "10 dried California or New Mexico chiles (2 1/2 ounces)", "2 fresh sage sprigs", "2 fresh or dried bay leaves", "1/2 cup pure maple syrup", "10 dried guajillo chiles, stemmed", "4 dried chiles de árbol, stemmed", "2 garlic cloves, peeled", "1/4 medium white onion", "1 teaspoon coarse sea salt, plus more to taste", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the bison: Heat oven to 275 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the sugar and salt all over the roast. Heat the oil in a large Dutch oven over high heat. Add the roast and sear until dark brown on all sides, 7 to 10 minutes. Transfer to a plate and reduce the heat to medium. Carefully add 1 cup broth (the hot fat will spatter) and scrape up all the browned bits from the pan. Return the roast and any accumulated juices to the Dutch oven and add the tomatoes, onion, chiles, sage, bay leaves, syrup and remaining 3 cups broth. Bring to a boil, then cover and transfer to the center of the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Braise until the meat is very tender, about 3 1/2 hours. A fork should slide through easily. Uncover and cool for 15 minutes, then transfer the roast to a large bowl. Finely shred the meat using your hands if cool enough to handle or with two forks. Strain the cooking liquid and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the chile rojo: Bring a medium saucepan of water to a boil. Add all of the dried chiles, reduce the heat to medium, and simmer steadily until softened and lighter in color, about 10 minutes. Transfer the chiles to a blender, along with the garlic, onion, salt and 2 cups of the braising liquid. Save any remaining braising liquid for another use (see Tip). Blend until very smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, deep skillet over high heat until shimmering. Carefully add the chile sauce (it will splatter) and immediately reduce the heat to medium. Simmer, stirring often, until thickened and brick red, 8 to 10 minutes. Add the shredded meat and any accumulated juices and stir to evenly coat. Reduce the heat to low and simmer for 10 minutes. Season to taste with salt. Serve immediately or cool to room temperature to use as a filling for tamales. The sauced braised meat can be refrigerated for up to 5 days or frozen for up to 3 months."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021732-carne-con-chile-rojo-chuck-braised-in-chile"}