{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Corn, Asparagus and Spring Onion Salad", "description": "In this cookout perfect salad, corn, asparagus and spring onions benefit from the deep flavors of the grill. Their outer layers get a rustic char, their full sweetness is released, and they go from raw to cooked while maintaining a crunchy bite. Still warm, they’re doused in one of Mexico’s most fun ways to dress grilled vegetables or potato chips, an easy-to-eat sauce where umami, citrus and heat converge. The mixture is typically referred to as salsa preparada, meaning you simply mix these sauces together to “prepare” your food. You may wonder if the soy, Worcestershire and Maggi sauces compete, but each has a different character of sazón, which is whisked with plenty of fresh squeezed lime juice and a punch of chile oil. If more heat is desired, you can add a splash of your favorite hot sauce. This salad is great solo as an appetizer, but it is even better served right next to grilled meats.", "author": {"@type": "Person", "name": "Pati Jinich"}, "image": "https://static01.nyt.com/images/2020/08/12/dining/10carneasadarex4-cornsalad/merlin_175267191_6580b6b3-e407-4d88-87b0-d0954969c655-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 to 8 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, easy, lunch, salads and dressings, vegetables, appetizer, side dish", "keywords": "asparagus, cherry tomatoes, corn, lime, scallion, soy sauce, spring onions, worcestershire sauce, nut-free, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 278}, "recipeIngredient": ["5 ears fresh corn (preferably white corn), shucked and cleaned", "1 bunch asparagus (about 8 ounces), woody ends removed, stalks peeled up to flower bud", "1 bunch spring onions or 2 bunches large scallions (about 8 ounces total), trimmed", "Vegetable oil", "1/4 cup fresh squeezed lime juice (from about 2 limes)", "3 tablespoons soy sauce", "2 tablespoons Worcestershire sauce", "1 tablespoon Maggi sauce", "1 tablespoon chile oil or hot sauce", "1/2 teaspoon kosher or sea salt, plus more to taste", "1 cup cherry tomatoes, halved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat grill to high. Lightly brush corn, asparagus and spring onions with vegetable oil. Place them on the grill and spread them out in one layer so they can cook evenly. Flip the vegetables a couple of times until they are charred on all sides but retain a firm bite; asparagus and spring onions should cook for about 6 to 8 minutes, depending on thickness, and corn about 12 to 15 minutes. Remove them from the grill as they are ready, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the vegetables grill, combine lime juice, soy sauce, Worcestershire, Maggi, chile oil and salt in a large bowl. Whisk until fully combined. Taste and adjust salt as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once vegetables have cooled enough to handle, cut asparagus and spring onions into thirds and add them to the bowl. Shave the kernels from the corn, discarding the cobs, and add kernels to the bowl. Toss to combine with the sauce. Add the halved tomatoes and combine well. Serve warm or at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021292-grilled-corn-asparagus-and-spring-onion-salad"}