{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Roasted Duck With Wild Mushrooms", "description": "Magret is the term used for the large breasts of a Muscovy duck, found at many butcher shops and supermarkets or easily purchased online. Each breast weighs about 12 ounces, enough for 2 portions.They are best served rare or medium-rare, like a beef steak. If using smaller duck breasts, reduce the cooking time accordingly. The deeply flavored sauce is made from dried wild mushrooms and a mixture of cultivated mushrooms sautéed with garlic and parsley finishes the dish. If wild chanterelles or porcini are available, by all means, add them to the mixture, too. Mashed squash or sweet potato would make a nice accompaniment.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/10/14/dining/09tanisrex2-duck2/merlin_178081509_5c177dd3-b55e-4f0a-bd61-29a45c6d9134-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "poultry, main course", "keywords": "duck, mushroom, wine, fall, new year’s day, valentine’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 254}, "recipeIngredient": ["1/4 cup crumbled or chopped dried wild mushrooms, such as porcini or morels (about 1 ounce)", "3 (12-ounce) boneless, skin-on Muscovy duck breasts", "Kosher salt and black pepper", "1 teaspoon extra-virgin olive oil", "2 tablespoons unsalted butter", "2 tablespoons all-purpose flour", "1/2 cup dry red wine", "1 large thyme sprig", "1 bay leaf", "1 pound sliced cultivated mushrooms, such as king trumpet, oyster or shiitake", "2 to 3 small garlic cloves, minced", "3 tablespoons roughly chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse dried mushrooms to remove sand or dirt and place in a bowl. Cover with boiling water and let steep for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay duck breasts skin-side down on a cutting board. With your fingers, remove the thin tenderloins from the underside of each breast and reserve for sauce. With a sharp knife, trim away any gristle. Turn breasts skin-side up and trim excess fat from the edges. Score the skins in a diamond pattern. Season generously with salt and pepper, transfer to a plate and leave at cool room temperature for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put olive oil in a heavy saucepan over medium-high heat. When hot, add the reserved tenderloins and brown well on both sides. Add butter and flour to pan, and cook, stirring, until mixture is lightly browned, 2 to 3 minutes. Add soaked mushrooms and soaking liquid, and stir well as sauce begins to thicken. Add wine, thyme and bay leaf, turn heat to low, and simmer gently until gravylike, but not too thick, 15 to 20 minutes. Remove and discard tenderloins, thyme and bay leaf. Taste sauce and adjust seasoning. Keep warm. (Sauce may be prepared several hours or up to 2 days in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large cast-iron skillet over medium-high heat. When pan is hot, add duck breasts to skillet skin-side down and let sizzle. Lower heat to medium and cook for about 7 or 8 minutes, making sure skin doesn’t brown too quickly. (This will render fat and crisp the skin.) Turn breasts over and cook 3 minutes more for rare (thermometer should read 120 degrees), or 4 to 5 minutes for medium-rare (thermometer should read 125 degrees). Transfer to a warm platter and let rest for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off all but 2 tablespoons rendered fat from the pan, and raise heat to medium-high. Add sliced mushrooms and sauté, stirring occasionally, for about 5 minutes, letting them brown nicely. Season with salt and pepper. Turn off heat and stir in garlic and parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice duck 1/4-inch thick, crosswise at a slight angle, and serve immediately. Each serving should have 4 to 5 slices of duck, a large spoonful of mushrooms and a bit of sauce."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021504-pan-roasted-duck-with-wild-mushrooms"}