{"@context": "http://schema.org", "@type": "Recipe", "name": "Honey-Cured, Hickory-Smoked Shoulder Ham", "description": "A true ham, weighing 15 to 20 pounds, comes from a hog’s hindquarters. It’s a formidable piece of meat, requiring several weeks of curing and 24 hours or more of smoking. A shoulder ham (sometimes called picnic ham) has a similarly magisterial appearance and profound umami flavors, but in a size that will fit in your refrigerator and can be cured and smoked inside a week. When possible, buy a heritage pork breed, like Berkshire or Duroc, preferably from a local farmer or butcher.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2021/03/24/dining/18Hamrex1/merlin_185058081_ea7c7a51-34ef-4cc4-8773-d9e41327b1db-articleLarge.jpg", "totalTime": "P6DT7H", "recipeYield": "12 appetizer servings or 6 to 8 entrées", "recipeCuisine": "american", "recipeCategory": "brunch, dinner, lunch, meat, project, main course", "keywords": "brown sugar, cloves, ham, honey, pork, easter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 64}, "recipeIngredient": ["2 cups kosher salt (preferably Morton)", "1 1/2 cups honey", "1 packed cup dark brown sugar", "2 tablespoons Prague powder #1", "6 cloves", "6 allspice berries", "3 fresh or dried bay leaves", "3 fresh lemon zest strips", "1 tablespoon whole black peppercorns", "1 fresh skin-on, bone-in (9- to 10-pound) shoulder ham (sometimes called picnic ham)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the brine: In a large pot, place 2 1/2 quarts water, the salt, honey, brown sugar and Prague powder. Bring to a boil over high, stirring until the salt, honey and sugar are dissolved."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the spice bundle: Tie the cloves, allspice berries, bay leaves, lemon zest and peppercorns in a piece of cheesecloth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the spice bundle and another 2 1/2 quarts ice water into the brine, remove from heat and let the mixture cool to room temperature (about 30 minutes)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the brine cools, prepare the ham: Using paper towels, blot the pork shoulder dry on all sides. Using a sharp knife, score the ham in a crosshatch pattern, cutting through the skin but not through the meat and spacing the cuts 1 1/2 inches apart. (This is optional, as you’ll remove the skin, but it facilitates injecting and gives the ham a striking appearance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Measure out 2 cups brine and place in a deep measuring cup. Place the ham in a roasting pan. Draw the brine into a marinade injector and inject it deep into the ham all over, inserting the needle at 1 1/2-inch intervals and drawing it out slowly as you depress the plunger, until the brine starts to squirt out of the surface of the ham."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the ham in a large pot or food-safe bucket with a lid, or 3-gallon resealable plastic bag. Add the brine and flavorings (plus any brine in the roasting pan). If using a plastic bag, tightly seal, squeezing out any air, and place the bag in the roasting pan to corral any leaks. Brine the ham in the refrigerator for 3 days, turning the ham twice a day so it cures evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the brine into a large pot and set aside. Remove the ham from its pot or bag and transfer it to a roasting pan. Using the marinade injector, re-inject the ham with brine (using 2 cups again, or more, if you can get more in), inserting the needle at 1 1/2-inch intervals. Return the ham and all the brine to the bag. (You can use a fresh bag, if you wish.) Continue brining the ham in the refrigerator for another 3 days, turning twice a day so it brines evenly. When ready for smoking, the meat will take on a pinkish hue."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the ham in a large colander, discarding the brine. Rinse the ham well with cold water, drain again and blot dry with paper towels. Place it on a wire rack over a roasting pan and let it dry for 2 to 3 hours in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a charcoal grill, set it up for indirect grilling and heat it to 250 degrees. If using wood chips, soak them in water to cover for 30 minutes, then drain. If using wood chunks, there is no need to soak them. (With a kettle grill, use less charcoal than normal to obtain this low temperature.) If using a smoker, heat it to 250 degrees following the manufacturer’s instructions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the ham on the grate, fat-side up, using indirect heat, and add 1 1/2 cups wood chips or 2 wood chunks to the coals. Smoke the ham until handsomely browned and cooked through. (The internal temperature will be about 160 degrees.) This typically takes about 7 hours, but you may need more or less time, depending on your ham, smoker and the weather. Add wood chips (about 1 1/2 cups) or chunks (1 large or 2 medium) per hour to the embers to maintain a constant flow of smoke. Rotate your ham a few times during cooking so that it browns evenly, and drape it loosely with foil if it seems to be darkening too much."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the ham to a cutting board and let it cool for 20 minutes. Pull off the skin. (If you’re feeling ambitious, you can fry the skin in 350-degree oil to make smoke-flavored cracklings.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice the ham across the grain and serve. You can serve the ham hot, at room temperature, or chilled. Refrigerated, it will keep for at least a week."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021994-honey-cured-hickory-smoked-shoulder-ham"}