{"@context": "http://schema.org", "@type": "Recipe", "name": "Hot and Numbing Stir-Fried New Potatoes", "description": "These stir-fried potatoes are inspired by a modern street snack served in Xi’an, China. They can be parboiled in advance, require only a few minutes of stir-frying in a wok before serving, and can be flavored with a wide range of spices and aromatics, making them an ideal side dish for any menu, simple or complex. In addition to the Xi’an-style original with hot and numbing spices, you can also make a curry-spiced version with crunchy, fried cumin and mustard seeds, or a rosemary and garlic version that would be at home on a traditional Thanksgiving table (see Tips).", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2020/11/11/dining/09Kenjirex/merlin_179619633_8c486243-1001-4dbc-a03c-d7929f7de8ab-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "vegetables, side dish", "keywords": "cumin, fennel seeds, potato, sichuan peppercorns, white peppercorns, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 532}, "recipeIngredient": ["2 pounds small yellow new potatoes, scrubbed and rinsed", "Kosher salt", "2 teaspoons red Sichuan peppercorns", "1 star anise pod", "1 teaspoon fennel seeds", "1 teaspoon white peppercorns or 1/2 teaspoon ground white pepper", "2 teaspoons cumin seeds", "2 whole dried hot chiles (such as chile de arból or Japonais) or 1 tablespoon red-pepper flakes", "1 teaspoon kosher salt, plus more to taste", "1 teaspoon granulated sugar", "1 teaspoon powdered chicken bouillon (or replace with 1/2 teaspoon salt and 1/4 teaspoon MSG to make the dish vegan)", "2 tablespoons toasted sesame seeds", "1/4 cup peanut, rice bran or soybean oil", "4 medium garlic cloves, minced", "2 scallions, chopped into 1/2-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place potatoes in a large pot and cover with cool water by 2 inches. Season heavily with salt. (The water should taste like very salty seawater once the salt has dissolved.) Place over high heat, bring to a boil and cook until there’s no resistance when a knife or cake tester is poked through the largest potato, about 10 minutes after they come to a boil. Drain potatoes and spread in a single layer on a rimmed baking sheet to air-dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the potatoes cook, make the spice blend: In a small bowl, shake the Sichuan peppercorns and discard any shiny black seeds, twigs or leaf fragments. Add the husks to a dry wok, along with the star anise, fennel seeds, white peppercorns and half the cumin seeds. Toast over medium heat, tossing frequently, until very aromatic, about 2 minutes. Transfer mixture to a small bowl to cool slightly. Return wok to heat and add remaining cumin seeds and the chiles. Toss and stir until very aromatic, about 30 seconds. Transfer to a second small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cool, transfer the spice mixture in the first bowl, along with the 2 chiles from the second bowl to an electric spice grinder or a mortar and pestle. Add salt, sugar and chicken bouillon. Grind to a fine powder and return to the empty bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cumin seeds that toasted with the chiles to the spice grinder or the mortar (no need to clean it out) and pound or pulse until very coarsely ground. (There should be large, distinct pieces of cumin seeds.) Add half-ground cumin and the sesame seeds to the rest of the spice mixture and stir to incorporate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir-fry the potatoes: When potatoes are dry, heat 3 tablespoons oil in the wok over high heat until shimmering. Add potatoes and cook, stirring and tossing frequently, until browned in spots, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clear a small space in the center of the wok and add remaining 1 tablespoon oil to it. Immediately add the garlic, scallions and spice mixture to the oil and stir until aromatic, about 15 seconds. Toss everything until the potatoes are thoroughly coated in spices, about 15 seconds. Season to taste with more salt as desired. Transfer to a serving bowl and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021613-hot-and-numbing-stir-fried-new-potatoes"}