{"@context": "http://schema.org", "@type": "Recipe", "name": "Pastelillos de Guayaba (Guava Cheese Pastries)", "description": "Panaderías in Puerto Rico are magical. Their brightly lit glass cases are lined with fresh-baked bread and rich pastries, begging you to order too many. As a child, I clamored for pastelillos (also called pastelitos) de guayaba. The pastries typically have a flaky crust and are filled with a generous smear of concentrated guava paste — an embodiment of tropical Caribbean flavor — and often with cheese, served glazed or dusted with powdered sugar. In East Harlem, or El Barrio, New York’s historic Puerto Rican enclave where I lived for some time, I discovered <a href=\"https://valenciabakeryny.com/\">Valencia Bakery</a> on East 103rd Street, which made a bite-size version with a generous amount of confectioners’ sugar, creating a portal between the island and my new home. My recipe is inspired by theirs. These are excellent with coffee, and will keep for several days, benefiting from a reheat in the oven.", "author": {"@type": "Person", "name": "Von Diaz"}, "image": "https://static01.nyt.com/images/2021/03/24/dining/22puertoricanrex4-pastelillos/merlin_184863219_f4bd82ca-5824-49af-8b72-96e3b7e6c5ad-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "16 servings", "recipeCuisine": "", "recipeCategory": "snack, finger foods, pastries, dessert, side dish", "keywords": "confectioners' sugar, farmer's cheese, guava paste, puerto rican, puff pastry, queso fresco", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 246}, "recipeIngredient": ["1 (17.3-ounce) package puff pastry (2 sheets)", "1 egg", "1 tablespoon milk of choice, including oat milk or other nondairy milks", "7 ounces guava paste, cut into 16 (1/4-inch) square or rectangular slices", "6 ounces queso fresco en hoja or farmer cheese, cut into 16 (1/4-inch) slices", "2 to 3 tablespoons confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set out puff pastry to thaw for 40 minutes at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once pastry is thawed, line a 12-by-17-inch baking sheet with 2 pieces of parchment paper. (The double layer helps to protect your pan when you’re cutting the puff pastry.) Heat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare your egg wash by whisking egg and milk together. Keep it handy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay one layer of puff pastry on top of parchment paper on the baking sheet. Make a 4-by-4 grid of guava stacked with cheese, spaced evenly, leaving about 1 inch of space in between. Top with the second puff pastry sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a pizza cutter, slice the puff pastry into 16 equal pieces, touching the top lightly to determine where to slice. It’s OK if you don’t do a perfect job; these are especially good when the guava spills out and caramelizes along the edges. (And don’t worry too much about getting the cut exact, or pieces being odd sizes. It gives them character.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, use a fork to crimp all four edges twice on each side, then arrange them evenly on the baking sheet, leaving space between each. Brush the tops and edges lightly with the prepared egg wash and place baking sheet in the center of the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 25 minutes or until pastelillos are beautifully golden brown, flaky and puffy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Out of the oven, let pastelillos rest for at least 10 minutes before eating. (Guava is molten hot and will burn your mouth, badly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once they’ve cooled, sprinkle with confectioners’ sugar to taste. They can be eaten warm or at room temperature, and will keep for several days in an airtight container. Heat leftovers in the oven for 5 minutes at 350 degrees to bring back their crispness."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021996-pastelillos-de-guayaba-guava-cheese-pastries"}