{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn Polenta With Baked Eggs", "description": "This baked polenta is an extremely adaptable pantry dinner, and it works just as well without a stash of summer corn. (Of course, if you carefully sliced some off, and froze them after the summer, feel free to use them here.) You can use just about any kind of hearty chopped green here, and any full flavored cheese such as feta, blue cheese, Parmesan or an aged Cheddar. The eggs round out the dish, but feel free to leave them out for a satisfying side dish. (This recipe is part of the <a href=\"https://www.nytimes.com/column/from-the-pantry\">From the Pantry</a> series, started in the days after the coronavirus lockdown.)", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/09/17/dining/mc-polenta/merlin_177006099_a9945892-2260-45fe-877e-055745f3ebdb-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "main course", "keywords": "chicken broth, corn kernels, polenta", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1174}, "recipeIngredient": ["2 to 3 tablespoons butter", "1/2 cup corn kernels, fresh, frozen or canned and drained (optional)", "1 quart chicken or vegetable broth, or water", "1 cup coarse polenta (not instant)", "1/2 to 1 teaspoon kosher salt, to taste", "Chopped basil, mint or cilantro, plus more for serving (optional)", "2 to 3 scallions or a large shallot, sliced (optional)", "2 to 3 cups chopped greens, such as spinach, kale or broccoli rabe (optional)", "1/4 to 1/2 cup crumbled feta, blue cheese, grated Parmesan or other firm grating cheese, plus more for serving (optional)", "2 tablespoons chopped or sliced olives, roasted red peppers or marinated artichokes (optional)", "4 to 6 eggs", "Black pepper and flaky sea salt, for serving", "Green salad, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. In an ovenproof skillet over medium heat, melt butter. (If you like, you can let it bubble and turn brown, about 5 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the corn kernels (frozen, fresh, canned, or leave the corn out entirely). Let sizzle for a few minutes, then add broth, polenta and kosher salt. Whisk until the mixture bubbles and thickens slightly, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At this point, add a handful of chopped herbs and a couple of sliced scallions or a shallot, if using. Add the greens, if using. Stir in cheese, if using. Stir in sliced olives or roasted red peppers or marinated artichokes, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the pan. (Aluminum foil or a pasta pot lid will work if you don’t have a covered skillet.) Bake for 20 minutes, then uncover and give it all a good stir with a whisk. Cover once more, and bake for another 15 to 25 minutes, until the liquid is absorbed and the polenta is tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add eggs: Use a spoon to make 4 to 6 divots in the polenta, and crack an egg in each. Return the pan to the oven and bake uncovered for another 5 to 10 minutes, until the eggs are cooked to taste. You can run it under the broiler for a few seconds to set the jiggly whites, but it’s risky because you might overcook the yolks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crack lots of pepper on top, sprinkle with flaky sea salt, and strew with herbs and maybe more cheese before serving. Serve alongside a green salad."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021450-corn-polenta-with-baked-eggs"}