{"@context": "http://schema.org", "@type": "Recipe", "name": "Collard Greens", "description": "Collard greens, a staple of Southern cuisine, are often cooked down with smoked turkey or pork neck bones. The greens form a potlikker, or broth, full of briny, smoky flavor. When braised with smoked meat, they’re equally delicious as a side or a light one-pot meal. The longer the greens cook, the better they'll be. Top them with a generous dash or two of hot sauce, and pair with <a href=\"https://cooking.nytimes.com/recipes/9375-cornbread\">cornbread.</a> What tomato soup is to grilled cheese, potlikker is to cornbread.", "author": {"@type": "Person", "name": "Millie Peartree"}, "image": "https://static01.nyt.com/images/2020/12/31/dining/mp-collard-greens/merlin_181749087_1e5a73b8-31e7-4d11-9783-b087008e9f9e-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 servings", "recipeCuisine": "southern", "recipeCategory": "vegetables, side dish", "keywords": "collard greens, onion, smoked turkey, kwanzaa, new year’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 444}, "recipeIngredient": ["3 pounds collard greens (from about 6 medium bunches), or 2 pounds pre-chopped collard greens", "2 tablespoons extra-virgin olive oil", "1 Vidalia, Spanish or yellow onion, finely chopped (about 1 cup)", "Pinch of kosher salt, plus more as needed", "1 pound smoked turkey (any combination of necks, legs, butt or wings) or pork neck bones", "2 (1/2-inch) chicken bouillon cubes", "1 tablespoon garlic powder", "1 tablespoon onion powder, plus more as needed", "2 teaspoons apple cider vinegar, plus more as needed", "1 teaspoon black pepper, plus more as needed", "1/2 teaspoon red-pepper flakes", "Granulated sugar, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Tear the greens from their stems. Take a handful of greens, roll them up lengthwise and slice them into bite-size pieces. Add the sliced greens to an empty, clean sink full of cool water and wash them, removing all grit, sand and debris. Drain sink and rinse greens thoroughly with cold water until water becomes clear."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large stock pot or Dutch oven over medium. Add the onion and a pinch of salt, and sauté, stirring occasionally, until onion is translucent, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 4 cups of water to the pot. (This will become your potlikker.) Turn the heat to medium-high. Add the cleaned greens by the handful, stirring them until wilted before adding more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the smoked turkey, bouillon cubes, garlic and onion powders, apple cider vinegar, black pepper and red-pepper flakes to the pot. Bring to a rolling boil, then cover and lower heat to medium-low. Cook until greens are completely tender, at least 2 hours. Most of the water should have evaporated by this point, with just enough left to cover the bottom of the pot, and the meat should pull away from the bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the meat out of the pot, transfer to a cutting board, and shred the meat with two forks. Add the shredded meat back to the pot and stir until well combined. Taste and adjust salt, pepper and onion powder as needed. To cut bitterness, add sugar; if you’d like more tang, add more vinegar. Serve hot."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021773-collard-greens"}