{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Rajma (Punjabi-Style Red Beans With Cream)", "description": "Punjabi-style rajma, or red beans, in a thick, spicy tomato gravy is comforting, quick and comes together with what you have in the pantry. This one-pan baked version is inspired by it, but deviates from tradition in several ways. First, it lets the oven do the work of reducing the sauce. When the dish comes out, scatter with cilantro, if you’ve got it, and some quick-pickled onion. The key is to take your time with the base, letting the onion mixture cook out properly, so the final sauce is mellow and deeply flavored. But you can try the same technique with different beans, from chickpeas to cannellini. Eating the dish with a side of yogurt or a glug of cream is common, but it’s also a treat with a little melted cheese, the edges browned in the pan. Use what you’ve got. Serve the rajma over rice, ideally, but if you’re in a pinch, a side of hot flour tortillas or even buttered toast will make it into a delicious meal.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2020/05/03/magazine/03-mag-eat/03-mag-eat-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, beans, one pot, vegetables, main course", "keywords": "canned tomatoes, cilantro, ginger, kidney bean, onion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2266}, "recipeIngredient": ["1 red onion", "4 garlic cloves", "1 fresh green chile", "1 (1-inch) piece fresh ginger, peeled", "2 tablespoons neutral oil", "1/4 teaspoon cumin seeds", "1 teaspoon sea salt", "1 (28-ounce) can crushed, diced, chopped or whole tomatoes", "2 (15-ounce) cans kidney beans, drained", "1/2 teaspoon red chile powder", "1/4 teaspoon garam masala", "1/2 cup heavy cream or 1 cup diced mozzarella cheese", "1/4 cup roughly chopped fresh cilantro leaves", "1 teaspoon granulated sugar", "1 teaspoon kosher salt", "1/4 cup white wine vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Quarter the onion, then thinly slice one portion. Set aside sliced onion. Add the remaining onion to a food processor, along with the garlic, chile and ginger. Purée until fairly smooth, scraping down the sides of the bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, deep ovenproof skillet, heat the oil over medium. Add the cumin seeds and cook until lightly toasted, about 30 seconds. Add the onion mixture and salt, and cook, stirring occasionally, until the excess liquid has evaporated and the mixture is just starting to take on a golden color, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the mixture cooks, purée the canned tomatoes and their juices, if using diced, chopped or whole tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans and chile powder to the onion mixture, and mix well. Use a fork to mash a tablespoon or so of the beans against the side of the skillet to help thicken the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the crushed or puréed tomatoes and garam masala to the beans, and mix well. Drizzle the top with cream or scatter with cheese, then slide into the oven and bake, uncovered, until the sauce has thickened and the top is lightly browned, 30 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pickle: While the beans are baking, bring a small saucepan of water to a boil. Transfer 1/4 cup hot water to a small bowl. Stir in the sugar and salt until dissolved. Add the reserved onion slices to the boiling water in the saucepan, turn off the heat and, after 1 minute, drain the onion. Transfer the softened onion to the small bowl and stir in the vinegar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the beans are ready, fish out the pickled onion slices and arrange on top, letting a few drops of the pickling liquid flick over the beans to season them. Garnish with cilantro and serve with hot rice, buttered toast or flour tortillas."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021035-baked-rajma-punjabi-style-red-beans-with-cream"}