{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate-Flake Raspberry Ice Cream", "description": "A few years back, I made a delicious discovery: I could get the luxurious texture of French-style, custard-based ice cream with a recipe for eggless, Philadelphia-style ice cream. My ice cream has the usual cream, milk and sugar, but it’s also got powdered milk for richness, honey for smoothness, and alcohol for scoopability. The vodka keeps the ice cream soft and creamy, desirable in any ice cream and vital when there are berries, which have a tendency to go from juicy to rock-hard in the freezer. Any berries will work in this recipe, but I use raspberries, fresh or frozen, and bolster their flavor and color with a little freeze-dried raspberry powder (optional, but nice). The chocolate flakes are made with melted dark chocolate and coconut oil. Drizzled into the ice cream at the end of churning, the chocolate spins into flakes; drizzled over the ice cream before serving, it hardens on contact.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2020/08/16/magazine/16mag-eat/16mag-eat-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "1 generous quart", "recipeCuisine": "american", "recipeCategory": "snack, ice creams and sorbets", "keywords": "buttermilk, chocolate, coconut oil, heavy cream, raspberries, vodka, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 612}, "recipeIngredient": ["12 ounces/340 grams semisweet or bittersweet chocolate, finely chopped", "3 tablespoons coconut oil", "8 ounces/225 grams fresh (or frozen) raspberries (if using frozen, don’t defrost)", "2 cups/480 milliliters heavy cream", "1 cup/240 milliliters buttermilk (shake well before measuring)", "1/2 cup/100 grams granulated sugar", "3 tablespoons honey", "3 tablespoons powdered milk", "3 tablespoons vodka", "2 tablespoons freeze-dried raspberry powder (optional)", "1 teaspoon pure vanilla extract", "1/2 teaspoon fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chocolate flake and topping: Mix together the chocolate and oil in a heatproof bowl fitted over a saucepan of simmering water. Gently heat and stir until the chocolate is melted and the mixture is glossy and smooth. Set aside 1/2 cup to use as the flake and the rest for the topping. You can make the flake and topping up to 5 days ahead and keep it covered in the refrigerator. Warm to melt before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the ice cream: Working with a stand or immersion blender, blend all the ingredients, scraping the container occasionally, until smooth. (Pay attention to the powdered milk; it has a pesky way of clumping.) Cover, and refrigerate the mixture for up to 1 day, or churn right away. When you’re ready, pour the mixture into the ice cream maker and churn according to the manufacturer’s directions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before the ice cream is ready, open the top of the machine and, with the blade spinning, gradually drizzle in the reserved 1/2 cup of warmed chocolate flake. Churn for another 1 or 2 minutes to fully incorporate the flakes. Pack the ice cream into a container, cover and freeze for at least 6 hours before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the ice cream is ready to serve, take the container out 5 minutes before scooping. (Its texture is best after it’s had a few minutes on the counter.) Rewarm the remaining chocolate topping, and pour it over the individual servings of ice cream. It will immediately harden into a chocolate shell."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1021352-chocolate-flake-raspberry-ice-cream"}