{"@context": "http://schema.org", "@type": "Recipe", "name": "No-Bake Chocolate Clusters", "description": "These little cookies are a bunch of good things all at once: crunchy and chewy, sweet and salty, craggy and never neat, or ever the same, which is just as they should be. The must-have ingredients are melted chocolate, either dark or white (or both), and cornflakes. The coconut is optional, and the cranberries are up for grabs — you can swap them for raisins or small bits of other dried fruit. Since these require nothing but melting and stirring, and because the ingredients are so basic, these can be a spur-of-the-moment cookie, a boon when there’s often not enough time.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2021/12/08/dining/08COOKIESREX5-no-bake-chocolate-roses/merlin_198248646_49263efc-8dd6-42fb-8a86-9b2c951df36b-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "40 cookies", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "christmas, christmas cookie, cornflakes, dried cranberries, white chocolate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 320}, "recipeIngredient": ["6 or 8 tablespoons/85 or 113 grams unsalted butter, cut into chunks", "12 ounces/340 grams white chocolate bars, chopped, or semisweet chocolate chips", "4 cups/113 grams cornflakes", "1 cup/120 grams moist, plump dried cranberries (see Tip)", "1/3 cup/25 grams unsweetened shredded coconut (optional)", "Fleur de sel or fine sea salt, for finishing", "Sprinkles, for finishing (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with parchment paper or a baking mat or with 40 mini-muffin liners."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re using white chocolate, use 6 tablespoons/85 grams butter. For semisweet chocolate, use 8 tablespoons/113 grams butter. Put the butter in a small saucepan, top with the chocolate and cook over very low heat, stirring almost constantly, until smooth. (Alternatively, you can stir in a heatproof bowl set over simmering water or in a microwave-safe bowl in a microwave, stirring in 20-second increments.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toss the cornflakes, cranberries and coconut, if using, in a large bowl. Pour over the melted chocolate and gently stir in with a flexible spatula. Some of the cereal will break — it’s inevitable — but keep working until you’ve coated all of the flakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a medium cookie scoop or two spoons to shape sweets either on the lined baking sheet or in the paper liners. Gently press the mixture into the scoop or a spoon, binding the elements, before releasing the scoop or scraping the mixture off the spoon with another spoon onto the sheet or into the liners. Finish with salt and sprinkles, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate or freeze (my preference) for about 30 minutes, or until set, before serving. To keep, cover and refrigerate for up to a week or freeze for up to a month. These are good straight from the fridge or just a few minutes out of the freezer."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022766-no-bake-chocolate-clusters"}