{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Mushrooms With Chive Butter", "description": "Throwing whole mushroom caps onto the grill is a standard and effortless approach, but, because of their concave shape, they often steam rather than sear on one side, which does nothing to concentrate their meaty flavor. Instead, try slicing mushrooms into thick, hearty wedges and threading them onto skewers, flat sides facing out, and you’ll be able to sear them successfully. This recipe calls for seasoning the mushrooms with a paprika rub, grilling, then topping with a lemony herbed butter that offsets their smoky char. Serve them as a side, or as a vegetarian main with virtually anything: green salads, couscous salads, grilled vegetables or, for heartier appetites, potatoes of all stripes like <a href=\"https://cooking.nytimes.com/recipes/1021682-pure-potato-latkes\">latkes</a>, <a href=\"https://cooking.nytimes.com/recipes/1018298-french-fries\">French fries</a> or <a href=\"https://cooking.nytimes.com/recipes/1019882-twice-baked-potatoes\">baked potatoes</a>.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2021/09/01/dining/aw-grilled-portobello/merlin_193269171_bbcdde27-8c9f-4fa6-a1e5-8c2237903080-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "vegetables, main course", "keywords": "butter, paprika, portobello, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 84}, "recipeIngredient": ["8 tablespoons unsalted butter, cut into small pieces and softened at room temperature", "3 tablespoons minced fresh chives", "1 small garlic clove, finely grated (using a Microplane)", "1 packed teaspoon fresh lemon zest", "1/2 teaspoon ground oregano", "1/4 teaspoon kosher salt (Diamond Crystal)", "1/4 teaspoon black pepper", "1 teaspoon kosher salt (Diamond Crystal)", "1/2 teaspoon black pepper", "1/2 teaspoon onion powder", "1/4 teaspoon garlic powder", "1/4 teaspoon smoked paprika", "5 to 6 fresh, firm, large portobello mushroom caps (about 18 to 20 ounces)", "1/4 cup extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the herbed butter: In a medium bowl, combine the butter, chives, garlic, lemon zest, oregano, salt and pepper. Using a large fork, mash to combine. Using a spatula, transfer the herbed butter to a piece of parchment paper, and roll the butter into a tight cylinder, twisting the edges of the paper on both sides to seal. Transfer to the refrigerator. (Butter can be made in advance and will keep for up to 2 weeks.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your grill to high. (This is crucial to ensure that the mushrooms char.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, prepare the rub: Combine the salt, pepper, onion powder, garlic powder and smoked paprika. (Makes 2 1/2 teaspoons.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the mushrooms: Remove the stems and wipe the tops clean using slightly moistened paper towels. Slice each into 3/4-inch-thick strips. Transfer them to a large baking sheet, one sliced mushroom cap at a time. (Keeping the same mushrooms together will make for a more uniform appearance once you thread the mushrooms onto skewers.) Brush the sliced mushrooms all over with the olive oil, turning to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the rub all over the mushrooms, turning them until seasoned on all sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thread the mushrooms onto skewers: To make 4 planks, you’ll need eight 10-inch skewers, using about 1/4 of the mushrooms for each plank. (You can use skewers of any length with any number of mushroom slices.) Insert a skewer through the top left side of one mushroom piece and push it through the bottom. Insert a second skewer through the top right side of the mushroom. Gently push the mushroom up toward the top of the skewers, working each side little by little, and leave at least a 1-inch handle at the top. Repeat, keeping the both skewers parallel, threading as many mushroom pieces as will fit, and leaving at least a 1-inch handle at the bottom. (Don’t be too precious about threading the mushrooms. Some will break, but thread them securely and they’ll still taste delicious after grilling.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once you’ve threaded all your mushrooms, transfer them to the hot grill, flat-sides down over the flame. Cook on one side until charred, 6 to 7 minutes, then flip and cook the other side for another 6 to 7 minutes. (Don’t undercook them. Grilling mushrooms until they are visibly charred concentrates their flavor and results in a pleasantly hearty, chewier texture.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot, topped with slices of compound butter. (You’ll have more butter than you need, but any leftover butter will keep, refrigerated, for up to 2 weeks. Use on grilled or roasted vegetables, pasta, bread or rice.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022538-grilled-mushrooms-with-chive-butter"}