{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp Cocktail", "description": "This method for a beloved appetizer maximizes flavor by gently poaching shrimp in a deeply seasoned broth of salt, chile powder and celery seeds. Rather than wash away all the spices with a rinse or a plunge in an ice bath, you stop the cooking by pouring ice directly into the hot bath. For dipping, go for a classic cocktail sauce with the sharp brightness of lemon and horseradish, or a simple garlicky dill butter, which makes the shrimp taste somehow of lobster, or a comforting, warmly spiced honey mustard, because you always need a creamy option. Enjoy the plump shrimp with your favorite sauce — or all three.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2021/12/29/dining/23shrimprex/23shrimprex-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "finger foods, seafood, appetizer", "keywords": "butter, ketchup, shrimp, christmas, new year’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 498}, "recipeIngredient": ["2 pounds large (21- to 25-count) shrimp, shelled and deveined", "Kosher salt", "8 cups ice cubes (about 2 pounds), plus more for serving", "1/4 cup mild red chile powder, gochugaru or sweet paprika with a dash of ground cayenne", "1 tablespoon celery seeds", "2 lemons", "1/2 cup ketchup", "3 tablespoons lemon juice", "2 tablespoons prepared horseradish", "1 large garlic clove, finely grated", "Kosher salt and black pepper", "Tabasco sauce", "1/2 cup unsalted butter", "2 large garlic cloves, finely grated", "1/4 packed cup finely chopped fresh dill (from 1 small bunch)", "2 tablespoons lemon juice", "1 teaspoon granulated sugar", "Kosher salt and black pepper", "1/4 cup mayonnaise", "2 tablespoons Dijon mustard", "2 tablespoons honey", "1 tablespoon lemon juice", "1 teaspoon curry powder", "1/2 teaspoon ground cayenne", "Kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the shrimp: In a large bowl, toss together the shrimp and 2 teaspoons salt, and set aside. Keep the 8 cups ice nearby, either in another large bowl or directly in the icemaker tray of your refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, fill a large pot with 8 cups water, 1/2 cup salt, the chile powder and celery seeds, and bring to a boil. Remove the pot from the heat and add the shrimp to the hot liquid, stirring occasionally, until just cooked through and no longer translucent on the inside, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately dump the ice into the pot to stop the cooking, stirring occasionally, until the liquid is cool to warm or room temperature, about 1 minute. Pour the contents of the pot into a colander in the sink, then transfer the drained, celery seed-dotted shrimp to a large platter and refrigerate until ready to eat. Cut the lemons into quarters lengthwise, then cut each piece in half crosswise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cocktail sauce: In a small bowl, stir the ketchup, lemon juice, horseradish and garlic to combine, and season to taste with salt, pepper and Tabasco sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the garlicky dill butter: Melt the butter in a small saucepan over medium-low heat or in the microwave. Add the garlic, dill, lemon juice and sugar to a small bowl and stir in the hot melted butter. Season generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the curried honey mustard: In a small bowl, stir the mayonnaise, mustard, honey, lemon juice, curry powder and cayenne to combine. Season to taste with salt and pepper. All three sauces can be stored in separate airtight containers in the refrigerator for up to 3 days. (The dill butter will need to be reheated in the microwave or on the stove over medium-low heat until liquid again.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, cover a large platter with cubed or crushed ice, top with the poached and cooled shrimp and scatter the lemon pieces all over. Serve with one or more of the dipping sauces on the side."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022841-shrimp-cocktail"}