{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Sausages, Peppers and Onions ", "description": "The well-loved trifecta of sausages, peppers and onions can be found at Italian street fairs, ballparks and on weeknight dinner tables. They’re often <a href=\"https://cooking.nytimes.com/recipes/1020436-sheet-pan-sausage-with-peppers-and-tomatoes\">roasted</a> or <a href=\"https://cooking.nytimes.com/recipes/9445-chorizo-with-sweet-pepper-and-onion-stew-and-fried-croutons\">braised</a>, but this recipe makes smart use of a grill: Sausages cook over indirect heat to prevent bursting, while peppers and onions soften and char over the flames. At the end, while the sausages and rolls spend a few minutes over direct heat to brown and crisp, the cooked vegetables rest in a tart vinaigrette to balance the sweetness of the peppers. Tuck the sausages and vegetables into the roll, then add mustard, <a href=\"https://cooking.nytimes.com/recipes/12291-giardiniera\">giardiniera</a>, mozzarella or nothing at all.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2021/09/15/dining/AS-Grilled-Sausages-Peppers-and-Onions/AS-Grilled-Sausages-Peppers-and-Onions--articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "sandwiches, main course", "keywords": "onion, pepper, sausage", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 202}, "recipeIngredient": ["4 sweet or hot Italian pork sausages (about 1 pound)", "1 pound bell peppers (any color), seeds and stem removed, cut crosswise into 1/2-inch-thick rings", "2 large yellow or red onions, peeled and cut crosswise into 1/2-inch-thick rings (about 1 1/2 pounds total)", "Olive oil", "Kosher salt and black pepper", "4 hero, hoagie or sub rolls, about 6 inches long, halved lengthwise but still connected", "1/4 cup red wine, Sherry or apple cider vinegar", "Pinch of dried oregano (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a charcoal or gas grill for two-zone cooking over medium-high heat. (For a charcoal grill, pour the coals on one side. For a gas grill, heat all burners covered on high, then reduce one burner to medium-high and turn off the other. If your grill has three burners, reduce the outer two to medium-high and turn off the middle.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, remove sausages from the package to come to room temperature and to air-dry. In a large bowl or baking dish, toss the peppers and onions with olive oil, salt and pepper to coat. Lightly brush the interior of the rolls with olive oil. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and oil the grates. (Dip the trimmed end of the onion in oil and use it to grease the grates). Place the peppers and onions over the flame (direct heat) and place the sausages where there is no flame beneath (indirect heat). Cover and cook, flipping occasionally, until the vegetables are softened and charred in spots and cooked through, 14 to 20 minutes. (To keep all of the juices in, insert the thermometer into the ends of the sausages as opposed to pricking the sausage casing.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the now-empty bowl or baking dish, add the vinegar, 3 tablespoons olive oil, and oregano, if using. Season with salt and pepper. As the vegetables finish cooking, add them to the bowl and toss to combine. Move the sausages to direct heat and cook, turning often, until charred and crisp, 2 to 4 minutes. (Cover if using a gas grill.) Transfer to the bowl of vegetables to rest for a few minutes. Grill the cut sides of the buns over direct heat until toasted, 1 to 2 minutes. Divide the peppers, onions and sausages between rolls."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022563-grilled-sausages-peppers-and-onions"}