{"@context": "http://schema.org", "@type": "Recipe", "name": "Root Beer Ham", "description": "Despite its regal countenance, a glazed holiday ham is surprisingly easy to cook — though “cook” is misleading here, as most supermarket hams already come fully cooked and just need to be heated through in the oven. Here, a bone-in half ham (try not to get the spiral-sliced kind, which can dry out easily) gently bakes in an aromatic pool of shallots, bay leaves and root beer, a variation on the Southern classic made with cola. The root beer braising liquid is reduced with brown sugar and Dijon into a sticky glaze that lacquers the scored ham with caramelized luster. Save the braising liquid and serve alongside to spoon onto slices for even more flavor and juiciness.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2021/12/12/magazine/12mag-eat-site/12mag-eat-site-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "meat, main course", "keywords": "christmas, ham, root beer, shallots", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1138}, "recipeIngredient": ["1 bone-in, fully cooked unsliced half ham (8 to 12 pounds)", "2 (12-ounce) cans root beer", "2 large shallots, halved lengthwise", "2 large dried or fresh bay leaves", "1/4 packed cup dark brown sugar", "4 teaspoons Dijon mustard", "2 teaspoons rice vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees. Using a sharp knife, make parallel cuts across the surface of the ham, about 1/2 inch deep and 1 inch apart, then repeat in the opposite direction to create a diamond pattern."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the ham in a deep, large roasting pan, cut side down, and pour the root beer over the ham. Add the shallots and bay leaves to the root beer in the roasting pan. Cover the pan tightly with aluminum foil and bake, basting once halfway through, until the ham is heated through (it’s already cooked). The internal temperature should reach 135 degrees, about 15 minutes per pound (2 to 3 hours total)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the ham is done heating through, carefully remove from the oven and raise the oven temperature to 400 degrees. Uncover the ham and ladle out 2 cups of the root beer braising liquid into a large skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the glaze, add the brown sugar, mustard and rice vinegar to the root beer in the skillet and bring to a boil, whisking occasionally and watching that it doesn’t boil over. Cook until reduced significantly, syrupy and thick enough to coat the back of a spoon and drip off slowly, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spoon or a brush, apply half of the glaze all over the surface of the ham. Bake, uncovered, until the glaze is bronzed, bubbling and gorgeous (but not burned), 8 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the ham to a cutting board to rest for at least 15 minutes before slicing thinly and serving with the extra glaze. Carefully pour the braising liquid into a gravy boat and serve alongside, as well."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022799-root-beer-ham"}