{"@context": "http://schema.org", "@type": "Recipe", "name": "Sunday Sauce", "description": "In many Italian American households, Sunday means there’s red sauce simmering all day on the stove. It might be called sauce, sugo or gravy, and surely every family makes it differently, but the result is always a tomato sauce rich with meat. This recipe (which you can also <a href=\"https://cooking.nytimes.com/recipes/1022975-slow-cooker-sunday-sauce\">make in a slow cooker</a>) follows a classic route of using shreddy pork shoulder, Italian sausage and meatballs. Once the sauce is done, coat pasta in the sauce, spoon some meat on top and share it with the whole family alongside a green salad, crusty bread and red wine. The sauce can keep refrigerated for up to one week and frozen for up to three months.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/02/08/dining/as-sunday-sauce/merlin_201238980_104949b5-4fa9-4f9d-83a5-c0c7d26a4ec1-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas, sauces and gravies, main course", "keywords": "boneless pork shoulder, crushed canned tomatoes, freezer friendly, italian american, italian sausage, make-ahead, pork shoulder, rigatoni, spaghetti", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2022}, "recipeIngredient": ["2 pounds boneless pork shoulder, cut into 3-inch chunks", "Kosher salt and black pepper", "1/4 cup extra-virgin olive oil, plus more as needed", "1 pound hot or sweet Italian sausage, or a combination", "1 yellow onion, coarsely chopped", "6 garlic cloves, smashed and peeled", "1/3 cup red wine", "2 (28-ounce) cans crushed tomatoes", "3 basil sprigs", "1 pound uncooked <a href=\"https://cooking.nytimes.com/recipes/1019765-pork-and-ricotta-meatballs\">homemade</a> or store-bought meatballs", "1 1/2 pounds tubular or long noodles, like rigatoni or spaghetti", "Grated Parmesan or pecorino, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the pork shoulder all over with salt and pepper. In a large Dutch oven, heat 2 tablespoons oil over medium high. Working in batches if necessary, cook the pork until browned on two sides, 8 to 10 minutes total, adding more oil if the pan looks dry. Transfer pieces to a bowl as they finish. Add the sausages to the pot and cook until browned, 4 to 6 minutes total. Transfer to the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to medium-low. Add the remaining 2 tablespoons oil, if needed, and the onion and garlic. Season with salt and pepper, and cook until softened, 2 to 4 minutes. Add the red wine, stir, scrape up the browned bits on the bottom of the pan and cook until the wine is nearly evaporated, 2 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes and basil, then fill one of the 28-ounce cans with water. (You’ll use it in a second.) Return the pork shoulder and sausages to the pot, along with any accumulated juices in the bowl. Nudge them around so they are submerged. Add the meatballs on top, then add enough water from the can to cover the meat. (There’s no need to stir.) Partly cover the pot, bring to a simmer over medium-high heat, then reduce heat to a gentle simmer and cook, stirring occasionally, until the pork shoulder falls apart when shredded with a fork, 2 to 2½ hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to eat, bring a large pot of salted water to a boil. Add the pasta to the boiling water and cook according to package instructions until al dente. While the pasta cooks, slice the sausage and shred the pork shoulder. Transfer to a platter along with the meatballs and a few spoonfuls of sauce. Reserve ½ cup pasta water, then drain and add the pasta to the pot of sauce. Over medium heat, toss the pasta with the sauce, adding pasta water as needed until the sauce clings to the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide pasta between bowls, then top with a bit of each meat. Pass the Parmesan and platter of meat at the table."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022972-sunday-sauce"}