{"@context": "http://schema.org", "@type": "Recipe", "name": "Handvo (Savory Vegetable Semolina Bread)", "description": "Handvo, a savory vegetable bread from the Indian state of Gujarat, is a near constant in the home of Anita Jaisinghani, the chef and owner of Pondicheri restaurant in Houston. Using hot water in the dough helps meld the flavors and hydrate the flours, as well as kickstart the leavening process. Ms. Jaisinghani makes many different versions — this carrot one is layered with the fragrance of toasted spices, the warmth of ginger and the freshness of herbs. Thanks to the pumpkin and sesame seeds that toast on top while it bakes, it also has an extra crunchy crust. The accompanying yogurt sauce is quickly — and deliciously — seasoned with aromatic spices tempered in oil. This is typically served as a snack, but is substantial enough to be a light meal when served with a salad.", "author": {"@type": "Person", "name": "Rachel Wharton"}, "image": "https://static01.nyt.com/images/2021/04/21/dining/16doughrex2/merlin_185501910_67fc0278-7353-43c3-998f-8bad989be2a7-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "indian", "recipeCategory": "breads", "keywords": "carrot, cilantro, fenugreek, peanut, yogurt, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 64}, "recipeIngredient": ["1/4 cup vegetable oil", "1/4 cup roasted unsalted peanuts, chopped", "1 teaspoon cumin seeds", "30 to 40 fresh curry leaves (from 3 to 4 stems), chopped (see Tips)", "2 medium carrots, coarsely grated (198 grams; 1 1/2 cups loosely packed)", "1 cup/130 grams semolina flour", "1 cup/64 grams chopped fresh fenugreek leaves and stems or 1/4 cup dried fenugreek (see Tips)", "1/2 cup/29 grams chopped fresh cilantro leaves", "1/2 cup/113 grams plain whole-milk yogurt, at room temperature", "2 tablespoons chickpea or lentil flour (optional)", "1 tablespoon grated peeled fresh ginger", "1 1/2 teaspoons fine sea salt", "1 teaspoon baking powder", "1 teaspoon red chile powder", "1/2 teaspoon ground turmeric", "1/2 teaspoon baking soda", "2 tablespoons sesame seeds", "2 tablespoons raw pumpkin seeds (pepitas)", "1/2 cup plain whole-milk yogurt, at room temperature", "1 tablespoon granulated sugar", "1/2 teaspoon fine sea salt", "2 tablespoons vegetable oil", "3 large garlic cloves, thinly sliced", "1 teaspoon black mustard seeds", "10 to 12 fresh curry leaves (from 1 stem), chopped", "Pinch of red chile powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange an oven rack in the lowest position and heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the handvo: In a large (10-inch) cast-iron or nonstick oven-safe skillet, heat the vegetable oil over medium-high. When the oil begins to shimmer but is not yet smoking, add the peanuts and fry, stirring continuously, until they begin to take on color and toast, a minute or two. Immediately add the cumin seeds, stirring just until they begin to pop and sizzle, about 10 seconds, then immediately stir in the curry leaves and turn off the heat. (Be careful as the curry leaves will spatter.) Scrape into a large bowl. Reserve the skillet, but don’t clean it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the bowl, add the carrots, semolina, fenugreek, cilantro, yogurt, chickpea flour (if using), ginger, salt, baking powder, chile powder, turmeric and baking soda. Stir until well mixed. Run the hot water tap until the water is very hot (120 degrees) and measure out 1 cup. (Or heat 1 cup water to about 120 degrees in a small pot or kettle.) Add to the semolina-carrot mixture and stir until everything is evenly mixed. Immediately pour it into the skillet you used to toast the spices in the oil. Sprinkle the sesame seeds and the pumpkin seeds, if using, over the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the sides pull back a little from the edges and the center is set, 40 to 45 minutes. It is better to overbake rather than underbake to achieve a crisp crust. Cool in the pan on a rack for 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the yogurt sauce: In a small bowl, stir together the yogurt, sugar and salt. Set this aside and, in a small skillet, heat the oil over medium-high to high. When the oil begins to shimmer but is not yet smoking, add the garlic. Stirring constantly, cook it just until the edges turn golden brown, about 1 minute, then immediately add the mustard seeds and chopped curry leaves, and remove the pan from the heat. Carefully pour the oil into the seasoned yogurt, leaving a few teaspoons of the spices and herbs in the pan, and fold the oil and yogurt together. Sprinkle the reserved spices and herbs and the chile powder over the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the edges of the handvo are stuck to the skillet, use a spatula to release the sides. Flip the handvo out of the pan or, to serve it with the seeds on top, gently slide it onto a serving plate using a large spatula. Cut into slices or squares and serve warm or at room temperature with the yogurt sauce."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022110-handvo-savory-vegetable-semolina-bread"}