{"@context": "http://schema.org", "@type": "Recipe", "name": "Butter Mochi", "description": "Tender and chewy, this big-batch dessert — as comforting as cake and as fun as bar cookies — is always a hit at parties. Mochiko, sweet rice flour, not only gives it its distinctive marshmallow-like softness, but it also lends a natural sweetness. This version of butter mochi uses only coconut milk for its richness and subtle nutty taste, but you can substitute equivalent amounts of whole milk, evaporated milk or a combination of those liquids. Butter mochi develops a crackly top that stays crunchy the day it’s baked, making it a delicious dessert to eat without adornment. But, if you’d like more crunch, you can sprinkle dried shredded coconut evenly over the top before baking, or, for a tangy, colorful top, you can coat it with the passion fruit glaze below. (Watch the video of <a href=\"https://youtu.be/muwQ9YbZqrM\">Genevieve Ko making butter mochi here</a>.)", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2021/06/30/dining/25MOCHIrex/merlin_189372024_64f598d5-1193-4bc8-b182-32a52caa9e98-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "1 (9-by-13-inch) cake", "recipeCuisine": "", "recipeCategory": "cakes, dessert", "keywords": "coconut milk, party, rice flour, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1983}, "recipeIngredient": ["6 tablespoons/84 grams unsalted butter, melted and cooled, plus more for greasing the pan", "3 cups/453 grams mochiko (sweet rice flour), like Blue Star brand", "2 teaspoons baking powder", "1/2 teaspoon fine sea salt", "4 large eggs", "2 cups/416 grams granulated sugar", "2 (13.5-ounce) cans unsweetened coconut milk (scant 3 1/2 cups)", "1 tablespoon pure vanilla extract", "1 1/2 packed cups/219 grams confectioners’ sugar", "2 to 4 tablespoons passion fruit pulp or purée (see Tip)", "Pink or red food coloring (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the mochi: Heat the oven to 350 degrees. Lightly butter a 9-by-13-inch cake pan, then line the bottom and sides with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the mochiko, baking powder and salt in a medium bowl. Prepare the batter in a stand mixer or in a large bowl with an electric hand mixer or whisk: Whisk the eggs and sugar until pale yellow and thick. Continue whisking while pouring in the coconut milk, then the butter and vanilla. Continue whisking while gradually adding the mochiko mixture. Whisk until the batter is completely smooth. Pour into the prepared pan, then tap it against the counter to get rid of any air bubbles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden brown and crackly, 1 hour 15 minutes to 1 1/2 hours. When you press the center, it should bounce back but not indent at all. Cool completely in the pan on a wire rack. Use the parchment paper to slide the cooled mochi out of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The mochi is delicious plain, but you can add a glaze if you’d like: Mix the confectioners’ sugar with 2 tablespoons passion fruit pulp until smooth. It should be thick but drippy. If needed, add another 1 to 2 tablespoons pulp. If you’d like to create an ombré or sunset effect, scrape some into another bowl or multiple bowls and tint with food coloring. Spread the glaze evenly over the mochi, in stripes if you’d like, and let stand until set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the mochi into squares or bars. Serve immediately, or keep in an airtight container at room temperature for up to 3 days."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Butter Mochi", "description": "Tender and chewy, this big-batch dessert — as comforting as cake and as fun as bar cookies — is always a hit at parties. Mochiko, sweet rice flour, not only gives it its distinctive marshmallow-like softness, but it also lends a natural sweetness. This version of butter mochi uses only coconut milk for its richness and subtle nutty taste, but you can substitute equivalent amounts of whole milk, evaporated milk or a combination of those liquids. Butter mochi develops a crackly top that stays crunchy the day it’s baked, making it a delicious dessert to eat without adornment. But, if you’d like more crunch, you can sprinkle dried shredded coconut evenly over the top before baking, or, for a tangy, colorful top, you can coat it with the passion fruit glaze below.", "thumbnailUrl": "https://static01.nyt.com/images/2021/06/30/dining/25MOCHIrex/merlin_189372024_64f598d5-1193-4bc8-b182-32a52caa9e98-mediumThreeByTwo440.jpg", "uploadDate": "2023-01-12T21:51:44.000Z", "duration": "PT6M57S", "transcript": "", "contentUrl": "https://vp.nyt.com/video/2023/01/12/105497_1_GK-butter-mochi-CV_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022347-butter-mochi"}