{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Chicken With Caramelized Cabbage", "description": "Chicken roasted on a sheet pan develops gloriously crispy skin thanks to the increased hot airflow from the oven that passes over it. The extra space on the pan holds cabbage and onions, which roast around the chicken and soak up its juices while caramelizing. Fennel seeds, which are often found in sausage, lend their wonderful anise flavor to the dry brine on the bird and to the schmaltzy vegetables. If you can, dry-brine the chicken overnight for the most flavor and juiciness. Be sure to save the carcass to turn into <a href=\"https://cooking.nytimes.com/recipes/1022850-roasted-chicken-stock\">stock</a> later.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2021/12/30/dining/30RESOLUTIONREX1-roast-chicken/merlin_199513131_70048097-2070-43c9-9ba8-9ca656c8a42d-articleLarge.jpg", "totalTime": "PT2H20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, main course", "keywords": "fennel seeds, green cabbage, roast chicken, whole chicken, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1133}, "recipeIngredient": ["Kosher salt and freshly ground black pepper", "2 teaspoons fennel seeds", "1 tablespoon packed dark brown sugar", "1 whole (3- to 4-pound) chicken", "2 1/2 pounds green cabbage (about 1 large head), cored and cut into 1-inch pieces", "1 large yellow onion, halved and thinly sliced", "5 tablespoons olive oil", "1 tablespoon sherry vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small dish, stir together 1 1/2 tablespoons Diamond Crystal kosher salt or 1 tablespoon Morton’s coarse kosher salt, 1 teaspoon black pepper, 1 teaspoon fennel seeds and the brown sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken on a large plate or sheet pan and, with a paper towel, pat the surface of the chicken as dry as you can. Remove any giblets from the cavity and reserve for another time. Sprinkle a third of the spice mixture into the cavity of the chicken, focusing especially on the underside of the breasts. Use your hands to really rub the spices into the cavity. Now, sprinkle the rest of the spice mixture all over the surface of the chicken, including the bottom but especially the top, where the breasts are, and again, really rub it into the skin. If roasting right away, let the chicken sit at room temperature for at least 1 hour. Alternatively, you can place the chicken, uncovered, in the refrigerator to dry-brine for up to 24 hours; just be sure to let it sit out at room temperature for at least 1 hour before roasting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chicken is coming to room temperature, position a rack on the bottom third of the oven and heat the oven to 425 degrees. On a large sheet pan, add the cabbage, onion, 4 tablespoons olive oil and the remaining 1 teaspoon fennel seeds. Season generously with salt and pepper, and toss until evenly combined. Push the cabbage and onions to the edges of the pan to make room for the chicken, and place the chicken in the center of the pan, breast side up; the chicken should have direct contact with the pan and not be sitting over any of the vegetables. Massage the remaining 1 tablespoon olive oil onto the chicken and give it a final generous sprinkling of salt and pepper (going lighter on the seasoning the longer the chicken has been dry-brined)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the chicken, rotating the pan halfway through, until the skin is golden brown and crispy, and the thigh meat reaches 160 degrees on an instant-read thermometer (it will continue to cook as it rests), 40 to 55 minutes or 13 minutes per pound. Do not cut into it to check that the juices run clear. The cabbage and onions should be soft and slightly charred in spots."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the chicken rest for at least 15 minutes on the pan before transferring to a cutting board and carving into portions. Don’t forget to turn the carcass over and eat the two “oysters” on the bottom of the chicken where the back of the thighs meet the spine. It’s arguably the best part of the roast chicken experience, and the chef’s treat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vinegar to the cabbage and onions, toss until evenly distributed and taste for seasoning, adjusting with salt and pepper. Serve alongside the chicken."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022849-roasted-chicken-with-caramelized-cabbage"}