{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Babka Rugelach", "description": "These festive, fudgy confections are a mash-up of two traditional Jewish favorites: rugelach and chocolate babka. They have a tender, flaky pastry wrapped around a bittersweet truffle-like filling that’s sprinkled with chopped nuts or cocoa nibs for a contrasting crunch. A topping of Demerara sugar adds texture, and a little flaky sea salt cuts the sweetness perfectly. These are best served within five days of baking (store them in an airtight container at room temperature). They also freeze well for up to one month, with parchment or waxed paper between layers. ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/12/08/dining/08cookiesrex16-rugelach/merlin_198260691_9e52c301-efe9-4468-9371-4b8ff525f734-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 dozen rugelach", "recipeCuisine": "jewish", "recipeCategory": "dessert", "keywords": "bittersweet chocolate, christmas cookie, cocoa powder, cream cheese, freezer friendly, make-ahead, christmas, hanukkah", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 469}, "recipeIngredient": ["1 (8-ounce/225-gram) block cream cheese, softened", "1 cup/225 grams unsalted butter, softened, plus more for the pans, if you like", "1/4 cup/50 grams granulated sugar", "1 teaspoon vanilla extract", "2 cups/255 grams all-purpose flour, plus more for rolling", "1/2 teaspoon fine sea or table salt", "1/4 cup/50 grams granulated sugar", "6 tablespoons/88 milliliters heavy cream", "Pinch of fine sea or table salt", "3 ounces/85 grams extra bittersweet chocolate, preferably 66 to 74 percent cocoa, coarsely chopped", "1/4 cup/61 grams unsalted butter, diced, at room temperature", "1 teaspoon vanilla extract", "1/2 cup/63 grams all-purpose flour", "3 tablespoons/45 grams granulated sugar", "1 1/2 tablespoons/11 grams cocoa powder", "1/2 teaspoon fine sea or table salt", "4 1/2 tablespoons/64 grams unsalted butter, melted", "1/2 cup/75 grams finely chopped toasted nuts, such as pistachios, walnuts, or pecans, or use cocoa nibs", "2 tablespoons Demerara sugar, for sprinkling", "Flaky sea salt, for sprinkling ", "Milk, for brushing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Using a stand mixer fitted with the paddle attachment or a hand-held electric mixer, beat cream cheese and butter on medium speed until smooth and well blended. Beat in sugar and vanilla extract. Reduce speed to low, and gradually add flour and salt until just incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape dough onto plastic wrap. Divide dough into 4 portions, form each into a disk and wrap each in plastic wrap. Refrigerate for 2 hours or up to 5 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the fudge: In a medium saucepan over medium heat, combine sugar, cream, and salt. Simmer, stirring occasionally, until sugar dissolves completely, about 5 minutes. Scrape mixture into a bowl. Add chocolate, butter and vanilla, and let sit for 5 minutes to soften the chocolate, then mix until melted and smooth. (Fudge can be made up to 2 weeks ahead and stored, covered, in the refrigerator. Let come to room temperature before using; it’s too firm to spread when cold.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crumb filling: In a small bowl, stir together flour, sugar, cocoa powder and salt. Stir in melted butter until it is evenly distributed and the mixture forms large, moist crumbs. Set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 4 baking sheets with parchment paper or nonstick liners, or lightly butter the pans, if you like. Working with 1 piece of dough at a time, remove it from refrigerator and allow it to sit at room temperature for about 5 minutes, or until malleable enough to roll out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a clean, lightly floured work surface, roll out dough into a 9-inch circle, about 1/8-inch thick. Rotate dough while rolling to ensure it does not stick to the work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the back of a spoon, evenly spread 2 tablespoons of fudge onto the rolled-out dough. Sprinkle about 1/2 cup of sugar cocoa crumbs over fudge. Sprinkle 2 tablespoons of chopped nuts over the crumbs, and, using your hands, press the filling firmly and evenly into the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife, cut the dough circle into 12 triangles, like pieces of a pie. With an offset spatula or thin knife, loosen the triangles from the work surface. Starting at the wide end of the triangle and working to the narrow tip, roll up each piece and bend the ends around to form a slight crescent shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place rugelach, narrow tip tucked beneath, on a prepared baking sheet, leaving about 1 1/2 inches between each. Refrigerate, lightly covered with plastic wrap, for at least 30 minutes (and up to 24 hours) to help them keep their shape in the oven. Repeat with the remaining dough, fudge and filling. (Clean your work surface before rolling out the next batch of dough.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, heat oven to 350 degrees. In a small bowl, stir together Demerara sugar and a large pinch of flaky salt. Brush rugelach with milk and sprinkle sugar-salt mix on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, 2 sheets at a time, until lightly browned, 17 to 25 minutes. Rotate cookie sheets halfway through for even baking. Transfer sheets to a wire rack to cool completely."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022715-chocolate-babka-rugelach"}