{"@context": "http://schema.org", "@type": "Recipe", "name": "Tofu and Broccoli Fried Rice", "description": "Fried rice is the perfect weeknight meal: It requires minimal prep, simple pantry condiments and basic vegetables. Not to mention, it comes together quickly. Here, otherwise mild tofu is transformed into savory bites when cooked in soy sauce infused with aromatics, absorbing all of the rich, sweet-salty flavor and bringing depth to the dish. The rice seasonings are kept simple and bright with garlic and ginger, which allows the vegetables to shine. Use any mix of leftover vegetables: Cabbage, bell peppers and mushrooms are all great alternatives.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2022/01/11/dining/kc-tofu-and-broccoli-fried-rice/kc-tofu-and-broccoli-fried-rice-articleLarge-v2.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, weeknight, grains and rice, main course, side dish", "keywords": "broccoli, firm tofu, rice, soy sauce, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1806}, "recipeIngredient": ["5 tablespoons neutral oil, such as safflower or canola oil", "2 tablespoons minced garlic", "2 teaspoons minced fresh ginger", "1/3 cup low-sodium soy sauce ", "2 tablespoons turbinado or granulated sugar", "1 (14-to-16-ounce) package firm tofu, drained and cut into 1/2-inch cubes", "Kosher salt and black pepper", "1/4 cup chopped cilantro", "1/2 cup finely chopped yellow onion", "1 large carrot, peeled and thinly sliced into rounds", "8 ounces broccoli, cut into 1-inch florets and stems thinly sliced (3 heaping cups)", "4 cups cooked and cooled long grain white rice, preferably day-old", "1 jalapeño or serrano chile, thinly sliced", "1/2 cup thawed frozen peas", "4 large eggs, beaten", "1/2 cup thinly sliced scallions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 12-inch nonstick skillet, heat 1 tablespoon of oil over medium. Add 1 tablespoon of the garlic and 1 teaspoon of the ginger, and stir until fragrant, 30 seconds. Add soy sauce, sugar and tofu, and season with salt and pepper. Cook, stirring occasionally, until sauce has been absorbed and tofu is nicely glazed, about 5 minutes. Stir in cilantro. Transfer tofu along with juices to a shallow plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, heat 2 tablespoons of oil over medium. Add onion and carrot, and season with salt and pepper. Cook, stirring occasionally, until softened, 3 minutes. Stir in remaining 1 tablespoon garlic and 1 teaspoon ginger until fragrant, 30 seconds. Add broccoli, season with salt and pepper, and cook, stirring occasionally, until broccoli is softened, about 3 minutes. Add rice, jalapeño and peas, and drizzle over 1 tablespoon of the oil. Season with salt and pepper, and cook, stirring occasionally, until well combined and rice is golden in spots, about 3 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Push rice mixture to one side of the skillet. To the empty side, add the remaining 1 tablespoon oil and eggs, and allow them to set a little before stirring. Cook until scrambled, 1 to 2 minutes. Stir egg into rice mixture, then stir in half of the scallions and half of the glazed tofu and any juices on the plate. Season with salt and pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the fried rice in bowls, and top each with some of the remaining glazed tofu. Garnish with the remaining scallions."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022870-tofu-and-broccoli-fried-rice"}