{"@context": "http://schema.org", "@type": "Recipe", "name": "Six-Foot Meatless Italian Hero", "description": "This sandwich serves many dainty folks or fewer rugged types. Preorder the bread from an Italian bakery or deli counter, and build first, season last. Success here is in achieving a perfect filling-to-bread ratio, a generousness with the seasonings, and the ability to close the sandwich around the filling without finding it woefully over- or under-stuffed when it’s time to slice. It’s a huge help to have on hand 8-inch wooden skewers, disposable gloves, a good serrated knife and an egg-slicer gadget. The assembly instructions here are meant to be helpful but not prescriptive, as I trust that everybody knows how to build a sandwich to their own liking.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2021/06/27/magazine/27mag-eat/20mag-eat-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "1 six-foot hero (serves 12 to 30, depending on the group)", "recipeCuisine": "", "recipeCategory": "sandwiches, main course", "keywords": "celery heart, eggs, green bell pepper, jalapeño, provolone, tomato, fourth of july, labor day, tailgate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 264}, "recipeIngredient": ["2 green bell peppers", "1 medium head iceberg lettuce", "5 firm hothouse beefsteak tomatoes", "1 bunch celery hearts", "1 bunch flat-leaf parsley", "2 (14-ounce) cans artichoke hearts", "14 garlic cloves, peeled", "Kosher salt and freshly ground pepper", "Extra-virgin olive oil (approximately 1 to 1 1/2 cups)", "2 large red onions, peeled", "1 (6-foot) seeded Italian loaf (special order)", "Red-wine vinegar", "1 shy quart (not quite a full 4 cups) mayonnaise (preferably Hellmann’s)", "2 pounds sliced provolone", "2 (6-ounce) cans sliced pitted California black olives", "24 large eggs, hard-boiled, peeled and sliced", "2 (12-ounce) jars sliced pickled jalapeños", "2 (12-ounce) jars sliced cubanelle or banana peppers", "Dried oregano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash and dry bell peppers, iceberg, tomatoes, celery hearts and parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grind artichokes in a food processor with the peeled garlic and a pinch or 2 of salt, until largely puréed but still textural, like tapenade. If a little loosening is needed, blend in a glug of olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife, shave celery crosswise. Transfer to a medium bowl, and add the artichoke purée. Season assertively with salt and pepper, plus a nice long drizzle of olive oil; toss well and then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice everything else that was washed and dried into the thinnest slices you can manage. Thinly slice the red onions into rings, then cut the rings in half to create half-moons. (Full rings of thinly sliced red onion have a tendency to become stringy as they wilt inside a sandwich, creating a bit of a choking hazard.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to assemble the sandwich (at least 1 hour before eating, though the assembled sandwich can sit up to 12 hours in a cool place), chop the parsley, and stir it into the artichoke-and-celery mixture. Taste that the mixture is highly seasoned to your liking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up an efficient workstation with enough counter space for the bread, and have all your mise en place in neat containers in front of you. If possible, put the vinegar, oil and mayonnaise into squeeze bottles, just as they do at delis and salad bars. Wear gloves to make separating slices of cheese and onion and tomatoes while assembling more “grippy.”"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Hinge the bread horizontally without slicing all the way through. Be assertive in butterflying the loaf open — like breaking the spine on an open book — in order for it to lie flat enough to receive all the fillings without your having to hold it open along the way."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Build by overlapping the ingredients, or “shingling” them, along the central channel of the hinged loaf in the following order: cheese, lettuce, tomato, bell pepper, artichoke-and-celery mixture, red onions, black olives, hard-boiled eggs, jalapeños and cubanelle peppers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously salt and pepper the whole thing, then zigzag squiggles of mayonnaise, squirts of vinegar and olive oil. Finish with a light dusting of oregano."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze the sandwich closed, and insert 8-inch wooden skewers, driving them in diagonally to prevent the sandwich from springing back open. Trim a couple of inches off each end, then serve and slice to order."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022332-six-foot-meatless-italian-hero"}