{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Baked Fish With Tartar Sauce", "description": "Charming fish shacks and salty sea air aren’t a weeknight possibility for most of us, but thankfully, this recipe is. It features a clever technique from recipe developer Molly Kreuger: Creamy tartar sauce is spread on the fish to add flavor, keep the fillets moist during cooking and help the bread crumbs adhere to the fish. (Feel free to use your favorite tartar sauce in place of the one below.) The fish is baked until nearly cooked through, then broiled to toast the breadcrumb topping. The end result is crispy, creamy, tangy and moist, all of which is achieved without having to deal with a big pot of oil. Eat with more tartar sauce and a squeeze of lemon.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2021/06/17/dining/as-oven-baked-fish/merlin_188895618_496972ec-76eb-4cf1-91fc-895ac13b1fdf-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, seafood, main course", "keywords": "bread crumbs, capers, fish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1110}, "recipeIngredient": ["1 cup mayonnaise", "5 tablespoons capers, drained and coarsely chopped", "1/4 cup finely chopped pickles (such as cornichons or half sour)", "2 tablespoons finely chopped tarragon, dill or parsley", "1 teaspoon Worcestershire or soy sauce", "1 small garlic clove", "1 large lemon", "Kosher salt and black pepper", "1/2 cup panko bread crumbs", "2 tablespoons extra-virgin olive oil, plus more for greasing", "4 (6-ounce) thick white fish fillets, such as halibut or cod (skin on or off)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees and set a rack in the upper part. In a medium bowl, stir together the mayonnaise, capers, pickles, herbs and Worcestershire sauce. Using a Microplane, finely grate the garlic into the bowl, then grate in the zest of the lemon. (Hold onto the lemon; you’ll use the juice later.) Stir to combine and season the tartar sauce to taste with salt and lots of pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together the panko and olive oil; season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the fish dry on all sides and season lightly all over with salt and pepper. Transfer to a lightly greased or foil-lined sheet pan. Coat the top with a thin layer of the tartar sauce (a scant tablespoon per fillet). Sprinkle the panko evenly on top (about 2 tablespoons per fillet), pressing gently to adhere."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the fish on the top rack until almost cooked through, 10 to 15 minutes for fillets between ½- and ¾-inch-thick (though you should check earlier, if using a thinner fish). An instant-read thermometer should read somewhere between 125 and 130 degrees when inserted into the thickest part of the fish. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add 1 tablespoon juice from the lemon to the tartar sauce and cut the remaining lemon into 4 wedges for serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the fish is nearly cooked through, switch the oven to broil. Broil the fish on the top rack until the bread crumbs are golden and the fish flakes easily and registers 140 degrees in the thickest part, 2 to 3 minutes. Eat with a spoonful of tartar sauce, more black pepper and a squeeze of lemon. (Any extra tartar sauce will keep for up to a week in the fridge.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022325-crispy-baked-fish-with-tartar-sauce"}