{"@context": "http://schema.org", "@type": "Recipe", "name": "Ka’ak el Eid", "description": "People all across the Arab world make some version of date-stuffed semolina cookies to celebrate both Muslim and Christian holidays. The recipes vary from country to country, even from family to family, as do the spicing, stuffing and cooking methods. But wherever you go, if you are served one of these cookies, you know it’s a call for celebration. This recipe is a Palestinian version in which the dough is fragrant from anise, fennel and nigella seeds. The cookies are also shaped into rings, making them easier to prepare than the ones made with molds or decorated with serrated edge tweezers. While they still require some effort, they keep quite well in an airtight container for several weeks and can be frozen for several months. One bite into the crispy, spiced crust with a soft date interior will make you understand just why they are worth the effort. ", "author": {"@type": "Person", "name": "Reem Kassis"}, "image": "https://static01.nyt.com/images/2021/07/14/dining/14EID-KA-Ak-El-a/merlin_190126692_87e5ca05-9a43-4725-b430-6f3e2b814250-articleLarge.jpg", "totalTime": "PT9H45M", "recipeYield": "About 35 round cookies", "recipeCuisine": "middle eastern", "recipeCategory": "snack, dessert", "keywords": "cinnamon, cookie, dates, freezer friendly, make-ahead, semolina flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 58}, "recipeIngredient": ["A scant 1 1/2 cups/250 grams semolina flour ", "2 cups/250 grams all-purpose flour", "1/2 cup plus 1 1/2 tablespoons/125 grams softened unsalted butter", "1/2 cup vegetable oil", "1 tablespoon nigella seeds (or unhulled sesame seeds)", "1 tablespoon ground aniseed", "1 tablespoon ground fennel seeds", "1 teaspoon baking powder", "1 teaspoon instant yeast", "1 teaspoon granulated sugar", "1/4 teaspoon salt", "1 cup warm water, plus more if needed", "Vegetable or olive oil, as needed for greasing", "1 pound/450 grams date paste (see Tip)", "1 teaspoon ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: In a large bowl, combine the semolina flour, all-purpose flour, butter and oil. Rub the ingredients between your palms until the mixture resembles wet sand. Cover and leave at room temperature overnight (or several hours). This allows the semolina to soften and fully absorb the butter and oil. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the dough: The next day (or several hours later), after your semolina mixture has rested, add the nigella seeds, aniseed, fennel, baking powder, yeast, sugar and salt to the semolina mixture and gently rub together with your hands. Add 1/2 cup warm water and start to gently knead for no longer than 2 minutes. The mixture will probably still be crumbly at this point. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gradually add remaining 1/2 cup water to the mixture in 1-tablespoon increments, and continue to knead for about 1 minute after each addition — making sure you don’t over-knead — until you can take a clump of dough in your fingers and it holds together. You may not need to use all the water, or you may need extra, a couple tablespoons at a time, depending on a variety of factors, like climate or flour. What you are looking for is a clump of dough to come together easily and not fall apart when you try rolling it into a log. Cover and let rest while you prepare the filling. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: Line a medium baking sheet with plastic wrap or parchment paper and grease with oil. Pour some oil in a small bowl that you will use to grease your hands as necessary. Put the date paste and cinnamon in a bowl and knead slightly with greased hands until evenly incorporated. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease your hands and tear out about 35 portions of filling, each about the size of a golf ball. On a flat surface, roll each into a string slightly thinner than your finger and about 4 to 5 inches long. Place on the greased baking sheet and cover with plastic wrap, then set aside until ready to use. This can sit at room temperature for a couple of days without any issue. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cookies: Heat oven to 400 degrees and line a couple of baking sheets with parchment. Take a golf ball-size piece of dough, keeping the rest of the dough covered to keep it moist, and roll it between your palms or on a flat surface into a sausage shape about 4 inches long. Using the tips of your fingers, gently press to flatten it. Take one of the date strings and place on top of the dough, cutting off as much as necessary for it to fit the dough. (Any cut off pieces can be used to extend shorter pieces or combined to make more filling strings.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Enclose the dough around the date filling and roll it on a flat surface into a slightly longer, thin sausage shape, about 8 to 9 inches long. Take one end and place it slightly overlapping the other end to form a ring shape. With a thin object (like a chopstick), press down all the way through to make two holes where the ends overlap to ensure they are firmly attached and won’t come apart during baking. Place on the prepared lined baking sheet and repeat until dough and filling are finished. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake cookies until a very light golden brown, about 15 to 18 minutes. Allow to cool for at least 15 minutes before moving to a wire rack to cool completely. Once cooled, transfer to an airtight container. Cookies will keep 2 to 3 weeks in an airtight container at room temperature, or up to 3 months in the freezer. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022331-kaak-el-eid"}