{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Seared Zucchini", "description": "A zucchini and a steak may not have much in common, but, like steak, zucchini takes incredibly well to the method of quickly searing in a smoking hot pan. Zucchini has a high water content, so cooking it fast means it retains its structure and doesn’t release too much water, and doing so over high heat yields a beautiful char. A quick baste with brown butter, rosemary and garlic adds even more steakhouselike flavor. The recipe calls for 1½ tablespoons butter, but feel free to use a bit more if you like. Finally, choose smaller zucchini if you can; they tend to be less watery, more flavorful, and contain smaller seeds than their larger counterparts. If you can only find larger zucchini (or if you only have a 10-inch skillet), use two zucchini instead of three to avoid crowding the pan.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2021/07/20/dining/lh-pan-seared-zucchini/merlin_190839579_f0034b36-fac8-4d01-b69c-3746c8fe571f-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, vegetables, side dish", "keywords": "brown butter, cast iron, zucchini, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 997}, "recipeIngredient": ["3 small zucchini (6 to 8 inches each) ", "1 tablespoon grapeseed, safflower or other high-heat cooking oil", "Kosher salt and black pepper", "1 1/2 tablespoons unsalted butter, plus more to taste", "1 garlic clove, peeled and smashed", "1 fresh rosemary sprig (or 1/4 teaspoon dried rosemary)", "Coarse sea salt, for serving", "Lemon zest, for serving", "Red-pepper flakes, for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the zucchini lengthwise on two opposite sides to create flat edges. Discard the scraps and cut the zucchini in half lengthwise into two planks that are about ½-inch thick. (If you’re using larger zucchini, you may get three planks from each one.) Pat them dry with a paper towel, pressing gently but firmly on both sides to absorb any moisture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large (12-inch) cast-iron or stainless-steel skillet over medium-high. Add the oil and heat until it’s almost smoking. Add the zucchini, spacing them evenly in the pan and pressing lightly with a spatula so that the planks make contact with the pan. Sprinkle the tops with salt and pepper, and cook for about 3 minutes, until the zucchini is nicely charred on the bottom. Lower the heat to medium, flip the zucchini, and season with salt and pepper again. Cook for 2 to 3 more minutes, until the bottom is charred. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to low and add the butter, garlic and rosemary. Carefully tilt the pan, letting the garlic and rosemary cook in the butter for 30 seconds to 1 minute, until the butter has begun to brown. Spoon the butter over the zucchini, and cook for another minute, flipping them a few times to coat both sides with the butter. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the zucchini to a serving platter, along with the garlic and rosemary, and spoon any butter that’s left in the pan on top. Top with coarse sea salt, lemon zest and red-pepper flakes, and serve hot. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022425-pan-seared-zucchini"}