{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Matzo Ball Stew", "description": "Matzo balls spiced with ginger and nutmeg transform this hearty, earthy stew into a nourishing one-pot dinner, reminiscent of chicken and dumplings but much lighter and simpler to make. The process of chilling the broth and skimming the fat is the only part requiring much attention, but it also means that this meal can be made almost entirely ahead of time. You can use the skimmed fat to add more flavor to the matzo balls, but if you don’t have the time, just use olive oil instead, or buy some schmaltz. If you have leftover Thanksgiving turkey, you can also use it here in place of the chicken, and skip Step 1. Just add enough stock so that the stew is the consistency you like.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2021/11/24/dining/19SOUPREX-chicken-matzo-ball-stew/merlin_197671461_ba1c5171-2c87-4c97-83e2-53709886e036-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "soups and stews, main course", "keywords": "chicken, matzo meal, plan-ahead, thanksgiving leftover, hanukkah", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 545}, "recipeIngredient": ["2 tablespoons olive oil", "1 large onion, peeled and cut in large chunks", "1 celery stalk, sliced in chunks", "1 turnip or parsnip, scrubbed, halved if large, and cut in thick slices", "Salt", "1 cut-up chicken with bones (about 4 pounds)", "2 carrots, peeled and cut in thick rounds", "1 cup fresh or frozen peas", "2 tablespoons chopped parsley or dill, for serving", "4 large eggs, beaten", "2 tablespoons schmaltz (from the stew) or vegetable oil", "1/4 cup plus 2 tablespoons chicken stock or vegetable stock", "1 cup matzo meal", "1/4 teaspoon ground nutmeg", "2 tablespoons freshly grated ginger", "2 tablespoons finely chopped parsley, dill or cilantro", "Coarse kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start the stew: Set a large (5-quart) heavy pot over medium-high heat, add the oil and then the onion, celery and turnip, and season with salt. Cook, stirring occasionally, until the onion is translucent, about 5 minutes. Add the chicken and cover with 5 cups of water, or enough to almost cover the chicken. Bring to a boil, reduce heat to maintain a simmer, and simmer for about 30 minutes, skimming any scum that rises. Cool, cover and refrigerate for at least a few hours, but ideally overnight. Scrape off and reserve 2 tablespoons chicken fat from the surface of the soup for the matzo ball mix. Freeze any remaining fat for another use. (You can substitute 2 tablespoons vegetable oil if you prefer.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the matzo ball mix (at least 3 hours before serving): Stir together the eggs, schmaltz or oil, stock, matzo meal, nutmeg, ginger and parsley in a large bowl until well mixed. Season with 1 teaspoon salt and a few grinds of pepper. Cover and refrigerate until chilled, about 3 hours, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 45 minutes before serving, finish the stew: Using your hands, break the chicken pieces into large-bite chunks, removing skin and bones as you go. Put the chicken back into the pot, bring to a boil, then reduce the heat and add the carrots and peas. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add heavy spoonfuls of the matzo ball mix to the top of the soup. (You should have about 18 balls.) Cover and simmer until the matzo balls are cooked through, about 20 minutes. Serve topped with fresh dill or parsley."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022776-chicken-matzo-ball-stew"}