{"@context": "http://schema.org", "@type": "Recipe", "name": "Arepas de Choclo With Avocado Salad", "description": "Arepas, corn cakes that are a cornerstone of Colombian and Venezuelan cuisines, come in many guises, depending on the region, the season and the available ingredients. This slightly sweet, cheese-filled version, called arepas de choclo, is adapted from “Colombiana” (HarperCollins, 2021), a cookbook by the Colombian food stylist Mariana Velásquez. The dough, which uses a combination of fresh corn kernels and yellow masarepa (precooked cornmeal), fries up into rich, moist, golden cakes that are like a more delicate version of the mozzarella-stuffed arepas found at street fairs. Ms. Velásquez pairs these with a lemony tomato and avocado salad to offer a soft and juicy contrast to the crisp-edged cakes. Perfect for a summery brunch, these also make an excellent light lunch or dinner. If you can’t find masarepa (P.A.N. is one brand available in large supermarkets), Ms. Velásquez recommends substituting instant polenta. But don’t use masa harina, which is a different product altogether.\n \nTo get vegetarian recipes like this one delivered to your inbox, sign up for <a href=\"https://www.nytimes.com/newsletters/the-veggie\">The Veggie</a> newsletter.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/07/21/dining/16apperex/merlin_190467327_eaa91f4b-de2c-467b-96f1-40a47dc642cd-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch", "keywords": "avocado, cast iron, cherry tomatoes, colombian, corn, food processor, ricotta, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 772}, "recipeIngredient": ["1 cup corn kernels (fresh or frozen, thawed)", "1 cup precooked yellow cornmeal, such as masarepa or instant polenta (see Tip)", "1 cup quesito or whole-milk ricotta", "1/2 cup grated Manchego or Parmesan (2 ounces)", "1/4 cup all-purpose flour", "3 tablespoons granulated sugar", "1 teaspoon baking powder", "1 teaspoon kosher salt (Diamond Crystal)", "3/4 cup whole or 2 percent milk", "3 tablespoons unsalted butter, melted, plus 3 tablespoons for frying", "2 medium Hass avocados, pitted, peeled and cubed", "2 cups halved cherry tomatoes", "Juice of 1 lemon", "1 tablespoon extra-virgin olive oil", "Salt and freshly ground black pepper", "1/2 cup torn fresh cilantro, for garnish", "1/2 cup crumbled quesito or queso fresco, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, process corn until kernels break down and mixture is smooth. Transfer ground corn into a large bowl, and add cornmeal, quesito, Manchego, flour, sugar, baking powder and salt. Using a wooden spoon, combine ingredients. Stir in milk and 3 tablespoons melted butter until just combined. Let the batter rest for 10 to 15 minutes to allow cornmeal to absorb the liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the batter rests, make the avocado salad: In a medium bowl, combine avocado and tomatoes. Add lemon juice and oil, and toss to combine. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large cast-iron skillet or griddle over medium-high. Melt 1 tablespoon butter until bubbles form. Scoop about 1/2 cup of batter onto the skillet or griddle, and, with the back of a spoon or offset spatula, spread batter into 4- to 5-inch rounds. Depending on the size of your skillet, repeat with batter, frying 2 arepas at a time. Do not crowd the pan. Cook until golden brown, 2 to 3 minutes per side. Transfer arepas to a paper towel-lined plate and tent foil on top to keep warm. Repeat with the remaining batter, adding more butter as needed. Reduce heat if pan is getting too hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top arepas with avocado salad. Garnish with cilantro and quesito, and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022409-arepas-de-choclo-with-avocado-salad"}