{"@context": "http://schema.org", "@type": "Recipe", "name": "Gruyère and Black Pepper Scones", "description": "A generous amount of Gruyère and toasty walnuts give these scones a savory richness, which is surprising and delicious. The little cubes of cheese melt into the dough as it bakes, but some sneak out the sides, creating irresistible bits of fricolike crispy cheese. To make the most of your time, you can toast the walnuts on a sheet pan in the oven for 5 to 10 minutes while it’s heating, just until they’re golden and fragrant. Chives freshen up the mix, but chopped fresh thyme or rosemary would work well, too. Eat the scones warm for maximum enjoyment.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2021/11/01/dining/ya-gruyere-and-black-pepper-scones/ya-gruyere-and-black-pepper-scones-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 scones", "recipeCuisine": "", "recipeCategory": "breakfast, snack", "keywords": "black pepper, butter, buttermilk, gruyère, scone, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 528}, "recipeIngredient": ["2 cups/256 grams all-purpose flour, plus more as needed", "1 tablespoon granulated sugar", "1 tablespoon baking powder", "2 teaspoons freshly ground black pepper, plus more for finishing", "1/2 teaspoon kosher salt (Diamond Crystal)", "8 tablespoons/113 grams unsalted butter, cold and cut into 1/2-inch cubes", "3 1/2 ounces/100 grams Gruyère cheese, chopped into 1/4-inch pieces", "3/4 cup/65 grams toasted walnuts, chopped", "2 teaspoons chopped fresh chives ", "1 cup/105 grams cold buttermilk, plus more as needed ", "Flaky salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a rack in the center of the oven and heat the oven to 400 degrees. Line a baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, add the flour, sugar, baking powder, black pepper and salt, and stir to combine. Add the butter to the bowl and toss to coat the cubes in the flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use your fingers to smash each cube of butter into a flat sheet, tossing to coat in flour and break up the butter a bit as you go. You will have some flat pea-size pieces of butter, and some will be worked into the flour completely. Add the cheese, walnuts and chives, and toss to combine. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a well in the center of the butter and flour mixture, and add the buttermilk. Very gently stir until just combined and shaggy, but don’t overmix. If the mixture seems very dry, add another tablespoon or two of buttermilk. If the mixture seems very wet, add a tablespoon or two of flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out onto a lightly floured surface and pat into a 1/2-inch-thick rectangle. Fold the rectangle in half, then shape it into an 8-inch circle. Cut the dough into 8 equal triangular wedges, and carefully transfer them to the baking sheet; they will be fragile. Brush the tops of the scones with the dregs of buttermilk left in the measuring cup (add a little more if necessary), then sprinkle the scones with flaky salt and more pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the scones until golden brown, 19 to 23 minutes. These are best the day they are made, but will last a day or two on the counter in an airtight container. Alternatively, let them cool completely, then transfer to an airtight container and freeze for up to a month. In either instance, warm before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022588-gruyere-and-black-pepper-scones"}