{"@context": "http://schema.org", "@type": "Recipe", "name": "Gâteau d’Hélène (Coconut Cake)", "description": "This coconut cake was adapted from a recipe by Simone (Simca) Beck, best known as Julia Child’s co-author on “Mastering the Art of French Cooking.” She called it “Gâteau d’Hélène: a white cake filled and iced with coconut cream and apricot.” The recipe, published in Ms. Beck’s 1972 book, “Simca’s Cuisine” (Lyons Press, 1998), capped what she called a “carefree lunch” because it could be made ahead. Indeed, this cake is best baked, filled, frosted and refrigerated for at least an hour (or up to two days). Kind of like a madeleine, its layers are purposefully a bit dry, as they need to hold a dousing of orange juice and rum. The whipped cream filling and frosting is soft and dreamy. It’s an elegant celebration cake.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2021/06/06/magazine/06mag-eat/06mag-eat-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "1 (8-inch) cake (about 8 servings)", "recipeCuisine": "french", "recipeCategory": "dessert", "keywords": "apricot preserves, heavy cream, layer cake, make-ahead, orange juice, party, rum, unsweetened coconut", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1135}, "recipeIngredient": ["3/4 cup/170 grams unsalted butter (1 1/2 sticks), at room temperature, plus more for greasing the pan", "1 1/2 cups/192 grams all-purpose flour, plus more for dusting the pan", "1 1/2 teaspoons baking powder", "1/4 teaspoon fine sea salt", "1 cup/200 grams granulated sugar", "Finely grated zest of 1 orange (save the juice for the filling)", "3 large eggs, at room temperature", "1/4 cup/60 milliliters orange juice", "2 tablespoons dark rum (or more orange juice)", "1/2 cup/160 grams apricot preserves", "1 1/2 cups/360 milliliters cold heavy cream", "1 teaspoon vanilla extract", "1/3 cup/66 grams granulated sugar", "1 1/2 cups/128 grams unsweetened shredded coconut"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Center a rack in the oven, and heat to 325 degrees. Butter an 8-inch springform pan. Line the bottom with parchment paper, and butter the paper; dust with flour and shake out the excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the flour, baking powder and sea salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with a mixer, beat together the butter, sugar and orange zest on medium speed for about 4 minutes, until pale and creamy. Add the eggs one by one, beating for 1 minute after each egg goes in, and scraping often."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the speed to low, and add half the flour mixture, beating until it almost disappears into the batter. Add the remaining flour mixture, and beat until it is incorporated. Give the batter a last stir with a spatula, then scrape it into the pan, smoothing the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 50 to 55 minutes, or until the cake is golden brown and a tester inserted into the center comes out clean. Transfer the pan to a rack, let the cake cool 20 minutes, then run a table knife along the edges and remove the pan’s sides. Invert the cake onto the rack, remove the bottom of the pan and the parchment, turn the cake over and cool to room temperature right side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the cake into three layers; flip the top layer so that the crumb is exposed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling and frosting: Stir together the orange juice and rum (if using), and using a brush or spoon, lightly moisten each layer with the liquid, then spread with apricot preserves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with a mixer, whip the cream just until it holds soft peaks, and add the vanilla. Working on medium speed, add the sugar in a slow, steady stream; stop beating when all the sugar is incorporated and the cream is firm. Spoon about 1/2 cup of the cream into a small bowl, and stir in about 2/3 cup of the shredded coconut. You’ll have a very thick mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the layer that was the top of the cake on a serving platter, jam side up, and cover with half the coconut cream. Top with the middle layer, jam side up, and spread with the remaining coconut cream. Place the last layer on the cake, jam side down. Using an icing spatula or a table knife, frost the entire cake with the remaining whipped cream, then coat with the remaining shredded coconut."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The cake can be served now, but it tastes and cuts better after it’s been refrigerated for at least an hour."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022278-gateau-dhelene-coconut-cake"}