{"@context": "http://schema.org", "@type": "Recipe", "name": "Risi e Bisi", "description": "The classic Venetian dish of rice and peas known as risi e bisi makes for a perfect springtime Sunday lunch. This version includes the addition of baby zucchini, which is an acknowledged departure from tradition but a mighty delicious one. The desired final consistency is loose, almost brothy, not tight and creamy like risotto nor drippy like a zuppa. The Venetians use the term “all’onda,” a reference to the swell of waves in the sea. Short-grain rice helps get that distinct starchy quality, but the rice can’t do the job by itself; there has to be stirring throughout. Pour yourself a glass of a good Soave while you stir. You can have a nap after lunch, which is totally traditional.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2021/03/18/magazine/18mag-eat-02/18mag-eat-02-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "brunch, dinner, lunch, grains and rice, main course", "keywords": "arborio rice, parmesan, peas, zucchini, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 897}, "recipeIngredient": ["5 cups Parmigiano-Reggiano rind broth or chicken broth", "3 tablespoons unsalted butter", "3 tablespoons extra-virgin olive oil", "6 scallions, roots trimmed, then sliced", "Salt and pepper", "12 ounces baby zucchini, cut into coins", "1 cup carnaroli or arborio rice", "3 garlic cloves, peeled", "10 ounces fresh shelled peas", "3 tablespoons freshly grated Parmigiano-Reggiano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat broth in a small pot on the back burner over medium-low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a wide, shallow, long-handled pan over medium-low. Melt 2 tablespoons butter and 2 tablespoons olive oil until butter foams. Set the remaining 1 tablespoon butter back in the fridge to keep cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add scallions, season with a pinch of salt and stir until sweated and soft, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add zucchini coins, season with a pinch of salt, and stir until they start to sweat, begin to soften and become a little translucent, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Push vegetables out to the edge of the pan in a ring, leaving an empty space in the center. Adjust heat — a tad hotter — then add the remaining 1 tablespoon olive oil, then rice. Stir rice until coated and glistening, and keep stirring until it begins sizzling slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Microplane the garlic over the sizzling rice, then draw the vegetables into the rice as well, stirring well to combine, leaving a little space — a moatlike ring — along the edges where the vegetables were."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the peas to the empty outer space you just created. Run your spoon through them, keeping them in their outer ring, coating them in the oil and moisture. Season the whole business with another pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle a generous cup of hot broth over the rice mixture in the center, seasoning with salt at each addition of broth, and stirring as the liquid is absorbed. Add another generous cupful of broth, stirring the rice while it absorbs. Repeat once more with a third cup of hot broth, stirring until the rice starts to show signs of its signature starchy and creamy nature. Keep the peas at the outer edge as much as possible. (This might remind you of making homemade pasta, when you are whisking the eggs in the well of the flour and very slowly drawing in the flour.) This entire step should take about 20 minutes. Adjust the heat slightly along the way for a very gentle, hot steaming — not hard simmering — stirring all the while."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining broth all at once. The peas and vegetables will slightly float on the surface, while the rice will naturally remain submerged. Stir gently or shake and swirl the pan in the classic cresting, swelling wave style, all’onde, bringing everything together — rice, zucchini, peas, broth — about 7 more minutes, maybe 10 at most."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off heat. Season assertively with black pepper. Stir or swirl in the remaining chilled butter, and finish with the grated cheese. Serve hot."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022094-risi-e-bisi"}