{"@context": "http://schema.org", "@type": "Recipe", "name": "Homemade Cracker Jack", "description": "A salty-sweet, caramel-coated popcorn often eaten at baseball games, Cracker Jack is one of the many well-known confections from Chicago. While molasses-covered popcorn was already popular in the Northeast, the creation of Cracker Jack’s special formula is credited to German brothers Frederick William and Louis Rueckheim. Besides coming up with the signature combination of popcorn, molasses and peanuts, they even devised a special package to keep it fresh and crisp. By the late 1800s, the snack was so loved that their company was producing four-and-a-half tons a day. This homemade version is best enjoyed the day it’s made, though it will keep for up to three days in an airtight container. Use large, red-skinned peanuts in this recipe if you can find them, as the skins lend a pleasant bitterness that works well with the molasses-caramel coating.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2022/04/21/autossell/homemade_cracker_jacks_thumb/homemade_cracker_jacks_thumb-mediumThreeByTwo440.jpg", "totalTime": "PT45M", "recipeYield": "About 16 cups", "recipeCuisine": "american", "recipeCategory": "candies", "keywords": "peanut, popcorn", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 281}, "recipeIngredient": ["3 tablespoons neutral oil, plus more for greasing the pans", "1/2 cup popcorn kernels", "1 cup roasted, salted red-skinned peanuts", "1 teaspoon pure vanilla extract", "1/4 teaspoon baking soda", "1/2 cup unsalted butter, chopped into pieces", "1 packed cup light brown sugar", "1/4 cup molasses ", "3/4 teaspoon kosher salt (Diamond Crystal), plus more for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 250 degrees and grease two large rimmed baking sheets with neutral oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 3 tablespoons neutral oil and 2 kernels to a large pot. Cover and heat over medium. Once you hear those first two kernels pop, add the remaining kernels, cover and cook, shaking occasionally, until the popping slows down, about 4 to 6 minutes. You should hear a few seconds of silence between pops. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the popcorn to a large, heatproof bowl and discard any unpopped kernels. Add the peanuts to the popcorn and toss to combine. Set the vanilla and baking soda near the stove for easy access."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, stir the butter, brown sugar, molasses and salt over medium until the butter melts. Once the butter has melted, attach a candy thermometer to the side of the pan and cook the mixture, undisturbed, until the temperature reaches 248 degrees. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat and immediately stir in the vanilla and baking soda. The mixture will become foamy. Immediately pour it over the popcorn and use a wooden spoon to coat it evenly. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the popcorn out onto the two prepared baking sheets. Bake until the mixture is dry, about 20 to 25 minutes, tossing occasionally. The mixture will dry out as it cools but may still be slightly sticky. Sprinkle with a bit more salt, to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the popcorn cool completely. It’s best enjoyed the day it’s cooked, but you can also store it in an airtight container for up to 3 days."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Homemade Cracker Jack", "description": "Samantha Seneviratne is showing us how to make Cracker Jack, that beloved salty-sweet treat. Its formula is credited to the German brothers Frederick William and Louis Rueckheim. Besides coming up with the signature combination of popcorn, molasses and peanuts, they devised a special package to keep it fresh and crisp. By the late 1800s, the snack was so loved that their company was producing four-and-a-half tons a day. That’s a lot of popcorn!", "thumbnailUrl": "https://static01.nyt.com/images/2022/04/21/autossell/homemade_cracker_jacks_thumb/homemade_cracker_jacks_thumb-mediumThreeByTwo440.jpg", "uploadDate": "2022-04-20T19:57:01.165Z", "duration": "PT6M38S", "transcript": "", "contentUrl": "https://vp.nyt.com/video/2022/04/20/100061_1_SS-homemade-cracker-jack-video_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022315-homemade-cracker-jack"}