{"@context": "http://schema.org", "@type": "Recipe", "name": "Buffalo Grilled Mushrooms", "description": "Mushrooms are at their best when cooked over high, unrelenting heat, which makes them ideal for grilling. So that they crisp instead of shrivel, toss them with more oil than you think is required and salt them only after they are cooked. As the mushrooms’ moisture disappears, their earthy umami concentrates and their outsides brown. They can be eaten on their own, added to any dish that you like mushrooms in, or tossed with a sauce that their spongelike texture will soak up. Here, that’s a spicy and silky <a href=\"https://cooking.nytimes.com/recipes/1019952-baked-buffalo-wings\">classic Buffalo sauce.</a> Top with parsley and blue cheese for crunch and coolness, then eat with your fingers or in buns. This method here works with most mushrooms, but avoid larger ones like portobellos, which, over such high heat, will burn before they’re cooked through.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2021/06/28/dining/28grillingrex8-WEB/merlin_189645714_d48bee9e-e32f-4eda-aec2-42e88e5278de-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, vegetables, main course", "keywords": "blue cheese, buffalo, mushroom, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 621}, "recipeIngredient": ["1 1/2 pounds medium to large mixed mushrooms (such as crimini, shiitake or maitake, or a combination; not portobello), stemmed", "Olive oil", "2 tablespoons Buffalo-style hot sauce, such as Frank’s", "1 large garlic clove, finely chopped", "Kosher salt and black pepper", "2 tablespoons unsalted butter, cubed and refrigerated", "1 1/2 ounces firm blue cheese, sliced or crumbled", "A few sprigs of parsley, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a charcoal grill for two-zone cooking over high heat by pouring the coals onto one half of the grill. For a gas grill, heat all the burners, then off turn one of the end burners before cooking. (See Tip.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the grill is heating, place the mushrooms in a large bowl, and drizzle them generously with olive oil (about 6 tablespoons). Put the hot sauce and garlic in a medium cast-iron skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to grill, bring the mushrooms, skillet, salt, cold butter, a tightly folded paper towel soaked with oil, oven mitt and tongs to the grill. (You want the butter to stay cold, so if you’re worried about it melting in the sun, bring it out in a cup over ice.) Clean the grates with a grill brush, then oil the grates with the paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the mushrooms gill-side up over the flame. Cook the mushrooms, turning occasionally, until well browned and tender, 6 to 15 minutes, depending on the size and type of the mushroom. For a gas grill, close the lid between flips, listening and keeping an eye out for flare-ups. If liquid collects in the mushrooms while cooking, move them to an area of the grill without fire beneath to avoid flare-ups, then flip and return to direct heat. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the mushrooms are almost done, add the skillet to an area of the grill without flame beneath, so that there’s indirect heat. Add the mushrooms to the skillet as they finish. Season lightly with salt and add the butter, stirring to combine until glossy. Season to taste with salt, pepper and more hot sauce, then top with blue cheese and, if using, parsley."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022341-buffalo-grilled-mushrooms"}