{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Steam Roast", "description": "Traditionally served at wedding banquets in Pakistan, the chicken steam roast has found its way into Punjab’s street food scene, and the recipe is replicated by home cooks all across the country. Marinated chicken legs steam slowly in their own juices in a deep pot with a little bit of fat. A tawa or thin metal griddle (a metal comal would also work) is used to temper heat from the stove so it can be applied evenly and for longer. Steam accumulating in the closed pot raises its temperature high enough to cook the chicken through. Patience and faith are key ingredients in this recipe. Resist checking on the chicken periodically and have some faith in the cooking process; you’ll ultimately be rewarded. The result: tender, flavorful, falling-off-the-bone chicken legs.", "author": {"@type": "Person", "name": "Zainab Shah"}, "image": "https://static01.nyt.com/images/2021/09/22/dining/17chickenrex/merlin_194652171_2bbe3336-29a8-4ba2-81ba-449ce2f1904c-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "4 to 6 servings", "recipeCuisine": "pakistani", "recipeCategory": "dinner, main course", "keywords": "chicken legs, greek yogurt, thai chili", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 638}, "recipeIngredient": ["1/4 cup full-fat Greek yogurt", "1/2 teaspoon paprika", "1 teaspoon ground coriander", "2 teaspoons ground cumin", "1/2 teaspoon ground turmeric", "2 teaspoons ground red chile", "1 teaspoon ginger paste or finely grated fresh peeled ginger", "1 teaspoon garlic paste or finely grated fresh garlic", "6 to 8 Thai green chiles, stemmed and chopped", "1/2 teaspoon fine sea salt", "6 bone-in chicken legs (3 to 4 pounds), skin removed, meat scored to the bone", "Ghee or neutral oil, for cooking", "Chopped cilantro, chile flakes, <a href=\"https://cooking.nytimes.com/recipes/1022061\">mint chutney</a> and lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the yogurt, spices, ginger paste, garlic paste, chopped green chiles and salt in a large bowl to make a pasty marinade. Add the chicken and thoroughly rub the marinade into the meat. Cover and refrigerate for at least 2 hours or up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a tawa, griddle or comal on the stove if you have one and center a large stock pot or Dutch oven on top of it. Otherwise, place the pot directly on the stove. The stock pot or Dutch oven should be large enough to hold the chicken pieces in a single layer, and deep enough to gather steam. Add enough ghee to coat the bottom of the pot, then add the chicken in one layer, meatier side down. Cover and cook on medium for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to the lowest setting and continue cooking for another 20 minutes. Flip the chicken and continue cooking, covered, for another 30 minutes. Remove the lid. Cook on medium until the juices in the pot have mostly evaporated, 10 to 12 minutes. Transfer the chicken to a serving platter and pour any juices from the pot over the chicken. Garnish with cilantro and chile flakes and serve with chutney and lemon wedges for squeezing."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022555-chicken-steam-roast"}