{"@context": "http://schema.org", "@type": "Recipe", "name": "Devil’s Food Cake With Hazelnut Praline", "description": "The best thing about chocolate cake is that it doesn’t really need a specific season or, arguably, a specific reason to be made. The malted cream and hazelnut praline make this cake what you could call “pure joy” in dessert form. You’ll make more smooth praline than you need; keep any extra in a jar in the fridge to spread onto toast, or to mix with cocoa powder for a Nutella-esque experience. You surely won’t regret it.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2021/12/15/dining/10Ottorex/merlin_198057777_396b3769-07ea-45ba-b3e2-87607f8f4441-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "dutch-processed cocoa powder, hazelnuts, kefir", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 592}, "recipeIngredient": ["5 1/3 ounces/150 grams sunflower oil (by weight not by volume), plus more for greasing the pan", "3/4 cup/75 grams unsweetened Dutch-processed cocoa powder", "1 1/2 cups/192 grams all-purpose flour (plain flour)", "1 teaspoon baking powder", "1 teaspoon baking soda (bicarbonate of soda)", "1 teaspoon salt", "1 cup/200 grams superfine sugar (caster sugar) or granulated sugar", "1/2 lightly packed cup/100 grams dark brown sugar", "2 large eggs", "1/2 cup plus 1 tablespoon/150 grams plain kefir (or buttermilk)", "3/4 cup plus 3 tablespoons/220 grams very hot coffee, plus 1 tablespoon/14 grams at room temperature, for brushing", "1 1/2 cups/200 grams blanched hazelnuts", "3/4 cup plus 2 tablespoons/180 grams superfine sugar (caster sugar) or granulated sugar", "1/4 teaspoon salt", "1 1/4 cups/300 grams cold heavy cream (double cream)", "1/3 cup plus 1 tablespoon/95 grams mascarpone", "2 tablespoons malted milk powder, such as Horlick’s", "1/4 cup plus 2 teaspoons/30 grams confectioners’ sugar (icing sugar)", "Tiny pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 200 degrees Celsius (nonfan)/375 degrees Fahrenheit. Line the bottom of 2 (20-centimeter/8-inch) cake pans (tins) with a removable base with parchment paper and grease the sides. Alternatively, grease the bottoms and sides of 2 (20-centimeter/8-inch) regular cake pans, line with parchment, and grease the parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together cocoa, flour, baking powder, baking soda, salt and sugars. In a separate bowl, add the oil, eggs and kefir, and whisk just to combine. Add to the dry mixture and use a spatula to gently fold through. Add the 3/4 cup plus 3 tablespoons/220 grams hot coffee and mix gently to combine. It’ll look very runny at first, but will soon come together into a glossy, pourable batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the batter evenly between the two cake pans, about 21 ounces/600 grams per pan. Bake for 30 minutes or until a skewer inserted into the middle comes out clean. Set aside to cool for about 30 minutes, then slide a butter knife along the sides to help release the cake. Brush the tops lightly with the remaining 1 tablespoon/14 grams extra coffee (discard any extra)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Invert one cake onto a board, remove the parchment, then invert it again onto a cake stand or the platter you intend to serve it on (domed side up now). Invert the other cake onto a board (don’t remove the paper). Invert it again, onto a plate, so that it’s paper side down. (This will help prevent it from sticking.) Set both cakes aside to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the praline: With the oven still at 200 degrees Celsius/375 degrees Fahrenheit, spread the hazelnuts onto a parchment-lined medium baking sheet (tray) and bake for 12 to 15 minutes, or until deeply golden, shaking the pan halfway through baking. Set aside, keeping the tray and parchment paper. You’ll use them again later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large saucepan over a medium-high heat and, once quite hot, sprinkle in a third of the caster sugar to cover the base. It should immediately start to melt at the sides but not brown too quickly. Swirl the sugar in the pan a little, then add another third of the sugar, allowing it to melt a little before adding the remaining third. Turn the heat down to medium and cook until the sugar is an amber caramel, stirring with a spatula just a couple times (but not much more). Add the hazelnuts and 1/4 teaspoon salt, stirring to coat, then quickly transfer the mixture to your parchment-lined tray and leave to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cool, roughly break apart the praline and add it to a food processor. Pulse a few times until you have very coarse crumbs, then measure out about 1/2 cup/75 grams of the mixture and transfer to a bowl. Blitz the remaining mixture in the food processor for about 5 minutes or until it turns into the consistency of a smooth nut butter, stopping to scrape the inside of the bowl as necessary. Transfer this to a separate bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the mascarpone cream: Add all the ingredients to a stand mixer and beat on medium-high speed for 1 1/2 to 2 minutes, or until you have medium peaks. Refrigerate if not assembling right away (you want it nice and cold)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to assemble, top the cake on your cake stand with half the cream mixture. Spoon over about 2 tablespoons of the smooth praline and gently swirl it through the cream with your spatula. Top with another 2 tablespoons of the praline, this time without swirling. Sprinkle with half the praline crumble. Carefully invert the other cake on top now, removing the paper. Top with the remaining cream and repeat the same process with the smooth praline and praline crumble. Serve right away, or refrigerate overnight to firm up the cream before serving. (The cake will keep refrigerated for up to 3 days.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022804-devils-food-cake-with-hazelnut-praline"}