{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Pizza", "description": "Neapolitan-style pizza is typically baked in ovens heated past 900 degrees to achieve its signature crackly, thin, charred crust with a moist, stretchy crumb. But you can easily yield similar textures and flavors at home by baking pizza dough directly on the grates of a hot grill until it’s bubbly and crisp. Once the dough is baked, it can be topped and finished via indirect heat. Because grilled pizzas cook mainly from below, the cheese should be layered underneath dollops of hand-crushed tomatoes and toppings to get a good melt.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2021/08/16/dining/16kenji-2/16kenji-2-articleLarge-v3.jpg", "totalTime": "PT2H45M", "recipeYield": "3 (10-by-12-to-14-inch) pizzas", "recipeCuisine": "", "recipeCategory": "pizza and calzones, main course", "keywords": "mozzarella, pizza dough, plum tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 286}, "recipeIngredient": ["1 pound store-bought pizza dough (defrosted overnight in the fridge, if frozen)", "All-purpose flour, for dusting", "Neutral oil, such as canola or grapeseed", "1 (28-ounce) can whole peeled plum tomatoes", "Kosher salt", "1/4 cup extra-virgin olive oil", "1 pound low-moisture block mozzarella (see Tips)", "Toppings, as desired (see Tips)", "Roughly chopped fresh basil leaves or thinly sliced scallions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Two to three hours before grilling, transfer the dough to a lightly floured work surface. Using a sharp knife or a bench scraper, divide the dough into three even pieces. Drizzle a teaspoon of neutral cooking oil into three soup bowls. (Each bowl should be able to hold at least twice the volume of the dough pieces.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one piece of dough at a time, shape each into a ball by stretching it and pinching it into a point at the bottom, forming a sort of “skin” that wraps the whole ball. Lightly dust your hands with flour as necessary to prevent excessive sticking. Transfer the ball to one of the oiled bowls and turn it a few times to completely coat the surface in oil, then let it rest seam side down. Repeat Step 2 with remaining dough pieces, then drape a damp kitchen towel over all three bowls. Let the dough balls rest until roughly doubled in volume, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the tomatoes to a fine-mesh strainer set over a large bowl and shake the strainer, allowing the tomatoes to drain thoroughly. Still working in the strainer above the bowl, season well with salt, and, using clean hands, squeeze them through your fingers until a rough purée is formed. (The pieces of tomato should end up ranging from 1/4 inch to roughly 1 inch in size.) Allow any excess liquid to drain (you can save the strainer tomato juice for another use), then transfer the crushed tomatoes to a bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn out one ball of dough onto a floured work surface and dust thoroughly with more flour. Using a rolling pin, roll the dough into a 10-inch-by-12-to-14-inch oblong. Dust both sides thoroughly with flour, then transfer to a parchment-lined rimmed baking sheet. Repeat with remaining two dough balls, stacking them on top of the first with a layer of parchment paper between each."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook, ignite a full chimney of charcoal. When the coals are mostly covered in gray ash, spread evenly under half of the grill. (If using a gas grill, set half the burners to high, leaving the remaining burners off. Cover, and allow to heat for 10 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your fingers, carefully lift one piece of rolled-out dough from the stack and drape it quickly on the grill grates directly above the fire. Let it cook without moving until the top starts to bubble and the bottom is lightly browned, about 20 to 30 seconds. Continue cooking, using metal tongs and a large spatula or thin metal pizza peel to move and rotate the crust as it cooks, until the bottom is evenly browned all over with a few charred spots, 1 to 3 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flip the crust, and brush the cooked side with a thin layer of olive oil. Continue cooking until the second side is browned, charred and crisp. Flip again (so that the bubblier side faces up), transfer to a clean baking sheet, and brush the second side with olive oil. Repeat Steps 6 and 7 with remaining two pizza skins, stacking the crusts as they finish cooking. (If using coal, the heat may start to dip. Extend cooking time to compensate, or add 15 to 20 fresh coals to the top of the embers and allow them to ignite before continuing.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working one pizza at a time, transfer the crust to the pizza peel. (A cutting board or the back of a baking sheet will also work.) Spread a thin layer of shredded cheese across the surface of the crust (about 1 cup should do it). Using a spoon, add tablespoon-size dollops of crushed tomatoes, spaced an inch or two apart, across the whole surface of the pizza. Add toppings as desired (see Tips). Slide the pizza onto the cooler side of the grill, cover, and cook until the cheese is melted and the crust is crisp, 1 to 5 minutes total, rotating the pizza occasionally to encourage even melting and crisping. Transfer to a cutting board, drizzle with olive oil, sprinkle with basil or scallions, cut into squares, and serve immediately. Repeat Step 8 with remaining pizza crusts."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022460-grilled-pizza"}