{"@context": "http://schema.org", "@type": "Recipe", "name": "Hashweh (Spiced Rice and Meat With Yogurt)", "description": "Hashweh means stuffing in Arabic, hence the name of this dish that is used to fill chicken, lamb, pigeon and almost any other poultry or meat that can be stuffed. The combination of warm spices, fluffy rice and tender meat with the crispy, fried nuts is so delicious, it has become a meal in its own right. For a more elaborate presentation, you can top it with shredded chicken or lamb. Whichever way you serve it, you’re in for a real treat, with a recipe so simple it can easily make its way into your weekly dinner rotation. Hashweh pairs perfectly with a salad of finely chopped cucumbers, tomatoes and onions dressed with lemon, olive oil, salt and some dried mint.", "author": {"@type": "Person", "name": "Reem Kassis"}, "image": "https://static01.nyt.com/images/2021/11/08/dining/rk-hashweh2/merlin_197539866_3741a684-6eb5-493b-a312-d2f69993b230-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, stuffing and dressing, main course, side dish", "keywords": "ground lamb, pine nuts, rice, yogurt, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 158}, "recipeIngredient": ["2 1/2 teaspoons ground allspice", "1 1/2 teaspoons ground cinnamon", "1/2 teaspoon black pepper", "1/2 teaspoon ground nutmeg", "2 3/4 cups calrose, jasmine or basmati rice", "2 tablespoons unsalted butter or ghee", "2 tablespoons olive oil, plus more for nuts", "1 1/2 pounds ground or minced lamb or beef (see Tip)", "4 scant cups homemade or store-bought chicken stock", "Salt", "1/2 cup/3 ounces pine nuts", "1 cup/4 ounces slivered almonds", "2 Persian or other mini cucumbers", "Salt", "1 1/2 cups plain Greek yogurt", "1 garlic clove, crushed", "1/2 teaspoon lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the rice: Mix together allspice, cinnamon, black pepper and nutmeg and set aside. Rinse rice in a colander until the water runs almost clear, then soak in cold water for 15 minutes. Drain and let stand for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While rice soaks and drains, heat butter and olive oil in a large Dutch oven or nonstick pot over medium-high. Once the butter starts to sizzle, add half of the spice mixture and fry for a few seconds until fragrant. Add meat and cook, breaking the meat up finely with a wooden spoon, until any released water evaporates and the meat is nicely browned, 10 to 15 minutes. (It is important for the meat to be in small even-size pieces.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add drained rice to the pot, along with remaining spices, and stir to combine and coat with the oil. Pour in the stock and bring to a boil. Taste for seasoning: the stock should be saltier than you would like your finished dish to be, so add more salt to your liking, but do so generously."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the mixture boils, lower the heat to maintain a simmer, cover the pot and cook until the liquid has mostly evaporated but the rice is still easy to stir with a spoon and not sticking to the bottom, 8 to 12 minutes. Give the rice a final mix, turn off the heat, then wrap a clean tea towel or paper towels around the lid and cover again. (The towel will absorb excess moisture.) Let sit to steam in the residual heat for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the rice cooks, prepare the topping: Place a small skillet over medium-high and pour in enough oil to thinly coat the bottom (1 to 2 tablespoons). Add pine nuts and stir to coat evenly with the oil. Reduce heat to heat to low and continue to stir until nuts are a light golden color, about 4 minutes. Remove from the heat and drain nuts on a plate lined with paper towels. Repeat with slivered almonds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the rice rests, make the yogurt: Coarsely grate the cucumber and place in a colander in the sink. Sprinkle with salt, mix and set aside for 10 minutes to allow juices to drain. Give the cucumbers one final mix, pressing on them with the back of a spoon to ensure any excess liquid drains. Transfer to a bowl and add the yogurt, garlic and lemon juice and season with salt. Whisk until well combined, taste and add more salt if you’d like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fluff rice with a large fork, transfer to a serving platter and top with toasted nuts. Serve, passing the yogurt around for each person to place a dollop over their rice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022749-hashweh-spiced-rice-and-meat-with-yogurt"}