{"@context": "http://schema.org", "@type": "Recipe", "name": "Party Wreath", "description": "This party-size vegetarian version of a sausage roll takes a bit of inspiration from potato- and pea-filled samosas: The filling is a coarse mash of peas and potato mixed with fresh ginger and green chiles, along with cumin, fennel and sesame seeds. Seasoned with lemon juice and garam masala, it has a tangy, gently spicy flavor that’s even more sumptuous when it’s wrapped in buttery store-bought puff pastry. Be sure to cut the roll almost all the way to the inner edge before sliding it into the oven, so that the baked pieces are easy to tear away. Serve with <a href=\"https://cooking.nytimes.com/recipes/1021355-green-chile-chutney\">green chutney</a>, <a href=\"https://cooking.nytimes.com/recipes/1021357-tamarind-chutney\">tamarind chutney</a>, a squirt of Maggi ketchup, or just as is, with a few wedges of lemon or lime on the side.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2021/10/31/magazine/31mag-eat-site/31mag-eat-site-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "finger foods, appetizer", "keywords": "christmas, new year’s day, thanksgiving, party, peas, puff pastry, serrano, yukon gold potato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 912}, "recipeIngredient": ["1 medium Yukon Gold potato, peeled and halved", "1 (1-inch) piece fresh ginger, peeled", "2 serrano chiles, stemmed", "2 cups green peas (fresh or thawed frozen)", "1 tablespoon neutral oil", "2 tablespoons sesame seeds", "1 tablespoon fennel seeds", "1 teaspoon cumin seeds", "1/4 cup fresh mint leaves, roughly chopped", "1 teaspoon garam masala", "Kosher salt", "Lemon juice", "All-purpose flour, for dusting", "1 (14-ounce) sheet puff pastry (fresh or thawed frozen)", "1 tablespoon milk", "Green chutney, tamarind chutney or Maggi ketchup, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Boil the potato halves until tender, about 15 minutes. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, grind the ginger and serrano chiles until very fine, then add the peas and grind just a little, to get a coarse mash. Tip the pea mixture into a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pan over medium, heat the oil and add 1 tablespoon sesame seeds, the fennel and cumin, and toast until light golden, about 1 minute. Pour into the bowl with the peas. Add the mint, garam masala and potato, and mix well, breaking up the potato. Season to taste with salt and lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working on a lightly floured sheet of parchment paper, cut the puff pastry lengthwise into two equal rectangles, and roll gently with a floured pin to flatten creases. Use your hands to squash half the pea mixture into an even snake of filling down one pastry rectangle, from one end to the other, then roll the pastry lengthwise around it to seal it into a tube, cutting off any overlapping dough and pinching the seam tightly to close. Repeat with the other pastry, then transfer the parchment to a sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Join the two tubes in a circle, seam sides down. Use a knife to make cuts at an angle every 3/4 inch or so, going all the way through the filling but leaving a bit of pastry still connected in the innermost circle. Pinch and turn each segment to slightly point the filling upward, opening the pieces like petals. Brush the dough tops lightly with milk and sprinkle with the remaining 1 tablespoon sesame seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 45 minutes, or until the pastry is completely cooked through and golden brown. Serve warm or at room temperature, with green chutney, tamarind chutney or Maggi ketchup."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022694-party-wreath"}