{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Chickpea Pancakes With Roasted Mushroom Salad", "description": "Italian farinata are simple pancakes made from chickpea flour, which gives them a deep, nutty flavor and unexpectedly luxurious texture. Make sure to use an ovenproof pan so you can finish the pancake in a hot oven to give it golden, crisp edges. Top the farinata however you like — roasted vegetables, a dressed salad, a mix of fresh herbs — or even eat it plain, with a cold drink, just before dinner. But a mix of roasted mushrooms and radicchio seasoned simply with vinegar and olive oil is perfect in the fall.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2021/10/03/magazine/03mag-eat-web/03mag-eat-web-articleLarge.jpg", "totalTime": "PT2H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, pancakes, appetizer, main course", "keywords": "chickpea flour, mushroom, gluten-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 347}, "recipeIngredient": ["1 cup warm water, plus more as needed", "1 cup chickpea flour", "1 teaspoon kosher salt (Diamond Crystal)", "1 teaspoon freshly ground black pepper", "6 tablespoons extra-virgin olive oil", "1 pound mixed mushrooms, such as cremini and shiitake", "3 tablespoons extra-virgin olive oil", "1/2 teaspoon kosher salt (Diamond Crystal)", "1/2 small head radicchio", "1/2 tablespoon sherry vinegar", "Pinch of flaky sea salt, such as Maldon", "Few grinds of black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pancake batter: Pour the warm water into a large mixing bowl and gradually whisk in the chickpea flour in small amounts to avoid lumps. Add the salt, pepper and 2 tablespoons oil, and whisk again until smooth. The batter should be the consistency of heavy cream. If it’s too thick, whisk in more warm water, 1 tablespoon at a time. If the batter is lumpy, use an immersion blender or blender to get it nice and smooth. Set the batter aside at room temperature for about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the topping: Position racks near the top and bottom of the oven, and heat oven to 450 degrees. Roughly chop or tear the mushrooms and toss with 2 tablespoons oil and the kosher salt on a sheet pan. Spread the mushrooms in an even layer and roast on the top rack for about 20 minutes, or until lightly browned, mixing the mushrooms midway so they cook evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the pancakes: Heat 2 tablespoons oil in an 8- or 9-inch frying pan with an ovenproof handle over medium. When the oil is hot, swirl it to evenly coat the bottom of the pan and pour in half the chickpea batter. It should be about 1/4 inch deep. When the bottom is set, after about 1 minute, slide the pan onto the lower oven rack and bake for about 10 minutes, or until the edges are golden brown and crisp, but the center is still tender. Use a spatula to release the edges and slide it onto a cutting board. Repeat with the remaining 2 tablespoons oil and the remaining batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tear the radicchio leaves into bite-size pieces, then add to the sheet pan of slightly cooled mushrooms along with the vinegar and remaining tablespoon oil. Season with the flaky salt and black pepper, and mix well. Cut the pancakes into squares, transfer to serving plates, top with the mushroom mix and eat while still warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022596-crispy-chickpea-pancakes-with-roasted-mushroom-salad"}