{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Cake With Peppermint Frosting", "description": "Dutch-process cocoa and a bit of espresso powder give this simple one-bowl cake deep chocolate flavor without much effort. The generous swoop of fluffy peppermint buttercream frosting makes it a festive treat. A bit of optional red food coloring gives the frosting those classic peppermint candy stripes, and you can dress the cake up even more with sprinkles and shaved chocolate for a special occasion. The oil in the cake makes it extra moist, and it keeps well on the counter for a few days — if it lasts that long.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2022/11/22/dining/ya-chocolate-cake-with-peppermint-frosting1/merlin_217071231_09c52af1-dcb1-456b-89c6-52ed9821ad40-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "One 8-by-8-inch square or 9-inch round cake", "recipeCuisine": "", "recipeCategory": "cakes, dessert", "keywords": "butter, cocoa powder, make-ahead, one bowl, peppermint extract, sugar, christmas, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 813}, "recipeIngredient": ["1/2 cup/105 grams grapeseed or other neutral oil, plus more for pan", "1 1/4 cups/250 grams granulated sugar", "2 large eggs", "1 (8-ounce/227-gram) container sour cream", "1 1/2 teaspoons pure vanilla extract", "3/4 teaspoon kosher salt (Diamond Crystal)", "3/4 cup/68 grams Dutch process cocoa powder, sifted if lumpy", "1 cup/128 grams all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1 teaspoon instant espresso powder", "1/4 cup/55 grams hot water", "1/2 cup/113 grams unsalted butter, softened", "2 cups/200 grams sifted confectioners’ sugar", "2 teaspoons heavy cream or milk, plus more if needed", "1 teaspoon vanilla extract", "3/4 teaspoon peppermint extract, plus more if desired", "Pinch kosher salt (Diamond Crystal)", "Red gel food coloring (optional)", "Shaved chocolate and sprinkles, for decorating (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Set a rack in the center of the oven and heat oven to 350 degrees. Generously grease an 8-by-8-inch square or 9-inch round light-colored metal baking pan with oil. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the granulated sugar and eggs. Use a whisk or an electric mixer to beat the mixture until foamy and slightly lighter in texture and color, 1 to 2 minutes. Add the sour cream, 1/2 cup oil, vanilla and salt, and whisk until combined and smooth, about 1 minute. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in the cocoa powder until combined. Add the flour, baking powder and baking soda, and whisk until combined and no streaks of flour remain. Stir the espresso powder into the hot water, then add the mixture to the bowl. Whisk until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan and tap on the counter a few times to release any large air bubbles. Bake until puffed and a toothpick inserted into the center comes out clean, 35 to 40 minutes. Let the cake cool in the pan set on a rack for about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake bakes, clean the mixing bowl and make the frosting: Add the butter to the bowl and mix on medium-high with an electric mixer until smooth, stopping the mixer occasionally to scrape the bottom and sides of the bowl. Turn the speed to low, and slowly add the confectioners’ sugar. Mix until the sugar is moistened, then add 2 teaspoons of the cream, the vanilla extract, 3/4 teaspoon peppermint extract and salt. Turn the speed up to medium-high, and whip until smooth and fluffy, about 3 minutes, adding a bit more cream a teaspoon at a time, if necessary, to make a smooth and light frosting. Taste the frosting, and add a few more drops of peppermint extract if desired. The frosting can be kept at room temperature while the cake finishes baking and cooling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top the cooled cake with an even layer of frosting, then use the tip of a toothpick to dot the frosting with a few small dots of gel food coloring, if using. Use a spoon or offset spatula to swirl the food coloring into the frosting to create candy cane-like stripes — just a few swipes will do the trick. If you mix it in too much, the frosting will turn pink. Top the cake with sprinkles and shaved chocolate, if desired. Store leftover cake loosely covered at room temperature for up to 3 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022798-chocolate-cake-with-peppermint-frosting"}