{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Chicken Thighs With Garlicky Cucumber Yogurt", "description": "In this simple, homey weeknight dinner, boneless chicken thighs are tossed with garlic, herbs and red-pepper flakes, then roasted along with lemon wedges in the pan. As the lemons brown, their acids mellow, becoming softer and sweeter. When squeezed over the chicken for serving, they offer a rounded tang that’s complemented by dollops of cucumber-flecked yogurt and chopped fresh mint. The combination of cucumbers and yogurt is a classic across many cultures, from Indian <a href=\"https://cooking.nytimes.com/recipes/1015024-cucumber-raita\">raita</a> to Persian <a href=\"https://cooking.nytimes.com/recipes/1020213-mast-o-khiar-persian-cucumber-and-herb-yogurt\">mast-o khiar</a> to Greek <a href=\"https://cooking.nytimes.com/recipes/1016438-tzatziki\">tzatziki</a> and beyond. For this recipe, be sure to use thick Greek-style or other strained yogurt (such as labneh) or substitute sour cream. Thinner yogurt will make the sauce runny. Serve this over rice or with flatbread to catch the juices and the cucumber yogurt.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/09/29/dining/24Appe1/merlin_194652018_a1b38a9e-1ac1-41aa-8fed-24674bdf5f47-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, main course", "keywords": "cucumber, greek yogurt, roast chicken", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1575}, "recipeIngredient": ["2 1/4 to 2 1/2 pounds boneless, skinless chicken thighs ", "Salt and freshly ground black pepper", "4 garlic cloves, finely grated, minced or passed through a press", "1 tablespoon finely chopped fresh thyme or oregano leaves, or 1 teaspoon dried thyme or oregano", "Large pinch of red-pepper flakes, plus more for serving", "3 tablespoons extra-virgin olive oil, plus more as needed", "1 lemon, cut lengthwise into thin wedges", "1/2 cup plain Greek or other strained, thick yogurt (or substitute labneh or sour cream)", "1/2 cup grated seedless cucumber, such as Persian or hothouse cucumbers (see Tip)", "2 tablespoons chopped fresh mint (or use parsley or cilantro), for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Season chicken generously with the salt and pepper. In a large bowl, combine 3 of the grated garlic cloves, thyme or oregano, red-pepper flakes and olive oil. Add chicken and lemon wedges, and toss until well coated. (If you want to work ahead, you can refrigerate the chicken for up to 12 hours before roasting.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange chicken and lemons on a sheet pan in a single layer. Drizzle with a little more oil and roast until chicken is cooked through, 27 to 35 minutes. If you’d like more color on your chicken, run the pan under the broiler for 1 to 2 minutes until chicken is lightly charred in places."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the chicken roasts, stir together yogurt, grated cucumber and remaining minced garlic clove in a small bowl. Season to taste with salt and pepper. Cover and keep in refrigerator until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, squeeze roasted lemon wedges all over chicken, and sprinkle with mint and more red-pepper flakes, if you like. Serve chicken accompanied by cucumber-yogurt sauce and a drizzle of olive oil over everything."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022572-roasted-chicken-thighs-with-garlicky-cucumber-yogurt"}