{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Mushroom Skewers in Red Chile Paste", "description": "Fire up the grill and let the aromas of vegetables and chile-marinated mushrooms charred over an open flame permeate the neighborhood. This simple recipe is fun to assemble, and a crowd pleaser, making it ideal for cookouts. Meaty king oyster mushrooms are smothered in a guajillo chile sauce that includes earthy achiote, which stains the mushrooms red. Liquid aminos or soy sauce add saltiness and umami, and maple syrup brings a touch of sweetness. If you don’t have the vegetables below on hand, you can easily swap them out for others that will cook in the same time frame. Serve this as a main dish with your favorite cooked grains or salad, or as a side dish to just about anything.", "author": {"@type": "Person", "name": "Jocelyn Ramirez"}, "image": "https://static01.nyt.com/images/2021/06/01/dining/jr-mushroom-skewers/merlin_188546361_d3a9ab60-84d2-458c-b260-80b18c4e9d51-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, vegetables, main course, side dish", "keywords": "bell pepper, cherry tomatoes, guajillo chiles, mushroom, zucchini, summer, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 231}, "recipeIngredient": ["12 bamboo skewers (each about 8 inches long)", "4 medium guajillo chiles, stemmed, seeded and rinsed", "2 garlic cloves, peeled", "Salt and black pepper", "2 large yellow or orange bell peppers, cut into 1-inch dice", "2 large zucchini, cut into 1/2-inch-thick coins", "10 ounces cherry tomatoes (about 20)", "1/4 cup plus 1 tablespoon neutral-flavored oil, plus more if needed", "1 tablespoon achiote paste (see Tip)", "1 tablespoon liquid aminos or soy sauce", "1 1/2 teaspoons pure maple syrup", "1/2 teaspoon ground cumin", "12 ounces king oyster mushrooms (about 10)", "1 lemon, halved", "Flaky sea salt, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If cooking outdoors, prepare a charcoal grill or heat a gas grill to medium-high. Soak the bamboo skewers in cold water. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 1 cup water to a boil in a small saucepan over high heat. Add the chiles, garlic and a pinch of salt. Cover partially, reduce the heat to medium-low and simmer until the chiles have rehydrated and the garlic has softened, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chile mixture simmers, coat the bell peppers, zucchini and tomatoes with 1 tablespoon oil in a large bowl; season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, transfer the rehydrated chiles and softened garlic to a blender or food processor along with 1/2 cup of the cooking liquid. Add the achiote paste, liquid aminos, maple syrup, cumin and remaining ¼ cup oil, and blend until completely smooth. Transfer to a large bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut off the mushroom caps and cut the stems into 1/2-inch-thick coins. Halve or quarter the caps to match the diameter of the stems. Add the mushrooms to the chile paste and mix until coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, load the vegetables onto all the skewers. Start and end each skewer with a piece of bell pepper and alternate among the mushroom slices, bell peppers, zucchini coins and tomatoes in between, going heavy on the mushrooms. Brush any remaining paste over the mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If cooking outdoors, set the skewers on the hot grill grate. If cooking indoors, turn gas burners to medium-high heat or heat a griddle or grill pan on an electric or induction stovetop over medium-high heat. If using a gas range, cook the skewers directly on the grates over the open flame. If using a griddle or pan, set the skewers on the hot surface. Cook until slightly charred and fragrant, turning occasionally with tongs to grill evenly, about 15 minutes. Grill the lemon halves until charred, if you’d like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the skewers to a serving dish and finish with a squeeze of lemon juice and pinch of flaky salt. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022281-grilled-mushroom-skewers-in-red-chile-paste"}