{"@context": "http://schema.org", "@type": "Recipe", "name": "Gâteau Basque", "description": "Bixente Marichular, founder of the <a href=\"https://www.legateaubasque.com/\">Musée du Gâteau Basque</a> in Sare, France, says the pastry is part of Basque patrimony: Every family has a recipe, and every family thinks theirs is the best. This version, made with ingredients from an American supermarket, follows the tradition of sandwiching two rounds of rolled-out dough with jam. In the Pays Basque, where the filling is sometimes pastry cream, the jam is usually local black cherry. Once baked, the texture of the “cake” — never mind that it’s about as much cake as <a href=\"https://cooking.nytimes.com/recipes/1018668-boston-cream-pie\">Boston cream pie</a> is pie — is a mix of crumbly, tender and chewy. Since gâteau Basque is a casual treat, eating it with your fingers is allowed.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2021/04/09/magazine/09mag-eat/09mag-eat-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "snack, cakes, dessert", "keywords": "cherry jam, make-ahead, plan-ahead", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 853}, "recipeIngredient": ["2 cups/256 grams all-purpose flour", "3/4 teaspoon baking powder", "1/2 teaspoon fine sea salt", "1/2 cup plus 2 tablespoons/142 grams unsalted butter (1 1/4 sticks), at room temperature, plus more for greasing the pan", "1/4 cup/55 grams light brown sugar", "1/4 cup/50 grams granulated sugar", "1 large egg, at room temperature", "1/2 teaspoon pure vanilla extract", "3/4 to 1 cup/180 to 240 grams thick cherry jam", "1 egg, beaten with a splash of cold water, for glazing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the flour, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with a mixer (use a paddle attachment if you have one), beat together the butter and both sugars on medium speed until smooth, about 3 minutes. Add the egg, and beat for another 2 minutes, scraping the bowl as needed. Beat in the vanilla; the mixture should be smooth. Add the flour mixture all at once, then pulse the mixer to begin incorporating it. Mix on low until blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out onto a work surface, gather into a ball, then divide in half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape each piece into a disk — the dough will be sticky — and put each between sheets of parchment paper. Using a rolling pin, roll each piece into a round just a smidge wider than 8 inches. Keeping the dough sandwiched between the parchment, refrigerate for at least 3 hours (or for up to 3 days)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to bake, center a rack in the oven, and heat to 350 degrees. Generously butter an 8-inch-by-2-inch round cake pan. Remove the dough from the fridge, and leave on the counter until pliable, about 10 minutes. Peel away the paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fit one round into the pan; if it breaks, just press the pieces together. Either fold the extra dough over and onto the base or trim it; don’t fuss about precision here. Spread about 3/4 cup of the jam over the base, leaving a 1-inch border bare and adding more jam, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top with the second piece of dough, lightly pressing down around the edges and, if you can, tucking the dough under a bit. Again, it doesn’t have to be perfect; the dough is soft, and as if by magic, the layers fuse in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the top with the egg wash, and use the tines of a fork to etch a crosshatch pattern."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cake for 40 to 45 minutes, or until the top is golden brown. Transfer to a rack, and let rest for 5 minutes, then carefully run a table knife around the edge of the cake. Unmold onto the rack, and then quickly and carefully turn the cake over onto another rack, crosshatch side up, so that it can cool to room temperature. Wrapped well, the cake will keep for 2 days at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022162-gateau-basque"}