{"@context": "http://schema.org", "@type": "Recipe", "name": "Sesame Snap Pea-Chicken Salad", "description": "This simple salad features crisp-tender sugar snap peas, delicate shredded chicken and creamy sesame dressing. The cooking methods are important here: Blanching the peas, then shocking them in ice water ensures that they retain crunch and color, while gently poaching the boneless chicken breast and plunging it into an ice water bath means it stays moist. The tangy dressing, which is a nod to the highly addictive Japanese-style goma dressing, is made with earthy roasted sesame seeds and mayonnaise; it finds its way to the craggy edges of the shredded chicken. Try to shred the meat the same size as the sliced peas for the best texture. This salad is great to serve immediately, and even better after spending at least an hour in the refrigerator.", "author": {"@type": "Person", "name": "Hana Asbrink"}, "image": "https://static01.nyt.com/images/2021/06/09/dining/ha-snap-pea-and-chicken-salad/merlin_188895543_3f383693-6ea0-47dc-90fe-fbf4bbbb40b2-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "2 to 4 servings (about 4 cups)", "recipeCuisine": "", "recipeCategory": "poultry, salads and dressings, vegetables, appetizer, main course", "keywords": "chicken breast, mayonnaise, sesame seeds, sugar snap peas, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 879}, "recipeIngredient": ["1 medium boneless, skinless chicken breast (about 8 to 10 ounces)", "Kosher salt", "3/4 to 1 pound sugar snap peas", "1/4 cup roasted white sesame seeds", "1/4 cup mayonnaise (preferably Kewpie brand)", "1 tablespoon soy sauce", "1 tablespoon unseasoned rice vinegar", "2 teaspoons toasted sesame oil", "1 teaspoon granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, add the chicken and enough cold water to cover it by 1 inch. Bring to a boil over medium-high heat. When the water begins to boil, lower heat immediately to a gentle simmer, cover partially with a lid and cook for 10 minutes. (Monitor that the bubbles never get too big; lower heat if so.) Turn off the heat, cover completely with lid, and leave on the stovetop for another 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the sugar snap peas: Bring a large pot of salted water to a boil. When it begins to boil, set a bowl of ice water next to the stovetop. Drop sugar snap peas into boiling water and cook until crisp-tender, 30 to 45 seconds. Use a slotted spoon to transfer the sugar snap peas to the ice water to cool completely. Drain well and pat dry on a clean dish towel in a single layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer sugar snap peas to a cutting board and trim the tips, if needed, then slice lengthwise into thirds on a slight diagonal. Transfer to a large bowl or lidded container, and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dressing: In a mortar and pestle, coarsely grind the sesame seeds, leaving some whole. In a small bowl, combine ground sesame seeds, mayonnaise, soy sauce, rice vinegar, sesame oil, sugar and 1/2 teaspoon salt. Stir until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a bowl of ice water next to the stovetop. Transfer the chicken to the ice water to cool completely. When chicken is cool enough to handle, pat dry, then finely shred the meat using your fingers. The shreds should be similar in size to the cut sugar snap peas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shredded chicken and all of the dressing to the chilled snap peas; toss gently until coated. Enjoy immediately, or refrigerate for up to 1 day."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022301-sesame-snap-pea-chicken-salad"}