{"@context": "http://schema.org", "@type": "Recipe", "name": "Meatball Subs", "description": "In this classic Italian American sandwich, tender meatballs drenched in tomato sauce are tucked into crisp rolls then buried under a blanket of gooey cheese. It’s a messy sandwich no matter how you build it or bite into it, but wise construction can help: First, hollow out the rolls a bit so the meatballs have a place to sit. Then, use the leftover crumbs to make the meatballs, which will keep them light. Finally, toast the rolls to prevent them from getting too soggy with sauce. Of course, some crispy-gone-soggy bites are welcome, just as the cheese pulls, sauce drips and messy fingers are, too. They’re all part of the experience.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2021/06/14/dining/as-meatball-subs/as-meatball-subs-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, weeknight, meatballs, sandwiches, main course", "keywords": "ground beef, italian american, marinara sauce, mozzarella, parmesan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 973}, "recipeIngredient": ["4 (6-inch-long) sub, hero or hoagie rolls, split lengthwise but still attached on one side", "1 egg", "Kosher salt and black pepper", "2 garlic cloves, peeled", "Extra-virgin olive oil, for greasing", "1 pound ground beef (at least 15 percent fat)", "1/2 cup finely grated Parmesan, plus more for serving", "2 tablespoons chopped basil leaves, plus more for serving", "2 cups marinara sauce (<a href=\"https://cooking.nytimes.com/recipes/1016147-simple-marinara-sauce\">homemade</a> or from a 24-ounce jar)", "4 slices mozzarella or provolone"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler to high with a rack no more than 6 inches from the heat source. (See Tip if you don’t have a broiler.) Using a fork, scrape out some of the interior of the rolls until you get about 1 cup bread crumbs. Add them to a large bowl along with 1/2 cup water, the egg, 1 teaspoon salt and several grinds of pepper. Finely grate 1 garlic clove into the mixture, then stir to combine. Let sit for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease a large (12-inch), oven-proof skillet with olive oil. To the bread crumbs, add the beef, Parmesan and chopped basil. Stir with your hands until combined, avoiding overmixing. Roll into 12 balls (about 2 heaping tablespoons/2 ounces each) and place them in the prepared skillet as you go. Broil the meatballs until browned and nearly cooked through, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Move the skillet to the stovetop. Add the marinara sauce, stir to coat the meatballs, and warm over medium-low heat while you toast the rolls: Place the rolls on a baking sheet, cut-side up, and broil until lightly golden, 1 to 2 minutes. Rub the cut sides of the roll with the second garlic clove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the meatballs and sauce among the rolls, then top with mozzarella. Broil until the mozzarella is melted and browned in spots, 1 to 2 minutes. Top with more grated Parmesan, basil leaves and black pepper."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022314-meatball-subs"}