{"@context": "http://schema.org", "@type": "Recipe", "name": "Ebony’s Rose Petal Pudding", "description": "Freda DeKnight introduced many signature dishes to Ebony magazine in the mid-20th century. One was her rose petal pudding, which was beloved by Ebony staffers and readers alike. Although its origin story is unclear, it’s likely that Ms. DeKnight, the magazine’s food editor and a frequent traveler, created the dessert from her research and willingness to incorporate international flavors into her cooking. This warm pudding provides a sweet taste of one of the most significant culinary periods in the nation. The rose icing is divine, and the aromatic pudding, which resembles bread pudding, is really lovely. The original recipe calls for 1/4 cup of rose water, which will give the pudding a very pronounced floral flavor, so you can choose an amount that is pleasing to you.", "author": {"@type": "Person", "name": "Kayla Stewart"}, "image": "https://static01.nyt.com/images/2022/02/23/dining/18EBONYREX1-rose-petal-pudding/merlin_202238124_3c4a96ac-aeb7-47d5-af04-4c47e4594edf-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "custards and puddings, dessert", "keywords": "almond, rose petals, white bread, mother’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 272}, "recipeIngredient": ["10 tablespoons/143 grams unsalted butter, softened, plus more for the mold", "6 slices/242 grams white bread, toasted and finely ground (about 3 cups) ", "1 cup/200 grams granulated sugar", "1 1/2 cups/226 grams almonds, finely ground or 2 1/4 cups/226 grams almond flour", "1 tablespoon baking powder", "1/2 teaspoon fine salt", "1/2 teaspoon ground mace", "1/4 packed cup/4 grams dried edible small rose petals, picked over for stems ", "3 large eggs", "3/4 cup whole milk", "1 teaspoon fresh lemon juice", "1 tablespoon rose water, plus more if desired", "2 cups/225 grams confectioners’ sugar", "4 tablespoons/57 grams unsalted butter, melted", "1/4 cup/87 grams currant jelly or seedless raspberry jam", "1/2 teaspoon ground mace", "1 teaspoon rose water", "2 tablespoons whole milk or cream, plus more as needed", "Crystallized rose petals, for garnish (optional; see Tip)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pudding: Butter a 7- to 8-cup heatproof pudding mold or other deep baking dish or bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine the bread crumbs, sugar, almonds, baking powder, salt, mace and rose petals in a large bowl or bowl of a stand mixer. Using an electric hand mixer or the paddle attachment of a stand mixer, mix the dry ingredients just to blend, about 10 seconds, then add the butter and beat until well combined, about 1 minute. In a medium bowl, beat the eggs with the milk, lemon juice and rose water. Add to the bread mixture and beat until everything is evenly moistened, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the pudding mixture into the prepared mold; it should come two-thirds up the sides of the mold. Cover tightly with aluminum foil, crimping it around the edges to seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the covered mold in a wide pot or Dutch oven large enough to fit it with space around and over it. Add enough water to the pot to meet the middle of the bowl. Bring the water to a boil over medium heat, then cover the pot and reduce the heat to maintain a low simmer. Steam, replenishing with boiling water as needed so there’s always enough to reach the middle of the bowl, until a skewer inserted in the center comes out clean, 1 1/2 to 2 hours. Cover tightly with foil again if the pudding needs to continue steaming after you insert the skewer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pudding is done, uncover the pot and let the pudding cool in the pot for about 5 minutes. Wearing oven mitts or protecting your hands with kitchen towels, grip the mold and transfer it to a heatproof work surface. If the pudding seems stuck to the mold, run a thin knife or spatula around the edges of the mold. Center a serving plate larger than the mold over the mold, then hold both tightly together and flip. The pudding should release onto the plate. If it hasn’t, tap the mold a few times, then lift off the mold. Let the pudding cool to warm. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pudding cools slightly, make the icing: In a medium bowl, combine the confectioners’ sugar, butter, jelly, mace and rose water. Beat or whisk until smooth, then stir in the milk. If the icing is too thick to pour, add more milk by the tablespoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pudding is still warm, coat it with the icing. If you have any icing leftover, serve alongside the pudding. Decorate the pudding using the crystalized rose petals if you’d like. Serve warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022979-ebonys-rose-petal-pudding"}