{"@context": "http://schema.org", "@type": "Recipe", "name": "Ham Croquetas", "description": "Crisp ham croquetas, gooey on the inside, are as synonymous with Miami as <a href=\"https://cooking.nytimes.com/recipes/8700-5-ninths-cubano\">the Cubano</a>. Deep-fried and shaped like cigars, these ham snacks are a classic Cuban dish. Though many new Cuban bakeries and restaurants play around with the ingredients, ham remains the most popular croqueta base. This version, from Islas Canarias Restaurant in Miami, is considered by many to be gold-star croquetas that hit the ideal sweet and salty notes. Squeeze some fresh lime on top, drizzle with hot sauce and serve with saltine crackers.", "author": {"@type": "Person", "name": "Christina Morales"}, "image": "https://static01.nyt.com/images/2022/02/23/dining/22CROQUETASREX/merlin_201816207_4b8bcc06-7673-4943-96f4-557f202cb83c-articleLarge.jpg", "totalTime": "PT9H30M", "recipeYield": "About 20 croquetas", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 131}, "recipeIngredient": ["1 pound honey ham, coarsely chopped", "1 Spanish onion (12 ounces), coarsely chopped", "4 tablespoons unsalted butter", "1 cup all-purpose flour", "1 2/3 cups whole milk", "1/4 cup curly parsley, finely chopped", "1 tablespoon garlic powder", "1 teaspoon fine salt, plus more to taste", "2 cups finely crushed soda crackers or plain bread crumbs (4 ounces)", "1 large egg, room temperature", "Vegetable oil, for frying (about 4 cups)", "Lime wedges, hot sauce and saltine crackers, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, pulse the ham and onion until coarsely ground. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan, melt the butter over medium heat. Quickly whisk in 1/2 cup flour and cook, whisking constantly, until smooth and tan, 2 to 3 minutes. While whisking, gradually add 1 cup milk, then continue whisking until the mixture thickens to the consistency of soft mashed potatoes, 1 to 2 minutes. Add the remaining 1/2 cup flour and use a wooden spoon or sturdy spatula to stir until very thick, firm and a darker shade of brown, 1 to 2 minutes. Some browning on the bottom of the pan is OK."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the pan, add the ham mixture, parsley, garlic powder and salt, and vigorously mix until the ingredients are evenly incorporated, 3 to 5 minutes. Transfer the mixture to a sheet pan lined with plastic wrap or parchment paper and pat into a 9-by-7-inch rectangle. Refrigerate for at least 2 hours or preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the chilled paste into 21 (3-by-1-inch) rectangles, then gently roll each into a 3-inch-long cylinder. Make sure the croquetas are smooth and without cracks. Place the croquetas on the sheet pan and chill in the freezer for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cracker crumbs on a plate. In a medium bowl, combine the egg and remaining 2/3 cup milk, and whisk until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Submerge 4 to 5 chilled croquetas in the milk mixture to thoroughly coat, then transfer immediately to the crackers, making sure the croquetas are coated in the crumbs. Return to the sheet pan and repeat with the remaining croquetas. Freeze again until firm but not frozen, 15 to 30 minutes. Don’t freeze for longer than 30 minutes as they may burst in the hot oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Towards the end of the chilling time, fill a small Dutch oven or heavy saucepan with oil to a depth of 1 1/2 inches. Heat over medium-high until a deep-fry thermometer registers 350 degrees. If you don’t have a thermometer, use a croqueta as a test piece: Carefully drop in 1 croqueta. If it immediately begins to fry and brown, the oil is ready. Carefully add 2 to 3 croquetas and fry, turning if needed to evenly cook, until golden brown,1 1/2 to 2 1/2 minutes. Transfer to a plate lined with paper towels and let rest for 1 to 2 minutes before serving. Repeat with the remaining croquetas, working in batches and adjusting the heat to maintain the oil temperature. Serve immediately with lime wedges, hot sauce and saltine crackers."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022982-ham-croquetas"}