{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Roasted Turkey With Apple Gravy", "description": "Padma Lakshmi likes big, bold flavors — spices and citrus especially — and infuses her Thanksgiving turkey with them. She prepares the bird over a bed of herbs and produce, then uses those pan juices to create a fruity yet savory gravy. To keep the turkey moist, Ms. Lakshmi starts with a buttermilk brine, then roasts the bird at a low temperature to make sure it cooks through but doesn’t dry out. But first, an initial blast in a very hot oven darkens the turkey in spots thanks to the sugar in the buttermilk brine. A final basting and uncovered cooking in the oven helps even out the mottled skin and ensures a delicate crispness. You can garnish the platter with the fruits, vegetables and herbs used in the recipe or serve the bird unadorned.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/11/23/dining/08PADMAREX/merlin_196956633_1083a8dd-ac4a-425d-9c3a-fe778f429a94-articleLarge.jpg", "totalTime": "P2DT6H", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry, roasts, main course", "keywords": "apple, buttermilk, plan-ahead, whole turkey, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1313}, "recipeIngredient": ["8 fresh bay leaves", "2 1/2 quarts buttermilk", "1/2 cup granulated sugar", "1/2 cup coarse sea salt", "1 tablespoon black peppercorns, toasted and ground (see Tip)", "1 1/2 teaspoons ground cayenne", "1 (14-pound) fresh or thawed frozen whole turkey, neck and giblets removed", "20 fresh bay leaves", "3 small Fuji or Honeycrisp apples, cored and cut into wedges", "2 small Granny Smith apples, cored and cut into wedges", "2 small fennel bulbs, sliced", "1 medium red onion, sliced", "1 medium yellow onion, sliced", "1 small bunch thyme", "10 slices fresh ginger", "12 garlic cloves, sliced", "1 orange, cut into 1-inch wedges", "Coarse sea salt", "1 1/2 tablespoons black peppercorns, toasted (see Tip), plus more toasted and ground for seasoning", "1 lemon, quartered", "Extra-virgin olive oil", "1/2 cup unsalted butter", "1/4 cup all-purpose flour", "2 tablespoons brandy, preferably Pomona or Calvados (optional)", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Brine the turkey: Tear the bay leaves to release their natural oils. Place in a large bowl with the buttermilk, sugar, salt, black pepper and cayenne, and stir to dissolve the sugar. Place the turkey in a brining bag or clean unscented garbage bag, pour in the buttermilk mixture and tightly tie the bag closed. Place in a pot or bowl that holds it snugly, making sure the legs are fully immersed in the brine, and refrigerate for at least 48 hours and up to 72 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the turkey: Position a rack at the bottom of the oven and heat oven (not convection) to 450 degrees. Tear the bay leaves to release their natural oils. Spread the apples, fennel, onions, 12 bay leaves and half of the thyme, ginger, garlic and orange across the bottom of a large roasting pan. Sprinkle with salt and the whole peppercorns."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the turkey and wipe dry. (Discard the brine.) Place the turkey in the pan breast side up, and rub its cavity with salt and ground pepper. Stuff the cavity with the lemon and the remaining bay leaves, thyme, ginger, garlic and orange. Tuck the wings underneath and tie the legs together with kitchen twine. Sprinkle the turkey with salt and ground pepper, and drizzle everything with oil. Drizzle more oil all over the turkey and rub to generously and evenly coat the skin. Transfer to the oven and roast until browned in spots all over but not burned, 20 to 40 minutes. (Ovens vary widely in how quickly they brown such a large bird, so start checking at 20 minutes and keep going until it’s spotted all over.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 2 cups water into the pan, cover the turkey with foil and loosely crimp around the edges of the pan. Reduce the oven temperature to 300 degrees and slide the pan back into the oven. Slow-roast until the turkey is almost cooked through (a meat thermometer will register 150 degrees in the thickest part of the breast and 160 degrees in the thigh), about 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover, baste all over with the pan juices and roast uncovered until the skin is more evenly browned and the meat registers 155 degrees in the breast and 165 degrees in the thigh, 30 to 45 minutes. The internal temperature will continue to rise as the turkey rests. Let cool slightly in the pan, then transfer the turkey to a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the gravy: Smash the fruits and vegetables in the roasting pan. Set a colander with small holes or a medium-mesh strainer over a bowl or pot, and pour in everything from the pan, working in batches if needed. Press hard on the solids to extract as much liquid as possible along with fruit and vegetable pulp. Discard the solids in the colander; scrape any strained pulp into the bowl. Skim and discard fat from the strained juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a large saucepan over medium-low heat. Add the flour and whisk until deep golden brown, 3 to 5 minutes. While whisking, add the defatted pan juices a little at a time, whisking until smooth, then stir in the brandy. Simmer, stirring occasionally, until thickened, 4 to 5 minutes. Keep warm over low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, season the gravy to taste with salt and pepper. Carve the turkey and serve with the hot gravy."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022729-slow-roasted-turkey-with-apple-gravy"}