{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey Tetrazzini", "description": "This classic turkey or chicken spaghetti casserole is rich with cheese and has a crunchy bread crumb topping. It was named after Luisa Tetrazzini, a famous Italian opera star at the turn of the 20th century. She enjoyed her fame with a flamboyant and generous public life, singing not only in opera houses but also for <a href=\"https://www.sfgate.com/news/article/Luisa-Tetrazzini-s-gift-ends-S-F-era-on-high-note-2452300.php\">free on city streets</a>: In 1910 she gave an outdoor Christmas Eve concert for a huge crowd in San Francisco. It’s unclear exactly how this particular dish came to be named after her — it was certainly meant as a compliment — but <a href=\"https://www.barrypopik.com/index.php/new_york_city/entry/spaghetti_tetrazzini/\">some accounts</a> say it was her own recipe. The optional curry powder isn’t traditional, but it’s delicious, and a little added flair seems in the spirit of Ms. Tetrazzini.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2021/11/15/dining/sd-Turkey-Tetrazzini/sd-Turkey-Tetrazzini-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, casseroles, main course", "keywords": "fall, mushroom, spaghetti, thanksgiving leftover, turkey, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 462}, "recipeIngredient": ["Salt", "1 pound spaghetti or linguine", "5 tablespoons unsalted butter", "1 pound cremini mushrooms, any tough or dry stems discarded, sliced", "8 garlic cloves, chopped", "1/3 cup all-purpose flour", "1 tablespoon plus 1 teaspoon mild curry powder (optional)", "1 cup dry white wine", "4 cups chicken or turkey stock or broth", "8 ounces cream cheese, cut into chunks", "3 cups shredded or chopped leftover cooked turkey or chicken", "1 cup frozen peas", "1 heaping cup grated Parmesan (4 ounces)", "1 cup shredded or grated fontina (4 ounces)", "Black pepper", "1 cup panko bread crumbs", "1/2 cup slivered almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Bring a large pot of well-salted water to a boil and cook the pasta until just shy of al dente, about 2 minutes less than the package directs. Drain and rinse with cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large Dutch oven, melt 4 tablespoons of the butter over medium-high heat, and add the mushrooms. Season lightly with salt, and cook, stirring only occasionally, until the mushrooms have released their liquid and have started to brown deeply, 8 to 11 minutes. Add the garlic and cook, stirring, until fragrant, 1 minute. Add the flour and curry powder, if using. Stir well, until the flour and the mushrooms are evenly combined and the flour is evenly moistened, about 1 minute. Whisk in the white wine, and let it come to a boil, whisking constantly. Let the wine bubble to reduce slightly, 2 minutes. Whisk in the chicken stock, and let it come to a boil. Cook until it thickens noticeably, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to low. Whisk in the chunks of cream cheese (don’t worry if the cream cheese appears curdled), then fold in the turkey, peas and the cheeses. Season generously with black pepper. Add the drained pasta and toss with tongs to combine. Taste and add salt if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a 9-by-13-inch baking dish. Melt the remaining tablespoon of butter in a small bowl in the microwave, and toss it together with the panko and the almonds. Sprinkle the panko-almond mixture all over the top of the pasta, and bake until bubbly and browned on top, about 25 minutes. Let the casserole rest for 5 minutes before serving. It will be very creamy at first but will firm up as it cools."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022741-turkey-tetrazzini"}