{"@context": "http://schema.org", "@type": "Recipe", "name": "Banana Cream Pie", "description": "Floral honey, aromatic cardamom and a whipped cream bursting with banana goodness bolster the flavors of this classic dessert. The addition of freeze-dried bananas to the cream layer intensifies the taste of the fruit in each bite. This pie is a bit of a project, so break up the process to make it easier: Make the caramel up to one month in advance; bake the crust up to three days ahead; and fill the crust 24 hours before serving. The topping is best when added just before slicing, as the caramel will begin to weep and melt rapidly.", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "image": "https://static01.nyt.com/images/2021/09/03/dining/SE-banana-cream-pie/SE-banana-cream-pie-articleLarge.jpg", "totalTime": "PT4H15M", "recipeYield": "12 to 16 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts, project, dessert", "keywords": "banana, heavy cream, vanilla wafer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 315}, "recipeIngredient": ["1/2 cup/100 grams granulated sugar", "1/4 cup/80 grams mild honey", "2 tablespoons unsalted butter", "3 tablespoons heavy cream", "3/4 teaspoon kosher salt (Diamond Crystal)", "8 3/4 ounces/250 grams vanilla wafers (3 to 4 cups)", "2 tablespoons granulated sugar", "1/4 teaspoon kosher salt (Diamond Crystal)", "4 tablespoons/56 grams unsalted butter, softened or melted", "1 tablespoon heavy cream", "5 green cardamom pods", "3 to 4 ripe medium bananas (555 grams)", "1/2 cup/100 grams granulated sugar", "1/4 cup/30 grams cornstarch", "1/4 teaspoon kosher salt (Diamond Crystal)", "1 large egg", "2 large egg yolks", "2 cups/480 grams whole milk", "2 tablespoons cold unsalted butter, cut into 1/2-inch cubes", "1/2 heaping cup/30 grams freeze-dried bananas", "2 tablespoons granulated sugar", "1/4 teaspoon kosher salt (Diamond Crystal)", "1 3/4 cups/400 grams heavy cream", "1 teaspoon pure vanilla extract", "Dark chocolate bar, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the caramel: Heat a small, heavy saucepan over medium. Sprinkle just enough sugar to evenly cover the bottom of the pan and cook, without stirring, until melted, 2 to 3 minutes. Sprinkle over remaining sugar, 1 tablespoon at a time, stirring with a fork to dissolve and waiting for each addition to melt before adding the next, until all the sugar has melted into a syrup, 3 to 4 minutes. Cook, swirling the pan occasionally, until deeply browned and just starting to smoke, about 1 minute. Remove from heat, immediately add honey and butter, and carefully stir to combine. Add cream and salt, return to medium heat, and simmer for 30 seconds. Set aside to cool. (Caramel can be made up to 1 month in advance and stored at room temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Heat oven to 325 degrees. In a food processor, combine wafers, sugar and salt, and process until finely ground. You should have about 2 1/2 cups crumb mixture. Add butter and cream, and pulse until well-combined and crumbs are moistened. (Alternatively, place wafers, sugar and salt in a zip-top freezer bag and crush with a rolling pin. Transfer to a large bowl, add butter and cream, and mix well with a stiff rubber spatula until combined.) Transfer crumb mixture to a standard 9-inch pie plate. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the backs of your fingers, press the crumbs evenly against the walls of the pie plate. Press the remaining crumbs against the bottom of the pie plate. Use the sides and bottom of a dry measuring cup to firmly pack the crumbs along the sides and bottom of the pie plate. (If the crumbs aren’t holding together, they may be too coarsely ground; process further and try again.) Set on a sheet pan and bake until the crust is golden brown, smells toasty and feels dry to the touch, 12 to 15 minutes. Cool completely. (Crust can be prepared 3 days in advance and stored tightly wrapped at room temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling and assemble: Using a mortar and pestle or spice grinder, crush the cardamom pods until the husks are torn and the seeds are cracked. Set aside. Spread about three-quarters of the caramel over the crust. Peel the bananas, slice into 1/4-inch-thick coins and arrange on top of caramel. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan (preferably with sloped sides), whisk together sugar, cornstarch and salt. Add egg, egg yolks and cracked cardamom, and whisk to combine. Whisk in milk and cook over medium, whisking constantly (take care to get into the corners of the pot), until thickened and just beginning to bubble, 5 to 6 minutes. After the first bubble, continue cooking, whisking constantly, for 1 full minute. Remove from heat and whisk in butter until fully melted and incorporated. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain custard through a fine-mesh strainer directly into the banana-lined pie shell. Use an offset spatula or the back of a spoon to smooth the top of the custard. Press a piece of plastic wrap directly on the surface of the custard (or don’t, if you like pudding skin) and refrigerate until fully chilled, at least 3 hours and up to 24 hours before serving. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the topping and decorate: In a food processor, combine freeze-dried banana, sugar and salt. Blitz until finely ground. Add cream and vanilla, and use a fork to roughly mix, moistening all the banana powder. Pulse together until thickened, spreadable and doubled in volume, taking care not to overwhip, 30 seconds to 2 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the banana whipped cream over the chilled custard and use the back of a spoon to create swoops and swirls. To garnish, drizzle with remaining caramel, warming it if needed to make it runny, and shave chocolate with a vegetable peeler on top. Use a sharp knife dipped in warm water and wiped dry to cut clean slices. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022494-banana-cream-pie"}