{"@context": "http://schema.org", "@type": "Recipe", "name": "​​Crisp Roast Duck", "description": "A golden-skinned roasted duck is a festive main course for any special meal. In this recipe, the bird is doused with boiling water before being scored all over. The boiling water helps pull the skin taut, making it easier to score in a crosshatch pattern. That, in turn, allows the fat to render out as everything roasts. The result is a perfectly cooked duck with pink, juicy meat and burnished, crunchy skin. Serve the bird as is, or with some kind of sauce — either sweet or pungent — such as <a href=\"https://cooking.nytimes.com/recipes/1015626-red-wine-cranberry-sauce-with-honey\">cranberry sauce,</a> <a href=\"https://cooking.nytimes.com/recipes/12286-whole-fish-with-lime-salsa-verde\">salsa verde</a> or <a href=\"https://cooking.nytimes.com/recipes/1018994-soy-dipping-sauce\">a spicy soy dipping sauce.</a> And save the duck fat at the bottom of the pan. It will keep for at least three months in the refrigerator and is excellent on roasted vegetables, especially potatoes.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/12/15/dining/10Appe-rex/merlin_198330969_23004ba5-8cb2-4b4d-95f4-13d1a8777d67-articleLarge.jpg", "totalTime": "PT6H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry, main course", "keywords": "christmas, new year’s day, plan-ahead, whole duck", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 735}, "recipeIngredient": ["1 (5- to 6-pound) whole duck", "1 tablespoon plus 1 teaspoon kosher salt (Diamond Crystal)", "2 teaspoons freshly ground black pepper", "2 large garlic cloves, finely grated, passed through a garlic press or finely minced", "1 tablespoon chopped thyme or rosemary leaves, or a combination, plus more sprigs for the cavity", "1 tablespoon finely grated lemon or orange zest, or a combination", "1 1/2 teaspoons ground coriander or a spice mix, such as <a href=\"https://cooking.nytimes.com/recipes/1021923-garam-masala\"> garam masala </a> or <a href=\"https://cooking.nytimes.com/recipes/1021924-baharat-blend\">baharat</a>(optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a full kettle or medium pot of water to a boil (at least 2 quarts)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, remove giblets and neck from the duck cavity and reserve for another use. Trim any excess fat from around the duck cavity and the neck. Place duck, breast side up, on a rack in the sink. Pour half of the boiling water all over the top of the duck to tighten the skin. Flip the bird and pour remaining boiling water over the back."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the duck is cool enough to handle, using the tip of a very sharp paring knife, prick duck skin all over to help release the fat, especially where the skin is thickest, and be careful not to pierce the meat. It can be helpful to hold the knife nearly parallel to the bird. After piercing the skin, use the knife blade to score the duck breast in a crosshatch pattern (making deep cuts into the skin only, and not into the breast meat). Flip the bird and score the back as well (you don’t need to prick the back). You may need to sharpen your knife along the way, as it’s much easier to make clean cuts into the skin with a sharp knife. Using a clean kitchen towel or paper towels, thoroughly pat duck dry, including inside the cavity."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the duck all over, including cavity, with salt and pepper. In a small bowl, combine garlic, chopped herbs, citrus zest and coriander, if using, and make a paste. Rub garlic paste all over duck, inside and out. Place duck, breast side up, on rack in a roasting pan, stuff cavity with herb sprigs, and refrigerate, uncovered, for at least 4 hours and up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When it’s time to cook the bird, heat the oven to 450 degrees. Roast for 30 minutes. Remove the pan from the oven and carefully prick duck skin all over the top of the bird using a sharp paring knife. (You don’t need to prick the back of the duck.) Reduce the oven temperature to 350 degrees and continue roasting until skin is golden brown and crispy, and the internal temperature at thickest part of the thigh reads 165 degrees on an instant-read thermometer, about 1 hour to 1 hour 45 minutes longer. Using tongs, gently tip duck to drain any liquid from the cavity. Transfer bird to cutting board to rest for at least 10 minutes. Carve and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022808-crisp-roast-duck"}