{"@context": "http://schema.org", "@type": "Recipe", "name": "Poppy Seed Tea Cake", "description": "Poppy seeds belong to the small-but-mighty clan of ingredients: Their flavor is nutty, their aroma earthy, and their color, a gorgeous blue-black, dramatic. Even though they’re minuscule, they crack pleasantly under a light bite. Sprinkle poppy seeds over something sweet or savory and you add interest. Give the seeds a star turn and you add surprise. Although this simple loaf cake includes vanilla extract and lemon juice, it’s the flavor that you get from an abundance of poppy seeds that brings everyone back for more. The cake can be served plain, but it’s pretty spread with white icing and speckled with seeds. Remember that because poppy seeds are oily, they can go rancid — store them in the freezer and taste a few before using them.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2022/01/09/magazine/09mag-eat-site/09mag-eat-site-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "snack, dessert", "keywords": "heavy cream, lemon zest, loaf cake, poppy seed", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1420}, "recipeIngredient": ["5 1/2 tablespoons/78 grams unsalted butter, melted and cooled, plus softened butter for the pan", "1 1/2 cups/192 grams all-purpose flour, plus more for the pan", "1 teaspoon baking powder", "1/4 teaspoon fine sea salt", "1 1/4 cups/250 grams granulated sugar", "Finely grated zest of 1 lemon or 1 tangerine, plus 2 tablespoons juice", "4 large eggs, at room temperature", "1 1/2 teaspoons pure vanilla extract", "1/2 cup/120 milliliters heavy cream, at room temperature", "1/3 cup/47 grams poppy seeds", "1 cup/120 grams confectioners’ sugar", "1 to 2 tablespoons lemon juice", "1/2 teaspoon poppy seeds, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Center a rack in the oven and heat oven to 350 degrees. Butter and flour an 8 1/2-inch loaf pan. Place the pan on 2 stacked baking sheets or an insulated baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the flour, baking powder and salt in a small bowl. Put the sugar in a large bowl, add the lemon or tangerine zest, and rub together with your fingers until the sugar is moist and aromatic. Add the eggs, one by one, whisking each vigorously before adding the next. Whisk in the juice and vanilla, and then whisk in the heavy cream until smooth. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour mixture in 3 additions, using the whisk to gently stir the dry ingredients into the batter. When the flour is incorporated, add the butter in 2 additions, again stirring gently with the whisk. You should have a thick, smooth, shiny batter. Switch to a flexible spatula and stir in the poppy seeds. Scrape the batter into the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the cake has risen and cracked along the center and, most important, a tester inserted deep into the cake comes out clean, 60 to 70 minutes. Take a look at it after about 45 minutes and tent it loosely with foil if it’s getting too dark too fast. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pan to a rack, cool for 5 minutes, and then run a table knife between the cake and the sides of the pan. Unmold the cake, then turn it right side up onto the rack. Cool to room temperature. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the glaze, if you like: Stir together the confectioners' sugar and 1 tablespoon lemon juice until smooth. If needed, add more juice, a drop at a time, until you have an icing that falls slowly from the tip of a spoon. Spread it over the cooled cake to coat evenly, sprinkle with poppy seeds and let stand until set. Wrapped well, the cake will keep at room temperature for about 4 days; unglazed, it can be frozen for up to 1 month."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022856-poppy-seed-tea-cake"}