{"@context": "http://schema.org", "@type": "Recipe", "name": "Youvarlakia Avgolemono (Lemony Greek Meatball Soup)", "description": "Avgolemono is a Greek egg and lemon mixture that’s tangy and silky, and used to thicken sauces and soups. In the United States, most versions of avgolemono soup brim with grains of rice and chunks of chicken. In this recipe, a riff on youvarlakia avgolemono, ground chicken and rice are rolled into meatballs, then simmered in the broth, making the whole thing heartier without losing the soup’s characteristic brightness. Many recipes for youvarlakia call for ground beef, and, if you like you can substitute that here. Note that because of the eggs in the broth, leftovers do not freeze well.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/02/25/dining/25apperex/merlin_202627539_ff884f2c-0aec-4bfa-baab-1d0eacab589a-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, meatballs, main course", "keywords": "dill, ground beef, ground chicken, ground turkey, lemon juice, parsley, soup", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1266}, "recipeIngredient": ["1 pound ground chicken (or ground turkey or beef), very cold", "3/4 cup chopped fresh dill or parsley, plus more for garnish", "1/2 cup grated yellow onion (from about 1 small onion)", "1/4 cup grated carrot (from about 1 carrot)", "1/4 cup uncooked long-grain rice, such as basmati or Carolina, well rinsed and drained", "1 garlic clove, finely grated, pushed through a garlic press, or minced", "1 teaspoon fine sea salt, plus more as needed", "1/2 teaspoon freshly ground black pepper, plus more as needed", "1/2 teaspoon finely grated lemon zest", "6 cups chicken stock", "2 large eggs, at room temperature", "1/3 cup fresh lemon juice (from about 2 lemons)", "Freshly grated nutmeg, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine ground chicken, 1/4 cup dill, onion, carrot, rice, garlic, salt, pepper and lemon zest. Gently mix with your hands until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently form the mixture into 24 meatballs, each about 1 1/4 inches in diameter, placing them on a plate or baking pan. Cover and chill for at least 20 minutes or up to 24 hours. This helps the meatballs keep their shape while cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, bring stock to a boil over high heat. Reduce to medium and use a slotted spoon to carefully add meatballs to the pot. The broth should cover the tops of the meatballs by about 1/2 inch. If not, add a little water. Simmer gently, adjusting the heat so the broth doesn’t boil, until meatballs are cooked through and rice is tender, 25 to 35 minutes. (Break open a meatball to test it.) Remove pot from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together eggs and lemon juice until just mixed. Slowly add a ladle of warm broth to egg-lemon mixture, whisking constantly. Whisk in another two ladles of broth to temper the egg mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly drizzle the egg-lemon mixture back into the pot with the meatballs, stirring gently so you don’t break apart the meatballs. Return the pot to medium-low heat until it just starts to simmer. (Wait for a bubble or two to appear, but don’t let the pot boil.) The broth should be silky. Remove from heat, stir in remaining 1/2 cup dill. Taste and add salt and pepper, if needed. (It may need quite a bit of salt if you are starting with unsalted broth.) Garnish with nutmeg, if you like, and dill, and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022999-youvarlakia-avgolemono-lemony-greek-meatball-soup"}