{"@context": "http://schema.org", "@type": "Recipe", "name": "Charcuterie Board", "description": "A charcuterie board refers to an impressive spread of cured meats, and this festive take adds cheeses with fun accoutrements such as roasted nuts, tangy olives and fresh vegetables, which brighten the meal. It even includes a smooth paté, decadent smoked fish and a homemade whipped ricotta that serves as both a dip and a spread. Whipped ricotta is a cinch to make, transforming the grainy, dense cheese into something light and airy. This type of grand spread is perfect for entertaining and is extremely flexible — simply curate any combination of meats and cheeses with varying textures.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2021/11/22/dining/kc-charcuterie-board/merlin_198116994_c9958b1b-5004-4c19-937b-9aca759728cd-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "quick, snack, finger foods, appetizer", "keywords": "cheese, olives, paté, prosciutto, radish, ricotta, salami, smoked whitefish, christmas, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 593}, "recipeIngredient": ["1 1/2 cups (about 12 ounces) whole milk ricotta, drained if needed ", "3/4 teaspoon kosher salt (Diamond Crystal)", "Extra-virgin olive oil or honey, and cracked black pepper, for garnish", "8 ounces spreadable paté, such as chicken liver, country, mushroom or vegetable", "1 1/2 pounds assorted cured meats, such as prosciutto, salami, bresaola, mortadella, ham, chorizo or soppressata", "4 (8-ounce) pieces of soft and firm cheeses, such as Brie, Camembert, Gruyère, Manchego, aged Cheddar or Stilton", "8 ounces smoked whitefish, skin and bones discarded", "2 bunches radishes, with greens, or trimmed and halved", "8 ounces salted, roasted Marcona almonds", "8 ounces dried Medjool dates", "1 (10-ounce) block quince or guava paste, or fig jam", "8 ounces mixed olives, such as Castelvetrano, Cerignola, Kalamata and niçoise", "Sliced bread (such as baguette), crackers and Dijon mustard, for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the whipped ricotta: In the bowl of a food processor, combine ricotta and salt, and purée until light and fluffy, scraping down the side of the bowl every so often, about 2 minutes. Transfer to a serving bowl, drizzle with olive oil or honey, and garnish with cracked black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the charcuterie board: On a large cutting board or serving platter, arrange the whipped ricotta and all of the other ingredients. (Place olives in a bowl and set an empty small bowl next to the olives for the pits.) Set out small knives, forks and spoons for slicing and serving. Serve with bread, crackers and mustard."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022646-charcuterie-board"}