{"@context": "http://schema.org", "@type": "Recipe", "name": "Frijoles de la Olla", "description": "There is nothing that feels more like comfort food than a fresh batch of brothy, tender pinto beans topped with cilantro, jalapeños and avocado, and served with warm tortillas. It’s so simple, yet so filling and delicious. Frijoles de la olla are beans cooked in a pot, and here, that pot is an electric pressure cooker, which makes preparation quicker and even more hands-off. Seasonings like dried chiles, garlic and dried mushrooms take the broth’s flavor to another level. For a spicier version, toss in some chiles de árbol, too. You can swap in dried black or flor de junio beans for an equally delicious and rich broth. Any leftovers would be great in enfrijoladas or chili. ", "author": {"@type": "Person", "name": "Jocelyn Ramirez"}, "image": "https://static01.nyt.com/images/2021/07/14/dining/jr-Frijoles-de-la-Olla/merlin_189647439_b38a2da3-2d33-4b43-80a4-080f1df888b1-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, beans, main course", "keywords": "dried mushrooms, guajillo chiles, instant pot, jalapeño, pinto beans, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 689}, "recipeIngredient": ["2 cups dried pinto beans (12 ounces)", "1 large dried ancho chile or 3 dried pasilla chiles, stemmed, seeded and rinsed", "2 large dried guajillo chiles, stemmed, seeded and rinsed", "1 dried avocado leaf", "2 dried bay leaves", "2 large black garlic or regular garlic cloves, peeled", "1/4 cup mixed dried mushrooms (1/4 ounce), coarsely crumbled if large", "1 tablespoon kosher salt (Diamond Crystal), plus more to taste ", "2 jalapeños, halved lengthwise", "8 corn tortillas, for serving", "1/4 cup tightly packed cilantro leaves", "2 ripe Hass avocados, pitted, peeled and sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans, chiles, avocado leaf, bay leaves, garlic, dried mushrooms, salt and 8 cups water to an electric pressure cooker (such as an Instant Pot), and set to cook for 40 minutes at high pressure."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "During the last few minutes of cooking, lightly char the jalapeños over the open high flame of a gas burner, or sear them on a comal or in a dry, heavy skillet over medium-high heat until blackened and beginning to soften, 3 to 5 minutes over a flame or about 10 minutes in a skillet. Use heatproof tongs to turn occasionally. Once cooked, set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the pressure cooker has completed cooking, carefully release the pressure to open the lid. Taste test at least 5 beans to make sure they are all tender and fully cooked. If any are not, set the machine to its “sauté” function and bring the liquid to a boil. Simmer until the beans are smooth and soft. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard the avocado and bay leaves. If you’d like a more full-bodied broth, transfer the chiles, garlic and 1 1/2 cups cooking liquid to a blender or food processor, blend until completely smooth, and return to the pot of beans. Taste for salt and adjust as needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm the tortillas over the open flame of a gas burner or on a comal or in a dry, heavy skillet over medium-high heat until soft. Divide the beans and rehydrated mushrooms among bowls, then top with cilantro, avocado and charred jalapeños. Sprinkle a pinch of salt on the avocado slices and serve with the warmed tortillas."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022402-frijoles-de-la-olla"}