{"@context": "http://schema.org", "@type": "Recipe", "name": "Khoresh Morgh Nardooni (Pomegranate Chicken Stew)", "description": "Khoresh morgh nardooni (also called anar mosama) is a deeply flavorful dish from the northern provinces of Iran. It is wonderful for Shab-e Yalda, the Iranian celebration of the winter solstice, or for any holiday celebration. Pomegranates on Yalda symbolize a red dawn: the emergence of light and brighter days ahead. Here, the combination of pomegranate molasses and pomegranate seeds showcase the various ways the fruit is used in Iranian cuisine. While not traditional, some preparations, such as this one, use tomato paste for added depth and vibrancy. Serve this with Persian rice, a side of fresh herbs, radishes and scallions.  ", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2021/12/06/dining/06yaldarex2/merlin_198330927_09085d19-6e87-4d4e-901c-469852878001-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "poultry, main course", "keywords": "chicken legs, pomegranate molasses, pomegranate seeds, saffron, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 468}, "recipeIngredient": ["A pinch of saffron threads (about 3/4 teaspoon)", "A pinch of granulated sugar, plus more as needed", "4 bone-in, skin-on chicken legs (about 3 pounds) ", "Kosher salt (Diamond Crystal)", "1/4 cup plus 2 tablespoons extra-virgin olive oil", "1 large yellow onion, diced", "3/4 teaspoon ground turmeric ", "1/4 teaspoon black pepper, plus more as needed ", "1 tablespoon tomato paste", "2 tablespoons pomegranate molasses (see Tip) ", "1 1/2 cups pomegranate seeds (from 1 large pomegranate)", "Lemon juice, as needed", "Mint leaves, for garnishing (optional)", "Steamed rice, fresh herbs, sliced radishes and scallion segments, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 2 tablespoons water to a boil in a small saucepan, kettle or using the microwave, then let stand for 2 minutes to allow the temperature to drop slightly while you grind the saffron. Using a mortar and pestle (or small bowl with the handle of a wooden spoon), grind the saffron with a small pinch of sugar to a fine powder (about 1/4 teaspoon) and add the hot water. Gently stir, cover and let steep until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the chicken legs generously with salt (about 3 1/2 teaspoons). In a large skillet with a lid, heat 1/4 cup of oil over medium-high. When the oil is hot, but not smoking, reduce the heat to medium and add the chicken legs, skin side down. Cook until the chicken is golden, 5 to 8 minutes; we’re not looking to brown the chicken skin here, just to get a nice golden color. Flip and cook the other side until golden, 5 to 8 minutes. You may have to do this in batches. Transfer the chicken to a sheet pan or large plate. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Leave behind about 1/4 cup of the rendered fat in the pan and discard the rest. Add half of the diced onion and cook, stirring occasionally, until golden, about 10 minutes. Sprinkle the onion with a little salt, 1/2 teaspoon of turmeric and the black pepper, and stir until fragrant, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken legs along with any juices back to the pan skin side down. Swipe the chicken through the turmeric-stained oil and flip so the skin side is up. Add 1 1/2 cups water, scraping up any bits stuck on the bottom. Bring to a gentle boil over medium-high heat, then reduce the heat to medium-low, cover and gently simmer the chicken for 25 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the pomegranate sauce: In a small pan, heat the remaining 2 tablespoons of oil over medium. Add the remaining diced onion and cook, stirring occasionally, until golden, about 10 minutes. Sprinkle the onion with a little salt, add remaining 1/4 teaspoon of turmeric, and stir until fragrant, about 30 seconds. Reduce the heat to medium-low, stir in the tomato paste, and cook just to take off the raw taste and deepen its color, but taking care not to burn it, about 1 minute. Add the pomegranate molasses, give it a quick stir just to incorporate (pomegranate molasses burns quickly), then stir in 1 1/4 cups pomegranate seeds and save the rest for garnish. Sprinkle with a little salt, and remove from the heat. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pomegranate sauce and the saffron water to the chicken, gently stir, and simmer uncovered over medium heat until the sauce reduces by about half and the chicken is tender, about 25 minutes. Every once in a while, spoon a little sauce over the chicken. If the sauce reduces too quickly, reduce the heat to medium-low or low. (You want enough sauce to spoon over rice and the chicken.) Taste for seasoning, and add a little sugar, 1 tablespoon at a time, if the pomegranate molasses is too sour or bitter. If your sauce is too sweet, balance it with a little lemon juice, 1 tablespoon at a time. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish with reserved pomegranate seeds and mint leaves, and serve over rice with a side of fresh herbs, radishes and scallions. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022792-khoresh-morgh-nardooni-pomegranate-chicken-stew"}