{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Portobellos With Chile Sauce, Sour Cream and Corn Nuts", "description": "This is a wonderful vegetarian main dish to serve in the center of your table, with tortillas or rice and a zesty green salad. Be sure to ventilate your kitchen well when you’re grilling the mushrooms and onions indoors, but, if weather permits, you can always grill them outdoors. If you’d like to make this less spicy, then feel free to leave out the dried chiles, making a simple bell pepper sauce instead. Keep this dish vegan by swapping out the sour cream for a nondairy alternative.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2022/02/09/dining/04ottorex-portobello/merlin_201238689_7d342030-838a-416f-a986-47d7a4f7fb3e-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, vegetables, main course, side dish", "keywords": "corn nuts, dried chiles, portobello mushrooms, red bell pepper, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 97}, "recipeIngredient": ["1 large red bell pepper, quartered, stem and seeds removed", "1 large plum or vine tomato, halved", "1/2 yellow onion, peeled and cut into 4 wedges", "7 tablespoons/105 milliliters olive oil, plus more for greasing the pan", "Kosher salt (Diamond Crystal)", "1 (10-gram) dried guajillo chile, stem and seeds removed", "About 2 dried chipotle chiles (5 grams), stem and seeds removed", "2 cups/500 milliliters boiling water", "1/3 cup/75 grams sour cream", "2 tablespoons lime juice", "8 large portobello mushrooms (about 2 1/2 pounds/1.1 kilograms total), stems removed", "1 red onion, peeled and cut into 6 wedges, layers roughly separated", "1 teaspoon cumin seeds, toasted and roughly crushed in a mortar and pestle", "2 garlic cloves, minced", "2 teaspoons maple syrup", "1/3 cup/30 grams salted, roasted corn nuts, roughly chopped", "2 tablespoons fresh oregano leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees Fahrenheit/240 degrees Celsius. Add the bell pepper, tomato and yellow onion to a medium parchment-lined rimmed baking tray, and toss with 1 1/2 teaspoons oil and a small pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the peppers and tomatoes skin side up on the parchment, and roast for 22 minutes, or until softened in places. Set aside, and when cool enough to handle, peel and discard the pepper and tomato skins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the vegetables cook, add the dried chiles to a medium heatproof bowl and pour over enough boiling water to fully submerge. Weigh down the chiles with a small saucer and let sit for 20 minutes to rehydrate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the sour cream, a tablespoon of lime juice and a tiny pinch of salt until smooth. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a well-greased grill pan over high heat and ventilate your kitchen well. In a large bowl, gently toss together the mushrooms, red onion, 3 1/2 tablespoons oil and 3/4 teaspoon salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once your grill is hot enough, add half the mushrooms, cap side down, and half the onions. Grill the mushrooms for 5 minutes, then flip them over and grill for another 3 minutes, or until nicely charred and cooked through. Grill the onions for 4 to 5 minutes, flipping as necessary, until charred and softened (don’t worry if the layers separate further). Transfer to a large bowl. Repeat with the remaining mushrooms and onions. When ready, toss the grilled vegetables with half of the cumin seeds, the remaining tablespoon of lime juice and 1 tablespoon of oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the chiles have soaked, remove them, discarding the water. Roughly chop the chiles, then add to a blender along with the roasted vegetables, garlic, maple syrup, 1/3 cup plus 1 tablespoon/100 milliliters of fresh water, the remaining 2 tablespoons of oil and 3/4 teaspoon salt. Blitz until completely smooth and silky. If the mushrooms aren’t finished cooking, transfer the sauce to a small saucepan over medium heat, and gently warm through, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the warm chile sauce onto a large platter with a lip, swirling to cover the surface of the plate. Use a spoon to drizzle over the sour cream, then top with the mushrooms, onions and any remaining juices. Sprinkle over the remaining cumin seeds, half the corn nuts and all the oregano, serving the remaining corn nuts alongside."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022953-grilled-portobellos-with-chile-sauce-sour-cream-and-corn-nuts"}