{"@context": "http://schema.org", "@type": "Recipe", "name": "Cumin Tofu Stir-Fry", "description": "Many people may not think of cumin as a traditional seasoning for Chinese food, but the earthy spice is found regularly in the cuisine of Xi’an, a city in northwest China that is the eastern origin of the ancient trade route known as the Silk Road. Cumin, chile and Sichuan peppercorns are used generously, resulting in bold, not-for-the-faint-of-heart dishes that combine Chinese and Middle Eastern flavors. This recipe, which is adapted from “To Asia, With Love” by Hetty McKinnon, is a vegan riff on the signature lamb dish at Xi’an Famous Foods, a restaurant chain in New York, that is made with chunks of meat dry-fried in a heavy cumin spice mix. This version features tofu and cauliflower.\n \nTo get vegetarian recipes like this one delivered to your inbox, sign up for <a href=\"https://www.nytimes.com/newsletters/the-veggie\">The Veggie</a> newsletter.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2021/07/28/dining/hm-cumin-tofu/hm-cumin-tofu-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, main course", "keywords": "cauliflower, cumin, extra-firm tofu, gochugaru, ground cumin, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1491}, "recipeIngredient": ["1 tablespoon tamari or soy sauce", "1 tablespoon shaoxing rice wine (or dry sherry, mirin or white wine)", "1/2 teaspoon kosher salt", "1 (14-ounce) package extra-firm tofu, drained and cut into ¾-inch cubes", "3 tablespoons potato starch or cornstarch", "2 tablespoons ground cumin", "2 teaspoons gochugaru (Korean red chile flakes), red-pepper flakes or Sichuan chile flakes", "1/2 teaspoon granulated sugar", "1/2 teaspoon kosher salt", "Vegetable or other neutral oil", "1 onion, finely sliced", "1 (1/2- to 1-inch) red chile, such as serrano (or jalapeno), sliced diagonally (seeds removed if you like less heat)", "1 (1-inch) piece of ginger, peeled and finely chopped", "1 garlic clove, finely chopped", "10 1/2 ounces cauliflower, cut into bite-size florets (about 3 ½ cups)", "Big handful of cilantro leaves", "1 tablespoon toasted white sesame seeds", "Kosher salt", "Rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the marinated tofu: Combine the tamari or soy sauce, shaoxing rice wine and salt in a bowl. Add the tofu cubes and toss to coat. Allow to marinate at room temperature for 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the spice mix: Combine cumin, gochugaru, sugar and salt in a small bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the tofu. Place the potato starch or cornstarch in an even layer on a plate, add the marinated tofu cubes and turn gently to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large frying pan over high for 3 minutes. Drizzle with 2 tablespoons oil and add a tofu cube. If the oil sizzles, it’s hot enough. Add all the tofu cubes, being careful of spattering, arranging them in one layer and separating them from one another. Reduce the heat to medium and allow the tofu to cook, undisturbed, for 1 to 2 minutes, until the bottom is golden. Flip the tofu and cook until golden on all sides. Transfer the tofu to a plate lined with paper towels. Wipe out the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a little more oil to the pan, toss in the onion, chile, ginger and garlic, and stir-fry for about 1 minute until fragrant. Add the cauliflower, season with salt and stir-fry for 4 to 6 minutes, until the cauliflower is just tender. (Add 1 to 2 tablespoons of water, if needed, to help move it along, while still keeping the dish dry.) Add the tofu, along with the spice mix, and stir to combine. Take the pan off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste and season with a touch of salt, if needed. Top with the cilantro and sesame seeds, then toss everything together, and serve with rice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022438-cumin-tofu-stir-fry"}