{"@context": "http://schema.org", "@type": "Recipe", "name": "Salt-and-Pepper Roast Turkey Breast", "description": "A bone-in turkey breast is significantly easier to cook than a whole bird, it takes a fraction of the time, and it still feeds a group comfortably. To ensure succulence, you could apply <a href=\"https://cooking.nytimes.com/recipes/1012869-dry-brined-turkey\">a dry brine</a> the night before, but when you’re cooking just a breast, the greatest insurance against dryness is pulling it out of the oven the moment it’s done, and no later. (For that, rely on an electric instant-read meat thermometer; it’s the only way to get a truly accurate read on the internal temperature of your meat.) I like to roast turkey the way I roast chicken: unbrined but slathered in butter, showered with salt and pepper and popped into a moderately hot oven to get crispy skin. Once the slices are fanned out on a platter tumbled with lemon wedges, it looks like a veritable feast.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2021/11/17/dining/15BEGINNERREX1-TURKEY/merlin_197340726_ff048808-36a4-47db-a8f8-29df1e8ae360-articleLarge.jpg", "totalTime": "PT12H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "poultry, main course", "keywords": "butter, lemon, turkey breast, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 567}, "recipeIngredient": ["1/2 cup unsalted butter, very soft", "Kosher salt and freshly ground black pepper", "1 whole (6- to 8-pound) bone-in turkey breast (see Tip)", "4 lemons, quartered, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Keep the butter nearby. Place about 1/4 cup kosher salt in a small bowl and keep nearby as well, along with a black-pepper grinder. Transfer the turkey breast to a large sheet pan and thoroughly dry all over with a paper towel; get it as bone-dry as you can."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands, very liberally rub the butter all over the turkey breast. (If the butter is difficult to spread, soften it further in the microwave in 10-second intervals.) Make sure to slather the butter on the underside and bones in addition to the entire surface of the skin. Wipe your hands with a towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously season the turkey all over with salt, especially inside the cavity. You don’t have to be precise here, but do go heavy on the salt — the turkey can take it. (In general, you should account for about 1 teaspoon Diamond Crystal kosher salt or 3/4 teaspoon Morton coarse kosher salt per pound.) Next, generously grind black pepper all over the turkey; again, no need to measure this. Let the turkey breast sit so the seasoning can penetrate the meat and allow the bird to come to room temperature, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, position a rack in the bottom third of the oven and heat oven to 350 degrees. Place the turkey breast in the oven, then with the oven door still open, carefully pour 1 cup water into the sheet pan with the turkey. Close the oven door and roast until the turkey’s internal temperature reaches 150 degrees, 13 to 15 minutes per pound. (To read the temperature, insert an instant-read thermometer into the thickest part of one of the breasts, making sure to avoid the bone, which will give you an inaccurate reading.) Very carefully rotate the pan halfway through roasting and add another cup of water if the pan looks dry. When done roasting (1 1/2 to 2 hours), the skin should be golden brown and crispy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the turkey breast rest in its pan, uncovered, until cool enough to handle, at least 30 minutes and up to 1 hour. Transfer to a cutting board. Cut along one side of the breastbone with a sharp knife, then the other, cutting each breast off the bone, and keeping the skin intact. Thickly slice each breast crosswise and serve on a large platter scattered with the lemon quarters. Taste the pan juices and, if they’re a little salty, stir in a little hot water. If they need more seasoning, stir in salt and pepper. Spoon the pan juices over and around the sliced turkey."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022747-salt-and-pepper-roast-turkey-breast"}