{"@context": "http://schema.org", "@type": "Recipe", "name": "Flourless Chocolate Cake", "description": "Crackly on top and fudgy yet tender in the center, this cake tastes like a complex restaurant dessert, but comes together effortlessly in one bowl. Chocolate chips save you the messy step of chopping chocolate bars and deliver deep flavor along with cocoa powder. If you don’t have a springform pan, a regular cake pan lined with foil all around makes it easy to lift out the delicate cake, which melts in your mouth when served warm or at room temperature. Refrigerated or frozen leftovers take on a candylike chewiness, but a quick zap in the microwave will return it to just-baked softness. Slices are delicious on their own or with any creamy toppings.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/02/16/dining/11korex-chocolate/merlin_200212497_081f3ab6-1907-4e1c-aee9-6027e118b9db-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "easy, dessert", "keywords": "chocolate cake, chocolate chips, cocoa powder, make-ahead, one bowl, gluten-free, mother’s day, valentine’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1723}, "recipeIngredient": ["3/4 cup/168 grams unsalted butter, cut up, plus more for greasing the pan", "1 cup/173 grams bittersweet or semisweet chocolate chips", "1/2 cup/50 grams unsweetened natural cocoa powder", "3/4 cup/150 grams granulated sugar", "4 large eggs", "1 teaspoon pure vanilla extract", "Whipped cream or ice cream, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Generously butter the bottom and sides of an 8-inch springform pan, or press a large sheet of foil into the bottom and up the sides of an 8-inch round cake pan, smoothing the sides, and generously butter the foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a few inches of water in a large saucepan to a simmer over medium heat. Set a large heatproof bowl over the saucepan and add the chocolate. When the chips look soft and melty, stir gently until smooth. Turn off the heat, and add the butter to the bowl. Stir gently until melted and smooth. Add the cocoa powder and stir until smooth, then take the bowl off the saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the granulated sugar until incorporated, then add the eggs, one at a time, and beat well after each addition. Stir in the vanilla, then scrape the batter into the prepared pan and smooth the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until crackly and dry on top, and a toothpick inserted 2 inches from the edge comes out clean, 40 to 50 minutes. A toothpick inserted in the center should come out with some crumbs attached."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool in the pan on a rack, then remove the sides of the springform pan or lift the cake out of the cake pan using the foil overhang. You can slice and serve warm or at room temperature. Or, to cut very neat slices, freeze the cooled cake until firm. Slice and warm up in the microwave or oven, if preferred. Serve the cake with whipped cream or ice cream, if you’d like. The cake can be wrapped and kept at room temperature for up to 3 days, in the refrigerator for up to 1 week or in the freezer for up to 1 month."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022963-flourless-chocolate-cake"}