{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramelized Apple King Cake", "description": "Though there are many versions of king cake — the pastry eaten from Twelfth Night through Mardi Gras — many New Orleanians trace their best memories back to their local bakery. Such is the case for the Creole chef and New Orleans native Dominick Lee. His recipe was inspired by childhood memories of king cakes with apple filling served in the city’s Gentilly neighborhood. Mr. Lee retains that filling in his cake and takes inspiration from global influences, adding a fragrant orange blossom cream-cheese frosting. True to tradition, a plastic baby is hidden within the cake. The person who finds and eats the slice with the baby is promised luck and prosperity, and — fair warning — is also responsible for providing the next cake.", "author": {"@type": "Person", "name": "Kayla Stewart"}, "image": "https://static01.nyt.com/images/2022/01/05/dining/04KINGCAKEREX/merlin_199582518_c01765ae-60d5-494c-be98-a64ef03b51fc-articleLarge.jpg", "totalTime": "PT6H", "recipeYield": "12 to 16 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 232}, "recipeIngredient": ["3 medium Granny Smith apples (340 grams/3/4 pound), peeled, cored and cut into 1/2-inch wedges", "1/2 packed cup/110 grams brown sugar", "2 tablespoons all-purpose flour", "1 tablespoon unsalted butter", "1 tablespoon fresh lemon juice", "1/2 teaspoon ground cinnamon", "1/4 teaspoon ground nutmeg", "1/8 teaspoon ground cloves", "1 (1/4-ounce) packet active dry yeast (2 teaspoons)", "1/4 cup warm water", "3 tablespoons plus 1 1/2 teaspoons granulated sugar ", "4 tablespoons/57 grams unsalted butter, plus more for greasing the bowl", "1/2 teaspoon fine salt", "1 cup/226 grams sour cream", "1 large egg", "3 cups/390 grams all-purpose flour, plus more as needed", "Egg wash (1 egg mixed with 1 tablespoon water), for brushing the dough", "1 plastic baby, for decorating", "4 ounces/113 grams cream cheese, at room temperature", "4 tablespoons/57 grams unsalted butter, at room temperature", "2 teaspoons pure vanilla extract", "1/4 teaspoon orange blossom water", "3 cups/330 grams confectioners’ sugar", "2 tablespoons whole milk or heavy cream", "Purple, gold and green sparkling sugar or edible glitter sprinkles, for decorating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Place the apples, brown sugar, flour, butter, lemon juice, cinnamon, nutmeg, cloves and 1/2 cup water in a large saucepan and stir well. Bring to a simmer over high heat, then reduce the heat to medium and cook, stirring frequently, until the apples are completely softened but still retain their shape, about 25 minutes. Watch carefully near the end and stir as the mixture will begin to stick to the pan as it caramelizes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the apples cook, prepare the dough: In a small bowl, mix yeast, warm water and 1 1/2 teaspoons sugar. Set aside to allow yeast to become active and foamy, 5 to 10 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine butter with salt and remaining 3 tablespoons sugar and melt over medium-low heat, about 4 minutes. Whisk in sour cream until incorporated. Remove from heat and let cool slightly, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, combine butter mixture, yeast mixture, 1 egg and 1 1/2 cups/195 grams flour. Beat on medium-low speed until smooth. Gradually add remaining 1 1/2 cups/195 grams flour and continue to mix until a dough forms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a floured work surface, knead the dough by hand, adding more flour if needed, until the dough is elastic and smooth, 5 to 12 minutes. It should be sticky but not sticking to the surface. Butter a large bowl and place dough inside. Cover and let rise in a warm place until it has doubled in size, 1 to 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently punch down the dough, transfer it to a floured work surface, and roll it out into a 24-by-12-inch rectangle. Be gentle so as to not tear the dough. Spread the apple filling on one long side of the dough to cover half of the dough, leaving a 1-inch border along the edges. Starting with the long side closest to you, fold the border over the filling and tightly roll up the dough in a spiral, enclosing the apple filling as you go. Carefully transfer the roll seam side down to a large parchment paper-covered baking sheet. Moisten ends with water, then bring both ends together to form a ring. Cover and let rise in a warm place until doubled in size, about 1 hour. While the dough rises, heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the egg wash all over the cake. Bake until golden brown, 25 to 30 minutes. Let cool for 2 hours before frosting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While cake cools, make the frosting: In a mixing bowl or the bowl of an electric mixer, combine the cream cheese, butter, vanilla and orange blossom water. Mix slowly by hand or with a hand or stand mixer until well combined, then gradually add the confectioners’ sugar and mix until incorporated. Continue mixing while slowly adding the milk, 1 tablespoon at a time, to thin out the frosting. The frosting should be thin enough to spread, but not too runny."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully flip the cooled cake and cut a small X in the bottom of the ring. Insert the plastic baby and flip the cake back over. Frost the cake and decorate with alternating stripes of gold, green and purple sprinkles."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022851-caramelized-apple-king-cake"}