{"@context": "http://schema.org", "@type": "Recipe", "name": "Bún Kèn (Coconut Fish With Noodles)", "description": "This version of bún kèn, a deeply delicious street food specialty of Kiên Giang Province in southern Vietnam, comes from the chef Diep Tran, who traveled to the region while researching “The Red Boat Fish Sauce Cookbook,” written with Cuong Pham and Tien Nguyen. The dish is built by infusing fish stock with aromatics and coconut cream, then ladling this fish curry over rice noodles and topping the bowls with fresh herbs, vegetables and a drizzle of sweet and salty coconut nuoc chăm. While you can often find yellowtail collar at Japanese and Korean markets in the United States, Ms. Tran suggests using a snapper head or grouper head, or any small whole fish that isn’t too oily, if you can’t get your hands on collar.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2022/01/30/dining/30EAT-bun-ken/merlin_200923113_05d5cc4f-6443-4dde-a1a6-130436e8b886-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "4 servings", "recipeCuisine": "vietnamese", "recipeCategory": "dinner, seafood, main course", "keywords": "lemongrass, rice noodles, yellowtail", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 199}, "recipeIngredient": ["1 pound yellowtail collar, or whole small fish", "1 shallot, halved", "1/2 teaspoon whole black peppercorns", "1 lemongrass stalk, bruised with the back of a knife", "1 cup cilantro stems, bruised with the back of a knife", "1/4 cup fish sauce", "2 fresh Thai chiles or other small hot chiles, minced", "2 garlic cloves, minced", "1 teaspoon lime juice", "1 cup grated palm sugar or granulated sugar (6 ounces)", "3/4 cup plus 2 tablespoons unsweetened coconut water (7 ounces)", "12 tablespoons annatto oil or vegetable oil", "1 medium white onion, diced", "5 lemongrass stalks, tender white, purple and pale green parts minced", "2 ounces cilantro root, minced (1/2 cup) or 4 ounces cilantro stems, minced (1 cup; see Tip)", "2 tablespoons minced garlic", "3 tablespoons turmeric powder", "1/2 cup coconut cream or 1 cup coconut milk", "6 fresh makrut lime leaves, midribs removed, minced", "2 to 4 fresh Thai chiles or other small hot chiles", "1/4 cup fish sauce", "2 (8-ounce) packages dried vermicelli rice noodles", "1 bunch rau răm (Vietnamese coriander)", "2 cups bean sprouts", "1 bunch basil leaves", "1 bunch cilantro leaves", "1 carrot, peeled and shredded (see Tip)", "1 Japanese cucumber or 2 Persian cucumbers, shredded", "1 small green papaya, seeds removed, peeled and shredded"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the stock: Place the yellowtail collars in a pot large enough to fit them snugly, then add the shallot, peppercorns, lemongrass, cilantro stems and 5 cups water. The fish should be completely covered. If they aren’t, add a bit more water. Bring the water to a boil over high heat, then reduce the heat to low and simmer uncovered for 20 minutes. Turn off the heat, strain the stock and reserve the fish, setting it aside to cool. Return the strained stock to the pot, discarding the other solids. When the fish is cool enough to handle, separate the meat from the bones, return the meat to the stock and let stand off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the nuoc chăm: In a small pot over high heat, bring all the ingredients to a boil, stirring to dissolve the sugar. Remove from the heat and let cool before transferring to a jar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the curry: In a medium saucepan over medium-high heat, add 3 tablespoons oil and the onion. Spread the onion out evenly in the pan and let it fry without touching it, so it gets slightly charred at the edges, about 5 minutes. Tip the onion and oil into the fish stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the heat to medium and add the remaining 9 tablespoons oil, the lemongrass, cilantro root and garlic. Stirring constantly, cook until tender and fragrant, about 5 minutes. Add the turmeric powder and stir for 15 seconds, then tip everything in the saucepan into the fish stock. To the same saucepan, add the coconut cream, makrut lime leaves and chiles, and turn the heat up to high. Use a wooden spoon or heatproof spatula to scrape up any bits of lemongrass, cilantro or garlic that may be stuck to the bottom of the pan. When the cream starts to boil, turn off the heat and let it steep for about 10 minutes. Pour the coconut cream and fish sauce into the stock, turn the heat to low and stir the curry sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cream steeps, prepare the noodles: Cook the rice noodles according to the package directions and drain well. In each bowl, layer noodles and fish curry, then top with a pinch of the rau răm, bean sprouts, basil, cilantro, carrot, cucumber and green papaya. Put the rest of the toppings on the table, along with the nuoc chăm, for seasoning."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022940-bun-ken-coconut-fish-with-noodles"}