{"@context": "http://schema.org", "@type": "Recipe", "name": "Birthday Baked Alaska", "description": "Baked alaska is beautiful, elegant and dramatic. It’s easy to make; it’s convenient (it must be made ahead); it’s got ice cream (enough said); it’s got meringue — which is the same as saying it’s got magic. It looks gorgeous whole and just as gorgeous sliced; it’s creamy and icy cold inside, marshmallowy all around and warm on the edges. In other words, it’s perfect. This one was made in the colors of the French flag to celebrate the 117th birthday of the French nun, Sister André. Reverse the colors for the Fourth of July — it’s what the creator of this recipe, Zoë François, did originally — or use whatever flavors of ice cream you love; the loaf pan will hold 2 quarts.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2021/04/04/magazine/04mag-eat/04mag-eat-articleLarge.jpg", "totalTime": "PT8H", "recipeYield": "12 servings", "recipeCuisine": "american", "recipeCategory": "snack, cakes, dessert", "keywords": "ice cream, kirsch, ladyfingers, strawberries, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 583}, "recipeIngredient": ["1 cup/125 grams sliced fresh strawberries (cut 1/4-inch thick; not thicker)", "1/4 cup/50 grams granulated sugar", "2 teaspoons fresh lime or lemon juice", "1 pint/480 milliliters premium or homemade blueberry ice cream", "1 pint/480 milliliters premium or homemade vanilla ice cream", "1 cup/120 grams shredded, sweetened coconut", "1 quart/960 milliliters premium or homemade strawberry ice cream", "Enough ladyfingers to cover the bottom of the cake (about 10 to 20, depending on their size)", "1 cup/240 milliliters egg whites (from about 8 large eggs)", "2 cups/400 grams granulated sugar", "1/4 cup/60 milliliters kirsch (omit if using a torch)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Line a 9-by-5-by-3-inch loaf pan with plastic wrap or parchment paper, leaving an overhang."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the sliced strawberries, sugar, and lime or lemon juice in a small bowl, stir and set aside for 2 hours while you put together the rest of the cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Each type of ice cream has to be softened before you can use it, so, as you need it, cut it into hunks, put the pieces in a large bowl, and bash and beat them with a sturdy flexible spatula or wooden spoon until spreadable. If you’re using homemade ice cream, you can take it straight from the ice cream maker."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soften the blueberry ice cream, then spread it evenly over the bottom of the loaf pan. Smooth the top. Cover, and freeze for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soften the vanilla ice cream, stir in the coconut, then smooth it over the blueberry ice cream. Level the top. Cover, and freeze for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the strawberries. Soften the strawberry ice cream, and stir the berries into it. Spread the ice cream over the vanilla layer, and smooth the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently press ladyfingers into the soft ice cream to make a base layer; don’t worry if you have some bare spots. Cover, and freeze until firm, at least 4 hours. (You can do this up to 1 week in advance of serving, if you’d like.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At least 1 hour (or up to 8 hours) before serving, make the meringue: Bring a few inches of water to a simmer in a large saucepan that can hold the bowl of a stand mixer or a large bowl that you can use with a hand mixer. Whisk the egg whites and sugar together in the bowl, place the bowl over the water — making sure it’s not touching — and whisk until the sugar is completely dissolved and smooth. The mixture should be 160 degrees. Don’t rush this; it needs about 10 minutes. If necessary, attach the bowl to the mixer, and fit with the whisk. Beat the meringue on medium-high speed for about 6 minutes, or until it’s fluffy, glossy and holds stiff peaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unmold the ice cream cake onto a serving platter, one that is large enough to catch the kirsch, if you’re using it, and peel away the plastic or paper. Using a spatula, cover the sides with a thick layer of meringue — creating swirls, if you’d like — and cover the top with a thinner one."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Now you have a choice: You can pipe meringue spikes over the top, layer more meringue on top, and swirl or spike it with the back of a spoon, or make spikes by hand by pulling it into points with your fingers. Continue until you’ve got a pattern you like. Freeze the cake for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish the cake, use a kitchen torch to brown the meringue on the top of the cake or use flaming kirsch: Put the kirsch in a small pan over low heat for about 2 minutes. Carefully light the kirsch with a long match. Slowly drizzle the flaming alcohol evenly over the entire cake, and watch it toast the meringue. It will burn off on its own."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut into thick slices, and serve immediately. You can keep the cake covered and frozen for a day, but it’s at its best the day it is made."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022050-birthday-baked-alaska"}