{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Roast Fish With Lemongrass and Ginger", "description": "A marinade packed with aromatics, like lemongrass, ginger, shallots and scotch bonnet chile, is crushed in a mortar and pestle and spread onto a mild white fish, such as a whole branzino, in this recipe. As with most marinades, the longer you let it steep, the better. Using the mortar and pestle is optional, but a highly rewarding process — and encouraged. If you have an asanka, the grooved surface will give the marinade a unique texture, with bouquets rising from the bowl as you work. Serve the roast fish flaked off the bone, over rice or alongside a fresh green salad.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2021/10/27/dining/22Komolaferex/merlin_196519761_a7942458-6e28-4a66-8df2-6bc9ba07f4e6-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weekday, seafood, main course", "keywords": "fish, ginger, lemongrass, kwanzaa", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 201}, "recipeIngredient": ["2 1/2 pounds whole fish, scaled and cleaned (about 3 whole branzino)", "6 tablespoons neutral oil, such as grapeseed or canola oil ", "1 1/2 tablespoons kosher salt (Diamond Crystal)", "1 stalk lemongrass (about 2 1/4 ounces), tough outer part discarded, chopped", "1 (2-inch) piece ginger, scrubbed and chopped", "4 scallions, green parts sliced and white parts trimmed and left whole", "1 scotch bonnet chile, with or without seeds, chopped", "1 shallot, peeled and chopped", "2 lemons ", "1/2 teaspoon ground turmeric", "1/2 cup full-fat coconut milk", "10 cilantro sprigs, cut crosswise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Pat the body and inside of the fish dry, and space the fish evenly apart on an unlined sheet pan. Using a sharp knife, cut two diagonal slits, 2 inches apart, into the skin of each fish, making sure not to cut through to the bone. Repeat the slits on the other side. Drizzle both sides and the inside of the fish with 3 tablespoons oil, and season with the 1 1/2 tablespoons salt. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches if necessary, transfer the lemongrass to the bowl of an asanka or a mortar. Use the pestle to pound the lemongrass pieces until crushed and fragrant. Move the crushed pieces to one side of the mortar bowl or the asanka. Add the ginger pieces and repeat the pounding process until they’re crushed. Combine the ginger and the lemongrass. Add the scallion greens and scotch bonnet chile. Use the pestle to crush and combine these with the lemongrass mixture. Add the shallot and zest of 1 lemon, crush and combine with the pestle. Stir in the turmeric and coconut milk. (Makes about 1 1/4 cup marinade.) Alternatively, you can do this step in a food processor. Add in the ingredients in the order listed, and pulse them all together. Stir in the turmeric and coconut milk. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the zested lemon into 3 or 4 rounds. Spread the marinade generously over both sides of each fish and about 2 tablespoons into each cavity. Place a lemon slice, the white end of a scallion and some cilantro sprigs in each cavity. (At this point, the fish can be left to marinate for up to 30 minutes, or covered and refrigerated overnight.) Drizzle the tops of the fish with the remaining oil. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the fish until firm and cooked through, rotating the sheet pan once halfway through the process, about 22 to 25 minutes. Slice the remaining lemon into wedges. Serve the fish over steamed rice or alongside a hearty salad, with the lemon wedges for squeezing."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022668-whole-roast-fish-with-lemongrass-and-ginger"}