{"@context": "http://schema.org", "@type": "Recipe", "name": "Camarones Embarazados (Adobo Grilled Shrimp)", "description": "Camarones embarazados translates to pregnant shrimp, but these crustaceans aren’t necessarily carrying roe. The catchy name is a play on words: “en vara” means on a stick, and “asado” means roasted, and together, “en vara asado” sounds like “embarazado.” These shrimp are soaked with an adobo that becomes a crunchy crust when grilled. This take on the dish, which spread from Puerto Vallarta on the Pacific coast of Mexico to beaches all over the country, combines guajillo chiles and chiles de árbol with the surprising addition of Mexican chocolate. The chocolate rounds out the sharpness of the adobo and provides a caramelized finish. Simmered extra adobo is delicious for dipping the shrimp hot off the coals.", "author": {"@type": "Person", "name": "Pati Jinich"}, "image": "https://static01.nyt.com/images/2021/08/04/dining/29CAMARONESREX/merlin_190467330_64a9033c-39c0-4473-865d-0a219eae88c9-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "mexican", "recipeCategory": "seafood, skewers and kebabs, appetizer, main course", "keywords": "guajillo chiles, mexican chocolate, shrimp, tomatoes", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 114}, "recipeIngredient": ["1 pound ripe tomatoes", "4 dried guajillo chiles, stemmed and seeded", "2 to 3 dried chiles de árbol, stemmed", "3 garlic cloves, peeled", "2 scallions, white and light green parts only, cut into 1-inch pieces", "1 teaspoon dried oregano", "1/2 teaspoon ground allspice", "1/2 teaspoon ground cumin", "1/2 teaspoon dried thyme", "2 tablespoons apple cider vinegar", "2 tablespoons unsalted butter", "2 ounces Mexican chocolate (see Tip), grated", "1 teaspoon coarse kosher salt, more for seasoning", "2 pounds large head-on shrimp or headless shrimp, with or without shells", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine the whole tomatoes, guajillo chiles, chiles de árbol and garlic cloves, and cover with water by an inch or two. Bring to a boil over medium-high heat, then reduce heat to medium and simmer until the tomatoes are very soft and their skins start to break, 8 to 10 minutes. (The chiles should rehydrate and plump up.) Using a slotted spoon, transfer the solids to a blender, and add the scallions, oregano, allspice, cumin, thyme, vinegar, butter, Mexican chocolate and salt. (Discard the cooking water.) Purée until completely smooth, then scrape the adobo into a large bowl and let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the shrimp in the bowl with the cooled adobo and toss to coat. Cover and refrigerate for at least 1 hour and up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to eat, take the shrimp out of the refrigerator. Prepare an outdoor charcoal or gas grill for direct grilling over high heat. Thread the shrimp onto skewers and place on a sheet pan. If using head-on shrimp or shell-on shrimp, insert the skewer where the head meets the body, thread the skewer through the body while straightening it out, then push it out through the tail end. If using peeled shrimp, thread the skewer through the tops and bottoms of the shrimp without passing it through the length of the bodies. Once all are skewered, generously douse the shrimp with more adobo (reserve some for serving) and sprinkle a bit of salt on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the remaining adobo into a small saucepan or skillet and set over medium heat. Bring to a simmer and continue simmering, stirring constantly, for 3 to 4 minutes. Scrape into a serving bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the skewers on the hot grill grate. For head-on shrimp, cook, flipping once, until the shells have crisped, browned and achieved some charring, and the bodies have cooked through, 3 to 4 minutes per side. For headless shell-on shrimp, grill for about 3 minutes per side, and for peeled shrimp, about 2 minutes per side. (If using a gas grill, close the lid between flips.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the skewers to a platter and serve with the reserved adobo sauce and lime wedges. Let everyone eat by dipping the shrimp in the adobo sauce and squeezing fresh lime juice on top. The shrimp can be eaten in their entirety — heads, shells, tails and everything in between — or peeled."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022412-camarones-embarazados-adobo-grilled-shrimp"}