{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon-Labneh Possets With Meringue and Burnt Lemon Powder", "description": "“Simple ingredients made super special” could not be more true of these lemon possets, which are well worth the effort for their perfect combination of creamy, tart, sweet and crispy. A posset is a quintessential British dessert and has a similar consistency to that of a custard or pudding, but acid (lemon juice in this case) is used to set the base as opposed to egg yolks or cornstarch. There are a number of shortcuts you could take, including using store-bought labneh or replacing it with an equal amount of thick-set créme fraîche. You can also use store-bought meringues, crushing them lightly to sprinkle on top. The burnt lemon powder is an added bonus and a great way to use up lemon peel that you may have otherwise discarded. You can use this powder in a number of inventive ways, including sprinkling it over hummus or some roasted vegetables for added depth. If you are making your own labneh, be sure to start the day before.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2021/08/25/dining/20Ottorex/merlin_193269204_1ecca0c5-d342-4420-9eb8-75b5c2ce22ae-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "8 possets", "recipeCuisine": "", "recipeCategory": "custards and puddings, dessert", "keywords": "cream of tartar, egg whites, heavy cream, labneh, lemon", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 210}, "recipeIngredient": ["1 pound/450 grams Greek yogurt", "1/2 teaspoon kosher salt", "1 tablespoon lemon zest (from 1 to 2 lemons)", "3/4 cup plus 2 teaspoons/200 grams lemon juice (from about 4 to 5 lemons)", "1 1/4 cups/250 grams granulated sugar", "2 3/4 cups/650 grams heavy cream (double cream)", "7 ounces/200 grams labneh (homemade or store-bought)", "1/2 cup plus 1 tablespoon/115 grams granulated sugar", "2 egg whites (65 grams), from 2 large eggs", "1/8 teaspoon cream of tartar", "2 unwaxed (or well-scrubbed) lemons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the labneh: Add yogurt and salt to a bowl and mix well to combine. Line a medium sieve with a piece of cheesecloth or a clean tea towel with plenty of overhang. Add yogurt, and pull the overhang up and over the yogurt to encase it. Set the sieve over a bowl and place a weight on top. (A couple of cans — or tins — will do.) Refrigerate for 24 to 48 hours. When ready, discard the liquid collected and store the labneh in a sealed container in the refrigerator for up to 3 days. (You should have about 9 ounces/250 grams of labneh.) If using store-bought labneh, skip this step."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Measure out a scant 1/2 cup (about 7 ounces/200 grams) of labneh for the possets, and reserve the rest for breakfast or to spread onto toast."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the possets: Combine lemon zest, juice and sugar in a medium saucepan and bring to a boil over medium-high heat, stirring occasionally to dissolve sugar. Set aside once the sugar has dissolved. In a separate medium saucepan, heat heavy cream (double cream) over medium until it just gently starts to bubble, 7 to 10 minutes. Off the heat, pour all the cream into the lemon mixture and whisk until combined, then whisk in labneh until smooth. Strain mixture through a fine-mesh sieve set over a jug with a spout. Divide mixture across 8 glasses. Refrigerate for at least 4 hours, or overnight if you’re getting ahead."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the meringue: Heat oven to 350 degrees Fahrenheit/180 degrees Celsius. Spread sugar onto a baking sheet (baking tray) and heat for 10 minutes, until very hot but not melted at all. A couple of minutes before it’s ready, add egg whites and cream of tartar to a stand mixer fitted with the whisk attachment (or alternatively, use an electric hand mixer), and beat on medium until frothy, about 1 minute. Remove sugar from oven and turn down the temperature to 250 degrees Fahrenheit/120 degrees Celsius. Turn mixer speed to low and slowly stream in the warm sugar until it’s all incorporated. Turn the speed back up to high, and beat until glossy and stiff peaks form, another 5 to 6 minutes. Line a large (roughly 16-by-12-inch/40-by-30-centimeter) baking sheet (baking tray) with parchment paper and use a spatula to thinly spread the mixture onto the lined tray, so it’s about 14 by 10 inches/35 by 25 centimeters. Bake for 80 to 90 minutes, until completely dried out. Set aside to cool, about 30 minutes, then roughly break apart into random shards."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the burnt lemon powder: Turn oven up to 450 degrees Fahrenheit/240 degrees Celsius. Use a small, sharp knife to cut the peel off the lemons in long strips. (Don’t worry if you get some of the pith.) You want about 1 ounce/30 grams in total. Transfer strips to a small, parchment-lined baking sheet (baking tray). Bake for 12 to 15 minutes, until completely dry and almost burned. (They’ll shrivel significantly.) Transfer to a pestle and mortar to finely grind, then pass through a sieve, to catch any large pieces. (Discard these.) You should be left with about 1 1/2 teaspoons."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Segment the lemons: Using the small, sharp knife, trim off any excess peel, then cut between the membranes to release the segments. Roughly chop each segment into 2 to 3 pieces. (Use them all if you like things a little sharp, or keep any extra in the fridge for a vinaigrette or salsa verde.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, top possets with lemon segments, a sprinkling of burnt lemon powder and a few meringue shards, serving any extra meringue to dip alongside."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022475-lemon-labneh-possets-with-meringue-and-burnt-lemon-powder"}