{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Bowl Carrot Cake", "description": "The tangy, rich cream cheese topping on this cake can travel — even on a hot day. Silky with sour cream, it bakes right over the batter and develops a caramelized flavor reminiscent of Basque cheesecake. As it cools, the deeply browned surface ripples, and the custardy cream cheese layer sets. The carrot cake beneath packs more carrots than most classic versions for a more complex natural sweetness and fine, sturdy crumb. Both batters are mixed by hand in the same bowl, making prep and clean up especially easy.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2021/04/29/dining/gk-carrot-cake/gk-carrot-cake-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "One 8-inch cake", "recipeCuisine": "", "recipeCategory": "easy, dessert", "keywords": "birthday, easter, carrot, carrot cake, cream cheese, one bowl, sour cream", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2840}, "recipeIngredient": ["1 (8-ounce/226-gram) block cream cheese, softened", "1/2 packed cup/73 grams confectioners’ sugar", "1/4 teaspoon fine sea salt", "1 large egg", "1/2 cup/120 grams sour cream", "Nonstick cooking spray", "2 large eggs", "3/4 cup/168 grams granulated sugar", "1/2 cup/100 grams neutral oil, such as vegetable oil", "1 cup/135 grams all-purpose flour", "1 teaspoon <a href=\"https://cooking.nytimes.com/recipes/1021926-sweet-baking-spice\">sweet baking spice</a> or any combination of ground cinnamon, cardamom, ginger or nutmeg", "1/2 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon fine sea salt", "2 packed cups/260 grams coarsely grated peeled carrots (from 3 medium carrots)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Lightly coat an 8-inch square baking pan with cooking spray. Line the bottom and sides with parchment paper, and spray again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the topping: Whisk the cream cheese in a large bowl until smooth. Add the confectioners’ sugar and salt, and stir slowly with a whisk until no traces of sugar remain, then whisk rapidly until smooth. Add the egg and whisk until fully incorporated, then whisk in the sour cream until smooth. Using a silicone spatula, scrape the mixture into a pastry bag fitted with a 1/2-inch plain tip or a gallon-size resealable plastic bag, and set aside. Reserve the bowl, whisk and spatula without washing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake batter: Combine the eggs and granulated sugar in the reserved bowl and beat with the whisk until evenly combined. While whisking, add the oil in a steady stream and whisk until emulsified. Add the flour, spice, baking powder, baking soda and salt, and use the spatula to fold into the wet ingredients just until the dry ingredients disappear. Add the carrots and fold until evenly distributed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the cake batter into the prepared pan and spread evenly. If using a plastic bag, snip a 1/2-inch hole in a lower corner. Pipe the topping gently and evenly over the batter to completely cover it. It’s OK if it looks bumpy; it will even out in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the top is golden brown and a toothpick inserted in the center comes out with bits of the topping but no cake batter, 50 to 60 minutes. (If your cream cheese layer doesn’t take on very much color by the time the cake has finished cooking, you can broil it until the top is browned in spots, 1 to 2 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool completely in the pan on a wire rack. Cut directly in the pan to serve, or slide out of the pan using the parchment paper to cut into squares. The cake can be refrigerated in an airtight container for up to 5 days. Bring to room temperature before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022160-one-bowl-carrot-cake"}