{"@context": "http://schema.org", "@type": "Recipe", "name": "Dami-yeh Gojeh Nokhod Farangi (Tomato-Egg Rice)", "description": "This comforting Iranian dami (rice cooked with vegetables) bridges the transition between spring and summer with early tomatoes and perennial frozen green peas —  but tastes great any time of year. Dami-style rice is stickier than other Iranian rice dishes. Delicately scented with turmeric and cinnamon, it is often served with eggs on the side. This version cooks the eggs whole in their shells on top of the rice to make for a one-pot meal.", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2021/06/02/dining/ND-tomato-rice-with-egg/ND-tomato-rice-with-egg-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings ", "recipeCuisine": "", "recipeCategory": "grains and rice, main course", "keywords": "basmati rice, egg, peas, tomato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 412}, "recipeIngredient": ["2 medium tomatoes", "3 tablespoons extra-virgin olive oil, plus more for serving", "1 medium yellow onion, diced", "4 garlic cloves, finely grated", "Kosher salt (Diamond Crystal)", "1/2 teaspoon ground turmeric", "1/2 teaspoon black pepper, plus more for the eggs", "2 tablespoons tomato paste", "1 1/4 cups frozen green peas", "1 1/2 cups white basmati rice, rinsed well and drained", "1/2 teaspoon ground cinnamon", "2 tablespoons unsalted butter, cubed ", "4 large eggs, rinsed well ", "Fresh mint leaves, torn, and scallions, cut into 2-inch lengths, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tomatoes in half through their equators and scoop out the seeds with a spoon or your fingers as best as you can without getting obsessive about it. Discard the seeds and cut the tomatoes into 1/2-inch pieces, discarding the stem and core. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium or large saucepan with a lid, heat the oil over medium-high, add the onion and cook, stirring occasionally, until golden and browning slightly around the edges, about 6 minutes. Reduce the heat to medium-low, add the garlic and 1/2 teaspoon salt and cook, stirring frequently, until fragrant, about 2 minutes. Add the turmeric and pepper and stir until fragrant, about 30 seconds. Add the tomato paste and stir to cook off the raw taste and brighten the color, taking care not to burn the paste, about 1 minute. Add the tomatoes and 1 teaspoon salt. Stir and cook until the tomatoes start to soften and just begin to release their juices, about 3 minutes. Add the peas, rice and cinnamon, stir and cook for 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise the heat to high and add the butter, 2 1/2 teaspoons salt and 2 cups water. Stir and bring to a boil. With a spoon, gently place the eggs on top of the rice, spaced out evenly along the outer edges of the saucepan. They will sink a little bit. Cover, reduce the heat to low and cook just until the liquid has been absorbed, about 12 minutes. If you don’t have a glass lid, it’s OK to quickly lift the lid to check the liquid absorption. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lid and wrap it with a clean thin kitchen towel. Secure the towel by tying it in a knot or tucking it into the lid’s handle. Place the lid firmly back on the pot so that the towel can catch condensation, and allow the rice to continue steaming over low heat until it is cooked through, about 15 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a small bowl with ice water. With a spoon, transfer the eggs to the ice water and let stand until cool enough to peel, about 1 minute.   "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the eggs, slice in half, season with salt and pepper and drizzle with a little olive oil. Serve with the rice, garnished with mint and scallion if you like.    "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022267-dami-yeh-gojeh-nokhod-farangi-tomato-egg-rice"}