{"@context": "http://schema.org", "@type": "Recipe", "name": "Pain au Chocolat", "description": "Chocolate sticks called “batons” are made especially for rolling easily into pain au chocolat. Here, two batons are spiraled into the dough so you get rich pockets of chocolate in each bite of flaky croissant. You can order batons online, but regular chocolate bars, cut crosswise into thin sticks, work just as well. Either way, use a good-quality chocolate. (Make sure your first attempt at croissants is a successful one, <a href=\"https://www.nytimes.com/2021/04/06/dining/croissant-recipes.html\">with these tips,</a> and <a href=\"https://youtu.be/vpwY3nmLLaA\">Claire Saffitz’s step-by-step video on YouTube.</a>)", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2021/04/07/dining/06croissantsrex2-pains/merlin_184842177_c524b2b7-10cf-40de-a9a6-e536ae63c3d6-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "10 pains au chocolat", "recipeCuisine": "french", "recipeCategory": "breakfast, brunch, pastries, project", "keywords": "butter, chocolate, flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 209}, "recipeIngredient": ["<a href=\"https://cooking.nytimes.com/recipes/1022053-croissants\">Croissant dough</a>, rolled out to a 15-by-16-inch slab, chilled (See Notes)", "All-purpose flour, for rolling", "20 chocolate croissant sticks, or 4 ounces semisweet bar chocolate, cut crosswise into 20 even pieces", "1 large egg yolk", "1 tablespoon heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange racks in the upper third and lower thirds of the oven. Bring a skillet of water to a simmer over medium-high heat. Transfer the skillet to the floor of the oven and close the door. (The steam released inside the oven will create an ideal proofing environment for the pains au chocolat.) Line two rimmed baking sheets with parchment paper and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the slab of dough from the refrigerator and let sit for 5 minutes at room temperature. Unwrap (save the plastic for proofing) and place on a very lightly floured surface. If the dough has shrunk during chilling, roll it out again to a slab that’s 16 inches long and 15 inches wide. Dust off any excess flour with a pastry brush. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a wheel cutter to trim 1/2 inch of dough from all four sides, straightening and squaring them off, creating a slab that’s 15 inches long by 14 inches wide. Using a ruler, cut the slab lengthwise into 5 equal strips each measuring 3 inches wide. Cut each strip in half crosswise, creating 10 rectangles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working one rectangle at a time, place a stick of chocolate along one of the shorter sides, leaving about a 1-inch border. Fold the pastry over the chocolate until it’s wrapped around one time, then tuck another bar of chocolate into the fold. Wrap the pastry around the second bar of chocolate and continue to roll until you have a snug spiral. Transfer the pain au chocolat to a prepared baking sheet, resting it on the seam. Repeat with the remaining dough and chocolate, dividing between the baking sheets and spacing evenly. Very loosely cover with plastic wrap so the pastries have some room to expand. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the oven and stick your hand inside — it should be humid but not hot, as the water in the skillet will have cooled. You want the pains au chocolat to proof at 70 to 75 degrees. (Any hotter and the butter will melt, leading to a denser pastry.) Gently place the baking sheets inside the oven and let the pastries proof until they’re doubled in size, extremely puffy, and jiggle delicately on the baking sheet, 2 to 2 1/2 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the baking sheets from the oven and carefully uncover them. Transfer to the refrigerator and chill for 20 minutes while you heat the oven. Remove the skillet from the oven and heat to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir the yolk and heavy cream until streak-free. Remove the baking sheets from the refrigerator and use a pastry brush to gently brush each pain au chocolat with the yolk mixture. Transfer the sheets to the oven and bake for 20 minutes. Rotate the baking sheets and switch racks, and continue to bake until the pains au chocolat are deeply browned, another 10 to 15 minutes. Remove from the oven and let cool completely on the baking sheets. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022057-pain-au-chocolat"}