{"@context": "http://schema.org", "@type": "Recipe", "name": "Kaya Toast", "description": "In Malay, kaya translates to rich, which perfectly describes this toasted bread spread with custardy kaya jam and cold salted butter. Kaya toast is popular throughout Malaysia, Singapore and other regions of Southeast Asia where pandan, the star ingredient, grows as a tropical plant with palm-like leaves. Kaya jam is made with fresh pandan, coconut milk, palm sugar and lots of eggs, which make it creamy. In this version, adapted from Kyo Pang, the founder and the executive chef of New York City’s Kopitiam, milk bread slices sandwiching kaya jam come with soy-seasoned half-boiled eggs for dipping.", "author": {"@type": "Person", "name": "Kiera Wright-Ruiz"}, "image": "https://static01.nyt.com/images/2021/10/14/dining/KW-kaya-toast/merlin_196072107_65a5903b-1d8b-41c4-84fc-124715e12834-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 servings", "recipeCuisine": "malaysian", "recipeCategory": "breakfast, lunch, snack", "keywords": "eggs, milk bread, pandan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 162}, "recipeIngredient": ["10 large eggs, at room temperature", "1 (13.5-ounce) can unsweetened coconut milk", "6 large/45 grams fresh pandan leaves or 1 3/4 teaspoons pandan extract (see Tip)", "1 cup packed/ 300 grams palm sugar or 1 1/4 cups/225 grams granulated sugar", "4 large eggs, at room temperature", "1 teaspoon soy sauce", "1/4 teaspoon ground white pepper (optional)", "4 slices milk bread, crusts cut off (see Tip)", "1 1/2 tablespoons cold salted butter, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the kaya jam: Beat eggs in a large metal bowl. Using a blender, blend half of the coconut milk with the fresh pandan until the milk is fragrant and a light green color. Pour the pandan milk through a fine-mesh sieve into the bowl with the eggs. Use the back of a spoon to press liquid from leaves; discard leaves. Rinse the blender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend the remaining half of the coconut milk with palm sugar until smooth. Pour directly into the pandan egg mixture and whisk until fully incorporated. Set blender aside without washing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot with water to a depth of 2 inches. Bring to a simmer over medium. Set the bowl on the pot to create a double-boiler. (The water should not touch the bottom of the bowl.) Gently and frequently whisk the kaya mixture in figure-eight motions until thickened to the consistency of pudding, about 20 minutes. If you hear bubbling in the pot or see the kaya begin to clump, lower the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend the cooked kaya to smooth out any clumps. You should have about 3 1/2 cups. Refrigerate in an airtight container for up to 30 days. It will thicken more when chilled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the toast: Fill a small pot with water, cover and bring to a boil over high. Once boiling, gently add the eggs, cover and immediately remove from heat. Let eggs sit undisturbed for 6 minutes. Strain eggs and run under cold water until cool enough to handle. Crack and peel one end of each egg, and gently run a spoon along the inside of the shell to extract the egg within. Divide the eggs between two small bowls. Drizzle with the soy sauce and season with pepper, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the bread and spread about 2 tablespoons kaya jam on the warm slices. Place the cold salted butter slices evenly on top of 2 slices and sandwich with the other slices. Cut each sandwich in half using the tip of a knife to avoid pressing too firmly on it and serve with the bowls of eggs for dipping."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022655-kaya-toast"}