{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Icebox Pie", "description": "If you adore creamy strawberry desserts, this deluxe icebox pie topped with glossy, springy homemade strawberry gelatin is a treat you won’t want to miss. The recipe, from Morgenstern’s Finest Ice Cream in New York, updates a classic strawberry icebox pie with two major tweaks. Instead of using frozen whipped topping and a box of strawberry gelatin, it calls for freshly whipped heavy cream and the juice drained from an entire pound of macerated berries. The recipe does take some time to put together, but results in the richest, silkiest and most deeply strawberry flavored pie imaginable. You’ll need to start this at least one day before you want to serve it, but it keeps well for up to three days in the fridge. The wafer cookies get softer and more cakelike as they sit.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/09/01/dining/27Apperex/merlin_193478196_e3a909a7-135d-4237-b37d-94a1f42193c5-articleLarge.jpg", "totalTime": "P1D", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts, project, dessert", "keywords": "powdered gelatin, strawberries, vanilla wafers", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 256}, "recipeIngredient": ["1 pound thinly sliced strawberries (about 3 cups)", "3 tablespoons/38 grams granulated sugar", "2 teaspoons/6 grams powdered gelatin", "1/2 teaspoon freshly squeezed lemon juice", "3 tablespoons/42 grams unsalted butter, melted, plus more for greasing", "3 1/2 cups/200 grams vanilla wafers (such as Nilla wafers) or about 1 3/4 cups crumbs", "2 tablespoons/25 grams granulated sugar", "10 ounces strawberries (about 2 cups)", "1 cup/ 240 milliliters cold heavy cream", "2 tablespoons/15 grams confectioners’ sugar", "13 vanilla wafers/45 grams, cut into halves", "Whipped cream, sweetened or unsweetened"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the strawberry gelatin: combine sliced strawberries and sugar in a medium heat proof (preferably metal) bowl, cover the bowl with plastic wrap, and refrigerate 18 to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crust: Heat oven to 325 degrees and lightly grease a 9- or 10-inch pie dish (don’t use anything smaller). In a food processor combine wafers, sugar and melted butter. Process until mixture is well blended. Transfer to prepared pie dish and, using the bottom of a flat-bottomed measuring cup, press crumb mixture into an even layer on the bottom and up the sides, pressing up about 1/4-inch past the rim of the pie pan. Bake until the crust darkens slightly at the edges, 8 to 12 minutes. Transfer to a wire rack to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling: Purée 3 ounces strawberries in a food processor, blender or immersion blender until smooth. You should have about 1/4 to 1/3 cup strawberry purée. Set aside. Quarter another 2 ounces of strawberries to yield about 1/3 cup, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a whisk or an electric mixer fitted with the whisk attachment, beat heavy cream and sugar until soft peaks form, 2 to 3 minutes. Whisk in strawberry purée until just combined, making sure not to over beat. Using a rubber spatula, fold in quartered strawberries. Scrape strawberry cream into the cooled pie crust and smooth the top. Press the halved vanilla wafers vertically into the filling so that it is studded throughout with wafers. Cover pie with plastic wrap or parchment paper, place on rimmed sheet pan and chill in refrigerator for at least 3 hours (and up to 3 days). The longer the pie sits, the more cakelike the cookies get."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the pie has chilled, thinly slice the remaining 5 ounces of strawberries. Remove pie from refrigerator and place sliced strawberries over the filling to cover it, overlapping slightly if necessary. Place back into the refrigerator, covered, as you make the strawberry gelatin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put an inch or two of water in a medium saucepan and bring water to a simmer. Place the still-covered bowl of strawberries on top of the saucepan. Be sure the water is not touching the bottom of the bowl; if so, pour some water out. Heat strawberries to release more juice, swirling the bowl occasionally (use oven mitts), for 15 minutes; they should look very juicy. Using a fine sieve, strain strawberries until there is about 2/3 cup juice. You can press gently on the berries to release more juice but don’t press too hard or the gelatin will get cloudy. Save the strawberry solids for something else, like smoothies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer about 2 tablespoons of the hot strawberry juice into a bowl and sprinkle gelatin over the top; let it sit for a few minutes to soften. Add remaining strawberry juice to gelatin mixture and whisk until completely dissolved. Whisk in lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the pie still in the refrigerator on a sheet pan, pour the gelatin over the sliced strawberries (pouring the gelatin over the back over a spoon suspended over the pie can be helpful to get an even layer of gelatin over the top and doing this work while the pie is in the fridge ensures the glossiest topping and keeps everything from spilling). Let pie chill in the refrigerator, uncovered, until the gelatin sets, at least 2 hours or overnight. Serve with whipped cream dolloped on top."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022491-strawberry-icebox-pie"}