{"@context": "http://schema.org", "@type": "Recipe", "name": "Adasi", "description": "A Persian dish of simply cooked lentils, adasi is often eaten as a warming breakfast in Iran, but it can make a comforting lunch or dinner, too. There are many variations, but the core ingredients are the same: lentils, salt and water. This recipe also calls for onion, cumin and turmeric, then simmering until the lentils become soft and creamy. (Don’t be deterred by the long cooking time, as the majority of it is hands off. To help reduce the cooking time, soak the lentils before cooking for two hours or up to overnight.) Garnishes are customizable: Add a pinch of dried oregano or fresh cilantro or parsley, then top with a pat of butter and enjoy as-is, or with a side of hard-boiled eggs or roast vegetables. It’s a wonderful dish to have in the fridge for a quick, nourishing meal any time of day.", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "image": "https://static01.nyt.com/images/2021/04/19/dining/yf-adasi/yf-adasi-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, beans, soups and stews, main course, side dish", "keywords": "cumin, lentils, salt, turmeric, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 389}, "recipeIngredient": ["2 tablespoons olive oil, plus more for serving", "1 medium yellow onion, diced (about 1 1/2 cups)", "Kosher salt", "1 tablespoon ground cumin", "1 teaspoon ground turmeric", "1 pound green lentils (about 2 heaping cups), rinsed", "1 lime or lemon, cut into wedges", "Dried oregano, fresh cilantro or parsley (optional), for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large Dutch oven or pot over medium until shimmering. Add the onions, season with salt and cook, stirring occasionally, until they start to soften and become light golden, about 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cumin and turmeric and stir until fragrant, about 30 seconds. Stir in the lentils, then 5 cups water; season with salt. Increase the heat to bring it to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once it comes to a boil, give it stir, then reduce heat to low to maintain a simmer. Cover and let cook until the lentils are tender and creamy without a firm bite, about 1 hour and 15 minutes. (For ultimate creaminess, cook it on low for up to three hours, stirring every hour or so.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lid, stir and let any remaining water cook off, 5 to 10 minutes more, stirring occasionally to make sure nothing sticks to the bottom. Use a wooden spoon to mash some of the lentils against the side of the pan to thicken the soup, if desired. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon into bowls, squeeze the juice of 1 lime wedge into each, drizzle with olive oil, then add a pinch of oregano or herbs, if using, and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022123-adasi"}