{"@context": "http://schema.org", "@type": "Recipe", "name": "Raspberry and Cream Roulade", "description": "The exquisite combination of raspberries and cream is made even more so by the addition of this light, finely textured sponge cake. The cake should be chilled before serving to ensure it holds its shape. Because the sponge is oil-based rather than butter-based, it stays soft and flexible even when cold. (Watch Claire <a href=\"https://www.youtube.com/watch?v=N4nvGZTC9RE\">make this cake and two others</a> on YouTube.)", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2021/05/27/dining/cs-raspberry-roulade/merlin_188340618_092f86aa-f56a-4990-a71b-0f0a82b7a571-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "cakes, dessert", "keywords": "mascarpone, raspberries, raspberry jam", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 385}, "recipeIngredient": ["Confectioners’ sugar, for dusting", "1 <a href=\"https://cooking.nytimes.com/recipes/1022270-sponge-cake\">Sponge Cake</a> recipe, baked in a jelly roll pan and cooled", "1/2 cup/70 grams fresh raspberries", "1/3 cup/105 grams raspberry jam", "1/2 cup/120 grams heavy cream, chilled", "1/3 cup/80 grams mascarpone, crème fraîche or sour cream, chilled", "Pinch of kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a clean dish towel on a large cutting board and lightly dust all over with confectioners’ sugar. Place the sponge cake on top of the towel, parchment side up; peel off and discard the parchment. Dust the cake lightly with more confectioners’ sugar. Starting at one of the longer sides, loosely roll up the sponge inside the towel. Set aside the sponge while you prepare the filling. (This will “train” the sponge and make it easier to roll up after it’s filled.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mash together the fresh raspberries and raspberry jam until the berries break down; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine the heavy cream, mascarpone and kosher salt. Whisk vigorously by hand, or beat with a hand mixer on medium-high, until the mixture is thick and light, and holds a medium peak. Chill the bowl of whipped cream while you start to assemble the cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully unroll the cake so the short sides are to your right and left, and the longer sides near and away from you. Spread the raspberry mixture in a thin, even layer across the entire surface, leaving a border of about 1 inch along the longer side that’s farther from you. Pull the cream from the refrigerator and dollop all across the surface of the cake. Spread it in an even layer over top of the raspberry layer, this time leaving a 1-inch border on each of the longer sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the cake back up, starting with the longer side closest to you and using the towel to help you (without rolling the towel into the cake). Wrap the towel around the cake, allowing it to rest on the seam. Transfer the cutting board to the refrigerator and chill until the cake has had a chance to absorb some of the raspberry juices and set, at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cutting board from the refrigerator and gently unwrap the cake. Use a serrated knife to trim off the ends of the cake, exposing a clean spiral. Use the towel and/or cutting board to transfer the cake to a serving platter. Dust with more confectioners’ sugar, cut crosswise into slices with a serrated knife, and serve. The cake is best served the day it’s made, but will keep, covered and chilled, for up to 3 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022271-raspberry-and-cream-roulade"}