{"@context": "http://schema.org", "@type": "Recipe", "name": "Instant Pot Pork Stew With Red Wine and Olives", "description": "Pork shoulder is one of the most glorious things to cook in an electric pressure cooker. The meat becomes velvety and suffused with rich, brawny juices. Here, red wine, tomatoes, rosemary and sage perfume the pork, while olives, stirred in at the end, give it brightness. This stew is even better cooked a day or two ahead, giving the flavors time to meld. Making it in advance also gives the fat a chance to solidify, so it’s easy to remove before reheating. Then, if you like, you can reheat the stew in the electric pressure cooker using the sauté setting. Serve this over polenta or rice, or with good bread, to soak up the meaty sauce.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/10/27/dining/22Apperex1/merlin_196071996_11a8a10a-bafa-4018-8f8f-7d3ec95f3302-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "meat, main course", "keywords": "instant pot, make-ahead, olives, pork shoulder, red wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1014}, "recipeIngredient": ["2 pounds pork shoulder or pork stew meat, cut into 2-inch chunks", "1 1/2 teaspoons kosher salt (Diamond Crystal), plus more as needed", "3/4 teaspoon freshly ground black pepper, plus more as needed", "6 garlic cloves, grated, passed through a press or crushed into a paste", "1 tablespoon chopped fresh rosemary", "1 tablespoon chopped fresh sage", "Large pinch of red-pepper flakes", "1 teaspoon coriander seeds", "Olive oil", "1/2 cup dry red wine", "1 (15-ounce) can whole peeled plum tomatoes", "2 medium carrots, sliced 1/2-inch thick (about 1 cup)", "1/2 cup pitted and torn green olives, such as Castelvetrano", "Chopped parsley or basil, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the pork all over with the salt and pepper. In a large bowl, combine the pork, garlic, rosemary, sage and red-pepper flakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small dry skillet, toast the coriander seeds until fragrant, 1 to 2 minutes. Transfer to a mortar and pestle and coarsely crush (or do this on a cutting board with the side of a heavy knife). Add crushed seeds to the pork and toss well. Refrigerate for at least 30 minutes or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the pressure cooker to the sauté function on medium. Add 1 tablespoon oil and let it get hot for a few seconds, then add enough pork chunks to fit comfortably in one layer with a little space around each piece. Let brown for 2 to 3 minutes per side, then transfer the cubes to a plate. Add a little more oil if the pot looks dry and continue browning the rest of the pork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wine to the pot and let simmer, scraping the browned bits from the bottom, until it reduces by half, about 2 minutes. Using kitchen shears or your hands, break the tomatoes into pieces and add them, along with their liquid, to the pot. Return pork to the pot, stir in carrots and 1/2 cup water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Seal the pot and cook on high pressure for 45 minutes. Let the pressure release naturally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, transfer pork to a serving platter. Use a fat separator to separate the fat from the juices, or just spoon the fat off the top. (There may be a lot of fat.) If the sauce seems thin, use the sauté function to simmer it until it thickens. Stir in olives, then taste the sauce and add more salt, if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the sauce over the pork, then top with chopped parsley or basil and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022659-instant-pot-pork-stew-with-red-wine-and-olives"}