{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Feta and Green Olives", "description": "Bold, briny and tangy, this 15-minute pasta is full of personality. Olives are first slightly blistered in oil, drawing out their brininess, then crumbled feta is stirred into the pasta at the end until melty. Keep the feta chunky when breaking it apart so that the squares become soft and creamy, tasting almost baked. Castelvetrano olives are best here for their meaty texture and gentle flavor, but you can also use your preferred olive. Smash them with the flat side of a chef’s knife — or even the heel of your palm in a pinch — then use your fingers to pluck the olive flesh off the pit. Any stubborn meat clinging to the pit is fair game to be eaten then and there.", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "image": "https://static01.nyt.com/images/2022/02/07/dining/yf-feta-and-olive-pasta/yf-feta-and-olive-pasta-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, quick, weekday, weeknight, pastas, main course", "keywords": "cavatappi, feta, green olives, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1265}, "recipeIngredient": ["Kosher salt", "1 pound dried cavatappi, fusilli or other short, curly noodle", "1/3 cup olive oil", "12 ounces green olives, such as Castelvetrano or Cerignola, smashed and pitted", "1 garlic clove, grated or minced", "1 lemon, zested and juiced (about 1 tablespoon zest and 3 tablespoons juice)", "1/2 teaspoon red-pepper flakes, plus more as desired", "1/2 to ¾ cup loosely crumbled or cubed feta, depending on preference", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Add the pasta and cook at a gentle boil until al dente, about 2 minutes less than the package instructions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a saucepan or skillet, heat the oil over medium-high until shimmering. Add the olives, cooking until they start to blister in spots, 2 to 3 minutes. Remove from the heat, then add in the garlic, lemon zest and red-pepper flakes, stirring constantly for about 30 seconds, then let sit uncovered until the pasta is finished."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve 1 cup pasta water, drain the pasta, then return it to the pot over medium-low heat. Pour in the olive mixture, the lemon juice and ¾ cup pasta water, and stir well for 1 to 2 minutes until the noodles are coated in a smooth, glossy sauce, adding more water if needed. Turn off the heat, stir in the feta and let it soften and melt slightly. Finish with a grind or two of black pepper and a sprinkle of red-pepper flakes, if desired. Season to taste with salt, and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022965-pasta-with-feta-and-green-olives"}