{"@context": "http://schema.org", "@type": "Recipe", "name": "Manaqeesh (Za’atar Flatbreads)", "description": "Manaqeesh are one of the most popular breakfast foods for Arabs, particularly Palestinians, Lebanese, Syrians and Jordanians — but they’re excellent any time of day. Most often topped with a za’atar and olive oil mixture as they are here, these simple flatbreads are now often found coated with varied ingredients, such as cheese, labneh, pepper paste, eggs and even sweet spreads. But the traditional za’atar still reigns supreme. You can roll the dough out with a pin, but, for the fluffiest and softest version of this flatbread, stretch the dough by hand.", "author": {"@type": "Person", "name": "Reem Kassis"}, "image": "https://static01.nyt.com/images/2021/10/20/dining/15OILREX1-manaqeesh/15OILREX1-manaqeesh-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 manaqeesh", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, lunch, snack, breads", "keywords": "flour, olive oil, za’atar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 116}, "recipeIngredient": ["3 1/2 cups/450 grams all-purpose or bread flour", "1 1/4 cups/150 grams whole-wheat or white whole-wheat flour", "1 teaspoon fine sea salt", "1/2 teaspoon granulated sugar", "1/4 cup extra-virgin olive oil, plus more as needed", "2 teaspoons instant yeast", "1 to 2 cups lukewarm water", "3/4 cup/60 grams za’atar spice blend (see Tip)", "1/2 cup extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: In a large bowl, mix both flours, the salt and sugar. Add the oil, yeast and 1 cup water, and knead in the bowl with your fingers. Gradually knead in another 1/4 cup water, then knead in more water, 1 tablespoon at a time, until the dough comes together into a somewhat sticky ball. Let rest 5 minutes, then knead until smooth, supple and elastic, 5 to 7 minutes. Alternatively, in the bowl of a stand mixer fitted with the dough hook, combine all the dough ingredients with 1 cup water and mix on low speed, gradually adding water until the dough comes together. Continue mixing until the dough is smooth and elastic, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub the dough ball lightly with some oil, cover the bowl with plastic wrap and set aside until the dough doubles in size, 45 minutes to 1 hour. Timing will vary depending on water and room temperatures."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the topping: Combine the za’atar and olive oil in a bowl and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the risen dough into 6 equal portions, roll into spheres and place on a greased baking sheet. Cover loosely with plastic wrap or a damp tea towel so the dough doesn’t dry out. Let rise again until almost doubled in size, about 30 minutes. Meanwhile, heat oven to 500 degrees. Very lightly grease 2 baking sheets with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a dough round on a prepared sheet. With your fingers, flatten it into a thin circle 7 to 8 inches in diameter. Use a spoon to spread about one-sixth of the za’atar mixture on top, leaving a narrow border along the perimeter and pressing the za’atar into the dough firmly with the spoon to prevent the bread from rising as it bakes. If your baking sheet can fit another piece or two of dough, repeat the process on the same sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden at the edges and the topping is lightly bubbling, 5 to 7 minutes. Transfer to a wire rack to cool. While the first batch is in the oven, prepare more on the second sheet. Bake as soon as the first sheet comes out. Repeat with the remaining dough and toppings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve as soon as they’re cool enough to handle or at room temperature. Once cooled, leftovers can be stored in the freezer, with parchment or wax paper between each piece, for up to 2 months. Reheat in the oven when ready to enjoy."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022594-manaqeesh-zaatar-flatbreads"}