{"@context": "http://schema.org", "@type": "Recipe", "name": "Baba au Rhum", "description": "A classic French dessert, baba au rhum is a syrup-soaked, soggy, boozy delight. The dough here is intentionally soft and sticky, for a light, tender result. Be sparing in adding flour, incorporating just enough to make it manageable, or refrigerate the dough, then work with it. (Chilled dough is easier to handle.) This recipe yields a dozen babas, but you can bake them all and soak only as many as you intend to serve. You can freeze any baked, unsoaked babas for up to 2 months, then prepare them a day in advance and keep them in an airtight container at room temperature. Any leftover syrup keeps indefinitely in the fridge.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2021/04/07/dining/02Tanisrex-baba/merlin_185804565_0b54b8bb-90a7-4361-8d25-ecb91d4403b5-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "12 small babas", "recipeCuisine": "french", "recipeCategory": "cakes, quick breads, dessert", "keywords": "cardamom, cinnamon, flour, golden raisins, honey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 275}, "recipeIngredient": ["2 teaspoons active dry yeast", "3 tablespoons granulated sugar", "4 large eggs, beaten", "Pinch of fine sea salt", "1/2 cup/113 grams unsalted butter (1 stick), softened, plus more for greasing the pan", "2 cups/256 grams all-purpose flour, plus more for dusting", "1/2 cup/80 grams golden raisins, soaked in hot water and drained", "1/2 cup honey", "3/4 cup/150 grams granulated sugar", "1 (2-inch) cinnamon stick", "3 whole cloves", "3 green cardamom pods", "Zest of 1 large orange, removed in strips with a vegetable peeler", "1/2 teaspoon vanilla extract", "1/2 cup/120 milliliters dark rum, brandy or whiskey, plus more for serving", "1 cup/240 milliliters heavy cream", "2 tablespoons granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: Put yeast and sugar in a medium bowl and stir in ¼ cup lukewarm water. Leave for 10 minutes, until mixture is bubbly. Add eggs and salt to the yeast mixture, and whisk together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium mixing bowl, work the butter into the flour until the mixture resembles wet sand. Add the egg-yeast mixture and drained raisins, and beat with a wooden spoon, mixing well to make a soft, sticky dough. (Alternatively, prepare the dough in a stand mixer.) Cover bowl and let dough rise in a warm place until doubled, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter 2 mini-muffin tins or 12 mini ramekins. Uncover dough, dust lightly with flour and turn out onto a clean work surface. Add flour as necessary to make dough manageable and knead lightly to make a large, slightly sticky ball. Cut the dough into 12 pieces of equal size (about 2 ounces/55 grams). Dust each with flour, roll each into a ball and place in muffin tins or ramekins. Cover loosely and let rise until doubled, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the syrup: Put honey, sugar, cinnamon, cloves, cardamom and orange zest in a medium saucepan. Add 1 1/2 cups/360 milliliters water and bring to a boil, stirring to dissolve. Lower heat to a gentle simmer and cook for 10 minutes. Stir in vanilla and rum, turn off heat and let syrup cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Bake babas until lightly browned on top, 15 to 20 minutes. Turn babas out of their molds and onto a baking sheet, and return to the oven for 5 minutes to brown all over, as necessary. Remove and cover babas with a clean towel to keep them soft. (Store, cooled, in an airtight container at room temperature if making in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 2 hours before serving, place babas, top-side down, in a deep baking dish. Pour syrup over and let soak. Turn babas over a few times in syrup — they should get quite soggy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the whipped cream: With a whisk, hand-held beaters or in a stand mixer, whip cream to very soft peaks. Add sugar and whip lightly, leaving mixture soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place one or two babas in a low soup plate. Spoon over a little more syrup, and splash on about a tablespoon of rum. Serve a big spoonful of whipped cream on the side. If desired, garnish with a strip of orange zest, plucked from the syrup."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022037-baba-au-rhum"}