{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Bibimbap", "description": "Bibimbap, the Korean mixed rice dish, is a kaleidoscope of flavors and textures. The popular dish has multiple origin stories and, like banchan and kimchi, many variations. Cooks who ordinarily keep namul (seasoned vegetable) banchan in the fridge may add them to a bowl with leftover rice and seasonings like spicy-sweet gochujang and nutty sesame oil, for example. Or, if starting their bibimbap from scratch, some may prep each component separately. But here’s a fun way to accomplish everything at once: Roast a melange of bits and bobs on one sheet pan as rice heats and eggs oven-fry on another. The caramelized sweet potato and salty kale in this formula come highly recommended, but you can use any vegetables on hand, reducing cook times for delicate options such as spinach, scallions or asparagus. (<a href=\"https://www.youtube.com/watch?v=nB5voELYrAU\">Watch Eric make this on YouTube.</a>)", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/03/23/autossell/sheetpanbibimbap_thumb/sheetpanbibimbap_thumb-mediumThreeByTwo440.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "korean", "recipeCategory": "dinner, quick, weeknight, main course", "keywords": "gochujang, grain bowl, oyster mushroom, rice, sheet-pan, sweet potato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 4104}, "recipeIngredient": ["6 ounces oyster mushrooms, torn into bite-size pieces", "1 medium sweet potato (about 6 ounces), scrubbed and thinly sliced into half-moons", "1 small red onion (about 6 ounces), thinly sliced crosswise into half-moons ", "3 packed cups coarsely chopped Tuscan or curly kale (from 1 small bunch)", "6 tablespoons olive oil", "Kosher salt and black pepper", "4 cups cooked medium-grain white rice, preferably cold leftovers", "4 large eggs", "4 teaspoons toasted sesame oil, plus more to taste, for serving", "4 teaspoons gochujang, plus more to taste, for serving", "Kimchi, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Position racks in the top and bottom thirds of the oven and heat oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a large sheet pan, arrange the mushrooms, sweet potato, red onion and kale into four separate quadrants. Drizzle the vegetables with 3 tablespoons of the olive oil, season with salt and pepper, and toss to coat, keeping the types of vegetables separate. Try to not crowd the vegetables; you want them to brown, not steam. Roast on the top rack until the sweet potato is fork-tender, the onion and mushrooms are slightly caramelized and the kale is crispy but not burnt, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place another large sheet pan on the bottom rack to heat. When the vegetables are almost done cooking, in the last 5 minutes or so, remove the heated pan from the oven and evenly drizzle the remaining 3 tablespoons of olive oil on it. Spread the rice over half of the pan. Crack the eggs onto the other half and carefully transfer to the oven. Bake until the whites are just set and the yolks are still runny, 3 to 6 minutes (this time may vary depending on your oven, so watch it carefully)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide the rice evenly among four bowls. Now divide the vegetables evenly as well, placing them in four neat piles over each portion of rice. Use a spatula to slide the eggs over the vegetables. Drizzle each bowl with 1 teaspoon of sesame oil and dollop with 1 teaspoon of gochujang, adding more if desired. Mix everything together with a spoon or chopsticks before diving in, and serve kimchi alongside, if you prefer."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Sheet-Pan Bibimbap", "description": "Eric Kim is back, and this time he’s making Sheet-Pan Bibimbap! This recipe is proof that everything can be sheet-panned, and this Korean rice dish is no exception.", "thumbnailUrl": "https://static01.nyt.com/images/2022/03/23/autossell/sheetpanbibimbap_thumb/sheetpanbibimbap_thumb-mediumThreeByTwo440.jpg", "uploadDate": "2022-03-23T19:18:52.000Z", "duration": "PT7M41S", "transcript": "", "contentUrl": "https://vp.nyt.com/video/2022/03/23/99615_1_EK-Sheet-Pan-Bibimbap-YT_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022131-sheet-pan-bibimbap"}