{"@context": "http://schema.org", "@type": "Recipe", "name": "Maple-Pecan Sticky Buns", "description": "These rich and cozy sticky buns packed with warm spices, caramel and plenty of toasted pecans are just the thing for a special-occasion brunch. You can make the dough up to a day in advance, but if you’d rather prepare and bake the rolls on the same day, make sure to leave some time for the dough to chill — it is much easier to roll into a nice and tidy spiral when cold. Walnuts would work just as well as pecans, and a little bit of orange zest in the filling would add a nice citrusy punch, too.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2021/12/07/dining/ya-maple-pecan-sticky-buns/merlin_198267765_5c2b42f0-224f-4d01-854c-b4a2a19cc0e5-articleLarge.jpg", "totalTime": "PT3H45M", "recipeYield": "12 rolls", "recipeCuisine": "", "recipeCategory": "breads", "keywords": "buttermilk, maple syrup, pecans", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 417}, "recipeIngredient": ["2 teaspoons/6 grams active dry yeast", "1 cup buttermilk/240 grams, warmed to 100 degrees", "2 tablespoons/25 grams granulated sugar", "4 1/4 cups/544 grams all-purpose flour, plus more as needed", "1 1/4 teaspoons kosher salt (Diamond Crystal)", "8 tablespoons/113 grams unsalted butter, softened and cut into large pieces, plus more for greasing bowl", "3 large eggs, lightly beaten", "1/2 cup/170 grams/maple syrup", "1/2 cup/100 grams packed light brown sugar", "6 tablespoons/85 grams unsalted butter", "1/2 teaspoon kosher salt (Diamond Crystal)", "2 cups/200 grams toasted chopped pecans", "2/3 cup/133 grams packed light brown sugar", "1 tablespoon cinnamon", "1 teaspoon ground cardamom", "1/4 teaspoon kosher salt (Diamond Crystal)", "6 tablespoons/85 grams unsalted butter, very soft"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Combine the yeast, buttermilk and 1 tablespoon sugar, and let sit until foamy, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the bowl of a stand mixer fitted with a dough hook, add the flour, salt and remaining 1 tablespoon sugar. Stir to combine, then add the butter and toss to coat in the flour. Add the eggs and buttermilk mixture, then mix on low to combine, about 1 or 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase speed to medium, and mix the dough until it is soft, billowy and clearing the sides of the bowl, but still sticking to the bottom, 8 to 10 minutes. If the dough seems very, very soft and still sticks to the sides of the bowl, add more flour, a tablespoon at a time (up to about 4 tablespoons)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease a separate large bowl with butter and transfer the dough to it. Turn the dough to coat with butter, then cover the bowl with a kitchen towel. Let the dough rise in a warm spot until almost doubled in size, about 1 hour, then refrigerate the dough for 1 hour more. (Alternately, refrigerate the dough for up to 24 hours after the first rise, then proceed with the recipe as written.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to bake the rolls, make the topping: In a medium saucepan (to prevent boiling over), combine the maple syrup, brown sugar, butter and salt. Bring to a boil over medium and cook for 1 minute. The mixture will thicken slightly. Pour the mixture into a metal 9-by-13-inch baking pan and tilt the pan to evenly cover the bottom with the syrup. Sprinkle the pecans evenly over the top, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a small bowl, combine the brown sugar, cinnamon, cardamom and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the rolls: Turn the dough out onto a floured surface and pat or roll it into a 12-by-16-inch rectangle that’s 1/4-inch thick. Gently spread the softened butter over the dough, leaving about 1 inch of unbuttered dough on the long edge furthest from you. Sprinkle the sugar mixture evenly over the top of the butter. From the long end closest to you, roll the dough into a tight log. With the seam side down, use a serrated knife or length of floss to cut the log into 12 even pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rolls spiral side up into the prepared pan, cover and let rise until puffy but not quite doubled in size, about 45 minutes. (This may take a little longer if you refrigerated the dough for longer than 1 hour after the first rise.) If you’d like to bake them later, you can refrigerate the rolls in the pan before this second rise for up to 24 hours. Let the rolls rise at room temperature until almost doubled in size before baking. They will take longer to rise after chilling, depending on the ambient temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and bake rolls for 30 to 35 minutes, or until the rolls are golden brown and the caramel is bubbling a bit around the edges. Carefully run an offset spatula or thin knife around the edges of the pan. Let the rolls cool in the pan on a rack for about 5 minutes, then flip them out onto a serving tray or sheet pan. Let cool for a minute or two, then enjoy warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022589-maple-pecan-sticky-buns"}