{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Porgy With Lemons and Scallions", "description": "Porgy is a fish that takes beautifully to grilling whole, filled with aromatic ingredients. Here, Ayesha Nurdjaja, the chef of Shuka in New York City, stuffs the fish with lemon and herbs. When lightly charred, the skin of the fish becomes crispy and delicious. One way to guarantee that your fish will lift easily off the grill is to have clean, well-oiled grates, and if you're willing to sacrifice a couple of extra bunches of scallions, lay them on the grill, then put the fish on top. The scallions will burn away, but the fish will release. Fennel fronds work the same way. Ms. Nurdjaja tops the fish with a lightly-dressed arugula salad — but it’s just as delicious on its own.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2021/08/18/dining/20Porgyrex1/12Porgyrex2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, seafood, main course", "keywords": "lemon, porgies, scallion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 63}, "recipeIngredient": ["5 lemons", "4 whole porgies (1 1/2 pounds each), boned and gutted (see Tips)", "Salt", "8 sprigs fresh thyme", "4 sprigs fresh oregano", "6 tablespoons extra-virgin olive oil, plus more for the grill grates", "2 bunches scallions, trimmed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a charcoal grill until coals are ashed over and hot, or heat a charcoal grill to high. Or heat a broiler (see Tips)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut 3 lemons into ½-inch-thick slices and discard any pits. Pat fish dry inside and out and season inside with salt. Place the lemon slices inside the fish, then place the thyme and oregano on top of the lemon. If the fish don’t close around the stuffing, tie fish closed in two places with kitchen twine. Brush fish on both sides with 4 tablespoons olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss scallions with a pinch of salt and remaining 2 tablespoons olive oil. Cut the 2 remaining lemons in half, removing any seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrub the grill grate clean, then rub with an oiled kitchen towel or wad of paper towels. If your grill can fit everything, place everything on at once. Otherwise, start with the scallions and lemons, cut sides down. Season one side of each fish with salt and place salt side down on the grates next to the scallions and lemons. Grill (covered if using a gas grill), turning once, until the lemons and scallions are softened and lightly charred, 3 to 4 minutes for the scallions and 5 minutes for the lemons. Grill the fish until the skin releases naturally from the grate, about 6 minutes, then salt the other side, cover and grill until cooked through, about 6 minutes longer. Test for doneness by slipping a paring knife into the center of the fish; it should feel hot when carefully touched to your lower lip or the inside of your wrist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread scallions on a serving platter and set lemon halves around the sides. Transfer the fish to the platter, remove the string and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022462-grilled-porgy-with-lemons-and-scallions"}