{"@context": "http://schema.org", "@type": "Recipe", "name": "Almond Cake With Peaches and Cream", "description": "This tender, golden cake, adapted from Lindsey Shere’s “Chez Panisse Desserts,” walks the line between dense and light, with a fine, moist crumb and deep marzipan flavor that comes from a combination of homemade almond paste and a touch of almond extract. Easily made in a food processor, it’s a versatile cake that you can dress up any way you like. Here, it’s topped with peaches and cream, but it’s just as good with berries, nectarines, plums or poached pears. Or leave it plain for a more restrained dessert or afternoon snack. You can vary the nuts for the paste here, too. Substitute unsalted roasted almonds for a toasty, earthy flavor; hazelnuts for woodsy notes; and pistachios plus a dash of orange blossom water for a heady, floral notes. This cake will keep for up to two days well wrapped at room temperature or five days in the fridge.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/08/11/dining/06apperex/06apperex-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "snack, cakes, dessert", "keywords": "almond flour, egg whites, food processor, make-ahead, peach, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1329}, "recipeIngredient": ["1 1/4 cups/280 grams softened unsalted butter, plus more for the pan", "1 cup/128 grams all-purpose flour, plus more for the pan", "1 packed cup/125 grams almond flour or sliced, blanched almonds", "1 cup/125 grams confectioners’ sugar, plus more for serving", "6 large eggs plus 1 egg white, at room temperature", "1/2 teaspoon almond extract", "1/2 teaspoon fine sea salt", "1 1/4 cups/250 grams granulated sugar", "2 teaspoons vanilla extract", "1 1/2 teaspoon baking powder", "Sliced peaches, for serving", "Whipped crème fraîche or whipped cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Butter and lightly flour a 9- or 10-inch springform pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place almond flour and confectioners’ sugar in a food processor and pulse to combine. Add egg white, almond extract and 1/4 teaspoon salt, and process until it all forms a paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add granulated sugar to the food processor and pulse until everything is well combined and crumbly. Add butter and vanilla, and continue processing until light and fluffy, about 2 minutes. With the machine running, add eggs one at a time, processing until smooth between eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stop the machine, scrape down the sides with a rubber spatula, and add flour, baking powder and remaining 1/4 teaspoon salt. Pulse a few times, until the dry ingredients are just integrated. (Be careful not to overprocess.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan. Bake until the cake is golden on top and a toothpick inserted into the center comes out clean, about 60 to 70 minutes for a 10-inch pan and 70 to 80 minutes for a 9-inch pan. Transfer the pan to a wire rack and let cake cool completely before unmolding and serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the peach slices in a bowl and taste a slice. If they seem tart, sprinkle peaches with a little confectioners’ sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, dust the top of the cake with confectioners’ sugar. You can serve slices of the cake with the peaches and cream on the side or dollop some whipped cream on top of the cake and top with the peaches before cutting."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022452-almond-cake-with-peaches-and-cream"}