{"@context": "http://schema.org", "@type": "Recipe", "name": "Wine-Braised Chicken With Mushrooms and Leeks", "description": "Adding crème fraîche and fancy mushrooms to a pan full of wine-braised chicken makes it ultrarich and extra special. This recipe is perfect for a festive dinner when you’re looking for a chicken dish that’s a little more dressed up than your average weeknight meal, but it isn’t overly difficult. Make it a day or two in advance, and, like all braises, it gets even better with time.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/12/23/dining/23Apperex/merlin_199233579_b2b83d37-c5f2-4d32-92d9-5e88948d5d28-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry, main course", "keywords": "crème fraîche, dry white wine, dutch oven, leek, make-ahead, mushroom, whole chicken, fall, winter, new year’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1623}, "recipeIngredient": ["1 (3 1/2-pound) chicken, cut into 8 pieces (or use 3 1/2 pounds bone-in chicken parts)", "2 teaspoons kosher salt (Diamond Crystal), plus more as needed", "1/2 teaspoon freshly ground black pepper, plus more as needed", "4 garlic cloves", "2 tablespoon extra-virgin olive oil, plus more as needed", "2 tablespoons unsalted butter", "1 cup thinly sliced mushrooms (preferably specialty mushrooms, such as king, hen-of-the-woods, chanterelles or black trumpet, or a combination)", "2 large leeks (4 cups), halved and thinly sliced into half-moons (use white and light green parts)", "2 to 3 rosemary sprigs", "3/4 cup dry white wine (or use a dry red or rosé)", "1/4 cup crème fraîche, plus more for serving if desired", "2 tablespoons chopped chives", "1 teaspoon finely grated lemon zest, plus more for serving", "1/2 cup finely chopped fresh parsley, leaves and tender stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat chicken dry with paper towels. Season all over with 1 1/2 teaspoons salt and the black pepper. Finely grate, pass through a press or mince 2 garlic cloves. Set aside half the grated garlic for finishing the dish. Rub the rest all over the chicken pieces. Set aside the chicken while preparing the other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a Dutch oven over medium-high heat, combine 1 tablespoon oil and 1 tablespoon butter. When the butter melts, add chicken in batches and cook until browned on both sides, 4 to 6 minutes per side. If the pan dries out, add a little more oil as needed. Transfer browned chicken to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining tablespoon each oil and butter to the pan. Once the butter melts, add mushrooms and cook undisturbed until well browned on one side, 2 to 3 minutes. Stir and cook for 1 minute longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice 2 garlic cloves. Reduce heat to medium, and stir in sliced garlic, leeks and a large pinch each of salt and pepper. Cook, stirring occasionally, until leeks are tender and golden brown, 7 minutes. Add rosemary and wine to the pot and let simmer, scraping up the browned bits, until liquid reduces by half, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Nestle chicken, skin side up, into the pan and pour in any accumulated juices from the plate. Reduce heat to medium-low and cook, covered, until chicken is cooked through, 25 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer chicken to a serving platter and tent with foil to keep warm. Pluck the rosemary sprigs from the pot. If the sauce looks thin, turn the heat to medium-high and let simmer until it thickens slightly, 2 to 5 minutes. Stir in the remaining grated garlic, the crème fraîche, chives and lemon zest. Taste sauce and add more salt if needed. Spoon sauce over the chicken and top with parsley, more lemon zest and a dollop of crème fraîche, if you like, and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022839-wine-braised-chicken-with-mushrooms-and-leeks"}