{"@context": "http://schema.org", "@type": "Recipe", "name": "Collard Greens and Cornmeal Dumplings", "description": "Collard greens are a common dish in many African American households, and are especially important during New Year’s celebrations. In folklore, the greens represent dollar bills, and the more you eat, the more money you’ll have in the new year. In this version, adapted from “Jubilee: Recipes from Two Centuries of African American Cooking,” by Toni Tipton-Martin, cornmeal dumplings simmer with the greens in a smoky stock. The dough is made using that rich potlikker and then added towards the end of cooking so the dumplings don’t become soggy. This combination of greens and dumplings parallels the West African pairing of soups and stews with fufu, an accompaniment traditionally made from pounded yam, cassava or other starch. This is delicious on its own, but even better with black-eyed peas and rice.", "author": {"@type": "Person", "name": "Kayla Stewart"}, "image": "https://static01.nyt.com/images/2021/12/29/dining/27NEW-YEARSREX1/merlin_199513152_b9939b1f-9b97-4ba1-b2d2-86e436cb515b-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "6 servings", "recipeCuisine": "southern", "recipeCategory": "vegetables, main course, side dish", "keywords": "collard greens, ham hock, onion, new year’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 107}, "recipeIngredient": ["2 smoked ham hocks or 2 smoked turkey wings", "2 medium onions, quartered", "4 celery stalks, including leaves, halved", "2 carrots, scrubbed and quartered", "2 garlic cloves, peeled and smashed", "1/2 teaspoon black peppercorns", "2 dried bay leaves", "1/2 small onion, chopped", "1 garlic clove, minced", "1 large bunch (1 pound) collard greens", "2 small dried red chiles or 1 teaspoon red-pepper flakes", "Salt and black pepper", "1/2 cup all-purpose flour", "1 1/2 cups coarsely ground cornmeal", "1 teaspoon baking powder", "1 teaspoon granulated sugar", "3/4 teaspoon fine salt", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the stock: In a large heavy stockpot, bring 3 quarts water, the smoked meat, onions, celery, carrots, garlic, peppercorns and bay leaves to a boil. Reduce the heat to maintain a simmer, and simmer, partially covered, until the flavors are well blended, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the meat from the broth. When cool enough to handle, pull the meat off the bones (discard the skin, fat, and bones). Chop the meat and reserve for another use. (The meat can be refrigerated in an airtight container for up to 1 week.) Use a fine-mesh sieve to strain the stock into a container. Refrigerate the stock until the fat floats to the top or skim the fat using a fat separator or spoon to use immediately. For chilled stock, use a slotted spoon to skim off the fat and discard. Pour out 6 cups stock to use; reserve the rest for another use in the refrigerator for up to 5 days or in the freezer for up to 1 month."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the collards: In a medium saucepan, bring the 6 cups stock, the onion and garlic to a boil over high heat. Reduce the heat to maintain a simmer, cover and simmer while preparing the greens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thoroughly wash the collards and trim away the stems, if desired. Discard the stems or coarsely chop. Stack 2 or 3 leaves on a cutting board and roll tightly into a log. Slice the greens crosswise into 1/4-inch-wide ribbons. Place the greens and stems, if using, and the chiles in the broth and return to a simmer. Cook, covered, about 1 1/2 hours for very tender greens; you may cook them for less time if you have young greens or prefer greens with more chew. Season to taste with salt and black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About half an hour before the collards are done, prepare the dumplings: In a medium bowl, whisk together the flour, cornmeal, baking powder, sugar and salt. In a small saucepan, melt the butter over medium-low heat. Spoon out 1/2 cup of the potlikker from the collards and add to the butter. Remove from the heat and stir it into the dry ingredients, adding more potlikker 1 tablespoon at a time  if needed for the dough to come together into a mass. Let stand 5 minutes. When cool enough to handle, use wet fingertips to shape the dough into 6 round dumplings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "During the last 15 minutes of the collards’ cooking time, carefully drop the cornmeal dumplings into the pot with the greens, making sure the dumplings are submerged in the potlikker. Cover the pot and simmer until the dumplings are cooked through, 10 to 15 minutes. Serve the greens and dumplings in bowls with plenty of potlikker."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022836-collard-greens-and-cornmeal-dumplings"}