{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramelized Summer Fruit Tart", "description": "Use this crunchy, flaky tart recipe as a template for any ripe summer fruit you have, adjusting the sugar and cornstarch depending on how sweet and juicy the fruit is (see Tip). Made from store-bought puff pastry that’s been coated in Demerara sugar, the crust caramelizes as it bakes, turning shiny and crisp enough to shatter when you bite down. And feel free to change up the seasonings and substitute 1/2 teaspoon ground spices or grated lemon zest for the vanilla. It’s an easy, fuss-free dessert that seems like a lot more work than it actually is. For maximum flakiness, serve this on the same day that it’s baked.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/04/28/dining/23apperex1/merlin_186703752_a2e41c34-cc86-4f90-b20e-f1b028e8f53c-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts, dessert", "keywords": "berries, puff pastry, stone fruit, fourth of july, mother’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 649}, "recipeIngredient": ["2 tablespoons Demerara sugar, plus more as needed", "2 to 5 tablespoons granulated sugar (see Tip)", "2 to 3 tablespoons cornstarch (see Tip)", "Pinch of kosher salt", "4 cups berries, or pitted and sliced stone fruit (peaches, nectarines, apricots, plums), or rhubarb (or use a combination of stone fruit and berries)", "1 tablespoon lemon juice or mild vinegar, such as rice wine vinegar or balsamic", "1 tablespoon honey, plus more as needed", "1 tablespoon vanilla extract", "All-purpose flour, for dusting the work surface", "1 (14-ounce) package puff pastry, preferably made with butter, thawed if frozen, but still very cold", "Whipped cream, crème fraîche or ice cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a rack in the center of the oven and heat oven to 400 degrees. Line a baking sheet with a silicone liner or parchment paper. Sprinkle 2 tablespoons Demerara sugar in an approximate 10-by-13-inch rectangle in the center of the liner or paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, whisk together granulated sugar, cornstarch and salt. Add fruit, lemon juice, honey and vanilla. With a rubber spatula or large spoon, mix well, making sure fruit is coated with the cornstarch mixture. Set aside to macerate while rolling out dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll the cold puff pastry out to form a 10-by-13-inch rectangle. Work quickly, as the pastry becomes sticky as it warms up. Transfer the dough to prepared baking sheet, laying it on top of the Demerara sugar. With a sharp knife, lightly score a 3/4-inch border around the edges of the puff pastry, making sure not to cut the pastry all the way through. Using a fork, prick the pastry all over inside the border at 1-inch intervals."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Give the fruit another toss to dissolve any honey that may have clumped. Arrange fruit mixture in an even layer on pastry within the border, pouring the juices from the bowl over the top. Sprinkle the top of the tart, including the fruit and pastry borders, with more Demerara sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the pastry is puffed and deeply golden and the fruit is tender, about 30 to 40 minutes. Transfer the pan to a wire tack to cool for at least 15 minutes before serving (or up to 4 hours). If the fruit looks dry when the tart comes out of the oven, you can brush it with a little more honey while it’s still warm. Serve with whipped cream, crème fraîche or ice cream."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022125-caramelized-summer-fruit-tart"}