{"@context": "http://schema.org", "@type": "Recipe", "name": "Miso Squash Soup", "description": "Soup is an easy first course for a seasonal gathering, especially when it can be prepared — even frozen — in advance. This one calls for Kabocha squash, a variety that’s not too sweet, and is dense and rich, though delicata, honeynut, the ubiquitous butternut or an everyday orange pumpkin all work well. Seasoned primarily with miso, this calls for only a pinch of cinnamon to hint at the inevitable pumpkin spice. And instead of presenting this vegan soup as a plated first course in china or pottery bowls or even in hollowed-out mini-pumpkins, you might consider spooning it into small cups or glasses for guests to sip as an hors d’oeuvre before dinner.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2021/11/10/dining/04pairingrex/04pairingrex-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, appetizer, side dish", "keywords": "fall, freezer friendly, kabocha, miso, soup, vegetable stock, thanksgiving, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 464}, "recipeIngredient": ["4 pounds Kabocha or butternut squash (1 large or 2 medium)", "2 tablespoons grapeseed or other vegetable oil", "1 medium yellow onion, sliced thin", "3 garlic cloves, sliced", "1/2 teaspoon ground cumin", "1/4 teaspoon cinnamon", "1/8 teaspoon ground cayenne, or to taste", "2 tablespoons lemon juice", "4 tablespoons red miso (see Tip)", "5 cups vegetable stock", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Line a baking sheet with parchment paper or foil. Using a heavy, sharp knife, cut the squash in half top to bottom. Scoop out the seeds and stringy pulp. (If desired, save the seeds for <a href=\"http://cooking.nytimes.com/recipes/1020545-roasted-pumpkin-seeds\">roasting</a>.) Brush cut sides of squash with 1 tablespoon of the oil. Place squash cut side up on the baking sheet and roast until tender when pierced with a knife, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the squash is nearly done roasting, heat remaining tablespoon oil in a large pot over medium-low heat. Add onion and cook, stirring occasionally, until the onion has softened but not taken on any color, about 10 minutes. Add garlic and continue to cook, stirring more frequently, until the onion is uniformly golden brown, another 8 to 10 minutes. Stir in cumin, cinnamon and cayenne. Stir in lemon juice, scraping up any stuck bits from the pan, and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the squash is tender, scoop the flesh out of the shell and into the saucepan, breaking it up. Stir in 2 cups stock and 3 tablespoons miso. Transfer to a food processor or blender and blend until smooth. You may have to do this in shifts depending on the capacity of your machine. Return to the pot, add remaining 3 cups stock and bring to a simmer over medium, stirring often. Taste and add salt and more cayenne if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer 2 tablespoons soup to a small saucepan and whisk in remaining tablespoon miso over low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the soup among bowls or cups and drizzle a small amount of the miso-soup mixture on each serving, tracing it on the surface with a knife. To make ahead, cover and refrigerate soup until ready to serve, up to 3 days. (It can be frozen for up to 1 month.) Reheat soup before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022728-miso-squash-soup"}