{"@context": "http://schema.org", "@type": "Recipe", "name": "Country Captain", "description": "The American South has long laid claim to Country Captain, but the dish’s origins can be traced back to the British Raj. It’s an Anglo-Indian legacy of colonials with palates newly awakened to the possibilities of spice. In this version from Rohan Kamicheril, who grew up in Bangalore, only a few seasonings are called for: turmeric, ginger-garlic paste — easy to mash up quickly or buy premade — and Kashmiri chile powder, which has a gentle heat that can be approximated with a mix of paprika and cayenne. Vinegar is the last, vital touch, its sourness twangs the nerve and startles the other flavors into focus. The recipe is simple, but it takes skill to make, and should be eaten immediately.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2022/02/20/magazine/20mag-eat-site/20mag-eat-site-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 308}, "recipeIngredient": ["2 tablespoons ginger-garlic paste (see Tip)", "1/2 teaspoon ground turmeric", "1 teaspoon Kashmiri chile powder or 1/2 teaspoon cayenne plus 1/2 teaspoon sweet paprika", "1 tablespoon distilled white vinegar", "2 pounds boneless, skinless chicken thighs, cut into 1-inch pieces", "Neutral oil, such as grapeseed or canola, for frying", "1 large onion, thinly sliced into half-moons", "1 large russet potato, peeled and cut into 1/2-inch dice", "Salt", "Soft white bread, such as a Pullman loaf or Japanese milk bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the ginger-garlic paste with the turmeric, chile powder and vinegar in a large bowl, then toss the chicken in the marinade to coat. Let the chicken rest at room temperature while cooking the vegetables to give the spices time to infuse the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat an inch of oil in a medium saucepan over medium-high until it reaches 340 degrees on an instant-read thermometer. (If you don’t have an instant-read thermometer, drop a nub of potato into the oil to test: If you get a fervent sizzle, the oil is hot enough.) Add the onion and fry, turning occasionally with a spider or slotted spoon, until the onion is soft and uniformly dark chestnut brown in color, 9 to 11 minutes. Scoop out the onion and let drain on a plate lined with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the oil back up to 340 degrees. Add the diced potato and fry, turning occasionally, until golden brown on all sides, 6 to 8 minutes. Scoop out the potatoes and let drain on a plate lined with paper towels. Season generously with salt while still hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the potatoes cook, set a large cast-iron or other heavy skillet over high heat. When the pan is just beginning to smoke, drizzle in 2 tablespoons of oil from the saucepan and swirl to cover the bottom of the pan. Add half of the marinated chicken, making sure to leave space between the pieces. Let cook undisturbed until browned and crisp, 4 to 5 minutes, then flip and cook to brown the other sides, another 4 to 5 minutes. Scrape chicken and any accumulated juices onto a serving platter or bowl. Repeat with remaining chicken, cooking in 2 tablespoons oil from the saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion and potato to the dish with the chicken. Stir gently, just enough for the juices from the chicken to gloss the onion and potato. Serve immediately with the bread."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022978-country-captain"}