{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Gnocchi With Burst Tomatoes and Mozzarella", "description": "<a href=\"https://www.nytimes.com/2020/05/19/dining/gnocchi-recipes.html\">Pan-fried gnocchi</a> is like a faster version of baked pasta. Store-bought gnocchi can simply be browned in a pan for an exciting mix of crispy outsides and chewy middles, no boiling required. This dish is<span> studded with juicy tomatoes and melty pockets of mozzarella. C</span>herry tomatoes are reliably more flavorful year-round than larger, more watery varieties like beefsteak and heirloom. (That said, taste yours, and if they’re more tart than sweet, add 1/2 teaspoon sugar in Step 2.) Toss the tomatoes with browned butter, red-pepper flakes and garlic, then hit them with a little heat, and they’ll burst into a bright sauce. Stir in the gnocchi, dot with mozzarella, then broil until the cheese is molten and the tomatoes are blistered in spots.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2021/04/19/dining/as-cheesy-baked-gnocchi/merlin_183955068_cea0bca3-39eb-4a57-a1ce-ba780b08af51-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weeknight, pastas, main course", "keywords": "brown butter, cherry tomatoes, gnocchi, mozzarella, skillet, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6977}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil, plus more as needed", "2 (12- to 18-ounce) packages shelf-stable or refrigerated potato gnocchi", "1/4 cup unsalted butter", "4 garlic cloves, thinly sliced", "1/4 teaspoon red-pepper flakes, plus more for serving", "Kosher salt and black pepper", "2 pints small tomatoes, such as cherry, grape or Sungold", "1/4 cup thinly sliced or torn basil leaves (optional), plus more for serving", "8 ounces fresh mozzarella, cut or torn into 1/2-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler with a rack about 6 inches from the heat source."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large (12-inch) skillet on the stovetop, heat enough olive oil to lightly coat the bottom of the pan (about 1 tablespoon) over medium-high. Add half the gnocchi to the pan, breaking up any that are stuck together. Cover with a lid or baking sheet and cook, undisturbed, until golden brown on one side, 2 to 4 minutes. Transfer to a medium bowl. Repeat with the remaining gnocchi and olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter to the skillet and cook over medium-high, stirring often, until golden-brown and toasty, 1 to 2 minutes. Add the garlic, red-pepper flakes, 1 1/2 teaspoons salt and a few grinds of pepper, reducing the heat slightly if necessary to avoid scorching. Add the tomatoes and 3 tablespoons water and cook, shaking the pan occasionally, until the tomatoes have softened and the liquid has slightly thickened, 4 to 6 minutes. Smash the tomatoes as they burst to help them along."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the seared gnocchi and 1/4 cup basil (if using), stir to coat, then shake into an even layer. Top with the mozzarella and drizzle lightly with olive oil. Broil until the cheese is melted and browned in spots, 2 to 4 minutes. Top with more basil, red-pepper flakes and black pepper as desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022024-crispy-gnocchi-with-burst-tomatoes-and-mozzarella"}