{"@context": "http://schema.org", "@type": "Recipe", "name": "Ham and Cheese Croissants", "description": "The amount of ham and cheese inside these croissants might seem a tad skimpy, but resist the urge to add more. The extra moisture from the filling can make the interior soggy and affect how the dough rises, so rest assured it’s more than enough to flavor these savory pastries. (Make sure your first attempt at croissants is a successful one, <a href=\"https://www.nytimes.com/2021/04/06/dining/croissant-recipes.html\">with these tips,</a> and <a href=\"https://youtu.be/vpwY3nmLLaA\">Claire Saffitz’s step-by-step video on YouTube.</a>)", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2021/04/07/dining/06croissantsrex3-ham/merlin_185733012_be6b3bfe-686f-4e5d-b8cb-ea76867fcbf1-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "10 croissants", "recipeCuisine": "", "recipeCategory": "pastries, project", "keywords": "emmenthaler, gruyère, ham", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 223}, "recipeIngredient": ["<a href=\"https://cooking.nytimes.com/recipes/1022053-croissants\">Croissant dough</a>, rolled out to a 15-by-16-inch slab, chilled (See Notes)", "All-purpose flour, for dusting", "10 very thin slices uncured ham, such as Paris ham (about 5 ounces)", "5 ounces Emmental, Gruyère or Swiss cheese, grated (1 1/4 cups)", "1 large egg yolk", "1 tablespoon heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange racks in the upper third and lower thirds of the oven. Bring a skillet of water to a simmer over medium-high heat. Transfer the skillet to the floor of the oven and close the door. (The steam released inside the oven will create an ideal proofing environment for the pastries.) Line two rimmed baking sheets with parchment paper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the dough sit for 5 minutes at room temperature. Unwrap (save the plastic wrap for proofing) and place on a very lightly floured surface. If the dough has shrunk during chilling, roll it out again to a slab that’s 16 inches long and 15 inches wide. Dust off any excess flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a wheel cutter to trim 1/2 inch of dough from all four sides, straightening and squaring them off, creating a slab that’s 15 inches long by 14 inches wide. Using a ruler, cut the slab lengthwise into 5 equal strips each measuring 3 inches wide. Cut each strip in half crosswise, creating 10 rectangles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one rectangle of dough at a time, cover one half with a slice of ham, folding it as needed to leave a 1/2-inch border along the short side. Then, top with 1/2 ounce (2 tablespoons) of the cheese. Roll the dough into a snug spiral, starting at the end with the ham and cheese, then transfer the spiral to one of the prepared baking sheets, resting it on the seam. Repeat with the remaining dough, ham and cheese, dividing between the sheets and spacing evenly. Very loosely cover with plastic wrap so the pastries have some room to expand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the oven and stick your hand inside: It should be humid but not hot, as the water in the skillet will have cooled. You want the pastries to proof at 70 to 75 degrees (any hotter and the butter will melt, leading to a denser pastry). Gently place the baking sheets inside the oven on the two racks and let the pastries proof until they’re doubled in size, extremely puffy and jiggle delicately on the baking sheet, 2 to 2 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pastries are proofed, remove the baking sheets from the oven and carefully uncover them. Transfer to the refrigerator and chill for 20 minutes while you heat the oven. Remove the skillet from the oven and heat to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir the yolks and heavy cream until streak-free. Remove the baking sheets from the refrigerator and use a pastry brush to gently brush the surfaces of each pastry with the yolk mixture. Transfer the sheets to the oven and bake for 20 minutes. Rotate the baking sheets and switch racks and continue to bake until the pastries are deeply browned, another 10 to 15 minutes. Remove from the oven and let cool completely on the baking sheets."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022058-ham-and-cheese-croissants"}