{"@context": "http://schema.org", "@type": "Recipe", "name": "Kung Pao Cauliflower", "description": "While kung pao chicken originated in China’s Sichuan Province, it has become an iconic Chinese American dish. The popular stir-fry typically includes chicken, vegetables and peanuts tossed in a dark, salty, sweet and spicy sauce, but in this vegan take, cauliflower steps in for the chicken. Dark soy sauce is more caramel-flavored and less salty than regular soy sauce, and it adds color and richness to the dish. If you don’t have dark soy, substitute with regular soy sauce or hoisin sauce. Make sure you have a lid for your skillet or wok on hand before you start cooking, as covering the cauliflower allows it to cook quicker and more evenly.\n \nTo get vegetarian recipes like this one delivered to your inbox, <a href=\"https://www.nytimes.com/newsletters/the-veggie\">sign up for The Veggie newsletter</a>.", "author": {"@type": "Person", "name": "Hetty McKinnon"}, "image": "https://static01.nyt.com/images/2022/01/12/dining/hm-kung-pao-cauliflower/hm-kung-pao-cauliflower-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, main course", "keywords": "cauliflower, chinese american, dried chiles, peanut, sichuan peppercorns, soy sauce, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1421}, "recipeIngredient": ["1 tablespoon dark soy sauce", "1 tablespoon soy sauce", "1 tablespoon black vinegar", "1 tablespoon granulated sugar", "1/4 cup vegetable stock or water", "1 teaspoon cornstarch", "3 tablespoons neutral oil, such as grapeseed or canola", "1 head cauliflower (about 2 pounds), cut into small 2-inch-long florets", "Kosher salt (Diamond Crystal)", "1 green or red bell pepper, core, seeds and membrane removed, and cut into 1-inch pieces", "1/2 to 1 teaspoon Sichuan peppercorns, lightly ground in a mortar and pestle, spice grinder or crushed with a rolling pin", "5 to 8 whole dried chiles, such as er jing tiao or chiles de arbol", "2 garlic cloves, finely chopped", "1 (1-inch) piece of ginger, peeled and finely sliced", "1/3 cup roasted peanuts", "2 scallions, white and green parts, finely sliced", "Steamed rice, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the dark soy sauce, soy sauce, black vinegar, sugar, vegetable stock or water, and cornstarch. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat wok or large (12-inch) skillet on medium-high until very hot. Add 2 tablespoons of oil, the cauliflower florets and 1/2 teaspoon salt, and toss for 1 minute. Cover and cook for 5 to 6 minutes, tossing the cauliflower every 1 1/2 minutes or so, until the cauliflower is crisp-tender and charred in some parts. Remove from the pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same wok or skillet, add the remaining 1 tablespoon of neutral oil, along with the bell pepper. Toss for 1 minute, then add the Sichuan peppercorns and whole dried chiles, and stir for 1 minute until fragrant. Add the garlic and ginger, and stir for 30 seconds, then add the cauliflower back to the pan. Stir the sauce in the bowl to make sure the cornstarch is well incorporated, then pour it over the cauliflower and toss until the cauliflower is well coated. Toss in the peanuts and scallions, stir to combine, then turn off heat. Serve with rice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022869-kung-pao-cauliflower"}