{"@context": "http://schema.org", "@type": "Recipe", "name": "Hotteok (Sweet Filled Pancakes)", "description": "It is easy to fall in love with hotteok, a Korean street food that’s crisp on the outside, and chewy underneath thanks to sweet rice flour. The center oozes with hot sugary nuts (or other fillings — feel free to experiment). The dish came to South Korea by way of Chinese immigrants in the 19th century, and this version is adapted from “Korean Soul Food” (Frances Lincoln, 2019) by the chef Judy Joo. She uses muscovado sugar, as it gives the interior a rich flavor and gooey texture, but the more traditional dark brown sugar works well, too. It’s tempting to eat hotteok straight out of the pan, but make sure to let it cool down slightly before enjoying, so the melted sugar doesn’t burn the roof of your mouth.", "author": {"@type": "Person", "name": "Priya Krishna"}, "image": "https://static01.nyt.com/images/2022/02/09/dining/04HOTTEOKREX/merlin_201183642_2b014c32-c1cd-4f2a-a4c1-0b7630745274-articleLarge.jpg", "totalTime": "PT3H45M", "recipeYield": "10 hotteok ", "recipeCuisine": "korean", "recipeCategory": "snack, pancakes", "keywords": "muscovado, peanuts, sweet rice flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 191}, "recipeIngredient": ["1 1/2 cups/360 milliliters whole milk ", "2 tablespoons granulated sugar ", "1 packet/7 grams instant yeast ", "1 1/2 cups/225 grams bread flour, plus more for dusting (see Tip)", "1 cup/150 grams sweet rice flour ", "1 1/2 tablespoons cornstarch ", "1/2 teaspoon coarse kosher salt", "Vegetable oil, for greasing and frying", "1/2 cup/125 grams firmly packed muscovado or dark brown sugar ", "1/2 cup/75 grams roasted unsalted peanuts, coarsely chopped ", "1 tablespoon ground cinnamon ", "3/4 teaspoon coarse kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a small saucepan over medium heat, heat the milk to about 105 degrees. (If you don’t have a thermometer, heat the milk until it feels like a warm bath — hot but not scalding). Remove from heat, stir in the granulated sugar and yeast, and whisk until the sugar has dissolved. Let stand in a warm place for 3 to 5 minutes, or until bubbling, to activate the yeast."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the bread flour, rice flour, cornstarch and salt. Slowly stir in the warm milk mixture until a sticky dough forms. Grease your hands with a little oil to prevent sticking and shape the dough into a ball. Transfer the dough ball to another large bowl greased lightly with vegetable oil, and cover with a clean, damp kitchen towel. Let the dough rise in a warm place until doubled in size, 1 1/2 to 2 hours. Punch it down, cover again and let it rise until doubled in size again, about 1 1/2 hours more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the filling: In a small bowl, mix together the muscovado sugar, peanuts, cinnamon and salt. Muscovado sugar has a tendency to clump — use your fingers to squish any clumps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the dough has risen a second time, dust a clean work surface with bread flour and turn the dough out onto it. Dust the top of the dough with some more flour and knead it a few times. Shape the dough into a fat, long log. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the dough into 10 equal pieces, shape each piece into a ball, set on the floured work surface, and cover with a clean kitchen towel or plastic wrap. Dusting with flour as needed to prevent sticking, press a dough ball into a 4-inch-wide disk using your fingertips. Make sure the disk is uniformly thick so the finished pancake will be evenly filled. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the disk in your hand and slightly cup it. Spoon 2 packed tablespoons of the filling into the center of the disk. Seal the disk closed by wrapping the dough around the filling and pinching the edges together at the top. Once sealed, reshape gently to form a ball, set with the seam side down on the floured work surface and cover with a clean kitchen towel or plastic wrap. Repeat with the remaining dough balls and filling. (You may have some leftover filling. Sprinkle it on buttered toast or roti. Combine it with peeled, sliced apples and bake it into a pie or crumble.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonstick skillet, heat 3 tablespoons oil over medium-high. Put 2 or 3 dough balls seam-side down in the skillet and immediately flatten them with a spatula to a diameter of about 4 inches. Reduce the heat to medium and fry the pancakes until golden brown and crisp on the bottom, 3 to 4 minutes. Flip them and cook until the other side is golden brown and the hotteok feel slightly springy to the touch, 3 to 4 minutes more. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the hotteok to a wire rack or paper towel-lined plate when done. Repeat with the remaining dough balls, wiping the skillet clean and adding fresh oil for each batch. Let the hotteok cool slightly before serving; it’s easy to burn yourself in your haste to gobble these up, as the insides are hot and oozing. Any leftovers can be cooled completely and frozen in an airtight container for up to a month. Reheat in a 350-degree oven, and re-fry in a pan with a little oil to crisp them again."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022948-hotteok-sweet-filled-pancakes"}