{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Raspberry Meringue Tart", "description": "Scarlet threads of freeze-dried raspberry powder and streaks of bittersweet chocolate add richness and flair to this fluffy-topped meringue tart. It does take time to make, but many of the steps can be done in advance, and this stunning, intensely fruity confection is well worth planning for. The dough, filling and raspberry powder can be prepared up to five days ahead, then make the meringue just before the tart is baked. It’s at its best served on the same day as baking. Store leftovers in a sealed container at room temperature.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/02/09/dining/07apperex3-raspberry/merlin_201071094_92d6b2a2-83f7-47f0-8127-9a9cfed973cc-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 274}, "recipeIngredient": ["1 3/4 cups plus 2 tablespoons/235 grams all-purpose flour, plus more for rolling dough", "1/3 cup/40 grams confectioners’ sugar", "Pinch of salt", "1/2 cup/113 grams unsalted butter, cold and cubed", "1 large egg, lightly beaten", "2 cups/260 grams frozen (or fresh) raspberries", "1/2 cup/100 grams granulated sugar", "2 tablespoons/30 milliliters freshly squeezed lemon juice", "3 egg yolks", "1 large egg", "6 tablespoons/85 grams unsalted butter, cut into 1/2-inch pieces", "Pinch of salt", "3/4 cup/20 grams freeze-dried raspberries", "1 tablespoon unsweetened Dutch-processed cocoa powder", "1 ounce bittersweet chocolate, coarsely chopped", "4 egg whites, at room temperature", "1 cup/200 grams granulated sugar", "1/4 teaspoon cream of tartar", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tart dough: Place the flour, sugar and salt in the bowl of a food processor. Pulse to combine. Add butter and pulse until a coarse meal forms. Add egg and pulse just until a crumbly dough comes together. If the dough seems dry, drizzle in a teaspoon or two of water. Press dough into a disk, wrap in plastic and chill for at least 1 hour or overnight (or up to 5 days)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the dough out on a lightly floured surface to 3/8-inch thickness (about an 11-inch round). Place dough into a 9-inch tart pan, folding the extra dough in over the edges to build up the sides. Prick bottom of dough all over with a fork; chill in freezer for at least 30 minutes and up to 48 hours. (Cover lightly with plastic wrap if freezing for more than a couple of hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line the tart crust with foil, and fill with baking weights or dried rice or beans. Bake for 15 minutes. Remove foil and weights and continue to bake until shell is light golden, another 15 to 20 minutes. Transfer to a rack to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: In a medium saucepan, combine raspberries and sugar over medium heat. Cook, stirring, until berries break down, 5 to 8 minutes. Remove pan from heat, stir in lemon juice and use a fork or wooden spoon to mash raspberries to a purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together egg yolks and egg. Slowly add 1/4 cup of hot raspberry purée to egg mixture, whisking constantly. Slowly drizzle the egg-raspberry mixture back into the saucepan with remaining purée, whisking constantly to keep eggs from cooking. Turn the heat to medium-low, and add butter and a pinch of salt to the pan. Cook, stirring constantly, until the mixture thickens enough to coat a spoon, about 7 to 9 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the mixture through a fine-mesh sieve, pressing hard on the solids, into a bowl. Allow to stand for 5 minutes, then whisk briefly to smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour raspberry filling into the tart shell. Bake until filling is set (it should jiggle only slightly in the center), about 14 to 22 minutes. Remove tart from oven and increase oven temperature to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Start preparing the meringue: Using a blender or food processor, blend the freeze-dried raspberries until you get a fine powder speckled with seeds. (The seeds won’t break down so don’t even try.) Set aside 1 tablespoon of raspberry powder for garnish. Combine cocoa powder with remaining raspberry powder to use for the meringue."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chocolate in heatproof bowl, and melt in microwave in 10-second intervals, stirring after each, until smooth. Set aside. (Or you can melt the chocolate in a pot on the stove over low heat, stirring constantly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a medium pot with 1 inch of water and bring to a simmer over medium-high heat. In a large metal bowl, whisk together egg whites, sugar, cream of tartar and salt. Set the mixing bowl with the egg white mixture into the pot above the water, and whisk constantly by hand until sugar dissolves and mixture is warm (160 degrees on an instant thermometer) and has thickened and lightened in color, 5 to 7 minutes. Remove bowl from heat. Using an electric mixer, beat on medium-low speed and gradually increase speed to high, until mixture is thick and fluffy, and stiff peaks form, about 5 to 8 minutes. Be careful not to overbeat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle raspberry-cocoa mixture on top of meringue. Using a rubber spatula, gently fold in mixture 2 to 3 times to halfway incorporate, but remains very streaky. (Do not overmix.) Drizzle melted chocolate into meringue and gently fold until just combined and still streaky. Take care not to deflate the meringue very much. (It will deflate somewhat.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the meringue over the hot filling, making sure it meets the edges of the crust. Using a knife or spatula, swirl in a design. Bake until lightly browned, about 7 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow to cool completely and sprinkle the top with a little of the reserved raspberry powder. (Save the extra to perk up oatmeal, smoothies and peanut butter sandwiches.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022952-chocolate-raspberry-meringue-tart"}