{"@context": "http://schema.org", "@type": "Recipe", "name": "Classic Apple Pie", "description": "In this very classic, cinnamon-scented pie, the apples are sautéed in butter before they’re piled in the crust, ensuring that they’re tender but not mushy. Use firm, crisp apples here, preferably all one kind so the slices cook evenly. Honeycrisp, Golden Delicious, Ginger Gold and Granny Smith apples are good options. (Honeycrisps will give you the sweetest pie, while Granny Smiths the most tart.) If using a glass or ceramic pie pan, consider parbaking the bottom crust. Glass doesn’t conduct heat as well as metal, so the crust may not cook through if you don’t parbake.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/11/17/dining/12bestpierex1-apple2-copy/merlin_196953993_c5026128-d31d-4605-b57a-9cbadf24ca89-mediumThreeByTwo440.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "dessert", "keywords": "apple, apple pie, lemon juice, pie dough, fall, winter, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1468}, "recipeIngredient": ["2 tablespoons unsalted butter", "3 1/2 pounds firm, crisp apples (see Tip), peeled, cored and cut into 1/4-inch wedges (about 11 cups)", "1/2 cup/110 grams light brown sugar", "2 tablespoons granulated sugar", "1 teaspoon ground cinnamon", "1/2 teaspoon ground ginger", "1/2 teaspoon grated nutmeg", "Pinch of ground cloves", "1/4 teaspoon fine sea salt", "2 tablespoons cornstarch", "1 1/2 teaspoons fresh lemon juice, or a little more if your apples are very sweet", "1/2 teaspoon grated lemon zest", "All-purpose flour, for rolling out the dough", "<a href=\"https://cooking.nytimes.com/recipes/448-pie-crust\">Dough for a 9-inch double crust pie</a>", "Heavy cream, milk or a beaten egg, for glazing (optional)", "Demerara sugar, for glazing (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in a large skillet set over medium-high heat and add apples to the pan. Stir to coat with butter and cook, stirring occasionally, until the butter is evenly distributed, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together sugars, spices and salt. Sprinkle over the apples and toss to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower heat to medium and cook until apples have softened completely but still hold their shape, about 17 to 25 minutes. (Some varieties cook more quickly than others.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle cornstarch evenly over the apples and continue to cook, stirring occasionally, until the apple mixture comes to a simmer and thickens slightly, about 2 minutes. Remove pan from heat, and stir in lemon juice and zest. Allow apples to cool completely (spreading them onto a rimmed baking sheet speeds this up). Apples can be prepared up to 24 hours ahead and refrigerated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll half of the pie dough into a 12-inch circle. Transfer dough to a 9- or 10-inch metal pie plate, trimming it to leave a 1/2-inch overhang. Place crust in the freezer for 30 minutes or up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, place a rimmed baking sheet on the middle oven rack and heat oven to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the remaining dough on a lightly floured surface to a 10- to 11-inch circle. Remove pie crust from freezer and add the cooled filling in an even layer. Cover apples with remaining dough. Press the edges together, trim the excess dough, and crimp the edges with your fingers or a press down with the tines of a fork. (Using a fork might be easier if the bottom crust is too cold to crimp.) Brush the top of the pie with cream, milk or some beaten egg, then sprinkle lightly with sugar if you like. Using a sharp knife, cut some steam vents in the top of the crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pie on the hot sheet pan and bake for 20 minutes. Reduce heat to 375 degrees and bake for another 30 to 40 minutes, until the filling bubbles in the steam vents, and the crust is golden brown. Transfer pie to a wire cooling rack and allow to cool for at least 2 hours before serving. The pie can be baked up to 24 hours ahead of serving; do not refrigerate before serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Melissa Clark’s Best Apple Pie", "description": "In this very classic, cinnamon-scented pie, the apples are sautéed in butter before they’re piled in the crust, ensuring that they’re tender but not mushy. Use firm, crisp apples here, preferably all one kind so the slices cook evenly. Honeycrisp, Golden Delicious, Ginger Gold and Granny Smith apples are good options. (Honeycrisps will give you the sweetest pie, while Granny Smiths the most tart.) If using a glass or ceramic pie pan, consider parbaking the bottom crust. Glass doesn’t conduct heat as well as metal, so the crust may not cook through if you don’t parbake.", "thumbnailUrl": "https://static01.nyt.com/images/2021/11/17/dining/12bestpierex1-apple2-copy/merlin_196953993_c5026128-d31d-4605-b57a-9cbadf24ca89-mediumThreeByTwo440.jpg", "uploadDate": "2021-11-12T17:31:08.000Z", "duration": "PT11M43S", "transcript": "Because who doesn't like to hit pie dough with a rolling pin, I don't know. Good way to get out those Thanksgiving tensions. Hi, I'm Melissa Clark, and I'm coming to you from my home kitchen, where I've spent the last six months tweaking, improving, shall we say, possibly perfecting the three iconic Thanksgiving pies: apple, pecan and pumpkin. And along the way, I had some pie wisdom that I thought I would share with you. Plus, also, I wanted to show you my collection of pie pans. Three things that I've learned from all my pie testing — and not just from this project, but from my whole life of baking pies — you'll notice with my pie tins, most of them are metal because I really do feel that metal is your best material for getting a crisp crust. Glass does not conduct heat as well as metal. Neither does ceramic. So you're going to get a less baked crust. You're just not going to get that crunch and that dark brown color. Tip number two: You don't have to parbake your crust. I have learned that if you put a metal sheet pan in your oven and you let it preheat while your oven is coming up to temperature, you don't need to parbake because that hot metal combined with your metal pad, will start cooking your crust immediately and give you a nice deep color and a beautiful crunch. Tip number three: Always start with cold dough. Once it starts warming up to room temperature, you're going to lose all of your flakiness. So if your kitchen is warm, why don't you throw the dough in the freezer for a few minutes before you start rolling it out. Or just put it back in the fridge. Take your time. Make sure your dough is cold, and that is going to give you the best texture. We're going to spend the next three weeks going through all of the pies I just mentioned. And first up is apple pie. I don't like to mix apples in my apple pie. I used to mix them. I used to be big into \"mix all the different apples so you get a lot of different flavors\" and that is true. But what you lose is texture because different apples will cook at different rates. I want all my apples to be approximately the same texture, and the only way to get them there is to use the same variety of apples. My favorite are the Ginger Golds. They're kind of a newish hybrid. They're like Golden Delicious but tangier, because Golden Delicious can be a little on the sweet side. Granny Smiths are also great. They are a little bit softer and a little more tart, which is nice. And Honeycrisps, which you can buy anywhere, are also fantastic, slightly sweeter than the Ginger Gold. But that same, you know, really nice, non-flabby texture. This is my recipe for a really simple all-butter pie crust, and I use it for pretty much all of my pies. This recipe gives you enough dough for a 9-inch crust, so it's perfect for your pecan and your pumpkin pie. For the apple pie, you need two of these. So just toss everything together. Basically, what I'm doing right now is I'm smooshing the butter. I'm just flattening it basically into flakes, and you can do this in the food processor, you can do this in your mixer or you can do it by hand. Everything should be as cold as possible. You want the butter to be cold. Some people actually put the flour in the freezer before they start making pie crust. I don't do that, but you can. What you don't want is the butter to melt. At this point all of the little butter cubes have been reduced to flakes, and now I'm going to add my water. And you just want to add it gradually. You're going to need anywhere between, say, 3 and 6 tablespoons of ice water. So you know that you've added enough water when the dough starts to look a little bit moist. You can see it. And then when you squeeze some in your hand, it should start to hold together like that. Here's the thing. There's a fine line between smooshing the dough together and overworking it, so there can still be little floury bits. That's OK. When you chill the dough, the hydration evens out. I'm going to cover it up and put it in the fridge and let it get nice and cold. So your pie dough is made, it's chilled. And now I'm going to roll it out and put it in the pie pan. Now I like to start out beating it up a little because, you know, it's kind of fun. Whenever you're rolling out pie dough, you want to absolutely move it all the time. See how I'm just kind of moving it around and it's collecting more flour on the bottom. I'm going to add a little more flour on top, and that is to keep it from sticking to your surface. See, it's starting to stick. I'm not going to let it. Flour it and flip. You want to work quickly before the dough warms up, you just don't want a warm, soft dough. It's harder to work with, and it's not as crisp, so keep it cold. And if you find that it's taking a long time to roll it out, throw it back in the fridge for a few minutes, you know. So you want it to be like a couple of inches bigger than the plate. So then you just fold it over. And then I am just lifting it right into the pie plate, and I'm just pressing it in all around. I'm not going to crimp it now. I'm going to crimp and trim it later. I'm just going to throw this into the freezer and I'm going to let it set up and get really cold. I've got my 3 1/2 pounds of apples right here, so I'm using the Honeycrisp. And you know, you gotta peel them. This might be a little bit tedious, but it goes quick. You put on your music or you just zen into it. And now to cut the apples, you can use one of those little apple cutter core things if you have it. But I usually just use a knife, kind of cut the core as I go, and then I'm looking for 1/4-inch slices. If they're a little thicker or a little thinner, it actually doesn't matter, because you're precooking them. So the texture is going to be perfect. If you cut them a little bit thinner, they're going to cook a little faster. If you leave them a little thicker, they're going to take a little more time. So you have options. So do not worry about it. After you peel and slice 3 1/2 pounds of apples, you get a giant bowlful. This is about 11 cups of apple slices, and like I said, I'm going to precook the filling, cook the apples in butter and spices and sugar because yum! I've been giving apple pie out to all my neighbors and making them vote on which apples they like the best. And I have to say, it's pretty evenly split. My next-door neighbors like the Granny Smith the best because they appreciate the tartness, even though the texture is a little softer. Like I said, I am a big Ginger Gold fan. My neighbors across the street like the Honeycrisp, so. And those are great. It's all good. This is brown sugar, 1/2 cup of brown sugar, and I'm going to add some white sugar also, some granulated. I like a spicy apple pie. I like to taste the cinnamon and ginger. Some people like a less spicy pie, but I say, if you don't want a spicy apple pie, then make an apple tart or make tarte tatin or something like that. I think an apple pie should have spices and a 1/4 teaspoon of salt, and the salt is important. It brings out all the other flavors. So the reason I'm doing this separately in a little bowl instead of just throwing everything into the pot, which would be my tendency because, you know, I hate actually having a dirty up another bowl. But in this case, it's important because brown sugar gets clumpy and you don't want to mix this too too much because you don't want to break the apples. So get it nice and mixed. And now I'm going to partially cover the pot. Start checking it after 15 minutes. You want the apples to be tender and really perfectly tender, but you don't want them to start to disintegrate. So you don't want any apples to be fork-firm. You want them to, like if you pick it up, I'll show you. But when you pick it up, they should kind of flop on the fork. So I'm going to test the apples and we're looking for — remember — floppy. See, floppy. So I'm going to reduce the heat right now, and I'm going to add the cornstarch, and I'm going to let the cornstarch simmer for a couple of minutes to start thickening the juices. So I'm going to add some lemon zest and some lemon juice. See, I think that's perfect. I'm going to actually put these apples on a sheet pan to cool because the surface area will help them cool more quickly. And it's really important to let your apples cool before assembling the pie because you've just gone to the trouble of chilling your pie crust. Now, if you plop hot apples in that cold pie crust, you're going to heat it up and you're going to lose all your flakiness. And then what would have been the point of chilling it in the first place? So definitely give yourself enough time to cool this down. So the apples are cool. The bottom crust is chilled. I'm going to roll out the top crust right now, and then we're going to bake the pie, which is not as good as eating the pie, but it's helping us get there. Just like before, you just want to lean into it and keep it moving. Pie crust used to really stress me out because, you know, it would stick and it wouldn't come out right. Really, the key for me is moving it. I'm going to go get the bottom crust from the fridge. Freezer. I meant freezer. At this point, you want to work quickly. This crust is going to be fine. This one might get a little soft. You want to just spread it into an even layer. And now I'm just going to trim the crust. And once you've trimmed around the excess dough, you just crimp it. Or you can just take a fork and just press it together. And now I'm just going to brush it with a little bit of cream. Or you can use an egg wash or you can use milk. Basically, this helps get the crust golden brown. And then if you want to, you can also top the crust with some sugar, demerara sugar or regular granulated sugar. Now I'm going to cut some vents and the vent is going to allow the steam to escape. And we can bake it. It is the moment we have been waiting for. The pies are cool and we can finally cut into them. So I've got two of them for you. I just want to show you some differences on how these guys baked up. This pie has an egg wash and demerara sugar on the top. I love the crunch of the demerara sugar. It's just yet another delicious texture. Can I just point out the beauty of the flakes? Look at that pie crust. Look at those gorgeous flakes that is from not overworking the dough, and it almost separates like puff pastry. It's so beautiful. OK, I'm sorry, but look at that, that looks really good. Let's just examine this, shall we? So the pastry is sitting right on top of the apples. There's no air gap, which also helped it cut nice and neatly. The apples are just glossed with their sauce. You know, with the lovely spice-and-sugar mixture. It's not runny, but it's not dry. It's cooked all the way through. It's golden brown, which is what you want. So now I'm going to eat some. So yeah, that's good. You know, the only thing I would change about this pie. See, every year I try to make it better. What do you think about a little flaky sea salt on top with the demerara sugar? I just feel like to accentuate the salt. Otherwise, it's perfect, but I can't stop. You know, it's like I get to a pie place and I think, OK, this is going to be my recipe, but I can tell you I might have some ideas for next year.", "contentUrl": "https://vp.nyt.com/video/2021/11/12/97238_1_MC_Apple-Pie-Video-2021_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022727-classic-apple-pie"}