{"@context": "http://schema.org", "@type": "Recipe", "name": "Kimchi Jjigae With Ribs", "description": "The world of bubbling jjigaes, or stews, is vast and varied. The most beloved might be kimchi jjigae, a pot of extra-fermented kimchi boiled in its own juices until mellowed and yielding. Pork belly, Spam and tofu are common protein additions, as are tuna and mackerel pike. In this version, baby back ribs lend both flavor and body to the broth and are fun to eat with your hands. In case your kimchi is less than ripe (it should taste sharp and funky), a couple of seasonings help fortify this jjigae’s flavor: Fish sauce adds savory depth, and maesil cheong (green plum syrup) lends rounded sweetness. And though watercress is not a traditional ingredient in kimchi jjigae, it is a favorite addition to this family recipe.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2021/04/30/dining/30motherrex/merlin_186774930_f70cdae6-2782-44db-98fb-4683814160f2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "korean", "recipeCategory": "dinner, weeknight, soups and stews, main course", "keywords": "baby back ribs, kimchi", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 394}, "recipeIngredient": ["1 rack baby back ribs (about 1 1/2 pounds), sliced into individual ribs", "1 (3-inch) piece ginger, scrubbed and cut into 1/2-inch slices", "1 tablespoon unsalted butter", "1 tablespoon gochugaru (see Tips), plus more to taste", "4 large garlic cloves, minced", "2 packed cups coarsely chopped ripe kimchi (about 1 pound), plus any accumulated juices", "Kosher salt", "1 medium yellow onion, halved and cut into 1/4-inch slices ", "1 tablespoon fish sauce, plus more to taste", "1 tablespoon maesil cheong (green plum syrup; see Tips), plus more to taste", "1 packed cup watercress, leaves and tender stems, for serving (from 1 small bunch; optional)", "Cooked white rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the ribs and ginger in a large Dutch oven or other heavy-bottomed pot and cover with cold tap water. Bring to a boil over high heat and cook the ribs until they are no longer pink and gray foam collects at the surface, about 5 minutes. Drain the ribs in a colander and rinse under cold tap water. Discard the ginger. Rinse the pot out if it is especially dirty; place the empty pot back on the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in the pot over low heat and add the gochugaru and garlic. Stir until aromatic, just a few seconds, watching carefully to avoid burning the gochugaru or garlic. Add the kimchi and 2 cups of water and stir to combine. Nestle in the cleaned ribs in a single layer and season the cooking liquid generously with salt. Bring to a boil over high heat, then reduce the heat to medium-low. Cover the pot and gently boil until the kimchi starts to soften, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion slices in a single layer over the ribs, tamping them down slightly to dampen them in the porky kimchi juices. Cover the pot again and continue gently boiling until the ribs are cooked through and the onions have released their juices and thinned out the broth slightly, 10 to 15 minutes. These ribs should tear off the bone easily but remain juicy and chewy; they aren’t meant to be fall-apart tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat and stir in the fish sauce and maesil cheong, adding more to taste. Season with a final pinch of gochugaru and salt if desired. Top the stew with the watercress, if using, and let it wilt slightly in the residual heat. Serve the pot of kimchi jjigae in the center of the table, family-style, with a ladle and bowls of fresh white rice and a plate for the bones."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022130-kimchi-jjigae-with-ribs"}