{"@context": "http://schema.org", "@type": "Recipe", "name": "Pepperoni Pasta With Lemon and Garlic", "description": "Bits of chopped pepperoni crisp up almost like bacon when fried, with curled, browned edges and a savory, spicy bite. Here, they’re the foundation of a hearty pasta sauce that’s supremely satisfying and fast enough for a weeknight. Lemon, garlic and fennel seeds round out the flavors, and fresh herbs lend brightness. Taste the pepperoni before adding the optional red-pepper flakes. Depending on the brand of sausage, you might not need the extra kick. And if you don't have pepperoni on hand, any kind of salami will work.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/09/22/dining/17apperex/17apperex-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weekday, weeknight, pastas, main course", "keywords": "basil, orecchiette, pepperoni", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1401}, "recipeIngredient": ["Salt", "1 pound medium pasta shells or orecchiette", "1 tablespoon extra-virgin olive oil, plus more as needed", "6 ounces pepperoni, thinly sliced, then coarsely chopped (about 2 cups)", "3 garlic cloves, thinly sliced", "1 teaspoon fennel seeds, cracked with a mortar and pestle or the side of a chef’s knife", "Pinch of red-pepper flakes (optional)", "1 tablespoon tomato paste", "1 small lemon, zested (if your lemon is very large, just zest half of it)", "3/4 cup torn fresh basil or parsley leaves and tender stems, plus more for garnish", "Grated Parmesan, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to a boil. Add pasta and cook, according to package directions, until about 2 minutes shy of al dente so that the pasta can finish cooking in the sauce. Reserve 1 cup of the pasta cooking water, then drain the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta is cooking, in a large skillet or Dutch oven, heat oil over medium. Add pepperoni and cook, stirring occasionally, until crisped and brown, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the pan looks dry, drizzle in a little more oil. Add garlic, fennel seeds, red-pepper flakes (if using) and a large pinch of salt, and cook until garlic is lightly golden, 2 to 3 minutes. Add tomato paste and cook until it darkens, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the drained pasta, lemon zest and 3/4 cup of the reserved pasta water to the skillet. Stir until the pasta is al dente and well coated with the sauce. Add more pasta water, if needed, until the sauce is glossy and the pasta is cooked to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the zested lemon in half and squeeze some juice into the pasta. Stir in herbs and taste, adding more lemon juice and salt, if needed. Cut the remaining half lemon into wedges and serve it alongside the pasta, which should be garnished with more herbs and a drizzle of oil, and sprinkled with Parmesan, if you like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022565-pepperoni-pasta-with-lemon-and-garlic"}