{"@context": "http://schema.org", "@type": "Recipe", "name": "Hoshigaki (Dried Persimmons)", "description": "Japanese hoshigaki are a special, seasonal treat made with firm, astringent Hachiya persimmons that are dried for a few weeks until they become extremely tender and sweet. The prep is a little intensive — each fruit must be peeled, dunked in boiling water and suspended in such a way that it doesn’t touch anything, to discourage mold from forming. If the stems haven’t been cut so they’re easy to tie with string, they will require binder clips or another makeshift hanging solutions. But after the persimmons are set up, all they need is plenty of time, sunlight and air to transform into succulent hoshigaki. Slice the dried fruit and nibble it as is for dessert, pair it with good cheese, or toss it into a simple green salad.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2022/01/02/magazine/02mag-eat-site/02mag-eat-site-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "24 persimmons", "recipeCuisine": "japanese", "recipeCategory": "snack", "keywords": "fall, winter, persimmon", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 86}, "recipeIngredient": ["24 or more firm, unripe Hachiya persimmons, preferably with long stems to make hanging easy", "Kitchen string, or other thin string"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the fruit well. Remove the leaves, then use a knife or vegetable peeler to remove the peel from the crown of the fruit around the stem. Continue to peel the entire fruit, leaving the stems intact and cutting out any brown spots. Set up a rack or bar, such as a clean laundry rack, near a window with a large piece of parchment underneath. You should be able to suspend the fruit so they don’t touch one another or any other surfaces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tie and sterilize the fruit: Cut a 20-inch piece of thin string for every 2 persimmons and tie the string to the stems of the persimmons using no-slip knots on both ends of each piece. Trim excess string if needed. If the stems aren’t long enough to tie, fix binder clips to the stems and tie those. If the stems aren’t long enough for that, run short bamboo skewers through the tops of the persimmons and tie the skewers. Bring a pot of water to a boil and, holding each piece of string at the center, dunk the fruit for a few seconds, then lift out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Hang each string over the prepared rack, so the fruit is dangling on either side of the bars, but not touching anything. Ideally, keep the rack in a sunny, dry, well-ventilated spot, either indoors or outdoors."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After a week of drying, you can start to lightly knead the fruit every day, rolling each one gently in clean hands to help it dry evenly. Watch for any mold, which you can remove with a cotton swab dipped in alcohol, and for firm spots, which you can focus on when you knead the fruit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Over the course of about 3 weeks, the persimmons will shrivel and shrink, and its sugars will come up to the surface and crystallize, forming a white layer. Once the sugar is visible, you can eat the fruit or continue to dry them, and you can stop kneading them. When the fruit is firm and dark and more powdery sugar covers the surface, it’s ready to remove from the drying rack and store in an airtight container at room temperature for up to 1 month or in the freezer for up to 6 months. It tastes best immediately after drying, when you can slice and eat it as is."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022853-hoshigaki-dried-persimmons"}