{"@context": "http://schema.org", "@type": "Recipe", "name": "Crab Rangoon", "description": "The irresistible combo of crispy, fried egg noodle encasing molten cream cheese has made this snack a finger food mainstay. Though it has roots in mid-century Polynesian-style bars and restaurants, the imitation crab stick-filled fried wonton has been adopted by many American Chinese menus. The chef-consultant Eric Ehler designed the menu at Lazy Susan, a Chinese takeout spot in San Francisco; for his version of the classic dish, he uses Dungeness crab meat and adds scallions and lemon zest for color. As a child, Mr. Ehler loved to dip the fried wontons in egg drop soup, or use them as a scoop for rice.", "author": {"@type": "Person", "name": "Cathy Erway"}, "image": "https://static01.nyt.com/images/2021/06/23/dining/21takeoutrex3/merlin_188667807_656368ba-66fc-4c77-bc96-1b68418f3cf2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "42 to 50 pieces", "recipeCuisine": "american, chinese", "recipeCategory": "dumplings, finger foods, appetizer", "keywords": "crab, cream cheese, scallion, wonton wrappers", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 249}, "recipeIngredient": ["2 (8-ounce) packages cream cheese", "3 tablespoons sliced scallion greens", "1/2 lemon, zested", "1 teaspoon granulated sugar", "1/2 teaspoon salt", "1 1/2 cups/7.5 ounces lump crab meat (preferably Dungeness, or substitute with imitation crab)", "1 (12-ounce) package yellow square (about 3 1/2-inch) wonton wrappers (about 50)", "All-purpose flour, for dusting", "3 quarts rice bran or canola oil", "1/2 cup ketchup", "3 tablespoons granulated sugar", "2 tablespoons rice vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cream cheese from its packaging, set it in a large bowl and let it soften at room temperature for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dipping sauce, if desired: Stir the ketchup, sugar and rice vinegar in a small saucepan over medium-high heat and bring it just to a boil, whisking until the sugar dissolves. Set aside to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the scallions, lemon zest, sugar and salt to the softened cream cheese. Using clean hands, gently flake the crab meat into a separate bowl; pick out any shell fragments. Using a silicone spatula, mix the shredded crab into the cream cheese mixture until evenly incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unwrap the wonton wrappers from their packaging and separate them from one another. (This will speed up the process when filling them.) Stack them loosely and completely cover with a damp paper towel to keep them moist. Place 1 cup water in a nearby bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a wrapper on a flat surface, rotated in a diamond position. Spoon 2 to 3 teaspoons of the filling into its center, using another small spoon to assist scraping it off the teaspoon. Dip your index finger into the water, then use it to moisten the entire edge of the wrapper. To make a simple rangoon, fold the wrapper into a triangle by pulling one corner to its opposite corner, pressing out any air and sealing the wonton shut. To make a star-shaped rangoon, lift the left and right corners underneath between your index fingers and thumbs, and lift them up toward the center, pinching your index fingers and thumbs along the seams to fold each tip as you do it, so that a four-pointed star shape forms. Squeeze out any air, then seal the wrapper along the other two tips so the filling is entirely encased."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the sealed rangoon on a sheet pan or flat surface dusted with flour as you repeat with the remaining wrappers and filling. Freeze them for at least 15 minutes (or up to 2 weeks in an airtight container) before cooking to ensure that they leak less during frying."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, heavy pot or Dutch oven to 350 degrees. (The temperature will fluctuate when frying, but make sure the oil doesn’t smoke or dip below 300 degrees.) Keep the oil over a medium flame or half power on an electric range to help maintain the temperature. Working in batches, fry the rangoons until golden brown and crispy, about 3 to 4 minutes. Using a slotted spoon, transfer them to a paper towel-lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool a few minutes before enjoying, as they will be lava-hot out of the fryer. Enjoy with the optional dipping sauce or another sauce of your choice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022286-crab-rangoon"}