{"@context": "http://schema.org", "@type": "Recipe", "name": "Hamburger Buns", "description": "This recipe makes a classic sesame-studded hamburger bun with just the right amount of sweetness and richness to complement but not overwhelm a beefy patty (or whatever you like to put on your bun). It toasts beautifully, which is recommended to add a bit of sturdiness to the soft crumb. Make sure you let the dough proof fully before baking, otherwise the surface of the buns might split. The recipe time factors in dough preparation. If you already have <a href=\"https://cooking.nytimes.com/recipes/1022248-all-purpose-enriched-bread-dough\">all-purpose enriched bread dough</a> on hand, this is much swifter work.", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2021/05/26/dining/21yeastedrex2-burger/merlin_187924629_8686b67c-aed5-4b60-9310-6dba846a5987-articleLarge.jpg", "totalTime": "PT7H45M", "recipeYield": "10 buns", "recipeCuisine": "american", "recipeCategory": "breads", "keywords": "flour, oil, sesame seeds, fourth of july, memorial day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 152}, "recipeIngredient": ["Neutral oil, such as vegetable, or nonstick cooking spray, for the baking sheets", "1 recipe <a href=\"https://cooking.nytimes.com/recipes/1022248-all-purpose-enriched-bread-dough\">All-Purpose Enriched Bread dough</a>, chilled", "All-purpose flour, for dusting (optional)", "1 large egg", "3 tablespoons hulled sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the baking sheets: Line two large rimmed baking sheets with parchment paper. Lightly brush or spray the parchment with oil, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Portion the dough: Remove the dough from the refrigerator and uncover. Scrape the dough from the bowl and place on the work surface. Use the heel of your hand to knock out the gas and deflate the risen dough, which will be quite firm. Using a kitchen scale and a bench scraper or a knife, portion the dough into 10 equal pieces. (Each piece will weigh about 113 grams.) If you don’t have a kitchen scale, you can eyeball it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form the buns: Working with one piece of dough at a time, fold it onto itself a few times to create a smooth surface, then gather the edges and pinch them together to form a smooth bundle of dough that looks like a garlic bulb. Place it seam-side down on the work surface and position your hand over the dough, palm barely touching the top and fingers lightly cupping it and resting on the work surface. Drag your hand — and the dough with it — slowly across the surface, moving it in small rapid circles. The friction between the dough and the surface will help tighten the dome so your buns will have a uniform, round shape. You shouldn’t need to add flour, since the cold dough is easier to handle and less sticky, but if your dough is slightly warm or otherwise sticky, add just a bit of flour to make it easier to handle. Continue with all the pieces of dough, then arrange the balls on the prepared baking sheets, 5 per sheet, spacing evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Proof the buns: The buns proof best in a humid environment, so use a spray bottle, if you have one, to lightly spritz the baking sheets with water, or just sprinkle some water around the buns with your fingertips. Loosely cover the baking sheets with plastic wrap, then cover with a damp kitchen towel. Let sit at room temperature, undisturbed, until the buns have doubled in size and appear puffed and balloonlike, 1 1/2 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, arrange one oven rack in the upper third and one in the lower third of the oven, then heat it to 350 degrees. Beat the egg in a small bowl until no streaks remain, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Test the buns: To see if the buns are fully proofed, uncover one, lightly oil your finger, and poke the surface gently. It should feel filled with air, spring back and hold a slight indentation from your finger. If it doesn’t, cover again and continue to let them rise, repeating the test every 10 or 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Apply egg wash and bake the buns: Brush the surfaces of the proofed buns generously with the beaten egg and sprinkle the sesame seeds over top. Transfer the pans to the oven, one on each rack. Bake, rotating each pan 180 degrees and top to bottom after 13 minutes, until the buns are puffed and deeply browned, 18 to 22 minutes. Remove from the oven and let cool completely on the baking sheets. Split horizontally with a serrated knife."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022247-hamburger-buns"}