{"@context": "http://schema.org", "@type": "Recipe", "name": "Bacon and Onion Pasta", "description": "Building off of the simple but powerfully flavorful Italian dish pasta aglio, olio e peperoncino​​, this wondrous pantry recipe gets much of its flavor from bacon fat and caramelized onions. The one-two-three punch of spicy red-pepper flakes, aromatic garlic slivers and savory herbes de Provence bloomed in fat provides the umami-rich base for this easy workday meal. Red vermouth creates a rich, jammy pasta sauce edged with sweetness. Don’t sleep on angel hair pasta: It’s got the right airy bounciness that’s excellent at soaking up seasonings. Threaded with parsley and Parmesan, these generously oiled noodles are a dream to eat.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/02/23/dining/EK-bacon-onion-vermouth-pasta-3/merlin_202627683_c598fe54-e410-4db6-a52f-9717173f3ad9-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 863}, "recipeIngredient": ["8 ounces bacon", "2 medium red onions", "1/4 cup extra-virgin olive oil", "Kosher salt and black pepper", "8 garlic cloves", "1 teaspoon red-pepper flakes", "1 teaspoon herbes de Provence", "1 cup sweet red vermouth (vermouth rouge)", "1 pound angel hair or capellini", "1 cup finely chopped fresh parsley", "1/2 cup finely grated Parmesan or Pecorino Romano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the bacon out of its packaging with the slices still stuck together and place on a cutting board. Cut the bacon, still stacked, crosswise into ½-inch slices to create little bacon pieces, also known as lardons. Add to a large rimmed sheet pan. Halve and thinly slice the onions. Add to the sheet pan as well. Drizzle the olive oil over the bacon and onions, season with salt and pepper, and toss until evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the sheet pan in a cold oven and then heat the oven to 450 degrees. Roast until the bacon has rendered much of its fat but is still pink and the onions are slightly charred in spots but not too dark, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a large pot of water to a boil. Smash the garlic cloves with the side of your knife and thinly slice them. When the bacon and onions have had their 20 to 25 minutes, remove the sheet pan from the oven and stir in the garlic, red-pepper flakes, herbes de Provence and vermouth. Place the pan back in the oven and continue cooking until the vermouth is almost evaporated, and the bacon and onions look jammy and caramelized but not burnt, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the pasta according to package instructions. (Don’t overcook it, as angel hair can go from bouncy to soggy in seconds). Reserve 1 cup of the cooking liquid. Drain the pasta and return it to the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully transfer everything from the pan to the pot with the cooked pasta. Add the parsley and Parmesan to the pasta, and toss until evenly combined, adding some of the reserved cooking liquid if the sauce needs thinning out. Taste, adding more salt and pepper as needed, and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022995-bacon-and-onion-pasta"}