{"@context": "http://schema.org", "@type": "Recipe", "name": "Mexican Buñuelos With Piloncillo Syrup", "description": "These buñuelos, which are made by deep-frying dough shaped like a disk, are typically eaten year-round as a street food in Mexico. But buñuelos are most popular around the Christmas season when many people make them on Nochebuena, or Christmas Eve. The ingredients in buñuelos vary depending on the region, but this version is adapted from Mely Martínez, a food blogger and the author of “<a href=\"https://www.amazon.com/Mexican-Home-Kitchen-Traditional-Home-Style/dp/1631066935/\">The Mexican Home Kitchen: Traditional Home-Style Recipes That Capture the Flavors and Memories of Mexico</a>.” The dough is rolled out flat, and though it’s not called for here, can be laid on an inverted bowl covered with a pastry cloth or parchment to stretch it even thinner (similar to when women flattened the dough on their knees) to make a crispy, paper-thin buñuelo. The finished buñuelos are topped with granulated sugar and spiced syrup made with cinnamon, anise, orange zest and piloncillo, a raw form of cane sugar.", "author": {"@type": "Person", "name": "Christina Morales"}, "image": "https://static01.nyt.com/images/2021/12/13/dining/13Bunuelos-Mexican-Flour-a/merlin_198717315_fe09ffb3-7e63-4fb8-9768-6ed9753a3a29-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "12 buñuelos", "recipeCuisine": "mexican", "recipeCategory": "finger foods, pastries, project, dessert", "keywords": "anise, cinnamon, orange, piloncillo, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 106}, "recipeIngredient": ["1 (12-ounce/340 gram) piloncillo cone, chopped into chunks or slivers (see Tip)", "1 cinnamon stick", "6 guavas, fresh, or frozen and thawed, cut into quarters (optional)", "1/4 teaspoon whole anise seeds", "1 (3-inch) strip orange peel ", "2 cups/256 grams all-purpose flour, plus more for dusting", "1 teaspoon baking powder", "1 tablespoon/13 grams granulated sugar, plus more for sprinkling", "1/2 teaspoon table salt", "1 large egg", "1 tablespoon/15 grams unsalted butter, melted and cooled", "1 teaspoon vanilla extract", "Up to 3/4 cup/180 milliliters warm water, as needed", "2 cups/475 milliliters vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the piloncillo syrup: In a medium saucepan, heat 1 cup/240 milliliters water and the piloncillo over medium-high until the piloncillo dissolves, the liquid has thickened slightly and is caramel-colored, about 5 minutes. Carefully add 2 1/2 cups/600 milliliters water to the pan, along with the cinnamon stick, guavas (if using), anise seeds and orange peel. Bring the mixture to a boil over medium-high, then reduce the heat to low and simmer until syrupy, about 30 minutes. If you’d like it thicker, cook for a bit longer. Strain the syrup into a small bowl and set it aside. (You should have about 1 1/4 cups/60 milliliters.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the buñuelos: In a large bowl, combine the flour, baking powder, sugar and salt. Form a well in the center and add the egg, melted butter and vanilla extract. Using a wooden spoon or your hands, stir the ingredients together until the mixture resembles coarse meal. Slowly add the warm water, 1 tablespoon/15 milliliters at a time, constantly mixing then kneading, until the dough is soft and smooth. (You may not need all of the water.) Cover the dough with a clean kitchen towel and let it rest for 30 minutes. On a lightly floured surface, divide the dough into 12 small balls and cover with the kitchen towel. (At this point, you can wrap the balls tightly with plastic wrap and freeze for up to two months. Bring to room temperature before rolling out and frying.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, high-sided skillet, pour the vegetable oil until it’s about 3/4-inch high and heat over medium high to 350 degrees. When the oil is ready, a small piece of dough should sizzle immediately when dropped in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the oil is heating, roll out the dough: Work with one ball at a time, and leave the others covered while you work. On a lightly floured surface with a lightly floured rolling pin, roll out the dough into a paper-thin 8-inch circle. (It should be almost transparent but not tear.)  As you roll, move and flip the dough and add more flour as necessary so it doesn’t stick. Set aside on a lightly floured surface. Repeat with the remaining balls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry the buñuelos, one at a time, until golden brown and crispy, 20 to 40 seconds per side. Use tongs to gently flatten the dough as it cooks to help prevent it from curling. Place the fried buñuelos on a paper towel-lined plate. Immediately sprinkle the buñuelos with granulated sugar, drizzle the syrup and serve. (Store leftovers in an airtight plastic container at room temperature for up to three days. Recrisp in a 300-degree oven for 5 minutes and sprinkle with granulated sugar.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022819-mexican-bunuelos-with-piloncillo-syrup"}