{"@context": "http://schema.org", "@type": "Recipe", "name": "Chung Yul Bang (Scallion Pancakes)", "description": "The cookbook author Grace Young learned to make these scallion pancakes from her mother, who is from Hong Kong, and first published the formula in her book “The Wisdom of the Chinese Kitchen” (Simon & Schuster, 1999). In homage to the Cantonese immigrant experience, Ms. Young phoneticized dish names in the same way they appeared on Cantonese-American restaurant menus and titled this recipe chung yul bang. They have the perfect blend of crispy flakiness and tenderness. The trick is a mix of boiling and cold water: The boiling water gives you a soft, malleable dough that is easy to work, the cold water just the right chewiness in the fried pancake. She prefers these served without any dipping sauce: “Hot out of the wok, they don’t need anything,” she said. “They’re perfect the way they are.”", "author": {"@type": "Person", "name": "Rachel Wharton"}, "image": "https://static01.nyt.com/images/2021/04/21/dining/16doughrex3/merlin_185502165_485fcfac-dc6c-42e7-8029-8eb71be5f679-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 cakes", "recipeCuisine": "chinese", "recipeCategory": "snack, finger foods, pancakes, main course, side dish", "keywords": "scallion, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 402}, "recipeIngredient": ["2 cups/270 grams all-purpose flour, plus more as needed", "3/4 teaspoon granulated sugar", "2/3 cup/160 grams boiling water", "1/4 cup/60 grams cold water, plus more as needed", "2 teaspoons toasted sesame oil", "Kosher salt", "1/3 cup/26 grams finely minced scallions, patted completely dry", "2/3 cup/144 grams vegetable oil, or as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium heatproof bowl, stir together the flour and sugar. Pour in the boiling water, quickly mixing everything together with a wooden spoon until the flour absorbs all the water. It will look a bit dry and flaky. Stir in the cold water. A dough should form and begin to pull away from the side of the bowl. If needed, add more cold water a teaspoon at a time. The dough should not be sticky, but dry to the touch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust a work surface with flour. Remove the dough from the bowl and knead until the dough is smooth and elastic, adding more flour if necessary, 3 to 5 minutes. Lightly cover the dough with a clean damp cloth or plastic bag and let it rest for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Redust the work surface with flour and knead the rested dough for a few minutes, or until it is smooth. Divide the dough into four equal pieces and roll into balls. Cover three of them with the damp cloth or plastic, then use a floured rolling pin to roll the fourth into a 7-inch round. Cover the round with the damp cloth or plastic, then roll out the remaining three pieces, keeping any unused dough well covered while you work."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush each round very lightly with the sesame oil and sprinkle each with 1/4 teaspoon salt and a quarter of the minced scallions. Tightly roll each circle into a fat rope, then tightly coil each rope so that it looks like a snail’s shell, pinching the end of the rope into the bun so that it seals. Cover the rounds with the damp cloth or plastic wrap, and let them rest for 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Redust your work surface with flour and roll each cake out with a floured rolling pin into a 7-inch round. Set aside to fry when the oil is ready. Or, refrigerate in an airtight container dusted with flour for up to 1 day. Let the chilled dough sit at room temperature for a few minutes before frying. You can also stack the rolled dough between parchment paper, wrap tightly in plastic, seal in a resealable plastic freezer bag and freeze for a few weeks. Unwrap and let them come to room temperature, about 15 minutes, before you fry them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a plate or baking sheet with paper towels. Heat the oil in a 14-inch flat-bottomed wok over medium until it is hot but not smoking. Working carefully, as the oil will spatter, add a scallion cake to the bottom of the pan using a metal spatula or tongs, and let it fry until golden brown on the bottom, just a minute or two. Carefully flip the cake over and fry until the other side is golden brown, 30 seconds to 1 minute more. As it fries, adjust the heat to maintain a steady sizzle and lightly press the center of the cake with a metal spatula to make sure the center is cooked through, being careful of oil spatters. Alternatively, heat 1 tablespoon oil in a large skillet over medium-high and pan-fry a round of dough until golden brown and cooked through, about 4 minutes. When the cake is done, transfer it to the paper towels and fry the three remaining cakes, adding 1 tablespoon oil per cake if pan-frying."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the scallion cakes with a little more salt, cut them into 6 to 8 wedges, and serve them immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022083-chung-yul-bang-scallion-pancakes"}