{"@context": "http://schema.org", "@type": "Recipe", "name": "Rhubarb Sauce", "description": "This jewel-bright rhubarb sauce has as many uses as a Swiss Army knife. Glossy and sweet-tart, it tastes fabulous in iced coffee, cocktails and other mixed drinks, and is especially welcome over vanilla ice cream. The optional vanilla bean adds musky warmth that extract does not, so skip it completely — don’t substitute — if not using. With this recipe, you get two goodies: the sauce of course, and the strained fruit that remains, which is great draped over yogurt in the morning or spread onto a slice of buttered toast.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2021/07/12/dining/12SAUCESREX17-sweet-EK-rhubarb-sauce/merlin_190354074_a5d30350-5ac9-4ecf-8317-df496e834cd9-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "1 cup", "recipeCuisine": "", "recipeCategory": "sauces and gravies", "keywords": "lemon, rhubarb, sugar, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 115}, "recipeIngredient": ["1 1/2 pounds rhubarb, trimmed and cut into 3-inch pieces", "1 cup granulated sugar", "1 tablespoon lemon zest, and 2 to 3 tablespoons juice (from 1 large lemon)", "1 vanilla bean, split lengthwise and scraped (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. In a roasting pan or large, shallow Dutch oven, combine the rhubarb, sugar, lemon zest and juice, vanilla bean (if using) and 2 1/2 cups water. Using clean hands, gently move the rhubarb around to disperse the ingredients. Roast until the rhubarb softens, the sugar dissolves and the water is pink, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the pan cool slightly before carefully straining the syrup through a fine-mesh sieve into a large measuring cup or bowl. You should have about 2 1/2 cups rhubarb syrup. Transfer the roasted rhubarb to an airtight container and refrigerate for up to 1 week. Pour the syrup back into the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On the stovetop over high heat, bring the syrup to a boil, immediately reduce the heat to medium-high and continue boiling, stirring with a wooden spoon, until the syrup has reduced by a little more than half, 10 to 12 minutes. Watch carefully so that the hot syrup doesn’t boil over the sides of the pan. (You should have about 1 cup sauce.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the sauce immediately or refrigerate in an airtight container for up to 1 week. This tastes so good over vanilla ice cream, stirred into a glass of iced water for something reminiscent of pink lemonade or iced coffee for a high note, mixed into a pan sauce for duck breasts, or drizzled over any kind of whipped cream, pavlova or Eton mess-style dessert. The strained fruit tastes wonderful over yogurt."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022374-rhubarb-sauce"}