{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Noodles With Egg Drop Gravy ", "description": "This recipe is reminiscent of wat tan hor, a Cantonese, Singaporean and Malaysian meat and fresh rice noodle dish that’s topped with a silky egg gravy. Wat tan means “smooth egg” in Cantonese, describing the velvety gravy that smothers the noodles. In this vegetarian riff, pantry-friendly dry rice noodles are used. The silky texture of the sauce is achieved by adding cornstarch slurry, a common technique in Chinese cooking, followed by beaten eggs, which cook the moment they hit the hot gravy and become long, irregular strands. For extra heartiness, add slices of pan-fried tofu or extra vegetables like broccoli or cauliflower.", "author": {"@type": "Person", "name": "Hetty McKinnon"}, "image": "https://static01.nyt.com/images/2022/02/15/dining/hm-Rice-Noodles-With-Egg-Drop-Gravy/hm-Rice-Noodles-With-Egg-Drop-Gravy--articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, noodles, main course", "keywords": "bok choy, dark soy sauce, egg, rice noodles, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 470}, "recipeIngredient": ["Kosher salt and black pepper", "12 ounces thick dried rice noodles", "3 tablespoons neutral oil, such as grapeseed or canola", "2 tablespoons soy sauce", "1 tablespoon dark soy sauce (see Tip)", "2 cups vegetable stock", "1 teaspoon granulated sugar", "1 tablespoon cornstarch", "2 garlic cloves, finely chopped", "1 (1-inch) piece of ginger, peeled and finely chopped", "1 carrot, peeled and thinly sliced diagonally", "4 heads baby bok choy (about 12 ounces), trimmed and sliced lengthwise into 4 pieces", "2 tablespoons vegetarian stir-fry sauce or oyster sauce", "2 eggs, beaten", "Handful of cilantro leaves (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to the boil. Add noodles and cook according to package instructions, stirring often, until al dente. Drain and rinse under cold water until the noodles are completely cool, shaking off as much water as you can."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, well-seasoned cast-iron skillet (a nonstick pan will work, too, but you won’t necessarily get the same smoky flavor) on medium-high until it is very hot, then add the noodles, 2 tablespoons of oil, 1 tablespoon of soy sauce and the dark soy sauce, and, toss to coat the noodles using tongs or chopsticks. Fry for 3 to 4 minutes, mostly undisturbed, but tossing every minute or so until there is a nice char on some of the noodles. (If your pan is not well-seasoned, the noodles may stick, so toss the noodles after every minute to prevent sticking.) Remove noodles from the pan and set aside. Wipe out the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the vegetable stock, sugar and cornstarch in a small bowl, and stir to combine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the same skillet, add the remaining 1 tablespoon neutral oil along with the garlic and ginger, and stir for 30 seconds until fragrant. Add the carrot, stir-fry for 1 minute just to soften slightly, then add the baby bok choy, stir-fry or oyster sauce, and the remaining 1 tablespoon soy sauce, and toss. Stir the cornstarch and vegetable stock mixture, then pour it into the skillet, and stir until it comes to a boil and thickens, 1 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Very slowly trickle the beaten eggs into the gravy in a circular motion (no need to stir). Cook the eggs until set, 30 to 60 seconds from when you start pouring. Remove from the heat. Taste and season with salt and pepper, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place the noodles in serving bowls, and spoon a generous amount of gravy and vegetables over the noodles. Top with cilantro leaves, if using."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022985-rice-noodles-with-egg-drop-gravy"}