{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Baby Cakes", "description": "Created as a first birthday treat for a little girl, these are a sweet example of something that is simple but memorable. The look is adorable: a cake sized for a baby’s hand, covered in a soft white-chocolate glaze and finished with sprinkles. The taste is primarily vanilla — that’s the extract and white chocolate at play — and there’s a sly hint of rose, added as much for mystery as for bolstering the best qualities of the fresh strawberry that’s tucked into the cake’s middle. But it’s the cake’s texture that’s most confoundingly wonderful. It’s tender and chewy, with a compact crumb still light enough to bring you back for another serving. When it’s not a baby’s birthday, skip the candles and have the cakes with espresso — or even Champagne.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2021/08/08/magazine/08mag-eat/08mag-eat-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "24 mini cakes", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "birthday, cupcake, strawberries, white chocolate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 971}, "recipeIngredient": ["Baker’s spray (optional)", "3 to 6 hulled strawberries, depending on size ", "1/3 cup/67 grams granulated sugar", "1/4 teaspoon fine sea salt", "2 large eggs, at room temperature", "1 1/2 teaspoons pure vanilla extract", "1/4 teaspoon rose extract (optional)", "1 tablespoon light corn syrup ", "2/3 cup/86 grams all-purpose flour", "6 tablespoons/85 grams unsalted butter, melted, still warm", "3 ounces/85 grams white-chocolate bar, melted and fluid", "1 tablespoon milk", "3 ounces/85 grams white chocolate, finely chopped", "1 teaspoon neutral oil", "Sprinkles"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cakes: Center a rack in the oven and heat oven to 400 degrees. Line a 24-hole mini-muffin pan with cupcake papers or use baker’s spray to coat the inside of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "You need 24 chunks of strawberry for the centers of the cakes, so slice the berries into small pieces and set aside. (The chunks should be about 1/4-inch wide and short enough to drop easily into the muffin cups.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in a large bowl, whisk together the sugar and salt. Drop in the eggs and beat with a mixer on medium speed (or continue with a whisk) for about 2 minutes, or until foamy and slightly thickened. Stir in the vanilla extract and the rose extract, if you’re using it, followed by the corn syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Switch to a flexible spatula, and blend in the flour in two or three additions. You’ll have a thick batter. Mix the butter into the batter in three or four additions, stirring gently until well incorporated. The batter will be stretchy and a bit slippery. Pour the melted chocolate over the mixture, stir it in gently and, when it’s fully blended into the batter, stir in the milk. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon about 1 teaspoon of batter into each muffin cup, and then drop in a piece of strawberry. Divide the remaining batter evenly among the cakes, covering each berry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cakes for 11 to 13 minutes, or until a slender tester poked into the center of a cake comes out clean. Transfer the pan to a rack, and let rest for 2 minutes before carefully removing the cakes; cool to room temperature on the rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the topping (optional): In a small microwave-safe bowl, melt together the chocolate and oil in a microwave set to half power, or in a small pan over very low heat. White chocolate is fragile and finicky — it burns quickly — so stay close. Stir the mixture to make sure it’s smooth. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "One by one, dip the tops of the baby cakes into the chocolate, swirling the cakes to even out the topping and allowing the excess to drip back into the bowl or pan. Return the cakes to the rack and, if you’d like, finish with sprinkles. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "You can refrigerate the cakes for about 10 minutes to set the chocolate or leave them at room temperature. Chilled or not, the chocolate will remain a tad soft, and that’s nice. Kept in a covered container, the cakes will hold for a day or two."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022444-strawberry-baby-cakes"}