{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Won Tons With Chile Oil", "description": "Sichuan won tons are typically doused with hot, numbing chile sauce, but this less fiery version, adapted from “Hong Kong: Food City” by Tony Tan, is more like what you’d find at Cantonese restaurants. These delicate won tons are subtly sweet, ginger-scented and filled with a tender combination of pork, egg, stock, soy sauce and Shaoxing rice wine. Eat a couple of the won tons on their own to appreciate their delicate flavor before surrounding them with chile oil sauce, which will inevitably dominate them. Scale the amount of chile oil to suit your tolerance.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2021/04/16/dining/aw-Spicy-Wontons-With-Chile-Oil/merlin_185308362_327bc082-bffc-49d3-ab48-7044e892d91b-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "About 40 won tons", "recipeCuisine": "chinese", "recipeCategory": "dinner, snack, project", "keywords": "ground pork, lunar new year, red chiles, won-ton wrappers", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 410}, "recipeIngredient": ["25 grams dried red chiles, preferably Sichuan or Tianjin chiles (about 3/4 cup)", "1/2 cup neutral oil, such as sunflower, canola or vegetable oil", "1/3 cup well-stirred chile oil, plus more to taste", "1/3 cup light soy sauce", "4 teaspoons toasted white sesame seeds", "4 teaspoons toasted sesame oil", "1 (2-inch) piece fresh ginger, peeled and finely chopped (about 2 tablespoons)", "3 garlic cloves, finely chopped", "2 teaspoons Sichuan peppercorns, lightly crushed", "1/4 teaspoon granulated sugar, plus more to taste", "10 ounces ground pork (at least 20 percent fat)", "1 large egg, beaten", "2 tablespoons finely chopped ginger", "1 tablespoon light soy sauce", "2 teaspoons Shaoxing rice wine", "1/2 teaspoon granulated sugar", "3 tablespoons chicken stock (or water)", "About 40 (3 1/2-inch-wide) square won-ton wrappers (preferably yellow, Hong Kong-style)", "2 scallions, trimmed and thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chile oil: Snip any stems off the chiles and discard any exposed seeds. Heat a wok or large skillet over low. Add 1/2 teaspoon oil and the chiles and cook, stirring constantly, until the chiles are fragrant, toasted and slightly darkened, about 3 minutes. Transfer the chiles immediately to a large plate and let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cooled chiles to a food processor and pulse until coarsely chopped into small pieces. Transfer to a medium heatproof bowl. Add the remaining oil to the wok or skillet and heat over medium-high until shimmering and smoking, then immediately turn off the heat and let cool 3 minutes. Pour the warm oil over the chiles, stir to combine, then let cool 2 hours or up to overnight. (You’ll have a generous 1/2 cup. Chile oil will keep, covered and refrigerated, for up to 2 months.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At least a couple hours before you plan to make the won tons, prepare the chile-oil sauce: In a small bowl, whisk together all the sauce ingredients to combine (makes about 3/4 cup). Add more chile oil to taste. Set aside. (Chile-oil sauce is best prepared at least a few hours in advance, and will keep a few weeks refrigerated in a covered container.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: Put all the ingredients except the chicken stock in a medium bowl and mix well. Add the stock 1 tablespoon at a time, stirring in a circular motion until incorporated before adding the next spoonful."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the won tons: Fill a small bowl with water and line a rimmed baking sheet with parchment paper. Working with one won-ton wrapper at a time, place 1 rounded teaspoon of pork filling in the center of the wrapper. Dip your finger in the water and run it around the edges of the wrapper. Lift and fold one corner over the filling toward the opposite corner over to form a triangle, gently pressing the air out as you seal the edges with your fingertip, then dab one of the lower corners with water and fold over to reach the other lower corner, forming a smaller triangle; pinch both corners to seal. Transfer to the parchment paper, and cover loosely with a damp kitchen towel or a sheet of plastic wrap to prevent drying out. Repeat until all the filling is used."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to the boil over high heat. Working in batches to avoid crowding, cook the won tons until they float to the surface, about 3 to 4 minutes. Remove with a slotted spoon. Divide the won tons among bowls, drizzle with chile-oil sauce and garnish with scallions."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022104-spicy-won-tons-with-chile-oil"}