{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Scallops With Glazed Brussels Sprouts", "description": "The hidden gem in this meal for two is the bacon that starts it all off. It’s crisped in a little olive oil, creating a nice pool of fat to cook both the scallops and the brussels sprouts. When searing scallops, the trick to a great crust and tender insides is to cook them mostly on the first side. A tangy mix of lime juice, maple syrup and Dijon is then splashed in to deglaze the pan, making it easy to scrape up the tasty bits stuck on the bottom. Cold butter is vigorously stirred into the glaze to transform it into a pan sauce. But, draped in that sour-sweet lime butter, it’s the bacon that sings. Serve with a <a href=\"https://cooking.nytimes.com/recipes/1022752-green-salad-with-dill-vinaigrette\">big green salad</a> and crusty bread, or <a href=\"https://cooking.nytimes.com/recipes/11994-cold-cure-soup\">a light, brothy soup</a>.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/02/13/dining/13EAT-seared-scallops-brussels-sprouts1/13EAT-seared-scallops-brussels-sprouts1-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, for two, quick, seafood, main course", "keywords": "bacon, brussels sprouts, sea scallop", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1610}, "recipeIngredient": ["2 tablespoons fresh lime juice", "2 tablespoons maple syrup", "1 teaspoon Dijon mustard", "1/2 teaspoon garlic powder", "Kosher salt (Diamond Crystal) and black pepper", "4 slices bacon, sliced crosswise into thin, short strips", "1 tablespoon olive oil", "8 large sea scallops (10 to 12 ounces), preferably dry-packed", "1/2 pound brussels sprouts, trimmed and halved, larger ones quartered", "3 tablespoons cold unsalted butter", "1 tablespoon chopped chives, for garnish (optional)", "Crusty bread or steamed white rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together the lime juice, maple syrup, mustard, garlic powder and 1/2 teaspoon salt. Season with pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the bacon and olive oil to a large, cold skillet. Turn the heat to medium-high and cook, stirring occasionally, until the bacon is very crispy but not burned, 3 to 4 minutes. Using a slotted spoon, transfer the bacon to a paper towel-lined plate to drain and carefully pour all but 2 tablespoons of the fat in the pan into a heatproof dish or jar. Place the pan back on the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the scallops dry with a cloth or paper towel, and season with salt on all sides. Carefully place each scallop, flat side down, into the hot fat and cook, without touching, until nicely golden brown on the bottom, 2 to 3 minutes. Flip and cook briefly this time until very lightly golden, 30 seconds to 1 minute. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the brussels sprouts to the hot pan, making sure each one is turned cut side down. Season with salt and pepper and cook, still over medium-high and without touching, until brown and slightly charred on that one side, 2 to 3 minutes. Add more bacon fat as needed to keep the pan coated. Now gently shake the pan or stir with a spoon to stir-fry briefly, just a few seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the brussels sprouts are charred on the cut sides and bright green on the rounded sides, transfer them to the plate with the scallops. In the now-empty pan, add the lime juice mixture and cook, stirring constantly, over medium-high heat until it bubbles up and reduces by more than half and a spoon dragged through the pan leaves a naked trail in the lime glaze, 2 to 5 minutes. It should look sticky like melted candy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the heat and return the scallops to the pan, tossing in the butter as well. Stir until the butter is fully melted and incorporated into the lime glaze. This residual heat should also finish heating your scallops. Add back the seared brussels sprouts and bacon and gently toss in the glaze. Garnish with the chives."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve right from the pan if you’d like with a side of crusty bread or bowls of rice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022971-seared-scallops-with-glazed-brussels-sprouts"}