{"@context": "http://schema.org", "@type": "Recipe", "name": "Butterhorns", "description": "Butterhorns fall into two camps: savory or sweet. These are the latter, filled with a tender mince of nuts and topped with an almond-flavored frosting. Sweet butterhorns are a favorite of the in-house bakeries at the Bavarian Inn and Zehnder’s of Frankenmuth, the two big all-you-can-eat chicken dinner restaurants in Frankenmuth, Mich. This recipe comes from Dorothy Zehnder, a founder of the Bavarian Inn. Tucking in the corners of each butterhorn before rolling helps contain the filling during baking.", "author": {"@type": "Person", "name": "Sara Bonisteel"}, "image": "https://static01.nyt.com/images/2021/11/24/dining/22FRANKENMUTH-REX/22FRANKENMUTH-REX-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "36 butterhorns", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 195}, "recipeIngredient": ["4 cups/512 grams all-purpose flour", "1 cup/227 grams cold unsalted butter, cut into cubes, plus more for greasing the pan", "1/4 cup/50 grams granulated sugar", "1/2 teaspoon fine sea salt", "2 tablespoons plus 3/4 teaspoon/20 grams active dry or instant yeast", "1 1/4 cups/284 grams lukewarm whole milk", "4 egg yolks, well beaten", "1 teaspoon almond extract", "1 1/2 cups/320 grams light brown sugar, packed", "1/2 cup/70 grams finely chopped almonds or walnuts", "2 to 3 tablespoons heavy whipping cream", "2 tablespoons/15 grams all-purpose flour", "1/2 teaspoon almond extract", "1 1/2 cups/170 grams confectioners’ sugar", "1 tablespoon/14 grams unsalted butter, melted", "3 to 4 tablespoons heavy whipping cream", "1/4 teaspoon almond extract", "1/2 cup/70 grams finely chopped walnuts or almonds, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Combine flour, butter, sugar and salt in a large mixing bowl. Using a pastry blender or your fingertips, cut butter into flour, until the butter is the size of small peas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, stir the yeast into the lukewarm milk, then add beaten egg yolks and almond extract. Pour yeast mixture into the flour mixture and stir lightly, handling as gently as pie crust, until the shaggy mass comes together in a sticky ball. Cover dough with plastic wrap and let rest in the refrigerator overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: The day you plan to bake the butterhorns, combine the sugar, almonds, 2 tablespoons heavy cream, flour and almond extract in a separate medium bowl. It should resemble a wet sand with bits of nuts. If the filling is dry, add another tablespoon of cream. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the butterhorns: Lightly grease 3 baking sheets. Remove pastry dough from the refrigerator and divide dough into three equal rounds (about 13 ounces/365 grams each). Keep the other rounds refrigerated while you work with one piece. Using a rolling pin, roll the dough into a 16-inch circle on a lightly floured surface. Cut each circle into 12 wedges, like you're cutting a pizza. Place 1 heaping teaspoon of filling just inside the curved edge of the wedge, leaving a 1/2-inch border."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the closest two corners over the filling to avoid leakage, then roll tightly all the way up to the point. (It should look like a little croissant.) Arrange pieces on a greased pan 2 inches apart, 12 butterhorns per pan, making sure that the point is tucked under to prevent it from unrolling while rising. Repeat with the remaining dough rounds. Let horns rise, uncovered, in a warm location until doubled in size, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 30 minutes before you’re ready to bake, heat the oven to 365 degrees and make the frosting: Combine confectioners’ sugar, melted butter, heavy cream and almond extract in a large bowl, and mix until creamy and spreadable. Cover and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake butterhorns for 12 to 15 minutes, until a light brown. Frost while still warm, and sprinkle with chopped nuts. Store in an airtight container for up to 3 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022765-butterhorns"}