{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicories With Pears, Blue Cheese and Secret Anchovy Dressing", "description": "Gently bitter, yet fresh and crunchy, chicories are the perfect canvas on which to create a Thanksgiving salad. With a single anchovy fillet, mustard, vinegar and lemon juice at its base, this light, vibrant dressing is surprisingly refreshing and flavored with a faint rumor of umami that will make you reach — over the stuffing — for seconds. If you don’t have, or don’t like, pears, substitute Fuyu persimmons or a crisp, tart apple variety such as Fuji or Honeycrisp. If you don’t like pecans, use walnuts. If you can’t find Roquefort, use another sheep’s milk blue, such as Oregon Blue or Ewe’s Blue, both of which are American-made in the Roquefort-style.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2021/11/17/dining/15unboringrex1-salad/merlin_197274795_3768c296-7616-4c1c-9ead-4096469182ce-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings, appetizer, side dish", "keywords": "pear, radicchio, roquefort cheese, thanksgiving, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 146}, "recipeIngredient": ["1 small head frisée", "1 head escarole", "1 small head radicchio, such as Castelfranco or Treviso varieties", "1 large anchovy fillet", "1 garlic clove, sliced", "1/4 teaspoon fine sea salt, plus a pinch more", "3/4 teaspoons Dijon mustard", "1 1/2 tablespoons rice vinegar", "1 tablespoon freshly squeezed lemon juice", "1 1/2 teaspoons honey", "2 tablespoons extra-virgin olive oil", "Black pepper", "1 small shallot, finely diced", "3/4 cups pecans", "1 ripe Comice or Bartlett pear", "3 1/2 ounces Roquefort cheese, at room temperature", "Black pepper", "Flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a sharp knife to shave off the dark green tips of the frisée and escarole, then use your hands to tear off any remaining tough outer leaves, saving only the pale green and white, tender hearts for the salad. (Reserve the outer leaves for cooking greens — they’d be great for Thanksgiving stuffing!) Trim the radicchio, tearing off any bruised leaves and cutting off any root or stem."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once trimmed, separate all of the chicories into individual leaves, trimming more as needed to detach inner leaves. Leave the smaller leaves of all of the varieties whole, but tear or cut the larger leaves into generous bite-size pieces. Wash in cold water and dry in a salad spinner, then place in a very large bowl. Cover and refrigerate until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread pecans out in a single layer on a baking sheet and toast 7 to 10 minutes until lightly golden in the center. Allow to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dressing, use a pestle to pound the anchovy and garlic in a mortar with a pinch of salt until the mixture is as smooth as toothpaste (or chop finely, then use the blade of a knife to smear across the cutting board until smooth). Whisk in mustard, vinegar, lemon juice, honey, oil, 1/4 teaspoon salt, a few cracks of pepper and shallot until emulsified. Taste and adjust seasoning: The dressing should be pleasantly bright and tangy, and the anchovy shouldn’t be at all noticeable."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, quarter the pear, remove the core from each piece, and thinly slice. Add to the bowl of chicories. Crumble the pecans into the bowl in large pieces. Drizzle most of the dressing over the salad. Use your hands to toss gently to ensure the leaves are all coated evenly. Taste and add more dressing as needed. Transfer salad to a serving platter if desired, then crumble pecan-size pieces of cheese all throughout the salad, tossing as needed to distribute. Season generously with pepper and a bit of flaky salt. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022708-chicories-with-pears-blue-cheese-and-secret-anchovy-dressing"}