{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheesy Pizza Stuffing", "description": "Imagine Thanksgiving stuffing, but with the red-sauce flavors of cheese pizza. Tomato paste and dried oregano, bloomed in buttery onions, do the heavy lifting in this comforting dish, as does an ivory shower of shredded mozzarella, which melts and gets gooey in spots. Stale bread works best, so dry out the bread the night before you plan to make this, or bake the torn pieces in a 250-degree oven until they’re brittle. You can also assemble the stuffing the night before Thanksgiving; just keep it covered in the refrigerator and bake it the next day while the turkey is resting. Serve this warm, while the cheese is still molten.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2021/11/17/dining/15BEGINNERREX2-STUFFING/15BEGINNERREX2-STUFFING-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "stuffing and dressing, side dish", "keywords": "bread, mozzarella, onion, oregano, tomato paste, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 442}, "recipeIngredient": ["1 (12- to 14-ounce) loaf brioche or challah, torn into bite-size pieces (about 4 cups)", "4 tablespoons unsalted butter, plus more softened butter for greasing dish", "1 large yellow onion, halved and thinly sliced", "Salt and black pepper", "1 teaspoon dried oregano, plus more for topping", "2 tablespoons tomato paste", "1 cup vegetable stock", "1 large egg", "1 cup whole milk", "2 cups shredded low-moisture mozzarella"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The night before serving, spread the bread pieces on a sheet pan and let sit on the counter to dry out. Alternatively, you can bake them at 250 degrees until completely dried out and no longer soft, 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to make the stuffing, transfer the bread to a large bowl. Heat oven to 350 degrees and grease a 9-by-13-inch or 8-by-11-inch baking dish with softened butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the 4 tablespoons butter in a large skillet over medium-high and add the onion. Season with salt and pepper, and cook, stirring occasionally, until translucent and slightly browned at the edges, 5 to 7 minutes. Stir in the oregano and tomato paste and cook until fragrant, about 1 minute. Add the stock and scrape up any browned bits from the bottom of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, beat the egg with a fork, then beat in the milk. Pour the stock mixture and milk mixture over the bread and toss with two spoons until evenly coated. Add 1 cup mozzarella, and toss again until well combined. Let sit until the bread fully absorbs the liquid, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the stuffing and any accumulated liquid to the greased baking dish, spread out evenly and top with the remaining 1 cup mozzarella. (To make ahead, you can stop at this stage, cover the dish and refrigerate for up to 24 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, uncovered, until heated through and the cheese is melted, 15 to 25 minutes. (You may need to add a few minutes to the bake time if the stuffing has been refrigerated.) Sprinkle a pinch of oregano over the top and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022743-cheesy-pizza-stuffing"}