{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom Veggie Patties", "description": "These flavor-packed veggie patties are shaped and served like kotlet, Iranian-style meat patties, and prepared like kookoo, an Iranian dish similar to a frittata. But unlike a frittata, kookoo is more about the vegetable- or herb-based filling than the eggs, of which there are just enough to bind the mixture. This recipe uses finely minced mushrooms that are gently spiced with a touch of turmeric, oregano and fresh parsley. You can serve these patties hot off the stove or at room temperature, with flatbread and accompaniments. For the perfect bite, wrap a patty in a piece of bread with something tangy, like pickled onions and peppers, and something fresh, like lettuce leaves or fresh herbs.\n \nTo get vegetarian recipes like this one delivered to your inbox, <a href=\"https://www.nytimes.com/newsletters/the-veggie\">sign up for The Veggie newsletter</a>.", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2022/01/28/dining/nd-mushroom-veggie-patties/merlin_201013923_3ccb979c-8f55-48a9-b7ea-6c2c96088d25-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 16 patties", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, weeknight, vegetables, main course, side dish", "keywords": "garlic, mushroom, parsley, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 364}, "recipeIngredient": ["1 pound button or cremini mushrooms (or a mixture), wiped clean and halved", "1/2 cup finely chopped parsley", "3 garlic cloves, finely grated", "2 teaspoons kosher salt (Diamond Crystal)", "1/2 teaspoon ground turmeric", "1/2 teaspoon dried oregano, crushed between your fingers", "1/2 teaspoon black pepper", "1/2 cup plus 1 tablespoon all-purpose flour", "3 large eggs", "1/3 cup extra-virgin olive oil, plus more if needed", "Pickled red onion and hot peppers, pickles, lettuce, parsley, bread, mayonnaise, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a sheet pan with paper towels and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the mushroom caps and stems in the bowl of a food processor and process, scraping down the sides, until the mushrooms are finely minced into something of a paste, almost resembling ground meat. (You can also mince as finely as possible with a knife.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the minced mushrooms to a large bowl. Add the parsley, garlic, salt, turmeric, oregano and pepper, and stir to combine. Add the flour and stir to combine. Beat in the eggs one at a time, stirring until the eggs are well combined and the batter has the consistency of loose yogurt. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pan with a lid, heat the oil over medium-high. Reduce the heat to medium, and dip two spoons in the hot oil so they're slightly greased up. Using the spoons, drop two tablespoons of batter into the oil to make one patty. With the back of a spoon, even out and shape the patty into an oval as best as you can. Repeat with as many patties as you have room for in the pan. Cover and cook the patties on one side until you see the edges setting and crisping up, about 5 minutes. (You should hear sizzling sounds.) Very carefully lift the lid so you don’t get splattered, and use a spatula and spoon to flip the patties. Cover and cook until the other side is golden brown and the patties are cooked through, about 5 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to the prepared sheet pan and repeat with any remaining batter, adding more oil if needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the mushroom patties hot or at room temperature with trimmings."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022942-mushroom-veggie-patties"}