{"@context": "http://schema.org", "@type": "Recipe", "name": "Tofu-Vegetable Satay With Peanut Sauce", "description": "Caramelized pineapple, tofu and vegetables take center stage in these vegan satay, which are inspired by Indonesian charcoal-grilled skewers. Here, the smoky satay are glazed with sweet and sticky kecap manis, a fermented sweet soy sauce (see Tip), which also flavors the peanut sauce along with garlic, shallots and chile. The sauce is meant to be generously poured over the satay to serve, but any leftovers will last for one week in the refrigerator. The sauce thickens over time, so loosen it with extra water as needed. Serve the satay and peanut sauce with steamed rice or noodles, and a side of stir-fried greens or roast potatoes.\n \nTo get vegetarian recipes like this one delivered to your inbox, <a href=\"https://www.nytimes.com/newsletters/the-veggie\">sign up for The Veggie newsletter</a>.", "author": {"@type": "Person", "name": "Lara Lee"}, "image": "https://static01.nyt.com/images/2021/09/29/dining/ll-vegetable-satay/merlin_194651904_5a6b518a-cdc5-4bfa-9941-3de69fc9c487-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "24 skewers (4 to 6 servings)", "recipeCuisine": "", "recipeCategory": "vegetables, appetizer, main course", "keywords": "kecap manis, pineapple, scallion, tofu, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 581}, "recipeIngredient": ["1 (14-ounce) package firm tofu, drained", "5 large scallions", "1 large eggplant (about 1 pound), cut into 1-inch cubes", "1/2 large (4-pound) pineapple, peeled, cored and cut into 1-inch cubes", "1 large red bell pepper, cut into 1-inch pieces", "24 (8-inch) bamboo skewers, soaked overnight (or at least 30 minutes)", "1/4 cup neutral oil, such as canola", "3 tablespoons neutral oil, such as canola", "2 medium shallots, peeled and sliced", "4 long, red, medium-spicy chiles (such as serrano, cayenne or finger chiles), sliced and seeds removed, if you prefer less heat", "6 garlic cloves, peeled and sliced", "2/3 cup/150 grams crunchy peanut butter, natural or conventional", "10 tablespoons kecap manis (see Tip)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the satay: Place the tofu in a folded dish towel and gently press to remove excess liquid. Cut tofu into 1-inch cubes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the thicker white and light green stalks of the scallions into 1-inch pieces. Thinly slice the thinner, dark green scallion stalks on the diagonal and reserve for the garnish. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the peanut sauce: Heat 1 tablespoon oil in a large skillet over medium-high. Add shallots, chiles and garlic, and cook, stirring occasionally, until softened, 4 to 5 minutes. Transfer to a food processor or blender. Add the peanut butter, 5 tablespoons kecap manis and ⅓ cup plus 1 tablespoon water, and blend until almost smooth. (It makes about 1 ½ cups.) Transfer sauce to a small bowl. (If the sauce thickens, add more water by the tablespoon until it is pourable.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the satay: Place a cube of eggplant onto a bamboo skewer, followed by a piece of pineapple, bell pepper, scallion, tofu and another piece of eggplant. Repeat with the remaining skewers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the grill or a griddle pan over high. Use a pastry brush to dab the 1/4 cup oil all over the skewers. Once hot, line the skewers on the grill or griddle pan, working in batches as needed. Cook for 10 to 12 minutes, turning every 2 to 3 minutes with a metal spatula or tongs, until the eggplant is cooked through. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the glaze: Mix 4 tablespoons kecap manis with the remaining 2 tablespoons oil. Brush the glaze all over the skewers. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pool about 1 cup peanut sauce onto a large serving plate, spreading it close to the edges of the plate. Lay the cooked skewers on top, then spoon the remaining peanut sauce on top. Drizzle lightly with 1 tablespoon of kecap manis, and garnish with the sliced scallions. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022599-tofu-vegetable-satay-with-peanut-sauce"}