{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Chicken and Farro With Caramelized Leeks", "description": "This very savory skillet dinner features golden pieces of bone-in chicken nestled in a leek and farro pilaf. You might be surprised to see the leek greens used along with the whites. But, because the slices are sautéed until tender and then simmered with the farro, they turn soft and sweet, and contribute loads of deep onion flavor. (Added bonus: It’s nice to use the whole vegetable.) A simple tomato relish garnishes the top, adding juicy freshness to this hearty one-pot meal.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/05/19/dining/17alliumrex3-chicken/17alliumrex3-chicken-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "weekday, poultry, main course", "keywords": "chicken, farro, leeks, parsley, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 900}, "recipeIngredient": ["2 1/2 pounds bone-in, skin-on chicken thighs and drumsticks, or use whole legs", "Salt and freshly ground black pepper", "2 large or 3 medium leeks", "2 tablespoons extra-virgin olive oil", "2 garlic cloves, thinly sliced", "1 teaspoon fennel or coriander seeds, cracked with a mortar and pestle or the side of a chef’s knife", "1 teaspoon cumin seeds, cracked with a mortar and pestle or the side of a chef’s knife", "4 thyme sprigs", "1 tablespoon tomato paste", "3 cups chicken or vegetable stock", "1 1/2 cups pearled or semi-pearled farro", "3/4 cup quartered or halved cherry tomatoes or diced tomato", "1/2 cup fresh parsley leaves and tender stems, roughly chopped", "Fresh lime or lemon juice, or cider vinegar, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat chicken dry with paper towels. Season all over with salt and pepper, and set aside while preparing the leeks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim roots from leeks, then cut away any wilted, yellowing or browned parts from the greens. Slice leeks in half lengthwise. Wash well under cold running water to remove any soil, then shake dry. Thinly slice the leeks (including the greens) into half-moons. You should have about 6 cups. Measure out about 2 tablespoons of sliced leek whites and set them aside for garnish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat 1 tablespoon oil over medium-high heat. When the oil thins and coats the bottom of the pan, add half the chicken and cook until browned on both sides, 4 to 6 minutes per side. Transfer the chicken to a plate and repeat with remaining chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 1 tablespoon oil to the skillet and stir in the leeks and a pinch of salt. Sauté until tender and golden brown, 10 to 13 minutes. Add the garlic and cook until golden, 2 to 3 minutes. Stir in spices, thyme and tomato paste, and cook until tomato paste darkens and caramelizes, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in chicken stock and bring to a simmer, scraping up the browned bits on the bottom of the pan. Stir in farro and 1 teaspoon salt. When the liquid comes to a simmer, reduce the heat to medium-low and nestle in the browned chicken, skin-side up; pour in any juices from the plate. Cover pan and let cook until the farro is tender and the chicken is cooked through, 25 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, toss together the reserved leek whites, chopped tomatoes and parsley. Season to taste with salt, pepper and an acid like lemon or lime juice or vinegar. The mixture should taste tangy and bright."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard the thyme sprigs, and serve chicken and farro topped with some of the tomato mixture."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022210-skillet-chicken-and-farro-with-caramelized-leeks"}