{"@context": "http://schema.org", "@type": "Recipe", "name": "Tahini-Parmesan Pasta Salad", "description": "Many traditional pasta salad recipes call for a heavy mayonnaise-based dressing, but this one combines tahini and Parmesan for a lighter, umami-packed dressing that can be used on noodles, salad greens, asparagus, grilled chicken or grains. Tahini and Parmesan may be a surprising duo, but they naturally work well together because tahini, which is made from sesame seeds, amplifies the cheese’s rich, nutty flavor. To add even more complexity, cherry tomatoes are blistered in a skillet to concentrate their sweetness and acidity. As with any good pasta salad, this one benefits from adding fresh scallions and mint right before serving, plus toasted sesame seeds and shards of Parmesan.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2021/05/17/dining/as-tahini-pasta-salad/as-tahini-pasta-salad-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, weekday, weeknight, main course, side dish", "keywords": "cherry tomatoes, grape tomato, parmesan, pasta, pasta salad, tahini, spring, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1970}, "recipeIngredient": ["Kosher salt and black pepper", "1 pound ridged or curly pasta, such as fusilli or gemelli", "2 tablespoons extra-virgin olive oil, plus more for serving", "2 pints cherry or grape tomatoes (about 1 1/4 pounds)", "1/3 cup tahini", "3/4 cup finely grated Parmesan, plus 1/4 cup chopped or shaved", "1/2 cup packed mint leaves, torn if large", "3 scallions, thinly sliced", "2 tablespoons toasted sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. When the water’s boiling, add the pasta and cook according to package directions. Reserve 1 cup of pasta water, then drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large skillet, heat the olive oil over medium-high. Add the tomatoes, season with salt, and cook, shaking occasionally, until charred and wrinkly, 4 to 6 minutes. Transfer to a large bowl to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a liquid measuring cup, stir together the tahini and grated Parmesan; season with salt and pepper. (Mixture will be thick.) When the pasta is drained, add 1/2 cup pasta water to the dressing and stir until smooth. Add the pasta to the bowl with the tomatoes, then stir in enough dressing to coat. (You won’t use all of it just yet.) Let cool for 15 minutes or up to 3 hours at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to eat, stir the rest of the dressing into the pasta. Stir in water (reserved pasta water or tap) as needed until the pasta is glossy and creamy. Stir in the mint, scallions, sesame seeds and chopped Parmesan, reserving a little for garnish if desired. Season to taste with salt, pepper and a drizzle of olive oil."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022244-tahini-parmesan-pasta-salad"}