{"@context": "http://schema.org", "@type": "Recipe", "name": "Hindbaersnitter (Danish Raspberry Slices)", "description": "Glazed and dotted with sprinkles, this Danish treat sandwiches raspberry jam between two buttery cookie layers — and has Pop-Tarts vibes. Popular in bakeries across Denmark, it’s achievable at home because it’s assembled in one large piece. For this recipe from “ScandiKitchen: Fika and Hygge” by Brontë Aurell, the author recommends a not-too-thick layer of good-quality jam: “Go for intense flavor instead of volume.” Traditionally, these cookies are made with raspberry jam and cut into squares, but they invite experimentation. Slice them into rectangles or triangles; opt for other bright, tangy preserves; and decorate them liberally, adding color to the icing and sprinkling with chopped freeze-dried fruit, crystallized ginger or toasted nuts. Their nostalgic charm will still shine through.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2021/06/11/dining/aw-raspberry-slices1/aw-raspberry-slices-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "About 12 to 15 cookies", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "bar cookie, christmas cookie, danish, make-ahead, raspberries, raspberry jam, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 802}, "recipeIngredient": ["14 tablespoons/200 grams cold unsalted butter, cut into small cubes", "2 1/2 cups/350 grams all-purpose flour", "1 packed cup/125 grams confectioners’ sugar", "1/2 teaspoon fine sea salt", "1 large egg", "1 1/2 teaspoons vanilla extract", "1/2 cup/200 grams raspberry jam, jelly or preserves", "2 cups/250 grams confectioners’ sugar", "2 tablespoons hot water, plus more as needed", "Finely chopped or crushed dried raspberries, or sprinkles, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: In a medium bowl, toss together the butter and flour. Using a pastry cutter (or your fingertips), rub the butter bits into the flour until the mixture resembles cauliflower rice. Stir in the confectioners’ sugar and salt. (The mixture will look like very finely crumbled Parmesan at this point.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the egg and vanilla extract. Stir into the dough — or use a pastry cutter to integrate it — just until the mixture is smooth. (It may look like the mixture needs more liquid, but the butter and egg should suffice.) Take your hands and squeeze the dough a few times just until it comes together and appears fully hydrated (no dry white spots). Wrap the dough tightly in plastic wrap and refrigerate for at least 30 minutes (or overnight) before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Divide the chilled dough into two equal portions (each about 350 grams). Cut parchment paper to line two large baking sheets, plus a third piece of similar size to help roll out the dough. Working on one sheet of parchment at a time, roll out each portion of dough, sandwiching it between the extra sheet of parchment for ease, until roughly 10 inches wide, 12 inches long and a scant ¼-inch thick. (Expanding the dough uniformly requires even pressure applied to your rolling pin. If your dough is expanding in the wrong direction, trim outside portions and move the trimmed portion to a more desired central position, “gluing” it in place with your fingertips.) Prick each slab of dough all over with a fork to prevent it from puffing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the parchment paper to lift the dough, transfer each slab to a large baking sheet. Bake both until lightly golden, about 15 to 20 minutes. Transfer baking sheets to wire racks to cool, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the cookies have cooled, spread one of them with the jam until evenly coated. Carefully set the other crust on top, pressing gently to adhere."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the frosting: In a medium bowl, combine the confectioners’ sugar with 2 tablespoons hot water, and whisk to combine. The mixture should be as thick as loose honey; add more hot water by the teaspoonful if needed to achieve the desired consistency. Drizzle on top of the pastry, spreading all the way to the edges in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle immediately with dried raspberries or sprinkles. (The frosting can firm up fairly quickly, so you’ll want to garnish it while the toppings can still stick.) Let sit until the frosting firms up, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife, trim the edges of the pastry to form clean lines. (Reserve those to snack on.) Cut into squares or rectangles, in any size you fancy. Raspberry slices will keep a few days, covered, at room temperature — or in the refrigerator, if the weather is balmy (though they are best enjoyed at room temperature). If layering them for storage, separate each layer with parchment or wax paper to protect the frosting."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022308-hindbaersnitter-danish-raspberry-slices"}