{"@context": "http://schema.org", "@type": "Recipe", "name": "Tofu Larb", "description": "Larb, a ground meat dish seasoned with fresh herbs, originated in Laos, but it’s also popular in the Northeastern and Northern regions of Thailand. This vegan version requires minimal cooking and features crumbled extra-firm tofu, which soaks up the spicy, citrusy sauce like a sponge. Toasted ground rice is a traditional addition that adds a lovely aroma and nuttiness while thickening the sauce. Makrut lime leaves and crispy fried shallots can be found at Asian grocery stores, at some larger supermarket chains, or online, but both can be omitted. Crispy shallots bring a bit of crunch on top, but chopped, roasted peanuts would also work. Eat it with lettuce leaves for a light meal, or if you’re looking for something more substantial, serve it with sticky or regular rice. For those who are looking for even more spice, top with sliced fresh chiles.\n \nTo get vegetarian recipes like this one delivered to your inbox, sign up for <a href=\"https://www.nytimes.com/newsletters/the-veggie\">The Veggie</a> newsletter.", "author": {"@type": "Person", "name": "Hetty McKinnon"}, "image": "https://static01.nyt.com/images/2021/08/11/dining/11Veggie-tofu-larb-a/merlin_188546805_b6a2a32b-5635-46e5-82b6-b11b7ed5ac3f-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, lunch, quick, weekday, weeknight, beans, main course", "keywords": "butter lettuce, extra-firm tofu, jasmine rice, lemongrass, shallot, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1236}, "recipeIngredient": ["3 tablespoons uncooked glutinous (sticky) or jasmine rice", "2 (14-ounce) packages extra-firm tofu, drained and patted dry", "1 tablespoon neutral oil, such as grapeseed or vegetable", "1 lemongrass stem, outer layer removed, tender stem finely chopped", "1 shallot, halved and thinly sliced", "4 makrut lime leaves (optional), thinly sliced", "1 cup mixed soft herbs, such as mint, Thai basil, basil, cilantro and chopped scallions", "1 teaspoon kosher salt, plus more as needed", "1 head butter lettuce, leaves separated", "1/4 cup store-bought crispy fried shallots or onions", "4 tablespoons fresh lime juice (from about 2 limes)", "3 tablespoons dark or light brown sugar", "2 tablespoons soy sauce", "1/2 teaspoon red-pepper flakes or 1/2 to 1 red chile, such as bird’s eye, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the toasted rice powder: Heat a medium (10-inch) skillet over medium-high. Add the rice and stir constantly for 4 to 6 minutes until golden, with a nutty aroma. Transfer rice to a mortar and pestle or spice grinder and grind until it is a coarse powder. (You don’t want it too fine; some texture is nice.) You should have about 3 1/2 tablespoons. Set rice powder aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: In a small bowl, combine the lime juice, brown sugar, soy sauce and red-pepper flakes; whisk until the sugar is dissolved."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crumble the tofu into small chunks and place in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the medium skillet over medium-high and add 1 tablespoon oil. Add the lemongrass and shallot and cook, stirring constantly, until softened and aromatic, about 2 minutes. Remove from heat and add to the tofu, along with the lime dressing, rice powder, makrut lime leaves, herbs and salt. Taste and add more salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon the tofu larb into the lettuce leaves and garnish with crispy fried shallots."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022299-tofu-larb"}