{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey Potpie", "description": "No one knows when people started making pies, but they were common in medieval Middle Eastern and European cooking. “The Oxford Companion to Food” speculates that the English word may come from the word “magpie,” because magpies collect random items in the way a pie often houses varied ingredients. It’s appropriate, then, that this pie is here to accommodate your Thanksgiving leftovers: turkey, of course, but also leftover roasted squash or sautéed mushrooms in place of peas, chop up half a rutabaga instead of carrot and celery, or a stray leek or shallot instead of onion. Any fresh soft herbs can go in the biscuit topping. For an even simpler version, use canned biscuits arranged on top of the filling as the crust, or defrosted puff pastry with a vent cut in the middle. For a more assertive flavor, use the larger amount of mustard.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2021/11/15/dining/sd-turkey-pot-pie/merlin_196956828_3c1aa39f-6e00-4830-a8a5-8c66c238891c-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, main course", "keywords": "celery, peas, potpie, thanksgiving leftover, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 608}, "recipeIngredient": ["2 cups all-purpose flour", "1 tablespoon baking powder", "1 teaspoon kosher salt (Diamond Crystal)", "8 tablespoons cold unsalted butter, cut into small chunks", "1/4 cup thinly sliced chives", "1/4 cup chopped, lightly packed fresh soft herbs, such as parsley, dill or tarragon", "3/4 cup buttermilk", "5 tablespoons unsalted butter", "1 small red or yellow onion, chopped", "Kosher salt (Diamond Crystal)", "6 garlic cloves, chopped", "1 small or medium carrot, peeled and chopped", "2 celery ribs, including leaves, chopped", "1/4 cup all-purpose flour", "1 teaspoon onion powder", "2 cups chicken or turkey broth or stock", "2 teaspoons to 1 tablespoon Dijon mustard", "1 teaspoon Worcestershire sauce", "Juice of ½ lemon (about 1 generous tablespoon)", "1 1/2 cups chopped or shredded cooked turkey or chicken", "3/4 cup frozen peas", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the biscuit dough: In a large bowl, combine the flour, baking powder and salt. Add the cold chunks of butter and toss to coat. Using your fingers, pinch, smear and squeeze the butter into the flour until the butter pieces are the size of a penny or the size of a pea. There’s no need for perfection, but the butter should be evenly distributed throughout the flour, and each butter bit should be coated in flour. Stir in the chives and herbs. Pour the buttermilk into the mixture and mix it briefly and gently with a fork, just until a shaggy dough forms. Cover and put the dough in the refrigerator while you make the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Heat the oven to 400 degrees. In an oven-safe 10-inch skillet, melt the butter over medium-high heat. Add the onion, season lightly with salt, and cook, stirring occasionally, until translucent and shrunken, 6 to 8 minutes. Add the garlic, carrot and celery, and cook, stirring, until fragrant and slightly softened, about 3 minutes. Add the flour and the onion powder, and cook, stirring constantly, until the flour is completely incorporated with the vegetables, about 1 minute. Whisk in the chicken broth, mustard, Worcestershire and lemon juice, and cook, whisking, until the mixture comes to a bubble. Let it cook, whisking once or twice, until it thickens to lightly coat the back of a spoon, about 2 minutes. Stir in the turkey and the peas. Season generously with black pepper; taste and season with additional salt if desired. Remove pan from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Evenly scatter the biscuit dough over the top of the filling, in golfball-size clumps. (Don’t press or roll the dough into neat balls, which can make the biscuits tough.) Put the skillet on a foil-lined sheet pan to catch any drips and bake in the oven until the filling is bubbling and the biscuits are lightly browned, 35 minutes. (If using canned biscuits or puff pastry, the cook time will be closer to 25 minutes. Check the package directions for a guide.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022740-turkey-potpie"}