{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Citrus Skirt Steak", "description": "You don’t need a meat thermometer to grill a great skirt steak: When cooked over high heat, the inside will be medium rare once the steak is bronzed on the outside. For seasoning, counter the cut’s big buttery flavor with something salty, spicy or fresh. In this recipe, the grilled steak rests in a tart sauce of tangerine, soy sauce, ginger and vinegar that is reminiscent of ponzu, with hints of citrusy bitterness similar to the dried tangerine peel used in Sichuan and Hunan cooking. Here, that bittersweet edge comes from charring the fruit and peel. Serve with rice or a grilled green vegetable like Chinese broccoli or asparagus.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2021/06/24/dining/28grillingrex4/merlin_189645735_fb6d94a3-9dda-4438-9ce2-9763c68b41c7-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, meat, main course", "keywords": "ginger, oranges, soy sauce, steak", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 854}, "recipeIngredient": ["1 1/2 pounds skirt steak (see Tips)", "8 tangerines, satsumas or mandarin oranges, washed and halved horizontally", "6 tablespoons unseasoned rice wine vinegar", "6 tablespoons low-sodium soy sauce", "1 tablespoon sambal oelek or Sriracha, plus more as needed", "1 (1-inch) piece ginger, peeled and finely grated (about 1 tablespoon)", "1 garlic clove, finely grated", "Kosher salt and black pepper", "Neutral oil, such as grapeseed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a charcoal or gas grill for two-zone cooking over high heat: For a charcoal grill, pour the coals onto one half of the grill. For a gas grill, heat all the burners, then turn off one of the end burners. (See Tips.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the grill is heating, pat the steak dry and cut into 5- to 6-inch pieces with the grain. (This makes it easier to fit on the grill.) Set aside to air-dry while you make the sauce: Squeeze 1 cup of juice from about 6 tangerines into a bowl or rimmed dish large enough to hold the steak after it’s grilled. (Set aside the remaining unjuiced halves on a sheet pan.) Add the spent tangerine halves to the juice. Smash the halves with a spoon to release the rind’s oils (as if you’re muddling a cocktail). To the juice and spent tangerine halves, add the rice vinegar, soy sauce, sambal oelek, ginger and garlic, and season with salt and pepper. Stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you're ready to grill, add the steak to the sheet pan of unjuiced tangerine halves and lightly coat everything with neutral oil. Season generously with salt. Bring the sheet pan of tangerine halves and steak, sauce, a tightly folded paper towel soaked with oil, and tongs to the grill. Clean the grates with a grill brush, then oil the grates with the paper towel. Grill the steak over direct heat, flipping halfway through, until well browned, 2 to 3 minutes per side. Grill the tangerines over direct heat, flipping halfway through, until blackened, 4 to 5 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the steak and tangerine halves finish, add them to the sauce and turn to coat. Squeeze the charred citrus with your tongs to release the juice and the peels into the dish. Let rest for at least 5 minutes and up to 30. Slice the steak against the grain and serve with the sauce. Season to taste with salt, pepper and sambal oelek."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022337-spicy-citrus-skirt-steak"}