{"@context": "http://schema.org", "@type": "Recipe", "name": "Raisin Cinnamon Roll Wreath", "description": "Perfume the house and decorate the table with this whimsical wreath made of buttery, sweet cinnamon rolls. Arranging the rolls into a ring makes it easy to tear away individual servings. The extra protein in bread flour yields a sturdier dough that’s easier to shape, but all-purpose flour works too. If you assemble these a day ahead and refrigerate them overnight before baking them the next morning, be sure to let the rolls rise three-quarters of the way before placing them in the fridge. A few hours before baking, allow them to come to room temperature on the counter. Have fun, and complete the wreath decoration with dehydrated orange wheels, cinnamon sticks, sugar-dusted cranberries or even a red ribbon bow.", "author": {"@type": "Person", "name": "Jerrelle Guy"}, "image": "https://static01.nyt.com/images/2021/12/15/dining/13BREAKFASTREX3/merlin_198975474_e26cad40-6d27-4533-b4ff-421afe86ae82-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "About 2 dozen rolls", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, main course", "keywords": "christmas, new year’s day, cream cheese, ground cinnamon, raisins", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 225}, "recipeIngredient": ["4 cups/540 grams bread flour or all-purpose flour, plus more for dusting", "1/4 cup/50 grams granulated sugar", "4 1/2 teaspoons/14 grams instant (fast-acting) yeast (2 packets)", "1 teaspoon coarse kosher salt", "6 tablespoons/78 grams unsalted butter, plus more for greasing", "2/3 cup/171 grams whole milk", "2 large eggs, at room temperature, beaten", "3 cups/480 grams dark raisins", "2 teaspoons almond extract", "2/3 cup/70 grams finely ground almond meal or flour", "2/3 cup/150 grams packed light brown sugar", "2 tablespoons ground cinnamon", "1/2 teaspoon coarse kosher salt", "8 tablespoons/114 grams unsalted butter, softened", "2 tablespoons whole milk", "1 tablespoon granulated sugar", "4 ounces/115 grams cream cheese, softened", "2 tablespoons unsalted butter, softened", "1/2 cup/60 grams confectioners’ sugar", "1 teaspoon pure vanilla extract", "3 tablespoons whole milk, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: In the bowl of a stand mixer fitted with the dough hook attachment, combine the flour, granulated sugar, yeast and salt. Toss with your hands to mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, melt the butter over medium heat. Once it’s melted, add the milk and remove from the heat. The mixture should register 125 to 130 degrees on an instant-read thermometer, so let it cool or warm it as needed. It should feel warm to the touch, but not be hot. Pour the warmed milk mixture into the flour mixture, along with the beaten eggs. Turn the mixer to medium-low speed, and knead until the flour has been fully incorporated and you're left with a smooth, supple dough that's firm to the touch, about 5 minutes. (When you press it with your thumb, the dough should spring back gradually.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gather the dough and shape it into a round ball in your hands, then transfer to a large, lightly buttered bowl, turning over a couple times to coat with the butter. Cover the bowl tightly with plastic wrap or a damp kitchen towel and let rise in a warm place until doubled in size, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the dough is rising, prepare the filling: Place the raisins in a large heatproof bowl and cover with boiling water. Allow to sit for 10 minutes to plump, then drain, and return to the bowl. Add the almond extract and toss with a spoon to coat. Set aside to cool, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium bowl, combine the almond flour, brown sugar, cinnamon and salt mixing with a fork or your hands to remove any clumps. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill and assemble the dough: Lightly flour a clean working surface, and a large baking sheet lined with parchment paper nearby. Cut the risen dough in half with a pair of kitchen shears. Place one half of the dough on the floured surface, keeping the other half covered in the bowl. Lightly flour a rolling pin and roll the dough out to a 12-by-9-inch rectangle (about 1/4 inch thick), picking up the dough to stretch and turn it with your hands to make the edges as straight and even as possible. Spread 4 tablespoons of butter evenly over the entire surface using the back of a spoon. Evenly sprinkle over half the almond mixture, spreading with your hands to cover every inch. Firmly pat the mixture down to help it adhere to the butter. Evenly sprinkle over half of the raisins, pressing down firmly to help keep them in place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Starting with one of the longer edges, tightly roll the dough into a log ending with the seam side down on the counter pressing the log down firmly to help seal the seam closed. The log will feel very stuffed. Wipe down and re-flour the work surface, then repeat with the other half of the dough and the remaining 4 tablespoons butter, almond mixture and raisins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully transfer the two rolled logs, seam side down, to the lined sheet pan and arrange together to form an oval or circle with their ends barely touching. Using kitchen shears with the point of the shears facing down toward the counter, cut slits into the ring roughly 1 inch apart, being careful not to cut all the way through the ring by leaving a 1/2 inch dough still attached at the bottom. One by one, lean every other rolled piece outward away from the center of the ring, creating a staggered look. Make any final adjustments to the shape that you like, turning some rolls up slightly to create air between them and filling out the baking sheet, being sure to keep a rough circular or oval shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Loosely cover the entire pan with plastic wrap and allow it to rest on the counter until slightly puffed, 30 to 40 minutes. (At this point, you can refrigerate the dough overnight: Wrap the entire pan of slightly proofed rolls very well in plastic wrap, being sure not to squish the rolls, but ensuring the wrapping is airtight. Chill for up to 12 hours. Remove the pan from the fridge and place them on the counter for an hour or so before you’re ready to bake them, so they come to room temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. In a small bowl, stir the milk and the granulated sugar with a spoon until the sugar dissolves. Uncover the risen rolls. Using a pastry brush, brush the tops of the rolls with the milk wash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 25 to 30 minutes, rotating the pan halfway through, until the wreath is deeply golden brown on top and the edges of the rolls are puffed and cooked through. Remove the rolls from the oven and place the sheet pan on a cooling rack, and allow to cool for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the rolls are almost done cooling, make the icing: In a medium bowl, using a fork, mix the cream cheese and butter. Add the confectioners’ sugar and mix until smooth and most of the clumps of sugar are gone. Add the vanilla and milk and mix. The icing should be thin enough to drizzle. If it isn’t, mix in another tablespoon of milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With your serving platter nearby, carefully lift the wreath using the parchment and lower onto the platter with the paper. Tear the parchment down the center and along the edges, then carefully pull out the paper without disturbing the wreath. Decorate the finished wreath with the icing: Drizzle it over the top with a fork or transfer to a piping bag with a small tip or a resealable plastic bag with a corner cut open to pipe thin lines along the tops of the rolls. Or smear the icing all over the tops of the rolls using a butter knife. Decorate with a ribbon, or dried or sugared fruit. Serve warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022815-raisin-cinnamon-roll-wreath"}