{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry and Cream Layer Cake", "description": "This delicate cake is inspired by fraisier, a French cake made from layers of sponge, strawberries and cream. Fraisier cakes are elaborately constructed and typically combine several components to make the cream filling, but this strawberry cake is lighter, looser and much more casual. To avoid squishing the cake when slicing, use a serrated knife in long, even strokes to cut clean slices. (Watch Claire <a href=\"https://www.youtube.com/watch?v=N4nvGZTC9RE\">make this cake and two others</a> on YouTube.)", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2021/05/27/dining/cs-strawberry-and-cream-layer-cake/merlin_188069463_60925639-dedc-4df7-959b-659a86fce390-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "dessert", "keywords": "crème fraîche, heavy cream, layer cake, strawberry, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1830}, "recipeIngredient": ["1 1/2 pounds fresh strawberries, hulled", "1/2 cup/100 grams granulated sugar", "1 cup/240 grams heavy cream, chilled", "1 cup/240 grams crème fraîche, mascarpone or sour cream, chilled", "Pinch of kosher salt", "1 <a href=\"https://cooking.nytimes.com/recipes/1022270-sponge-cake\">Sponge Cake</a> recipe, baked in a 9-inch springform pan and cooled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a small saucepan with about 1 inch of water and set over medium heat until the water steams."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, coarsely chop about a quarter of the strawberries and combine in a medium heatproof bowl with the sugar. Cover the bowl tightly and set it over the saucepan. Reduce the heat if necessary to keep the water just below a simmer and allow the berries to sit, swirling the bowl once or twice to dissolve any stubborn sugar clumps, until they’ve released all their juices, are mushy, and swim in a translucent red liquid, 35 to 45 minutes. Remove the bowl from the heat, uncover and strain through a fine-mesh strainer. (You should have 1/2 to 3/4 cup of strawberry syrup.) The mushy berries will have given off their color and flavor, and even though you won’t use them in the cake, they’re still tasty. Reserve the berries for spooning over pancakes or yogurt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate medium bowl, combine the heavy cream, crème fraîche and salt. Whisk the mixture vigorously by hand, or beat with a hand mixer on medium-high, until thick, light and holding a medium peak. Chill the bowl of whipped cream. Thinly slice the remaining raw strawberries lengthwise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Invert the sponge cake on a flat serving plate or cake stand. Holding a long serrated knife horizontally and parallel to the work surface, use it to lightly score all around the side of the cake at the midway point. Then, using long, even strokes and still holding the knife parallel to the surface, slice clean through the cake, using the score marks as a guide, to cut it into two even layers. Set the top layer aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a pastry brush to dab several tablespoons of the strawberry syrup across the bottom layer, lightly soaking the entire surface. Pull the bowl of cream from the refrigerator and dollop about half of it across the soaked layer, then spread in an even layer all the way to the edges. Arrange half of the sliced strawberries on top of the cream, then place the second cake layer on top of the first, cut side up. Lightly soak the top layer of cake with the strawberry syrup, reserving any remaining syrup for serving. Spread the remaining cream on top of the cake, then pile the remaining sliced strawberries over top. (If not serving immediately, cover loosely and refrigerate until ready to serve.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the cake with a serrated knife and serve. Drizzle the slices with any remaining strawberry syrup. The cake is best served the day it’s made, but will keep, covered and chilled, for up to 3 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022272-strawberry-and-cream-layer-cake"}