{"@context": "http://schema.org", "@type": "Recipe", "name": "Nian Gao (Baked Sweet Potato Sticky Rice Cakes)", "description": "Nian gao is a homonym for the Chinese phrase “nian nian gao sheng,” which means increasing prosperity year after year. It is a dish indigenous to southern China in sweet and savory forms, and traveled with the diaspora to southeast Asia. This modern spin on classic nian gao comes from the food writer Christopher Tan, who wrote a book on Singaporean pastries titled “The Way of Kueh.” He incorporates coconut milk, butter and mashed sweet potato into this nian gao for richness. The rice cake is usually steamed, but Mr. Tan bakes the batter in small molds for the contrast of a fudgy inside and crisp outside. The key to a smooth texture that stays soft after baking is resting the wet glutinous rice dough overnight.", "author": {"@type": "Person", "name": "Clarissa Wei"}, "image": "https://static01.nyt.com/images/2022/01/26/dining/21SINGAPOREREX6-nian-gao/merlin_200287482_7798a55b-7e32-4c4a-91ae-41fcde6ef806-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "24 to 42 nian gao, depending on pan size", "recipeCuisine": "", "recipeCategory": "cakes, dessert", "keywords": "coconut milk, lunar new year, plan-ahead, rice flour, singaporean, sweet potato, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 150}, "recipeIngredient": ["1 3/4 cups/240 grams glutinous rice flour, preferably Erawan brand", "1 pound/450 grams orange or purple sweet potatoes", "1 1/4 cups/280 grams full-fat coconut milk", "3/4 cup plus 2 tablespoons/175 grams granulated sugar", "1/2 teaspoon fine salt", "2 1/2 tablespoons/35 grams unsalted butter, at room temperature", "1/3 cup/40 grams tapioca starch", "1 large egg", "Canola oil, for greasing pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the glutinous rice flour and ¾ cup/180 grams water in a bowl to form a dough. Cover tightly and refrigerate for at least 6 hours and up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Wash and scrub the sweet potatoes and pat them dry thoroughly with a clean kitchen towel. With a fork, poke holes all over the sweet potatoes. Bake on a foil-lined pan until a fork can pierce it with no resistance, 40 to 50 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cool enough to handle, peel off the skin. Pass the sweet potato through a ricer or mash with a fork. Measure out 1¼ cups/320 grams of the mashed sweet potato. (Reserve any remaining for another use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine coconut milk, sugar and salt in a large saucepan. Set the saucepan over medium-low heat, and whisk until the sugar dissolves and the mixture is hot but not boiling, about 10 minutes. Remove from the heat and add the butter, stirring until it melts. Mix in the sweet potato mash, followed by the tapioca starch, then add the refrigerated wet glutinous rice flour gradually in chunks, whisking as you go. Add the egg and whisk until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 or more kuih bahulu pans in the oven until very hot, 7 to 8 minutes. If you don’t have a kuih bahulu pan, a decorative cakelet pan or mini muffin tin made out of cast iron or aluminum works (see Tip). The batter yields 24 to 42 nian gao, depending on the size of the hollows; work in batches if needed (see Tip). Remove the pan from the oven and, using a silicone or pastry brush, lightly and quickly brush its hollows with oil. Stir batter, then quickly pour it into the hollows, filling them 80 to 90 percent full."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake on the center rack until golden brown on top and a toothpick inserted into the center of one emerges moist and sticky, but with no pasty raw batter on it, 20 to 40 minutes. The exact baking time will vary depending on the size and heft of your pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a wooden skewer or butter knife to pry out and remove the nian gao from the pan. If the pan was properly heated and oiled, the nian gao will not stick. If needed, repeat with the remaining batter. If the pan cools off too much while you are removing a batch of nian gao, heat it for a couple of minutes in the oven before baking the next batch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "These nian gao are best served slightly warm while the edges are still crisp and the centres are soft and chewy. They are best the same day they are made. You can keep leftovers in a covered container in the refrigerator and steam, pan-fry or microwave them to reheat the next day, but they will not completely recover their freshly cooked texture."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022904-nian-gao-baked-sweet-potato-sticky-rice-cakes"}