{"@context": "http://schema.org", "@type": "Recipe", "name": "Italian Rainbow Cookies", "description": "Also known as Venetians, Neapolitans or tricolore cookies, these classic Italian-American treats are not really cookies at all, but thin, dense layers of brightly hued almond cake stacked with apricot jam, and coated with glossy chocolate. The layers are traditionally red, white and green to resemble the Italian flag, but, of course, you can play around with the colors depending on the holiday and what you have on hand. This version is adapted from Mary Carpino, from Briarcliff Manor, N.Y., who made them every Christmas for years. One of her granddaughters, Nicole Carpino Frasco, passed along the recipe to us. We increased the chocolate and salt slightly, but the festive spirit of the recipe remains. Mrs. Carpino stored them in her chilly winter attic, but if you don’t have one of those, store them in an airtight container in the refrigerator for up to 2 weeks, or in the freezer for up to 5 months.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2021/12/08/dining/08COOKIESREX19-RAINBOW/merlin_198248880_6e35a7d0-8dcf-4f9c-81f4-9166a0059a5b-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "About 70 cookies", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "bar cookie, christmas cookie, italian american, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 700}, "recipeIngredient": ["Nonstick cooking spray or neutral oil, for greasing the pans", "2 cups/255 grams all-purpose flour", "1/2 teaspoon fine salt", "1 (8-ounce/227-gram) package pure almond paste (not pastry filling) (see Tip)", "1 1/2 cups/340 grams unsalted butter, at room temperature", "1 cup/201 grams granulated sugar", "4 large eggs, yolks and whites separated", "1 teaspoon almond extract", "Red and green food coloring, preferably gel", "1 (12-ounce/340-gram) jar apricot or raspberry preserves (not seedless)", "8 ounces/227 grams semisweet or bittersweet bar chocolate", "Sprinkles, for finishing (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange 2 racks in the center of the oven and heat to 350 degrees. Make room in your refrigerator for 1 half-sheet pan. Grease 3 (13-by-9-inch) baking pans or quarter-sheet pans with cooking spray or a little oil, then line with parchment or wax paper. (This helps the paper stay in place.) Spray or oil the parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the flour and salt in a medium bowl. In the bowl of a standing mixer (or with a hand mixer), or in a large bowl if using an electric hand mixer, break up the almond paste using a fork or your fingers. Add butter, sugar, egg yolks and almond extract. Using the paddle attachment, beat on high until light and fluffy, about 5 minutes, scraping down the bowl halfway through. Turn off the mixer, add a third of the flour and salt, then beat on medium-low until just combined. Repeat with another third, scraping down the sides of the bowl as needed, and continue until all the flour is added and incorporated. Transfer batter to a large bowl. Rinse and dry the mixing bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add egg whites to the mixing bowl and beat on high speed with the whisk attachment until stiff peaks form, 30 to 45 seconds. Fold the egg whites into the batter until just combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove one-third of the batter to one of the prepared pans. Use an offset spatula to evenly spread the batter in the pan all the way to the edges. (This can get a little tricky, but have patience and take your time. The oil on the pan should help hold the paper in place, but if you’re having trouble, hold the paper in place with one hand while you spread with the other.) Remove another one-third of the batter to a medium bowl and add a couple drops of green food coloring. Stir until blended, and add more to reach your desired shade. Transfer green batter to a prepared pan and spread evenly. Add a couple drops of red food coloring to the remaining batter, stir to combine, add more as needed, then transfer to the last pan and spread evenly. Firmly tap each pan on the countertop to release air bubbles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 10 to 11 minutes, rotating pans halfway through, until the edges are barely browned, the tops are just set, and a toothpick inserted into the center comes out clean. Immediately slide cakes from the pans onto racks using the parchment paper. Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the parchment paper, slide the green cake onto a half-sheet pan. In a small saucepan, heat preserves over medium until loose, then strain through a fine mesh sieve. Spread half of the preserves over the green layer, going all the way to the edge. Carefully flip the uncolored layer on top (use a large offset spatula to help), and remove the parchment paper. Spread with the remaining preserves. Top with the red layer and remove the parchment paper. Cover with plastic wrap and place another rimmed baking sheet on top of the cookies. Transfer to the refrigerator, then top with heavy cans so the weight is evenly distributed. Refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt half of the chocolate in a double boiler or in the microwave in 30-second bursts. Using an offset spatula, spread the chocolate on the top and to the edges, then refrigerate until firm, about 30 minutes. Melt the remaining chocolate. Place a piece of parchment or wax paper on a cutting board, then place on top of the cake and invert the cake onto the board. Spread the bottom with the remaining chocolate. Let cool for a few minutes, then use the tines of a fork to draw waves in the chocolate and add sprinkles, if desired. Refrigerate until almost firm, but still slightly soft, about 5 to 10 minutes. (If you wait until the chocolate is fully set, the chocolate will crack when you cut.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a sharp knife under hot water, dry, then trim the edges and save for snacking. Cut the cake into 1-inch squares, running the knife under hot water and drying between cuts. Return to the refrigerator to set completely. Store in the refrigerator in an airtight container with wax paper between layers. Allow to come to room temperature a bit before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022760-italian-rainbow-cookies"}