{"@context": "http://schema.org", "@type": "Recipe", "name": "Instant Pot Milk-Braised Pork (Maiale al Latte)", "description": "This is a classic dish from Emilia-Romagna, a region in Italy where dairy and meat feature heavily in the traditional cuisine. Marcella Hazan wrote in her book, “Essentials of Classic Italian Cooking,” that maiale al latte is one of a handful of dishes that “most clearly express the genius” of regional Italian cooking. At its simplest, it is tough, inexpensive pork braised to finely textured tenderness in a pot of whole milk. As the caramelized milk reduces, it separates into extremely delicious curds and sauce infused with herbs and lemon. Serve this pressure-cooker version with bread or over polenta, pappardelle or rice.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2022/01/31/dining/sd-instant-pot-braised-pork/sd-instant-pot-braised-pork-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, meat, main course", "keywords": "herbs, instant pot, leeks, milk, pork shoulder", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 675}, "recipeIngredient": ["3 pounds boneless, skinless pork shoulder, cut into 4 large chunks  ", "Coarse kosher salt ", "1/4 cup vegetable oil ", "1 large or 2 small leeks, halved lengthwise and thinly sliced ", "10 garlic cloves, peeled and smashed ", "3 (2-inch) strips lemon zest, plus lemon slices for serving", "4 sprigs fresh thyme ", "4 sprigs fresh sage ", "2 sprigs fresh rosemary ", "5 cups whole milk ", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the pork generously with salt on all sides. Using a 6- to 8-quart electric pressure cooker, turn on the sauté setting (on the “more” or hot setting, if you have it). Add the vegetable oil, and, working in two batches, brown each piece of pork on two sides, about 5 minutes per side. With tongs, remove the browned pork to a plate as you go. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the sauté setting. Stir in the leeks, garlic, lemon zest and herbs, scraping the bottom of the pot with a metal spatula. Add the milk, and continue to scrape up the browned bits. (This is important for flavor, but also to avoid a “burn” error.) Return the pork and any liquid on the plate to the pot. Season with 1 teaspoon kosher salt and a generous amount of black pepper. Close the lid and twist the pressure knob to seal. Pressure cook for 1 hour. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the pressure cooker, and quick-release the pressure by carefully turning the pressure knob to venting. Using tongs, remove the pork to a serving platter. Remove and discard the herb sprigs. Turn on the sauté setting (on the “more” or hot setting, if you have it), and bring the milk to a rolling boil. Let the milk boil until it is reduced by about half and has darkened to a golden caramel color, about 20 minutes. (If you have time, you can caramelize it further, but take care to stir occasionally and make sure it doesn’t burn on the bottom.) Break the pork apart a little, into coarse chunks, and spoon the sauce over the top. Serve with lemon slices on the side."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022945-instant-pot-milk-braised-pork-maiale-al-latte"}