{"@context": "http://schema.org", "@type": "Recipe", "name": "Breakfast Udon", "description": "This bowl of udon is inspired by the delicate noodle dishes often served as the first meal of the day in Japan. A light, savory broth of dashi, soy sauce and mirin provides a gentle kickstart to your morning. Dashi, a simple seaweed-based stock, is foundational to many Japanese dishes, bolstering the umami flavors of the ingredients and providing balance to the overall dish. If you have 10 minutes and a piece of dried kombu in your pantry, make a quick kombu dashi (see Tip), but in a pinch, a lightly seasoned vegetable stock works, too. The jammy seven-minute egg and wilted spinach are enough to make this dish feel substantial, though you could also add slices of pan-fried tofu, tempura vegetable, seaweed or other hearty toppings to transform this into a complete weeknight dinner.", "author": {"@type": "Person", "name": "Hetty McKinnon"}, "image": "https://static01.nyt.com/images/2021/04/14/dining/hm-breakfast-udon/merlin_185308011_8264d945-133c-4b8a-b03a-e52ce93abe1f-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, dinner, lunch, weekday, noodles, main course", "keywords": "udon, spinach, eggs, scallions, ginger, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 468}, "recipeIngredient": ["Salt", "28 ounces precooked, vacuum-sealed udon or 12 ounces dried udon", "8 ounces fresh spinach, washed and trimmed", "4 large eggs", "2 scallions, trimmed and thinly sliced", "4 teaspoons sesame seeds", "2 tablespoons sesame oil", "4 garlic cloves, grated", "1 (2-inch) piece fresh ginger, peeled and grated", "4 cups dashi (see Tip) or vegetable stock", "1/4 cup shoyu (Japanese soy sauce) or soy sauce", "1 tablespoon mirin or sake", "2 teaspoons sea salt", "2 teaspoons granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of salted water to boil. Add the noodles and cook according to package instructions until al dente. Place a colander in the sink and using a slotted spoon or tongs, transfer the noodles to the colander and run under cold water to stop the noodles from cooking further. Drain again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pot of water, add the spinach. Cook for about 60 seconds, until the leaves are wilted but still bright green. Drain, emptying the water from pot, and run the spinach under cold water. Squeeze out as much liquid as possible, then scrunch the spinach into a ball and slice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pot, add enough water to submerge the eggs. Bring to a boil over medium-high. Add the eggs, reduce heat to medium to keep it on a gentle rolling simmer, and cook for 8 minutes. (This will give you a just-set yolk; for a runnier yolk, remove after 7 minutes.) Remove eggs from the water immediately and run under cold water until the egg is cold to the touch. Place the eggs in a bowl of cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set out four large bowls. Divide the udon noodles among the bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the broth: Heat a large pot over medium. Add the sesame oil, garlic and ginger and cook for about 30 seconds, until fragrant. Add the remaining broth ingredients, along with 2 cups water. Bring to a boil. Once boiling, reduce heat and gently simmer for 4 to 5 minutes to allow the flavors to meld."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice each egg in half lengthwise. Ladle the hot broth over the noodles. Top each bowl with a mound of spinach, 2 egg halves, scallions and sesame seeds."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022101-breakfast-udon"}