{"@context": "http://schema.org", "@type": "Recipe", "name": "Chiles Rellenos", "description": "This recipe for chiles rellenos comes from Andrea Serrato, who sells an exquisite version of the dish out of her home in East Los Angeles. Ms. Serrato learned to make it from her mother, Rose Serrato, who fills big chile poblanos simply with queso ranchero, fries them in a cloudlike batter and simmers them in a garlicky salsa roja. Be sure to take your time charring the chiles on the flame to make sure they get evenly tender. The dish is time-consuming and labor-intensive, but extremely worthwhile — delicious, comforting and beautiful, too.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2021/03/25/magazine/25mag-eat/25mag-eat-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 chiles", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, vegetables, main course", "keywords": "poblano chili, queso fresco, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 391}, "recipeIngredient": ["3 serrano chiles, stems removed", "6 beefsteak tomatoes (about 4 pounds)", "4 garlic cloves, peeled", "1 teaspoon kosher salt, plus more to taste", "2 tablespoons neutral oil, such as grapeseed or canola", "1 white onion, peeled and sliced into thin rings", "6 large, firm poblano chiles (about 1 3/4 pounds)", "12 ounces queso fresco or low-moisture melting cheese, such as mozzarella", "5 large eggs, yolks and whites separated", "Canola oil, for frying", "2 cups all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the tomato salsa: Put a large pot of water on to boil. When the water starts to bubble, add the serrano chiles and whole tomatoes, and turn down the heat. After 10 minutes of low simmering, strain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the serranos, garlic and 1 teaspoon salt to a blender with 1/2 cup water, and purée until smooth. Add the tomatoes, then purée until almost totally smooth. (Some larger pieces of tomato are fine, and give the salsa texture.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan that will hold all of the salsa, heat 2 tablespoons oil over medium heat, and add the onion. Cook until soft and slightly golden on the edges, about 5 minutes, then add the salsa and turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chiles: Using tongs, char two poblanos at a time over the open gas flame (or all six under your broiler, turning them often). The chiles should be blackened all over, and tender to the touch, which takes about 10 minutes. As you finish them, put them on a plate and cover for about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use your finger to gently push and peel away the blackened outer skin of the charred chile. Remove as much as you can, but it’s OK if a few small pieces are left; don’t worry about it. Use a knife to slice each chile lengthwise, leaving an inch or so on each end, and remove the seeds (again, it’s OK if some remain). Fill the chiles with cheese to fit, but make sure the chile can still close along its seam when you pinch it shut."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the batter: Separate the eggs, and beat the whites with a whisk attachment until thick and frothy, like meringue. Add the yolks, and beat for another minute, just to incorporate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry the chiles: In a large, heavy-bottomed pan, heat about 3 inches of oil over medium until a small drop of batter sizzles vigorously when you add it to the oil. Put the flour on a plate, and roll a chile in the flour so it’s completely covered. Push it down into the batter, turn it around gently, and use the stem to pull it out — it will look like a vaguely chile-shaped cloud."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently lay the chile down in the hot oil, seam side up. The chile should immediately start to sizzle and lightly color. Spoon hot oil over any exposed parts of the chile, cooking for about 2 minutes, or until the top of the chile is evenly golden brown, then remove and place on a paper-towel-lined rack to drain. Repeat with each chile."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to sit down and eat, heat the salsa over medium, and season it to taste with salt. Place the fried chiles in the pan. (Work in batches if you have to, so the chiles aren’t crowded.) Let them simmer gently for a few minutes, then serve immediately with extra salsa spooned over the top."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022118-chiles-rellenos"}