{"@context": "http://schema.org", "@type": "Recipe", "name": "Peanut-Butter Wafer Cake", "description": "This towering trifecta of flavor and texture — crisp wafer, creamy peanut butter and glossy dark chocolate — comes together quickly and easily. The hidden star here is Katherine Yang’s utterly delicious peanut butter cream, which binds the layers. It’s savory and nutty, silken and not too sweet. Wafer sheets come in standard 8 1/2-inch rounds, so tempering the chocolate in a 10-inch-wide, shallow pan is the simple trick to easy dipping. You can use an offset spatula to spread the filling, or for a more impressive presentation, use a star tip, and pipe swirls, rosettes or scallops. The cake should be eaten soon after assembly, as the filling will eventually start to soften the wafer’s crispness.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2021/03/21/magazine/21mag-eat/21mag-eat-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "cakes, dessert", "keywords": "bittersweet chocolate, chocolate, egg, heavy cream, milk, peanut, peanut butter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 475}, "recipeIngredient": ["1 1/2 cups/360 milliliters whole milk", "1/2 cup/120 milliliters heavy cream", "1 large egg plus 1 large yolk", "1/3 cup/67 grams granulated sugar", "1 tablespoon cornstarch", "1 tablespoon all-purpose flour", "1/2 cup/133 grams smooth, commercial peanut butter (preferably Skippy)", "1/2 teaspoon kosher salt", "8 ounces/225 grams high-quality bittersweet chocolate shards/chips (1 1/3 cups)", "1 tablespoon shortening", "Heaping 1/3 cup/60 grams dry-roasted salted peanuts", "1 teaspoon confectioners’ sugar", "4 (8 1/2-inch-round) plain or cocoa wafer sheets"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring milk and cream to simmer in a heavy 1-quart saucepan over medium heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk egg and yolk in a medium bowl. Add sugar, cornstarch and flour, and whisk until very well incorporated and almost fluffy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk hot milk mixture into egg mixture. Return mixture to saucepan, and return heat to medium. Boil 1 minute, whisking constantly, or until thickened. Remove from heat. Whisk peanut butter into hot pastry cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the mixture through a fine-mesh sieve into a clean bowl, stir in salt, then cover with plastic wrap directly on cream to prevent skin from forming. Chill at least 3 hours, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake layers: Bring a wide pot of shallow water to a very gentle simmer over low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 2/3 of chocolate shards plus solid shortening in a clean 10-inch skillet set over the gently simmering water, and melt slowly. Bring the mixture to 110 degrees, and stir well to create a glossy, uniform consistency. Seed in remaining chocolate shards, and stir until completely melted and glossy, and chocolate tempers to 91 degrees. Remove from heat or turn off simmering water (or both)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulse peanuts in food processor until they’re a coarse meal. Remove, and stir in confectioners’ sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop one wafer sheet into chocolate, giving it a tiny swirl to make sure the entire surface underneath is coated. Retrieve the wafer with tongs, tweezers or two forks, and hover it over the chocolate until dripping stops, then invert wafer, chocolate face down, on a baker’s rack set over parchment to “drain.” You want a film of chocolate to glaze the waffling, but you don’t want to fill the holes enough to pave them over entirely. Repeat with remaining wafer sheets, tempering the chocolate if needed. While chocolate is still tacky, turn wafers chocolate-side up to finish cooling. (Use an offset spatula if needed to gently release wafer from rack.) Before chocolate sets fully, heavily ring edges of two of the chocolate-dipped wafer sheets by sprinkling the prepared peanut mixture in a 1-inch rim. Allow to cool and harden in a cool, dry place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble: Pipe or spread 1/3 of the peanut-butter pastry cream uniformly among three of the wafer sheets (on the chocolate-filmed side to prevent sogginess later), reserving one of the peanut-edged sheets as the topper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, stack the sheets chocolate-side up, using the peanut-crusted sheet on the bottom, the other two plain sheets in between, and top with the last peanut-crusted chocolate wafer sheet."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022014-peanut-butter-wafer-cake"}