{"@context": "http://schema.org", "@type": "Recipe", "name": "Savory Suzhou Mooncakes", "description": "Mooncakes are pastries timed to the Mid-Autumn Festival, a holiday that celebrates the commencement of the harvest season, and this variety is specific to Suzhou, China, a city on the outskirts of Shanghai. Stuffed with juicy ground pork, these savory, glazed mooncakes burst with the flavor of sweetened soy sauce. The shells are crisp and flaky, a texture achieved by layering then rolling two types of dough with lard. This recipe comes from “My Shanghai: Recipes and Stories From a City on the Water” by Betty Liu, whose mom made them each year when autumn rolled around. Traditionally, the pastries are cooked on the stovetop in a giant cast-iron skillet, but popping them into the oven ensures an even bake.", "author": {"@type": "Person", "name": "Clarissa Wei"}, "image": "https://static01.nyt.com/images/2021/09/08/dining/03MOONCAKEREX2-savory-suzhou-mooncakes/merlin_194033442_06251b50-f70f-4a20-a77d-3a747533dbe0-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "16 mooncakes", "recipeCuisine": "chinese", "recipeCategory": "project", "keywords": "pork", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 159}, "recipeIngredient": ["1 large scallion, trimmed", "1 thin (2 1/2-inch-long) slice ginger, plus 1/2 teaspoon minced ginger", "1/2 pound/225 grams ground pork", "1 tablespoon granulated sugar", "1 tablespoon cornstarch", "1 tablespoon Shaoxing wine", "1 tablespoon light soy sauce", "1 1/2 teaspoons dark soy sauce", "1/2 teaspoon sesame oil", "1/2 teaspoon kosher salt (Diamond Crystal)", "Pinch of ground white pepper", "1 cup plus 3 tablespoons/158 grams all-purpose flour", "1/2 cup/110 grams pork lard or softened unsalted butter", "1 3/4 cups/225 grams all-purpose flour, plus more as needed", "3 tablespoons pork lard or softened unsalted butter", "2 tablespoons granulated sugar", "Pinch of kosher salt (Diamond Crystal)", "1/2 cup/120 milliliters boiling water, plus more as needed", "1 large egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a blender, blend the scallion, sliced ginger and 1/4 cup water on high until puréed. Strain through a fine-mesh sieve and transfer 3 tablespoons of the flavored water to a medium bowl. Add the pork, sugar, cornstarch, wine, both soy sauces, the sesame oil, minced ginger, salt and pepper. Mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wet your hands slightly to prevent sticking, then divide the meat mixture evenly into 16 balls (each about 1 rounded tablespoon) and place on a baking sheet. Cover lightly with plastic wrap and refrigerate to firm up while preparing the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough paste: In a medium bowl, mix the flour and lard with a silicone spatula or your hands until they form a dough. The paste should just hold together: It will be dry and flaky but still oily. Shape into 16 small balls (each about 1 scant tablespoon) on another baking sheet, and cover lightly with plastic wrap."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a large heatproof bowl, mix the flour, lard, sugar and salt. Stream in the boiling water and mix with a silicone spatula to form a dough. When the dough is cool enough to handle, use your hands to knead the dough until it is very smooth with no lumps, adding more water or flour as needed for dough that is tacky but not sticky. Divide the dough into 16 balls (each about 1 rounded tablespoon) on a separate baking sheet and cover lightly with plastic wrap. Let the dough paste and dough rest for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Meanwhile, assemble the mooncakes: Place a ball of the dough in one palm and use your other palm to press it into a flat disk. Take a ball of the paste and place in the center of the disk. Bring the sides of the dough up and around the paste ball, so that the paste is encased within the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a lightly floured rolling pin on a lightly floured surface, flatten this ball of dough into a flat, long and thin oval. Starting from the bottom narrow end of the oval, roll the dough into a log. Set aside under plastic wrap. Repeat with the remaining balls of dough, keeping the logs under plastic wrap to prevent them from drying out. Rest for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position a log so that it’s vertical and flatten with a rolling pin, rolling up and down, to form a long oval. Roll it up again into a log, lightly flouring the rolling pin and surface as necessary. Press a chopstick or your finger crosswise down the middle so that the two edges bend upward. Flatten the whole thing with your palm so that you see two spirals. Using a rolling pin, flatten the dough into a thin circle, about 4-inches wide. Repeat with the remaining logs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the meat filling: Place a ball of meat inside the circle. Pleat the dough around the meat and pinch to close. Pinch off any excess dough. Flip the ball over, gently press with your palm to flatten it slightly, and set it on a baking sheet, covering it loosely with plastic wrap to prevent it from drying out. Repeat with all the remaining dough and meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, make the egg wash by combining the egg with 1 teaspoon water. Brush the mooncakes with the egg wash and bake until golden brown, 25 to 30 minutes. Let cool slightly, then serve while hot. Mooncakes will keep in an airtight container for 3 to 5 days refrigerated or for several months frozen."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022517-savory-suzhou-mooncakes"}