{"@context": "http://schema.org", "@type": "Recipe", "name": "Mashed Sweet Potatoes With Roasted Garlic", "description": "There’s no reason we can’t treat sweet potatoes like regular potatoes, meaning mashing them with butter, cream and lots of salt. Roasting sweet potatoes in the oven — individually wrapped in foil to help them steam — is not just a hands-off way to cook them by avoiding large pots of boiling water, it also concentrates their flavor. Roasted garlic is an easy addition here; since the potatoes already need an hour’s worth of oven time, the garlic can cook alongside. The mellowed, caramelized garlic cloves are then smashed into the silky spuds, creating a minimalist yet rich and savory side dish. Make this the night before and reheat it in a buttered casserole dish in the oven — or even in the microwave — with a couple of extra pats of butter on top, right before eating.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2021/11/17/dining/15BEGINNERREX3-SWEETPOT/merlin_197340564_50ac981b-5e20-4326-a651-2949614a420d-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 301}, "recipeIngredient": ["1 large head of garlic", "1 tablespoon extra-virgin olive oil", "Salt and black pepper", "2 pounds sweet potatoes (see Tip)", "1/2 cup heavy cream", "4 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Turn the garlic head on its side and carefully cut off the very top end to expose the cloves. (Discard the top.) Place the head of garlic on a sheet of foil, cut side up, and drizzle with the oil and season with salt and pepper. Wrap tightly and place on a sheet pan. Wrap each sweet potato individually in foil and place on the pan alongside the garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the sweet potatoes are tender and the garlic is soft, fragrant and slightly caramelized, about 1 hour. Set aside, still wrapped, to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the cream and butter in the microwave in 30-second intervals, checking after each, until the butter is melted, about 1 minute. (Alternatively, you can heat the cream and butter in a small saucepan over medium until the butter is melted.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unwrap the sweet potatoes and peel them, discarding the skin and adding the flesh to a large bowl. Squeeze the garlic head, cut side down, into the bowl to release the roasted cloves. Pour in the hot cream and butter. Using a whisk or fork, break up the potatoes and garlic and vigorously stir until smooth and fluffy, at least 30 seconds. Taste for seasoning, adjusting with salt and pepper as needed. Transfer to a serving bowl and serve warm. (To make ahead, transfer to a buttered casserole dish or cake pan, cover and refrigerate for up to 24 hours, until ready to eat. Bake in a 350-degree oven or microwave until heated through, about 15 minutes. On Thanksgiving, you should reheat this when the turkey is out of the oven and resting.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022744-mashed-sweet-potatoes-with-roasted-garlic"}