{"@context": "http://schema.org", "@type": "Recipe", "name": "Honeyed Pistachio Mooncakes", "description": "Mooncakes are pastries timed to the Mid-Autumn Festival, a holiday that celebrates the commencement of the harvest season. Traditionally, they showcased the best ingredients of a region, like sweet lotus seed paste in Guangdong, China, melon seeds in Hainan or pork in Yunnan, but you can stuff mooncakes with whatever you’d like, as long as the fillings are encased in dough and the exterior is aesthetically pleasing. In her forthcoming cookbook, “Mooncakes and Milkbread,” the Chinese-American baker Kristina Cho has channeled that spirit by stuffing her mooncakes with blitzed pistachios and honey, a combination commonly found in baklava. The blend is enveloped in a classic Cantonese crust that uses lye water to bump up the pH of the dough, giving it a gentle amber hue, and golden syrup, which lends the cake a chewy, soft bite.", "author": {"@type": "Person", "name": "Clarissa Wei"}, "image": "https://static01.nyt.com/images/2021/09/08/dining/03MOONCAKEREX1-pistachio-honey-mooncake/merlin_194033367_9230d531-e73c-49ca-b63f-73aa806bfa26-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "12 small mooncakes", "recipeCuisine": "chinese", "recipeCategory": "cakes, project, dessert", "keywords": "dough, honey, pistachio", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 317}, "recipeIngredient": ["2 1/2 cups/300 grams all-purpose flour, plus more for dusting", "1/2 cup/110 grams canola oil", "1/2 cup/160 grams golden syrup (such as Lyle’s Golden Syrup)", "1 teaspoon lye water, sometimes known as kansui (see Tip)", "1 large egg", "1 1/2 cups/200 grams roasted unsalted shelled pistachios", "1/4 cup/80 grams honey", "2 tablespoons coconut oil ", "1 tablespoon cornstarch ", "1 teaspoon kosher salt (Diamond Crystal)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a large mixing bowl, combine the flour, oil, syrup and lye water. Using a flexible spatula, mix to form a shaggy dough, then knead with your hands to form a smooth, cohesive dough. Form the dough into a thick disk, wrap in plastic and let rest at room temperature for 45 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and line a large rimmed baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a food processor, pulse the pistachios until coarsely ground. Add the honey, coconut oil, cornstarch and salt, and pulse a few more times until the filling is a little crumbly but sticks together when pressed. Avoid overprocessing: You don’t want to end up with pistachio butter. Divide the filling into 12 equal portions (each about 1 rounded tablespoon) and roll each piece into a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the disk of dough into 12 equal pieces. Roll each piece into a smooth ball. Working with one ball at a time and keeping the rest covered with plastic wrap, flatten a dough ball with your palm. Using a lightly floured rolling pin, roll into a 4-inch round (about 3/16-inch/ 1/2-centimeter thick), lightly dusting with flour if sticking. Gently lift the dough with a bench scraper or spatula, and center a ball of filling on the round. Bring the edges of the dough up around the filling. If the dough doesn’t initially cover all filling, just pinch it together until it completely encases the filling. If there is excess, pinch it off.  Pinch together any cracks that form and roll each round into a smooth ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As you form the balls, arrange them on the prepared baking sheet, spacing at least 2 inches apart. Lightly dust a 1.7-ounce/50-gram mooncake mold with flour. Place a ball in the mold and press the plunger down to apply pressure, but take care not to press too hard. Gently release from the mold and return to the baking sheet. Repeat with remaining dough and filling to form all 12 mooncakes. If you don’t have a mooncake mold, skip this step and bake the mooncakes as balls. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the edges are light golden brown, 9 to 11 minutes. Remove the sheet from the oven and allow the cakes to cool on the sheet for 10 minutes. In a small bowl, mix together the egg and 2 tablespoons water. With a pastry brush, lightly coat the mooncakes with egg wash. Return to the oven and bake until darker golden brown, about 10 minutes. Transfer the baking sheet to a wire rack and allow the mooncakes to cool completely on the sheet. Before serving, store mooncakes in an airtight container or a resealable bag at room temperature for 1 to 2 days. This step is optional, but the extra time allows the crust to soften and become a little chewier. Mooncakes can be stored in an airtight container at room temperature or in the refrigerator for up to 5 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022516-honeyed-pistachio-mooncakes"}