{"@context": "http://schema.org", "@type": "Recipe", "name": "Extra-Lemony Meringue Pie", "description": "Made with a buttery lemon curd and topped with swirls of lemon zest-infused meringue, this pie is tangier and creamier than many others of its kind. It features a soft, spoonable curd that’s softer than other lemon meringue pie fillings. You can make it with regular or Meyer lemons: The regular ones will be sharper and brighter; the Meyers, a little softer and fruitier. This pie is best served the day it’s baked, though you can make the dough and filling up to five days in advance. The meringue, however, needs to be whipped up just before the pie is baked. Store leftovers in a sealed container at room temperature. (Watch the video of <a href=\"https://youtu.be/y4DoSf2JVDI\">Melissa Clark making extra-lemony meringue pie here</a>.)", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/03/23/autossell/lemonmeringue_2642h/lemonmeringue_2642h-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts, dessert", "keywords": "egg whites, lemon, father’s day, mother’s day, valentine’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 857}, "recipeIngredient": ["All-purpose flour, for rolling out dough", "Dough for 1 (9-inch) <a href=\"https://cooking.nytimes.com/recipes/448-pie-crust\"\">pie</a>", "4 egg yolks (save whites for the meringue)", "1 large egg", "3/4 cup/150 grams granulated sugar", "3/4 cup plus 2 tablespoons/207 milliliters freshly squeezed lemon juice (from 4 to 6 regular or Meyer lemons)", "2 teaspoons finely grated lemon zest (from 2 lemons)", "Pinch of salt", "6 tablespoons/85 grams unsalted butter, cut into 1/2-inch pieces", "4 egg whites, at room temperature", "1 cup/200 grams granulated sugar", "1/2 teaspoon pure vanilla extract", "1/4 teaspoon cream of tartar", "Pinch of salt", "1 tablespoon finely grated lemon zest (from 3 to 4 lemons), plus more for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the crust: On a lightly floured surface, and using a lightly floured rolling pin, roll pie dough into a 12-inch circle, about 1/8-inch thick. Transfer to a 9-inch pie pan (not deep dish); fold the edges over and crimp them together. Prick crust all over with a fork and chill in freezer for 30 minutes until frozen. (Cover with plastic if freezing for longer than a few hours. Well wrapped, it will last in the freezer for up to a month.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Line chilled crust with foil, fill with pie weights or dried rice, then bake for 12 minutes. Remove foil, lower oven temperature to 350 degrees, and bake until pale golden, 10 to 16 minutes longer. Transfer to a rack to cool while you prepare the filling. (Leave the oven on if baking the pie immediately.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy saucepan, whisk together egg yolks, egg and sugar. Stir in lemon juice, zest and salt. Add pieces of butter and cook, whisking constantly, over medium-low heat until the mixture thickens enough to coat a spoon, about 7 to 9 minutes. An instant-read thermometer should register 180 degrees. Inspect the filling: If you think there are any coagulated bits of egg, strain through a fine-mesh sieve into a clean bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour filling into pie crust and return to the oven to bake until filling is set (it should jiggle only slightly in the center), about 18 to 40 minutes. (Pies prepared in glass and ceramic dishes can take much longer to bake than those prepared in metal dishes. Don't give up: The curd will eventually set; note that it continues to firm up after it is thoroughly chilled. It will still look liquidy in the center even when it's done. If the crust starts to brown too much before the filling is set, reduce heat to 325 degrees.) Remove pie from oven and increase oven temperature to 400 degrees for baking the meringue."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the filling bakes, make the meringue: Fill a medium pot with 1 inch of water and bring to a simmer over medium-high heat. Using a large metal bowl, whisk together egg whites, sugar, vanilla, cream of tartar and salt. Set the bowl with the egg white mixture into the pot above the water, and whisk constantly by hand until sugar dissolves and mixture is warm (160 degrees on an instant thermometer) and has thickened and lightened in color, 5 to 7 minutes. Remove bowl from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer, beat on medium-low speed and gradually increase speed to high, until mixture is thick and fluffy, and stiff peaks form, about 5 to 8 minutes. Be careful not to overbeat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a rubber spatula, gently fold in lemon zest. Mix with care to not deflate meringue: A few strokes should do it. Spread the meringue over the hot filling, making sure it meets the edges of the crust. Using a knife or spatula, swirl in a design, if you like, and bake until lightly browned, about 8 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow to cool completely and top with more lemon zest before serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "The Best Lemon Meringue Pie", "description": "Melissa Clark is in the studio kitchen showing us how to make her Extra-Lemony Meringue Pie, which is a tangier, creamier version of its cousin, Lemon Meringue Pie. In Melissa’s recipe, a buttery lemon curd is topped with swirls of lemon zest-infused meringue. “For a lemon meringue pie,” Melissa says, “the focus really should be on the contrast between that tangy filling and then that fluffy, sweet topping. The crust is totally negotiable.”", "thumbnailUrl": "https://static01.nyt.com/images/2022/03/23/autossell/lemonmeringue_2642h/lemonmeringue_2642h-mediumThreeByTwo440.jpg", "uploadDate": "2022-03-23T19:59:30.000Z", "duration": "PT9M35S", "transcript": "", "contentUrl": "https://vp.nyt.com/video/2022/03/23/99612_1_MC-Lemon-Meringue-YT_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022949-extra-lemony-meringue-pie"}