{"@context": "http://schema.org", "@type": "Recipe", "name": "Mustard Salmon With Spring Vegetable Stew", "description": "Fresh wild salmon, which is available in spring and summer, is preferred for its superior flavor and brilliant color. Here, a large piece of boneless fillet is seasoned with crushed fennel seed, coarse black pepper and Dijon mustard, which contrast nicely with the salmon’s sweetness. To accompany the salmon, a combination of spring vegetables is lightly simmered with butter for a French-style stew. Sizzling brown mustard seeds and green chile in oil — the technique called tadka in Indian cooking— supplies a welcome spicy finish.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2021/05/07/dining/07Tanisrex2/07Tanisrex2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, seafood, main course", "keywords": "asparagus, dijon mustard, salmon, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 265}, "recipeIngredient": ["1 1/2 pounds boneless, skin-on center-cut salmon fillet, preferably wild or sustainably farmed", "Kosher salt", "1 teaspoon coarse-crushed fennel seed (use a mortar or spice mill)", "1/2 teaspoon coarse-ground black pepper", "2 tablespoons Dijon mustard", "2 tablespoons unsalted butter", "1 medium fennel bulb, diced", "1 pound medium asparagus, trimmed and cut into 1-inch lengths", "4 ounces sugar snap peas, topped, tailed and halved crosswise (about 1 cup)", "3/4 pound English peas in the pod, shucked (about 1 cup)", "5 ounces cauliflower, cut into tiny florets (about 2 cups)", "6 medium scallions, white and green parts, sliced at an angle in 1/4-inch lengths", "1 tablespoon safflower oil or other vegetable oil", "1 teaspoon brown mustard seeds", "1 serrano chile, finely chopped, or less, to taste", "1 tablespoon chopped tarragon", "2 tablespoons chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Sprinkle salmon lightly on both sides with kosher salt. Place skin-side down in a low baking dish. Sprinkle top of fish with fennel and black pepper. Smear mustard evenly over the surface. Leave for at least 10 minutes to absorb seasoning and come to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake salmon, uncovered, just until white juices begin to surface at sides and top, 10 to 15 minutes, depending on thickness. Remove and let rest 5 minutes. (Salmon should be perfectly cooked, still moist at center.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As salmon cooks, make the vegetable stew: Set a Dutch oven or wide, heavy skillet over medium-high heat. Melt butter, then add the fennel. Season lightly with salt. Let fennel cook without browning, stirring frequently until just done, about 5 minutes. Add asparagus, sugar snap peas, shucked peas, cauliflower, scallions and a small pinch of salt. Stir to combine and add ¼ cup water. Raise heat to high and cover pot. Cook for 5 minutes, until vegetables are tender-crisp and just done (residual heat will cook them further). Turn off heat and transfer vegetables to a serving dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a tiny skillet, heat oil over medium-high. When oil is wavy, add mustard seeds and serrano chile, and stir together. When mustard seeds begin to sputter and pop, pour contents of skillet over the vegetable stew. Top with tarragon and parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For each serving, place a piece of salmon on a warmed plate. Spoon some vegetables over and around salmon. Pass remaining vegetables at the table."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022169-mustard-salmon-with-spring-vegetable-stew"}