{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Salmon Escabeche", "description": "This recipe yields both tender salmon and crisp skin, while also solving for salmon’s tendency to stick and fall apart on the grill. First, cooking the salmon skin-side down the whole time protects its delicate flesh from the intense heat and gets the skin so browned that it minimizes sticking. Then, once it’s cooked most of the way through, the fish is transferred to a dish of quick-pickled fennel. Just the flesh is submerged in the brine so it cooks, while the skin above the liquid remains potato-chip crisp. This utilizes the age-old technique of escabeche, in which fish, meat or vegetables “cook” in a sauce of vinegar, oil and seasonings. Feel free to add coriander seeds, onion or other flavorings you like in your pickled vegetables. Serve the salmon and fennel with grilled bread, boiled potatoes, a salad or mayonnaise.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2021/06/24/dining/28grillingrex6-WEB/merlin_189645936_4856f363-f87b-4938-a44b-7bf2493a3227-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, seafood, main course", "keywords": "fennel, salmon", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 215}, "recipeIngredient": ["4 (6- to 8-ounce) skin-on salmon fillets", "1/2 cup freshly squeezed lime juice (from about 4 limes)", "1/4 cup apple cider vinegar or unseasoned rice vinegar", "1/4 cup extra-virgin olive oil", "1 1/2 teaspoons sugar", "1/2 medium fennel bulb, bulb and stalks thinly sliced, fronds chopped (about 8 ounces)", "4 fresh thyme or oregano sprigs or bay leaves", "3 garlic cloves, thinly sliced", "Kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a charcoal grill for two-zone cooking over medium-high heat by pouring the coals onto one half of the grill. For a gas grill, heat all of the burners to medium-high, then turn off one of the end burners before cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the grill heats, pat the salmon dry, and set aside to air-dry. In a metal 3-quart dish (like a 9-by-13-inch pan), large (12-inch) oven-safe skillet or a disposable aluminum pan, stir together the lime juice, vinegar, oil and sugar. Add the fennel, thyme and garlic. Season generously with salt and pepper, and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When your grates are heating (or on a gas grill, when your grill is nearing temperature), put the dish over indirect heat (where there aren’t any coals or where the burner is turned off). Cover the grill and let the fennel mixture warm until the grill reaches temperature, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to grill, season the salmon all over with salt and lightly coat with olive oil. Take the salmon, a tightly folded paper towel soaked with olive oil, a fish spatula and a rimmed baking sheet to the grill. Using gloved hands, transfer the dish of pickled fennel to the baking sheet (or another heat-safe surface, like concrete)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean the grates with a grill brush, then oil the grates with the paper towel. Add the salmon skin-side down over direct heat (above the flame). Cover the grill and cook until the skin is browned and releases easily from the grates and the flesh is opaque three-quarters of the way up the sides, 3 to 6 minutes, depending on the thickness of your fish. Check the fish often and move it around the fire to avoid flare-ups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the fish finishes, nestle it skin-side up among the pickled fennel. Let sit for 5 minutes or up to 30, until the fish is cooked through. Eat with the pickled fennel. Leftovers can be refrigerated and eaten cold or at room temperature the next day. (Remove the skin as it will be soggy at this point.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022339-grilled-salmon-escabeche"}