{"@context": "http://schema.org", "@type": "Recipe", "name": "Chap Chye (Braised Cabbage and Mushrooms)", "description": "A hearty plate of chopped cabbage, shiitake mushrooms and carrots stewed in aromatics, chap chye is ubiquitous on the Lunar New Year table in Singapore, though every family has a different way of making it depending on its heritage. This recipe comes from Darren Ho, a Singaporean chef of Teochew, Hainanese, Cantonese and Peranakan descent. Other cooks like adding cubes of pork for flavor, lily buds for texture and a heaping of black moss fungus on top because its Cantonese name — fat choy — is a homophone for good luck. Mr. Ho flavors his vegan version with fermented bean paste and bean curd cubes, which lend distinct creamy undertones. Serve with white rice.", "author": {"@type": "Person", "name": "Clarissa Wei"}, "image": "https://static01.nyt.com/images/2022/01/26/dining/21SINGAPOREREX5-chap-chye-braised-cabbage/merlin_200287683_49340b98-806f-4afc-96a3-e1a36e1e65fd-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 270}, "recipeIngredient": ["8 large dried shiitake mushrooms", "8 large or 16 small dried wood ear mushrooms (or use more dried shiitakes)", "4 cups boiling water", "2 to 2½ ounces dried glass noodles (mung bean noodles)", "1/4 cup fermented soybean paste (taucheo) or Korean doenjang", "2 tablespoons oyster sauce (vegetarian, if preferred)", "2 red fermented bean curd cubes (furu; see Tip), or 2½ tablespoons red miso paste", "2 teaspoons soy sauce", "1/2 cup peanut oil", "3 ounces/90 grams dried tofu skin, cut into 1-inch-thick strips (see Tip)", "4 large shallots, finely sliced", "8 garlic cloves, minced", "2 pounds green cabbage, cut into 2-inch-thick pieces, leaves separated", "2 large carrots, peeled and cut into matchsticks", "1 tablespoon palm sugar or dark brown sugar, plus more to taste", "1 teaspoon fine salt, plus more to taste", "Cilantro sprigs, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heatproof bowl, cover the dried mushrooms with 4 cups boiling water. In a medium bowl, combine the glass noodles with enough room temperature water to cover. Soak both for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the sauce: Combine the fermented soybean paste, oyster sauce, bean curd cubes and soy sauce in a small bowl. Mash the bean curd cubes with a fork, and mix thoroughly to form a paste. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lift the mushrooms out of the water and into a fine-mesh sieve, reserving the soaking water. Squeeze out excess water from the shiitake mushrooms, then trim the shiitake stems and discard. Thinly slice the shiitake caps. With a knife or scissors, trim and discard any tough, craggy bits from the wood ear mushrooms. If they’re larger than 2 inches in diameter, cut them in half. Drain the glass noodles and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large wok or large Dutch oven over medium-high heat and add the peanut oil. When the sides of the wok begin to smoke, slide in half of the dried tofu skin and fry until light golden brown, 20 to 30 seconds. Transfer the fried tofu skin to a paper towel. Repeat with the remaining dried tofu skin. Reserve the oil in the wok and reduce the heat to medium-low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the reserved oil is shimmering, add the shallots and garlic. Cook, stirring, until fragrant, 1 to 2 minutes. Add the sliced shiitake mushrooms and cook for 30 seconds. Add the sauce, and toss in the cabbage. Quickly stir to combine so that the sauce completely coats the cabbage. Pour in the reserved mushroom water, leaving behind any grit, and turn the heat up to high. When the mixture begins to bubble, reduce the heat to medium-low and cover the wok. Cook, stirring occasionally, until the cabbage has wilted completely, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wood ear mushrooms, glass noodles, fried tofu skin and carrots. Mix, cover and cook, stirring occasionally, until the cabbage has absorbed all the liquid and is very tender, 10 to 15 minutes. The dish is done when there is no more liquid pooled at the bottom. Turn off the heat, then stir in the palm sugar and salt, adding more to taste if you’d like. Transfer to a deep serving dish and garnish with cilantro. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022903-chap-chye-braised-cabbage-and-mushrooms"}