{"@context": "http://schema.org", "@type": "Recipe", "name": "Herby Fried Shallot and Bread Crumb Crunch", "description": "This recipe begins with shallots fried Southeast Asian style, starting in cold oil, with a method so simple you’ll never do it any other way. You don’t need a thermometer or any other special equipment — just patience and a careful eye. In exchange, you’re rewarded with caramel-sweet shallots that crunch, then melt between your teeth. Next, rosemary, sage and stale bread crumbs take turns in the oil, crisping as they cool. Then, they’re tossed with chopped parsley, thyme and a little flaky salt. From the moment the mixture is done, you won’t be able to stop eating it. But if you wait, it makes the perfect topping for green bean casserole, potato gratin, or macaroni and cheese. Sprinkle it atop mashed potatoes doused with gravy, or just put a bowl of it on the table and let people do with it what they will — they’ll probably end up putting some on every bite.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2021/11/17/dining/15unboringrex3-crunch/15unboringrex3-crunch-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 3 cups", "recipeCuisine": "", "recipeCategory": "", "keywords": "bread, rosemary, sage, shallot, fall, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 379}, "recipeIngredient": ["1/2 large loaf stale country bread, crusts removed and diced into 1-inch cubes (about 5 heaping cups)", "2 1/2 cups thinly sliced shallot rings (from about 7 shallots)", "2 cups neutral oil, such as canola or safflower, for frying", "Flaky sea salt", "12 sage leaves (from 2 to 3 sprigs)", "1/4 packed cup fresh rosemary leaves (from 4 to 5 sprigs)", "3 tablespoons finely chopped fresh flat-leaf parsley leaves (from about 1/3 large bunch)", "1 tablespoon finely chopped fresh thyme (from 8 to 9 sprigs)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, pulse the bread until no pieces larger than a pea remain. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 2 baking sheets with paper towels and set a fine-mesh strainer over a medium saucepan. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine shallots and oil in a second medium saucepan or a wok, and place over medium-high heat. Cook, stirring frequently, until shallots begin to bubble, about 2 minutes, then reduce heat to medium-low. With the shallots constantly bubbling — the constant bubble is key — continue frying. Stir regularly to ensure even cooking, until shallots turn pale golden brown, 24 to 28 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Quickly and carefully pour the shallots and the oil into the prepared strainer, draining the oil into the first saucepan. (The shallots will continue to carry over to a deep golden brown as they cool and crisp up.) Carefully spread out the shallots to cool onto one of the prepared trays and season lightly with salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reset the strainer over the now-empty pot and set aside. Place the saucepan with the strained oil over medium-high heat, and add a sage leaf to test the temperature. (Alternatively, use a thermometer to check that the oil is at 360 degrees.) When it sizzles, add the rest of the sage and the rosemary, and stir with a slotted spoon or spider. As soon as the bubbles subside, after 20 to 30 seconds, remove the herbs from the oil and spread them out onto the second baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the bread crumbs to the oil and stir. Cook, stirring constantly, until golden brown, 3 to 4 minutes, then quickly and carefully pour the bread crumbs and oil into the prepared strainer. Spread bread crumbs on the baking sheet beside the rosemary and sage. Season herbs and bread crumbs lightly with salt. Set aside and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, in a large bowl, toss together shallots, bread crumbs, crumbled fried herbs, parsley and thyme, and 3/4 teaspoon flaky salt. Taste and adjust seasoning as needed. Keep in an airtight container for up to 3 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022709-herby-fried-shallot-and-bread-crumb-crunch"}