{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Negimaki", "description": "Negimaki is a traditional Japanese dish consisting of thinly pounded meat that’s marinated in teriyaki sauce, wrapped around scallions and grilled. (Negi is the Japanese word for scallions; maki means roll.) Although beef is traditionally used for these tasty appetizers, <a href=\"https://cooking.nytimes.com/recipes/1013203-chicken-negimaki\">chicken</a> is a popular alternative. These can be assembled a few hours ahead and kept refrigerated until ready to grill. To make a complete meal, serve the negimaki with steamed rice and a simple green salad or roasted broccoli. Any leftovers can be chopped and tossed into fried rice the next day.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2021/12/03/dining/kc-beef-negimaki/merlin_197671455_445ac70d-2752-4a7f-bf2a-855d56a8fd9d-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "japanese", "recipeCategory": "meat", "keywords": "flank steak, scallion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 297}, "recipeIngredient": ["Salt", "12 scallions, trimmed and halved crosswise", "Ice", "1/3 cup soy sauce", "1/3 cup mirin", "1/3 cup sake", "1/3 cup turbinado sugar, or 1/4 cup granulated sugar", "1 pound flank steak (about a 6- to 7-inch square in size)", "Vegetable oil, for greasing grates"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan of salted boiling water, blanch lighter scallion ends for 1 minute, then add darker green scallion ends and blanch for 1 minute longer. Drain and transfer to a bowl of ice water to cool, then drain and transfer scallions to a paper towel-lined plate to remove excess water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine soy sauce, mirin, sake and sugar, stirring to dissolve most of the sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working on a cutting board, cut flank steak against the grain into 4 equal strips, then cut each strip in half for 8 equal square pieces of meat. Keeping your knife parallel to the cutting board, butterfly each square by horizontally slicing against the grain through the middle. (Leave it attached on one side; do not cut all the way through.) Carefully open it like a book. Each of the 8 pieces should be about 3 inches wide."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a meat mallet and working with one piece of meat at a time, cover each with plastic wrap and pound until 1/16-inch thick, creating rectangles that are about 5-by-6 inches. Transfer meat to the soy sauce marinade, turn to coat and let stand for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat grill to medium-high and grease the grates. (Alternatively, grease a grill pan or griddle to use on the stovetop.) Remove steak from marinade and transfer to a work surface. Transfer marinade to a small saucepan over medium-low and simmer until thickened, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, divide scallions among the 8 pieces of steak, arranging on one side along the shorter edge (scallions should be parallel to the grain). Tightly roll meat around the scallions and secure in two places with toothpicks where meat overlaps, threading the toothpicks parallel to the roll but not through the scallions in the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the negimaki, turning occasionally, until nicely charred and cooked through, reducing heat to medium halfway through, about 12 minutes. (If using a grill pan, heat on stovetop over medium-high and reduce heat to medium halfway through.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once negimaki are cooked, lightly brush them with some of the reduced glaze, then transfer to a cutting board. Remove toothpicks, cut negimaki into bite-size pieces and arrange on a serving platter. Drizzle with the remaining glaze, and serve warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022386-beef-negimaki"}