{"@context": "http://schema.org", "@type": "Recipe", "name": "Red-Cooked Beef Short Ribs", "description": "Traditional red-cooked dishes — they take their name from the mahogany color the sauce imparts to the meat — are simple braises of rice wine, light and dark soy sauces, with some sugar and aromatics. The version Jennifer Hwa Dobbertin and Quealy Watson serve at <a href=\"https://www.bestqualitydaughter.com/\">Best Quality Daughter</a>, their restaurant in San Antonio, turbocharges that formula. Dried chiles and Sichuan peppercorns bring fire and tingle, and star anise and cinnamon provide warmth. There’s a whisper of orange, a bite of ginger. Tomato paste and doubanjiang, a fermented chile bean paste, offer depth. Do take the time to use some of the braising liquid to serve as the base for the finishing glaze, thick and glossy as demi-glace. It’s worth it.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2021/04/16/magazine/16mag-eat/16mag-eat-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american, asian", "recipeCategory": "meat, main course", "keywords": "ginger, rice wine, short ribs, soy sauce", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 332}, "recipeIngredient": ["2 tablespoons neutral oil, like canola", "5 pounds bone-in short ribs, at least 1 1/2 inches thick", "1 (3-inch) piece fresh ginger, peeled and cut into thick slices", "2 cinnamon sticks", "8 dried Chinese chiles", "4 pieces dried orange peel (or fresh orange peel with no pith, well toasted)", "3 tablespoons Sichuan peppercorns, toasted, then crushed or ground (about 2 tablespoons)", "2 tablespoons whole black peppercorns", "2 whole star anise", "1 cup Shaoxing rice wine", "1 1/2 cups low-sodium soy sauce", "1/2 cup dark soy sauce", "1 packed cup light or dark brown sugar", "1 tablespoon molasses", "3 cups chicken stock", "3 cups braising liquid from the ribs", "2 medium white onions, peeled and thinly sliced", "1/4 cup tomato paste", "1/4 cup doubanjiang", "1/3 cup low-sodium soy sauce", "1/2 cup Shaoxing rice wine", "1 (1-inch) piece fresh ginger, peeled and cut into thick slices", "5 garlic cloves, roughly chopped", "1 teaspoon five-spice powder", "3 tablespoons cornstarch", "Bibb lettuce leaves", "Thai basil, chopped cilantro and sliced scallions", "Sliced cucumbers", "Cooked white rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Prepare the ribs: Heat oil in a large lidded Dutch oven over medium-high. Working in batches, sear short ribs on all sides until deeply and evenly browned, about 10 minutes per batch. Transfer browned short ribs to a large plate, and continue with remaining ribs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off all but 2 tablespoons of remaining fat, leaving the good browned bits behind. Reduce heat to medium. Add ginger, cinnamon, chiles, orange peel, Sichuan peppercorns, black peppercorns and star anise, and stir to get them coated in the fat. Cook for 2 to 3 minutes, stirring occasionally, until the ginger has started to soften."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice wine, soy sauces, sugar and molasses, then the chicken stock, and stir to combine. Using tongs, return short ribs to the pot, along with any juices that have accumulated, nestling them into the braising liquid bone-side up, so the meat is submerged. Bring to a simmer, then cover and transfer to oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, undisturbed, until short ribs are meltingly tender and falling off the bone (you should be able to shred the meat with a fork), 3 1/2 to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, remove the ribs from the pot and put them on a warm platter. Wrap tightly with aluminum foil and a couple of dish towels to keep them warm while you make the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sauce: Strain 3 cups of the braising liquid from the Dutch oven into another pot, discarding remaining braising liquid and solids. Set it over medium-high heat, and add the onions, tomato paste, doubanjiang, soy sauce, rice wine, ginger, garlic and five-spice powder; stir to combine. Bring to a boil, then cook, undisturbed, for 15 minutes, until reduced and thickened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the sauce through a colander back into the Dutch oven you used to cook the ribs, and place the pot over medium-high heat. Make a slurry of the cornstarch and 3 tablespoons water, then whisk it into the sauce to thicken, 1 to 2 minutes. You’re looking for something thick and glossy, like a demi-glace."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unwrap the ribs, daub them liberally with the sauce and serve with Bibb lettuce leaves, Thai basil, cilantro, scallions, cucumbers, rice and the remaining sauce."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022212-red-cooked-beef-short-ribs"}