{"@context": "http://schema.org", "@type": "Recipe", "name": "Farro and Mushroom Gratin", "description": "In this elegant gratin, nutty farro and earthy mushrooms are baked with herbs and mascarpone into a creamy casserole topped with Gruyère. It’s a rich, meatless meal that needs nothing more than a crisp green salad to round it out, though it’s also a satisfying side dish alongside roast chicken or fish. You can prepare the entire gratin earlier in the day (leave it at room temperature), then bake it just before serving — simply add a little extra time to ensure that it emerges from the oven steaming hot through and through. Note that if you’re using tangy crème fraîche instead of mascarpone, you may not need the lemon. Taste before squeezing.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/01/19/dining/14apperex/merlin_199987257_707af0b5-d669-453f-a246-037b0e803796-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 660}, "recipeIngredient": ["Salt and black pepper", "1 1/2 cups pearled or semi-pearled farro", "6 tablespoons extra-virgin olive oil, plus more as needed", "1 pound mixed mushrooms (such as oyster, maitake, portobello, shiitake or cremini), cut into 1 1/2-inch pieces", "6 to 8 fresh thyme sprigs", "1 cup thinly sliced shallots, leeks or onion", "1 cup mascarpone or crème fraîche", "1 cup chopped parsley leaves and tender stems, chives, mint or cilantro", "8 ounces shredded Gruyère (about 1 2/3 cups)", "Lemon wedges, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Bring a medium pot of well-salted water to a boil over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add farro to the pot, and cook according to package directions until tender (which should be about 20 to 30 minutes). Drain well in a colander. While still warm (and leaving the farro in the colander, if you like), drizzle the grains with enough olive oil to coat lightly, tossing well to prevent from sticking. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While farro is cooking, prepare the mushrooms: In a large ovenproof skillet, heat 3 tablespoons of the oil over medium-high until hot but not smoking. Add enough of the mushrooms to cover the skillet in one layer without crowding and half the thyme. Cook, undisturbed, until bottoms of the mushrooms are golden brown, 3 to 5 minutes. Stir and let brown on the other side, 2 to 3 minutes more. Use a slotted spoon to transfer mushrooms and thyme to a plate, and season with salt and pepper. Add another 2 tablespoons oil to the pan and repeat with another layer of mushrooms and thyme, adding them to the plate when done. Repeat with any more mushrooms if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 1 tablespoon oil to skillet and stir in shallots and a large pinch of salt and pepper. Sauté until tender and golden brown, 4 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove skillet from heat and return mushrooms to the pan (discarding the thyme sprigs). Stir in farro, mascarpone and 3/4 cup parsley. Taste and add more salt and pepper, if needed. Spread mixture evenly in the skillet and sprinkle Gruyère on top. Bake until the farro is hot and Gruyère is melted, 10 to 15 minutes. Turn on broiler and broil for 1 to 2 minutes until Gruyère starts to bubble and develop brown spots."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with remaining parsley and serve with lemon wedges for squeezing on top, if you’d like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022874-farro-and-mushroom-gratin"}