{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet and Sour Pork", "description": "At Mamahuhu, a Chinese takeout restaurant in San Francisco, a sense of history and appreciation for American Chinese cuisine is applied to a few classics. Mining historical Cantonese sweet-and-sour dish recipes for inspiration, Brandon Jew, a founder of the restaurant, and Noah Kopito, the head chef, created a sauce that incorporates pineapple, honey and dried hawthorn berries, which impart an earthy depth of flavor. The chefs use house-fermented Fresno chiles for a hint of heat, but a dab of commercially available sambal oelek will do. This dish can be made with chicken or cauliflower instead of pork; just skip the marinade if using cauliflower.", "author": {"@type": "Person", "name": "Cathy Erway"}, "image": "https://static01.nyt.com/images/2021/06/23/dining/21takeoutrex1/merlin_188667921_175bd57a-3006-4733-9302-27f73f7e9e75-articleLarge.jpg", "totalTime": "PT2H45M", "recipeYield": "4 servings", "recipeCuisine": "american, chinese", "recipeCategory": "dinner, meat, vegetables, main course", "keywords": "bell pepper, pineapple, pineapple juice, pork shoulder", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 277}, "recipeIngredient": ["3/4 pound boneless pork shoulder, cut into 1 1/4-inch chunks", "3 tablespoons Shaoxing rice wine", "1 teaspoon soy sauce", "1/2 teaspoon salt", "1/2 teaspoon cornstarch", "1/4 teaspoon ground white pepper", "2 tablespoons neutral oil, such as rice bran or canola", "2 teaspoons minced ginger", "1 teaspoon minced garlic", "1 1/2 tablespoons tomato paste", "1 1/4 cups rice vinegar", "1 cup pineapple juice", "3/4 cup honey", "1 tablespoon dried hawthorn berries (can be purchased in Asian groceries or online)", "2 teaspoons sambal oelek", "1/4 teaspoon five-spice powder", "1/2 teaspoon salt, plus more to taste", "1 tablespoon cornstarch", "1 quart neutral oil, such as rice bran, for deep-frying", "1 bell pepper (any color), cut into 1-inch pieces", "1/2 medium yellow onion, cut into 1-inch pieces", "8 ounces fresh pineapple, cut into 1-inch pieces (about 1 cup)", "Pinch of salt", "Steamed rice, for serving", "1/3 cup sweet rice flour (preferably Mochiko brand)", "1/3 cup cornstarch", "1/4 teaspoon baking powder", "1/4 teaspoon ground white pepper", "1/8 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pork: Combine the pork with all the marinade ingredients, mixing well. Cover and chill for at least 2 hours, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sweet and sour sauce: Heat the oil, ginger and garlic in a medium saucepan over low heat until fragrant, about 2 minutes. Stir in the tomato paste and cook for another minute, stirring. Add the rice vinegar, pineapple juice, honey, hawthorn berries, sambal oelek and five-spice powder; stir to combine while bringing to a boil over medium-high heat. Reduce heat to low and simmer, uncovered, for 15 minutes. Strain the sauce through a fine-mesh sieve and discard the solids; return to the saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the sauce to about 1 ¾ cups over medium-high heat, uncovered, about 5 minutes. Season with ½ teaspoon salt, adding more as desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine cornstarch with 2 tablespoons water. Bring the sauce up to a boil again, then stir in the cornstarch slurry. Stir as it thickens and bubbles, about 1 minute, then remove from heat. (Note: This sauce recipe may produce more than needed for your pork stir-fry; use as much as you desire and the rest can be saved for another use, such as a dipping sauce for <a href=\"https://cooking.nytimes.com/recipes/1022286\">crab rangoon</a>.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare to deep-fry: In a large wok (or deep skillet), heat the quart of oil to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine all the ingredients for the batter; add ½ cup water and whisk to combine. Drain any excess liquid from the marinated pork and discard. Working quickly in two batches, carefully dip each piece of pork into the batter one at a time, shaking off any excess, and drop into the oil. Fry the first batch of pork until golden brown, about 6 to 7 minutes. Using a spider or slotted spoon, transfer the fried pork to a wire rack-lined baking sheet to drain. Repeat with the remaining pork, mixing the batter thoroughly before coating the meat. After frying, carefully discard the oil, reserving 1 tablespoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the reserved 1 tablespoon of oil to the wok or pan and heat over high. Once the oil is popping, about 1 minute, add the bell pepper, onion, pineapple and a pinch of salt. Stir-fry for 1 to 2 minutes, until the vegetables are lightly charred in spots."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the vegetables into a large bowl and toss with the fried pork and enough sweet and sour sauce to coat (about 1 to 1 ½ cups). Arrange on a serving dish and serve with steamed rice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022285-sweet-and-sour-pork"}