{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Merguez and Onions With Mint-Lemon Couscous", "description": "In this summery salad, spicy merguez are grilled until seared, then served over a mound of couscous and vegetables that have been seasoned with herbs, cumin and plenty of lemon. Red onions wedges, grilled on one side only, are charred and caramelized in some parts while staying crisp and pungent in others. If you can’t get merguez (which are traditional North African sausages made from lamb, beef or a combination of both), you can substitute any other spicy sausages. Choose something with a bite to contrast with the juicy sweetness of fresh tomatoes and cucumbers. Note that those without grill access can easily use the broiler here.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/05/26/dining/21apperex-merguez/merlin_187777350_75341ba9-34ef-43a4-aa30-a8baa7db667e-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weekday, grains and rice, sausages, main course", "keywords": "couscous, merguez sausage, mint, parsley, radish, tomato, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 661}, "recipeIngredient": ["2 1/4 cups boiling water", "2 cups couscous (regular or whole wheat)", "1 1/2 teaspoons salt, plus more as needed", "2 lemons", "2 teaspoons ground cumin", "Freshly ground black pepper", "1/3 cup extra-virgin olive oil, plus more as needed", "1/2 cup thinly sliced radishes", "1 red onion, peeled and cut into 1 1/2-inch wedges", "8 ounces merguez (lamb or beef)", "1 cup halved cherry tomatoes", "1 cup roughly chopped mint leaves, plus more for garnish", "1 cup roughly chopped parsley leaves and stems, plus more for garnish", "1/2 cup thinly sliced cucumber", "1/4 cup toasted pine nuts or slivered almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the couscous: In a medium, heat-resistant bowl, combine boiling water, couscous and 1 teaspoon salt, and cover with a plate or lid. Let sit until the water is absorbed, 7 to 12 minutes. Fluff with a fork and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, light the grill to medium-high or heat your broiler with the rack 3 inches from the heat source."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve lemons crosswise and then squeeze the juice from one half into a large bowl. Add cumin, remaining 1/2 teaspoon salt and a few grinds of pepper. Slowly whisk in 1/3 cup olive oil. Stir in radishes and set aside to marinate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place onion wedges and remaining 3 lemon halves, cut-side down, in a grill basket and grill until charred on one side only, 2 to 4 minutes. Or place on a sheet pan and broil until charred, 5 minutes. Transfer onions and lemons to a cutting board."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Either on the grill, or on the same sheet pan as you used for the onions, grill or broil merguez until browned all over, 2 to 4 minutes per side. Transfer sausages to a cutting board and cover with foil to keep warm while you assemble the salad."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When onion is cool enough to handle, dice it and add to radishes. Fold in couscous, tomatoes, 1/2 cup mint, 1/2 cup parsley, cucumbers, nuts and a large pinch of salt. Squeeze the juice from a charred lemon half into the bowl. Taste and add more salt and lemon, if needed. Slice merguez on a bias into 1/2-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon couscous salad onto a platter, then top with sausages and any accumulated juices. Garnish with remaining herbs and a big drizzle of olive oil, and serve with remaining charred lemon halves on the side for more squeezing."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022246-grilled-merguez-and-onions-with-mint-lemon-couscous"}