{"@context": "http://schema.org", "@type": "Recipe", "name": "Ham Buns", "description": "Jennifer Owens doesn’t know where her mother, Frances, first found the recipe for these ham buns, but they have been a part of her life since childhood in Easley, S.C. It may have come from relatives in Tennessee, as a similar recipe appears as “Hallelujah Ham Loaves” in “Dinner on the Diner,” a 1983 cookbook from the Junior League of Chattanooga. The warm appetizer has won fans wherever Ms. Owens goes. Her mother’s original formula called for raw onions, but Ms. Owens now sautés them. Use good smoked ham, either holiday leftovers or from the deli counter. As the buns bake, the butter pools at the bottom, toasting up the base of these irresistible bite-size sandwiches.", "author": {"@type": "Person", "name": "Sara Bonisteel"}, "image": "https://static01.nyt.com/images/2021/04/01/dining/sb-ham-buns/sb-ham-buns--articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, finger foods, sandwiches, appetizer", "keywords": "bread rolls, butter, ham, mustard, onion, poppy seed, swiss cheese", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 681}, "recipeIngredient": ["1 cup unsalted butter (2 sticks), at room temperature, plus 1 tablespoon", "1 jumbo sweet onion, such as Vidalia, finely chopped (3 cups)", "4 flats of party rolls (see Tip)", "3 tablespoons yellow mustard", "3 tablespoons poppy seeds", "1 teaspoon Worcestershire sauce", "6 ounces Swiss cheese, grated (2 cups)", "1 pound smoked ham, finely chopped (3 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Position racks in top and bottom thirds of the oven and heat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1 tablespoon butter in a large skillet over medium heat and cook onion, stirring occasionally, until translucent, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the onion cooks, split each flat of rolls in half, running a bread knife parallel to the counter as you slice the still-connected rolls. Once the onion has finished cooking, remove from heat and set aside. Place two sheet pans in the oven, one on each rack, to heat while assembling the rolls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine mustard, poppy seeds and Worcestershire sauce. Add the remaining cup of butter and warm onion. Stir in cheese and ham until evenly combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a sheet of aluminum foil large enough to completely encase a flat of rolls, place one flat, and open like a book. Spread about a quarter of the ham mixture in an even layer over the bottom half of the rolls to the edges. Close the book, so to speak, laying the still-connected roll top over the ham-covered base. Wrap the rolls tightly with the foil, crimping the edges of the foil to enclose them. Repeat with the three other flats of party rolls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the four packets between the two heated sheet pans. Bake until the cheese melts and rolls get toasty, 10 to 12 minutes. Unwrap and serve the flats on platters, encouraging diners to pull a bun from its brethren."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022074-ham-buns"}