{"@context": "http://schema.org", "@type": "Recipe", "name": "Kunun Gyada (Spiced Peanut Rice Porridge)", "description": "Short-grain rice imparts a subtle sweetness to this creamy, peanutty blend. Aromatic cinnamon, nutmeg, ginger and cloves — or any other warming spices — meld into the comforting porridge, which is often served at the beginning or end of the day as a means of filling the gap between meals in northern Nigeria. Serve hot or room temperature, with a dab of tamarind purée for a bit of acid and some granulated sugar, honey or dates for sweetness. Or, mix the porridge with kefir for a drinkable version (see Tips).", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2021/04/09/dining/09IFTAR1/merlin_185988063_ad4f4e63-34c1-4aac-810d-b4295b7196bc-articleLarge.jpg", "totalTime": "PT4H40M", "recipeYield": "6 servings", "recipeCuisine": "african", "recipeCategory": "non-alcoholic drinks", "keywords": "grains of selim, peanut, tamarind, white rice, ramadan, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 408}, "recipeIngredient": ["2 cups shelled and skinned raw peanuts", "1/2 cup short-grain white rice, such as sushi rice", "4 selim seed pods (see Tips)", "1 teaspoon ground ginger", "3/4 teaspoon kosher salt", "1/2 teaspoon ground cinnamon, or 1 (3-inch) cinnamon stick", "1/4 teaspoon grated nutmeg", "1/4 teaspoon ground cayenne or 1 whole dried cayenne pepper", "1/8 teaspoon ground cloves or 1/4 teaspoon whole cloves", "Tamarind paste (see Tips) and granulated sugar, honey or chopped dates, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the raw peanuts and rice in separate bowls, and add enough water to cover each by 2 inches. Soak at room temperature for at least 1 hour and up to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the peanuts and transfer to a blender. Pour in 2 cups room-temperature water and purée on high speed until smooth. Strain the liquid through a fine-mesh strainer or a sieve lined with muslin or two layers of cheesecloth, into a medium pot. Return the solids to the blender and combine with another 2 cups room-temperature water. Blend on high until puréed. Repeat the straining process, pressing on the solids to extract as much liquid as possible. The remaining solids should be dry and crumbly. Discard the solids. You should have 4 cups of peanut milk in the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the rice and transfer to the blender (no need to wash). Pour in 2 cups room-temperature water and purée on high to grind the rice until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the pot of peanut milk, add the selim seed pods, ginger, salt, cinnamon, nutmeg, cayenne and cloves. Heat the milk and spices over medium, whisking frequently, until steam begins to rise from the surface, about 6 minutes. If using ground spices, continue to the next step. If using whole spices, including selim pods, turn off the heat, cover and allow the spices to steep for up to 10 minutes. Remove the spices with a slotted spoon after steeping."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to medium-low and whisk in the ground rice purée. Cook, stirring frequently until the mixture is thick enough for your whisk to leave a faint line as you drag it across the surface and any bubbles slowly rise to the surface, 8 minutes. Cover and simmer without stirring for about 4 minutes to fully cook the ground rice. Any coarse ground rice should be cooked through and soft, not starchy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the porridge in bowls that are warm or at room temperature. Top with a spoonful of tamarind paste for a slightly tangy finish and sweeten with granulated sugar, honey or chopped dates."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022084-kunun-gyada-spiced-peanut-rice-porridge"}