{"@context": "http://schema.org", "@type": "Recipe", "name": "Uncle Glenn’s Onaga (Steamed Red Snapper With Somen)", "description": "In Hawaii, onaga is the most prized kind of snapper and the centerpiece of festive meals. Glenn Yamashita steams the whole fish, Chinese-style, with a sour-salty stuffing, a topping of preserved vegetables and a tumble of aromatics. Two of the ingredients are readily available in Hawaii but may require more of a search elsewhere: chung choi, salted turnip wrapped in its own leaves — pickled mustard greens are a fine substitute — and scallop powder, which can be approximated with fish sauce. Skeins of Japanese somen noodles are tucked beneath the fish and hot oil poured over at the end. Done right, it crackles.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2022/01/23/magazine/23mag-eat-site/23mag-eat-site-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, seafood, main course", "keywords": "christmas, new year’s day, red snapper, somen", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 114}, "recipeIngredient": ["2 garlic cloves, crushed", "1/4 cup peanut oil", "1 whole red snapper or other whole mild white fish (2 1/2 to 3 pounds), gutted and scaled, head and tail left on (see Tip)", "2 bundles somen (about 7 ounces) ", "1 small celery stalk, cut into very thin matchsticks", "1 small carrot, peeled and cut into very thin matchsticks", "3 scallions, cut into very thin matchsticks", "1/2 small white onion, cut into very thin matchsticks", "1 small bunch cilantro, leaves coarsely chopped, stems minced", "1 ball (about 1 1/4 ounces) chung choi (salted preserved turnip), rinsed, squeezed dry and finely chopped (3 tablespoons; see Tip)", "1 (3-inch) piece fresh ginger, peeled and minced (1/3 cup)", "1 teaspoon oyster sauce", "1 teaspoon scallop powder mixed with water to make a thin paste, or 1 teaspoon fish sauce ", "1 tablespoon soy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before cooking, submerge the garlic in the oil in a small container. Cover and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, check the fish for any remaining scales and scrape off, paying special attention to the head and tail. Rinse the fish and pat dry. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil the somen according to the package instructions, rinsing and draining well. While the noodles are still damp, arrange them on a serving platter and cover with plastic wrap."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Loosely toss together the celery, carrot, scallions, onion and cilantro leaves in a small mixing bowl. Set aside at room temperature (if refrigerated, the hot oil added at the end won’t sizzle). In another small bowl, mix the chung choi, ginger and cilantro stems, and stuff 1/2 cup of the mixture inside the fish cavity, including the head. Pat the remaining few tablespoons over both sides of the fish’s body."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a steamer rack or other metal rack inside a wok or roasting pan large enough to accomodate the fish and set on the stove, straddling two burners if needed. Have ready the wok’s lid or sheets of foil large enough to cover the roasting pan tightly. Add enough water to come up to the rack (1 to 1 1/2 inches). Bring the water to a boil over high heat. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, stack 2 sheets of heavy-duty aluminum foil large enough to hold the fish. Turn up and crimp the foil at the edges to create a boat just large enough to fit the fish. The raised edges will catch the drippings, which will make the sauce. Put the foil boat on the rack over the boiling water, then lay the stuffed fish on the foil. Cover with a lid or tightly with foil and let steam for 15 to 18 minutes (6 minutes per pound). Don’t lift the lid to check on the fish, as this will cause the temperature to drop. Adjust the temperature as needed if the lid begins to clatter. Uncover and check to see if the fish is done: The eyes should be white and bulging, the mouth slightly agape and a chopstick inserted into the flesh should slide in easily. Turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using two long spatulas, gently transfer the fish to the somen platter, laying it on top of the noodles. Lift the foil boat out of the steamer, careful not to spill any sauce, and pour the sauce into a small bowl. Add the oyster sauce and scallop powder (or fish sauce) and stir. Pour the sauce over the fish, then cover the fish with the vegetable and herb garnish. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the reserved garlic oil into a small saucepan. Heat over high until the garlic turns golden brown, 2 to 3 minutes. Turn off the heat and discard the garlic. Slosh the soy sauce over the garnished fish, then carefully pour on the hot garlic oil, letting it sizzle. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022875-uncle-glenns-onaga-steamed-red-snapper-with-somen"}