{"@context": "http://schema.org", "@type": "Recipe", "name": "Low-Knead Bread", "description": "This recipe produces a loaf of bread with significantly improved hole structure and flavor compared with this <a href=\"https://cooking.nytimes.com/recipes/1022147-no-knead-bread\">no-knead version</a> (inspired by <a href=\"https://cooking.nytimes.com/recipes/11376-no-knead-bread\">Jim Lahey’s original no-knead bread recipe</a>), and requires not much extra work. Increasing the water content produces bread with a more custardy crumb and a more open, holey structure. Adding a few turns during the initial fermentation stage gives this wetter dough strength, letting it better retain its hole structure as it’s shaped. The low, slow fermentation in the fridge allows for lots of flexibility, as the dough can rest there for up to three days before you decide to shape and bake it. Dough flavor and texture will improve with time, though after three days the flour may start oxidizing, producing unattractive gray spots. (If you're looking to make sandwiches, we also have a <a href=\"https://cooking.nytimes.com/recipes/1022149-low-knead-sandwich-bread\">recipe for low-knead sandwich bread</a>.)", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2021/05/05/dining/03Kenjirex2/merlin_186913383_1f91b6ab-1ccd-4d4b-b892-defc19633901-articleLarge.jpg", "totalTime": "P3DT4H", "recipeYield": "1 loaf", "recipeCuisine": "american", "recipeCategory": "breads", "keywords": "bread flour, instant yeast", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 542}, "recipeIngredient": ["400 grams bread flour (about 2 2/3 level cups; see Tip)", "8 grams salt (about 1 1/2 teaspoons table salt, 2 teaspoons Morton kosher salt, or 2 1/2 teaspoons Diamond Crystal kosher salt)", "2 grams instant or “rapid rise” yeast (about 1/2 teaspoon; see Tip)", "300 grams warm water (about 1 1/4 cups)", "1/8 teaspoon white vinegar or lemon juice", "Rice flour or extra bread flour, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the dough: Combine the flour, salt and yeast in a large bowl and mix with your hands until mostly homogenous. Combine the water and vinegar or lemon juice, then add to the bowl. Form one hand into a stiff claw, and stir with it until no dry flour remains and the dough forms a sticky, shaggy ball. Roll the ball around the bowl until most of the dough is part of the same large mass. The mixing process should take no more than 30 to 45 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape your dough-covered hand with your clean hand to get most of the dough into the bowl, then invert a tall-sided medium metal or glass bowl and place it on top of the large bowl, tapping it to ensure a tight seal. Allow the dough to rest for 20 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the dough: After the dough has rested, remove the inverted bowl. The dough should look very wet and sloppy. Dip your hands briefly in a bowl of water, then shake off the excess. Using one hand, scoop your fingers under one side of the dough to the very bottom of the bowl and, working quickly, lift that side, stretch it a few inches, and fold it over to the opposite side. Rotate the bowl and repeat, 4 to 6 times, until you’ve worked all the way around the dough. (The dough will become noticeably tighter and a little more difficult to stretch with each fold.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lift the dough and flip it over. Cover the bowl with the inverted bowl and allow to continue resting. Repeat this every 20 to 40 minutes within the first 2 to 3 hours. (No need to be very precise with timing at this stage.) By the last folding step, the dough should be significantly smoother and tighter and resemble a more traditional (albeit slack) bread dough. Cover with the inverted bowl (or a cutting board) then transfer to the refrigerator and let rest at least overnight and up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the loaf: At least 3 hours and up to 10 hours before baking, remove the dough from the fridge and let it rest at room temperature. (It will initially start to rise but may collapse a little bit as it expands. This is OK.) Two hours before baking, wipe out any moisture collected on the inside of the medium bowl, dust a dish towel thoroughly on one side with rice flour or bread flour, then line the medium bowl with the towel, floured-side up. Generously flour your work surface. Sprinkle flour around the edges of the dough in the large bowl, then tilt the bowl vertically over your work surface, using your fingertips to ease the dough away from the bowl until it all tips out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working gently but quickly, fold in the edges of the dough one last time. Using the sides of your hands instead of your fingertips, and as much extra flour as necessary to prevent sticking, flip the dough over. With your palms up and hands placed flat on the work surface, gently tuck the dough together underneath until the top surface is relatively smooth and taut."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Proof the loaf: Carefully lift the dough and place it smooth-side up into the towel-lined bowl. Cover the bowl with a large inverted baking sheet and allow the dough ball to rise until it roughly doubles in volume and doesn’t spring back readily when you poke it with a fingertip, about 2 hours. Meanwhile, wash out the large bowl and have it ready."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven: At least 30 minutes before baking, adjust the oven rack to the lower-middle position and heat your oven to 500 degrees. When dough is ready, invert the bowl and baking sheet so that the dough is lying on the sheet. (The sheet will end up inverted.) Lift off the bowl and carefully lift off the kitchen towel. If it sticks at all, be very gentle when coaxing the dough off; the goal is to minimize the loss of gases trapped inside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the bread: Splash some water into the inside of the larger metal bowl, then invert it onto the baking sheet over the dough ball. Transfer the whole thing to the oven, reduce oven temperature to 450 degrees and bake for 25 minutes. Using oven mitts or dry kitchen towels, remove the bowl and continue baking until the loaf is as dark as you’d like it, 15 to 25 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bread, transfer to a cooling rack, and allow to cool completely before cutting it open."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022148-low-knead-bread"}