{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetarian Bolognese", "description": "Unlike a traditional Bolognese sauce, this riff on the classic has no meat and isn’t simmered for hours, but the results are still rich, buttery and sweet. Mild cauliflower and soffrito — the carrot, celery and onion mix that is the traditional base of the the sauce — become the bulk. Tomato paste and soy sauce are toasted to build umami. Then, everything is braised with whole milk, which softens the vegetables and adds silkiness. Swap the cauliflower for broccoli, mushrooms, cabbage, eggplant, or even green lentils, chickpeas or crumbled tempeh. To make it vegan, swap 2 tablespoons oil for butter in Step 1, use nondairy milk, and swap 3 tablespoons nutritional yeast for Parmesan.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2021/04/28/dining/as-cauliflower-bolognese/merlin_184703172_e604857b-4fa2-481f-9f35-05a772150362-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, pastas, vegetables, main course", "keywords": "butter, cauliflower, onion, pasta, soy sauce, tomato paste, whole milk, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1332}, "recipeIngredient": ["Kosher salt and black pepper", "3 tablespoons unsalted butter", "2 tablespoons extra-virgin olive oil", "1 large yellow onion, roughly chopped into 1/4-inch pieces", "2 medium carrots, roughly chopped into 1/4-inch pieces", "1 medium (1 to 1 1/2-pound) cauliflower, stem and head coarsely chopped into pieces no bigger than 1/2 inch", "1/4 cup tomato paste", "2 tablespoons low-sodium soy sauce", "4 garlic cloves, coarsely chopped", "3/4 cup whole milk", "1 fresh bay leaf or thyme sprig", "1 pound rigatoni or another ridged dried pasta, or fresh pappardelle or tagliatelle", "1/2 cup finely grated Parmesan, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Meanwhile, in a large Dutch oven, melt 2 tablespoons butter with the olive oil over medium-high. When foaming, add the onion, carrots and cauliflower, season with 1 teaspoon salt and a few pepper grinds. Cook, stirring just once or twice, until browned and juicy, 5 to 7 minutes. Add the tomato paste, soy sauce and garlic and cook, stirring and smashing the vegetables, until the tomato paste is a shade darker and sticks to the bottom of the pot, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the milk and bay leaf, season with salt and pepper, reduce heat to low, and stir to combine, scraping up browned bits from the pot. Cover and cook, stirring occasionally, until the milk has thickened slightly and the vegetables are very soft, 15 to 20 minutes. (At first the pan will look dry, then the vegetable liquid will thin the sauce and it will thicken slightly)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Halfway through cooking the sauce, add the pasta to the boiling water and cook until al dente. Reserve 1 cup pasta water and drain. If the sauce is ready before the pasta, remove sauce from heat and keep covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bay leaf from the sauce. Season to taste with salt and pepper. Increase heat to medium-high. Add the pasta, 1/2 cup pasta water, the Parmesan and the remaining 1 tablespoon butter. Stir vigorously until the pasta is well coated, adding more pasta water as needed until the sauce is glossy. Season to taste with salt and pepper, and serve with more grated Parmesan on top."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022154-vegetarian-bolognese"}