{"@context": "http://schema.org", "@type": "Recipe", "name": "Singapore Noodles With Charred Scallions", "description": "While this dish is named for Singapore, it was not created there. Many believe it was invented in Hong Kong, in the 1950s or 1960s, by chefs seeking to add a different flavor profile to Cantonese dishes. It is now a much loved dish at cha chaan tengs, a type of cafe in Hong Kong, and at Cantonese eateries across the world. The original features meat, eggs and vegetables, but this vegetarian version showcases charred scallions, which add sweetness. Peppers are often included, but you could use carrots, cabbage, cauliflower or any thinly sliced vegetable that can be cooked in 3 to 4 minutes. The technique of “blooming” the curry powder in the oil ensures that the vermicelli is silky rather than gritty. Use a curry powder that has turmeric listed as one of the first ingredients, as it lends a lovely golden color to the noodles. (You can add ½ teaspoon of turmeric powder to a commercial curry powder if you want to ensure a bright hue.)\n \nTo get vegetarian recipes like this one delivered to your inbox, <a href=\"https://www.nytimes.com/newsletters/the-veggie\">sign up for The Veggie newsletter</a>.", "author": {"@type": "Person", "name": "Hetty McKinnon"}, "image": "https://static01.nyt.com/images/2021/09/28/dining/HM-Singapore-Noodles-With-Charred-Scallions-reshoot/merlin_195007206_7e39cbe3-a322-4b76-a7e2-c7acad701b90-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "noodles", "keywords": "egg, scallion, turmeric, vermicelli, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1036}, "recipeIngredient": ["4 eggs, lightly beaten", "Kosher salt", "Neutral oil, such as vegetable or grapeseed", "1 bunch scallions (about 8 to 10)", "2 bell peppers (any color), cut lengthwise into ¼-inch slices", "2 garlic cloves, finely chopped", "1 tablespoon curry powder", "10 ounces rice vermicelli, soaked in warm water for 5 to 10 minutes and drained", "2 tablespoon soy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season eggs with ½ teaspoon of kosher salt, and whisk well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of oil in a large (12-inch) skillet or wok over medium-high, and, once hot, swirl the oil around and pour in the egg mixture. Allow the egg to set before pushing the egg to one side and tilting the pan to the opposite side. Cook this way until the egg is just set. Break the egg into large chunks (they’ll break up into smaller pieces on their own), remove from pan and set aside. Wipe out the pan if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the scallions by separating the white and green parts. Halve the white sections vertically so they are thinner, then cut into 2-inch segments. Cut the green parts into 2-inch segments."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, heat 1 tablespoon of oil over medium-high, add the peppers and stir-fry for 2 to 3 minutes until softened. Add the garlic, then add the white parts of the scallions in stages. As the scallions wilt, add more and cook until charred, another 2 minutes. Remove from the pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the skillet to the stovetop, reduce heat to medium and add 3 tablespoons of oil. Add the curry powder and 2 teaspoons of kosher salt, and stir vigorously to dissolve the curry powder, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase heat to medium-high, add the drained vermicelli and ¼ cup of water, and drizzle with another 1 to 2 tablespoons of oil. Using tongs or long wooden chopsticks, toss the noodles well, ensuring that they are well coated in the curry mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the soy sauce and toss for 3 to 5 minutes, until the noodles are tender. Add the peppers, scallion whites and egg back to the pan, along with the scallion greens, and stir-fry for 1 to 2 minutes until the greens are wilted. Taste and season with more salt, if required."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022564-singapore-noodles-with-charred-scallions"}