{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Chicken With Silky Peppers and Green Olives", "description": "Made with diced fresh tomato and colorful sweet bell peppers, this savory chicken dish is lively and bright. Cooked as written, the sauce is on the brothy side, perfect for pouring over rice or couscous, or for sopping up with bread. But if you prefer it to be heartier, remove the chicken pieces from the pan once they’re cooked, then simmer to reduce the sauce, stirring occasionally, for another 5 to 8 minutes. Return chicken to the pan and stir in olives, then garnish with herbs to serve.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/10/13/dining/08Apperex-chicken1/08Apperex-chicken1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "weekday, poultry, main course", "keywords": "bell pepper, chicken thighs, olives", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 874}, "recipeIngredient": ["2 1/4 pounds bone-in, skin-on chicken thighs", "2 tablespoons finely chopped fresh oregano (or 2 teaspoons dried)", "2 teaspoons kosher salt (Diamond Crystal), plus more to taste", "1/2 teaspoon freshly ground black pepper", "2 red, yellow or orange bell peppers (or a combination of colors)", "5 garlic cloves", "1 medium fresh tomato", "2 tablespoons extra-virgin olive oil, plus more as needed", "1/8 teaspoon red-pepper flakes", "3/4 cup pitted, roughly chopped green olives, such as Castelvetrano", "1/2 cup roughly chopped fresh parsley, basil, cilantro or a combination", "Lemon wedges, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat chicken dry with paper towels. Season all over with 1 tablespoon oregano, 1 1/2 teaspoons salt and 1/2 teaspoon black pepper. Set aside at room temperature while preparing the vegetables (or refrigerate for up to 24 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the peppers into 1/4-inch strips, removing the seeds. Peel and thinly slice the garlic cloves. Chop the tomato."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat 1 tablespoon oil over medium-high. When the oil thins out and coats the bottom of the pan, add chicken, skin side down, and sear until browned on both sides, 4 to 6 minutes per side. Do this in batches if necessary; don’t crowd the pan. Transfer the chicken pieces to a plate as they brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 1 tablespoon oil to the skillet and stir in peppers. Sauté until tender and lightly browned, 6 to 8 minutes. Add garlic, remaining oregano and red-pepper flakes, and cook until garlic is lightly golden, 2 to 3 minutes. Stir in tomato and remaining 1/2 teaspoon salt, and cook until tomatoes begin to release their juices, 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower heat to a simmer and nestle in the browned chicken, skin side up, pouring in any accumulated juices from the plate. Partly cover the pan and cook until chicken is cooked through and peppers are soft and stewy, 20 to 30 minutes. Taste and add more salt if needed. In the last minute or two of cooking, stir in olives to let them heat up. Remove from heat, and sprinkle parsley or other herbs on top. Garnish with lemon wedges, if you like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022611-skillet-chicken-with-silky-peppers-and-green-olives"}