{"@context": "http://schema.org", "@type": "Recipe", "name": "Sponge Cake", "description": "The streamlined mixing technique for this versatile cake, which is leavened with only eggs, borrows from génoise, chiffon cake and a style of roll cakes popular in Asian bakeries. The result is an airy, light-as-a-feather texture that’s also moist, thanks to the addition of oil. Bake it in a jelly roll pan <a href=\"https://cooking.nytimes.com/recipes/1022271-raspberry-and-cream-roulade\">to create a roulade</a>, or in a 9-inch springform pan <a href=\"https://cooking.nytimes.com/recipes/1022272-strawberry-and-cream-layer-cake\">for a layer cake</a>, but don’t use a nonstick pan, as the cake will collapse. The 9-inch cake needs nothing more than a little whipped cream on top. Any kind of macerated fruit would be perfect, but ultimately a bonus. (Watch Claire <a href=\"https://www.youtube.com/watch?v=N4nvGZTC9RE\">make this cake and two others</a> on YouTube.)", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2021/05/27/dining/cs-sponge-cake/merlin_188067723_c149734b-f3b2-42ee-909f-fcc085c938b9-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "One 9-inch or 10-by-15-inch cake", "recipeCuisine": "", "recipeCategory": "cakes, dessert", "keywords": "cake flour, eggs, make-ahead, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1638}, "recipeIngredient": ["1/4 cup/50 grams olive or vegetable oil, plus more for greasing if baking in a jelly roll pan", "4 large eggs, separated, at room temperature", "1/2 cup/100 grams granulated sugar", "1/2 teaspoon kosher salt", "1/4 teaspoon cream of tartar", "2/3 cup/85 grams cake flour", "2 teaspoons vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange an oven rack in the center of the oven and heat the oven to 325 degrees. If making a roulade, brush the bottom of a 10-by-15-inch jelly roll pan with a light coating of oil. Do not brush the sides, as the cake needs to be able to cling to the pan as it rises. Line only the bottom of the pan with a piece of parchment paper, smoothing to eliminate air bubbles. If baking in a 9-inch springform pan, leave the pan ungreased and unlined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide, medium bowl, combine the egg whites, 1/4 cup sugar, the kosher salt and cream of tartar. Beat the mixture with a hand mixer fitted with the beaters on medium-low speed until the mixture looks frothy, then start to slowly increase the speed to medium-high. Continue to beat the egg whites until you have a dense, voluminous, glossy foam that forms stiff peaks, about 4 minutes. When you lift the beaters out of the bowl, the egg whites should come to a straight point that doesn’t droop. Don’t beat beyond this point, or the whites will become dry and lumpy. Set the bowl aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate wide bowl, combine the egg yolks and the remaining 1/4 cup sugar. Beat with the hand mixer (no need to wash it after you beat the egg whites) on medium-high until the mixture is very pale and fluffy and forms a slowly dissolving ribbon as it falls off the beaters back into the bowl, about 4 minutes. Slowly stream in the 1/4 cup oil, beating constantly to ensure it emulsifies into the yolk mixture, until you have a smooth, light mixture that looks like mayonnaise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the mixer to the lowest speed, add half of the flour and mix just until incorporated. Add the vanilla extract and 1 tablespoon water, mix until incorporated, then add the remaining flour and mix just until it disappears. The mixture will have thickened and look a bit like cake batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the yolk mixture once or twice with a large flexible spatula to make sure it’s evenly mixed, then scrape about a third of the egg white mixture into the yolk mixture and thoroughly fold in the whites until the mixture is loosened. Working more gently, fold in half of the remaining egg whites until only a few streaks remain. Fold in the remaining whites, scraping the bottom and sides of the bowl, until you have a light, smooth, evenly mixed batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the batter into the pan and smooth into an even layer. Firmly rap the pan on the surface once or twice to pop any large air bubbles. Bake the cake until it’s golden brown, firm and springy to the touch across the entire surface, 25 to 30 minutes for a jelly roll and 30 to 35 minutes for a 9-inch cake. Remove the cake from the oven and immediately invert the pan onto a wire rack. Let the cake cool completely upside down to prevent it from collapsing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reinvert the cooled pan and cut along the sides with a small offset spatula or paring knife to loosen the cake. It will sink a bit, which is normal. If making a jelly roll, turn the sponge out onto the wire rack and peel off the parchment. If making a 9-inch cake, remove the ring of the springform pan, invert the cake onto the rack, and carefully peel off the bottom of the pan (it should come away cleanly, leaving behind just a thin film)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the sponge as desired. The unfilled sponge cake will keep at room temperature, tightly wrapped, for several days, but will become sticky after the first day."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022270-sponge-cake"}