{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato Galette", "description": "Every part of this simple galette has its charms. The crust is easy to pull together and since it’s rolled out flat — no crimping or fluting — it’s doable even if you’re not a pie-hand. The topping is thin slices of sweet potato and apple brushed with maple syrup. And the filling is a hidden gem, a mix of cream cheese, Parmesan and maple syrup spiked with chile powder. Here, it’s piment d’Ville, a California chile grown from the seeds of piment d’Espelette, native to French Basque Country. This type of chile is warm and toasty, a little hot and a little sweet and a jazzy partner that swings sweet and savory, just like the rest of the galette.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2021/10/07/magazine/07mag-eat-site/07mag-eat-site-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, pies and tarts, appetizer, main course", "keywords": "apple, pie pastry, sweet potato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 301}, "recipeIngredient": ["1 1/2 cups/192 grams all-purpose flour", "2 tablespoons granulated sugar", "1/2 teaspoon fine sea salt", "8 tablespoons/113 grams very cold unsalted butter, cut into 16 pieces", "About 1/4 cup/60 milliliters ice water", "3 ounces/85 grams cream cheese, at room temperature", "3 tablespoons grated Parmesan, plus more for sprinkling", "1 tablespoon milk", "1 tablespoon plus 2 teaspoons pure maple syrup", "1 to 2 teaspoons piment d’Ville, piment d'Espelette or other ground red chile", "1/2 teaspoon fine sea salt", "1 medium sweet potato, scrubbed and dried", "1 medium red apple, rinsed and dried", "1 tablespoon olive oil", "2 to 3 tablespoons chopped pecans, for sprinkling (optional)", "Snipped chives, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Pulse the flour, sugar and salt in a food processor to mix. While pulsing, drop the butter through the feed tube. Continue pulsing, scraping the bowl occasionally, until the mixture looks like coarse meal dotted with small and large chunks. Add water a little at a time, mixing in short and longer pulses between additions, until bumpy curds form. They should hold together when pinched. Press the dough into a ball, then flatten into a disk and place between parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the dough into a circle a bit larger than 11 inches in diameter, then trim to 11 inches; prick all over with a fork. Refrigerate between parchment on a baking sheet for at least 2 hours (or freeze for 1 hour)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven and heat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the chilled crust (still between parchment on the baking sheet) with another baking sheet. Bake for 15 minutes, remove the top baking sheet and parchment paper and bake for another 8 minutes or so, until lightly golden. Set aside. (You can make this up to 8 hours ahead.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the galette: In a medium bowl, with a flexible spatula, beat together the cream cheese, Parmesan, milk, 2 teaspoons maple syrup, 1 teaspoon chile powder and the salt. Taste and add more chile, if you’d like. (It will get hotter when it bakes.) Cut the potato and the apple into very thin rounds using a mandoline or sharp knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While you don’t want the cheese mixture to completely cover the crust, you do want the potato and apple slices to go right to the edge of the crust, so spread the cheese mixture over the crust, leaving a 1/2-inch border. Then, cover the entire crust with the potato and apple slices in slightly overlapping concentric circles. (You may have some slices left.) Mix together the remaining 1 tablespoon of maple syrup, the oil and 1/4 teaspoon chile powder. Brush this mixture over the galette (just gloss the top — you might not need all of the mixture). Sprinkle with Parmesan and pecans, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for about 20 minutes, or until the potatoes are softened and cooked through (test with the point of a knife). Scatter with chives, if using, and let cool for at least 10 minutes before serving. The galette is also good warm or at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022717-sweet-potato-galette"}