{"@context": "http://schema.org", "@type": "Recipe", "name": "Minty Lime Bars", "description": "These rich yet refreshing lime bars are for citrus lovers who appreciate puckering acidity in their desserts. The curd filling contains a bit of cornstarch, so it sets firmly in the oven, allowing you to slice, stack and store the bars easily. A little fresh mint inside the shortbread crust — which is made entirely by hand — adds an herbal complement to the lime.", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2021/12/08/dining/08COOKIESREX3-LIMEBAR/merlin_198248754_cb938f1b-fd1d-4876-a04a-86abd0d4c399-mediumThreeByTwo440.jpg", "totalTime": "PT2H30M", "recipeYield": "16 bars", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "bar cookie, christmas cookie, lemon, lime, mint, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 405}, "recipeIngredient": ["Unsalted butter, for greasing the pan", "2 tablespoons finely grated lime zest (from about 3 limes)", "1/4 cup/50 grams granulated sugar ", "1 cup/130 grams all-purpose flour", "2 packed tablespoons finely chopped fresh mint", "1/4 teaspoon baking powder", "Pinch of kosher salt (Diamond Crystal)", "1/2 cup/113 grams cold unsalted butter, cut into ½-inch pieces", "3/4 cup/170 grams fresh lime juice (from about 7 limes)", "1/4 cup/57 grams fresh lemon juice (from about 1 large lemon)", "1 teaspoon cornstarch", "Pinch of kosher salt (Diamond Crystal)", "1 cup/200 grams granulated sugar", "5 large egg yolks", "1 large egg", "6 tablespoons/85 grams cold unsalted butter, cut into tablespoons", "Confectioners’ sugar and finely grated lime zest, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange an oven rack in the center position and heat the oven to 350 degrees. Line an 8-inch square pan, preferably metal, with 2 sheets of aluminum foil, crossing one over the other and pressing the foil into the corners and up the sides. Butter the bottom and sides of the foil, and set the pan aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the shortbread crust: In a medium bowl, use your fingertips to massage the lime zest into the sugar until the fragrant oils are released and the mixture looks like wet sand. Add the flour, chopped mint, baking powder and salt, and toss to combine. Add the ½-inch pieces of chilled butter and toss to coat in the flour mixture. Use your fingertips to smash the butter into the flour mixture, working until no large pieces remain and you have lots of moist crumbs that hold together easily when squeezed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the crust: Scatter the shortbread dough evenly across the bottom of the prepared pan. Use your hands to flatten the crumbs into an even layer, working it into the corners and against the sides. Bake the shortbread until lightly golden across the surface, about 30 minutes. Remove the pan from the oven. (Leave the oven on and reduce the temperature to 300 degrees.) Let the crust cool while you make the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the lime curd filling: In a small saucepan, combine the lime juice, lemon juice, cornstarch, salt and ½ cup/100 grams of the granulated sugar, and cook over medium heat, whisking occasionally, to dissolve the sugar. When the mixture comes to a boil, whisk constantly until it thickens slightly from the cornstarch, about 1 minute, then remove the saucepan from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, vigorously whisk the egg yolks, whole egg and remaining ½ cup/100 grams sugar until the mixture is smooth, thick and has paled in color a couple of shades, about 1 minute. Whisking constantly, slowly drizzle the hot citrus mixture into the eggs a tablespoon at a time to slowly raise the temperature, until you’ve added about half the citrus mixture to the eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the egg mixture back into the saucepan, then set back over medium-low heat and cook, whisking constantly, until the curd turns opaque, is thick enough to coat the back of a spoon and barely hold the marks of the whisk (it will register 170 degrees on an instant-read thermometer), about 5 minutes. Remove the curd from the heat and whisk in the butter a piece at a time, waiting until each piece melts before adding the next, until the mixture is smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the bars: Pour the hot curd over the crust and shake the pan gently so it settles in an even layer. Bake the bars until the sides have puffed and the center is set but still a bit wobbly when you shake the pan, 30 to 35 minutes. Remove from the oven and let the bars cool completely in the pan"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill before serving: Transfer the cooled pan to the refrigerator and chill until the bottom of the pan is cold to the touch, about 1 hour. This will harden the butter in both the curd and crust, making it easier to remove the bars from the pan and slice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the edges of the foil to lift the bars out of the pan, then peel down the sides of the foil and slide a metal spatula underneath to loosen the crust from the foil. Slide the bars off the foil onto a cutting board and slice into 16 squares. Dust with confectioners’ sugar and top with more lime zest before serving. They are best eaten on the first or second day, but will keep for up to 5 days stored in an airtight container in the refrigerator."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Minty Lime Bars", "description": "These rich yet refreshing lime bars are for citrus lovers who appreciate puckering acidity in their desserts. The curd filling contains a bit of cornstarch, so it sets firmly in the oven, allowing you to slice, stack and store the bars easily. A little fresh mint inside the shortbread crust — which is made entirely by hand — adds an herbal complement to the lime.", "thumbnailUrl": "https://static01.nyt.com/images/2021/12/08/dining/08COOKIESREX3-LIMEBAR/merlin_198248754_cb938f1b-fd1d-4876-a04a-86abd0d4c399-mediumThreeByTwo440.jpg", "uploadDate": "2022-12-16T19:03:31.126Z", "duration": "PT11M45S", "transcript": "", "contentUrl": "https://vp.nyt.com/video/2022/12/15/104983_1_CS-Minty-lime-bar-CV_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022702-minty-lime-bars"}