{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Oysters With Buttery Soy-Sake Glaze", "description": "J. Kenji López-Alt first saw the pairing of oysters with sweet soy and sake sauce as a cook at Uni in Boston. It’s based on kabayaki, Japanese-style grilled freshwater eel. Eel is much richer than oysters, so adding a touch of butter to the sauce before spooning it over the grilled oysters helps balance the flavors. The sauce can be stored in the refrigerator for several weeks. If you’re interested in alternative flavor profiles for your grilled oysters, check out these <a href=\"https://cooking.nytimes.com/recipes/1022321-grilled-oysters-with-lemony-garlic-herb-butter\">Grilled Oysters With Lemony Garlic-Herb Butter</a> or <a href=\"https://cooking.nytimes.com/recipes/1022323-grilled-oysters-with-harissa-parmesan-butter\">Grilled Oysters With Harissa-Parmesan Butter</a>.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2021/06/21/dining/kla-grilled-oysters-with-buttery-soy-sake-glaze/merlin_189456996_99d28a42-0c56-4841-8146-b536116604f5-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "24 oysters", "recipeCuisine": "", "recipeCategory": "seafood, appetizer", "keywords": "oyster, sake, soy sauce, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 137}, "recipeIngredient": ["1 cup sake", "3/4 cup granulated sugar", "1/2 cup shoyu or light soy sauce", "3 smashed garlic cloves", "3 thin slices unpeeled ginger", "4 tablespoons unsalted butter", "24 oysters, scrubbed clean of any sand or grit under cool running water", "Thinly sliced scallions, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the sake, sugar and shoyu in a small saucepan along with the smashed garlic and ginger. Bring to a simmer and cook until the liquid is reduced into a syrupy glaze with large, dark bubbles, about 30 minutes. Using a spoon or strainer, remove and discard garlic and ginger. You should have about 1/2 cup glaze. Stir in the butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the sauce is prepared (or as it reduces), ignite a full chimney of coals and spread out under one side of the grill once they are fully covered in gray ash, or heat half the burners of a gas grill to high. Cover and let the grill heat for 10 minutes. Meanwhile, cut off a sheet of aluminum foil twice the length of a 13-by-18-inch rimmed baking sheet. Crumple it up so that it fits into the baking sheet. The crumpled foil should be able to support the cupped side of the oysters without allowing them to tip over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, arrange the oysters over the hot side of the grill, placing them with the cupped sides down, doing your best to set them in the grates so that oyster juices don’t pour out of the cups as they open. Cover and cook, checking on them every minute or so, and transferring any oysters that have begun to gape open to the foil-lined baking sheet. After a total of 4 minutes, transfer any remaining oysters to the foil whether they have opened or not. Place the saucepan on the cooler side of the grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as the oysters are cool enough to handle, pry off the top shells with a butter knife or oyster knife, severing through the muscle that holds the oyster to the shell and retaining as much juice in the shell as possible. For oysters that aren’t already gaping open, the easiest way to pry off the lids is by inserting the tip of the knife into the joint and firmly twisting it until the joint releases."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon a generous teaspoon of the glaze into each oyster, then return the oysters directly onto the grates on the hot side of the grill. Cook, uncovered, until the sauce mixture is bubbling hot, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the oysters to the foil-lined baking sheet, sprinkle with scallions, and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022322-grilled-oysters-with-buttery-soy-sake-glaze"}