{"@context": "http://schema.org", "@type": "Recipe", "name": "French Onion-Braised Lamb Shanks With Barley and Greens", "description": "This warming stew starts with a mountain of lightly caramelized onions and leeks to combine the sweet-savory flavors of French onion soup with rich, red wine-braised lamb shanks. Onion soups can be delicious whether made with lightly caramelized onions or deep, dark, sweet onions, and achieving either is a simple matter of adjusting the cooking time on the onions. Barley and greens added toward the end of cooking make it a complete one-pot meal, though the stew would be equally delicious spooned over polenta or mashed potatoes. (If serving with potatoes or polenta, omit the barley and cook as directed.) Not into lamb (or can’t find shanks)? Try the exact same recipe with beef short ribs or oxtail.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2022/02/23/dining/18kenjirex-stew/merlin_201238563_528bc68a-1138-4e44-a526-940871bc74f6-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews, main course", "keywords": "barley, lamb shanks, onion, red wine, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 327}, "recipeIngredient": ["3 1/2 to 4 pounds lamb shanks (about 4 large or 5 to 6 small or medium)", "Salt and black pepper", "2 tablespoons neutral oil, such as canola, vegetable or rice bran", "3 pounds yellow onions, thinly sliced (see Tip)", "1 pound leeks (about 2 large), white and pale green parts only, cut into 2- to 3-inch segments, then thinly sliced lengthwise (see Tip)", "1 medium carrot (about 6 ounces), peeled and finely diced", "8 garlic cloves, smashed and roughly chopped", "1/4 cup tomato paste", "2 cups dry red wine", "6 cups chicken stock, preferably homemade (see Tip)", "4 rosemary sprigs", "1 cup pearled barley", "1 bunch mature spinach or kale (remove the stems if using kale), roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to lower-middle position and heat oven to 275 degrees. Lightly season lamb with salt and pepper on all sides. Heat the oil in a 7- to 8-quart Dutch oven over medium-high until shimmering. Add the lamb shanks and cook, turning occasionally, until well-browned on all sides, about 10 minutes total. Transfer the lamb to a rimmed baking sheet or large plate, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onions, leeks and carrots to the Dutch oven. Reduce heat to medium. Season lightly with salt and cook, stirring frequently and scraping the bottom of the Dutch oven with a wooden spoon, until the onions and leeks are as caramelized as you’d like, about 20 minutes for lightly caramelized onions that give the stew a more savory flavor, or 45 minutes or longer for deeply caramelized onions that will make the stew sweeter. If browned bits start building up on the bottom of the pot, add water a tablespoon at a time, scraping them up and reincorporating them before continuing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the onions are ready, add the garlic, and cook, stirring, until fragrant, about 1 minute. Add the tomato paste and stir until it evenly coats all of the vegetables. Add the wine, scrape the bottom and sides of the pot, and cook until the wine is reduced by at least half, a minute or two. Add the chicken stock and the rosemary. (Tie the rosemary into a bundle with kitchen twine if you want to make it easier on yourself later.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the lamb shanks to the pot. Increase heat to high, bring the pot to a simmer, and transfer to the oven. Place a lid on top, leaving it cracked by an inch or so. Cook for 2 1/2 hours, then remove from oven. Flip the lamb, and stir the barley and spinach into the broth, making sure it’s all submerged. Return to the oven, cover with the lid cracked, and continue cooking until a metal skewer inserted into the lamb meets very little resistance, the meat falls off the bone with a little tug, and the barley is fully cooked but still chewy, 30 to 45 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pot to the stovetop, remove and discard the rosemary, and adjust the consistency to a saucy, stewlike mixture by simmering to thicken, or thin it out by adding water. Stirring as you go to prevent the bottom from sticking. Season to taste with salt and pepper, and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022984-french-onion-braised-lamb-shanks-with-barley-and-greens"}