{"@context": "http://schema.org", "@type": "Recipe", "name": "Tempe Penyet (Smashed Tempeh With Sambal)", "description": "Tempe penyet is a famous street food in Indonesia, especially common on the island of Java, where tempeh originated. “Penyet” means “to smash” or “to flatten” in Indonesian, and the technique ensures that every crack and crevice of this fried tempeh is penetrated by the sambal it is smashed upon. This version pan-fries the tempeh for ease, rather than deep-frying it, as is traditional. (If you prefer deep-frying, fry for 5 to 6 minutes in 350-degree oil until golden.) Caramelize the shallot, tomato and chile sambal until it browns and slightly chars, adding wonderful flavor and chewy-crispy bits. A drizzle of kecap manis, an Indonesian sweet soy sauce infused with spices, balances the dish with a savory-sweetness.\n \nTo get vegetarian recipes like this one delivered to your inbox, sign up for <a href=\"https://www.nytimes.com/newsletters/the-veggie\">The Veggie</a> newsletter.", "author": {"@type": "Person", "name": "Lara Lee"}, "image": "https://static01.nyt.com/images/2021/07/20/dining/ll-tempe-penyet/merlin_190839744_aa514d2d-d48c-4d57-8016-3d95b48e1323-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "indonesian", "recipeCategory": "", "keywords": "tempeh, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 484}, "recipeIngredient": ["4 garlic cloves, peeled and minced", "2 teaspoons ground coriander", "1 1/4 teaspoons fine sea salt", "16 ounces/455 grams tempeh, cut into ¼-inch-by-2½-inch slices", "1/4 cup canola oil, plus more as needed", "1/4 cup canola oil", "4 medium tomatoes, halved and thinly sliced", "7 medium shallots, peeled and sliced", "10 long, red, medium-spicy chiles (such as serrano, red finger or cayenne), deseeded and sliced", "7 garlic cloves, peeled and sliced", "1/4 teaspoon fine sea salt", "1 tablespoon fresh lime juice (preferably from makrut lime, calamansi or Key lime), plus lime wedges for serving", "1 to 2 tablespoons kecap manis (see Tip)", "Steamed jasmine rice", "1/2 medium English cucumber, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Marinate the tempeh: In a large bowl or resealable freezer bag, combine the garlic, coriander and 1 teaspoon salt with ¾ cup plus 2 tablespoons water. Add the tempeh and massage the marinade into all the pieces. Set aside while you make the sambal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sambal: Heat ¼ cup oil in a large skillet over high. Once the oil is shimmering, add the tomatoes, shallots, chiles and garlic. Cook for 20 minutes, stirring the ingredients every so often. When the shallots begin to brown slightly after 10 to 15 minutes, reduce the heat to medium as the sambal continues to caramelize. Cook the sambal, stirring often, until it has caramelized and reduced and the tomatoes have softened, with a few crispy, browned bits, around 5 minutes. The sambal should not be burned, however, so regulate the heat as needed. Remove from the heat and season with ¼ teaspoon salt. (This makes about 1 1/2 cups, and will keep in the fridge for up to 1 week.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sambal cooks, pan-fry the tempeh: Carefully remove the tempeh from the marinade and set it in a colander to drain excess liquid. Heat ¼ cup oil in a large nonstick skillet over high. When the oil is shimmering, but not smoking, add the tempeh to the pan in a single layer using tongs. Be careful, as the oil will spit because of the water in the marinade. Fry for 2 to 3 minutes on each side, or until golden and crispy all over. You may need to fry in batches, adding extra oil as needed. Transfer the tempeh to a paper towel-lined baking sheet to drain; season with 1/4 teaspoon salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, transfer the sambal to serving plates. Lay the tempeh on top of the sambal. Using a pestle, rolling pin or wooden spoon, gently flatten each piece of tempeh, massaging it into the sambal. The idea is to gently create small cracks and crevices where the tempeh meets the sambal so they can combine, rather than completely destroying the tempeh. Squeeze lime juice over the tempeh pieces, then drizzle kecap manis on top. Serve with steamed white rice, slices of cucumber and extra wedges of lime."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022382-tempe-penyet-smashed-tempeh-with-sambal"}