{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Cooker Lasagna", "description": "This easy slow-cooker lasagna is satisfying in all the ways that matter: Rich ricotta-Parmesan-spinach layers alternate with tender noodles, melted mozzarella and tomato. (A slow cooker will not give the crispiness that an oven does, but you may not even miss it.) It’s also petite compared to many other lasagnas, perfect for feeding a family, not a crowd. If you’ve ever had a one-pot pasta, the texture of the noodles will be familiar to you: They are tender and starchy. Don’t use no-boil or fresh noodles, as they will overcook. If you like, brown some loose Italian sausage in a skillet, pour off the fat and add it with the tomato sauce layers.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2021/11/19/dining/sd-slow-cooker-lasagna/merlin_195505110_f341c7d0-9a4c-4ba8-91fb-f586dca73142-articleLarge.jpg", "totalTime": "PT4H10M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, casseroles, pastas, main course", "keywords": "lasagna, lasagna noodles, marinara sauce, ricotta, slow cooker, spinach, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 585}, "recipeIngredient": ["1 pound whole-milk ricotta cheese (about 2 cups)", "1 (10-ounce) bag or box frozen spinach, thawed and squeezed dry", "3 ounces finely grated Parmesan (about 1 scant cup)", "1/2 cup lightly packed, roughly chopped basil leaves, plus more for topping", "5 garlic cloves, grated or pressed", "1 teaspoon dried oregano", "1 teaspoon onion powder", "Kosher salt and black pepper", "Olive oil", "1 (32-ounce) jar good-quality marinara sauce", "9 lasagna noodles (7 to 8 ounces)", "8 ounces shredded mozzarella (2 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, stir together the ricotta, spinach, Parmesan, basil, garlic, oregano, onion powder, ¼ teaspoon salt and a generous amount of black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease the bottom and sides of a 6- to 7-quart slow cooker with olive oil. Ladle about 1 cup of the marinara sauce in the bottom of the slow cooker, and spread it evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make two layers: Lay 3 lasagna noodles on top of the sauce, breaking the noodles to make a roughly even layer. (This doesn’t need to be perfect; it’s fine if the noodles overlap slightly, and if there are small spots the noodles don’t cover.) Ladle about ¾ cup of sauce on top of the noodles and spread evenly. Evenly dollop about half of the ricotta mixture over the sauce, and use the back of a fork to press it into a roughly even layer. Sprinkle about a third of the shredded mozzarella over the ricotta. Repeat to make one more layer, using three noodles, the ¾ cup sauce, the remaining half of the ricotta mixture, then about half of the remaining mozzarella."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish, lay down the remaining 3 lasagna noodles and spread with the remaining sauce. (Reserve the remaining mozzarella.) Cover and cook on low until the internal temperature in the center is at least 140 degrees and the noodles are tender, 3 hours 30 minutes to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the slow cooker and sprinkle the top of the lasagna with the remaining mozzarella. Remove the crock from the base that contains the heating element and let the lasagna rest with the lid on for 20 to 30 minutes, otherwise it will fall apart when you try to slice it. Sprinkle the top with more torn basil, to your taste. Cut the lasagna with a knife and scoop out servings with a spatula to serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022664-slow-cooker-lasagna"}