{"@context": "http://schema.org", "@type": "Recipe", "name": "French Onion Stuffing", "description": "Golden caramelized onions and mushrooms are the building blocks of this vegetarian stuffing inspired by French onion soup. The onions take some time to cook, but the meltingly tender result brings rich sweetness to the dish. Mushrooms are added for their texture, and mushroom broth reinforces the stuffing with more depth. An initial steam helps soften the big mound of raw onions to make caramelizing them easier and faster. The onions can be cooked the day before (through Step 3) and refrigerated, then rewarmed before using.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2021/11/14/dining/14sidesgiving-onionstuffing/merlin_196269432_d8bb443c-200a-4a60-9b9d-2f872891e02d-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, stuffing and dressing, side dish", "keywords": "thanksgiving, white mushrooms, yellow onion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 518}, "recipeIngredient": ["1 (1-pound) country bread loaf, cut into 1- to 1½-inch pieces", "8 tablespoons unsalted butter, plus more for greasing the pan", "4 tablespoons neutral oil, such as safflower or canola oil", "2 cups finely chopped celery (from about 4 ribs)", "5 garlic cloves, minced", "4 ounces whole white mushrooms, finely chopped (1 1/4 cups)", "Salt and black pepper", "2 tablespoons fresh thyme leaves, plus 1 thyme sprig", "4 pounds yellow onions, halved and thinly sliced (16 packed cups)", "1/4 cup dry white wine", "3 cups mushroom broth", "3 large eggs, beaten", "Chopped chives, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Spread bread on a rimmed baking sheet, and bake until very dry and light golden, about 15 minutes. Remove bread and increase oven temperature to 425 degrees. Grease a 9-by-13-inch baking dish with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large pot with a lid, heat 2 tablespoons oil over medium. Add celery and cook, stirring occasionally, until softened, 5 minutes. Stir in garlic until fragrant, 30 seconds. Add mushrooms, season with salt and pepper, and cook, stirring occasionally, until mushrooms are tender and mixture is dry, about 5 minutes. Stir in thyme leaves and transfer mixture to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pot, add the remaining 2 tablespoons oil and melt 6 tablespoons of the butter over medium. Add onions and thyme sprig, season with salt and pepper, and stir to evenly coat in the oil and butter. Cover and cook, stirring after 5 minutes, until onions soften and reduce in volume, about 10 minutes. Increase heat to medium-high and cook uncovered, stirring frequently to scrape up browned bits, until onions are very soft and deep golden, about 25 minutes. Reserve 1 cup of the onions in a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wine to pot and stir until all of the liquid is absorbed, about 1 minute. Add broth and bring to a boil over high. Reduce heat to medium and simmer for 5 minutes to allow flavors to meld; discard the thyme sprig. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add eggs to the mushroom mixture in the large bowl and mix well. Add the bread, then pour over the onion mixture. Season with salt and pepper, and gently toss until well combined. Transfer to the prepared baking dish. Top with the reserved onions and dot with the remaining 2 tablespoons butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover tightly with foil and bake until stuffing is hot throughout, 30 minutes. Uncover and continue to bake until crisp in spots, about 15 minutes longer. Garnish with chives and serve warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022669-french-onion-stuffing"}