{"@context": "http://schema.org", "@type": "Recipe", "name": "Fluffy Mashed Potatoes", "description": "For the silkiest fluffy mashed potatoes, start with firm, cool Russet Burbank spuds, also known as baking potatoes. They’re the easiest to mash without becoming pasty and are even tastier steamed instead of boiled. Boiling potatoes can leave them waterlogged, diluting their earthy subtle sweetness, but steaming them preserves their inherent flavor. As the potatoes soften, they absorb just the right amount of moisture. Seasoning the dish only at the very end heightens their intrinsic subtle sweetness. If you have a ricer, use it for an exceptionally smooth texture: Press the steamed potatoes through the ricer back into the pot, then gently fold in the butter and milk with a wooden spoon or flexible spatula.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2021/11/17/dining/12Korex2/merlin_197633112_0cd0e5f6-5532-4869-a85d-a8c4ef98d124-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, side dish", "keywords": "christmas, easter, thanksgiving, make-ahead, mashed potato, milk, russet potatoes, salted butter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1125}, "recipeIngredient": ["3 pounds russet potatoes", "1 cup whole milk, plus more as needed", "1/2 cup cold salted butter, cut into pats", "Salt", "Freshly ground white or black pepper", "1/4 cup heavy cream, plus more as needed (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a steamer: Arrange an insert or basket (or a large colander, if you have neither) in a large pot, and add enough water to come just below the base of the steamer. Bring water to a boil over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse potatoes well, then peel. Rinse again, then cut into 1-inch chunks. Spread evenly in the steamer, cover, reduce heat to medium and steam until the potatoes are very tender, 20 to 25 minutes. A fork should slide easily into a piece and break it without effort. Turn off the stove, carefully remove the steamer insert and drain the water from the pot. Pour the potatoes back into the pot and spread evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the potatoes stand until their surfaces are dry, about 3 minutes. Meanwhile, heat the milk in a small saucepan over medium-high until steaming, then keep warm over low. Set the potatoes over low heat and mash thoroughly with a dinner fork. Add about one-quarter of the milk and mash until the milk is incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the butter evenly over the potatoes and mash in until all traces of butter disappear. Add half of the remaining milk and mash to incorporate, then add the rest of the milk and gently whip until smooth, circling the fork as if beating eggs. If you don’t want your mashed potatoes so thick, beat in more milk. Sprinkle with salt and pepper, taste, and season more if you’d like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately, keep warm over low heat for up to 1 hour, or transfer to airtight containers and refrigerate for up to 2 days. Mashed potatoes thicken as they cool, so they need cream to regain the right consistency. If kept warm, gently mash in heavy cream until smooth and loose again, adding more if you’d like. If cold, heat the cream in a large pot until steaming, then add the potatoes. Gently mash and whip, adding more cream as needed, until heated through and fluffy. Season to taste again before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022712-fluffy-mashed-potatoes"}