{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Baked Macaroni and Cheese", "description": "This macaroni and cheese recipe, inspired by Stouffer’s, delivers the best of all worlds: creamy, saucy comfort, with a consistency that’s slightly more set than a stovetop version, thanks to a final bake in the oven. It stays voluptuous and molten as a result of a higher ratio of sauce to noodles, which are cooked completely so they don’t soak up as much liquid. The Velveeta is necessary here, as it has sodium citrate, which prevents the sauce from separating in the oven. Elbow macaroni works fine, but cavatappi is an especially fun shape to eat with its telephone-cord bounciness.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2021/11/10/dining/04MACREX/merlin_196956333_02cc2407-e7c1-469c-880f-6d022f97593c-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, main course, side dish", "keywords": "macaroni, macaroni and cheese, milk, pecorino romano, sharp cheddar cheese, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 3929}, "recipeIngredient": ["Salt", "1 pound cavatappi or elbow macaroni", "1/2 cup unsalted butter", "1/2 cup all-purpose flour", "6 cups whole milk", "1 pound sharp or extra-sharp yellow Cheddar, coarsely <a href='https://www.nytimes.com/wirecutter/reviews/best-grater/'>grated</a> (5 1/4 cups)", "8 ounces Velveeta, torn into pieces", "4 ounces Pecorino Romano, coarsely grated (1 cup)", "1/2 teaspoon dry mustard powder", "1/4 teaspoon onion powder", "Pinch of ground cayenne", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and season generously with salt. Add the pasta and cook according to package instructions, stirring occasionally with a wooden spoon, until just past al dente. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the empty pot to the stove (no need to clean it) and set over medium heat. Melt the butter and simmer, whisking occasionally, until the butter stops spurting and quiets down, 2 to 3 minutes. Add the flour and cook, whisking, until smooth like gravy, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in the milk. Raise the heat to high and bring to a simmer, whisking constantly, then immediately reduce the heat to low and continue simmering until the sauce lightly coats the back of a spoon, 2 to 5 minutes. At this stage, the sauce should be smooth but relatively loose. Take the pot off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the pot, add the Cheddar, Velveeta, Pecorino Romano, mustard powder, onion powder and cayenne, and season generously with salt and black pepper. Whisk until the cheese is melted and smooth like nacho cheese. Add the drained pasta, breaking up any clumps, and stir until evenly coated in the cheese sauce. Taste and adjust seasoning with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a 9-by-13-inch baking pan or dish and bake until bubbling at the edges, 15 to 20 minutes. Serve immediately."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Creamy Baked Macaroni and Cheese", "description": "Eric Kim is in the studio kitchen showing us how to make his recipe for a Creamy Baked Macaroni and Cheese, which is inspired by the Stouffer’s version he grew up eating on Thanksgiving. It’s got the best of all worlds: creamy, saucy comfort, with a consistency that’s slightly more set than a stovetop version, thanks to a final bake in the oven. The key to the texture is Velveeta, which prevents the sauce from separating in the oven.", "thumbnailUrl": "https://static01.nyt.com/images/2021/11/10/dining/04MACREX/merlin_196956333_02cc2407-e7c1-469c-880f-6d022f97593c-mediumThreeByTwo440.jpg", "uploadDate": "2021-11-12T17:31:05.000Z", "duration": "PT7M50S", "transcript": "It came with a spinach soufflé. Those who love Stouffer's know that that's a deep cut. That spinach soufflé is so good. This is not about the spinach soufflé, though. It's about the mac and cheese. Hi, I'm Eric Kim. I'm a cooking writer for the New York Times Food section. Today, I'm making a Stouffer's-style creamy mac and cheese. If you've ever had Stouffer's mac and cheese, the wonder of it is that it stays creamy and as you're scooping, it's like, it's still gooey, it's not runny, but it's not a hard set either. Nothing wrong with those mac and cheeses, though. I like those too. But this mac and cheese is very, very, very creamy. And that's what's special about it. I think the question might be like, why am I trying to recreate this specific style of macaroni and cheese? For me, it does come from a pretty emotional, personal place, which is just that I grew up eating this, and I think it was always my idea of what a mac and cheese should be. I think what makes a Stouffer's-style mac and cheese really special and different from, you know, the regular baked mac and cheeses or even a stovetop mac, is that it kind of exists somewhere in this notional territory between the two. So it's creamy and it stays creamy, but it's also baked. It's like a little baked at the edges and so you get the best of both worlds, I think. And let me tell you, it's not easy to achieve. I have to give credit to my food stylist friend Jesse Szewczyk. I had baked maybe like 10 mac and cheeses that day, and I was losing my mind and I was like, they're all splitting. My friend Jesse was like, \"Well, food stylists use sodium citrate to like, stabilize a mixture like that.\" So what we're going to do is shred a bunch of Cheddar and a little bit of Pecorino Romano. But the key to keeping that voluptuous creaminess, even after the oven, is Velveeta. That creaminess comes, scientifically, from an ingredient in this product, which is sodium citrate. I'm going to start grating the cheeses. I have a Cheddar here. You want like a young, creamy cheese. Get an orange Cheddar, or not. It really doesn't matter. For me, it's really just I like recalling that yellow Stouffer's cheese. Oh my god, there's so much that, yeah, this is like a pound of Cheddar. It's my favorite dish in the Thanksgiving menu. I wonder if cooks can relate to this. If you are in charge of the Thanksgiving, you tend to let other people's favorite dishes, you know, take up more space in the cooking time. And so this year was about making time for myself. The Velveeta, it's so soft anyway, you can't really grate it, so you should just tear it with your fingers. People always say this, but if you're cooking with kids, this really is the moment where you just make the kids do the labor. I like to boil the pasta and then drain it and use the same pot to make my sauce. I won't call this a one-pot whatever, but it's just I think it's easy like that. So I have a pot of boiling water here, and I'm going to salt it pretty heavily. Like, you know, you really do want your pasta to be well seasoned. I'm using a cavatappi. I love this shape. I love this texture. I don't know about you guys, but regular elbow macaroni from the box, it never, never cooks up as big as a mac and cheese that you would get from a Stouffer's box. When this cooks up, it'll be like really plump and like, luscious and curly. Another thing that really helps you with your creaminess is making sure that your pasta is cooked all the way, it's plump enough and it won't soak up as much sauce, and your end result will stay creamy. The next step is to cut each one in half. Just kidding. Perfect. Oh, this is perfect, because now I'm going to go and work on some other stuff, but this is drying out right now, which I think is really important. So there's no water in your mac and cheese. Now we're going to make the sauce. We start with a stick of butter over medium heat. You're not browning the butter. You are just letting it go until it's sort of quiets down and stops sputtering. So you will hear when it's ready. OK, that's nice and foamy. So now I'm going to add the flour. This is half a cup of flour. And you're just cooking this until it's smooth for like a minute. That looks good. I'm going to add the milk now and that's just going to bubble up and thicken a little bit. This will take about 2 to 5 minutes. Once it comes up to a bubble. So there's a funny story. The Stouffer's people told me that a lot of people don't realize that their family mac and cheese is Stouffer's. I thought that was so funny. You know, when you get that family-style one, if you know, you know, It comes in that aluminum tray, and so it kind of just looks like a church potluck dish, you know, but it's actually something that you got from that freezer aisle. Came to a simmer, reducing it a little bit. Keep it at the simmer. I think that's pretty good. Lightly coating the back of the spoon. I would say that's lightly coating. This is ready. I'm going to turn it off. I really want this to be off the heat when I add the cheese. Velveeta first. All that cheese we grated. This will seem like way too much sauce, but again, noodles are sponges, and what makes a Stouffer's mac is all the sauce. So I have some onion powder, dry mustard powder and a pinch of cayenne. Thanksgiving was a really special holiday in my family because it was the time when the parents kind of sat back and it was the time when the kids got into the kitchen and made the entire dinner. You know, Korean kids, children of immigrants. We we wanted this food that we were seeing in all our coloring books and at school and on TV. The Stouffer's mac and cheese was the one thing that we didn't have to cook from scratch because it was already perfect, you know? Oh, perfect. But that said, as an adult, I wanted to recreate it in my kitchen, and I think it's like fun to, as a cook, to figure out why something tastes the way it does. You can just serve it like this, actually, it'd be really delicious, but we're going to finish it off in the oven. Whoa. Keep in mind, this is feeding a crowd. There's like this extra sauce on the bottom that I'm going to spatula out and I want to pour that in there. And this just goes in the oven for 15 minutes. That's it. 350 degrees. You're not going to see a crusty edge browning. If you want that, you can. It's just a really creamy mac and cheese that's like what I'm after. The texture that I want. I eat it with a spoon. Not with a fork. Ooh yeah. See that. I just love how saucy that is. Can you see that? I'm really happy with this. This is exactly what I wanted. It's super-comforting, saucy, and it's just so exactly what I think of as the platonic ideal of mac and cheese. Your family's mac and cheese might be different. My family's both came from a box and that's still special to me. You guys want to try some?", "contentUrl": "https://vp.nyt.com/video/2021/11/12/97239_1_EK_MacandCheese-Video-2021_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022733-creamy-baked-macaroni-and-cheese"}