{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Chicken Stock", "description": "One of the great joys of roasting a chicken is turning the bones into stock. This simple golden elixir, a real panacea for life’s ailments, starts with a leftover carcass from a <a href=\"https://cooking.nytimes.com/recipes/1022849-roasted-chicken-with-caramelized-cabbage\">roasted chicken</a>, one you’ve already eaten and picked the meat off of. What you’re going for here isn’t clarity in looks or flavor, as you might with a traditional French stock. Instead, this version is deeply fortified with alliums, bay leaves, peppercorns and a touch of turmeric for earthy depth and spiced savoriness. This stock is great to cook with, but also tastes excellent sipped straight from a mug like tea.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2021/12/30/dining/30RESOLUTIONREX2-roasted-chicken-stock/RESOLUTIONREX2-roasted-chicken-stock-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "1 1/2 to 2 quarts", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 225}, "recipeIngredient": ["1 leftover carcass from a <a href=\"https://cooking.nytimes.com/recipes/1022849-roasted-chicken-with-caramelized-cabbage\">whole roasted chicken</a>, meat picked off and saved for another use", "1 large yellow onion", "1 head of garlic", "8 small or 4 large dried bay leaves", "1 tablespoon kosher salt (Diamond Crystal) or 1 1/2 teaspoons coarse kosher salt", "1 tablespoon whole black peppercorns", "1/4 teaspoon ground turmeric"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make this stock in an Instant Pot: Add the chicken carcass to a 3- or 6-quart Instant Pot or other electric pressure cooker. Chop the onion into eighths, and slice the garlic head in half crosswise to expose the cloves; dump the alliums into the pot over the chicken. Crush the bay leaves and add, along with the salt, black peppercorns, and turmeric. Add enough cold water to reach the max line in the 3-quart or to cover the bones in the 6-quart (5 to 6 cups). Gently stir and cover with the lid. Pressure-cook on high for 1 hour and let the pressure release naturally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make this stock on the stove: Follow Step 1, but place all of the ingredients, including the water, into a large heavy-bottomed pot, such as a Dutch oven or stock pot, and gently stir. Bring to a boil over high heat, then immediately reduce the heat to maintain a gentle simmer. Cover and cook until the stock is deeply golden, the chicken bones are falling apart at the joints when you try to pick them up and the vegetables have turned to mush, about 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the contents of the pot through a colander set over a large bowl; press the bones to get out all of the liquid. Taste for seasoning, adjusting with salt as desired. Ladle the stock into large mugs for sipping, or use as an ingredient in your cooking. Alternatively, you can let the strained stock cool slightly before transferring into quart containers and storing in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "This chicken stock will keep in the refrigerator for 3 to 4 days or in the freezer for up to 4 months. Heat individual portions in coffee mugs to drink in the morning for breakfast, or use as a base for soups, stews and porridges throughout the week."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022850-roasted-chicken-stock"}