{"@context": "http://schema.org", "@type": "Recipe", "name": "Kalleh Gonjeshki (Meatballs and Potatoes) ", "description": "Kalleh gonjeshki is a comforting and nostalgic Iranian dish that, at its core, is a simple preparation of meatballs and potatoes simmered in a tomatoey sauce. Kalleh gonjeshki means “sparrow’s head” in Persian, and the name is a reference to the size of the meatballs. Every family has its own version of this childhood favorite, and the dish hits the spot on cooler evenings. Don’t replace the dried mint in the meatball mixture with fresh mint, as the dried mint contributes earthier notes and provides more flavor and fragrance. To cut down on time and pans, the meatballs are first baked in the oven, but you can also pan-fry them on the stovetop if you like. Kalleh gonjsheki is served with a side of bread, but you can also serve it alongside rice.  ", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2022/01/11/dining/nd-meatballs-and-potatoes/merlin_199949079_43f298f5-d1d6-4c59-a1e6-b463e12320c6-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "middle eastern", "recipeCategory": "meatballs", "keywords": "dried mint, ground beef", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 347}, "recipeIngredient": ["1 pound ground beef or lamb, or combination", "1 1/2 teaspoons kosher salt (Diamond Crystal)", "1 teaspoon dried mint, crushed between your fingers (optional)", "1/4 teaspoon black pepper", "1/4 teaspoon ground turmeric ", "1 small yellow onion, grated on the largest hole of a box grater", "1 large garlic clove, finely grated", "2 tablespoons extra-virgin olive oil", "1/4 cup extra-virgin olive oil", "1 large yellow onion, finely chopped", "Kosher salt and black pepper ", "2 garlic cloves, finely grated", "1/2 teaspoon ground turmeric", "1 large Yukon Gold potato (about 8 ounces), peeled and diced into 1/2-inch cubes", "3 tablespoons tomato paste", "1/4 teaspoon ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Position a rack in the center of the oven, and heat the oven to 425 degrees. Line a sheet pan with parchment paper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the meat in a large bowl and spread it out, creating a flat surface, to ensure the spices are evenly distributed. Sprinkle the salt, dried mint (if using), pepper and turmeric evenly over the meat. Add the grated onion and garlic, and mix everything well with your clean hands. Set a small bowl of warm water next to you, and wet your palms a little so the meat doesn’t stick to your hands. Roll the meat mixture into 1 1/2-inch balls (the size of a sparrow’s head), about 1 tablespoon of meat mixture per meatball. (You should have around 25 to 30 meatballs.) Place the meatballs on the prepared sheet pan, drizzle with the olive oil and bake until cooked through and slightly browned on top, about 20 minutes.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the sauce: In a medium sauté pan or pot with a lid, heat the oil over medium-high, add the onion and cook, stirring occasionally, until golden brown, about 10 minutes. Sprinkle the onion with a little salt, reduce the heat to medium and add the garlic and turmeric. Cook for about 2 minutes, until the garlic and turmeric are fragrant. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the potatoes, season with salt and pepper, stir, and cook for 2 minutes just to take the raw edge off. Push the potatoes to the sides and make a little space in the middle of the pot. Add the tomato paste to the oil in the center, stirring to cook off its raw taste and deepen the color, and taking care not to burn it, about 1 minute. Mix the tomato paste with the potatoes, add 1 1/2 cups of water, stir and bring to a gentle boil. Add the meatballs, reduce heat to medium-low, cover and simmer for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the sauce and a potato, and adjust seasonings to your liking. Add the cinnamon, gently stir, cover and cook for another 5 minutes, until all the flavors have melded. You can add more water if you’d like a slightly thinner sauce."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022873-kalleh-gonjeshki-meatballs-and-potatoes"}