{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Halibut With Mussel Butter Sauce", "description": "This is a stunning seafood main course that needs only a side dish, such as <a href=\"https://cooking.nytimes.com/recipes/1022644-roman-style-braised-fennel\">braised fennel</a> or <a href=\"https://cooking.nytimes.com/recipes/1022258-orzo-salad-with-peppers-and-feta\">orzo salad</a>, and some crusty bread served alongside for a delicious dinner party. Halibut is a mild yet buttery and rich fish with firm, meaty flesh. Here, the fish is wrapped in seaweed, which imparts subtle sea flavor and keeps the fish tender and juicy while it roasts. Mussels are steamed open in a bath of clam juice and kelp broth, releasing their flavorful juices into the liquid, which becomes a silky sauce. Earthy saffron adds depth and beautiful color, and just enough butter and cream round out the sauce without making it too heavy. For a festive presentation, top the fish with vibrant salmon roe, which look like jewels and offer pops of brininess.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2021/12/14/dining/KC-roasted-halibut-mussel-butter-sauce/merlin_198975507_0ce13aaf-8285-4fb1-9db6-d41cd4e0caa9-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "seafood, main course", "keywords": "butter, clam juice, halibut, mussels, saffron, christmas, new year’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 234}, "recipeIngredient": ["2 ounces dried kelp (dashima or kombu; see Tip)", "4 tablespoons extra-virgin olive oil, plus more for greasing", "1 (2 1/2-pound) skinless halibut or cod fillet (1-inch thick; see Tip)", "Kosher salt", "1 (8-ounce) bottle clam juice", "3 dozen mussels, cleaned (about 2 pounds)", "2 tablespoons fresh lemon juice", "1/2 teaspoon saffron, crumbled", "2 small shallots, finely chopped", "1 garlic clove, crushed", "4 tablespoons unsalted butter", "6 tablespoons heavy cream", "1 tablespoon chopped parsley, plus more for garnish", "1 tablespoon chopped tarragon, plus small leaves for garnish "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. In a large bowl, combine kelp with 4 cups of cool water and let stand until softened, about 5 minutes. Reserve 2 cups of the kelp water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly greased rimmed sheet pan, arrange half of the softened kelp in the center, allowing excess water to drip off kelp and slightly overlapping the pieces. (Do not squeeze water out of the kelp). Rub halibut with 2 tablespoons of oil and season with salt. Set halibut in the center of the kelp and lift kelp over the sides of the fish. It should stick to the fish. Top halibut with the remaining kelp, slightly overlapping, and tuck the kelp loosely underneath the fish to enclose it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast halibut until just opaque in the center, about 15 minutes. A metal cake tester or skewer inserted in the center of the fish should feel warm to the touch. Transfer wrapped halibut to a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large pot, combine clam juice and the reserved kelp water, and bring to a boil over high heat. Add mussels, cover and cook until mussels open, 2 to 3 minutes; begin checking mussels at 2 minutes and transfer them to a bowl as they open (discard any that do not open). Tent with foil to keep warm. Pour mussel broth into a separate bowl, leaving behind any grit in the pot, and reserve the broth. Rinse out pot to remove any grit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 1 tablespoon of the lemon juice with the saffron in a small bowl and mix well. In the rinsed pot, heat the remaining 2 tablespoons oil over medium. Add shallots and cook, stirring occasionally, until softened, about 3 minutes. Stir in garlic until fragrant, about 1 minute. Add reserved mussel broth (and any juice that has drained from the mussels) and saffron-lemon juice, and bring to a boil over high. Reduce heat to medium-low and simmer gently to allow flavors to meld, about 5 minutes. Discard garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While whisking constantly, add butter 1 tablespoon at a time, blending in each addition before adding the next. Then, whisk in heavy cream. Gently simmer until sauce is slightly reduced, about 5 minutes longer. Stir in the remaining 1 tablespoon lemon juice, parsley and tarragon, and season with salt. You should have about 2 cups of sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the top layer of kelp to reveal halibut. You can serve the kelp to eat with the fish or discard it. Arrange mussels around halibut, removing the top shells for easier eating if you’d like. Spoon some sauce over the mussels and fish, and garnish with parsley and tarragon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide the fish and mussels among plates. Garnish with more parsley and tarragon. Serve with the remaining sauce on the side."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022829-roasted-halibut-with-mussel-butter-sauce"}