{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Zucchini Ribbons", "description": "Zucchini is the summer vegetable grillers love to hate. We love it for its summery flavor and sheer abundance. We love it less for its unfortunate tendency to become soggy when grilled. Russ Faulk, chief designer at Kalamazoo Outdoor Gourmet and author of “Food + Fire,” has come up with an ingenious method of keeping zucchini crisp during grilling: He slices it thin on a mandolin, then accordions the strips on skewers to grill over a screaming hot fire. The edges char and crisp, giving you the vegetable equivalent of meaty ribs’ burnt ends. I’ve taken the burnt end idea one step further by seasoning the zucchini with a classic barbecue rub — use your favorite — and basting it with spiced butter.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2021/06/16/dining/15vegetablesrex3-zucchini/merlin_188862222_b6d59ec5-4b53-4426-8b2a-0cf36432efe5-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "barbecue rub, butter, zucchini", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 543}, "recipeIngredient": ["Vegetable oil, for the grill grates", "8 tablespoons (1 stick) unsalted butter or extra-virgin olive oil", "1 garlic clove, minced", "3 tablespoons barbecue rub or spice mix", "1 teaspoon finely grated lemon zest", "6 medium-small zucchini (6 ounces each)", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up your grill for direct grilling and heat to high (450 to 600 degrees). Brush or scrape the grill grate clean and oil it with a tightly folded paper towel dipped in vegetable oil and drawn across the bars of the grate with tongs. If using bamboo skewers, soak in cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt the butter in a small saucepan over medium-low heat. Add the garlic, 1 tablespoon barbecue rub and lemon zest, and cook, stirring frequently, until the garlic is softened and fragrant, about 3 minutes. Remove the pan from the heat and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut off and discard the ends of the zucchini. Using a mandolin outfitted with a finger guard, thinly slice one zucchini lengthwise into slices scant 1/8-inch thick. You can also use a chef’s knife to cut slices lengthwise just shy of 1/8-inch thick. (Try folding your first or second strip. If it breaks at the fold, it means it’s too thick.) Lay the slices flat on a sheet pan. Lightly brush the tops with enough barbecue butter to lightly coat and lightly sprinkle with some of the remaining 2 tablespoons barbecue rub."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold a zucchini slice into an accordion shape (like multiple Ws or ribbon candy) and thread it onto a metal or soaked bamboo skewer. Continue threading until all the slices from the zucchini are on the skewer. Slice, brush, season and skewer the remaining zucchini the same way. You should wind up with 6 skewers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the zucchini kebabs, skin sides down, on the grate. Grill (covered if using a gas grill), basting with any remaining barbecue butter and turning to evenly brown, until singed at some of the edges, 1 to 2 minutes per side (4 to 8 minutes in all). Season with salt if needed and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022289-grilled-zucchini-ribbons"}