{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled S’mores Sandwiches", "description": "This always-makes-you-happy dessert combines two classics: <a href=\"https://cooking.nytimes.com/recipes/992-indoor-smores\">s’mores</a> and pan con chocolate, a Spanish snack of toast with melted chocolate on top. Oozy chocolate and wobbly marshmallows are sandwiched between two slices of crisp, slightly smoky pieces of bread. While you could use any white or whole wheat sandwich bread, cinnamon bread is the ideal way to go. Not only will the toasty cinnamon flavor remind you of graham crackers, but also the sugar will help the bread caramelize on the grill (and a surprising slick of mayonnaise, instead of butter, helps brown the bread without burning). To keep the sandwich from being cloyingly sweet, add a sprinkle of salt on top. (P.S. Make it a Fluffernutter by using peanut butter instead of chocolate.)", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2021/08/10/dining/as-smores-sandwiches/as-smores-sandwiches-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "4 sandwiches", "recipeCuisine": "", "recipeCategory": "sandwiches, dessert", "keywords": "bread, chocolate, marshmallow", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 158}, "recipeIngredient": ["8 slices cinnamon swirl bread (with or without raisins)", "Mayonnaise", "4 ounces bittersweet or semisweet chocolate bars, broken into roughly 1-ounce pieces", "8 marshmallows, torn in half", "Flaky or kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a charcoal or gas grill for medium-low heat. (Medium-low is between 250 and 325 degrees. You should be able to hold your hand 4 to 5 inches above the grates for 8 to 10 seconds)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly spread one side of each piece of bread with mayonnaise. When you're ready to grill, take the bread, chocolate, marshmallows, salt and a spatula to the grill. Clean the grates with a grill brush. (No need to grease the grates.) Place the bread slices on the grill mayo-side-down. In the center of half the slices, add 1 ounce chocolate to each. To the other half, add the marshmallows. Cover and cook until the bread is toasted, the chocolate is starting to melt, and the marshmallows are swelling, 4 to 6 minutes. Check on the bread often, moving slices around the grill as needed to prevent burning. If the chocolate is melted before the bread is crisp, increase the heat to medium."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the spatula or your hands to flip the marshmallow slices onto the chocolate slices. Transfer to plates, press down slightly to meld (chocolate and marshmallow will ooze out), and sprinkle with salt. Eat it as fast as you can."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022467-grilled-smores-sandwiches"}