{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Chicken Thighs With Peppers, Capers and Olives", "description": "The Italian technique employed here — sautéing chicken with a weighted pan on top — is called al mattone. It yields a crisp, burnished skin and very juicy meat. Instead of the usual spatchcocked bird, this recipe calls for large bone-in, skin-on thighs. Cook them in a cast iron pan, if you can, for even heat, but any heavy skillet will do. For a bit of smokiness, the chicken may be cooked (in the cast iron pan) over a charcoal grill. The accompanying sweet pepper stew can be made up to a day in advance and reheated, and starting your seasoning early — an hour ahead or up to 24 — will result in the tastiest chicken.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2021/09/01/dining/27Tanisrex2-chicken/merlin_193478265_bd520cc6-7575-41f2-83a3-cb1d228fb352-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "poultry, main course", "keywords": "bell pepper, chicken thigh, olives", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 427}, "recipeIngredient": ["6 large bone-in, skin-on chicken thighs (about 2 pounds)", "Kosher salt (Diamond Crystal) and black pepper", "2 garlic cloves, grated or minced", "2 large sprigs rosemary, very roughly chopped", "Pinch of red-pepper flakes", "Grated zest and juice of 1 small lemon (about 1 teaspoon zest and about 3 tablespoons juice)", "4 tablespoons extra-virgin olive oil", "2 tablespoons extra-virgin olive oil", "2 medium red onions, sliced in 1/4-inch half-moons (about 3 cups)", "6 bell peppers, in assorted colors, if possible, sliced 3/8-inch lengthwise (about 8 cups)", "Kosher salt (Diamond Crystal) and black pepper", "3 garlic cloves, grated or minced", "Pinch of red-pepper flakes", "1/2 cup green olives (like Castelvetrano)", "1/2 cup black olives (like Niçoise)", "2 tablespoons red wine vinegar", "1 tablespoon capers, roughly chopped", "Pinch of dried oregano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start the chicken: Pat chicken dry and place in a large bowl. Season well with salt and pepper. Add garlic, rosemary, red-pepper flakes, lemon zest and juice. Add 1 tablespoon olive oil and toss the thighs to coat, using hands to smear the mixture evenly over the chicken. Let marinate for 1 hour at room temperature, or, if time permits, overnight in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the peppers: Put 2 tablespoons olive oil in a large, wide skillet with a lid over medium-high heat. When oil begins to look wavy, add onions and stir to coat. When the onions begin to soften (don’t let them brown), add peppers and stir to combine. Season well with salt and pepper, and add garlic and red-pepper flakes. Stir to incorporate and reduce heat to medium. Cover, leaving the lid ajar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook mixture for about 15 minutes, stirring frequently, until completely soft. Add olives, vinegar and capers, and cook for a few minutes more, just to meld the flavors. Taste and adjust seasoning. Sprinkle with oregano. Set aside. Serve warm or at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the chicken: Place a large cast iron or heavy-bottomed skillet over high heat. Add remaining 3 tablespoons olive oil. When oil is wavy, add chicken thighs, skin-side down. Shake the pan to make sure the chicken isn’t sticking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the heat to medium. Place a piece of parchment or aluminum foil on top of chicken and set another skillet on top. Add some weight — a brick or canned goods, for example — to the top skillet. Set heat to low and cook for 20 minutes, checking occasionally to be sure chicken isn’t sticking, until the skin side is beautifully browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn thighs over and cook for 10 minutes more, until thighs are cooked through. (To test, pierce the chicken with a paring knife. The juices should run clear.) If you wish, turn the thighs skin-side down again and let crisp for a few more minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve 1 thigh and a large spoonful of stewed peppers to each guest. Leftover peppers, if any remain, will keep in an airtight container in the refrigerator for up to a week."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022496-crispy-chicken-thighs-with-peppers-capers-and-olives"}