{"@context": "http://schema.org", "@type": "Recipe", "name": "Herby Three-Bean Salad", "description": "Ready for picnics and potlucks, this zippy take on a classically American three-bean salad features crunchy green beans, creamy chickpeas and cannellini beans (and is vegan, too). The marinated vegetables (fennel, celery and onions) add texture and a vinegary kick, while a mix of herbs lend complexity and freshness. Feel free to use whatever combination of canned beans you like; kidney beans are classic, black beans velvety, black-eyed peas earthy. You can prepare this salad up to four hours ahead and keep it at room temperature, or you can make it the day before and refrigerate it. Toss well and add more salt and vinegar, if needed, just before serving.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/06/30/dining/25apperex/merlin_189647289_78b665f3-f7ee-4056-9d01-3a72d998c4f6-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "quick, salads and dressings, side dish", "keywords": "cannellini beans, chickpea, fennel, green beans, fourth of july, labor day, tailgate, spring, summer, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 976}, "recipeIngredient": ["1 1/2 teaspoons coriander seeds", "1 1/4 teaspoons salt, plus more as needed", "1/4 cup unsweetened rice vinegar, plus more to taste", "2 teaspoons minced fresh thyme leaves", "1/2 teaspoon freshly ground black pepper", "1/4 cup extra-virgin olive oil, plus more to taste", "1 cup thinly sliced red onion", "1 cup thinly sliced fennel, celery or a combination", "8 ounces green beans, trimmed and cut into 1-inch pieces (about 2 1/2 cups)", "1 (15-ounce) can chickpeas, drained and rinsed", "1 (15-ounce) can cannellini or Great Northern beans, drained and rinsed", "3/4 cup chopped fresh soft herbs, such as parsley, mint, dill, cilantro or a combination", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a dry medium saucepan (one large enough to hold the green beans in Step 4), toast coriander seeds over medium heat, stirring frequently, until fragrant, 2 minutes. Transfer to a small bowl to cool. Once the seeds are cool enough to handle, use a mortar and pestle to crack them, or place them on a cutting board and crack with the flat side of a chef’s knife. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the same saucepan you used for the coriander with salted water and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While waiting for the water to boil, combine 1/4 cup vinegar, thyme, 1/2 teaspoon salt and 1/4 teaspoon black pepper in large mixing bowl. Slowly whisk in olive oil. Add onion along with fennel or celery, or both, and toss. Set aside to marinate for at least 10 minutes while preparing the rest of the salad."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the boiling water, add the green beans and blanch for 2 to 3 minutes, until they turn bright green and are crisp-tender. Immediately drain beans in a colander, then run cold tap water over them to stop the cooking. Once cool, pat them dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the blanched green beans, chickpeas, cannellini beans, herbs and toasted coriander seeds to the marinated onions. Season with remaining salt and pepper, and gently toss to evenly combine. Taste and add more salt and vinegar if needed. (Keep in mind that you'll also be adding flaky salt to finish.) Drizzle with olive oil and flaky sea salt, and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022333-herby-three-bean-salad"}