{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Pan Fish With Bacon and Sweet Corn", "description": "The delightful textures of this dish’s three main components — crisp bacon, tender fish and plump corn kernels — make for a lovely summer dinner. Tilapia, trout, bass or any other flaky yet firm white fish will work well. Naturally smoked bacon imparts a flavor reminiscent of campfire cooking or outdoor grilling over hot coals. When fresh corn isn’t in season, frozen corn can be used, but will require a minute or two more in the skillet. A squeeze of fresh lemon juice rounds out the dish with its acidity.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2022/04/21/autossell/skillet_fish_thumb/skillet_fish_thumb-mediumThreeByTwo440.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, main course", "keywords": "bacon, corn, fish, kwanzaa", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 963}, "recipeIngredient": ["4 (6-ounce) fish fillets, such as tilapia, snapper, trout or striped bass, skin on or off", "Kosher salt", "1/2 cup chopped flat-leaf parsley leaves and tender stems", "1/2 teaspoon red-pepper flakes", "2 garlic cloves, finely grated", "1 tablespoon chopped thyme leaves (from 5 to 6 sprigs)", "1 lemon", "4 tablespoons extra-virgin olive oil", "4 bacon slices, chopped", "2 small shallots, finely chopped", "2 cups fresh corn kernels (from 2 ears of corn)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly season both sides of the fish fillets with salt. In a large bowl, combine 1/4 cup parsley with the red-pepper flakes, garlic and thyme. Zest the lemon into the bowl and stir in 2 tablespoons olive oil. Transfer the fish to the bowl and turn to coat. Cover and marinate at room temperature for 15 minutes. (The fish can be covered tightly and refrigerated for up to 12 hours.) Cut the zested lemon into 8 wedges and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large skillet over medium. Add the bacon and cook, stirring frequently, until crispy, about 6 minutes. Using a slotted spoon, transfer to a plate lined with a paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat to medium-high. Add the remaining 2 tablespoons olive oil to the bacon drippings in the skillet. Lay the marinated fish fillets in an even layer (skin-side down if your fillets are skin-on) and cover fish with any leftover marinade from the bowl. Cook until the fish is firm, opaque and flakes easily when poked with a fork, 2 to 3 minutes per side. Transfer the fish to a serving platter; keep the skillet on the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the heat to medium, and add the shallots and reserved bacon. Cook, stirring, until the shallots soften, about 2 minutes. Add the corn, stir and cook until just tender, about 2 minutes. Season with salt and squeeze in the juice from 3 lemon wedges. Add the remaining 1/4 cup chopped parsley, stir and spoon over the fish. Serve with the remaining lemon wedges for squeezing."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "One-Pan Fish With Bacon and Sweet Corn", "description": "Yewande Komolafe is in the studio kitchen showing us how to make her recipe for One-Pan Fish With Bacon and Sweet Corn. The delightful textures of its three main components — crisp bacon, tender fish and plump corn kernels — make for a lovely summer dinner. Smoky bacon imparts a flavor reminiscent of campfire cooking or outdoor grilling over hot coals. You can use tilapia, trout, bass or any other flaky yet firm white fish, and when fresh corn isn’t in season, frozen corn works well too. A squeeze of fresh lemon juice rounds out the dish.", "thumbnailUrl": "https://static01.nyt.com/images/2022/04/21/autossell/skillet_fish_thumb/skillet_fish_thumb-mediumThreeByTwo440.jpg", "uploadDate": "2022-04-20T21:17:45.844Z", "duration": "PT7M16S", "transcript": "", "contentUrl": "https://vp.nyt.com/video/2022/04/20/100062_1_YK-pan-seared-fish_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022436-one-pan-fish-with-bacon-and-sweet-corn"}