{"@context": "http://schema.org", "@type": "Recipe", "name": "Jamaican Beef Patties", "description": "The Jamaican beef patty is an island’s history in the palm of a hand. Dubbed Jamaica’s “No. 1 fast food” by Enid Donaldson, author of “The Real Taste of Jamaica,” a beef patty’s filling is spiced, then baked inside of a suet dough. These pastries are often filled with seasoned ground beef, but can include pork, lamb, lobster, shrimp, cheese, chicken and ackee. The dish is a byproduct of Jamaica’s long history — the introduction of spices from African slaves, as well as Indian and Chinese indentured laborers, impacted the patty’s development. But while this meal is found throughout Jamaica, it’s also present wherever the Caribbean diaspora is around the globe. Both the dough and the filling can be made prior to baking. Eat with <a href=\"https://cooking.nytimes.com/recipes/1017775-coco-bread\">coco bread</a> for a more substantial meal.", "author": {"@type": "Person", "name": "Bryan Washington"}, "image": "https://static01.nyt.com/images/2022/02/27/magazine/27mag-eat-site/27mag-eat-site-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "10 patties", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 168}, "recipeIngredient": ["3 1/2 cups/450 grams all-purpose flour, plus more for rolling", "3 teaspoons/7 grams ground turmeric", "2 teaspoons granulated sugar", "1 1/2 teaspoons kosher salt (Diamond Crystal)", "1 cup/187 grams vegetable shortening", "1/2 packed cup/67 grams minced or ground unrendered beef suet (see Tip)", "1/2 to 3/4 cup/118 to 177 milliliters ice cold water", "1 tablespoon vegetable oil", "2 small Scotch bonnet peppers, seeded and minced", "1 medium onion, diced", "1 pound beef chuck, minced or ground", "2 teaspoons ground allspice", "1 1/2 teaspoons ground black pepper", "1 teaspoon garlic powder", "1 teaspoon paprika", "1 tablespoon soy sauce, preferably dark soy sauce", "2 small beef stock cubes (14 grams), dissolved in 3 tablespoons boiling water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Whisk flour in a medium bowl, then whisk in turmeric, sugar and salt. Work in shortening and beef suet quickly, rubbing them into the dry ingredients with your fingers until the mixture is evenly crumbly. Gradually add 1/2 cup ice cold water while stirring with your hands to form the dough. If the dough isn’t coming together, add more water by the tablespoon as necessary.  Form dough into a ball, cover with cling wrap and refrigerate for at least 1 hour or up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the dough is chilling, make the filling: Heat a large frying pan over medium, then add vegetable oil. Fry scotch bonnet peppers and onion, stirring occasionally, until softened, about 5 minutes. Add beef and cook, stirring occasionally, until browned, 4 to 8 minutes. Season with allspice, black pepper, garlic powder, paprika, soy sauce and the beef stock mixture. Cook, stirring, until most of the liquid evaporates, 1 to 2 minutes. Transfer to a dish and let cool completely at room temperature or in the refrigerator. (The filling can be refrigerated in an airtight container for up to 2 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to assemble patties, heat oven to 375 degrees. Remove dough from the refrigerator and roll on a lightly floured work surface with a lightly floured pin into a 12-inch square. (Turmeric will stain a porous work surface. Roll between sheets of parchment paper if needed.) Fold dough in half to form a rectangle, then fold again the other way to form a square. Roll again into a 12-inch square. Repeat this process 3 more times, letting dough rest as needed if it’s too stiff to roll. Roll to 1/8-inch thickness, then use a bowl or pastry cutter to cut out 10 (6-inch) rounds, rerolling scraps as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide beef mixture among rounds, spooning about 1/4 cup onto one side of each round. Fold the other side of each round over the meat until the edges meet. Using a fork, seal the edges, then prick the center of each to allow steam to escape. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place patties on 1 or 2 baking sheets, and bake until pastry is set and golden, 22 to 25 minutes. Serve hot, warm or at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022994-jamaican-beef-patties"}