{"@context": "http://schema.org", "@type": "Recipe", "name": "Fig and Cherry Cookie Pies", "description": "Similar to cucidati, the Italian fig cookies traditionally served at Christmastime, these adorable mini pies are filled with dried figs, dried cherries and almonds, then topped with a pretty almond-flavored glaze. But unlike most cucidati recipes, this one calls for softening the dried fruit in simmering water before it is puréed with nuts and spices. Sometimes dried fruit from the store comes without a drop of moisture left in it, so rehydrating it helps bring back some softness and ensures that the filling doesn’t rob moisture from the pastry as it bakes.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2021/12/08/dining/08COOKIESREX4-FIGPIES/merlin_198248580_c5c16139-694f-4d1d-b453-e2013970c559-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "About 2½ dozen cookies", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "almonds, cherries, christmas cookie, figs, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 251}, "recipeIngredient": ["3 cups/408 grams all-purpose flour, plus more for dusting", "3/4 cup/92 grams confectioners’ sugar", "3/4 teaspoon kosher salt (Diamond Crystal)", "1 cup plus 2 tablespoons/256 grams cold unsalted butter, cut into cubes", "3 large egg yolks", "5 tablespoons/75 grams heavy cream, plus more as needed", "1/2 cup/82 grams loosely packed chopped dried figs, hard stems removed (about 6 dried figs)", "1/2 cup/80 grams dried sweetened sour cherries or cranberries, chopped", "1/4 cup/38 grams raw or roasted almonds", "3 tablespoons/41 grams dark brown sugar", "2 tablespoons dark rum", "1 tablespoon freshly grated orange zest (from 1 orange)", "1 teaspoon ground cinnamon", "1/2 teaspoon kosher salt (Diamond Crystal)", "1 cup/123 grams confectioners’ sugar, sifted", "1/2 teaspoon almond extract", "3 to 4 tablespoons heavy cream", "Sprinkles"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pastry: Combine the flour, confectioners’ sugar and salt in the bowl of a food processor. Add the butter and pulse until the mixture resembles a coarse meal. Add the egg yolks and cream, and pulse just until the dough starts to come together. Add more cream if necessary, but stop before the dough is too wet. Tip the dough out onto a piece of plastic wrap and form it into a ball, divide in two and wrap each half in plastic wrap. Chill for at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the filling: In a small saucepan, combine the figs, cherries and 1¼ cups water, and bring to a low simmer over medium heat. Cook until the figs are very soft, about 15 minutes, adding a little more water as necessary to make a moist paste. Transfer to the bowl of a food processor and add the almonds, brown sugar, rum, orange zest, cinnamon and salt, and pulse until you have a relatively smooth paste. (You should have about 1¼ cups filling.) Let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 2 baking sheets with parchment paper. Working with 1 ball at a time, roll the dough out to ⅛-inch thickness on a very lightly floured surface. Use a 2¼-inch cookie cutter to cut out circles. Transfer the circles to the prepared baking sheet. Scoop about a scant tablespoon of filling onto half of the dough circles. Brush the edges of the filled circles with a bit of cream and top with another dough circle, gently pressing the edges to seal. Repeat with the remaining dough and filling. (If the dough becomes too soft, pop it into the fridge to firm up before continuing.) You can reroll and cut the dough scraps one time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill the pies for 10 minutes. Use a fork to crimp all of the edges. (If you’d like to neaten the edges, you can go over the cookies again with the cookie cutter.) Refrigerate the cookies for at least 30 more minutes. While the cookies chill, heat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the top of each cookie with cream. Bake until they’re golden and crisp, 25 to 30 minutes, rotating the sheets halfway through. Transfer cookies to a rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the glaze: In a small bowl, whisk together the sugar, almond extract and 3 tablespoons cream. The icing should be spreadable. If it isn’t, stir in another tablespoon cream. Spread a bit of the glaze on each cookie and top with sprinkles. Store in an airtight container at room temperature for up to 3 days or freeze for a month."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022693-fig-and-cherry-cookie-pies"}