{"@context": "http://schema.org", "@type": "Recipe", "name": "Dutch Oven Chicken and Vinaigrette", "description": "This is a simple dish: chicken that’s a little bit braised and a little bit roasted in a covered Dutch oven. The seasonings — garlic, onions, herbs and lemon — are basic and border on assertive until they cook together, when their aromas intensify and their flavors soften. Putting half the aromatics in the pot with oil and wine, tucking the other half inside the chicken and cooking in this enclosed, steamy environment means that everything that goes into the pot goes into the chicken. When the chicken’s cooked through, pour off the pan juices, crush the tender garlic and add sharp mustard and vinegar to make a vinaigrette that’s as good over salad greens as over the chicken.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2021/09/05/magazine/05mag-eat-web/05mag-eat-web-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, main course", "keywords": "dijon mustard, dutch oven, roast chicken, sherry vinegar, whole chicken", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1512}, "recipeIngredient": ["1/4 cup olive oil", "1 medium onion (preferably yellow), trimmed, peeled and cut into eighths", "1 head garlic, cut crosswise", "5 fresh thyme sprigs ", "5 fresh rosemary sprigs ", "Fine or coarse sea salt", "Freshly ground black pepper", "1 whole chicken (about 4 pounds)", "1/2 lemon", "3/4 cup white wine", "2 teaspoons Dijon mustard", "2 tablespoons wine vinegar (preferably sherry)", "1 teaspoon walnut oil (optional)", "3 to 4 handfuls salad greens"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chicken: Heat oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 3 tablespoons of the olive oil into a Dutch oven large enough to hold the chicken, then toss in all but 1 piece of the onion. Add the garlic and 4 sprigs each of the thyme and rosemary. Stir to coat, then season generously with salt and pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the chicken dry, season the inside with salt and pepper, and tuck in the remaining piece of onion and herb sprigs. Rub the chicken with the remaining 1 tablespoon olive oil and season with salt and pepper. Squeeze the juice from the lemon half over the bird, and then pop the lemon inside it with the herbs and onion. Settle the chicken into the pot, breast side up. Pour in the wine and cover."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the chicken for 60 minutes, then check on it: It’s done when a thermometer plunged into the thickest part of the thigh has reached 165 degrees. If it’s done but doesn’t have enough color for you, you can run it under the broiler for a few minutes; if it’s not done, remove the lid and continue to roast until done, 15 to 30 minutes more. Transfer the chicken to a platter, cover loosely with a foil tent, and let rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chicken rests, make the vinaigrette: Pour off the pan drippings, measure out 6 tablespoons and return them to the pot. (If your drippings are scant or very dark, you can still use them. Keep any extra drippings for another use.) Hold onto the garlic but discard the onion and herbs from the pot. Place the pot over medium heat, pour in 1/2 cup water, and boil for a couple of minutes, scraping the bottom of the pan to pick up any stuck bits. You should have about 1/3 cup of drippings; if they’re very chunky, strain them when you add them to the vinaigrette."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in a medium bowl, mash 6 to 8 cloves of the soft garlic with the mustard, then whisk in the vinegar. Slowly whisk in the reserved liquid, followed by the walnut oil, if using.  Taste for salt and pepper, then pour the vinaigrette into a small pitcher."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, carve the chicken, cutting it into quarters or eighths, and arrange on the platter. Pour over a little of the vinaigrette. Dress the salad greens lightly with vinaigrette and serve on the platter or in a shallow bowl. Pass the rest of the sauce at the table."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022498-dutch-oven-chicken-and-vinaigrette"}