{"@context": "http://schema.org", "@type": "Recipe", "name": "Nonya Hokkien Stir-Fried Noodles", "description": "The Singaporean cookbook author Sharon Wee, who wrote “Growing Up in a Nonya Kitchen,” customarily makes these slick noodles tossed in a savory sauce for Lunar New Year’s Eve to mark the beginning of the two week-long celebrations. Her mother taught her how to throw proper Peranakan feasts, which include a unique blend of Malay, European and Chinese influences. They spent weeks pickling vegetables in spiced vinegar, making pork liver meatballs and braising duck in a tamarind gravy. This simple stir-fry is anchored by juicy pork belly and shrimp, and topped with pale yellow egg strips, bright red chiles and vibrant mustard greens. It is best enjoyed with a dollop of <a href=\"https://cooking.nytimes.com/recipes/1022900-sambal-belacan\">sambal belacan</a>, which gives it a hit of heat, and served with braised cabbage and chicken curry.", "author": {"@type": "Person", "name": "Clarissa Wei"}, "image": "https://static01.nyt.com/images/2022/01/26/dining/21SINGAPOREREX1-nonya-hokkien-noodles/merlin_200287542_efe45dba-cba0-4d36-9251-db4645db517f-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "noodles, main course", "keywords": "lunar new year, pork, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 419}, "recipeIngredient": ["1 pound fresh lo mein noodles (see Tip)", "2 large eggs", "Fine salt", "1/2 teaspoon plus ¼ cup canola oil", "3 large shallots, sliced thinly", "1 tablespoon fermented soybean paste (taucheo) or Korean doenjang", "3 garlic cloves, minced", "4 ounces pork belly, cut into very thin 2-inch-long slices", "4 ounces shelled and deveined medium shrimp", "1 cup low-sodium chicken broth, plus more if desired", "4 ounces mustard greens or bok choy, cut into 2-inch pieces", "1 1/2 cups bean sprouts", "3/4 teaspoon ground white pepper, plus more to taste", "2 Holland or other fresh red chiles, seeded and thinly sliced, for garnish", "Cilantro sprigs, for garnish", "<a href=\"https://cooking.nytimes.com/recipes/1022900-sambal-belacan\">Sambal belacan</a>, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large saucepan of water to a boil. Add the noodles and cook just until tender, 1½ minutes. Drain well, rinse under water and drain again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the eggs in a bowl and add a pinch of salt. Brush ½ teaspoon oil on a nonstick frying pan and set over medium-low heat. When the oil is hot, pour in the eggs and tilt the pan so that the eggs form a thin and even film. Cook until firmly set, 4 to 5 minutes. With a spatula, ease the omelette off the pan and flip onto a cutting board. When the omelette is cool enough to handle, gently roll it and slice into thin strips, cutting longer strips in half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large wok or very large skillet over medium-high and add the remaining ¼ cup oil. Add half of the sliced shallots and continuously stir until they are crispy and light golden brown, about 5 minutes. Turn off the heat and transfer the fried shallots using a slotted spoon to a paper-towel-lined plate, and save for garnish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the wok with the oil over medium and add the fermented soybean paste, garlic, and remaining shallots. Stir until the mixture is fragrant, about 40 seconds. Add the pork, shrimp and 1 cup chicken broth. Raise the heat to high and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the mustard greens, lo mein noodles and bean sprouts. Toss well to combine, and cook until the pork and shrimp are cooked through, about 3 minutes. There should barely be any broth left, but if you prefer a soupier consistency, add up to 1 cup more stock. Season with 1 teaspoon salt and the white pepper, then taste and season with more if you’d like. Transfer to a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, garnish with the egg strips, fried shallots, chiles and cilantro. The noodles are best enjoyed with a side of <a href=\"https://cooking.nytimes.com/recipes/1022900-sambal-belacan\">sambal belacan</a>."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022894-nonya-hokkien-stir-fried-noodles"}