{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon-Pepper Chicken Wings", "description": "Lemon pepper usually refers to a store-bought spice blend of dehydrated lemon zest, black pepper and other seasonings, but the beloved pantry staple is simple enough to recreate at home: Rub oven-dried lemon zest into fresh, coarsely ground black pepper to release the oils of each. Magic ensues as the lemon gains the fruity muskiness of the pepper, and the pepper is slicked with the fragrant balm of the lemon. The citric acid is optional, but provides lemon pepper’s characteristic tartness. Sprinkled over roasted chicken wings, this golden dust gives off high-voltage flavors. To make this with store-bought lemon pepper, skip Steps 3 and 4 and simply toss the roasted wings with a dusting of the seasoning to taste.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2021/12/16/magazine/16mag-eat-site/16mag-eat-site-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 appetizer servings", "recipeCuisine": "", "recipeCategory": "snack, poultry, appetizer", "keywords": "black pepper, chicken wings, lemon zest, super bowl, tailgate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 565}, "recipeIngredient": ["2 pounds chicken wings, whole or separated into wingettes and drumettes", "1/4 cup olive oil", "1 teaspoon kosher salt (Diamond Crystal)", "2 lemons", "2 teaspoons coarsely ground black pepper", "1 1/2 teaspoons kosher salt (Diamond Crystal)", "1 packed teaspoon dark brown sugar", "1/2 teaspoon garlic powder", "1/4 teaspoon citric acid (optional; see Tip)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chicken wings: Heat oven to 400 degrees and line a sheet pan with parchment paper. On the sheet pan, pat the chicken wings dry, and toss with the olive oil and salt until evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until the chicken skin is golden brown and crispy, turning once halfway through, 30 to 40 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the lemon pepper: Finely grate about 2 teaspoons zest from the lemons onto another parchment paper-lined pan (a considerably smaller one works). Cut the lemons into wedges and set aside for serving. Add pepper to the zest, mix to combine and spread in an even layer. When the wings are done roasting, transfer them to a large mixing bowl and turn off the oven. Place the pan with the lemon zest and black pepper in the still-warm oven, letting the lemon zest dry out and the black pepper toast in the residual heat, 3 to 5 minutes. Be careful not to burn or brown the zest; it may darken in shade slightly but should still be a vibrant yellow."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, use your fingers to mix together the toasted lemon zest and black pepper with the salt, brown sugar, garlic powder and citric acid (if using) until well combined. Be sure to break up any clumps of sugar. Sprinkle 4 teaspoons of the lemon pepper over the wings and toss until evenly coated. Taste for seasoning, adding more lemon pepper as desired. (You can store the rest of the spice blend in an airtight container in a cool, dry place for up to 1 month.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the seasoned wings to a large platter and garnish with the lemon wedges. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022848-lemon-pepper-chicken-wings"}