{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Shrimp Cakes With Chile-Lime Mayo", "description": "Savory fried shrimp cakes are popular in coastal areas in many parts of the world, with each region adding its own vibrant flavors to the mix. Here, the golden-edged patties are shot through with fresh basil and cilantro for brightness, chiles for heat and a little fish sauce (an ingredient often found in Southeast Asian recipes) for depth. Then, as an untraditional binder, crushed-up rice cakes are mixed in with the shrimp for an ethereal, especially crisp result. But panko or cracker crumbs make acceptable substitutes if rice cakes aren’t available.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/12/01/dining/24Apperex/merlin_196810995_3a55e101-b547-478d-8c40-35b77bebf5bb-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "weekday, seafood, main course", "keywords": "cilantro, rice cakes, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 581}, "recipeIngredient": ["3 to 5 large original or lightly salted rice cakes, or 6 to 10 thin cakes (see Tip)", "1 pound shelled large raw shrimp (20 to 24), coarsely chopped", "1/4 cup minced shallot (or use onion or scallion)", "6 tablespoons chopped cilantro", "6 tablespoons chopped basil leaves, more for serving", "3 tablespoons minced jalapeño or red chile pepper", "2 1/2 teaspoons fish sauce", "Fine sea salt and freshly ground black pepper", "1/2 cup mayonnaise", "1 lime", "Safflower, peanut or grapeseed oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of the food processor (or you can use a blender), add the rice cakes and pulse until you get 1 1/4 cups rice cake crumbs. Return 1/4 cup crumbs to the food processor, reserving the remaining 1 cup for coating the cakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add shrimp, shallot, 4 tablespoons each of the cilantro and basil, and 2 tablespoons jalapeño to the crumbs. Add 2 teaspoons fish sauce, and a pinch each salt and pepper. Pulse until the mixture forms a coarse, chunky paste. (Be careful not to overprocess; if using a blender, scrape down the sides frequently.) Transfer to a bowl, cover and refrigerate while you make the sauce (at least 15 minutes and up to 24 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together mayonnaise, remaining cilantro, basil, jalapeño and fish sauce. Zest the lime into the bowl, then cut the naked lime into wedges and squeeze in some juice. Salt to taste. Reserve extra lime wedges for serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread remaining 1 cup rice cake crumbs out onto a plate or sheet pan. With wet hands to keep shrimp paste from sticking, form 2 tablespoons of shrimp mixture into a 1/2-inch-thick patty and put it on top of the crumbs. Repeat with remaining shrimp mixture, re-wetting your hands as necessary. Turn the patties over in the crumbs to coat both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large skillet over medium-high. Fry patties in batches until golden brown, 3 to 4 minutes per side. Serve shrimp cakes topped with more basil leaves, with chile-lime sauce for dunking and lime wedges on the side for squeezing."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022786-crispy-shrimp-cakes-with-chile-lime-mayo"}