{"@context": "http://schema.org", "@type": "Recipe", "name": "Cazuela", "description": "Puerto Rican cazuela, a richly spiced crustless pie with a texture between thick custard and bread pudding, is a unique dessert with a complex history. The name means “cooking pot” in Spanish, and the key ingredients — batata (white sweet potato), pumpkin and coconut milk — and the traditional cooking process speak to the island’s African ancestry. Flavored with ginger, cloves, cinnamon and anise, this dish also includes spices brought to the Caribbean during the spice trade. Cazuela has been prepared since at least the 19th century, and today it’s largely reserved for holidays. This version is an adaptation of the classic, with sweet plantain added for flavor, and a tip for using canned ingredients. While this dessert may seem challenging at first glance, it is incredibly adaptable and can be prepared days in advance in a casserole dish, ramekins or even foil cupcake tins.", "author": {"@type": "Person", "name": "Von Diaz"}, "image": "https://static01.nyt.com/images/2021/11/09/dining/vd-cazuela/merlin_197232318_f0667075-5cbe-4302-a6b5-5bef19a6339c-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "10 servings", "recipeCuisine": "caribbean", "recipeCategory": "pies and tarts, dessert", "keywords": "calabaza, coconut milk, plantain, pumpkin, sweet potato, christmas, thanksgiving, fall, winter, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 390}, "recipeIngredient": ["1 to 2 large banana leaves, trimmed of stiff edges (optional) ", "3 1/2 tablespoons salted butter, softened", "2 star anise pods", "2 teaspoons coarse kosher salt ", "1 1/2 pounds/680 grams white sweet potatoes (Korean or Dominican), peeled and chopped into 2-inch chunks (about 4 heaping cups) (see Tip)", "1 1/2 pounds/680 grams calabaza or pumpkin, seeded, peeled and chopped into 2-inch chunks (about 4 heaping cups) ", "1 large very ripe plantain, peeled and sliced into 2-inch rounds (about 1 to 2 cups) ", "1 cup/240 milliliters full-fat coconut milk, stirred very well", "3 large eggs", "2 tablespoons brandy", "1 teaspoon vanilla extract ", "1 teaspoon ground cinnamon ", "1 teaspoon ground ginger ", "1/2 teaspoon ground cloves", "1 cup/220 grams dark brown sugar", "1/2 cup/78 grams rice flour or all-purpose flour", "1/2 cup/72 grams golden raisins", "Lightly sweetened whipped cream, toasted grated coconut, dark chocolate shavings, for topping (optional) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using banana leaves, soften them by gently heating each side, turning continuously, over an open gas burner until pliable, about 1 or 2 minutes. (If your banana leaves are already soft and pliable, you can skip this step.) Tuck leaves into a 2.5-liter baking dish, overlapping as needed to cover the bottom and sides, and trimming any pieces that go over the edge of the dish with a sharp pair of scissors. Grease the banana leaves, or 10 (8-ounce) ramekins with 1/2 tablespoon of softened butter. If using ramekins, arrange on a rimmed baking sheet. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 3 quarts of water to a boil over high heat in a large pot. Add the anise pods and 1 teaspoon salt, then add the sweet potato and boil for 10 minutes. Add the pumpkin and plantain, and boil for another 15 to 20 minutes, until everything is fork tender. (Adding these ingredients in batches ensures they cook evenly, and that the pumpkin, in particular, doesn’t fall apart.) Transfer to a large mesh strainer, discard the anise pods, rinse with cold water and let drain fully."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sweet potatoes boil, heat the oven to 400 degrees. In a small bowl, combine the coconut milk, eggs, brandy, and vanilla. In a medium bowl, combine the cinnamon, ginger, cloves, sugar, flour and remaining 1 teaspoon salt. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer sweet potato, pumpkin and plantain to the bowl of a stand mixer fitted with a whisk attachment, or a large mixing bowl if using a handheld electric mixer. Let cool for 5 to 10 minutes, then add remaining 3 tablespoons of softened butter and blend on medium speed until smooth, about 3 minutes. Add wet ingredients and blend to fully incorporate. Add dry ingredients and blend until mixture is silky smooth and resembles a loose pudding, about 2 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold in raisins using a spatula, then pour the mixture into the prepared baking dish or ramekins, and bake for 45 minutes to 1 hour (40 to 50 minutes if using ramekins). Test by poking the center with a toothpick or skewer; if it doesn’t come out clean, bake for 5 to 10 more minutes. The cazuela should be firm with a golden top. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and place on a wire rack to fully cool, about 30 minutes. Cazuela should separate easily from banana leaves or buttered ramekins, and either be eaten directly from the container, or flipped onto a plate. If you plan to unmold, turn the cazuela out onto a large rectangular platter, then peel off and discard the banana leaves, if using. Serve topped with whipped cream and toasted coconut or dark chocolate shavings, or a combination. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022736-cazuela"}