{"@context": "http://schema.org", "@type": "Recipe", "name": "Bulgur Mujadara", "description": "Mujadara is one of the most popular dishes across the Levant, with a complex taste that belies its simple ingredients. The mix of contrasting tastes — sweet onions with savory hearty lentils, tender bulgur with crunchy fried onions — is a feast for the tastebuds. The dish is quite forgiving as there is no right or wrong texture. Some people prefer it fluffy like a pilaf while others prefer it more dense, like sticky rice. This version falls somewhere in the middle. Since lentils and bulgur absorb different amounts of liquid depending on variety, check on them periodically, taste and add water as necessary while cooking. The finished dish is equally delicious warm or at room temperature. It is wholesome on its own, but combined with yogurt and served with a chopped salad, bread and olives, it becomes a most satisfying meal.", "author": {"@type": "Person", "name": "Reem Kassis"}, "image": "https://static01.nyt.com/images/2021/10/20/dining/15OILREX2-bulgur-mujadara/merlin_196137198_64915b1a-bb3a-426e-b8cd-a4cc99f76c21-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, beans, grains and rice, main course, side dish", "keywords": "bulgur, lentils, onion, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 152}, "recipeIngredient": ["1 cup whole lentils (black, le Puy, brown or green), picked over and rinsed", "1/2 cup olive oil", "3 medium yellow onions, finely diced", "1 teaspoon fine sea salt", "1/2 teaspoon ground cumin", "1 cup coarse bulgur", "Vegetable oil, for frying", "1 large yellow onion", "1 teaspoon cornstarch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the mujadara: Bring lentils and 4 cups of water to a boil in a medium pot over high. Reduce heat to low and simmer until lentils are partly cooked, 12 to 18 minutes. Taste a lentil to see if it’s tender but still has a bite. The timing depends on the lentil variety: Black and le Puy need the most time; green needs the least. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the olive oil in a medium frying pan over medium-high. Add the onions and cook, stirring regularly, until deep golden brown and starting to crisp, 15 to 20 minutes. It is important to get them to this point because dark onions give mujadara its distinctive dark color and flavor. Onions go from deep brown to burned very quickly, so be sure to remove from the heat before they burn."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the onions with the oil over the lentils, and stir in the salt and cumin. Add the bulgur, bring the mixture to a boil, then reduce heat to lowest setting and simmer, covered, until fully cooked, 10 to 15 minutes. Check on the mujadara periodically: If the bulgur and lentils are not fully cooked but the water has evaporated, add a few tablespoons of water and continue to cook until done. Place a tea towel or paper towels under the lid and let sit for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you are making the optional topping, prepare it while the mujadara rests: Heat about 1 inch vegetable oil in a small saucepan over medium to 350 degrees or until a small morsel of bread bubbles and immediately rises to the top. Cut the onion in half and slice through the core to create very thin crescents. Place onions in a medium bowl, sprinkle with the cornstarch and toss to combine. Working in small batches, carefully add to hot oil and fry, stirring occasionally for even browning, until crisp and golden brown, 1 to 2 minutes. Remove with a slotted spoon and drain on paper towels until dry and crispy, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, transfer mujadara to a serving platter and top with crispy onions, if using."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022595-bulgur-mujadara"}