{"@context": "http://schema.org", "@type": "Recipe", "name": "Khoresh Kadoo Halvaii (Butternut Squash Stew)", "description": "Khoresh kadoo halvaii is a popular and comforting fall dish from the northern region of Iran and is typically prepared with meat or chicken. This version swaps out the meat for canned chickpeas and is just as flavorful. Dried fruits are commonly used in Iranian cuisine to infuse a variety of savory dishes with a sweet and sour taste. Traditionally, dried golden sour prunes, aloo Bukhara, are added to this stew for a pleasing and distinct sour flavor, but pitted dark prunes, which lean a little sweeter, can be used. If using aloo Bukhara, be mindful of their pits when eating.\n \nTo get vegetarian recipes like this one delivered to your inbox, <a href=\"https://www.nytimes.com/newsletters/the-veggie\">sign up for The Veggie newsletter</a>.", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2021/11/19/dining/ND-butternut-squash-stew/merlin_196270077_ffae56fd-68e1-4b1a-a8b6-8e31b583fcdb-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, soups and stews, main course", "keywords": "butternut squash, chickpea, tomato, fall, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 401}, "recipeIngredient": ["A pinch of saffron threads (about 3/4 teaspoon)", "1 tablespoon plus a pinch of granulated sugar, more as needed", "1 pound precut butternut squash, cut into 1-inch cubes if needed", "1/4 cup plus 1 tablespoon extra-virgin olive oil, plus more as needed", "Kosher salt (Diamond Crystal) and black pepper", "1 large yellow onion, finely chopped", "1/2 teaspoon ground turmeric", "1 (15-ounce) can chickpeas, rinsed and drained", "1 tablespoon tomato paste", "20 pitted prunes or dried golden sour prunes (aloo Bukhara), rinsed (see Tip)", "2 tablespoons lemon juice, plus more as needed", "Steamed rice, fresh herbs, scallions and plain yogurt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Line a baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 2 tablespoons water to a boil in a small saucepan or kettle, or using the microwave, then let stand for 2 minutes to allow the temperature to drop slightly while you grind the saffron. Using a mortar and pestle (or small bowl and the handle of a wooden spoon), grind the saffron with a pinch of sugar to a fine powder (scant 1/4 teaspoon), add the hot water, gently stir, cover and let steep until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the butternut squash in a mound in the center of the prepared baking sheet. Add 1 tablespoon oil and 1 teaspoon salt, and season with pepper. Toss to combine. Scatter the squash across the baking sheet in an even layer, and roast for 10 minutes. Flip the squash and roast until golden and almost tender, about 10 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium pot, heat remaining 1/4 cup oil over medium-high, add the onion and cook, stirring occasionally, until golden brown, 10 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to medium, sprinkle the onion with a little salt, add the turmeric and stir until fragrant, about 30 seconds. Add the chickpeas, season well with salt and pepper, and cook, stirring frequently, until slightly browned and crisp, about 10 minutes. With the back of a wooden spoon, crush a few chickpeas to release their starches. Taste the chickpeas and make sure they’re seasoned to your liking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Push the chickpeas to the sides and make a little space in the middle of the pot; if the pot is dry, drizzle in a little more oil. Add the tomato paste to the oil to cook off its raw taste, stirring continuously and taking care not to burn the paste, about 1 minute. Mix the tomato paste with the chickpeas, add 2 cups water and bring to a gentle boil, scraping up any bits stuck to the bottom of the pot. Reduce heat to medium-low, and add the prunes and half of the saffron water. Stir, cover and simmer for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the roasted squash, lemon juice, 1 tablespoon sugar and the remaining saffron water. Gently stir to combine, cover and simmer over low heat until the flavors meld, about 15 minutes. The stew should be saucy but not soupy: add more water if the stew is too thick, or simmer uncovered if it’s too loose. Taste for seasoning and add more lemon juice or a little more sugar if needed to balance all the flavors. Serve over rice with herbs, scallions and a dollop of plain yogurt."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022666-khoresh-kadoo-halvaii-butternut-squash-stew"}