{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Sheet-Pan Noodles With Glazed Tofu", "description": "Contrasting textures are a signature characteristic of Cantonese chow mein, in which crispy fried strands tangle with tender noodles. Here, that is achieved with the help of a sheet pan and an intensely hot oven. To ensure optimal crunch, start with the pan on the bottom rack to crisp the underside of the noodles, then move it up to the highest to encourage crackly noodles on top, too. Instant ramen noodles are the perfect choice for this recipe because they crisp up flawlessly; just soak them in boiling hot water to loosen them up before sliding them into the oven. The hoisin-marinated tofu is subtly sweet and carries a lot of the flavor in this noodle dish. Quick cooking baby bok choy adds freshness, but you could also use leftover vegetables or seasonal produce.\n \nTo get vegetarian recipes like this one delivered to your inbox, <a href=\"https://www.nytimes.com/newsletters/the-veggie\">sign up for The Veggie newsletter</a>.", "author": {"@type": "Person", "name": "Hetty McKinnon"}, "image": "https://static01.nyt.com/images/2021/10/13/dining/hm-crispy-ramen/merlin_195007359_3797c15f-a677-4940-b6aa-44215246ac28-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, noodles, main course", "keywords": "bok choy, extra-firm tofu, hoisin sauce, ramen noodle, sesame oil, sheet-pan, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 3547}, "recipeIngredient": ["3 blocks instant ramen noodles (about 9 ounces), flavor packets discarded", "2 tablespoons sesame oil", "2 tablespoon neutral oil, such as grapeseed or vegetable", "2 tablespoons soy sauce", "Kosher salt", "1 14-ounce package extra-firm tofu, patted dry and cut into 1/4-inch thick slices", "3 baby bok choy, trimmed and sliced vertically into 4 pieces", "Handful of cilantro leaves", "2 tablespoons hoisin", "1 tablespoon sesame oil", "1 tablespoon maple syrup", "1 garlic clove, grated", "1 teaspoon sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees and place one rack on the top and one on the bottom. Fill a kettle or medium pot with water (about 8 cups) and bring to a boil. Place the noodles in a heat-proof bowl and cover with boiling water. Soak for 5 minutes, then drain. Set aside the bowl to use in Step 5."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the marinade: In a medium bowl, whisk to combine the hoisin sauce, sesame oil, maple syrup, garlic and sesame seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the noodles on a sheet pan. Add the sesame oil, 1 tablespoon of neutral oil, soy sauce, and 1/2 teaspoon of kosher salt. Toss to combine, then spread the noodles out evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip each tofu slice into the marinade, coating both sides, then add them to the sheet pan, pushing the noodles aside so that the tofu touches the pan and doesn’t just sit on top of the noodles. Place on the bottom rack of the oven and bake for 15 minutes. Reserve excess marinade."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the baby bok choy into the reserved bowl, then add the remaining 1 tablespoon of neutral oil and 1/2 teaspoon of kosher salt, and toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the sheet pan from the oven (the noodles should be crisp on the bottom and around the edges) and add the bok choy to the pan. Return the sheet pan to the top rack of the oven and bake for 4 to 7 minutes until the greens are vibrant with crispy edges, and the top of the noodles are crispy. Drizzle with the remaining marinade, top with cilantro leaves and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022637-crispy-sheet-pan-noodles-with-glazed-tofu"}