{"@context": "http://schema.org", "@type": "Recipe", "name": "Gochugaru Salmon With Crispy Rice", "description": "Gochugaru, a mild, fragrant red-pepper powder, bedazzles this quick salmon dinner. As a key ingredient in Korean home cooking, gochugaru proves that some chiles provide not only heat but fruity sweetness as well. Here, that’s especially true once it’s bloomed in maple syrup, vinegar and butter. If you like shiny things, you may find great pleasure in watching this pan sauce transform into a mirrored, crimson glaze. Try to get long center-cut salmon fillets for uniform thickness and even cooking. Their crispy skin tastes wonderful with white rice, which toasts in the rendered salmon fat. To balance the richness of the fish, serve it with fresh, crunchy things, like cucumbers or pickles, or a big green salad.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2021/05/11/dining/ek-gochugarusalmonrex/merlin_187444383_55a878ea-d639-4e10-aa91-15335f054601-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weeknight, seafood, main course", "keywords": "gochugaru, maple syrup, rice, salmon fillet", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2581}, "recipeIngredient": ["4 skin-on salmon fillets (6 ounces each) ", "Kosher salt (such as Diamond Crystal) and black pepper", "1 tablespoon olive oil", "4 cups cooked white rice, preferably leftovers", "4 teaspoons gochugaru (see Tip)", "2 tablespoons maple syrup", "2 tablespoons rice vinegar", "2 tablespoons cold, unsalted butter, kept whole", "Sliced cucumbers or pickles, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the salmon on all sides with salt and pepper. Heat a large cast-iron or nonstick skillet over medium-high. Add the olive oil and sear the salmon fillets skin side down until the skin is browned and crispy, 2 to 5 minutes. The salmon’s orange flesh will begin to turn pale coral as the heat slowly creeps up the sides of the fish; you want that coral color to come up about two-thirds of the way at this point for a nice medium-rare. Carefully flip the salmon and cook the second side until the flesh feels firm, another 1 to 2 minutes. When you press it, it should not feel wobbly. Transfer the salmon to a plate skin side down and keep the pan with the rendered fat over the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice to the fat in the pan and spread in an even layer, packing it down as if making a rice pancake. Reduce the heat to medium and cook until the bottom is lightly browned and toasted, about 5 minutes. You should hear it crackle. Flip the rice like a pancake, using a spatula if needed. You may not be able to flip it all in one piece, but that’s OK. Cook until lightly toasted on the second side, another 1 to 2 minutes. Go longer if you want crispier rice, but the trifecta of crispy-chewy-soft tastes wonderful."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the rice is cooking, stir together the gochugaru, maple syrup, rice vinegar and 1 teaspoon salt in a small bowl. When the rice is done, divide it evenly among the plates. In the now-empty pan, add the gochugaru mixture and cook, stirring constantly, over medium-high heat until it bubbles up and reduces significantly, 15 seconds to 1 minute. It should look pretty sticky. Turn off the heat and add the cold butter, stirring with a wooden spoon or tongs until fully melted and incorporated into the gochugaru mixture. Pour this glaze over the salmon and serve with cucumbers or pickles, if you’d like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022132-gochugaru-salmon-with-crispy-rice"}