{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti al Limone With Shrimp", "description": "There are many interpretations of the classic Italian pasta dish, <a href=\"https://cooking.nytimes.com/recipes/1018692-spaghetti-al-limone\">spaghetti al limone</a>, or spaghetti with lemon. Some call for an Alfredo-like sauce made with heavy cream, butter and Parmesan, while others rely on just olive oil, lemon juice, Parmesan and starchy pasta water. This particular recipe, which adds sautéed shrimp, white wine and fresh tarragon to the mix, leans toward the simpler preparation. Without the addition of heavy cream, the sauce has a brighter lemon flavor, which works beautifully with the delicate brininess of the shrimp. Tarragon adds a fragrant note and a bit of complexity to an otherwise fairly straightforward dish. Finally, if there were a time to spring for freshly grated Parmigiano-Reggiano, this would be it. In an uncomplicated recipe like this one, the quality of each ingredient is paramount.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2021/05/11/dining/lh-spaghetti-al-limone/merlin_187482171_3f6192a9-280a-455e-8740-32b0ad87b228-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, quick, pastas, main course", "keywords": "dry white wine, lemon, parmesan, shrimp, spaghetti, tarragon", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1982}, "recipeIngredient": ["Kosher salt and black pepper", "1 pound spaghetti", "1 pound large shrimp (18 to 20 count), peeled and deveined, tails on or off ", "1/4 cup olive oil", "2 lemons, zested (about 1 1/2 packed tablespoons), plus 3 tablespoons lemon juice", "1 tablespoon chopped fresh tarragon, plus more for serving", "1/2 cup dry white wine", "3 tablespoons cold unsalted butter, diced", "3/4 cup freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to boil. Add the spaghetti and cook according to package directions until al dente. Scoop out 1 cup of the cooking liquid, then drain the pasta and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta cooks, pat the shrimp dry and season them with salt and black pepper. Combine the olive oil, lemon zest (setting a few pinches aside for serving) and tarragon in a large skillet set over medium heat. When the oil begins to sizzle, cook for 1 more minute, until the zest and tarragon are fragrant but not browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shrimp to the skillet and spread into an even layer. Cook for about 90 seconds on each side, or until just cooked through. Transfer the shrimp to a plate and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wine, 1 teaspoon salt and a few grinds of black pepper to the skillet, and bring to a simmer, scraping any browned bits from the pan. Cook until the wine has reduced by about half, then set aside, off the heat, until the pasta has finished cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cooked pasta and reserved pasta water to the skillet. Cook over medium-low heat for 2 to 3 minutes, tossing often, until the liquid that has collected at the bottom of the skillet has reduced slightly. (The sauce should still be fairly loose at this point.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Off the heat, add the butter and 1/2 cup Parmesan, sprinkling the cheese evenly over the pasta. Toss until the butter and cheese are melted and the sauce is smooth. Add the lemon juice and remaining 1/4 cup Parmesan and toss until the sauce is thick and smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shrimp, toss, then season with more salt and black pepper to taste. Divide among shallow bowls and garnish with chopped fresh tarragon, lemon zest and black pepper."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022216-spaghetti-al-limone-with-shrimp"}