{"@context": "http://schema.org", "@type": "Recipe", "name": "Brown-Butter Toffee Sandwich Cookies", "description": "These crisp butter cookies incorporate blitzed toffee in place of some of the sugar and butter for a rich caramel flavor. To really amplify that almond-toffee essence, the cookies are topped with sliced almonds, and a nutty brown-butter icing is sandwiched in between. Be sure to roll the cookies very thin (about the thickness of two stacked pennies) so they stay crisp and light. The sturdy sandwiches have a long shelf life, making them ideal for shipping.", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "image": "https://static01.nyt.com/images/2021/12/08/dining/08COOKIESREX22-SANDWICH-copy/merlin_198248634_bf8b1817-a3be-4a55-9a5c-16e1c8daf6aa-mediumThreeByTwo440.jpg", "totalTime": "PT1H30M", "recipeYield": "36 sandwich cookies", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "almond, brown butter, christmas cookie, toffee, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 588}, "recipeIngredient": ["1 1/2 cups/226 grams English toffee bits without chocolate (such as Heath Bits O’ Brickle)", "1/2 cup plus 1 tablespoon/112 grams granulated sugar", "1 teaspoon baking soda", "1/2 teaspoon kosher salt (Diamond Crystal)", "3 tablespoons/42 grams unsalted butter, at room temperature", "1 large egg, white and yolk separated, at room temperature", "1 1/2 teaspoons vanilla extract", "1 3/4 cups/224 grams all-purpose flour, plus more for dusting", "1/3 cup/40 grams sliced almonds", "12 tablespoons/170 grams unsalted butter, cut into pieces", "1 teaspoon vanilla extract", "1/4 teaspoon kosher salt (Diamond Crystal)", "2 cups/240 grams confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cookies: In a food processor, process the toffee bits, sugar, baking soda and salt until the toffee is mostly ground and the mixture is sandy, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the toffee mixture to the bowl of a stand mixer (or a large bowl if using a hand mixer). Add butter, egg white and vanilla. Mix together with the paddle attachment on medium until creamy and fluffy, stopping once to scrape the bowl and paddle, about 2 minutes. Add flour, and mix on medium-low until the mixture comes together into a soft dough, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough in half. Pat each half into a disk. (If the dough is very soft, wrap and chill in the fridge for 15 minutes before proceeding.) Line three sheet trays with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust the counter and dough with flour. Working with one piece of dough at a time, use a rolling pin to roll the dough out until just under ⅛-inch thick (the thickness of two stacked pennies), turning the dough frequently to ensure it moves freely on the counter and dusting with more flour as needed. Each sheet of dough will be about the size of a standard sheet of paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a 2-inch round cookie cutter dusted in flour, cut out cookies from one sheet of dough. Using an offset spatula, transfer rounds to a prepared sheet tray, leaving about ½ inch of space between cookies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat with the remaining sheet of dough. Gather and knead together any scraps, reroll and repeat until all the dough has been rolled out for a total of 72 cookies. Freeze on sheet trays for at least 30 minutes before baking. (Alternatively, once the cookies have firmly frozen, stack them between parchment in a freezer-safe container or zipper-lock bag for up to 3 months.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set racks in the upper and lower thirds of the oven and heat oven to 350 degrees. Whisk together the egg yolk with 1 tablespoon of water and evenly brush on the tops of half of the chilled cookies. Sprinkle the yolk-brushed cookies with almonds, pressing gently to adhere. Bake the first two trays of cookies until deeply browned like a pretzel, switching the sheet trays from top to bottom and rotating from front to back halfway through, 10 to 14 minutes. Repeat with the third and final batch. Let cookies cool completely on sheet trays."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the cookies are cool, make the icing: Set a piping bag in a tall and narrow container, like a deli quart container, and fold over the top edge to secure. Flip over the cookies without almonds. (You need to pipe the icing onto the cookies immediately after mixing, so make sure you are set up.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan over medium heat, melt butter until foamy, about 3 minutes. Continue cooking butter, stirring and scraping frequently with a stiff silicone spatula, until the sputtering has subsided and the butter solids look deeply browned, 3 to 5 minutes. Scrape the butter and any brown bits into the bowl of a stand mixer (or into a large bowl if mixing by hand)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the vanilla and salt. Sift over the powdered sugar. With the paddle attachment, mix on low until creamy and combined, about 1 minute, stopping once during mixing to scrape the bowl and the paddle. (You can also mix with a stiff silicone spatula until creamy and combined.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the icing to the piping bag and cut a 1-inch wide opening at the tip. Pipe a scant tablespoon of filling onto a flipped cookie and immediately top with an almond-topped cookie. Gently press to adhere so that the filling reaches the edges of the cookie. Repeat with remaining cookies and icing. Store cookies in an airtight container at room temperature for up to 1 month."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Brown-Butter Toffee Sandwich Cookies", "description": "These crisp butter cookies incorporate blitzed toffee in place of some of the sugar and butter for a rich caramel flavor. To really amplify that almond-toffee essence, the cookies are topped with sliced almonds, and a nutty brown-butter icing is sandwiched in between. Be sure to roll the cookies very thin (about the thickness of two stacked pennies) so they stay crisp and light. The sturdy sandwiches have a long shelf life, making them ideal for shipping.", "thumbnailUrl": "https://static01.nyt.com/images/2021/12/08/dining/08COOKIESREX22-SANDWICH-copy/merlin_198248634_bf8b1817-a3be-4a55-9a5c-16e1c8daf6aa-mediumThreeByTwo440.jpg", "uploadDate": "2022-12-16T18:42:49.791Z", "duration": "PT9M38S", "transcript": "", "contentUrl": "https://vp.nyt.com/video/2022/12/15/104975_1_SE-toffee-borwn-butter-cookie-CV_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022676-brown-butter-toffee-sandwich-cookies"}