{"@context": "http://schema.org", "@type": "Recipe", "name": "Marinated Grilled Vegetables", "description": "You’ll always want a batch of these around: From the vegetables you grill to the seasonings you use, this recipe is endlessly adaptable. It also keeps for a few days and has so many applications. After the vegetables come off the grill, they soak in a piquant bath of coarse mustard, shallot and vinegar, though you could adjust flavorings as you wish: Add fresh or dried chile; thyme or rosemary; anchovy or capers; or a protein like feta, cubed salami, tofu or chickpeas. Then, use these deeply flavored vegetables on sandwiches, grilled bread, salads, frittatas, alongside grilled meat or fish, and so on.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2021/06/28/dining/28grilledrex-WEB/merlin_189645489_3f0106ba-f467-43eb-9367-2a787532a061-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, vegetables, main course", "keywords": "shallot", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 386}, "recipeIngredient": ["3/4 cup extra-virgin olive oil, plus more for greasing", "1/4 cup red wine vinegar or sherry vinegar", "2 tablespoons plus 2 teaspoons whole-grain mustard", "1 large shallot, thinly sliced", "Kosher salt and black pepper", "2 pounds grilling vegetables, such as peppers (bell, shishito, mini), broccoli rabe, broccolini, asparagus, radicchio, fennel, corn, zucchini, eggplant, green beans or snap peas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a charcoal grill for two-zone cooking over medium-high heat by pouring the coals onto one half of the grill. For a gas grill, heat all of the burners to high, then turn one of the end burners off before cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the grill is heating, make the marinade: In a medium bowl, combine 3/4 cup oil, vinegar, mustard and shallot. Season with salt and pepper. Cut the vegetables into pieces that are large enough so as to not slip through the grates; for small or slender vegetables, like snap peas or green beans, leave them whole. Pat the vegetables dry, then transfer to a sheet pan, season with salt and pepper, and drizzle with enough olive oil to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you're ready to grill, take the marinade, vegetables, tongs and a tightly folded paper towel soaked with olive oil to the grill. Clean the grates with a grill brush, then oil the grates with the paper towel. Grill the vegetables over the flame, flipping occasionally, until well browned and tender, 2 to 15 minutes, depending on the density and size of the vegetables. (For a gas grill, close the lid between flips, listening and keeping an eye out for flare-ups.) As the vegetables finish, transfer them to the marinade. Let the vegetables sit in the marinade for at least 5 minutes. Leftovers will keep for up to 3 days in the fridge. Let come to room temperature before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022340-marinated-grilled-vegetables"}