{"@context": "http://schema.org", "@type": "Recipe", "name": "Miso-Maple Loaf Cake", "description": "This cake, adapted from “Baking With Dorie” (Mariner Books, 2021), is comforting and surprising. The ingredients that give it its name, miso and maple syrup, are strong characters, but they prove themselves good team players. When baked, their flavors are warm and satisfying, mellow and not immediately knowable at first. They hover in that space between sweet and savory. Coarse-crumbed — admirably so — and sturdy, the cake is easy to slice, easy to serve at breakfast and easy to pick up and nibble in the afternoon. It’s as good with butter and jam as it is with a little cheese. And it keeps well: It’ll hold at room temperature for about 4 days.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2021/10/10/magazine/10mag-eat-site/10mag-eat-site-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "One 8 1/2-inch loaf", "recipeCuisine": "", "recipeCategory": "snack, dessert", "keywords": "loaf cake, maple syrup, miso, orange", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1379}, "recipeIngredient": ["4 ounces/113 grams unsalted butter, at room temperature, plus more for the pan", "1 3/4 cups/238 grams all-purpose flour, plus more for the pan", "1 3/4 teaspoons baking powder", "1/4 teaspoon baking soda", "3/4 cup/150 grams granulated sugar ", "1/4 teaspoon fine sea salt ", "Finely grated zest of 1 orange or tangerine ", "1/4 cup/70 grams white or yellow miso ", "1/4 cup/60 milliliters pure maple syrup ", "2 large eggs, at room temperature ", "1 1/2 teaspoons pure vanilla extract ", "1/3 cup/80 milliliters buttermilk (well shaken before measuring)", "1/4 cup/80 grams orange marmalade or apricot jam (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven and heat oven to 350 degrees. Butter an 8 1/2-inch loaf pan and dust with flour, or use baker’s spray. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the flour, baking powder and baking soda in a medium bowl. Put the sugar, salt and zest in the bowl of a stand mixer or a large bowl that you can use with a hand mixer. Reach in and rub the ingredients together until the sugar is moist and fragrant; it may even turn orange. Add the butter, miso and maple syrup to the sugar. If using a stand mixer, attach the bowl and fit it with the paddle attachment. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat on medium speed for about 3 minutes, scraping down the bowl and beater(s) as needed, until the mixture is smooth and creamy. One by one, add the eggs, beating for a minute after each goes in. Beat in the vanilla. The mixture might curdle, but this is a temporary condition. Turn off the mixer, add the dry ingredients all at once and pulse to begin the blending, turning the mixer on and off in very short spurts on the lowest speed. Then, beat on low speed until the dry ingredients are almost incorporated. With the mixer still on low, pour in the buttermilk and blend well. Scrape the batter into the pan, working it into the corners and smoothing the top. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 50 to 55 minutes, checking the loaf after 40 minutes and covering the top loosely with a foil or tented parchmentif it’s browning too fast. The loaf is properly baked when it pulls away from the sides of the pan and a tester inserted into the center comes out clean. Transfer the pan to a rack and let the bread rest for 5 minutes, then run a table knife around the edges of the loaf and unmold onto the rack; turn it right side up. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’d like to glaze the loaf, stir the marmalade or jam with 1 tablespoon water and heat the mixture in the microwave or over low heat until it comes just to a boil. Using a pastry brush or a spoon, cover the top of the loaf with the glaze. Allow the loaf to cool to room temperature before slicing. Wrapped well, the cake will keep for about 4 days at room temperature. If it becomes stale — and maybe even if it doesn't — toast it lightly before serving. If you haven't glazed the cake, you can wrap it airtight and freeze it for up to 2 months; defrost, still wrapped, at room temperature. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022610-miso-maple-loaf-cake"}