{"@context": "http://schema.org", "@type": "Recipe", "name": "Aloo Samosas (Potato Samosas)", "description": "Filled with a Punjabi-spiced potato and pea mixture, these samosas prioritize convenience without compromising flavors or textures. Use store-bought spring roll wrappers to make a big batch when you have time, then freeze the samosas to fry and serve as near-instant snacks for iftar, at parties or intimate gatherings with chai, or as low-fuss everyday cooking. With a crispy exterior and a filling citrusy with coriander and sweet from peas, these vegan samosas are perfect any time. ", "author": {"@type": "Person", "name": "Zainab Shah"}, "image": "https://static01.nyt.com/images/2021/04/07/dining/02samosasrex2/merlin_185734716_700df244-d552-4173-830d-6b351b47a113-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "About 42 samosas", "recipeCuisine": "indian, pakistani", "recipeCategory": "finger foods, vegetables, side dish", "keywords": "diwali, green chiles, peas, russet potatoes, spring roll wrappers, ramadan, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 442}, "recipeIngredient": ["3 medium russet potatoes (1 pound)", "Fine sea salt", "2 teaspoons canola oil", "1 teaspoon cumin seeds ", "1 teaspoon coriander seeds ", "1 teaspoon ground red chile", "1/4 teaspoon turmeric powder", "1/2 teaspoon coriander powder (optional) ", "1/2 teaspoon cumin powder (optional) ", "1/2 cup frozen peas", "1/2 teaspoon garam masala ", "1 to 2 Thai green chiles, stemmed and chopped ", "2 tablespoons finely chopped fresh cilantro", "14 spring roll wrappers (8 inches square; see Tip)", "3 tablespoons all-purpose flour", "Canola oil, for frying", "<a href=\"https://cooking.nytimes.com/recipes/1022061\">Mint Chutney</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the potatoes in a large saucepan and add enough cold water to cover by a few inches. Salt the water, then bring to a boil over medium-high heat. Cook until a knife slides in with little to no resistance, about 20 minutes. Drain, then set aside. When cool enough to handle, peel and use a fork to smush them into a coarse mash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large nonstick pan over medium for a minute. Add the cumin and coriander seeds, and stir until the seeds are fragrant, 30 seconds to 1 minute. Reduce the heat to medium-low, and add the ground chile and turmeric, and the coriander and cumin powders, if using. Continue cooking, stirring, for 30 seconds. Add the potatoes, peas, garam masala and 1/2 teaspoon salt, and raise the heat to medium. Cook, stirring to evenly mix the ingredients, until heated through, 2 to 3 minutes. Turn off the heat and stir in the fresh chiles and cilantro. Let stand until cool enough to handle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare to assemble the samosas: Line a sheet pan with wax paper or plastic wrap. Stack the spring roll wrappers and cut evenly in thirds to create 42 rectangles, 8 inches long by 2 2/3-inches wide. If your wrappers are not 8 inches square, aim to cut 42 rectangular shapes in a 3-to-1 ratio. Place a damp clean cloth over your pastry sheets to prevent them from drying out. Place the flour in a small bowl and add enough water (about 3 tablespoons) to make a smooth paste the consistency of craft glue. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take a pastry rectangle and place it with the long side facing you on a flat work surface. Replace the damp cloth over the remaining pastry sheets to keep them from drying out. Take the bottom-right corner of the rectangle and fold it over the top, with the short side extending 1 to 2 inches past the top. The overlapping pastry at the bottom right of the sheet will form an equilateral triangle with sides that are about 3 inches long. This triangle will be the final shape and size of the samosa. Fold the triangle so its right outer edge is aligned with the horizontal bottom edge of the sheet. There should now be a triangular pocket with two flaps sticking out to the left. Pick up the pocket so it is open and upright like a cone. Fill the cone with 2 teaspoons of the filling. Using the back of a small spoon, spread the flour paste in a thin layer over the remaining strip of pastry. Fold it over the stuffed triangle to seal the samosa. If the corners of the samosa have any gaps, fill them with the flour paste and pinch them to seal. Repeat with the remaining filling and rectangles (you may have leftover wrappers) and lay on the lined sheet pan, spacing apart. They can be fried or baked right away, or frozen on the pan until firm, then sealed in an airtight container or freezer bag. They can be frozen for up to 2 months before frying and go straight into the hot oil from the freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To fry the samosas, fill a frying pan with oil to a depth of 1/2 inch. Heat the oil over medium-high until it ripples. Add enough samosas to fit without overlapping and shallow-fry until golden brown, 1 to 3 minutes per side (longer, if frying directly from the freezer). Transfer to a cooling rack or plate lined with a paper towel to prevent them from getting soggy. Repeat with the remaining samosas, replenishing and reheating the oil between batches. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To bake the samosas, heat oven to 400 degrees. Line a 1-inch-deep sheet pan with foil and add a thin layer of oil to the pan (about 1/4 inch). Coat the samosas with the oil in the sheet pan and arrange them on the pan in a single layer in rows. Bake, turning once halfway through, until evenly golden brown, 6 to 8 minutes per side. Transfer to a cooling rack or plate lined with a paper towel to prevent them from getting soggy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot or warm with the mint chutney for dipping."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022060-aloo-samosas-potato-samosas"}