{"@context": "http://schema.org", "@type": "Recipe", "name": "All-Purpose Enriched Bread", "description": "This dough, a hybrid of brioche and Japanese milk bread, bakes into a light, soft loaf with a silky crumb. There are two key steps to the bread’s texture: The first is a tangzhong, or “water roux,” which originated in Japanese baking but was popularized throughout Asia and beyond by the Taiwanese pastry chef Yvonne Chen. The second is a long, slow mix that develops sufficient strength in the dough to support a lofty rise in the oven. Unless you have superhuman strength and patience, a stand mixer is required. The dough is slightly sweet, making it ideal for cinnamon rolls or <a href=\"https://cooking.nytimes.com/recipes/1022249-pistachio-morning-buns\">pistachio morning buns</a>, and suitable for sandwich bread or <a href=\"https://cooking.nytimes.com/recipes/1022247-hamburger-buns\">hamburger buns</a>.", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2021/05/26/dining/21yeastedrex1-bread/merlin_187925100_9089549f-03af-4bb2-8001-3a238b7d22f0-articleLarge.jpg", "totalTime": "PT7H45M", "recipeYield": "2 loaves", "recipeCuisine": "", "recipeCategory": "breads, project", "keywords": "active dry yeast, egg, milk", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 759}, "recipeIngredient": ["1 cup/240 grams whole milk or buttermilk", "6 tablespoons/50 grams plus 3 3/4 cups/490 grams all-purpose flour, plus more, if needed, for work surface", "5 large eggs, chilled", "2 tablespoons vegetable or olive oil", "1/4 cup/50 grams granulated sugar", "10 grams kosher salt (2 3/4 teaspoons Diamond Crystal or 1 1/2 teaspoons Morton)", "2 teaspoons/6 grams active dry yeast", "1/2 cup/113 grams unsalted butter (1 stick), cut into 1/2-inch pieces, chilled, plus more, at room temperature, for pans"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tangzhong: Combine the milk and 6 tablespoons flour in a medium saucepan and whisk until smooth. Place the saucepan over medium heat and cook, whisking constantly, until the mixture begins to thicken, about 2 minutes. Continue to whisk vigorously, making sure to scrape along the bottom curve of the saucepan, until the mixture is very thick and looks like smooth mashed potatoes, about 20 seconds longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove saucepan from heat and scrape the tangzhong into the bowl of a stand mixer. Cover the bowl and let the tangzhong sit until it’s room temperature, about the better part of an hour. (A cool tangzhong is crucial to ensuring proper dough development; you can speed it along by chilling the bowl and occasionally uncovering it to stir the tangzhong.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: To the bowl of the stand mixer, add 4 eggs (reserve the remaining egg for brushing over the dough), then add the oil, sugar, salt, yeast and remaining 3 3/4 cups flour. Fit the mixer with the dough hook and mix on low speed until the ingredients come together as a coarsely textured dough, about 3 minutes. Stop the mixer, scrape down the sides of the bowl with a bowl scraper or flexible spatula, then mix on medium-low, scraping down the sides once or twice more, until dough is smooth, firm and very elastic, 12 to 15 minutes. It will have gathered around the hook but still cling to the slides and bottom of the bowl, and have a mostly tacky, not sticky, texture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stop the mixer and scrape down the sides of the bowl. Add half of the chilled butter pieces and mix on low speed until the butter pieces have incorporated into the dough, about 5 minutes. Stop the mixer, scrape down the sides again, and add the remaining butter. Mix on low until all the butter is completely incorporated. The dough should no longer stick to the sides of the bowl and will have a very smooth, supple appearance. Increase the speed to medium-low and continue to mix until the dough is extremely elastic, another 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Test the dough: To see if the dough has built sufficient strength and elasticity — which it will need to expand to its maximum volume in the oven — stop the mixer and raise the hook. The weight of the dough will slowly pull it downward off the hook. (A strong dough will stretch the distance to the bottom of the bowl, rather than tear.) You can also do a windowpane test: Pinch off a golf ball-size piece of dough, and use your thumbs to flatten it and work the dough outward into a thin layer. Slowly stretch the dough, until it forms a thin membrane through which light can pass. If it tears before that point, or as it falls from the hook, continue to mix on medium-low and repeat the test every 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the dough rise: Scrape the dough onto a work surface. (If the dough is a bit sticky, dust it very lightly with flour.) Fold it in half several times to create a smooth, taut surface, then place back inside the stand mixer bowl, smooth-side up. Cover the bowl with plastic wrap or an airtight lid and let rise at room temperature for 30 minutes, then transfer to the refrigerator and chill for at least 4 hours and up to 24. (If making <a href=\"https://cooking.nytimes.com/recipes/1022247-hamburger-buns\">hamburger buns</a> or <a href=\"https://cooking.nytimes.com/recipes/1022249-pistachio-morning-buns\">pistachio morning buns</a>, stop here and see recipes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pans: Using a pastry brush, lightly coat the bottom and sides of 2 standard loaf pans with room-temperature butter. Line each pan with parchment paper, leaving an overhang on the two longer sides, then lightly brush the parchment paper with more butter. Set the pans aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Portion the dough: Remove the dough from the refrigerator and uncover. Scrape the dough from the bowl and place on the work surface. Use the heel of your hand to knock out the gas and deflate the risen dough, which will be quite firm. Using a kitchen scale and a bench scraper or a knife, portion the dough into 16 equal pieces. (Each piece will weigh about 70 grams.) If you don’t have a kitchen scale, you can eyeball it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form the loaves: Working with one piece of dough at a time, fold it onto itself a few times to create a smooth surface, then gather the edges and pinch them together to form a smooth bundle of dough that looks like a garlic bulb. Place it seam-side down on the work surface and position your hand over the dough, palm barely touching the top and fingers lightly cupping it and resting on the work surface. Drag your hand — and the dough with it — slowly across the surface, moving it in small, rapid circles. The friction between the dough and the surface will help tighten the dome so your loaves rise upward. You shouldn’t need to add flour, since the cold dough is easier to handle and much less sticky, but if your dough is slightly warm or otherwise sticky, add just a bit of flour to make it easier to handle. Continue with all the pieces of dough, then arrange the balls inside the prepared loaf pans, 8 per pan in a 2-by-4 pattern."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Proof the loaves: Cover the pans tightly and let sit at room temperature, undisturbed, until the dough has doubled in size and the individual domes appear puffed and balloonlike, 1 1/2 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, arrange an oven rack in the center position and heat oven to 350 degrees. Beat the remaining egg in a small bowl until no streaks remain, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Test the loaves: For the softest, airiest bread, the dough must be fully proofed. Test it by uncovering the loaves, lightly oiling your finger, and gently poking the surface. It should feel filled with air, spring back, and hold a slight indentation from your finger. If it doesn’t, cover again and continue to let it rise, repeating the test every 10 or 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Apply egg wash and bake the loaves: Brush the surfaces of the proofed loaves generously with the beaten egg and transfer the pans to the oven. Bake side by side, rotating each pan 180 degrees and left to right after 15 minutes, until the surfaces have risen dramatically and are deeply browned, 25 to 30 minutes. Let cool completely in the pans, then cut along the short sides with a paring knife to loosen. Use the parchment paper to lift the loaves out of the pans. Slice with a serrated knife."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022248-all-purpose-enriched-bread"}