{"@context": "http://schema.org", "@type": "Recipe", "name": "Iced Oatmeal Cookies", "description": "These extra craggy oatmeal cookies start by beating sugar with eggs, instead of mixing the typical way: creaming butter and sugar first. This method gives the cookies a crusty exterior, which eventually cracks, creating deep fissures along the surface over centers that are still gooey and chewy. With a couple of teaspoons of cinnamon (or pumpkin pie spice) and vanilla for flavor, they make a wonderful and simple pantry cookie to bake over and over again. Don’t skip the final step: These cookies are visually and texturally incomplete without their classic coat of glossy white icing.", "author": {"@type": "Person", "name": "Jerrelle Guy"}, "image": "https://static01.nyt.com/images/2021/12/08/dining/08COOKIES8-iced-oatmeal-cookies/merlin_198248571_08bd8367-1551-4155-b581-73026be49d10-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "15 cookies", "recipeCuisine": "", "recipeCategory": "snack, dessert", "keywords": "christmas, christmas cookie, confectioners' sugar, ground cinnamon, oats", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1093}, "recipeIngredient": ["1 cup/95 grams old-fashioned rolled oats ", "1 cup/128 grams all-purpose flour ", "1/4 teaspoon kosher salt", "1/2 cup/100 grams granulated sugar ", "1/4 packed cup/55 grams light brown sugar", "1 large egg, at room temperature", "2 teaspoons ground cinnamon or pumpkin pie spice  ", "1 teaspoon pure vanilla extract ", "1/2 teaspoon baking soda ", "4 tablespoons/57 grams unsalted butter, melted ", "3/4 cup/92 grams confectioners’ sugar ", "5 teaspoons whole or oat milk, plus more as needed "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees and line a large cookie sheet with parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, combine the oats, flour and salt. In the bowl of a stand mixer fitted with the whisk attachment, beat both sugars with the egg, cinnamon, vanilla and baking soda on high speed, scraping the bowl as needed, until glossy, pale and thick, a full 2 minutes. Reduce the speed to medium. Very slowly drizzle in the melted butter and whisk until thoroughly incorporated. Add the oat mixture and gently fold by hand using a wooden spoon or rubber spatula just until incorporated, being careful not to overmix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a small cookie scoop or two spoons, drop 15 golf ball-size mounds of dough onto the sheet pan, spacing them at least 2 inches apart. Bake until the edges and surface are set and lightly golden brown, but the center is still gooey, 12 to 14 minutes. Remove from the oven and immediately rap the cookie sheet on the counter or stovetop a couple of times to help the cookies flatten a little more, and cool on the sheet for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix the confectioners’ sugar and milk using a fork until the icing is completely smooth and very thick but still moves if you tilt the bowl. Add more milk in small increments as needed. Dip only the very tops of the cookies into the bowl of icing, leaving the deeper cracks in the cookies uncoated and allowing any excess icing to drip back into the bowl. Flip the cookies over and return them to the cookie sheet to allow the icing to harden, 10 to 15 minutes. The iced cookies will keep in an airtight container at room temperature for up to 1 week."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022772-iced-oatmeal-cookies"}