{"@context": "http://schema.org", "@type": "Recipe", "name": "Paneer Ajwaini Tikka (Fresh Roasted Paneer With Carom)", "description": "This dish of marinated, roasted paneer is inspired by the one served by the chef Chintan Pandya at Dhamaka in New York City, and is flavored intensely with ajwain, or carom seeds, and a paste of garlic and ginger. You could use the marinade on store-bought paneer, but fresh paneer is one of the simplest and most satisfying cheeses for a home cook to make, and doesn’t require any special ingredients. And unlike store-bought paneer, which is generally quite firm, a homemade version can be tender and delicate, and extremely creamy. Just be sure to stir the milk mixture very gently to keep the curds large and intact.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2021/11/28/magazine/28mag-eat-site/28mag-eat-site-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 93}, "recipeIngredient": ["1 gallon whole milk", "1/4 cup apple cider vinegar", "1 tablespoon ajwain, or carom seeds", "4 dried chiles de árbol, stemmed", "1 (2-inch) piece fresh ginger, peeled and roughly sliced", "4 garlic cloves, peeled", "2 tablespoons besan, or chickpea flour", "2 teaspoons garam masala", "1 teaspoon fine sea salt", "1/2 teaspoon hot chile powder", "1/2 teaspoon turmeric powder", "1/4 cup full-fat plain Greek yogurt", "1 red onion, thinly sliced", "1 tablespoon neutral oil, such as grapeseed", "1 teaspoon amchur (unripe mango powder)", "1/2 teaspoon hot chile powder", "1/2 teaspoon fine sea salt", "1 lime, cut into wedges, to serve", "6 potato or Hawaiian buns, toasted, to serve", "6 tablespoons butter, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the paneer: Heat the milk over medium in a large, heavy-bottomed pot and bring to a boil, stirring occasionally to make sure the milk at the bottom of the pot doesn’t burn. Add the vinegar and use a wooden spoon to gently stir the milk. Continue to stir very, very gently for about 30 seconds, being careful not to break the curds as they form and lowering the heat if needed to prevent milk from bubbling over. Turn off the heat and stir very slowly for another minute. Slowly pour the curds and whey into a muslin-lined large colander set in the sink and let the whey drain out, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run cold tap water over the curds to rinse them of any lingering vinegar flavor. When all the water has drained away, 2 to 5 minutes, bring up the corners of the cloth and twist the cheese to make a ball, gently squeezing out the extra water and whey. Lift the cloth-wrapped paneer and transfer to an 8-inch loaf pan and, keeping it in the cloth, gently press it into the pan. Rest weights, such as canned tomatoes, on top, and after 10 minutes, gently press out and pour off excess liquid. Lift out and unwrap the paneer and set on a cutting board. It should hold its form, but still feel tender. While the paneer drains, prepare the masala and onions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the masala: Lightly toast the ajwain in a dry pan for 2 minutes, then put in a small food processor or large mortar and pestle to grind it roughly. Add the chiles, ginger, garlic, besan, garam masala, salt, chile powder and turmeric. Process or pound until you get a thick paste. Then add the yogurt and mix until smooth. If the marinade is too thick to easily coat the paneer, stir in a splash or two of water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the onion: Set a rack in the center of the oven and a rack under the broiler. Heat the oven to 450 degrees. Lay the onion slices on a parchment-lined sheet pan and coat with the oil. Slice the paneer 1-inch-thick, brush each slice all over with the marinade and lay the slices over the onion in a single layer. Bake for 10 minutes, or until the edges of the paneer and marinade have started to color. While the paneer bakes, mix the amchur, remaining 1/2 teaspoon chile and the salt. Remove the paneer from the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler, then broil the paneer for a minute or two to brown it a little further. Lightly dust the paneer with the amchur spice mix. Serve hot with the onion from the pan, lime wedges and toasted, buttered buns."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022784-paneer-ajwaini-tikka-fresh-roasted-paneer-with-carom"}