{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Pepper Shrimp", "description": "This dish, adapted from Lucy Carvalho, the cookbook author Nik Sharma’s grandmother, owes its fragrance and fiery bite to a generous amount of crushed black peppercorns in a velvety gravy. Like many other Indian home cooks, Ms. Carvalho, who lived in the coastal city of Mumbai, took the Indo-Chinese dish black pepper chicken and substituted shrimp instead. Some versions of this dish call for curry leaves to be fried with the spices, or they might call for another protein in place of the shrimp, like tilapia, cod or catfish. Here, the peppercorns are infused in hot oil, then left to steep as the dish cooks. Fish sauce bolsters the savoriness, but can be left out. For an even stronger bump of heat, increase the amount of black pepper and toss in a sliced serrano. Serve it all over rice for a fast, satisfying dinner.", "author": {"@type": "Person", "name": "Nik Sharma"}, "image": "https://static01.nyt.com/images/2021/05/07/dining/ns-black-pepper-shrimp/merlin_187429245_892d6144-0d67-45e0-b2ff-82d59a5f9c2f-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weekday, seafood, main course", "keywords": "bell pepper, black peppercorns, scallion, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 571}, "recipeIngredient": ["2 tablespoons neutral oil, such as grapeseed or canola", "2 tablespoons coarsely ground black peppercorns", "1 small white onion, peeled and cut into 1-inch chunks", "6 scallions, trimmed and thinly sliced", "4 garlic cloves, peeled and grated", "1 medium green bell pepper, cored and cut into 1-inch chunks", "1 medium red bell pepper, cored and cut into 1-inch chunks", "1 pound peeled, deveined raw medium shrimp (fresh or frozen)", "2 teaspoons soy sauce, plus more to taste", "1 teaspoon fish sauce (optional)", "3 tablespoons cornstarch", "2 tablespoons chopped fresh cilantro", "Cooked white rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large saucepan over medium-high. Add the black peppercorns and sauté until fragrant, about 30 seconds. Add the onion and half the scallions, and sauté, scraping the bottom of the pot as necessary, until the onions turn translucent, 3 to 4 minutes. Stir in the garlic and cook until fragrant, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the green and red bell peppers and sauté until they begin to soften, about 3 to 4 minutes. Add the shrimp and sauté for 1 minute, then stir in 2 cups water, the soy sauce and fish sauce (if using). Bring the liquid to a boil over medium-high heat. Cook the shrimp just until they turn pink, about 2 minutes. (Keep an eye on them: The shrimp can turn rubbery quickly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly as the liquid cooks, mix the cornstarch with 2 tablespoons water in a small bowl to form a slurry. Add this mixture to the saucepan as soon as the shrimp turns pink, and cook over medium heat until the sauce thickens, about 30 seconds. Remove from the heat and add more soy sauce, to taste, if desired. Garnish with the cilantro and remaining scallions. Serve hot or warm with rice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022179-black-pepper-shrimp"}