{"@context": "http://schema.org", "@type": "Recipe", "name": "Florida Lime Pie", "description": "Jane Nickerson was the food editor of The New York Times from 1942 until 1957, when she moved with her family to Lakeland, Fla. There, she eventually became food editor of The Ledger, in Lakeland, then owned by The Times. Her successor in New York was Craig Claiborne, whose star eclipsed hers for, among other things, systemic reasons we wrestle with still. But Ms. Nickerson was a hugely influential force in American home cooking, introducing ingredients and recipes from chefs and home cooks to a nation that met her first on a wartime footing and grew to find itself on a prosperous one. In Florida, she embraced local ingredients and foodways, and in 1973 published “Jane Nickerson’s Florida Cookbook,” an invaluable guide to the state’s appetizing abundance. Her lime pie is a little richer than the more well-known Key lime pie. I like that about it.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2021/04/11/magazine/11mag-eat/11mag-eat-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "1 (9-inch) pie", "recipeCuisine": "american", "recipeCategory": "pies and tarts, dessert", "keywords": "birthday, fourth of july, labor day, memorial day, new year’s day, butter, flour, lime, lime juice, sweetened condensed milk, whipped cream", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 719}, "recipeIngredient": ["1 1/4 cups/160 grams all-purpose flour, plus more for dusting", "1/4 teaspoon kosher salt", "1/2 cup/115 grams very cold unsalted butter, cut into 1/2-inch cubes", "3 tablespoons ice water, plus more as needed", "5 large egg yolks, plus 3 large egg whites, all at room temperature", "1 (14-ounce) can sweetened condensed milk", "2/3 cup fresh lime juice (from about 4 to 5 limes)", "1 tablespoon finely grated lime zest, plus more for garnish", "Whipped cream, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the crust: In a large bowl, whisk together the flour and salt. Toss in the butter cubes serially, to keep them separate while coating them evenly in flour. Using a fork, cut the butter into the flour, continuing to toss them as you do, until they’re roughly the size of peas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle 3 tablespoons ice water over the flour-and-butter mixture. Using your fork, toss to incorporate, then continue to add ice water, 1 tablespoon at a time, until the dough begins to come together as you stir it. Using your hands, fold the dough over itself a few times, adding just enough water so that it holds together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form the dough into a disk about 1-inch thick, and wrap tightly in plastic wrap, then refrigerate for at least 2 hours or up to a couple of days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to make the pie, first prepare the pie shell: Heat oven to 350 degrees. Roll out the pastry on a lightly floured surface until it is roughly 12 inches in diameter, then fit it into a 9-inch pie plate. Trim and crimp edges, then, using the tines of a fork, pierce the bottom crust 8 to 12 times. Line dough with a sheet of parchment paper, and spread evenly with pie weights. Place the pie crust on a baking sheet, and bake for about 30 minutes, or until the edges are set. You want it slightly underdone. Carefully remove the pie weights and parchment, and let cool completely on a rack. Reduce oven temperature to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a large bowl, use a whisk to beat the egg yolks until they are thick, then gradually beat in the condensed milk, then the lime juice. Stir in 1 tablespoon lime zest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, use a whisk to beat the egg whites until they form soft peaks, then fold them gently into the condensed-milk mixture. Pour into the cooled pie shell."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pie back on the sheet pan and bake until the filling is just set in the center, about 20 minutes. It need not be completely firm because the filling thickens as it cools."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool the pie on a rack, then refrigerate until chilled, at least 2 hours. Serve topped with whipped cream and about 1 teaspoon grated lime zest."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022079-florida-lime-pie"}