{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Oysters With Harissa-Parmesan Butter", "description": "At Cristiano Ristorante in Houma, La., the chef Lindsay Mason ladles a buttery mixture of roasted red peppers, garlic and Parmesan into grilled oysters. This version replaces the roasted peppers with North African harissa, offering the same sweet-savory combination, but with a bit more kick. For more grilled oyster flavor combinations, try this recipe for <a href=\"https://cooking.nytimes.com/recipes/1022321-grilled-oysters-with-lemony-garlic-herb-butter\">Grilled Oysters With Lemony Garlic-Herb Butter</a> or this recipe for <a href=\"https://cooking.nytimes.com/recipes/1022322-grilled-oysters-with-buttery-soy-sake-glaze\">Grilled Oysters With Buttery Soy-Sake Glaze</a>. The flavored butter can be stored in the refrigerator for several weeks or in the freezer for several months.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2021/06/21/dining/kla-grilled-oysters-with-harissa-parmesan-butter/merlin_189456798_d12c74d3-2a7f-43c7-808b-aeb7c4eb23c5-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "24 oysters", "recipeCuisine": "", "recipeCategory": "seafood, appetizer", "keywords": "butter, harissa, oyster, parmesan, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 67}, "recipeIngredient": ["1/2 cup unsalted butter", "1/3 cup harissa (preferably Mina or Mustapha brand)", "1 ounce finely grated Parmesan", "6 medium garlic cloves, minced", "24 oysters, scrubbed clean of any sand or grit under cool running water", "Minced cilantro leaves, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Ignite a full chimney of coals and spread out under one side of the grill once they are fully covered in gray ash, or heat half the burners of a gas grill to high. Cover and let the grill heat for 10 minutes. Meanwhile, cut off a sheet of aluminum foil twice the length of a 13-by-18-inch rimmed baking sheet. Crumple it up so that it fits into the baking sheet. The crumpled foil should be able to support the cupped side of the oysters without allowing them to tip over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the harissa-Parmesan butter: Combine the butter, harissa, Parmesan and garlic in the bowl of a food processor. Process until there are no large chunks of butter remaining, about 30 seconds total, stopping to scrape down the sides of the processor with a rubber spatula a few times as needed. Transfer the mixture to a small, oven-safe saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, arrange the oysters over the hot side of the grill, placing them with the cupped sides down, doing your best to set them in the grates so that oyster juices don’t pour out of the cups as they open. Cover and cook, checking on them every minute or so, and transferring any oysters that have begun to gape open to the foil-lined baking sheet. After a total of 4 minutes, transfer any remaining oysters to the foil whether they have opened or not. Place the saucepan on the cooler side of the grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as the oysters are cool enough to handle, pry off the top shells with a butter knife or oyster knife, severing through the muscle that holds the oyster to the shell and retaining as much juice in the shell as possible. For oysters that aren’t already gaping open, the easiest way to pry off the lids is by inserting the tip of the knife into the joint and firmly twisting it until the joint releases."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon a generous teaspoon of the harissa-Parmesan butter (which should be fully melted by now) into each oyster, then return the oysters directly onto the grates on the hot side of the grill. Cook, uncovered, until the sauce mixture is bubbling hot, about 1 minute. Return the oysters to the foil-lined baking sheet, sprinkle with cilantro, and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022323-grilled-oysters-with-harissa-parmesan-butter"}