{"@context": "http://schema.org", "@type": "Recipe", "name": "Gingerbread Biscotti", "description": "Have a hot cup of coffee ready for dipping these spiced, crunchy biscotti. Like most Tuscan biscotti, these include no fat, which makes for an extra-dry cookie. That means it saturates quickly when dunked, turning it into something like silken cake while also sweetening your coffee. Pops of chewy candied ginger and a slick of dark chocolate make this biscotti a little more special. And while the ingredient list may be longer than some, each item builds upon the last, creating a symphony of warming flavors and smells. To help keep track of the many spices while assembling your ingredients, measure them into small piles on a dinner plate.", "author": {"@type": "Person", "name": "Jerrelle Guy"}, "image": "https://static01.nyt.com/images/2021/12/08/dining/08COOKIES7-gingerbread-biscotti/merlin_198248850_1a09bdb6-7688-41cc-b99c-8a30f90adbfe-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "1 dozen ", "recipeCuisine": "", "recipeCategory": "snack, dessert", "keywords": "christmas cookie, dark chocolate, espresso powder, ground ginger, semisweet chocolate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 609}, "recipeIngredient": ["1 large egg plus 1 large egg white, at room temperature ", "2/3 packed cup/150 grams light brown sugar", "1/3 cup/70 grams granulated sugar", "1 tablespoon ground ginger ", "1 teaspoon ground cinnamon ", "1/2 teaspoon ground nutmeg", "1/2 teaspoon ground cloves ", "1/4 teaspoon ground cardamom ", "1 whole star anise, finely ground (1/4 teaspoon)", "1 teaspoon instant espresso powder", "1 teaspoon kosher salt", "1/2 teaspoon baking soda", "1 teaspoon almond extract", "1/4 teaspoon lemon extract", "2 cups/256 grams all-purpose flour ", "1/4 cup/35 grams diced (1/4-inch) crystallized ginger ", "2/3 cup/113 grams dark or semisweet chocolate, finely chopped (4 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees and line a large baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, add the egg, egg white, both sugars, ginger, cinnamon, nutmeg, cloves, cardamom, star anise, espresso powder, salt, baking soda, almond extract and lemon extract. Beat on medium speed just to combine, scrape down the bowl and beater, then increase the speed to high and beat for a full 90 seconds or until the mixture is slightly paler, thick and ribbony."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour and the candied ginger. Beat on low speed until mostly combined, stopping the beater just before all the flour is incorporated so you don’t overmix. Scrape the sides and bottom of the bowl to incorporate any remaining dry bits into the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gather the dough with your hands, kneading lightly in the bowl just to bring everything together into a cohesive mass. Place the dough on the center of the prepared sheet, then dampen your hands with water and mold the dough into a 9-by-4-inch log about 1 inch tall. Bake until the log puffs and spreads a little, turns golden brown at the edges and is firm to the touch, 40 to 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the loaf from the oven and allow to cool for 10 minutes. Transfer the loaf to a cutting board and, using a serrated knife, cut at a diagonal into 12 (¾-inch-wide) slices. Turn the slices on their sides and return to the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, flipping the slices halfway through, until slightly browned and dry in the centers, 10 to 15 minutes. Bake longer for drier, crunchier biscotti. Remove from the oven and cool the biscotti on the sheet. Turn the slices top sides up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a double-boiler or a heatproof bowl set over simmering water, melt the chocolate, stirring until completely smooth. (See Tip.) Remove the bowl from the heat, and using a small spoon, drape the melted chocolate over the tops of the biscotti, nudging some to drip over the edges. Allow the chocolate to sit at room temperature or in the refrigerator to fully set. The biscotti will last for a couple of weeks in an airtight container at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022768-gingerbread-biscotti"}