{"@context": "http://schema.org", "@type": "Recipe", "name": "Dry-Brined Chicken Breasts", "description": "A short, simple dry brine can take a pallid chicken breast from bland to glam. Dark brown sugar is especially welcome since its molasses provides additional moisture. Dried bay leaves, ground to a powder, lend an aromatic woodsiness that will make you think, “Oh, that’s what bay leaves taste like.” But it’s the salt here that’s most crucial, as it draws out the meat’s water. That water then dissolves the salt and, through diffusion, the two reenter the meat, seasoning the chicken thoroughly and encouraging water retention during cooking. You can enjoy it right out of the skillet with a spritz of lime juice or save it to serve in salads, sandwiches, fried rice and the like.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2021/06/02/dining/04Chickenrex1/merlin_188172984_99fa449e-3c26-49d5-bf55-3a6f148960a2-articleLarge.jpg", "totalTime": "PT55M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry, main course", "keywords": "chicken, chicken breast", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 692}, "recipeIngredient": ["5 dried bay leaves, crushed into small pieces", "1 teaspoon whole black peppercorns", "2 1/2 teaspoons kosher salt (Diamond Crystal)", "1 packed tablespoon dark brown sugar", "2 teaspoons garlic powder", "2 large boneless, skinless chicken breasts (about 1 1/2 pounds total)", "Vegetable oil", "Lime wedges, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a spice grinder, blitz the bay leaf pieces and peppercorns until finely ground. Transfer to a small bowl and add the salt, brown sugar and garlic powder, and rub it all together with your fingers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut each chicken breast in half crosswise into two pieces of equal weight, creating one shorter, thicker piece and one longer, thinner piece. Place the four chicken pieces on a large plate or sheet pan and sprinkle generously on all sides with the spice mixture, moving the chicken around to catch any fallen spices. Refrigerate, uncovered, to dry-brine for at least 30 minutes and up to 1 hour (any shorter and the osmotic brining process won’t complete; any longer and you’ll end up with deli meat)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, take the chicken out of the fridge and heat a large skillet with a lid over high heat. Add enough oil to lightly coat the bottom of the skillet. Carefully add the chicken pieces, smooth sides down, and immediately reduce the heat to medium-low. Cook until the bottoms are browned but not burnt, 5 to 7 minutes. Flip the chicken, cover the pan and cook until the other sides are browned and the internal temperature at the thickest part of the meat reaches 155 degrees, another 5 to 7 minutes. You may want to pull the longer, thinner pieces off the heat a minute or two sooner, as they may cook faster."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken to a cutting board to rest for at least 10 minutes so the juices can redistribute. The meat will continue to cook as it sits and should reach an internal temperature of 165 degrees. You can also check for doneness by cutting into the chicken; it should look white and juicy and no longer pink. Slice the chicken against the grain (that is, perpendicular to the parallel fibers that run within the breast) and serve with lime wedges if you’d like. You can also keep the meat whole and refrigerate it, covered, for up to 4 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022238-dry-brined-chicken-breasts"}