{"@context": "http://schema.org", "@type": "Recipe", "name": "Enfrijoladas Pintos", "description": "In this take on enfrijoladas, chipotle makes the pinto bean sauce slightly smoky and spicy, perfect for dipping pan-fried blistered corn tortillas. If you don’t have pinto beans on hand, use black or mayocoba beans for equally delicious results. Top this dish with quick-pickled red onion, which tastes even better if you make it the day before. For a perfect weeknight meal, garnish with a dollop of sour cream, avocado slices, and a sprinkle of toasted pepitas and cilantro leaves.\n \nTo get vegetarian recipes like this one delivered to your inbox, <a href=\"https://www.nytimes.com/newsletters/the-veggie\">sign up for The Veggie newsletter</a>.", "author": {"@type": "Person", "name": "Jocelyn Ramirez"}, "image": "https://static01.nyt.com/images/2021/09/23/dining/JR-enfrijoladas-pintos/merlin_193269189_34d0a981-e8b7-4f70-b6a0-87c375ea60d8-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, weeknight, main course", "keywords": "avocado, pinto beans, tortilla, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 440}, "recipeIngredient": ["1 small red onion, halved and thinly sliced", "1/2 cup lemon juice", "1/4 teaspoon dried oregano", "1/4 teaspoon red-pepper flakes", "1 dried bay leaf", "1 1/2 tablespoons kosher salt", "Pinch black pepper", "1 whole dried chipotle morita or meco chile", "1 3/4 to 2 cups drained pinto beans, from 1 (15-ounce) can or homemade", "1 1/4 to 3 cups vegetable broth or bean cooking liquid", "Kosher salt", "4 tablespoons neutral-flavored oil, plus more as needed", "12 corn tortillas", "4 tablespoons sour cream, vegan if you’d like", "4 tablespoons roasted salted pepitas", "1/4 cup cilantro leaves", "2 ripe medium Hass avocados, pitted, peeled and sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pickled onion: Combine the onion, lemon juice, oregano, red-pepper flakes, bay leaf, salt and pepper in a medium bowl and mix. Let sit at room temperature for 30 minutes to allow the flavors to meld together and the onion to soften. The onion can be covered and refrigerated for up to 3 to 5 days before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the enfrijoladas: Place the chipotle in a small bowl and add enough hot water to cover (see Tip). Let stand to rehydrate for 10 minutes. Once rehydrated and pliable, drain and remove the stem. To a blender or food processor, add the beans, 1 1/4 cups vegetable broth or bean cooking liquid, and the softened chipotle. Blend until completely smooth. Add more of the broth, 1/4 cup at a time as needed, to make a smooth bean sauce. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a medium pot over medium-low. Add 2 tablespoons oil and heat, then add the bean mixture. Stir to incorporate; the mixture may sizzle and spatter. Allow the mixture to come to a low simmer and reduce heat to low to keep warm. Add additional liquid as needed to thin to a cheese-sauce consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a comal or cast-iron skillet over medium heat. Add 2 tablespoons oil, then add 1 to 2 tortillas and lightly fry until softened and blistered, 30 to 60 seconds per side. Transfer the fried tortillas to a plate, and continue to add more oil to the comal as needed to cook all the tortillas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use tongs to slightly submerge each fried tortilla in the hot bean mixture one at a time. Flip the tortilla over to coat the second side, then fold the tortilla in half, pull out of the pot and place on a dinner plate. Continue this process until all the tortillas are coated in the enfrijolada sauce, dividing them among 4 plates. Spoon any remaining bean sauce over the top of the tortillas. Garnish with the sour cream, pickled red onion, pepitas, cilantro and avocado."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022575-enfrijoladas-pintos"}