{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Oysters With Lemony Garlic-Herb Butter", "description": "Garlic, lemon, herbs and butter form a classic European pairing that is perfectly at home spooned into a hot grilled oyster, but if that’s not your style, try out these recipes for <a href=\"https://cooking.nytimes.com/recipes/1022322-grilled-oysters-with-buttery-soy-sake-glaze\">Buttery Soy-Sake Glaze</a> or <a href=\"https://cooking.nytimes.com/recipes/1022323-grilled-oysters-with-harissa-parmesan-butter\">Harissa-Parmesan Butter</a> — or, better yet, make all three. Any leftover flavored butter and sauces are excellent melted over grilled vegetables, such as asparagus or zucchini, or over grilled chicken, fish or even steak, and they can be stored in the refrigerator for several weeks or in the freezer for several months. When shopping for oysters, look for specimens with deeply cupped bottom shells in order to help retain their natural liquor and provide ample space for the flavored butter.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2021/06/21/dining/kla-grilled-oysters-with-lemony-garlic-herb-butter/merlin_189456819_ee92d708-924a-4335-ba93-9e3fc4f4c10e-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "24 oysters", "recipeCuisine": "american", "recipeCategory": "dinner, seafood, appetizer, side dish", "keywords": "basil, butter, garlic, oyster, parsley, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 86}, "recipeIngredient": ["1/2 cup/115 grams unsalted butter (1 stick), cut into pats", "1 ounce fresh parsley leaves (about 1 packed cup), roughly chopped", "1 ounce fresh basil leaves (about 1 packed cup)", "6 medium garlic cloves, finely minced or pressed through a garlic press", "1 lemon, zested and juiced", "Kosher salt and freshly ground black pepper", "24 oysters, scrubbed clean of any sand or grit under cool running water."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Ignite a full chimney of coals and spread out under one side of the grill once they are fully covered in gray ash, or heat half the burners of a gas grill to high. Cover and let the grill heat for 10 minutes. Meanwhile, cut off a sheet of aluminum foil twice the length of a 13-by-18-inch rimmed baking sheet. Crumple it up so that it fits into the baking sheet. The crumpled foil should be able to support the cupped side of the oysters without allowing them to tip over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the garlic-herb butter: In a food processor, combine the butter, parsley, basil, garlic, lemon zest and juice, a large pinch of salt and a few grinds of pepper. Process until the herbs are finely chopped and there are no large chunks of butter remaining, about 30 seconds total, stopping to scrape down the sides of the processor with a rubber spatula a few times as needed. Transfer the mixture to a small, oven-safe saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, arrange the oysters over the hot side of the grill, placing them with the cupped sides down, doing your best to set them in the grates so that oyster juices don’t pour out of the cups as they open. Cover and cook, checking on them every minute or so, and transferring any oysters that have begun to gape open to the foil-lined baking sheet. After a total of 4 minutes, transfer any remaining oysters to the foil whether they have opened or not. Place the saucepan on the cooler side of the grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as the oysters are cool enough to handle, pry off the top shells with a butter knife or oyster knife, severing through the muscle that holds the oyster to the shell and retaining as much juice in the shell as possible. For oysters that aren’t already gaping open, the easiest way to pry off the lids is by inserting the tip of the knife into the joint and firmly twisting it until the joint releases."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon a generous teaspoon of the garlic-herb butter (which should be fully melted by now) into each oyster, then return the oysters directly onto the grates on the hot side of the grill. Cook, uncovered, until the sauce mixture is bubbling hot, about 1 minute. Return the oysters to the foil-lined baking sheet and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022321-grilled-oysters-with-lemony-garlic-herb-butter"}