{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Nopales en Chile Rojo", "description": "Learning the art of despining and cleaning nopales, edible cactus paddles, is practically a rite of passage for many who grow up in Mexican households. If nopales grow wild somewhere in the yard, they’re gripped with tongs and sliced off the plant with a sharp knife. Once their prickly shield of armor is removed, they’re cooked until they achieve their unique soft texture. (Groceries sell nopales despined, cleaned and ready to cook.) Often, charred nopales are then drowned in a guisado — here, it’s a little spicy from chiles and saucy from tomatoes. The mild, slightly tangy nopales stained red from the chile guisado pair perfectly with fresh tortillas. This abuelita-approved dish is great with a side of pinto frijoles de la olla.", "author": {"@type": "Person", "name": "Jocelyn Ramirez"}, "image": "https://static01.nyt.com/images/2021/06/16/dining/jr-grilled-nopales/merlin_188895633_0356d4b9-566f-4302-a3b8-a88ca230331d-articleLarge.jpg", "totalTime": "PT55M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "tacos, vegetables, main course", "keywords": "beefsteak tomatoes, guajillo chiles, nopales, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 96}, "recipeIngredient": ["2 1/2 pounds nopales (6 to 8 large paddles)", "7 medium dried guajillo chiles, stemmed, seeded and rinsed", "2 medium beefsteak tomatoes, quartered", "2 garlic cloves, peeled", "Salt", "1 tablespoon neutral-flavored oil, plus more if needed", "1/2 teaspoon ground cumin", "1/4 cup pepitas, toasted", "1/4 cup cilantro leaves", "Sal de colima or flaky finishing salt, for serving", "12 corn tortillas, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Most markets sell nopales already despined and cleaned. If the paddles still have their spines, remove them: Hold a paddle by its stem and run a sharp knife along the skin, moving it away from you to scrape off spines. Then flip it over and repeat. Trim off the outer edges to remove any small spines, then cut off the stem. Repeat with all of the paddles. Rinse off the nopales, checking for any remaining spines and removing them. Pat dry. If cooking outdoors, prepare a charcoal grill or heat a gas grill to medium-high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 2 cups water to a boil in a medium saucepan. Add the chiles, tomatoes, garlic and a pinch of salt. Cover partially, reduce the heat to medium-low and simmer until the chiles have rehydrated and the garlic and tomatoes have softened, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chile mixture is simmering, grill the nopales. If cooking outdoors, place the nopales on the hot grate and grill, turning once, until pliable and slightly charred, about 10 minutes. If cooking indoors on a gas stove, turn the burners to medium-high heat and cook the nopales directly over the flame on the stove grates. Using heat-proof tongs and working in batches, place the nopales on the grates and move them around the flames until slightly charred, flipping once so they cook evenly, about 10 minutes. If using an electric stove, heat a comal or large pan over medium-high heat and lightly coat it with oil if you like. Cook, turning once, until evenly charred, about 10 minutes. Transfer to a cutting board to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the nopales cool, use a slotted spoon to transfer the rehydrated chiles, softened garlic and tomatoes to a blender or food processor with the cumin and 1 cup of the cooking water. Blend until completely smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the cooled nopales into 1/4-inch-wide strips that are 2 to 3 inches long. Heat a medium skillet over medium heat. Heat 1 tablespoon oil, then add the sliced nopales and a couple pinches of salt. Stir every now and then until the nopales are tender, have released their slime and that slime has evaporated, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to medium-low and pour in the chile mixture. Mix well, then simmer until the sauce has slightly thickened and the flavors have married, 10 to 15 minutes. Taste for seasoning and add more salt as needed (remembering that you’re garnishing with salt before serving)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the nopales are simmering in the sauce, heat the tortillas on the grill or on the stove grates’ open flames until softened and lightly charred, about 1 minute per side. Stack and wrap them in a dish towel to keep them warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the nopales from the heat and top with the toasted pepitas, cilantro leaves and flaky sal de colima. Serve with the charred tortillas."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022311-grilled-nopales-en-chile-rojo"}