{"@context": "http://schema.org", "@type": "Recipe", "name": "Coquito Ice Cream", "description": "It’s not Christmas in a Puerto Rican household without <a href=\"https://cooking.nytimes.com/recipes/1020695-coquito\">coquito</a>, a deeply creamy coconut and rum cocktail. Coquito recipes vary widely, but most include coconut milk, coconut cream, rum and sweetened condensed milk. Some have egg yolks, some don’t. Others skip the cinnamon in favor of nutmeg. This adaptation, inspired by an ice cream sold at Torico Ice Cream in Jersey City, N.J., skips the evaporated and condensed milks, which can weigh down a batter. Instead, it gets sweetness and heft from egg yolks, coconut cream and just enough sugar. Alcohol can also make freezing ice cream tricky, so rum extract steps in here for the traditional white rum, keeping it boozy without affecting the texture.", "author": {"@type": "Person", "name": "Krysten Chambrot"}, "image": "https://static01.nyt.com/images/2021/12/22/dining/22Toricorex/merlin_198975339_c061f898-1d5c-4343-96fb-b0ce28622a2a-articleLarge.jpg", "totalTime": "PT8H45M", "recipeYield": "4 cups", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets, dessert", "keywords": "christmas, coconut cream, heavy cream, rum extract", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 83}, "recipeIngredient": ["1 (15-ounce) can cream of coconut, preferably Coco López", "1 (15-ounce) can unsweetened coconut milk", "1/2 cup heavy cream", "4 teaspoons rum extract, plus more to taste", "2 tablespoons granulated sugar", "3/4 teaspoon ground cinnamon", "Pinch of salt", "4 large egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare your ice cream machine, freezing the insert bowl if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan over medium heat, combine the cream of coconut, coconut milk, heavy cream, rum extract, sugar, cinnamon and salt. Cook, stirring occasionally, until the cream of coconut melts down and all the ingredients are incorporated, making sure it does not come to a boil, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the coconut mixture cooks, place the egg yolks in a small bowl, add 1/4 cup of the coconut mixture to the yolks and whisk quickly and vigorously. (This will temper, or bring up the temperature, of the eggs, so they don’t set.) Pour the yolk mixture into the saucepan with the remaining coconut mixture, and immediately start whisking over medium heat. Continue whisking until it thickens and tastes intense, about 2 minutes. If you dip a spoon in the custard, it should coat the back. Run your finger through that coating; the stripe should hold for 3 seconds. Stir in more rum extract if you’d like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a fine-mesh strainer over a food storage container or a bowl with a lid that can hold at least 1 quart. Strain the ice cream base into the container, to catch any pieces of egg that may have solidified, cover and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up your ice cream maker, add the ice cream base to its bowl and churn according to manufacturers’ instructions. It should increase in volume and look thick and creamy, the consistency of soft ice cream. Serve the ice cream right out of the machine, or for a better, more traditional texture (think store-bought ice cream), transfer the churned ice cream to a food storage container and freeze for 4 to 5 more hours."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022816-coquito-ice-cream"}