{"@context": "http://schema.org", "@type": "Recipe", "name": "Sosis Bandari (Spicy Sausages and Onion)", "description": "Sosis bandari means “port sausage” and refers to the ports in the south of Iran, home of this delicious street food. The classic preparation combines fragrant sausages and onion cooked in a rich tomato sauce with a couple of key spices, including some type of heat. You can use any dried or fresh chile that you have on hand. This recipe calls for beef hot dogs, or franks, which are a suitable substitute for the fragrant sosis, the sausages traditionally used in this sandwich. Other versions, like this one, include creamy potatoes and green bell pepper to add bulk and to flavor the spicy and savory sausages. Serve sosis bandari as a sandwich filling on a French bun or similar type of sandwich bread, or eat it straight from the pan with bread on the side for scooping. Either way, you’ll want plenty of napkins and something cold to wash it all down.", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2021/10/05/dining/ND-sosis-bandari-spicy-sausage-onion/ND-sosis-bandari-spicy-sausage-onion-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weeknight, sandwiches, main course", "keywords": "frankfurters, onion, potato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 172}, "recipeIngredient": ["Salt", "2 medium gold potatoes (about 1 pound), peeled and cut into 1/2-inch cubes", "4 tablespoons extra-virgin olive oil, plus more if needed", "12 ounces beef hot dogs (about 6), cut into 1/3-inch slices diagonally", "1 large yellow onion, quartered and thinly sliced ", "1/2 cup chopped green bell pepper", "1/2 teaspoon ground turmeric", "1/2 teaspoon ground cayenne or preferred ground chile, or to taste", "1/2 teaspoon black pepper", "3 tablespoons tomato paste", "6 French or submarine sandwich rolls, split and lightly toasted", "1/2 cup flat or curly parsley leaves ", "Mayonnaise, yellow mustard, sliced sour dill or other pickles, sliced tomatoes, shredded iceberg or romaine lettuce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of well-salted water to a boil. Add the potatoes, cover with the lid ajar and cook over medium-high until the potatoes are tender but still holding their shape, about 5 minutes. The potatoes should not be mushy or fall apart. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large pan, heat 2 tablespoons oil over medium. Add the sliced hot dogs and cook, stirring occasionally, until plump and glistening, about 3 minutes. With a slotted spoon, transfer the hot dogs to a plate. Add the remaining 2 tablespoons oil to the oil already in the pan. Add the onion and cook, stirring occasionally, until golden brown, 12 to 15 minutes. Add the bell pepper, season with salt and cook, stirring occasionally, for 3 minutes. Add the turmeric, cayenne and black pepper, stir, and cook until fragrant, about 1 minute. Add the tomato paste and stir to cook off the raw taste, about 2 minutes. Add a little more oil if the pan is too dry. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the potatoes, hot dogs and 1/4 cup water to the pan. Stir well to combine, scraping up any browned bits and taking care not to smush the potatoes. Taste for salt and spice, and add more seasonings if desired. Cook until the flavors meld, about 3 minutes. Remove from the heat. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread mayonnaise on one half of the bread, and spread mustard on the other half. Divide the hot dog and potato mixture among the bottom rolls. Top with the parsley leaves, pickle and tomato slices, and shredded lettuce. Sandwich with the tops, slice the sandwiches in half and serve with a refreshing cold drink and plenty of napkins."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022615-sosis-bandari-spicy-sausages-and-onion"}