{"@context": "http://schema.org", "@type": "Recipe", "name": "Cauliflower and Banana Peel Curry", "description": "Although one may assume banana peels are the star of the show, they’re minor players in this flavor-packed production, adapted from “Cook, Eat, Repeat” by Nigella Lawson (Vintage Digital, 2020). It all hinges on the performance of a concentrated paste made with shallots, ginger, garlic and a red chile of your choice. This mixture forms the base of an intensely aromatic sauce that would make anything taste good. Feel free to swap out the banana skins for their surprising doppelgänger, eggplant, and the cauliflower for broccoli, potato or parsnip. Prep makes up the bulk of the work in this recipe; the curry itself comes together in under 30 minutes.", "author": {"@type": "Person", "name": "Charlotte Druckman"}, "image": "https://static01.nyt.com/images/2021/05/12/dining/10bananarex1/11bananarex1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, curries, vegetables, main course", "keywords": "banana, cauliflower, coconut milk, turmeric, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 418}, "recipeIngredient": ["3 large banana peels, tough stems and bottom ends trimmed", "1 small cauliflower and tender leaves, trimmed into bite-size florets (about 5 cups)", "1 1/4 teaspoons ground turmeric", "Fine salt", "1/4 pound shallots (about 2 to 3 large shallots), peeled and roughly chopped", "1 (1 1/2-inch) piece fresh ginger, peeled and sliced into thick coins", "1 fresh red chile (such as bird’s-eye or Fresno), quartered", "4 fat garlic cloves", "1 small bunch cilantro, stems separated and reserved, leaves chopped", "3/4 teaspoon ground cinnamon", "1 tablespoon vegetable oil", "2 tablespoons tomato paste", "1 (13-ounce) can full-fat coconut milk", "2 1/2 tablespoons lemon juice", "1 1/2 teaspoons granulated sugar", "2 teaspoons flaky sea salt, plus more to taste", "Cooked rice or flatbread (such as <a href=\"https://cooking.nytimes.com/recipes/1017747-meera-sodhas-naan\">naan</a> or <a href=\"https://cooking.nytimes.com/recipes/1020906-roti\">roti</a>), for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a full boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the banana peels in a medium-large heatproof bowl. Pour in enough of the boiling water to cover, reserving the rest for cooking the cauliflower."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cauliflower florets and leaves to the pot and boil for 5 to 7 minutes, or until fork tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cauliflower cooks, gently stir 1/2 teaspoon each turmeric and fine salt into the bowl with the soaking banana peels. Let sit until they’ve softened up and are cool enough to handle, around 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, once the cauliflower is tender, drain it into a colander in the sink; set aside while the banana peels cool and you make the curry paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the curry paste: Place the shallots, ginger and chile into a 4-cup liquid measuring cup or wide jar that accommodates an immersion blender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the flat side of a heavy knife, bruise the garlic to help remove the skins, then add the peeled cloves to the measuring cup followed by the cilantro stems, cinnamon and remaining 3/4 teaspoon turmeric. Use the immersion blender to turn everything into a paste. (Be patient: At first you’ll never think it’s going to happen, but after a while, everything will obligingly turn into a vibrantly colored mush.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the banana skins, squeezing out any excess liquid, and either chop them into slightly smaller-than-bite-size pieces, or take a fork and, with the interior of the banana skins facing you, press the tines into the top and push all the way down so that you have long, thin strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the vegetable oil in a wok or medium skillet over medium-low. When the oil is hot, add the curry paste and fry for 7 minutes, stirring most — if not quite all — of the time. As it cooks, the paste will seem to condense and tighten; it will also lose its cheery brightness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the tomato paste and cook, stirring, for 3 minutes. Add the coconut milk, lemon juice, sugar and flaky salt. Whisk to combine, scraping the browned curry from the bottom of the pan. Cook, uncovered, for 5 minutes, letting it bubble, reduce and thicken a little."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the banana skins to the pan, lower the heat and bring to a simmer for another 10 minutes, or until the sauce has thickened and the banana skins are soft. Tip in the cauliflower florets and leaves and cook until they’re hot all the way through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste and adjust for salt as needed. Scatter the reserved chopped cilantro leaves over the curry and serve with rice or flatbread, if desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022140-cauliflower-and-banana-peel-curry"}