{"@context": "http://schema.org", "@type": "Recipe", "name": "Low-Knead Sandwich Bread", "description": "With a little extra shaping and a loaf pan, basic <a href=\"https://cooking.nytimes.com/recipes/1022148-low-knead-bread\">low-knead bread</a> dough can make great sandwich bread. (The low-knead loaf is itself inspired by Jim Lahey's influential <a href=\"https://cooking.nytimes.com/recipes/11376-no-knead-bread\">no-knead bread recipe</a>.) For a softer, richer loaf, replace up to 100 grams of water with 100 grams of whole milk. For a glossy brown crust, whisk 1 egg with a couple tablespoons of water and brush it over the top of the proofed loaf with a pastry brush just before placing it in the oven. You can sprinkle the loaf with coarse sea salt, spices like caraway or cumin, or seeds, such as sunflower, sesame or pepitas, after brushing on the egg wash.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2021/05/05/dining/03Kenjirex3/merlin_186913437_0d3e38a5-dd9b-45ad-b9a9-4fdd2fb90a81-articleLarge.jpg", "totalTime": "P3DT4H", "recipeYield": "1 loaf", "recipeCuisine": "american", "recipeCategory": "breads", "keywords": "bread flour, instant yeast, salt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 221}, "recipeIngredient": ["400 grams bread flour (about 2 2/3 level cups; see Tip), plus for more dusting", "8 grams salt (about 1 1/2 teaspoons table salt, 2 teaspoons Morton kosher salt, or 2 1/2 teaspoons Diamond Crystal kosher salt)", "2 grams instant or “rapid rise” yeast (about 1/2 teaspoon; see Tip)", "280 grams warm water (about 1 cup plus 3 tablespoons; see Tip)", "1/8 teaspoon white vinegar or lemon juice", "Vegetable or olive oil, for greasing", "1 egg, whisked with 2 tablespoons water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the dough: Combine the flour, salt and yeast in a large bowl and mix with your hands until mostly homogenous. Combine the water and vinegar or lemon juice, then add to the bowl. Form one hand into a stiff claw, and stir with it until no dry flour remains and the dough forms a sticky, shaggy ball. Roll the ball around the bowl until most of the dough is part of the same large mass. The mixing process should take no more than 30 to 45 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rest the dough: Scrape your dough-covered hand with your clean hand to get most of the dough into the bowl, then invert a tall-sided medium metal or glass bowl and place it on top of the large bowl, tapping it to ensure a tight seal. Allow the dough to rest for 20 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the dough: After the dough has rested, remove the inverted bowl. The dough should look very wet and sloppy. Dip your hands briefly in a bowl of water, then shake off the excess. Using one hand, scoop your fingers under one side of the dough to the very bottom of the bowl and, working quickly, lift that side, stretch it a few inches, and fold it over to the opposite side. Rotate the bowl and repeat 4 to 6 times until you’ve worked all the way around the dough. (The dough will become noticeably tighter and a little more difficult to stretch with each fold.) Lift the dough and flip it over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the bowl with the inverted bowl and allow to continue resting. Repeat this every 20 to 40 minutes within the first 2 to 3 hours. (No need to be very precise with timing at this stage.) By the last folding step, the dough should be significantly smoother and tighter and resemble a more traditional (albeit slack) bread dough. Cover with the inverted bowl (or a cutting board), then transfer to the refrigerator and let rest at least overnight and up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil a 9-by-5-inch loaf pan. While the dough is still cold from the fridge, dust it with flour and tip it out onto a generously dusted work surface. Working quickly with lightly floured hands, flatten the dough out into a rough 8-by-8-inch square, then roll it up like a jelly roll, pinching the seam to seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dough to the prepared 9-by-5-inch loaf pan, seam-side down. Cover it with a floured kitchen towel, and let rise at room temperature until the dough is crowning over the top of the loaf pan, about 2 hours. At least 30 minutes before baking, adjust an oven rack to the center position and heat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the top of the loaf with the egg mixture. (You could also sprinkle with coarse salt, spices or seeds at this point, if desired.) Bake until deep brown and the center of the loaf registers 205 degrees, about 35 to 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a knife or a thin metal spatula between the bread and the loaf pan to loosen the loaf, then remove loaf from pan and rest on a cooling rack until completely cool."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022149-low-knead-sandwich-bread"}