{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Grits With Mushrooms and Chard", "description": "In an ode to her Black, Mexican and Haitian backgrounds, the chef Rahanna Bisseret Martinez created this recipe, which honors one of the Americas’s most important ingredients: corn. Corn grits cooked with unsweetened oat-milk cream act as a base for tender swiss chard leaves, pickled chard stems and mushrooms. Soaked then caramelized in a jalapeño sauce, the mushrooms create layers of varying textures along with the greens. This dish can be served on its own as a hearty one-plate vegan meal, or alongside a main dish or with a crisp and lightly dressed green salad.", "author": {"@type": "Person", "name": "Korsha Wilson"}, "image": "https://static01.nyt.com/images/2021/10/06/dining/04TERRYREX3-creamy-grits-mushrooms-chard/merlin_195254079_eb32b8f5-c51f-4abe-b053-2a461089a1c5-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, grains and rice, vegetables, main course", "keywords": "grits, mushroom, swiss chard, kwanzaa, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 432}, "recipeIngredient": ["1 cup grits, preferably organic (see Tip)", "1/4 cup unsweetened oat-milk cream (or coconut, nut or soy cream)", "1 tablespoon olive oil", "1 tablespoon kosher salt (Diamond Crystal)", "1/4 unpeeled yellow onion", "1 jalapeño", "3 unpeeled garlic cloves", "1 teaspoon lemon juice", "1 tablespoon olive oil, plus more as needed", "1/3 cup chopped cilantro", "8 ounces maitake or cremini mushrooms", "1 bunch rainbow chard", "3 tablespoons neutral oil, such as grapeseed, avocado or canola", "Salt and pepper", "1 jalapeño", "1 cup distilled white vinegar", "1 garlic clove", "1/4 yellow onion", "2 tablespoons granulated sugar or maple syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the grits: Cook the grits with water according to the package instructions in a large, heavy-bottomed pot, stirring occasionally and adding more water if needed to ensure no grits stick to the pot. The cook time can range from 30 minutes to 2 hours, depending on the age and quality of the grits. When the grits are tender, remove from the hot burner and pour in the oat cream, oil and salt, stir well, and cover. (If you cooked the grits with salt, then start with 1 teaspoon and add more to taste.) Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the sauce: Heat a cast-iron skillet over medium. Once heated, add the onion quarter, jalapeño and garlic cloves. Char and slightly cook the vegetables, turning occasionally. The garlic will likely be done first, after 4 or 6 minutes. Place each item in a bowl when charred and cover with a lid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the charred vegetables are cool to the touch, remove the outer skin of the onion, the jalapeño stem and the garlic peels. If you are very sensitive to spice, slice the jalapeño in half lengthwise and remove one half’s seeds and white veins to make it much milder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender or mini food processor, blend the onion, jalapeño and garlic with the lemon juice, olive oil and cilantro until smooth. Add more olive oil if needed to blend, 1 tablespoon at a time. Clean the mushrooms with a damp towel and break apart or cut at the stem into 2-inch pieces. Place the mushrooms in a bowl and pour the jalapeño sauce on top; let sit for at least 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chard: Place the chard shiny side down on a cutting board and slice the stems and ribs away from the green leaves. Stack the leaves in a pile and cut crosswise into thin strips. Transfer to a bowl, toss with 2 tablespoons oil, and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the chard stems into 2-inch-long matchsticks. In a medium saucepan, combine 1 cup water with the jalapeño, vinegar, garlic, onion and sugar, and bring to a boil. Remove the pan from the heat, add the chard stems and let sit, uncovered, for at least 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a medium cast-iron skillet over medium, add the chard leaves and cook, using tongs to move them around quickly in order to keep their bright green color, 1 to 2 minutes. Transfer to a bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, add the remaining 1 tablespoon oil and swirl to coat the bottom of the pan. Set over medium-high heat. Shake excess sauce off the mushrooms back into the bowl; too much sauce will cause them to steam instead of sear. Add the mushrooms to the hot oil, and cook until tender and caramelized, 2 to 5 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon the grits onto a large platter and top with the chard, mushrooms and pickled stems."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022602-creamy-grits-with-mushrooms-and-chard"}