{"@context": "http://schema.org", "@type": "Recipe", "name": "Cock-a-Leekie Soup (Scottish Chicken and Leek Soup)", "description": "Leeks star in this classic Scottish chicken soup, adding their sweet, oniony flavor to the meaty, fragrant broth. Some versions of this recipe omit the prunes, but their rich fruitiness is what sets this dish apart from other chicken soups. Rice, either brown or white, can stand in for the barley, and some recipes call for oats (in which case use an equal amount of steel-cut, rather than rolled). For a heartier, more stewlike soup, use 3/4 cup barley.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/02/02/dining/28Apperex/merlin_200566110_37bb0118-666e-43cb-b5c5-852e6cb2a487-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, main course", "keywords": "chicken drumsticks, chicken soup, chicken thigh, leek, prune", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 734}, "recipeIngredient": ["3 1/2 pounds bone-in, skin-on chicken thighs and drumsticks", "3 teaspoons kosher salt (Diamond Crystal), plus more as needed", "1/2 teaspoon freshly ground black pepper, plus more as needed", "4 large leeks, cleaned, greens and whites separated", "3 medium carrots, peeled (reserve peels), cut into 1/4-inch-thick coins", "2 celery stalks, thinly sliced (reserve any leaves)", "1 head garlic, halved crosswise", "1 bunch parsley, stems and leaves separated", "3 to 5 fresh thyme sprigs", "1 fresh or dried bay leaf", "1 star anise or clove", "1 teaspoon whole black peppercorns", "2 tablespoons unsalted butter", "1/2 cup pearl barley", "1/2 cup chopped pitted prunes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken with 2 teaspoons salt and 1/2 teaspoon black pepper. Set chicken aside while prepping the other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put leek greens, carrot peels, celery leaves, garlic, parsley stems, thyme, bay leaf and star anise at bottom of a large Dutch oven or soup pot. Place chicken on top of the vegetables. Add remaining 1 teaspoon salt and the peppercorns, and pour in 8 cups cold water, or enough to just submerge the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a boil over high heat, then reduce heat to a simmer and partly cover the pot. Cook until chicken is cooked through and very tender, 45 to 55 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chicken cooks, thickly slice 3 of the leek whites into 1/2-inch coins. Thinly slice the remaining leek white; set thinly and thickly sliced leeks aside separately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the chicken is tender, using tongs, transfer to a large bowl or plate to cool. Strain the broth into a large bowl, discarding vegetables and herbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the Dutch oven and return it to medium-high heat. Add butter, letting it melt. Add the thick leek coins (save the thinly sliced leek for garnish), a pinch of salt and pepper, and sauté until tender and golden brown, about 5 minutes. Transfer leek whites to a bowl (they can go on top of the chicken if there’s room)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour broth back into the pot. Bring broth to a brisk simmer, and stir in barley, carrots and celery. Let broth simmer uncovered until the liquid is reduced by a third, and the barley and vegetables are tender, 40 to 50 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the broth is simmering, use a fork or your fingers to shred chicken into bite-size pieces, discarding skin and bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the barley and vegetables are tender, stir in shredded chicken, sautéed leek whites and the prunes, and simmer for another 5 minutes to allow the prunes to soften (some might disintegrate). Taste and add salt, if needed. To serve, garnish with thinly sliced leek whites and parsley leaves."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022930-cock-a-leekie-soup-scottish-chicken-and-leek-soup"}