{"@context": "http://schema.org", "@type": "Recipe", "name": "Chile-Roasted Chicken With Honey, Lemon and Feta", "description": "A little sweet, a little spicy and very citrusy, this easy chicken recipe hits all the right notes, making it the kind of weeknight dinner you’ll put on repeat. The feta adds a creamy, salty bite that’s softened by the lemon and honey, while rosemary and red-pepper flakes round out the flavors. Serve this with a loaf of crusty bread or flatbread for scooping up all the tangy pan juices. You won’t want to leave a drop behind.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2021/05/12/dining/07Apperex/merlin_187049343_db262ec3-d01c-4c2f-a2c6-ed6c151584db-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weeknight, main course", "keywords": "chicken drumsticks, chicken thigh, feta, honey, lemon, red pepper flakes, roast chicken", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1888}, "recipeIngredient": ["3 pounds bone-in, skin-on chicken thighs and drumsticks (to substitute breasts, see Tip)", "Salt and black pepper", "2 large garlic cloves, finely grated or crushed to a paste", "1 tablespoon honey", "1 tablespoon extra-virgin olive oil, plus more for drizzling", "1/4 teaspoon red-pepper flakes, plus more for serving", "2 fresh rosemary sprigs", "1 lemon, preferably a Meyer lemon, thinly sliced and seeded", "2 ounces feta, crumbled into large pieces (a heaping 1/2 cup)", "Chopped mint, dill or parsley, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken all over with salt and pepper. In a large bowl, mix together garlic, honey, olive oil and 1/4 teaspoon red-pepper flakes. Add chicken and toss well with your hands, spreading the garlic paste all over the chicken pieces. (Don’t worry if the honey is a little clumpy.) Add rosemary sprigs and lemon slices and toss to combine. Let marinate at room temperature for 30 minutes, or up to 8 hours in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Line a sheet pan with a silicone liner or parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread chicken and lemons across a single layer in the lined pan, tucking in the rosemary sprigs. Drizzle oil generously over everything. Roast for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, turn over the chicken pieces, and give the lemons a stir. Sprinkle feta on top. Continue to bake for 20 to 25 minutes longer, until the chicken is deeply bronzed and cooked through, and an instant-read thermometer inserted into the thickest part of the thigh or drumstick registers 165 degrees. Serve garnished with chopped herbs and more red-pepper flakes, if you like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022164-chile-roasted-chicken-with-honey-lemon-and-feta"}