{"@context": "http://schema.org", "@type": "Recipe", "name": "Egg Mayo", "description": "Egg mayo — or oeuf mayo, as it’s called in France — is simply hard-boiled eggs coated with seasoned mayonnaise, but it’s so beloved in France that it has a society to protect it: Association de sauvegarde de l’oeuf mayonnaise. You could season store-bought mayonnaise for this recipe from Priscilla Martel, but at least just once, you should make your own. It’ll be delicious, and you’ll feel like a magician. The dish is beautiful served plain, and tasty dressed with anchovies, capers, snipped chives or other herbs (choose one or more). It’s good as a starter, with a pouf of dressed greens, or as part of a platter of small salads (hors d’oeuvres variées), a picnic on a tray.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2021/07/11/magazine/11mag-eat/11mag-eat-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings (1 cup mayonnaise)", "recipeCuisine": "french", "recipeCategory": "brunch, dinner, lunch, condiments, appetizer, side dish", "keywords": "egg dish, lemon juice, vegetable oil, white wine vinegar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 740}, "recipeIngredient": ["4 large eggs", "1 large egg, preferably organic, as it will not be cooked", "1 tablespoon fresh lemon juice, plus more to taste", "1 1/2 teaspoons Dijon mustard, plus more to taste", "1 teaspoon white wine vinegar, plus more to taste", "1/2 teaspoon fine sea salt, plus more to taste", "1 cup vegetable oil (or half vegetable and half olive oil)", "Freshly ground pepper", "8 to 16 anchovy fillets", "8 to 16 roasted pepper strips", "Fresh chives, snipped short or long", "Fried capers", "Crusty bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the hard-boiled eggs: Put the eggs in a small saucepan and cover with 1 inch of water. Bring to a boil, then reduce the heat so that the water is at a strong simmer and cook, uncovered, for 7 minutes. Drain the eggs into a colander, and run them under cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the eggs to the empty pan, shake the pan vigorously to crack the shells, then peel the eggs under cold running water. Rinse them and keep them covered in the refrigerator until needed. (They should be used the same day.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the mayonnaise: Put the egg, lemon juice, mustard, vinegar and salt in the container of a blender; pulse to mix. With the machine running on high speed if your blender has two or three speeds, or on medium to medium-high if your blender has more speeds, slowly and steadily pour in the oil, stopping halfway through to scrape down the sides of the container. Every blender is different, so it’s hard to say how long it will take for the oil to be incorporated and the mayo to set. Taste and see if you want to add more lemon juice, mustard, vinegar or salt. Scrape into a clean container, cover and refrigerate until needed. (The mayo will keep for up to 4 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the dish, you’ll need about half the mayonnaise to cover the 4 hard-boiled eggs. You want the mayo to be thin enough to just coat the eggs — it should come off the spoon in quickly dissolving ribbons — so, if needed, thin it with a little hot water. (You might need 3 to 4 teaspoons; check as you go.) Taste, and see if you want more salt and some pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the eggs in half lengthwise and place them on a platter, yolk side down or up. Spoon the mayonnaise on top, coating the egg and allowing some to slip over the sides. Garnish the eggs as you like. Serve with bread, of course."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022396-egg-mayo"}