{"@context": "http://schema.org", "@type": "Recipe", "name": "Delicata Squash and Corn Fritters", "description": "These vegetable-packed fritters are crispy around the edges and tender in the center. Delicata squash has a thin skin that can be left on, adding color and a dose of nuttiness. Corn adds pops of sweetness, while moist zucchini helps bind the patties. Fragrant fried sage leaves do double duty in this dish: First they infuse the oil with herbaceous flavor, then they become a beautiful, crisp garnish. For the best results, fry the fritters and serve immediately; however, they can also be made a few hours ahead and reheated at 350 degrees for about 15 minutes until hot and crisp.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2021/11/15/dining/kc-delicata-squash-and-corn-fritters/merlin_197339925_0a5ac08d-d4c0-49ee-a99a-40628e37bf43-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "16 fritters", "recipeCuisine": "", "recipeCategory": "vegetables, appetizer, side dish", "keywords": "corn, delicata squash, scallion, zucchini, fall, thanksgiving, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 381}, "recipeIngredient": ["3/4 cup safflower or canola oil", "16 large sage leaves", "4 ounces zucchini (1 small)", "1 pound delicata squash (about 1 large), scrubbed, halved lengthwise and seeded (skin left on)", "1 cup fresh corn kernels (from 1 to 2 ears), or thawed from frozen", "1/2 cup thinly sliced scallions (from 2 to 3 scallions)", "1 teaspoon minced garlic", "1 large egg, beaten", "Kosher salt and black pepper", "3/4 cup (105 grams) all-purpose flour", "1 teaspoon baking powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a plate with a paper towel. In a medium (10-inch) nonstick skillet, heat oil over medium until shimmering. In 2 batches, fry sage leaves, turning, until darker green in color and crisp, about 1 minute. (Be careful not to burn; sage will continue to crisp up as it cools.) Using tongs or a slotted spoon, transfer to the paper towel-lined plate. Pour sage oil into a heatproof bowl and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor fitted with the grating attachment, or on the large holes of a box grater, shred the zucchini. (You should have ½ cup.) Squeeze to remove excess water and transfer zucchini to a large bowl. Then shred the delicata squash. (You should have 3¼ to 3½ cups.) Add to the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the corn, scallions and garlic to the bowl of shredded zucchini and squash, and mix until evenly combined. Add egg, season with salt and pepper, and mix well. Sift flour and baking powder into the bowl, and fold until well combined and no white streaks remain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a platter or baking sheet with paper towels. In the skillet, heat 3 tablespoons of the reserved sage oil over medium. Working in batches of four, spoon ¼-cupfuls of the batter into the skillet, flattening the fritters until they’re just over 3 inches in diameter each. (They should look lacey.) Cook until fritters are set and golden and crisp underneath, about 3 minutes. Flip and cook until crisp on the second side (adding a little more sage oil if the pan looks dry), about 2 minutes. Transfer to the paper towel-lined platter and season with salt. Repeat with the remaining sage oil and batter, adding about 3 tablespoons of oil with each batch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer fritters to a serving platter and garnish with the crispy sage leaves. Serve warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022643-delicata-squash-and-corn-fritters"}