{"@context": "http://schema.org", "@type": "Recipe", "name": "Cuban Buñuelos With Anise Syrup", "description": "For many Cubans, the Christmas season means that frying buñuelos for dessert is almost as important as serving roast pork for dinner. Buñuelos have roots in Spain, particularly a Spain once under Muslim rule, but the Cuban version, spiced with anise and shaped into figure eights, highlights the island’s abundance of root vegetables like yuca, boniato, malanga, ñame and calabaza. They can be found in many Latino grocery stores, and they give the buñuelos a pillowy, doughnutlike texture inside and crisp up when deep-fried. This recipe is adapted from “<a href=\"https://www.amazon.com/Cuban-Table-Celebration-Flavors-History/dp/1250036089\">The Cuban Table: A Celebration of Food, Flavors and History</a>” by Ana Sofía Peláez.", "author": {"@type": "Person", "name": "Christina Morales"}, "image": "https://static01.nyt.com/images/2021/12/13/dining/13Bunuelos-Caribbean-Cornmeal-a/merlin_198717264_b7d655c2-f6b0-4b85-8a62-8868d473cf00-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "14 buñuelos", "recipeCuisine": "cuban", "recipeCategory": "dessert", "keywords": "anise, boniato, calabaza, malanga, ñame, yuca, christmas, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 27}, "recipeIngredient": ["1 cup granulated sugar", "1 whole star anise", "1 cinnamon stick", "1 (3-inch) strip lime peel", "1 tablespoon lime juice", "1/2 pound peeled yuca, cut into 1-inch pieces, or precut frozen yuca (see Tip)", "1/4 pound peeled boniato, cut into 1-inch pieces", "1/4 pound peeled malanga, cut into 1-inch pieces", "1/4 pound peeled ñame, cut into 1-inch pieces ", "1 tablespoon kosher salt (Diamond Crystal)", "1 teaspoon whole anise seeds", "1/4 pound peeled calabaza (or other winter squash or pumpkin), cut into 2-inch pieces ", "3 to 4 cups all-purpose flour, plus more for dusting", "3 large eggs, beaten", "2 cups canola oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the syrup: In a saucepan, combine 2 cups water, granulated sugar, star anise, cinnamon stick and lime peel, and bring to a boil over medium high, stirring to dissolve the sugar. Reduce heat to a simmer, then cook until the mixture is thin and syrupy, 15 to 20 minutes. Off the heat, add the fresh lime juice. Let the syrup cool while you make buñuelos."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the buñuelos: To a medium or large heavy pot, add the yuca, boniato, malanga, ñame, salt and anise seeds and enough cold water to cover. Bring the water to a boil, then reduce to a simmer, cover and cook for 10 minutes. Add the calabaza and cook, covered, until all the vegetables are tender, but not mushy, 10 to 15 minutes more, then drain in a colander. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the vegetables are still warm, press the vegetables through a ricer or food mill onto a large lightly floured surface or bowl. Form the mixture into a big mound, then make a well in the center. Pour the eggs into the well and use your hands (it will be sticky) to fully combine. Sift 3 cups flour, 1 cup at a time, over the dough and knead after each addition until it forms a smooth, soft dough that holds together. Add 1 to 2 tablespoons more flour if needed for the dough to come together. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the dough into 14 equal pieces, and transfer to a clean work surface. Roll each piece into a 16-inch rope about 1/2-inch-thick. Moisten one end of the rope with a little water, shape it into a figure eight, then press the ends together. Transfer to a sheet pan lightly dusted with flour. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 10-inch skillet, heat the canola oil over medium-high until it reaches 375 degrees. If you don’t have a deep-fry thermometer, you can test the oil by dropping in a bit of dough. If the oil is hot enough, it will float to the top right away. Working in batches of 2 or 3 (don’t crowd the pan), carefully add the buñuelos to the oil, and fry until they are golden brown, 2 to 3 minutes per side. Transfer to a plate lined with paper towels to drain excess oil. Spoon the syrup over the buñuelos and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022818-cuban-bunuelos-with-anise-syrup"}