{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Tofu With Sweet-and-Sour Sauce", "description": "Inspired by McDonald’s Chicken McNuggets dipped in sweet-and-sour sauce — a classic combination that debuted nationwide in 1983 — this tofu appetizer gets its inexorable crunch from potato starch. Pan-fried until shatteringly crisp, pressed tofu, cut into cute little rectangles, eats a lot like Chicken McNuggets and cooks up gorgeously every time. But the true joy of a nugget lies in the dipping, and this recipe stars a totally chill, no-cook sweet-and-sour sauce. Apricot preserves provide fruity sweetness as well as body, and rice vinegar, soy sauce and onion powder add savoriness.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2021/07/18/magazine/18mag-eat/18mag-eat-articleLarge-v3.jpg", "totalTime": "PT45M", "recipeYield": "4 appetizer servings", "recipeCuisine": "", "recipeCategory": "snack, beans, finger foods, appetizer", "keywords": "apricot preserves, firm tofu, potato starch, zucchini, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1035}, "recipeIngredient": ["1 (14-ounce) package firm tofu, drained", "3 medium zucchini (about 1 pound)", "3 teaspoons kosher salt, plus more to taste", "1/2 cup apricot preserves", "2 tablespoons rice vinegar", "2 tablespoons soy sauce", "1/2 teaspoon red-pepper flakes", "1 1/2 teaspoons onion powder", "1/2 cup potato starch", "Neutral oil, such as vegetable or canola oil, or light olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Press the tofu: Wrap the block of tofu in a clean tea towel, and place on a cutting board. Weigh down the tofu with a sheet pan topped with something heavy, such as a large skillet, cans or books, until the tea towel is soaked, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the tofu is pressed, prep the zucchini: Halve the zucchini crosswise, then cut each piece lengthwise into 1/4-inch-thick planks. Finally, cut each plank lengthwise into 1/4-inch-thick “fries.” Place the zucchini fries in a large colander set over a medium bowl. Add 1 teaspoon salt, and toss until evenly coated. Set aside to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the sauce: In a measuring cup, stir together the apricot preserves, rice vinegar, soy sauce, red-pepper flakes, 1 teaspoon onion powder and 2 teaspoons water until smooth. Transfer to a small dish for dipping, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the pressed tofu in half horizontally, and cut each of those halves into 8 rectangular pieces, creating 16 nuggets total. Directly on the cutting board, season the tofu with 1 teaspoon salt and the remaining 1/2 teaspoon onion powder, smearing each piece around to catch all the seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss to combine the potato starch and the remaining 1 teaspoon salt. Place the tofu in the starch, and gently toss with your hands until each piece is evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry the tofu: Heat a large skillet over medium-high, and add a thin layer of oil, enough to coat the bottom of the pan. Add the tofu in a single layer, and cook, flipping a couple of times, until lightly golden on both sides, about 10 minutes total. Transfer the cooked tofu to a towel-lined plate to drain, and season it with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, transfer the tofu and zucchini to a large platter, and serve alongside the dipping sauce."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022410-crispy-tofu-with-sweet-and-sour-sauce"}