{"@context": "http://schema.org", "@type": "Recipe", "name": "Tahini Thumbprints Cookies With Dulce de Leche", "description": "Pleasantly bitter tahini and rich, sweet dulce de leche make a perfect pair in these charming little cookies. The tahini gives the baked dough a fudgy, halvahlike texture and flavor, and a chewiness that’s totally irresistible. Top the dulce de leche centers with a sprinkle of flaky salt for sweet-salty perfection in each bite. These cookies are also excellent filled with a dollop of raspberry jam in place of the dulce de leche.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2021/12/08/dining/08COOKIESREX24-TAHINI/merlin_198248772_bbed4df1-36ff-44df-bb32-c322c1928503-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "About 28 cookies", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "brown sugar, christmas cookie, dulce de leche, tahini, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 663}, "recipeIngredient": ["1 1/3 cups/170 grams all-purpose flour", "1/2 teaspoon baking powder", "1/4 teaspoon baking soda", "1/2 packed cup plus 2 tablespoons/130 grams light brown sugar", "6 tablespoons/85 grams unsalted butter, softened", "3/4 cup/200 grams tahini, stirred well", "1 large egg plus 1 large egg yolk, at room temperature", "2 teaspoons pure vanilla extract", "1/2 teaspoon fine sea salt", "Heaping ½ cup/180 grams dulce de leche, store-bought or homemade ", "Flaky salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place racks in the upper and lower thirds of an oven and heat the oven to 350 degrees. Line 2 sheet pans with parchment paper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the flour, baking powder and baking soda, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, or with a hand mixer, cream together the sugar and butter on medium-high speed until light and fluffy, 2 to 3 minutes. Add the tahini and mix on medium speed until well combined, stopping to scrape down the sides and bottom of the bowl as needed with a rubber spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the egg, egg yolk, vanilla extract and salt to the butter-tahini mixture, and mix on medium speed until emulsified, about 1 minute. Scrape down the sides and bottom of the bowl to ensure the dough is evenly mixed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour mixture, and mix on low speed until just combined and no streaks of flour remain. Scrape the sides and bottom of the bowl to ensure the dough is evenly mixed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the cookies into tablespoon-size balls and place them on the baking sheets about 2 inches apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cookies for 7 minutes, then remove them from the oven and very carefully use your thumb or the handle of a wooden spoon to make a teaspoon-size indent in the center of each cookie. The cookies will crack slightly along the edges; that’s OK. Return the cookies to the oven, rotating the pans from front to back and top to bottom. Bake until the cookies are set and just barely golden at the edges, another 5 to 7 minutes. Set the pans on cooling racks and press on the indentations slightly if they have puffed up during the baking process. Let the cookies cool for 10 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a small spoon or pastry bag to fill the indentation of each cookie with about 1 teaspoon of dulce de leche, and sprinkle with flaky salt, if using. Let cool completely on the pans. Store in a single layer in an airtight container for up to 5 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1022759-tahini-thumbprints-cookies-with-dulce-de-leche"}