{"@context": "http://schema.org", "@type": "Recipe", "name": "Maple Cream Pie With Blueberries", "description": "In this blueberry pancake pie, the best diner breakfast toppings — maple syrup, whipped cream and saucy blueberries — come together in a buttery crust. Boiling down pure maple syrup intensifies its deep woodsy sweetness, which blends into a softly set custard that slices neatly after chilling. The filled pie can be refrigerated for days, but the cream should be whipped and swirled on top just before serving for the prettiest and tastiest swoops.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/11/13/dining/13PIESREX-maple-cream/merlin_214872396_a66e6801-6300-4644-8173-5d3e92215614-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "One 9-inch pie", "recipeCuisine": "", "recipeCategory": "pies and tarts, dessert", "keywords": "blueberry, dark brown sugar, egg yolks, half and half, make-ahead, maple syrup, pie, pie dough, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 338}, "recipeIngredient": ["1 disk <a href=\"https://cooking.nytimes.com/recipes/1023573\">All-Butter Pie Crust</a>", "All-purpose flour, for rolling", "1 cup/330 grams pure maple syrup", "1/2 cup/110 grams packed dark brown sugar", "2 packed tablespoons cornstarch", "1/2 teaspoon fine sea or table salt", "3 cups/725 grams half-and-half", "4 large egg yolks", "1/2 teaspoon cornstarch", "1 cup/150 grams blueberries", "3 tablespoons granulated sugar", "1 1/2 cups/360 grams heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pie: If the dough has been refrigerated for more than an hour, let sit at room temperature for 10 minutes first. On a lightly floured surface, use a lightly floured rolling pin to roll the dough into a 12 1/2-inch round. Roll the dough up onto the pin, then unroll it over a standard (not deep-dish) 9-inch pie plate, centering it. Gently tuck and press it into the bottom and sides of the plate without stretching the dough. Fold the overhang of dough under itself around the rim so that the dough extends a little over the edge of the plate. If you’d like, crimp the edges of the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the dough has softened, refrigerate or freeze it until firm, about 30 minutes in the refrigerator or 10 minutes in the freezer. While the dough chills, position a rack in the lowest position in the oven and heat to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a fork to poke holes all over the bottom of the dough without piercing all the way through, if possible. Line the dough with a sheet of crumpled parchment paper. (Crumpling helps it lie flat against the dough.) Fill the lined dough to the top with pie weights, such as dried beans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake on the bottom rack until the edges are light golden brown and the sides look dry, 25 to 30 minutes. Remove the pie weights with the parchment and return the empty shell to the bottom rack. Bake until the bottom is golden, 5 to 10 minutes. Cool on a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the maple syrup to a boil in a large saucepan over medium heat. Boil (without stirring) until reduced to 3/4 cup, about 7 minutes. Pour the syrup into a liquid measuring cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the brown sugar in the same saucepan off the heat (no need to wash it). Sprinkle the cornstarch and salt over it and whisk well, then whisk in the half-and-half until blended. Whisk in the egg yolks until evenly incorporated. Continue whisking and add the reduced syrup in a slow, steady stream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the mixture to a boil over medium heat, whisking continuously, then continue at a full boil with big bubbles, whisking often, until very thick, 7 to 10 minutes. (When you run the whisk across the bottom of the saucepan it should leave a clear trail.) Scrape into the cooled pie crust and spread in an even layer. Cool to room temperature, then refrigerate, uncovered, until cold and firm, at least 3 hours. The pie can be refrigerated for up to 3 days (and should be covered after 3 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the topping: Mix the cornstarch with 1 tablespoon cold water and set next to the stove. Combine the blueberries, sugar and 2 tablespoons water in a medium saucepan. Bring to a simmer over medium heat, stirring occasionally to dissolve the sugar. Simmer just until the liquid is tinted by the berries, about 1 minute, then stir in the cornstarch mixture. Simmer, stirring continuously, until the liquid has thickened slightly, about 1 minute. Remove from the heat and transfer to a bowl. Refrigerate uncovered until cool, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the cream with an electric mixer or by hand (which will take a while and be a workout, but it works) until medium-firm peaks form. (The peaks should stand up and curl down at the tip.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dollop the cream over the chilled maple pie and swirl to create peaks and valleys. Spoon some of the berry mixture into the valleys and swirl, if you’d like. Serve immediately with the remaining berry mixture on the side."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023577-maple-cream-pie-with-blueberries"}