{"@context": "http://schema.org", "@type": "Recipe", "name": "Crunchy Spring Iceberg Salad", "description": "A big plate of greens may feel virtuous, but this one is also luxurious. This is a very green salad, with chunks of crisp iceberg lettuce serving as a bed for briefly blanched peas and asparagus, topped with a cooling-yet-spicy cilantro yogurt. Tearing the iceberg into bite-size chunks makes this an easy-to-eat salad, no knife required. It’s particularly great for outdoor dining or for those who need to eat with one hand. (We see you, new parents.) The feta adds lovely hints of tang and saltiness that work well with the herbaceous yogurt. The peas and asparagus bring freshness; you could also use other springtime staples such as snow peas, sugar snap peas or sliced radish. Serve with jammy boiled eggs for something heartier.", "author": {"@type": "Person", "name": "Hetty McKinnon"}, "image": "https://static01.nyt.com/images/2022/04/27/dining/hm-iceberg-salad/merlin_205522521_f65dde75-9410-49e7-bbff-5533e8380e8e-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weekday, salads and dressings, side dish", "keywords": "asparagus, feta, iceberg lettuce, healthy, vegetarian, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 400}, "recipeIngredient": ["Salt and black pepper ", "2 cups frozen peas", "16 to 20 asparagus spears, trimmed and sliced into 1-inch pieces (about 12 ounces)", "1 (1½-pound) medium head iceberg lettuce", "6 ounces feta, drained and broken into chunks", "Handful of cilantro leaves, for serving", "1 cup full-fat Greek yogurt", "1 cup chopped cilantro (leaves and tender stems from about ½ bunch)", "2 tablespoons extra-virgin olive oil", "Juice of ½ lemon or lime (1 to 2 tablespoons)", "1 garlic clove, peeled and roughly chopped", "1 teaspoon kosher salt (such as Diamond Crystal)", "1 to 2 jalapeños or serrano chiles, trimmed and roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the salad: Bring a medium saucepan of salted water to the boil. Add the frozen peas and asparagus, and cook for 1 to 2 minutes until the asparagus and peas are bright green and crisp tender. Drain and run under cold water until they are cold. Leave to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the lettuce: Run a sharp paring knife around the core and gently pull it out. Remove the outer layer of the lettuce and discard. Tear the lettuce into large chunks. Wash the leaves and allow them to dry in a colander. Pat them dry with a clean kitchen towel. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the spicy cilantro yogurt: To a blender or small food processor, add the yogurt, cilantro, olive oil, lemon juice, garlic, salt and 1 jalapeño. Blitz until smooth. (Add a teaspoon of water at a time to get the mixture moving in the blender if necessary.) Taste and add the second jalapeño if you would like it spicier."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve as one large salad or divide among four individual serving plates: Add the lettuce chunks to the plate, and scatter the asparagus and peas on top and around the lettuce. Spoon the spicy cilantro yogurt all over the vegetables, dot with feta and squeeze the juice from the lemon half over everything. Season with salt and black pepper, and top with a few cilantro leaves."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023138-crunchy-spring-iceberg-salad"}