{"@context": "http://schema.org", "@type": "Recipe", "name": "Baghali Ghatogh (Fava Bean Stew)", "description": "A popular and beloved stew from northern Iran, baghali ghatogh is an ambassador of early spring produce. Earthy, bright-green fava beans, fragrant dill and an assertive amount of garlic are combined with eggs for a comforting meal. Although shelling and peeling fresh favas is a rite of passage (see Tip), it’s a time-consuming task, given the amount needed here (but if you have the time, go for it!). Frozen fava beans are a worthy substitute, but if they aren't available, you can use canned butter beans or frozen lima beans. Just enough eggs are used to give the stew some heft, but they shouldn’t overwhelm the vibrant flavors of this verdant stew. The eggs can be incorporated two ways: cracked in and poached, or stirred in to break apart. Baghali ghatogh is typically served over rice with a side of smoked fish and pickled garlic, or with bread. ", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2022/04/26/dining/nd-baghali-ghatogh/merlin_205954455_f3fc9869-83f5-402b-ac28-81a68c126a64-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, lunch, beans, soups and stews, main course", "keywords": "dill, eggs, fava beans, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 267}, "recipeIngredient": ["1/4 cup olive oil", "5 to 10 large garlic cloves (depending on preference), finely grated  ", "1 teaspoon ground turmeric", "14 ounces double-peeled frozen fava beans, thawed (see Tip), or 2 (15-ounce) cans butter beans, lima beans or cannellini beans, rinsed", "2 large bunches fresh dill (about 8.5 ounces), stems trimmed, finely chopped, or ¼ cup dried dill", "Kosher salt (such as Diamond Crystal) and black pepper", "3 to 4 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the oil and garlic to a medium pot, then set it over medium-low heat. Cook the garlic, stirring often, until fragrant and cooked, taking care not to burn it, 5 to 7 minutes. Add the turmeric, stir and cook until fragrant, about 30 seconds. Add the beans, dill, 1½ teaspoons salt and ¼ teaspoon pepper. Stir gently so the beans don’t break, and cook for about 3 minutes, just so the flavors meld and no longer taste raw. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat to medium-high, add enough water to cover the beans, about 2 cups (or more as needed, if you’re using cannellini beans, which absorb more liquid), and bring to a gentle boil. Partially cover with the lid barely ajar, reduce the heat to medium-low, and gently simmer, stirring occasionally, until the beans are tender, but still maintain their shape (no mushy beans please), and the flavors have come to life, about 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the beans and liquid for salt and pepper, and adjust as needed. The stew should be juicy enough to serve over rice, but if it seems too liquidy, remove the lid and cook a little longer to reduce it, keeping in mind that the eggs will also thicken it up. Add a little more water if the stew is too thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat to medium and add the eggs one at a time. If poaching whole eggs, use 4 eggs and make individual wells in the stew before adding each egg. Cook, uncovered, until the whites set and the yolk is cooked to desired consistency, 3 to 5 minutes. (Alternately, you can stir the eggs in: Add 3 eggs, then run a spoon through each egg to break them apart and cook, slightly covered, until the eggs set, about 3 to 5 minutes.) Taste, add more water if the stew is too thick, adjust seasoning and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023156-baghali-ghatogh-fava-bean-stew"}