{"@context": "http://schema.org", "@type": "Recipe", "name": "Chile-Crisp Chickpea Rice Bowls", "description": "These rice bowls are both a comfort and a thrill to eat. They star chickpeas sizzled in <a href=\"https://cooking.nytimes.com/recipes/1022366-chile-crisp\">chile crisp</a>, a Chinese condiment made of oil, chiles and a variety of textural and umami-packed ingredients, such as fried shallots and garlic, sesame seeds, and preserved black beans. You could snack on the electrifyingly tingly chickpeas solo, or make them into a meal with rice and a juicy mixture of tomatoes, celery, cilantro and soy sauce. You can swap out the celery for other crunchy vegetables, like bok choy, cucumbers or snap peas, but keep the tomatoes; their sweetness provides reprieve from the spicy chickpeas.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/08/22/dining/as-Chile-Crisp-Chickpea-Bowls-1/merlin_210911856_fcd98640-9aff-4b7a-8bc1-3449dd779413-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, weeknight, main course", "keywords": "cherry tomatoes, chickpea, chile crisp, grain bowl, rice, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 433}, "recipeIngredient": ["1 1/2 cups sushi rice (short-grain white rice), rinsed until water runs clear", "Kosher salt (such as Diamond Crystal)", "1/4 cup store-bought or <a href=\"https://cooking.nytimes.com/recipes/1022366-chile-crisp\">homemade chile crisp</a>, plus more for serving", "Neutral oil (such as grapeseed), as needed", "3 cups cooked, rinsed chickpeas (homemade or from two 15-ounce cans)", "Granulated sugar, to taste", "1 pint (8 to 10 ounces) cherry or other small tomatoes, halved", "4 celery stalks, coarsely chopped, plus any leaves", "1/4 cup coarsely chopped cilantro leaves and stems", "2 tablespoons soy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine the rice, 1 teaspoon salt and 2 cups water. Bring to a boil over high, then cover and reduce heat to low. Cook until rice is tender and most of the liquid is absorbed, about 20 minutes. Turn off the heat and let rice rest, covered, until ready to eat. (Alternatively, cook rice in a rice cooker or however you like to cook rice.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the rice cooks, make the chickpeas: Add the chile crisp to a large (12-inch), nonstick skillet and heat over medium. (Make sure there is enough oil — not just solids — covering the bottom of the skillet. If your chile oil is mostly solids, add a little neutral oil to cover to skillet.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chickpeas and a pinch of sugar, stir to coat in the oil, then spread into an even layer. Cook until the chickpeas start to sizzle, 2 to 3 minutes. Cook, stirring occasionally, until browned and crisp all over, 7 to 10 minutes more. If the pan looks dry at any point, add a drizzle of neutral oil (or more chile crisp if you want it really, really spicy). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chickpeas and rice cook, stir together the tomatoes, celery, celery leaves, cilantro, soy sauce and a pinch of sugar in a medium bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the rice and chickpeas are ready, divide the rice among plates or bowls. Pour some of the liquid from the bowl of tomatoes over the rice, then top with the tomatoes and celery, the chickpeas and more chile crisp, if desired. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023420-chile-crisp-chickpea-rice-bowls"}