{"@context": "http://schema.org", "@type": "Recipe", "name": "Chiffon Cake", "description": "In 1927, a former insurance agent in Los Angeles was fiddling obsessively with ingredients in his home kitchen when he came up with a cake that was weightless yet rich — angel and devil at once — which we know today as chiffon. His secret: Instead of butter, he used vegetable oil in a batter thick with yolks, folded together with glossy peaks of whipped egg whites. The cake’s kinship to clouds makes it an ideal dessert for Christopher Tan, who lives in Singapore, where the temperature and humidity are enemies of more traditional, butter-based cakes. Here, he uses mandarin oranges, packing in as much juice and zest as possible. The most difficult part is beating the egg whites properly. Tan has a baking secret of his own: He mixes a little potato starch (which absorbs more liquid than other starches) into the meringue, to guard against deflating.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2022/12/04/dining/04EAT-chiffon-cake/04EAT-chiffon-cake-articleLarge.jpg", "totalTime": "PT1H5M", "recipeYield": "One 10-inch cake (8 to 12 servings)", "recipeCuisine": "", "recipeCategory": "cakes, dessert", "keywords": "cake flour, egg whites, freezer friendly, make-ahead, orange juice, orange zest, plan-ahead, potato starch, vegetable oil", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 512}, "recipeIngredient": ["3/4 cup/140 grams superfine (caster) sugar ", "1 tablespoon/10 grams potato starch ", "9 large egg whites (325 grams) ", "1 teaspoon cream of tartar ", "1 3/4 cups/215 grams cake flour ", "2 teaspoons double-acting baking powder ", "2/3 cup/120 grams superfine (caster) sugar  ", "7 large egg yolks ", "1/2 cup/110 grams sunflower oil (or other neutral-tasting oil) ", "Grated zest of 4 large mandarin oranges (about 2 tablespoons)", "3/4 cup/170 grams fresh mandarin orange juice (see Tip)", "1 tablespoon/10 grams fresh lime or lemon juice ", "1 teaspoon vanilla extract ", "1/2 teaspoon fine salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange one oven rack in the lower third of the oven and heat oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Have ready a 10-inch ungreased, unlined chiffon cake pan (a 2-piece tube pan)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meringue: Mix sugar with potato starch. In a clean bowl, whisk egg whites and cream of tartar with an electric stand or hand mixer on low speed, gradually increasing the speed to high, until the foam starts to pile up in floppy mounds. Gradually add sugar mixture while beating constantly, then beat until meringue is slightly glossy and stiff peaks just start to form. When you lift the whisk quickly and vertically out of the meringue, it should leave behind a pointed peak which curls over just slightly at the tip. Set meringue aside briefly while you proceed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake batter: Sift cake flour and baking powder into a large mixing bowl. Add sugar and whisk very well to thoroughly combine everything. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk egg yolks, oil, orange zest and juice, lime juice, vanilla and salt together in another bowl until well blended. Scrape this mixture into the flour mixture and whisk gently just until batter is smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Briefly re-beat meringue for 10 seconds or so to redistribute any moisture which may have  settled out. Add one-third of meringue to the cake batter and fold gently until almost blended. Add half of the remaining meringue to the batter and fold in likewise. Lastly, scrape the batter into the meringue mixing bowl and fold it into the remaining meringue until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour finished mixture gently into the pan. Bake on a low oven rack for 55 to 65 minutes. When the cake is done, a cake tester inserted into it midway between the pan side and the central tube will emerge damp but clean, with no gooey batter clinging to it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cake from the oven and immediately turn it upside down. Stand it on the cake pan’s feet, or, if the pan has no feet or if the cake has risen higher than the feet, balance the central column on a narrow jar or bottle neck. Let cake cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To unmold, turn cake right side up, then run a long, thin, sharp knife around the cake’s edge  and around the central tube. Lift tube and pan base insert out of the pan, and the cake with it.  Run the knife around the base of the cake to free it from the insert, then invert it onto a serving  plate and remove the insert. Slice cake with a very sharp plain or serrated knife to serve. Once fully cool, the cake can be refrigerated in an airtight container for 5 to 6 days. Well-wrapped individual slices can be frozen for up to 2 months."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023692-chiffon-cake"}