{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti Aglio e Olio e Fried Shallot", "description": "Adding <a href=\"https://cooking.nytimes.com/recipes/1023193-fried-shallots\">homemade</a> or store-bought fried shallots to classic garlic spaghetti gives it extra caramelized sweetness and depth of flavor, along with crunch. Add the shallots in two stages so that some of them soften and give their flavor to the sauce, and the rest remain crispy. Cooking the spaghetti in a relatively small amount of water concentrates its starch, making it easier to form a creamy, emulsified sauce. If you can’t have your pasta without cheese, feel free to grate some Parm or pecorino on top at the table.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2022/05/25/dining/23kenjirex1-spaghetti/merlin_206815800_8989c2e5-1383-48c4-9d8e-1925c3542641-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "pastas, main course", "keywords": "fried shallots, olive oil, spaghetti, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 237}, "recipeIngredient": ["1/4 cup store-bought or <a href=\"https://cooking.nytimes.com/recipes/1023193-fried-shallots\">homemade</a> fried shallots (see Tip)", "Kosher salt", "6 medium garlic cloves", "1 pound dried spaghetti (see Tip)", "6 tablespoons extra-virgin olive oil", "Pinch of red-pepper flakes", "1 tablespoon minced fresh parsley leaves (optional)", "1 tablespoon minced fresh chives (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using homemade shallots, skip to Step 2. If using store-bought shallots, toast them in a dry 12-inch skillet over medium heat until deep caramel brown and aromatic, about 3 minutes. Season generously with salt and transfer to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Smash the garlic cloves with the side of a knife and roughly mince. Set aside. Add a couple of inches of water and a large pinch of salt to the skillet, and bring to a rolling boil over high heat. Add the pasta and cook, stirring occasionally, until just shy of al dente (about a minute less than the package directions)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine ¼ cup oil, the minced garlic, red-pepper flakes and a large pinch of salt in a large saucepan or skillet. Heat, stirring frequently, over medium-low until the garlic is very aromatic and just starting to turn pale gold in parts, about 5 minutes. It should maintain a very gentle sizzle the whole time it is cooking (adjust heat as necessary). When the garlic is done, shut off the heat, then, using a ladle or spoon, add a large splash of the pasta water to the pan with oil to halt the cooking. Add half the toasted shallots and stir."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pasta is just shy of al dente, using tongs, transfer it to the pan with the garlic oil, allowing any liquid that clings to it to come along; reserve a bit of the pasta water. Add the remaining 2 tablespoons olive oil. Return the pan with the pasta and garlic oil to high heat, and cook, stirring and tossing constantly, until a creamy, emulsified sauce coats the pasta. (If the sauce looks watery, continue tossing and cooking. If it looks broken and oily, add some more pasta water a few tablespoons at a time and continue cooking until it emulsifies.) Stir in the parsley and chives (if using), season to taste with more salt (it can take quite a bit of salt), transfer to a serving bowl, sprinkle with reserved toasted fried shallots and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023190-spaghetti-aglio-e-olio-e-fried-shallot"}