{"@context": "http://schema.org", "@type": "Recipe", "name": "Empanadas de Chipilín", "description": "These empanadas are very common in the food stalls of the mercados and tianguis (open-air market) in the southern state of Chiapas. A plant native to Mexico, chipilín lends its leaves to stews and salsas, and is mixed into corn masa to make tortillas, tamales and empanadas in the country’s center and south. Adding chipilín to masa lends a subtle herbaceousness that complements the earthiness of the corn. If you can’t find it, spinach, chard or kale makes a great substitute.", "author": {"@type": "Person", "name": "Rick A. Martínez"}, "image": "https://static01.nyt.com/images/2022/10/12/dining/12ESSENTIALSREX-empanadas/merlin_214158408_8c5dc549-223a-4b48-8835-5994de8f1ac2-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "10 empanadas", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, snack, appetizer, main course", "keywords": "black bean, cornmeal, cotija, kale, queso fresco, refried beans, spinach, swiss chard", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "recipeIngredient": ["1 pound medium- or fine-grind fresh corn masa for tortillas (or 1 1/2 cups masa harina, see Tip)", "1/3 cup chopped fresh chipilín or mature spinach, swiss chard or Tuscan kale", "1 teaspoon kosher salt (such as Diamond Crystal)", "1 1/4 cups refried black beans, preferably homemade", "2 ounces queso Cotija or queso fresco, crumbled, plus more for serving", "3 cups vegetable oil, for frying", "Crema and <a href=\"https://cooking.nytimes.com/recipes/1023522-pico-de-gallo\">pico de gallo</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, knead the masa, chipilín, salt and 2 tablespoons water with your hands until the ingredients are well incorporated and the mixture is soft and pliable but doesn’t stick to your hands, 3 to 5 minutes. If it’s still dry or crumbly or if it sticks to your hands, add another tablespoon or 2 of water and continue to mix. Cover the bowl with plastic wrap, and let the masa rest for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut and remove the zip-top from a 1-gallon freezer bag. Cut the sides of the bag, so that you have 2 square pieces of plastic. If you have a tortilla press, use it here and trim the sides of the bag to fit the flat surface of the press."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into 10 balls about (1 1/2 inch in diameter and about 50 grams apiece). Arrange on a sheet pan and keep covered with a damp kitchen towel while you press and fill the empanadas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a Dutch oven or other heavy deep pot with oil so that it comes up about ¾ inch up the sides. Heat on high until the oil reaches a temperature of 400 degrees. (You may need to adjust the heat to maintain the temperature as you fry the empanadas.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the tortilla press, if using, with the cut plastic (or use a smooth, flat-bottomed skillet), and working with a ball at a time, press each portion of masa into a 6 1/2-inch round and remove the top sheet of plastic. Arrange 2 tablespoons of beans (if using canned, use heaping tablespoons to use the whole can) in a line down the center of the masa, leaving about ½ inch of space between the edge of the masa and the filling. Top with a teaspoon of queso. Using the bottom piece of plastic to help you, fold the plastic in half so that the two sides of the masa close over the filling. Pinch the plastic just outside of where the edges of the masa come together to seal the empanada. Peel off the plastic and transfer empanada to a sheet pan. Repeat with remaining masa and filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a metal spatula, lower a single empanada into the hot oil. Spoon hot oil over the top for about 15 seconds, to seal the top side. Continue cooking until the empanada is golden brown and crispy, about 90 seconds per side. Transfer to a wire rack and repeat with the remaining empanadas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top warm empanadas with a drizzle of crema and a sprinkle of queso. Serve with pico de gallo alongside."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023501-empanadas-de-chipilin"}