{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggnog Sweet Potato Pie", "description": "Eggnog’s swirl of cream, eggs, nutmeg and dark liquor imbues this sweet potato pie with the warmth of the holidays, and a sugar-sparkled crust makes it extra joyful. Spiked with two shots of rum, the roasted sweet potato custard filling becomes more complex in its earthy natural sweetness and almost like mousse in its lightness. You can dress up this pie without any expertise in crimping dough, you simply roll and cut dough scraps, then coat them with sugar and stick them to the edge of the pie crust.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/11/13/dining/13PIESREX-sweet-potato/13PIESREX-sweet-potato-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "One 9-inch pie", "recipeCuisine": "", "recipeCategory": "pies and tarts, dessert", "keywords": "fall, winter, heavy cream, make-ahead, nutmeg, pie, pie dough, rum, sweet potato, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 237}, "recipeIngredient": ["1 pound/453 grams sweet potatoes (2 medium), scrubbed", "1 disk <a href=\"https://cooking.nytimes.com/recipes/1023573\">All-Butter Pie Crust</a>", "All-purpose flour, for rolling", "2 tablespoons sparkling or other coarse sugar", "1 cup/230 grams heavy cream", "1/2 cup/100 grams granulated sugar", "3 tablespoons rum or 3/4 teaspoon rum extract", "1 teaspoon pure vanilla extract", "1/2 teaspoon freshly grated nutmeg", "1/2 teaspoon fine sea or table salt", "3 large eggs, at room temperature, plus 1 egg, beaten, for the crust"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Pierce the sweet potatoes all over with a fork, then wrap each in foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast on a baking sheet until very tender, 1 to 1 1/2 hours. A fork should slide right through. Uncover and let cool for a bit. Lower the oven temperature to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the sweet potatoes are almost done, roll the dough. If the dough has been refrigerated for more than an hour, let sit at room temperature for 10 minutes first. Roll the disk on a lightly floured surface with a lightly floured rolling pin into a 13-inch round. It will be quite thin. Roll the dough onto the pin, then unroll it over a standard (not deep-dish) 9-inch pie plate, centering it. Gently tuck and press it into the bottom and sides of the plate without stretching the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a sharp paring knife, trim the dough flush with the edge of the rim. (Save the scraps.) Place the pie pan on a baking sheet. Use a fork to poke holes all over the bottom of the dough without piercing all the way through, if possible. Line the dough with a sheet of crumpled parchment paper. (Crumpling helps it lie flat against the dough.) Fill the lined dough to the top with pie weights, such as dried beans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the edges are golden and the sides look dry, 30 to 35 minutes. Remove the weights with the parchment and return the empty pie shell to the oven. Bake until the bottom is dry and pale golden, about 5 minutes. Let cool until ready to fill. Lower the oven temperature to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, gather the dough scraps together and roll them into 1/8-inch-thick rectangles on a lightly floured sheet of parchment paper. Sprinkle with the sparkling sugar and gently run the rolling pin over the sugar so that it sticks to the top of the dough but still sits on top of it. Slide onto a baking sheet and freeze until firm, about 15 minutes. Cut into 3/4-inch squares and return to the freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as the sweet potatoes are cool enough to handle, cut a slit along the length of each and scoop the flesh out into a large bowl. (You should have about 2 packed cups.) Smash and stir into a purée with a whisk. Add the cream, granulated sugar, rum, vanilla, nutmeg and salt, and whisk until smooth. Add 3 eggs and whisk just until fully incorporated. Pour into the still-warm parbaked pie shell and smooth the top. Brush the rim of the pie crust with the remaining beaten egg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the dough squares out of the freezer, and arrange them along the rim, gently pressing them down. Bake until mostly set but still a tiny bit jiggly in the center, 1 hour to 1 hour 10 minutes. If you have leftover dough squares, bake them on a parchment-lined baking sheet until golden brown, 10 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the pie and squares cool completely on a rack. Arrange any squares on top of the pie and serve at room temperature or refrigerate for up to 3 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023584-eggnog-sweet-potato-pie"}