{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Curry Glazed Tofu", "description": "To make crispy, flavorful tofu without having to press it first, use this smart method from Andrea Nguyen, the author of “Asian Tofu” (Ten Speed Press, 2012) and other cookbooks: Warm the tofu in a pan with a small amount of flavorful sauce. As it cooks, it will dry out and absorb the flavors of the sauce. Next, you add oil to the pan, which crisps the tofu. In Ms. Nguyen’s recipe, soy sauce is used, but here, the aromatics in Thai green curry paste and the sugars in coconut milk toast and caramelize on the tofu. Once the tofu has a deep-brown crust, remove it, sear a quick-cooking vegetable in the same pan, then reduce the remaining curry-coconut mixture into a fragrant, sweet-and-spicy glaze.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/06/02/dining/as-green-curry-glazed-tofu/merlin_207624033_0edca327-25ea-4f92-abf2-c4fd8890f6ac-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weeknight, curries, vegetables, main course", "keywords": "coconut milk, rice, tofu, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1946}, "recipeIngredient": ["1 (14- to 16-ounce) block extra-firm tofu", "Kosher salt (such as Diamond Crystal)", "1 (14-ounce) can full-fat, unsweetened coconut milk", "3 to 4 tablespoons Thai green curry paste", "1 tablespoon neutral or coconut oil, plus more as needed", "2 cups chopped vegetables, such as snap or snow peas, asparagus, broccoli, kale, fennel or corn kernels or a combination (see Tip)", "2 tablespoons lime juice (from 1 lime)", "Cooked rice or another grain, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tofu in half lengthwise, then slice crosswise into 6 sections. (You’ll have 12 squares total.) Transfer to a towel-lined plate and pat dry, then sprinkle with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the coconut milk to a liquid measuring cup or medium bowl, add the green curry paste, stir with a fork until smooth, then season to taste with salt. (Be aware that some curry pastes are quite salty.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the tofu in an even layer in a large (12-inch) nonstick or well-seasoned cast-iron skillet. Pour 2 tablespoons coconut-curry mixture over the tofu and flip the tofu to coat. Set the skillet over medium-high and cook tofu without flipping until the skillet is dry and the undersides of the tofu are speckled golden, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the oil, swirl to coat, then flip the tofu. Cook until browned and crisp, 3 to 5 minutes, then flip once more until the remaining side is browned and crisp, 1 to 2 minutes, adding more oil as needed. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the skillet is dry, add more oil, over medium-high, then add the vegetables, season with salt and cook, without stirring, until charred underneath, 2 to 3 minutes. Pour in the remaining coconut-curry mixture and boil, stirring occasionally, until the vegetables are crisp-tender and the liquid has thickened to a glaze, 4 to 5 minutes. (The sauce is ready when a spoon dragged across the bottom of the skillet leaves a trail.) Turn off the heat, stir in the lime juice, then add the tofu and gently stir to coat. Season to taste with salt. Eat on top of rice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023248-green-curry-glazed-tofu"}