{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Fudge", "description": "Fudge can be fickle, easily becoming grainy and hard if it’s beaten too much or if the sugar mixture crystallizes, the result of undissolved sugar crystals. Try to make fudge in a cool environment that is not humid, and, if the final texture isn’t quite what you desire, know that cooking the fudge at a temperature that’s a few degrees lower the next time will result in a softer fudge, while a few degrees higher will make it firmer. Fudge also dries out easily, so make sure it’s well wrapped.", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2022/12/12/multimedia/12candyrex1-fudge/12candy2-1-d910-mediumThreeByTwo440.jpg", "totalTime": "PT4H15M", "recipeYield": "36 pieces", "recipeCuisine": "", "recipeCategory": "candies, dessert", "keywords": "christmas, hanukkah, cocoa powder, corn syrup, honey, make-ahead, pecan, plan-ahead, unsweetened chocolate, walnut", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 326}, "recipeIngredient": ["2 cups/227 grams walnut or pecan halves or pieces", "Vegetable oil spray", "4 ounces/113 grams unsweetened chocolate (100 percent cacao), chopped", "3 tablespoons/42 grams unsalted butter, cut into pieces", "1 1/2 teaspoons kosher salt (such as Diamond Crystal)", "2 teaspoons vanilla extract", "2 cups/400 grams granulated sugar", "1/4 cup/21 grams unsweetened cocoa powder", "1 cup/240 grams whole milk", "1/4 cup/85 grams light corn syrup", "2 tablespoons/42 grams honey"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the nuts: Heat the oven to 350 degrees. Scatter the walnuts or pecans on a rimmed baking sheet and toast, tossing once, until they’re golden brown and fragrant, 8 to 10 minutes. Let the nuts cool on the baking sheet. Coarsely chop, then set the nuts aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pan: Lightly spray the inside of an 8-inch square pan with vegetable oil spray. Line the bottom and sides with parchment paper, smoothing to eliminate air bubbles, then lightly spray the parchment paper. Set the pan aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the chocolate mixture: Fill a large, heavy saucepan with about an inch of water and bring to a simmer. In a large heatproof bowl (big enough to sit atop the saucepan and not touch the water), combine the chocolate, butter and salt, and set the bowl over the saucepan. Stir the mixture with a flexible spatula until completely melted and smooth, then carefully remove the bowl from the heat. Stir in the vanilla extract, then set the bowl aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the sugar mixture: Empty and dry the saucepan, and have at the ready a clean pastry brush, a spoon, a small bowl filled with very cold water and a separate large bowl. Add the sugar and cocoa powder to the saucepan, and whisk to combine and eliminate any lumps, then add the milk, corn syrup and honey. Set the saucepan over medium heat and stir the sugar mixture gently with a heatproof spatula until the sugar is mostly dissolved and it starts to bubble at the sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before the mixture comes to a rolling boil, dip the pastry brush in water and use the wet bristles to brush down the sides of the saucepan and dissolve any stuck-on sugar crystals. Let the mixture come to a boil, then clip a candy thermometer to the side of the saucepan. Boil the mixture without stirring, occasionally swirling the saucepan gently and brushing down the sides of the saucepan with the wet pastry brush if you see crystals forming as it reduces. (This is to prevent crystallization, which would produce a crumbly, grainy fudge.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Test the mixture for “soft ball”: When the mixture reaches 235 degrees, reduce the heat to low and continue to cook. When it reaches 238 degrees, spoon about 1/2 teaspoon of the mixture into the bowl of cold water and let it cool for a few seconds, then fish it out and work it into a ball between your fingertips (the mixture can still be cooking meanwhile). If it forms a ball that holds its shape but flattens easily between your fingertips, the mixture is ready. If it is too soft to hold its shape, continue to cook over low until it reaches 240 degrees and repeat the soft ball test. Once you reach the soft ball stage, remove the saucepan from the heat and pour the mixture into the separate large bowl but do not scrape the bottom or sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the mixture cool and beat the fudge: Scrape the reserved chocolate mixture into the bowl with the sugar mixture but do not stir. Thoroughly rinse and dry the candy thermometer, then clip it to the side of the bowl. Let the mixture cool until it registers 115 degrees, 30 to 40 minutes. Remove the thermometer, then beat the mixture with a hand mixer on medium-low speed until it loses its shine and becomes creamy, 8 to 10 minutes. Stop the mixer, add the nuts and fold quickly with a flexible spatula until the nuts are distributed evenly. Working quickly, scrape the fudge into the prepared pan and smooth the surface, working it into an even layer all the way to the sides and corners. Let the fudge sit at room temperature until it’s firm, at least 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the fudge: Use the parchment paper to lift the slab of fudge out of the pan and transfer to a cutting board. Use a chef’s knife to cut the slab in half in both directions to make 4 equal squares, then cut each square into a 3-by-3 grid for a total of 36 squares."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Chocolate Fudge", "description": "Fudge can be fickle, easily becoming grainy and hard if it’s beaten too much or if the sugar mixture crystallizes, the result of undissolved sugar crystals. Try to make fudge in a cool environment that is not humid, and, if the final texture isn’t quite what you desire, know that cooking the fudge at a temperature that’s a few degrees lower the next time will result in a softer fudge, while a few degrees higher will make it firmer. Fudge also dries out easily, so make sure it’s well wrapped.", "thumbnailUrl": "https://static01.nyt.com/images/2022/12/12/multimedia/12candyrex1-fudge/12candy2-1-d910-mediumThreeByTwo440.jpg", "uploadDate": "2023-01-24T17:18:41.000Z", "duration": "PT15M54S", "transcript": "", "contentUrl": "https://vp.nyt.com/video/2023/01/10/105438_1_CS-chocolate-fudge-CV_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023718-chocolate-fudge"}