{"@context": "http://schema.org", "@type": "Recipe", "name": "Loaded Vegan Nachos", "description": "This recipe certainly has more steps than the <a href=\"https://cooking.nytimes.com/recipes/1021572-the-original-nachos\">original nachos</a>, but you’ll be rewarded with a festive tray that’s hearty and vegetable-packed enough for dinner. <a href=\"https://cooking.nytimes.com/recipes/1020844-queso\">Queso</a> is a great choice for nachos because, unlike melted grated cheese, it stays creamy and doesn’t congeal. This homemade, vegan take owes its bold flavor to nutritional yeast, chipotle, garlic powder and pickled jalapeños, and its glossy and smooth texture to the magical combination of starchy bean liquid and blended cauliflower. The key to great nachos is to make sure that each element is delicious on its own, so here, roasted cauliflower gets seasoned with cilantro and lime, and pinto beans with spicy adobo sauce.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/07/12/dining/as-loaded-vegan-nachos/as-loaded-vegan-nachos-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "snack, appetizer, main course", "keywords": "cauliflower, chipotles in adobo, nacho, nutritional yeast, pickled jalapeño peppers, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 160}, "recipeIngredient": ["2 pounds cauliflower (about 1 medium head), florets and stem coarsely chopped", "1 medium white or red onion, finely chopped", "2 tablespoons neutral oil (such as canola or grapeseed)", "Kosher salt (such as Diamond Crystal)", "1/2 cup nutritional yeast", "1 (15-ounce) can pinto beans, drained, bean liquid reserved", "1/2 to 1 chipotle chile in adobo (depending on heat preference), plus 2 teaspoons sauce", "1 1/2 teaspoons garlic powder", "1/2 cup sliced pickled jalapeños, plus brine", "1 (12-ounce) bag of sturdy tortilla chips", "1 lime", "1/4 cup finely chopped cilantro leaves and stems, plus small sprigs for topping", "Optional toppings: <a href=\"https://cooking.nytimes.com/recipes/6297-pico-de-gallo\">pico de gallo</a> or chopped tomato, avocado or guacamole, vegan crema, sliced radishes, black olives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. On a sheet pan, toss together half the cauliflower, half the onion and the oil. Season with salt, then spread into an even layer. Roast on the bottom rack, without stirring, until brown underneath, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the vegan queso: In a medium saucepan, combine 1 ½ cups water with the remaining cauliflower, the nutritional yeast, bean liquid, chipotle chile, garlic powder and 1 teaspoon salt. Bring to a boil over high heat, then reduce to medium-high and simmer, stirring occasionally, until the cauliflower is very tender, 10 to 15 minutes. Transfer to a blender, and blend until smooth, then add 2 teaspoons of pickled jalapeño brine and blend to combine. Taste the queso on a chip; if flavors are muted, add more salt and brine. (Hold onto the saucepan; no need to clean.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, add the adobo sauce to the beans and mash some of the beans with a fork. (This helps the beans adhere to the chip.) When the roasted cauliflower is done, zest the lime over, add the chopped cilantro and stir to combine. Scrape into the reserved saucepan. (Hold onto the sheet pan and don’t worry about getting every last bit off.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble: On the sheet pan, spread half the chips into an even layer. Top with half the beans, half the cauliflower and half the queso. Repeat another layer with the remaining chips, queso, beans and cauliflower. Bake until the chips and beans are warm, 3 to 5 minutes. Cut the lime into wedges. Top nachos with the pickled jalapeños, remaining chopped onion, cilantro sprigs, a squeeze of lime and any optional toppings."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023316-loaded-vegan-nachos"}