{"@context": "http://schema.org", "@type": "Recipe", "name": "Miso-Butter Mushrooms With Silky Eggs", "description": "This dish brings all-day breakfast vibes. The earthy, robust flavors of mushrooms are intensified with an unapologetically savory miso butter. (Tip: Make extra and store in the fridge to season roasted veggies or noodles.) Leaving the mushrooms whole saves preparation time and also ensures that they remain plump and juicy inside. The silky eggs are made like Australian cafe-style scrambled eggs, where they are barely cooked, for only seconds, resulting in a custardy finish. If you are looking for some greenery, stir spinach leaves through the hot mushrooms and let the residual heat wilt them.", "author": {"@type": "Person", "name": "Hetty McKinnon"}, "image": "https://static01.nyt.com/images/2023/01/09/multimedia/hm-miso-butter-mushrooms-lqcz/hm-miso-butter-mushrooms-lqcz-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, dinner, easy, lunch, quick, weeknight, main course", "keywords": "egg, egg dish, garlic, miso, mushroom, sesame seeds, unsalted butter, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 154}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "24 ounces small cremini or button mushrooms, brushed clean and trimmed ", "2 tablespoons white miso paste", "2 tablespoons unsalted butter, softened at room temperature for 10 minutes", "2 garlic cloves, grated ", "1 tablespoon toasted white sesame seeds (optional)", "6 large eggs ", "Kosher salt and black pepper", "1 tablespoon unsalted butter", "4 to 8 slices of bread, toasted, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the mushrooms: Heat a large (12-inch) nonstick skillet over medium high. Add the olive oil, then throw in all the mushrooms and cook for 10 to 12 minutes, stirring or shaking the pan every few minutes, until the mushrooms are golden."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the mushrooms are cooking, place the miso paste, butter and garlic into a small bowl and, using the back of a fork, mash everything together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the mushrooms are ready, add the miso butter and toss for about 2 minutes, allowing the butter to melt and the miso to coat all of the mushrooms and become slightly sticky. Add the sesame seeds and toss to distribute evenly. Remove from heat and transfer the mushrooms to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse out the skillet with water and dry it. Place it over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the eggs: Break the eggs into a medium bowl and season with 1 teaspoon of salt and a few turns of black pepper. Whisk well until the whites and yolk are completely combined. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the eggs in two batches: To the hot pan, add half of the butter and allow it to melt, swirling it around the pan. Pour in roughly half the eggs and cook undisturbed for 10 to 15 seconds to allow the bottom to set then, using a flexible spatula, push the eggs around the perimeter of the pan in a circular motion, allowing the runnier parts of the egg to cook. Continue to push the eggs in a circular motion for 5 to 10 seconds, just until the center is slightly wet looking and the egg looks rippled. The whole process only takes about 20 to 30 seconds. Remove from the pan and continue with the remaining egg. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the eggs with a mound of miso butter mushrooms, with toast on the side, if you like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023815-miso-butter-mushrooms-with-silky-eggs"}