{"@context": "http://schema.org", "@type": "Recipe", "name": "Date Bars", "description": "Native to North Africa and the Middle East, dates were planted in the Coachella Valley in the late 1890s and are now a California crop, with the state growing 90 percent of America’s dates, particularly the medjool variety. “The intense sweetness of dates makes them a great substitute for honey or sugar,” writes Tanya Holland, the chef and author of “Tanya Holland’s California Soul: Recipes From a Culinary Journey West” (Ten Speed Press, 2022). Her date bars from this cookbook feature a gorgeous strip of the beautiful fruit and make a great caky snack to serve alongside coffee or tea.", "author": {"@type": "Person", "name": "Korsha Wilson"}, "image": "https://static01.nyt.com/images/2022/11/30/dining/30hollandrex1-date-bars/merlin_216459150_e21660d9-0f98-45d2-91bd-3dd9f592914f-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "24 bars", "recipeCuisine": "", "recipeCategory": "snack, dessert", "keywords": "bar cookie, date, honey, make-ahead, soul food", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 58}, "recipeIngredient": ["1 1/2 cups medjool dates (about 12 ounces), pitted", "1 teaspoon vanilla paste or extract", "2 teaspoons salt", "Nonstick cooking spray", "2 1/2 cups/320 grams all-purpose flour", "1 teaspoon baking powder", "1 teaspoon ground cinnamon", "1 cup/227 grams unsalted butter, at room temperature", "1/2 cup/146 grams firmly packed dark brown sugar", "1/4 cup/90 grams honey", "2 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine the dates with 1 cup water and bring to a simmer over medium-high heat. Turn off the heat and let sit for 15 minutes. Strain the water from the dates, reserving the liquid. Add the dates to a food processor with the vanilla paste, 1 teaspoon of the salt and 1/4 cup of the reserved date water. Process until smooth and the texture of a thick jam, adding 1 tablespoon of additional date water at a time if the mixture is too thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 9-by-13-inch baking pan with parchment paper so the paper hangs over the long sides of the pan. (This will make it easy to lift the bars out of the pan once they’re baked.) Spray the parchment with the cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the flour, baking powder, cinnamon and the remaining 1 teaspoon salt. Using a stand mixer fitted with a paddle attachment, add the butter, brown sugar and honey and mix on medium speed until well combined, about 2 minutes, scraping down the sides of the mixer with a spatula as needed. Add the eggs, 1 at a time, mixing until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the mixer and add the flour mixture. Mix on low speed until the flour is fully incorporated, scraping down the sides with a spatula as needed. The dough will be soft. Place half of the dough in the prepared pan and spread evenly with an offset spatula. Carefully spread the date mixture evenly over the top of the dough in the pan. Place the pan in the freezer for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees and remove the pan from the freezer. Take the remaining half of the dough, place dollops of it over the top of the date mixture in the pan, and carefully spread it evenly over the date layer. Bake until the top is golden brown, 30 to 40 minutes. Let cool for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the parchment paper, lift the bars out of the pan and place on a wire rack to cool. Cut into 24 squares. Date bars will keep, covered, at room temperature, for up to 3 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023688-date-bars"}