{"@context": "http://schema.org", "@type": "Recipe", "name": "Cioppino", "description": "The cioppino at Anchor Oyster Bar in San Francisco is a showstopper — a beautiful, long-simmered tomato sauce thinned with clam juice and packed with a mix of excellent seafood. Work with whatever seafood is best where you are, though Dungeness crab in the shell is nonnegotiable for the Anchor’s owner and chef, Roseann Grimm, the granddaughter of an Italian crab fisherman. Replicating her dish at home involves a lot of work, but the results are beyond delicious. To get ahead, you can make the marinara base and roasted garlic butter up to a couple days before. A half hour or so before you’re ready to sit down and eat, bake the garlic bread and cook the seafood. Don’t forget crab crackers — you’ll need them at the table to get to the crab meat — and plenty of napkins!", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2022/05/04/dining/03cioppinorex/merlin_205954344_dbaede77-c751-4ae4-886c-e3007feaf113-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "seafood, soups and stews, main course", "keywords": "baguette, bloody mary mix, dungeness crab, garlic, littleneck clam, mussels, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 605}, "recipeIngredient": ["1/4 cup whole star anise", "1 small yellow onion, diced", "1 large garlic head, cloves separated and peeled", "1/2 small red bell pepper, coarsely chopped", "1/4 cup olive oil", "1/2 cup Bloody Mary mix", "1 (29-ounce) can diced tomatoes", "1 (29-ounce) can tomato sauce", "3 tablespoons dried oregano", "1 tablespoon dried basil", "1 tablespoon dried thyme", "2 teaspoons granulated sugar", "1 dried bay leaf", "4 whole garlic heads (about 11 ounces)", "2 tablespoons olive oil", "1 cup/8 ounces salted butter, softened", "1 baguette or ciabatta loaf, split horizontally", "Kosher salt and freshly ground pepper", "Dried oregano, for sprinkling", "3/4 cup finely grated Parmesan", "2 cups clam juice", "6 fresh thyme sprigs", "1 teaspoon red-pepper flakes", "Kosher salt and freshly ground black pepper", "1 1/2 pounds Dungeness crab clusters (5 legs and 2 claws with bodies attached)", "12 littleneck clams (about 1 pound), <a href=\"https://www.nytimes.com/video/dining/100000003070339/cooking-techniques-cleaning-mussels.html\">cleaned</a>", "12 mussels (about 1/2 pound), cleaned", "2 cod fillets (about 4 ounces each)", "4 large peeled, tail-on shrimp (about 1/3 pound)", "Finely chopped flat-leaf parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the star anise by stirring frequently in a small skillet over medium heat until fragrant, about 3 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the marinara base: Add the onion, garlic cloves, bell pepper and olive oil to a food processor and pulse until finely chopped. (Or, finely chop the vegetables by hand, then add to the pot along with the oil.) Add the mixture to a large pot and cook over medium, stirring occasionally, until soft, translucent and light golden in places, about 5 minutes. Add the Bloody Mary mix, canned tomatoes and juices and tomato sauce. Get every last drop from the cans by swirling a splash of water into each one and tipping the remnants into the pot. Add the toasted star anise, oregano, basil, thyme, sugar and bay leaf, and stir to combine. Bring to a boil over medium-high, then reduce the heat to medium-low and simmer gently, uncovered, for 1 hour, stirring often so the bottom of the pot doesn’t burn. (Makes 7 1/2 cups; see Tip.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While sauce simmers, roast the garlic: Heat oven to 375 degrees. Slice the whole garlic heads in half crosswise. Divide garlic, cut-sides up, between two pieces of aluminum foil, large enough to wrap the garlic up like two presents. Drizzle with olive oil, then wrap tightly. Set the foil packets on a baking sheet and roast for 1 hour, until the garlic is light brown and tender all the way through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the garlic butter: Once cool enough to handle, squeeze the garlic cloves out, discarding the skins. (You should have about 1 cup of roasted garlic.) Add to a food processor along with the softened butter and pulse until smooth and creamy. Or, smash the garlic to a paste and mix with the softened butter. (Makes 1 1/2 cups; see Tip.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the garlic bread: Heat oven to 400 degrees. Spread 1/2 cup garlic butter on the cut sides of bread and season with salt and pepper. Set the bread, buttered-sides up on a foil-lined baking sheet and bake until toasted and golden in spots, about 15 minutes. As soon as the garlic bread comes out of the oven, sprinkle it with dried oregano and the Parmesan. Cut into large pieces, then wrap the foil from the baking sheet around them to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the bread bakes, make the cioppino: In a large Dutch oven or wide, heavy pot, add 4 cups of the marinara sauce, plus the clam juice, thyme sprigs and red-pepper flakes. Season generously with salt and pepper and heat over medium-high until simmering, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Separate the legs and claws from the crab bodies. Once the sauce is simmering, gradually add the seafood, starting with the crab bodies. Cook for a couple minutes, then add the crab legs and claws to the pot and cook, stirring occasionally, for about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the clams, nestling them into the sauce around the edges, like numbers on a clock, cover with a lid and cook for about 6 minutes. Give the mixture a stir then add the mussels, in the same fashion as the clams. Cover and cook for another 3 minutes. Once the clams start to open, add the fish, gently nestling it into the sauce, and set the shrimp right on top to let them steam gently. Add 2 tablespoons of the garlic butter, put the lid back on and simmer until the fish cooks through and the shrimp get plump, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, transfer the cioppino to a deep serving bowl, being careful not to break up the delicate cooked fish. Perch the crab legs and claws on top and sprinkle with parsley. Serve with warm garlic bread on the side."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023148-cioppino"}