{"@context": "http://schema.org", "@type": "Recipe", "name": "Za’atar Roasted Tofu With Chickpeas, Tomatoes and Lemony Tahini", "description": "Tofu and chickpeas form the hearty base for vibrant, woodsy za’atar, the popular Middle Eastern spice blend. The tomatoes, when roasted, become acidic, little bursts in the salad, a great complement to the earthiness of the other ingredients. The roasted vegetables, chickpeas and tofu and the tahini dressing will keep for days once refrigerated. Assemble your bowl to order, and enjoy it for lunch or as a light dinner. ", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2022/11/11/dining/yk-zaatar-tofu/merlin_215246028_7b1d42a0-e2d9-4338-ae26-7a7e365b85f3-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, beans, main course", "keywords": "cherry tomatoes, chickpea, firm tofu, leafy greens, sheet-pan, soy sauce, tahini, za’atar, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 905}, "recipeIngredient": ["1 (14-ounce) package firm tofu, drained and patted dry", "1 (15 1/2-ounce) can chickpeas, drained, rinsed and patted dry", "1 pint cherry or grape tomatoes", "Salt and pepper", "3 garlic cloves", "2 lemons", "1/2 cup extra-virgin olive oil", "1 1/2 tablespoons za’atar dry spice mix (see Tip)", "1 teaspoon dried oregano or marjoram", "1/2 cup chopped flat-leaf parsley", "2 tablespoons soy sauce", "1/4 cup tahini", "1 tablespoon honey", "1 (8-ounce) bag leafy greens, such as baby spinach, baby kale or mixed greens"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Cut the tofu into 1/2-inch-thick slices and place them on a kitchen or paper towel to dry out. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the chickpeas and tomatoes on a half-sheet pan and sprinkle with salt and black pepper to season.   "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a Microplane or other fine grater, grate the garlic cloves and zest 1 lemon into a large bowl. Squeeze 1/4 cup juice from the lemon (using the second lemon if needed) and reserve. Add the oil, za’atar, oregano and ¼ cup chopped parsley to the garlic mixture and stir to combine. Pour half of the marinade over the chickpeas and tomatoes, toss to combine and spread in an even layer. Roast until the tomatoes are just beginning to burst open and the chickpeas are warmed through, about 15 minutes.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add the soy sauce to the remaining marinade and stir. Add the tofu slices to the bowl and carefully turn each piece to coat both sides. Allow the tofu to marinate while the chickpea mixture cooks, then nestle the tofu slices, topped with any leftover marinade in the bowl, among the chickpeas and tomatoes on the sheet pan. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until the tofu begins to brown around the edges and top, the tomatoes have burst open releasing their juices and the chickpeas are golden brown and crunchy, about 15 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the tofu roasts, whisk together the tahini, honey, reserved lemon juice and 2 tablespoons of water. Season to taste with salt and black pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the leafy greens among 4 bowls. Dress the tofu, chickpeas and tomatoes on the baking sheet with 4 tablespoons of the tahini mixture and sprinkle with the remaining ¼ cup parsley. Divide evenly among the bowls and spoon additional dressing all over everything."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023630-zaatar-roasted-tofu-with-chickpeas-tomatoes-and-lemony-tahini"}