{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Grilled Cheese", "description": "Ever dream of serving warm grilled cheese sandwiches to a crowd without feeling like a short-order line cook or getting stuck with a slightly soggy sandwich? A sheet pan can help: It allows you to cook four sandwiches at once, with less attention than they require on the stovetop, and provides the opportunity to add cheese to the outsides for a crisp, chip-like contrast to the gooey filling. This oven technique is amenable to different kinds of breads and cheeses, and can take additions for melts. Grilled cheese just got even more convenient.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/11/09/dining/as-sheet-pan-grilled-cheese/merlin_215057859_5f62eff6-48b7-40c4-b4ee-db28f5ba4d46-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weeknight, sandwiches, main course", "keywords": "butter, cheese, gruyère, parmesan, sharp cheddar cheese, sheet-pan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 477}, "recipeIngredient": ["1/4 cup unsalted or salted butter, for greasing", "8 slices sandwich bread, no more than 1/2-inch thick", "1 to 1 1/2 cups (4 to 6 ounces) grated or 4 to 8 slices melting cheese, such as sharp Cheddar, American or pepper Jack, depending on size of bread", "1/2 cup (about 2 ounces) grated hard cheese, such as Parmesan, Asiago or Gruyère (or more sharp Cheddar)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a rack in the bottom third of the oven and heat the oven to 400 degrees. Line a large sheet pan with parchment paper. In the warming oven or a microwave, soften the butter. Spread butter edge to edge on 4 slices of the bread. (You may not need all the butter, depending on the size of your bread.) Place the 4 slices butter-side down on half the prepared sheet pan. Top with the melting cheese, then top with the remaining 4 slices of bread. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place on the bottom rack and cook until the bottoms are light golden and the cheese is melted, 7 to 9 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from the oven and sprinkle a thin layer of the hard cheese on the empty side of the pan. Spread out the cheese to create holes and lacy edges, like snowflakes, for more crisping. Use a spatula to flip the sandwiches onto the cheese so the tops of the sandwiches adhere to it. Return to the bottom rack and cook until the exterior cheese is light golden and crisp, 5 to 7 minutes. Let cool slightly before eating."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023552-sheet-pan-grilled-cheese"}