{"@context": "http://schema.org", "@type": "Recipe", "name": "El Cholo’s Sonora-Style Enchiladas", "description": "These chicken-filled, Sonora-style enchiladas have been offered at <a href=\"https://www.elcholo.com/\">El Cholo</a> in Los Angeles since it began as the Sonora Café in 1923. They are based on the recipe of Rosa Borquez, who started the restaurant with her husband, Alejandro. Both were born in the Mexican state of Sonora. This dish, with stacked tortillas rather than rolled, is known in Sonora as “enchiladas chatas,” flat enchiladas. Adapted from “<a href=\"https://www.elcholo.com/store.html\">A Taste of History: With Authentic El Cholo Recipes</a>” by Ron Salisbury (2020), this recipe includes a chicken stew base with tomatoes, poblano and white pepper, plus a classic <a href=\"https://cooking.nytimes.com/recipes/1023768-red-enchilada-sauce\">red enchilada sauce</a> with smoky dried chiles and a <a href=\"https://cooking.nytimes.com/recipes/1023769-green-enchilada-sauce\">green enchilada sauce</a> with verdant notes from tomatillos, fresh chiles and spinach. A fried egg crowns the top.", "author": {"@type": "Person", "name": "Kevin McKenna, Alexa Weibel"}, "image": "https://static01.nyt.com/images/2022/01/03/multimedia/03el-cholo-rex1-1-ab3d/03el-cholo-rex1-1-ab3d-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, main course", "keywords": "black bean, chicken, corn tortilla, egg, enchilada, monterey jack cheese, poblano", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 442}, "recipeIngredient": ["1 poblano chile, halved, seeded and finely chopped", "1 tomato, chopped", "1 tablespoon salt", "1 teaspoon dried Mexican oregano", "1 teaspoon ground white pepper", "1 garlic clove, chopped", "2 (packed) cups shredded cooked chicken (about 10 ounces)", "Minced fresh cilantro, to taste", "3 1/2 cups <a href=\"https://cooking.nytimes.com/recipes/1023768-red-enchilada-sauce\">Red Enchilada Sauce</a>, warmed", "3 cups <a href=\"https://cooking.nytimes.com/recipes/1023769-green-enchilada-sauce\">Green Enchilada Sauce</a>, warmed", "Vegetable oil, as needed", "18 corn tortillas", "2 cups canned black beans", "10 ounces Monterey Jack cheese, shredded (about 4 cups)", "1/2 medium red onion, finely chopped (about 1/2 cup)", "6 large eggs", "1/2 cup sour cream, thinned with water until easy to drizzle", "Sliced black olives, minced red bell pepper and sliced scallions, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chicken filling: In a medium saucepan, combine poblano, tomato, salt, oregano, white pepper and garlic with 3 1/2 cups water. Bring to a boil over high, then cook over medium heat for 30 minutes. Add chicken, cook for an additional 10 minutes, then stir in cilantro. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the filling cooks, prepare the red enchilada sauce and green enchilada sauce. (You also can prepare both sauces first and keep them warm over low heat.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to assemble the enchiladas, heat the broiler and set an oven rack a few inches away from it. (It is tricky to assemble all six servings of enchiladas at once, but they can be assembled in batches or cooked off one or two at a time. The components all store well refrigerated for a few days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a medium skillet over medium. Add a layer of vegetable oil that is about the thickness of a corn tortilla and heat over medium-high. Using tongs, dip tortillas in hot oil, quickly cooking on both sides just until warmed without allowing tortillas to become crisp, about 20 seconds per side. Transfer warmed tortillas to a plate and continue until all are fried, adding oil as needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stack one serving of enchiladas at a time: Dip 1 tortilla in red sauce until fully coated and place on an ovenproof rimmed plate, bowl or baking dish that is slightly wider than the tortilla. Top with 1/3 cup of black beans and a sprinkling of the cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip a second tortilla into the red sauce, then place it on top. Top the second tortilla with 1/2 cup of chicken filling, spreading it in an even layer. Dip a third tortilla into the green sauce until fully coated, then set it on top of the chicken filling. Liberally top half of the top tortilla with red sauce and the other half with green sauce; sprinkle generously with cheese and red onion. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble remaining tortilla stacks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the enchiladas under the broiler, working in batches, until cheese is well melted, 1 to 2 minutes. While cheese is melting, fry eggs in a skillet, in batches as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top each serving with a fried egg; season the egg with salt. Drizzle each serving liberally with the loosened sour cream. Top with garnishes, as desired, and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023767-el-cholos-sonora-style-enchiladas"}