{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Galette", "description": "A strawberry galette served with a side of fresh whipped cream or ice cream is a spring salve that is just as soothing to prepare for oneself as it is to share with others. Inspired by the baker Alice Medrich’s yogurt-butter pie dough, the dough in this recipe includes almond flour for a flaky, subtly nutty crust that comes together without much fuss. This dough is very forgiving and works well with the rustic charm of a galette. It’s OK if the edges of the crust crack and some juices leak. Even out-of-season strawberries would work, as there’s just enough sugar here to coax them back to life. Make sure you give the galette enough time to rest before slicing into it, so that the juices have time to set.", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2022/05/20/dining/nd-strawberry-galette/merlin_206514768_d6616c67-27f9-44ef-afd0-c1506bf54c20-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts, dessert", "keywords": "almond flour, strawberries, yogurt, fourth of july, labor day, memorial day, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 506}, "recipeIngredient": ["1 cup/120 grams all-purpose flour, plus more for dusting", "1/2 cup/50 grams almond flour (from blanched, skinless almonds, not almond meal)", "8 tablespoons/113 grams very cold unsalted butter", "1/4 cup/60 grams cold plain whole yogurt (not Greek)", "1 tablespoon ice-cold water, plus up to 3 tablespoons more, if needed", "1 teaspoon granulated sugar, plus more for sprinkling", "1/2 teaspoon kosher salt (such as Diamond Crystal)", "1 egg beaten with 1 teaspoon yogurt or water (for the egg wash)", "1/2 to 3/4 cup/100 grams to 150 grams granulated sugar", "1/2 teaspoon finely grated lemon zest", "1 1/2 pounds stemmed strawberries (about 5 cups), sliced", "3 tablespoons cornstarch", "Small pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the all-purpose flour and the almond flour in a large bowl, then set aside. (It’s best to stick it in the freezer for about 15 minutes until ready to use, to ensure a well-chilled dough.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice 3 tablespoons of the butter as thinly as possible without getting obsessive about it. (It’s OK if pieces break.) Cut the remaining 5 tablespoons of butter into 1/2-inch cubes. Keeping the sliced butter and cubed butter separate, set the butter in the fridge to chill until ready to use. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or measuring cup, mix the 1/4 cup yogurt with 1 tablespoon of the water and keep cold in the fridge until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the flour mixture with the 1 teaspoon sugar and the salt. Spread the cubed butter pieces over the flour and cut the butter into the flour using a pastry blender or your fingers until the chunks look slightly smaller than pea size. Toss the butter slices with the flour mixture, separating them as you go, then gently press them into the flour between your fingers into flat sheets. (This extra step is helpful in creating pockets of steam, which will make for a flakier crust, an added bonus for pie dough makers of any skill!)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle the chilled yogurt over the flour and butter mixture. Use a spatula or a wooden spoon to toss and combine. If the dough seems dry, drizzle with 1 tablespoon of the ice water, and continue tossing and combining, incorporating any dry flour bits at the bottom of the bowl and scraping off the spatula as you go, until the mixture just comes together in a mound. If needed, drizzle more ice water, 1 tablespoon at a time, without allowing the dough to get too wet. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dough to a large piece of plastic wrap, then press the dough into a 6-inch disk and wrap well. Refrigerate for at least 2 hours or up to 3 days. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees with the rack in the center position. Line a sheet pan with parchment paper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: Place 1/2 cup sugar and the lemon zest in a large bowl and rub the lemon zest into the sugar with your fingertips. Add the strawberries, cornstarch and salt; mix well to combine, making sure the cornstarch is well incorporated. Add up to another 1/4 cup sugar if desired, depending on the sweetness of your strawberries and your desired level of sweetness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust your countertop with flour, then transfer the chilled dough to it and sprinkle a little flour on top of the dough. Roll the dough out to a 12- to 14-inch round, lightly flouring as needed. (It’s OK if the edges break and the shape isn’t perfectly round.) Gently transfer the dough by rolling it over a rolling pin and onto the prepared baking sheet. (At this point, if you’ve forgotten something, like preparing the egg wash, or if your dough has warmed up slightly, place the sheet pan in the fridge for a few minutes.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mound the strawberries and their juices in the middle of the dough and leave a 2-inch border. Fold the border over the fruit, pleating as you fold and leaving the center of the galette exposed. Brush the crust with the egg wash and sprinkle with sugar. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the crust is golden and the strawberries are bubbling, about 35 minutes. It’s OK if some juices leak. Cool on a wire rack for 1 hour and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023208-strawberry-galette"}