{"@context": "http://schema.org", "@type": "Recipe", "name": "Crab Cakes", "description": "Mace, nutmeg’s peppery sister, is what makes the difference in these crab cakes. The recipe, adapted from “Gullah Geechee Home Cooking: Recipes From the Matriarch of Edisto Island,” comes from Emily Meggett, one of the most well-respected cooks in the Gullah Geechee community, whose food traditions are built largely on the crabs, shrimp and fish they pull from the water near their homes along the southeastern shoreline. She has made thousands of these using freshly cooked blue crabs, but meat that has already been picked and processed works as well. Be sparing with the bread crumbs, which should just hold the mixture together, then add more if the cakes are falling apart. Make sure the pan is very hot, then reduce the heat the minute they hit the oil. Keep a close eye while they brown. These are lovely bites to start a meal, or can star as supper, alongside rice and fresh vegetables. Ms. Meggett serves them with what she calls pink sauce, which is similar to this <a href=\"https://cooking.nytimes.com/recipes/1022373-fry-sauce\">sauce</a>, with the addition of grated onion and lemon.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2022/05/11/dining/09gullah-cookbookrex1/merlin_206402364_7f0f43bc-1264-491f-91c6-e71b37d7731a-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "About 12 large crab cakes", "recipeCuisine": "", "recipeCategory": "dinner, seafood, appetizer, main course", "keywords": "crab meat, mace, self-rising flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 674}, "recipeIngredient": ["10 slices soft white or whole-wheat bread", "1/2 cup/115 grams unsalted butter", "1 large onion, grated", "1/4 cup/30 grams self-rising flour (see Tip)", "1 1/2 cups/355 milliliters whole or 2-percent milk", "2 large eggs, beaten", "1 teaspoon fresh lemon juice", "1 teaspoon distilled white vinegar", "1/4 teaspoon ground mace", "2 pounds/907 grams lump crab meat, drained if needed", "1/2 cup/120 milliliters vegetable oil, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler to 500 degrees (or its highest setting). On your oven’s highest rack, broil all the bread slices on a baking sheet for 2 to 3 minutes, or until golden and crisp but not burned. Flip all the slices over and broil for another 2 to 3 minutes. Turn the broiler off and allow the bread to crisp in the oven until totally dry, 15 to 20 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bread from the oven and let cool. Using a box grater or rolling pin, coarsely grate and crush the bread slices into bread crumbs (or, pulse them in a food processor). The crumbs should look and feel like sand; you should get about 4 cups. Set the bread crumbs aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large cast-iron skillet, melt the butter over high heat. Once the butter is melted, add the onion and cook, stirring often, until tender, about 5 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the butter and onion into a large bowl. Whisk the flour into the melted butter and onion, then slowly whisk in the milk to make a creamy sauce. Once the sauce is smooth, whisk in the eggs, lemon juice, vinegar and mace."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the crab meat to the cream sauce and mix lightly with a fork; don’t break up the pieces of crab meat. Gently fold in just enough of the bread crumbs so that the mixture holds together (about 2 1/2 cups). Divide the crab mixture into 12 equal portions, setting them on a baking sheet as you go. They should be thick rounds — about the size of the palm of your hand, and roughly 1 1/2 inches thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hand, take a scoop of the toasted bread crumbs and coat each crab cake. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the skillet and heat the oil over high. Once the oil is hot, place a few of the crab cakes in the skillet. Reduce the heat to medium and cook for 3 to 5 minutes on each side, or until browned and cooked through. Place the cooked crab cakes on a paper towel to drain. Working in batches, cook the remaining crab cakes, adding more oil as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve crab cakes immediately, or set aside in a warm oven (see Tip) while you cook the remaining crab cakes."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023174-crab-cakes"}