{"@context": "http://schema.org", "@type": "Recipe", "name": "Pulled Pork", "description": "This is party eating — and still easy enough to pull off for dinner whenever you want. Saucy and satisfying, it’s the type of dish that feels festive. Pulled pork from the American South ranges in styles, but usually balances the natural sweetness of the meat, slowly cooked until it slouches into tenderness, with tanginess and spice. Here, ground and whole dried chiles season the meat and blend into a sauce with fruity complexity and mild heat. The preparation is as inspired by <a href=\"https://cooking.nytimes.com/recipes/1016087-pulled-pork\">barbecue pulled pork</a> as it is by <a href=\"https://cooking.nytimes.com/recipes/1021732-carne-con-chile-rojo-chuck-braised-in-chile\">carne con chile rojo</a>. That means that the glossy hunks and slivers of meat taste as good piled into buns as they do over rice or stuffed into tortillas.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/10/05/dining/30KOrex/merlin_213556086_995eda32-3748-49f7-afe1-c402051750d1-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, barbecues, meat, project, main course", "keywords": "boneless pork shoulder, freezer friendly, guajillo chiles, make-ahead, party, pork butt, fourth of july, labor day, super bowl", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 217}, "recipeIngredient": ["3 tablespoons raw or brown sugar, plus more to taste", "1 tablespoon ground chipotle or other hot ground chile", "1 tablespoon onion powder", "2 teaspoons garlic powder", "1 teaspoon smoked paprika", "1 teaspoon ground black pepper", "Kosher salt (such as Diamond Crystal)", "1 (4-pound) boneless pork butt or shoulder roast", "1 large onion, chopped", "2 tablespoons neutral oil, such as canola", "10 dried guajillo chiles (2 to 3 ounces)", "2 teaspoons distilled white vinegar, plus more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together the sugar, chipotle, onion powder, garlic powder, smoked paprika, black pepper and 1 tablespoon kosher salt. If the pork came tied, untie it and unroll it. If it has a thick layer of fat, score the fat with a sharp knife. Rub the spice mixture all over the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’d like to marinate the meat, place the pork fat side up in a Dutch oven or other heavy pot if the pot can fit in your refrigerator and cover. Or place the meat in a bowl and cover it, or set it in a resealable plastic bag. Refrigerate to marinate for as much time as you have, preferably overnight (and up to 1 full day)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’d like to give your meat a smoky flavor, you can smoke it for an hour or so in a charcoal grill <a href=\"https://cooking.nytimes.com/guides/7-how-to-grill\">set up for indirect grilling</a> with wood chips strewn over the coals. Then, transfer it to a Dutch oven or pot, cover and bake as directed below."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re not smoking your meat, you can cook it in the oven from start to finish. About 4 hours before you want to eat, heat the oven to 425 degrees. Take the pork out of the refrigerator and let stand while the oven heats. Uncover the meat. Set it fat side up, transferring it to a Dutch oven or pot if needed. Scatter the onion around the meat and sprinkle with salt. Drizzle the oil all over the meat and onion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until the onion browns and the pork fat crackles a bit, about 20 minutes. Meanwhile, snap the stems off the chiles and discard them, then snap the chiles in half. Shake out their seeds and discard them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop the chiles on top of the onion. Add 2 1/2 cups water, cover the pot and reduce the oven temperature to 300 degrees. Cook until the meat is tender enough to fall apart when speared with a fork, about 3 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pork to a sheet pan. If you’d like the meat to have crispy charred bits, heat the broiler. Broil the pork until deeply browned in spots but try not to burn it. It will still be very tasty if you skip this broiling step. While the pork broils or rests, stir the vinegar into the hot cooking liquid in the pot. If you’d like, you can skim the fat off the surface of the cooking liquid. Transfer everything in the pot to a blender and blend until very smooth. Taste and add more sugar, vinegar and salt, if you’d like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide the pork back into the pot and shred with two forks. Pour enough of the sauce over the meat to evenly coat and stir to combine. If the mixture has cooled, heat it over low until simmering. Serve hot, with any extra sauce on the side. This dish keeps well in the refrigerator for up to 3 days and in the freezer for up to 3 months. Reheat, stirring now and then, in a microwave or over medium-low heat on the stovetop."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023499-pulled-pork"}