{"@context": "http://schema.org", "@type": "Recipe", "name": "Air-Fryer Chicken Thighs", "description": "Simple and satisfying, chicken thighs brown beautifully in the air fryer, maintaining moisture thanks to their fat content. A quick, vinegar-spiked sour cream marinade adds oomph and helps tenderize the chicken. Despite being tossed and coated in a quick wet marinade (or overnight, if time permits), the skin still comes out deeply golden-brown and shatteringly crisp without leaving the meat lackluster. Because thighs vary in size, and air fryers range in size and power, make sure to take the internal temperature before removing your chicken from the air fryer, or pierce the chicken to check that the juices run clear rather than pink to ensure doneness.", "author": {"@type": "Person", "name": "Eleanore Park"}, "image": "https://static01.nyt.com/images/2022/12/22/multimedia/ep-air-fryer-chicken-thighs-1-bcb1/ep-air-fryer-chicken-thighs-1-bcb1-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "3 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, quick, weeknight, poultry, main course", "keywords": "air fryer, chicken thigh, dijon mustard, rice vinegar, sour cream", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 401}, "recipeIngredient": ["3 bone-in, skin-on chicken thighs (about 6 ounces each) or boneless, skinless chicken thighs", "Salt", "2 tablespoons sour cream", "2 tablespoons Dijon mustard", "2 tablespoons rice vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat air fryer to 375 degrees, if preheating is recommended for your air fryer. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat chicken thighs dry with paper towels. Season the chicken thighs with salt on both sides. In a medium bowl, combine the sour cream, mustard and rice vinegar. Add the chicken and turn to coat. (Chicken can sit in the marinade for up to 8 hours. Refrigerate, then let come to room temperature before cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use tongs, transfer chicken to the air-fryer basket in an even layer. If using bone-in, skin-on thighs,  place them skin side down. Cook chicken until browned all over and skin is crisp, flipping halfway through, about 15 minutes. If cooking boneless, skinless chicken thighs, set them in the air fryer smooth side down and cook them until browned in spots and their juices run clear, flipping halfway through, about 15 minutes. When chicken thighs are fully cooked, an instant-read thermometer inserted into a thick part of the thigh should read 165 degrees and the juices should run clear when pierced. If your chicken isn’t fully cooked, continue to cook in 3-minute increments until chicken reaches the desired temperature. Allow chicken thighs to rest slightly and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023763-air-fryer-chicken-thighs"}