{"@context": "http://schema.org", "@type": "Recipe", "name": "Brunswick Stew", "description": "Few American dishes are more comforting than Brunswick stew, a motley mix of tomatoes, corn, beans and shredded meat. Chicken is most commonly used today, though some stew experts throw in beef chuck or pork shoulder for flavor and fat (or they prepare it in the old way, using game meat such as squirrel and rabbit). Both Brunswick County, Va., and Brunswick, Ga., lay claim to this hearty fall stew. This version borrows from the sweet and savory Virginian tradition. Thickened with potatoes, the stew tastes great on its own, alongside a hunk of cornbread or with a sleeve of saltine crackers.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/11/26/dining/20BRUNSWICKREX-brunswick-stew/merlin_215042820_664a42bb-28a0-4ea3-8355-d2ce3dbab792-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, main course, side dish", "keywords": "chicken thigh, corn, freezer friendly, lima beans, make-ahead, plum tomato, yukon gold potato, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1381}, "recipeIngredient": ["Olive oil", "2 large yellow onions, diced", "Salt and black pepper", "4 dried or fresh bay leaves", "4 teaspoons celery seeds", "1/4 to 1/2 teaspoon cayenne pepper, plus more to taste", "3 pounds plum tomatoes, diced", "3 tablespoons Worcestershire sauce", "4 teaspoons granulated sugar, plus more to taste", "1 pound Yukon Gold potatoes, peeled and cut into 2-inch pieces", "1 quart chicken stock", "2 pounds boneless, skinless chicken thighs, each cut in half", "2 cups fresh or frozen corn kernels", "2 cups fresh or frozen shelled lima beans"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large Dutch oven or soup pot over medium-high. Add enough olive oil to generously coat the bottom of the pot. Add the onion and season with salt and pepper. Cook, stirring occasionally, until the onions are soft, translucent and starting to brown at the edges, 12 to 15 minutes. Stir in the bay leaves, celery seeds and cayenne, and cook until fragrant, just a few seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes, Worcestershire sauce and sugar, and cook, stirring occasionally, until the tomatoes are softened and much of their liquid has released, 7 to 9 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the potatoes and chicken stock, and bring to a boil. Reduce the heat to a simmer, cover and continue simmering, stirring occasionally, until the stew thickens slightly and the potatoes are falling apart, about 1 hour. Using the back of a spoon, gently crush most of the potatoes against the side of the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken, corn and lima beans. Continue simmering, uncovered, stirring occasionally, until the chicken is soft and easily shreddable, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken from the pot, shred with two forks and return to the pot. (Alternatively, you can leave the chicken pieces whole; large chunks of stewed thigh meat taste delicious here.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste for seasoning, adding more salt, pepper, cayenne and sugar as desired. Serve immediately or refrigerate in airtight containers for up to 4 days. You also can freeze it for up to 4 months before thawing and reheating."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023587-brunswick-stew"}