{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetable Tofu Curry", "description": "This one-pot vegetarian meal comes together quickly and leftovers keep for days. Creamy coconut milk is made up of fat and liquid from pressed coconut meat and this recipe delivers its full range of flavors. When you melt the solids from a can of coconut milk and keep cooking until the liquid evaporates, the oil eventually separates out and delivers toasty nuttiness. Here, onion — any kind — tenderizes in that tasty fat, and curry powder becomes more fragrant in it. Tofu soaks up the curry sauce while vegetables steam over the mixture, then everything gets stirred together. Experiment with whatever vegetables you have on hand, cooking them until tender.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/06/22/dining/21beginner-rex10/merlin_208168485_3ca79d37-0cbf-46c4-8a91-5a9a7e380360-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, curries, vegetables, main course", "keywords": "broccoli, coconut milk, curry powder, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 987}, "recipeIngredient": ["2 broccoli heads, 8 ounces green beans or 2 cups frozen peas, or a combination", "1 (14- to 16-ounce) container firm tofu", "1 (13.5-ounce) can coconut milk", "1 medium onion, chopped", "Salt and pepper", "1 tablespoon curry powder, plus more to taste", "Cooked rice or other grains or noodles, for serving", "Hot sauce, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using broccoli, trim the ends of the stems and discard, then cut the stems off near the base of the florets. Cut off the thick peel around the stems, then cut the stems into 1/2-inch slices. Cut the broccoli crowns into small florets. Drain the tofu and cut into 1-inch cubes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the can of coconut milk and spoon off an inch or so of the hard white solid part into a large saucepan with a lid. (If the milk is all liquid, add a few spoonfuls.) Turn the heat to medium-high. When the solids melt, add the onion and broccoli stems, if using, and sprinkle with salt and pepper. Cook, uncovered, stirring occasionally, until the onion is translucent, 5 to 7 minutes. The coconut milk liquid should have evaporated, so the onions should be sizzling in coconut oil and the milk solids should be brown and smell toasty. Scrape up any bits sticking to the bottom."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat down to medium-low, add the curry powder and stir until evenly mixed, about 10 seconds. Add the remaining coconut milk, stir and bring to a simmer. Add the tofu and spread the cubes in an even layer, then top with the broccoli florets or other vegetables, sprinkle with salt and cover with the lid. Cook until the vegetables are just tender but still bright green, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently stir so the vegetables are also coated in sauce. Taste and stir in more curry powder, salt and pepper if you’d like. Serve hot over rice or other grains or noodles, with hot sauce if you want."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023234-vegetable-tofu-curry"}