{"@context": "http://schema.org", "@type": "Recipe", "name": "Buldak Pizza (Korean Fire Chicken Pizza)", "description": "Buldak (literally “fire chicken”) is a modern South Korean drinking dish of marinated chicken grilled and bathed in a spicy-sweet sauce flavored with gochujang, soy sauce, sweet rice syrup and hot chile flakes, often served with a topping of broiled, browned, bubbly mozzarella. The sweet-savory-smoky-cheesy combination and beer-friendliness is so reminiscent of barbecue chicken pizza that it’s worth putting the two together. With some tweaking, it works.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2022/09/21/dining/19Kenjirex/merlin_213112716_d2b820c5-9998-4f64-bdf6-a6598e6fdeb1-articleLarge.jpg", "totalTime": "P1DT50M", "recipeYield": "2 (14-inch) pizzas", "recipeCuisine": "", "recipeCategory": "dinner, pizza and calzones, project, main course", "keywords": "chicken thigh, gochugaru, gochujang, mozzarella, sweet rice syrup", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 151}, "recipeIngredient": ["1 tablespoons neutral oil, such as vegetable, canola or rice bran", "6 medium garlic cloves, minced (about 2 tablespoons)", "3 coin-sized disks of fresh ginger", "1 tablespoon tomato paste", "1/4 cup gochujang (hot or mild, depending on your heat tolerance, see Tip)", "3 to 4 tablespoons gochugaru (hot or mild, more or less, depending on your heat tolerance, see Tip), plus more to finish", "1 tablespoon coarsely fresh ground black pepper", "3 tablespoons sweet rice syrup or light corn syrup", "3 tablespoons soy sauce", "2 tablespoons toasted sesame oil", "1/2 cup chicken or vegetable stock, or water", "1/2 cup crushed tomatoes", "12 ounces boneless, skinless chicken thighs (2 to 4 thighs, depending on their size)", "425 grams/about 3 level cups bread flour, plus more for stretching and dusting pizza skins (15 ounces)", "12 1/2 grams/about 1 tablespoon sugar (.4 ounces)", "12 1/2 grams/about 1 tablespoon kosher salt (.4 ounces)", "6 grams/about 1 teaspoon instant yeast, such as SAF or Fleischman’s Instant Yeast (.2 ounces)", "28 grams/about 2 tablespoons extra-virgin olive oil (1 ounce)", "12 ounces coarsely grated full-fat dry mozzarella", "6 garlic cloves, very thinly sliced", "A handful of pickled chiles (such as pepperoncini or banana peppers)", "A bunch of thinly sliced scallions", "Roasted gold or black sesame seeds (or a mix)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the marinade: In a large saucepan, heat the oil over medium until shimmering. Add the garlic and ginger, and cook, stirring, until fragrant, about 1 minute. Add tomato paste, gochujang, gochugaru and black pepper. Stir until homogenous and a light film starts to form on the bottom of the pan, about 1 minute. Add rice or corn syrup, soy sauce and sesame oil. Bring to a simmer and remove and discard ginger slices. Using a ladle, transfer half of the mixture to a large bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pizza sauce: Add stock and crushed tomatoes to the remaining mixture in the saucepan, stir to combine and simmer until reduced to about 1 1/4 cup, about 5 minutes. Transfer to a container, allow to cool and refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken to the marinade in the bowl and toss to thoroughly coat. Transfer to a sealed container and let marinate for at least 1 night and up to 3."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the pizza dough: In a heavy-duty food processor (see Tip) fitted with a dough blade or regular blade, combine flour, sugar, salt and yeast. Pulse a few times to mix thoroughly. Add the oil and 270 grams/9.5 ounces lukewarm water (about 1 cup plus 2 tablespoons). Run the food processor until a cohesive ball of dough forms and starts to ride around the blade. Let the processor continue running for 30 seconds, then shut it off."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dough ball to a bowl at least double its volume. Cover tightly with plastic wrap or aluminum foil, then transfer to the refrigerator for at least 1 night and up to 3."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On the day you’re ready to bake, remove the dough from the refrigerator. Transfer to a lightly floured work surface and, using a bench scraper or knife, divide the dough in half. Using floured hands, form each half into a tight ball, gathering the dough to a point on the bottom and pinching it shut to form a sort of stretched “skin” around the ball. Transfer each ball to a lightly oiled bowl at least thrice its volume. Cover the bowls (you can use a cutting board or pot lids, plastic wrap or aluminum foil) and let them rest at room temperature until doubled in volume and quite slack, at least 2 hours and up to 6."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, adjust an oven rack to a few inches below the broiler, place a baking stone or steel on it, and heat the oven to the highest temperature it can muster (500 to 550 degrees, preferably) for at least 45 minutes. If you have convection, use it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the marinated chicken on a rimmed, foil-lined baking sheet. Place the baking sheet directly on the pizza stone and cook the chicken until cooked through and charred in spots, 7 to 8 minutes. Transfer the chicken to a cutting board and, when cool enough to handle, roughly chop it into pizza topping-sized pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn a single dough ball out into a bowl of flour and turn to coat. Transfer to a well-floured wooden pizza peel or the bottom of an overturned baking sheet. Using your fingertips, dimple the center of the dough repeatedly, pushing the dough out into a circle about 8 to 10 inches in diameter, leaving the outer rim higher than the rest. Using flat hands and dusting underneath or on top with flour as needed, stretch the dough out into a 12- to 14-inch circle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working as quickly as you are able, using the back of the spoon, evenly spread half of the sauce on top of the dough, leaving a rim around the edge. Spread half of the chopped chicken on top, followed by half of the mozzarella. Add half the garlic slices and half the pickled chiles. With clean, dry hands, pull the edges of the pizza out to stretch it a bit. Shake the pizza peel to ensure the pizza moves loosely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide the pizza onto the baking stone and bake until the crust and cheese are as cooked as you like them, typically 5 to 8 minutes, though this timing can vary a lot depending on your oven and your taste. Keep an eye on the pizza and turn it a few times as it cooks if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a thin metal pizza peel or large spatula, retrieve the pizza and slide it onto a cutting board. Top with scallions and sesame seeds. Cut into slices and serve immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat Steps 9 through 12 with the remaining ingredients."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023495-buldak-pizza-korean-fire-chicken-pizza"}