{"@context": "http://schema.org", "@type": "Recipe", "name": "Chamomile Tea Cake With Strawberry Icing", "description": "This buttery, chamomile tea-scented loaf is a sweet pop symphony, the Abba of cakes. A pot of flowery, just-brewed chamomile isn’t required for drinking with slices of this tender loaf but is strongly recommended. In life and in food, you always need balance: A sip or two of the grassy, herbal tea between bites of this cake counters the sweetness, as do freeze-dried strawberries, which lend tartness and a naturally pink hue to the lemony glaze. This everyday loaf will keep on the counter for 3 to 4 days; be sure the cut side is always well wrapped.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/04/17/dining/17Mag-Eat1/17Mag-Eat1-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "One 9-inch loaf", "recipeCuisine": "", "recipeCategory": "cakes, dessert", "keywords": "chamomile, freeze-dried strawberries, lemon, easter, mother’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 810}, "recipeIngredient": ["1/2 cup/115 grams unsalted butter", "2 tablespoons/6 grams chamomile tea (from 4 to 6 tea bags), crushed fine if coarse", "1 cup/240 milliliters whole milk", "Nonstick cooking spray", "1 cup/200 grams granulated sugar", "1/2 teaspoon coarse kosher salt", "2 large eggs", "1 large lemon", "2 teaspoons baking powder", "1 teaspoon pure vanilla extract", "1 1/2 cups/192 grams all-purpose flour", "1 cup/124 grams confectioners’ sugar", "1/2 cup/8 grams freeze-dried strawberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, melt the butter over medium heat. Add 1 tablespoon chamomile to a large mixing bowl. Pour the hot melted butter over the chamomile and stir. Set aside to steep and cool completely, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the same saucepan (without washing it out) to bring the milk to a simmer over medium-high heat, keeping watch so it doesn’t boil over. Remove from the heat, and stir the remaining 1 tablespoon chamomile into the hot milk. Set aside to steep and cool completely, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Grease a 9-by-5-inch loaf pan with the nonstick cooking spray and line with parchment paper so the long sides of the pan have a couple of inches of overhang to make lifting the finished cake out easier."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sugar and salt to the bowl with the butter, and whisk until smooth and thick, about 1 minute. Add the eggs, 1 at a time, vigorously whisking to combine after each addition. Zest the lemon into the bowl; add the baking powder and vanilla, and whisk until incorporated. Add the flour and stream in the milk mixture while whisking continuously until no streaks of flour remain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the batter to the prepared pan and bake until a skewer or cake tester inserted in the center comes out clean (a few crumbs are OK, but you should see no wet batter), 40 to 45 minutes. Cool in the pan on a rack for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake cools, make the icing: Into a medium bowl, squeeze 2 tablespoons juice from the zested lemon, then add the confectioners’ sugar. Place the dehydrated strawberries in a fine-mesh sieve set over the bowl and, using your fingers, crush the brittle berries and press the red-pink powder through the sieve and into the sugar. (The more you do this, the redder your icing will be.) Whisk until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If needed, run a knife along the edges of the cake to release it from the pan. Holding the 2 sides of overhanging parchment, lift the cake out and place it on a plate, cake stand or cutting board. Discard the parchment. Pour the icing over the cake, using a spoon to push the icing to the edges of the cake to encourage the icing to drip down the sides dramatically. Cool the cake completely and let the icing set."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023127-chamomile-tea-cake-with-strawberry-icing"}