{"@context": "http://schema.org", "@type": "Recipe", "name": "Sabich Bowls", "description": "The traditional Israeli sandwich known as sabich features fried eggplant that’s tucked into pitas and topped with sliced hard-boiled eggs, chopped tomato-cucumber salad, pickles, tahini sauce and sometimes shredded cabbage. This weeknight recipe turns the popular sandwich into a one-bowl meal that is prepared on a sheet pan. Eggplant and chickpeas are roasted side by side; the eggplant becomes tender and creamy while the chickpeas turn golden and crispy. Canned chickpeas do double duty: Some are a part of the roast, while the remaining beans transform into a luscious, garlicky tahini sauce. The eggplant mixture is served on top of rice in this recipe, but all sorts of grains would work, including bulgur, farro and quinoa.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2023/01/19/multimedia/kc-sheet-pan-sabich-bowls-pmjl/kc-sheet-pan-sabich-bowls-pmjl-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weeknight, main course", "keywords": "cherry tomatoes, chickpea, cucumber, eggplant, food processor, grain bowl, grape tomato, lemon juice, tahini, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 486}, "recipeIngredient": ["1 1/2 pounds Italian eggplant (1 large), cut into 1-inch cubes (8 cups)", "Kosher salt and black pepper", "1/2 cup extra-virgin olive oil", "1 (15-ounce) can chickpeas, rinsed", "1/4 cup tahini", "3 tablespoons lemon juice", "1 teaspoon minced garlic", "1 teaspoon low-sodium soy sauce", "8 ounces grape or cherry medium tomatoes, chopped (1 heaping cup)", "1 Persian cucumber, cut into ¼-inch cubes (½ cup)", "2 tablespoons coarsely chopped parsley, plus more for garnish", "4 cups cooked rice or grains, for serving", "Shredded cabbage, pickles (preferably Israeli), hot sauce, hard-boiled or fried eggs, for topping (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. On a large sheet tray, season eggplant with salt and pepper, drizzle with 3 tablespoons of the oil and toss to evenly coat. Push eggplant to one side. In the empty space, combine 1 cup of the chickpeas and 1 tablespoon of the oil and season with salt and pepper. Toss to evenly coat, then mix with the eggplant and spread mixture in an even layer. Roast until eggplant is tender and chickpeas are golden and crispy, stirring halfway through, 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a food processor, combine the remaining chickpeas with the tahini, 2 tablespoons of the lemon juice, the garlic, soy sauce and ¼ cup of water; pulse to combine. With the machine running, drizzle in the remaining ¼ cup of oil; purée, then season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine tomatoes, cucumber, parsley and the remaining 1 tablespoon lemon juice; season with salt and pepper, and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide rice or grains into 4 bowls; top with separate piles of the eggplant mixture, tomato salad and other toppings of choice. Drizzle generously with some of the tahini sauce. Garnish with parsley and serve warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023800-sabich-bowls"}