{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Shrimp Salad With Melon and Feta", "description": "A colorful mix of juicy fresh melon, salty feta and grilled shrimp, this easy-to-make salad is perfect for a quick and light summer dinner. A little minced chile adds heat, balancing the sweetness of the melon and shrimp, while the toasted whole coriander seeds lend a nice crunch. You can use any one type or a combination of melon here, and the riper the better. Serve this with something to catch all the tangy sauce — bread, rice or even a spoon.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/08/17/dining/12Apperex-Shrimp/merlin_210401388_0537fbb9-39e8-40a0-ad3b-252fb2f6a806-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weeknight, salads and dressings, seafood, main course", "keywords": "feta, melon, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 286}, "recipeIngredient": ["2 teaspoons coriander seeds", "2 limes", "2 garlic cloves", "1 Fresno chile, serrano or other fresh chile pepper, minced", "Salt and freshly ground black pepper", "1/4 cup extra-virgin olive oil", "1 pound cleaned extra-large shrimp", "1 pound cubed melon (about 4 cups; any kind, or a combination)", "1 small cucumber, preferably Persian or kirby, thinly sliced", "1/4 cup thinly sliced red onion or shallot", "1/3 cup crumbled feta", "1/2 cup chopped soft herbs, such as mint, basil or cilantro, plus more for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Light a charcoal or gas grill or heat the broiler. Make the fire as hot as it will get and, if using a broiler, put the rack close to the heat source."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the grill heats up, lightly crack the coriander seeds in a mortar and pestle, or with the side of a knife on a cutting board. (Careful: They can roll around.) Put them in a small dry skillet over medium heat and toast, shaking the pan once or twice until fragrant, 1 to 3 minutes. Pour into a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a Microplane or other grater, grate zest from both limes straight into the bowl with coriander. Grate in the garlic (no need to wash the grater in between), then add the chile and a large pinch of salt and pepper. Whisk in oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat shrimp dry, then transfer to a medium bowl and season with a pinch each salt and black pepper. Give the coriander mixture a stir, then pour half of it over the shrimp, reserving the rest for the salad. Toss shrimp to coat and set aside while preparing the other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the zested limes in half, squeeze out 2 tablespoons juice and whisk into the coriander mixture to make a dressing. Cut leftover lime into wedges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the shrimp in a grill basket or on skewers (or just on a sheet pan if broiling), and grill or broil shrimp until well browned on one side, 2 to 3 minutes. Flip and cook until just opaque and cooked through, 1 to 2 minutes. Transfer the shrimp to a plate and squeeze a wedge of lime all over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine melon, cucumber, onion, feta and herbs. Pour in coriander dressing and toss to combine. Taste, and add more salt or lime juice to taste. Top melon salad with grilled shrimp and more herbs, if you’d like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023398-grilled-shrimp-salad-with-melon-and-feta"}