{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish Sticks With Peas", "description": "Two childhood classics — fish sticks and green peas — find their rightful place back at the dinner table for eaters of all ages to enjoy in this wholesome weeknight meal. The fish stick, coined “the ocean’s hot dog” by the historian Joseph Peterson, was first manufactured by Gorton’s, the Massachusetts seafood company, in 1953. It soon became popular as a tasty and effortless family meal for Americans wary of cooking fresh fish at home. The key to flavorful homemade fish sticks is to season them well every step of the way. Here, turmeric provides the nostalgic yellow tint while adding a warm, earthy flavor to meaty cod fillets (or any firm white fish). The accompanying peas get a lift from tangy lemon zest and fresh mint, and red-pepper flakes provide just enough heat to liven up your taste buds and dinner plates. Serve with <a href=\"https://cooking.nytimes.com/recipes/1022372-tartar-sauce\">tartar sauce</a> for dipping and lemon wedges.", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2022/05/17/dining/nd-fish-sticks-with-peas/nd-fish-sticks-with-peas-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, finger foods, seafood, main course", "keywords": "bread crumbs, fish, peas, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 315}, "recipeIngredient": ["1/4 cup all-purpose flour ", "1/2 teaspoon ground turmeric ", "1/4 teaspoon onion powder", "1/8 teaspoon garlic powder", "Kosher salt (such as Diamond Crystal) and black pepper", "2 large eggs", "1 cup bread crumbs (regular or panko)", "1 1/2 pounds skinless cod fillet (about 1-inch thick)", "1/4 cup extra-virgin olive oil, plus more as needed", "<a href=\"https://cooking.nytimes.com/recipes/1022372-tartar-sauce\">Tartar sauce</a> and lemon wedges, for serving", "3 tablespoons extra-virgin olive oil", "3 medium garlic cloves, finely grated", "1/2 teaspoon grated lemon zest", "Red-pepper flakes, to taste", "1 pound frozen green peas", "Kosher salt (such as Diamond Crystal)", "1/4 cup roughly chopped mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare your dredging station and make the fish sticks: Place the flour, turmeric, onion powder, garlic powder, 1 teaspoon salt and 1/2 teaspoon black pepper on a large plate; stir to combine. In a pie plate or shallow bowl, beat the eggs with 1 tablespoon of water and sprinkle with a little salt. Place the bread crumbs and 3/4 teaspoon salt on another large plate and stir to combine. Place a baking sheet beside you. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dry the fish well with paper towels. Season the fish with 1 teaspoon salt and 1/4 teaspoon pepper, then cut into 1 1/2- to 2-inch strips. Dredge each piece of fish in the seasoned flour (shaking of any excess flour), then in the egg, then in the bread crumbs; place breaded fish pieces on the baking sheet. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pan-fry the fish sticks: In a large (12-inch) pan, heat the oil over medium-high. (To bake the fish sticks, see Tip.) When the oil is hot but not smoking, reduce the heat to medium and fry the fish sticks on all four sides until golden and crisped, about 4 minutes per side. You may need to do this in batches; add more oil if needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the fish fries, prepare the peas: In a large pan, heat the oil over medium-low. Add the garlic and cook, stirring continuously until fragrant, about 2 minutes, taking care not to burn it. Add the lemon zest and some red-pepper flakes, and cook, stirring, until fragrant, about 2 minutes. Add the peas and 1 1/2 teaspoons salt, stir to combine, then cook for 1 minute in the lemony oil. Add 1/4 cup water, increase the heat to medium and simmer, uncovered, stirring occasionally, until the peas are tender but not mush and most of the water has been absorbed, 5 to 7 minutes. Taste and adjust seasoning. Remove from the heat and stir in the mint."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the fish sticks with the peas and tartar sauce, plus some lemon wedges to squeeze over the fish."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023204-fish-sticks-with-peas"}