{"@context": "http://schema.org", "@type": "Recipe", "name": "Qatayef Asafiri (Stuffed Semolina Pancakes)", "description": "Qatayef are synonymous with Ramadan. It is during this month that bakeries start making the pastry for these stuffed pancakes, and the lines spill into the street as people wait their turn to buy them. Golden underneath and speckled with bubbles on top, qatayef are cooked only on one side. They can be large or small. The large ones are normally stuffed with nuts or cheese and folded over, then fried or baked, and drenched in sugar syrup. The small ones, called qatayef asafiri (or little bird qatayef), are stuffed with a creamy filling, only half closed, then dipped in pistachio and drizzled with thick, faintly floral sugar syrup. The batter is very simple; the key is to make sure it is the right consistency, like that of heavy cream.", "author": {"@type": "Person", "name": "Reem Kassis"}, "image": "https://static01.nyt.com/images/2022/03/30/dining/29qatayefrex/28qatayefrex-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 30 pieces", "recipeCuisine": "middle eastern", "recipeCategory": "pancakes, pastries, dessert", "keywords": "mascarpone, orange blossom water, pistachio, rose water, semolina flour, ramadan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 252}, "recipeIngredient": ["1/2 cup/100 grams granulated sugar", "A squeeze of fresh lemon juice", "1 teaspoon orange blossom water or rose water, or a combination", "1 cup/125 grams all-purpose flour", "1/4 cup/40 grams fine semolina flour", "1 tablespoon granulated sugar", "1/2 teaspoon instant or quick-rise yeast", "1/2 teaspoon baking powder", "1/4 teaspoon baking soda", "1/4 teaspoon ground mahlab (optional, see Tip)", "1/4 teaspoon orange blossom water or rose water (optional)", "1 cup/8 ounces mascarpone", "1/2 cup/120 grams heavy cream", "3 tablespoons confectioners’ sugar", "1 teaspoon orange blossom water or rose water, or a combination", "1/4 cup/about 1 ounce finely ground unroasted, unsalted pistachios, preferably Turkish, for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the syrup: In a small saucepan, combine the sugar, lemon juice and 1/4 cup water. Bring to a boil over medium heat. Lower heat and simmer until slightly thickened, about 5 minutes. Set aside to cool completely, then stir in 1/2 teaspoon orange blossom water and 1/2 teaspoon rose water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the batter: Add 1 1/4 cups plus 2 tablespoons water to a blender or food processor. Add all the batter ingredients and process until smooth. The batter should be quite loose, similar to heavy cream in consistency. Set aside to rest for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the filling: Place the mascarpone, heavy cream, confectioners’ sugar, 1/2 teaspoon orange blossom water and 1/2 teaspoon rose water in a small bowl. Use a handheld electric mixer to whip into stiff peaks. Refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the qatayef: Place a medium nonstick skillet or griddle over medium heat until hot. Mix the batter to ensure it is smooth, then pour separate 1-tablespoon portions of batter into the pan, fitting about 4 circles. Cook qatayef until the entire surface is covered in small bubbles and the center loses its sheen, about 30 to 45 seconds. (You might be able to cook off more at a time once you’ve determined the right temperature and consistency of the batter.) If the bubbles are large and sparse, then your batter is too thick; stir 1 tablespoon of water into the batter to thin. Qatayef cook only on one side; the base should be uniformly golden and the top covered in small bubbles. If the disks brown too quickly — or unevenly — underneath before the batter loses its sheen on top, lower the heat slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer each cooked qatayef to a large tray lined with a dish towel and cover with another dish towel while you cook the remaining batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the qatayef: Fold each into a half-moon, bubble side on the inside, and pinch to seal the edges together halfway. Using a teaspoon or a piping bag, fill the opening with the cream, then dip the exposed cream filling into the ground pistachios."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the filled qatayef on a serving platter. These can be covered in plastic wrap and refrigerated for several hours until ready to serve. To serve, drizzle the cooled syrup over the qatayef and offer guests more syrup to add to their individual plates, if they choose."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023041-qatayef-asafiri-stuffed-semolina-pancakes"}