{"@context": "http://schema.org", "@type": "Recipe", "name": "West African-Inspired Brisket", "description": "During Passover, this brisket, an American Jewish dish deeply influenced by the food historian Michael W. Twitty’s Black heritage, will entice guests. Made with vibrant ingredients common in the cuisines of West and Central Africa, Mr. Twitty’s brisket gets its culinary power from the fresh flavors of bell peppers, onions and tomatoes, and the aromas of ground chiles, garlic, ginger and turmeric. Bathed in a piquant sauce, this brisket pairs well with rice or <a href=\"https://cooking.nytimes.com/recipes/1021958-fufu-swallows\">fufu</a> (pounded tubers or plantains). According to Mr. Twitty, it may encourage table conversations spoken in Pidgin rather than Yiddish.", "author": {"@type": "Person", "name": "Kayla Stewart"}, "image": "https://static01.nyt.com/images/2022/04/06/dining/05passoverrex3/merlin_204759333_6efed70f-dc39-4507-9b79-0a80585f461c-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "jewish", "recipeCategory": "dinner, meat, main course", "keywords": "brisket, onion, tomato, passover", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 298}, "recipeIngredient": ["1 tablespoon paprika", "1 teaspoon garlic powder", "1 teaspoon ground ginger", "1 teaspoon ground turmeric", "1 teaspoon ground cinnamon", "1 teaspoon ground mild or medium red chile powder", "1 teaspoon cayenne pepper", "1 tablespoon coarse kosher salt, plus more to taste", "1 teaspoon coarsely ground black pepper", "1 (5-pound) brisket", "2 large red onions, cut into rounds", "4 tablespoons extra-virgin olive oil", "3 white or yellow onions, diced", "3 bell peppers (green, red and yellow), diced", "1 (14.5-ounce) can diced tomatoes (Kosher for Passover), drained", "2 cups chicken, beef or vegetable stock (Kosher for Passover)", "1 tablespoon brown sugar", "1 teaspoon prepared horseradish", "2 fresh or dried bay leaves", "1 sprig fresh thyme or 1 teaspoon dried thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Combine the paprika, garlic, ginger, turmeric, cinnamon, chile powder and cayenne with the salt and pepper. Save 2 teaspoons for the vegetables, then sprinkle the rest all over the brisket and rub in well. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the red onion rounds in a single layer in a roasting pan or large baking dish that can fit the brisket and drizzle with 1 tablespoon olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining 3 tablespoons olive oil over medium-low in a very large Dutch oven or large, deep skillet that fits the brisket. Cook the beef until lightly seared (don’t let the spices burn), about 5 to 6 minutes on both sides. Transfer to the roasting pan, placing the brisket on top of the red onion rounds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the diced onions and bell peppers to the oil in the Dutch oven and season with the saved 2 teaspoons of seasoning. Raise the heat to medium and cook, stirring occasionally, until the onions are translucent, about 10 minutes. Add the tomatoes, mix together, and cook for about 5 minutes, stirring often."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the stock, brown sugar, horseradish, bay leaves and thyme. Spoon the vegetables over the brisket to cover it and pour everything else from the Dutch oven into the roasting pan. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the pan tightly with foil. If the foil touches the top of the brisket, cover the brisket with parchment paper first, then cover the pan with the foil. Bake until a fork slides into the brisket with only a little resistance, about 3½ hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve right away, transfer the brisket to a cutting board and cut across the grain into thin slices. Transfer to a serving platter, sprinkle with salt and spoon the vegetables on top. You can serve the remaining sauce alongside or save for another use. To make ahead, cool the brisket, then cover tightly and refrigerate for up to 2 days. Once the brisket is chilled, cut off and discard excess fat if you’d like, and then slice the meat against the grain. Place the sliced brisket in a pan or pot, cover with the vegetables and sauce, and heat in a 350-degree oven until heated through, about 30 minutes."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023084-west-african-inspired-brisket"}