{"@context": "http://schema.org", "@type": "Recipe", "name": "Tuna Crunch Sandwiches", "description": "A tuna salad and potato chip sandwich may not be quite as classic a pairing as peanut butter and jelly, but it is, anecdotally, many middle-schoolers’ first forays into experimenting with flavors and textures, and no less delicious. Beyond crunch, chips also add stability to the sandwich, holding the tuna salad in place as you eat. There’s no wrong way to make the sandwich, but seasoning tuna salad with red onion and celery, plenty of olive oil and little lemon juice, and using kettle-style salt and vinegar potato chips are especially alluring. There’s the word “optional” next to the most optional ingredients, but consider every ingredient other than the tuna, bread and chips to be adaptable according to your own taste (or how your mom made it).", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2022/04/25/dining/25kenji1/merlin_205535622_d8531436-2fec-4dd9-b2b6-ac83876ecb4c-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "2 sandwiches", "recipeCuisine": "", "recipeCategory": "dinner, for two, lunch, quick, weeknight, sandwiches, main course", "keywords": "bread, potato chips, tuna", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 598}, "recipeIngredient": ["1 (5-ounce) can solid white albacore or skipjack tuna (see Tip)", "1 hard-boiled egg, peeled", "1 celery rib, finely minced", "3 tablespoons extra-virgin olive oil (see Tip)", "2 tablespoons finely minced red onion, shallot or scallions", "2 tablespoons finely minced fresh parsley, chives, tarragon or a mix (optional)", "2 tablespoons mayonnaise, plus more for spreading (see Tip)", "1 tablespoon sweet pickle relish or chopped dill pickles (optional)", "2 teaspoons freshly squeezed lemon juice", "A few large handfuls of hearty potato chips or corn chips (see Tip)", "Salt and black pepper", "4 slices thick, soft sandwich bread, such as Texas toast, toasted, if desired", "2 lettuce leaves, such as iceberg, romaine, green leaf or Bibb"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the can of tuna, leaving the lid in place after opening it. Invert the whole can over the sink and press the lid into the tuna firmly to squeeze out as much excess water or oil as you can. (Be careful not to cut your fingers on any sharp edges). Transfer the tuna to a medium bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash your hands well, then grab the boiled egg and squeeze it through your fingers into the bowl with the tuna. Add the celery, olive oil, onion, herbs (if using), mayonnaise, relish (if using) and lemon juice. Using a fork, gently fold together all the ingredients, trying to leave the tuna in relatively large chunks. Grab a few chips and, using your hands, crumble them into the bowl. Season lightly with salt and pepper, and fold again to combine. Taste and adjust seasoning to taste — more salt, pepper and lemon juice if it tastes bland, and more olive oil or mayonnaise if it tastes dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready for lunch, spread each slice of bread generously with mayonnaise. Place lettuce on each bottom slice of bread, then top each with half of the tuna salad mixture. Add a generous handful of potato chips on top of each (more than seems reasonable), then close the sandwiches. Press down firmly so the chips break and embed themselves into the tuna salad and the bread. Cut into triangles and serve with extra chips on the side."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023147-tuna-crunch-sandwiches"}