{"@context": "http://schema.org", "@type": "Recipe", "name": "Oklahoma Onion Burgers", "description": "Homer Davis and his son Ross invented what he called the Depression burger at the Hamburger Inn in El Reno, Okla., as a means to add inexpensive bulk to their burgers. Rather than toasting, the buns are steamed in onion-scented vapor. That the technique — cooking the patties smashed-style with a huge amount of thinly shaved onions and steaming the buns — and restaurant remain popular to this day is a testament to the burgers’ deliciousness. If you prefer, you can take the cooking (and the accompanying lingering onion aroma) completely out of the house by heating the skillet or griddle directly over a very hot grill and cooking outdoors (see Tip).", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2022/07/20/dining/19kenjirex-burgers/merlin_209983146_a42ab18e-d9e0-45d7-af24-891a1239fbcc-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, sandwiches, main course", "keywords": "ground beef, hamburger buns, onion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1116}, "recipeIngredient": ["1 pound ground beef, preferably 20 to 30 percent fat", "Kosher salt and freshly ground black pepper", "2 medium or 1 large yellow or white onion, sliced as thinly as possible, and on a mandoline for best results (8 to 10 ounces of sliced onion)", "4 slices American cheese", "4 soft, sturdy hamburger buns, such as King’s Hawaiian rolls", "Dill pickle chips and condiments, as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the beef: Line a 13-by-18-inch rimmed baking sheet with parchment paper. Divide the ground beef into 4 even balls. Working one ball at a time and using your hands, massage the meat until it is cohesive and tacky, about 15 seconds. Next, using clean hands, roll each into a smooth ball. Place the balls on the baking sheet, with 1 ball in the center of each quadrant. Refrigerate until ready to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape the patties: Gently press each ball into a disk-shaped patty about 3 inches wide. Place the patties on a sheet pan or large plate, and season the tops with salt and pepper. Flip the patties, and top each with a large pile of sliced onions — as many as you can balance on top; they should resemble a large haystack. (It is important to not add salt to the onions at this point, as it will draw out excess moisture, which will inhibit searing.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the skillet or griddle: Heat a large (12-inch) cast-iron or carbon-steel skillet or griddle (see Tips) over an indoor burner set to high heat or on the grates of a hot outdoor grill for a few minutes until very hot; a drop of water should skitter around the surface. (If you don’t have a pan skillet or griddle big enough, you can cook the burgers in batches.) Place 1 patty of beef in the center of one quadrant of the pan, with the onions on top (do not add any oil)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Smash the burgers: Using a very stiff spatula, press on the onions and beef to form a patty 4½- to 5-inches wide. As you smash, focus on the patty’s edges so that the finished patty is slightly thicker in the center and smashed out as thinly as possible along the edges. Repeat with the remaining patties. Use the spatula to place any stray onions back on top of the burgers. Season the onions lightly with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the burgers: Allow patties to cook without moving until the edges are dark brown and crusty, 1 to 2 minutes. Holding the spatula upside down (so that the head of the spatula is angled down to increase leverage), scrape the edges of each patty off the pan, working around each patty to ensure that you don’t leave any crispy edges behind. When the edges have all been loosened, turn the spatula back over (so you are holding it the standard way) and flip the patties onion side down. Use the spatula and tongs or a fork to tuck any stray onion slices mostly under the patties."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the cheese and buns: Add a slice of cheese to each patty. Place the top half of each burger bun on top of the cheese, and place the bottom half of each bun on top of the top bun, split-side down. Cover the pan or griddle with a large domed lid, a large overturned saucepan or a clean folded dish towel. (To avoid a fire, make sure the edges of the dish towel do not hang over the skillet or griddle. If cooking on an outdoor grill, just close the lid.) Continue cooking until the onions are browned along the edges and the buns are steamed through, 1 to 2 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, open the cover or lid. Remove the bottom burger bun halves to a serving platter. Add pickles and condiments as desired. (These burgers don’t typically need condiments.) Lift each burger from the skillet with the spatula and transfer to the bottom bun. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023331-oklahoma-onion-burgers"}