{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Soufflés", "description": "While soufflés are delicate and sensitive creations, they're also fundamentally simple, consisting of a flavored base that's lightened with beaten egg whites. The keys to success are beating the egg whites properly so they're stable and voluminous, working quickly to prevent their collapse, and thoroughly greasing the ramekins so the mixture can rise unencumbered in the oven.", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2022/10/19/dining/19souffle4/merlin_214343490_7ef7235a-71e8-4e65-84cf-12bb52b4c7ec-mediumThreeByTwo440.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dessert", "keywords": "bittersweet chocolate, egg dish, egg whites, egg yolks", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 212}, "recipeIngredient": ["Unsalted butter, at room temperature, for ramekins", "7 tablespoons/87 grams granulated sugar, plus more for sprinkling and for ramekins", "3 large egg yolks", "1/3 cup/80 grams whole milk", "2 tablespoons brewed coffee", "2 tablespoons all-purpose flour", "2 tablespoons Dutch-processed cocoa powder, sifted if lumpy", "4 ounces/113 grams bittersweet chocolate (70 percent cacao), coarsely chopped", "1 teaspoon vanilla extract", "5 large egg whites, at room temperature", "3/4 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange an oven rack in the center position and heat the oven to 425 degrees. Brush the bottoms and sides of 4 (6-ounce) ramekins with room-temperature butter, using straight, upward strokes along the sides and brushing all the way to the rim. Sprinkle the ramekins with sugar and shake to coat, then tap out the excess. (The upward strokes and sugar give the batter something to cling to as it rises.) Set aside ramekins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a medium saucepan with about 1 inch of water and bring to a simmer over medium heat, then reduce the heat to maintain a simmer. In a medium heatproof bowl, whisk together 3 tablespoons/37 grams of the sugar and 2 of the egg yolks until combined, then whisk more vigorously until the mixture is pale, light and thick, about 1 minute. Slowly stream in the milk, whisking constantly, followed by the coffee. Add the flour and cocoa powder, and whisk until the mixture is smooth and lump-free, then set the bowl over the saucepan, taking care that the bottom of the bowl doesn’t touch the water. Cook the mixture over the double boiler, whisking constantly, until it’s the consistency of thin pancake batter, faintly holds the marks of the whisk and any foam has subsided, about 5 minutes. Remove the bowl from the saucepan (careful: It’s hot)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chopped chocolate to the bowl and whisk briefly to incorporate it, then set aside the bowl for a few minutes to allow the chocolate to melt. Slowly whisk the mixture until smooth, then whisk in the remaining egg yolk and the vanilla extract. Set aside the bowl to cool slightly. (Don’t let it cool completely, or the chocolate will harden.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large metal or glass bowl — avoid plastic, as it can hold on to fat residue — combine the egg whites and salt, and use a hand mixer to beat on medium-low speed until the whites are broken up and frothy, about 20 seconds. Increase the speed to medium-high and continue to beat until the whites are foamy and opaque, about 30 seconds, then gradually add the remaining 4 tablespoons/50 grams sugar in a slow, steady stream, beating constantly. Once all the sugar is added, continue to beat just until you have dense, glossy egg whites that hold a stiff peak. Try not to overbeat, or the whites will take on a dry, grainy texture and be difficult to incorporate into the chocolate base."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape about one-third of the beaten egg whites into the bowl with the chocolate mixture, and whisk quickly and briefly to combine. Using a large flexible spatula and broad, decisive strokes, fold in the remaining beaten egg whites in 2 additions, scraping the bottom and sides of the bowl and rotating the bowl as you work, until the mixture is almost entirely streak-free."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently scrape the batter into the prepared ramekins, dividing it evenly and using all of it. (The ramekins should be filled to the very top.) Tap the ramekins delicately on the work surface to help settle the batter, then, working one ramekin at a time, use a small offset spatula or a butter knife to smooth the surface and, working over the batter bowl, scrape off any excess batter so that it’s level and flush with the very top of the ramekin. If necessary, transfer any excess batter from one ramekin to another to ensure they're all filled to the very top. Repeat until all the ramekins are leveled. (At this point you could have a small amount of batter left over — if so, discard it.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly sprinkle the surfaces of the batter with a thin, even layer of sugar, then, working with one ramekin at a time, run a clean thumb around the inside of the rims to wipe away a ring of batter and expose the inner lip of the ramekins all the way around. (Use the natural indentation inside the ramekins as a guide for how deep to make the ring.) This will ensure that your soufflés rise straight upward and maintain level tops. Wipe away any streaks of batter from the rim and outsides of the ramekins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the ramekins on a sheet pan, spacing them evenly. Transfer the sheet pan to the oven, immediately reduce the oven temperature to 375 degrees and bake until the soufflés are risen, firm and springy to the touch across the surfaces, and have a slight wobble, 15 to 20 minutes. Remove the soufflés from the oven and serve immediately."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Chocolate Soufflés", "description": "While soufflés are delicate and sensitive creations, they’re also fundamentally simple, consisting of a flavored base that’s lightened with beaten egg whites. The keys to success are beating the egg whites properly so they’re stable and voluminous, working quickly to prevent their collapse, and thoroughly greasing the ramekins so the mixture can rise unencumbered in the oven.", "thumbnailUrl": "https://static01.nyt.com/images/2022/10/19/dining/19souffle4/merlin_214343490_7ef7235a-71e8-4e65-84cf-12bb52b4c7ec-mediumThreeByTwo440.jpg", "uploadDate": "2023-01-10T16:31:30.548Z", "duration": "PT19M50S", "transcript": "", "contentUrl": "https://vp.nyt.com/video/2023/01/09/105393_1_CS-chocolate-souffle-CV_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023550-chocolate-souffles"}