{"@context": "http://schema.org", "@type": "Recipe", "name": "Salted Caramel and Peanut Butter Shortbread", "description": "Simple mix-ins of crushed hard caramels and smooth peanut butter create a soft baked cookie that is simple and distinct. The crushed candies melt when baked creating craters filled with chewy caramel, and the peanut butter swirl adds a nutty depth. This cookie will appeal to anyone who enjoys their dessert with a salty pop. You can prepare these ahead of time; just scoop and refrigerate the dough on a sheet pan, then bake the chilled dough to order, sprinkling with a little flaky salt to finish. (This cookie is one of six cookies that you can make with this <a href=\"https://cooking.nytimes.com/recipes/1023720-butter-shortbread-dough\">Butter Shortbread Dough</a> recipe. If you make that dough, you can make a double batch of the Caramel Peanut Butter Shortbread or try any of the other <a href=\"https://www.nytimes.com/interactive/2022/12/04/dining/holiday-shortbread-cookie-dough-recipe.html\">five recipes</a>.)", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2022/12/07/multimedia/YK-caramel-peanut-butter-shortbread-1-1b50/YK-caramel-peanut-butter-shortbread-1-1b50-articleLarge-v3.jpg", "totalTime": "PT45M", "recipeYield": "About 3 dozen cookies ", "recipeCuisine": "", "recipeCategory": "snack, dessert", "keywords": "christmas, christmas cookie, egg yolks, freezer friendly, make-ahead, peanut butter, shortbread", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 605}, "recipeIngredient": ["1 cup/230 grams unsalted butter, at room temperature, plus more for pan", "1 cup/205 grams granulated sugar", "1 teaspoon kosher salt (such as Diamond Crystal)", "1 large egg yolk", "2 1/2 cups/320 grams all-purpose flour (see Tip)", "1 (5 1/2-ounce) bag caramel hard candies ", "1/4 cup natural creamy peanut butter", "1 tablespoon flaky salt, for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Line a sheet pan with parchment paper. Make the dough: In the bowl of a stand mixer fitted with the paddle attachment, combine the butter, sugar and salt. Beat on low speed until incorporated and smooth, scraping down the sides of the bowl as needed, about 3 minutes. (Do not beat until fluffy, you don’t need to incorporate air into the dough.) Add the yolk and mix until just combined. Turn the mixer off and scrape down the sides of the bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour to the bowl all at once and scrape the bottom and sides of the bowl. Turn the mixer speed to low and beat until flour is fully incorporated, scraping the bowl again if needed, about 30 seconds. The dough will be in large crumbles. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "(If you’re starting with a half batch of <a href=\"https://cooking.nytimes.com/recipes/1023720-butter-shortbread-dough\">Butter Shortbread Dough</a>, start here.) Crush the hard caramels: Place the unwrapped caramels in a freezer bag, wrap it in a kitchen towel, then hit the wrapped bag repeatedly with a rolling pin or the bottom of a wine bottle until the caramels are crushed into smaller pieces. You should end up with about 3/4 cup crushed caramels. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the crushed caramels to the dough crumbles and mix, using your fingers to incorporate into the dough. Stir in the peanut butter with a spatula until it’s streaked through the dough but not fully incorporated. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a 1/2-ounce cookie scoop, an ice cream scoop or a tablespoon measure to portion the dough right onto the prepared baking sheet, spacing at least 1 inch apart. At this point you can refrigerate the scooped dough, well wrapped, for up to 3 days, or chill, then freeze in resealable plastic bags for up to one month. Bake until the cookies are light golden brown at the bottom edges, rotating once halfway through baking, 12 minutes. (If baking from frozen, you may need to add a minute or two to the baking time.) Sprinkle cookies with salt after removing from the oven."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023717-salted-caramel-and-peanut-butter-shortbread"}