{"@context": "http://schema.org", "@type": "Recipe", "name": "Cassoulet-Style Lamb Shanks and Beans", "description": "This is not a full-blown <a href=\"https://cooking.nytimes.com/recipes/1018520-cassoulet\">cassoulet</a>, chock-full of sausages and duck confit, but it is so satisfying nonetheless. It takes a couple of days to put together because you have to cook the lamb and cook the beans, combine them, and bake them twice. The result is a dish of enchanting deep flavor. (Simmering the seasoned lamb results in a delicious broth.)", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2022/12/07/multimedia/07tanisrex2-cassoulet-1-1b14/07tanisrex2-cassoulet-1-1b14-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, beans, meat, project, main course", "keywords": "bread crumbs, clove, lamb shank, make-ahead, party, white beans, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 119}, "recipeIngredient": ["1 1/2 pounds dried white beans, such as cannellini or great Northern", "2 whole cloves", "2 small bay leaves", "1 large onion, peeled and halved", "Salt", "4 bone-in lamb shanks (about 5 pounds total)", "Salt and freshly ground black pepper", "2 whole cloves", "2 small bay leaves", "1 large onion, peeled and halved", "4 medium carrots, peeled", "1 whole head garlic, cloves separated but unpeeled, plus 1 teaspoon minced garlic", "1 strip of orange peel", "1 tablespoon chopped rosemary", "1 tablespoon chopped thyme", "2 cups coarse dry bread crumbs", "3 tablespoons extra-virgin olive oil, plus more for drizzling", "1/4 cup chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the beans: Pick out and discard any debris, then rinse beans and put them in a large pot. Use a clove to pin a bay leaf to each onion half and add to the pot. Add about 8 cups water to cover the beans, set the pot over high heat and bring to a boil. Turn heat to low and let beans simmer until tender — cooked through but firm — 1 hour to 1 1/2 hours, adding a large pinch of salt at the 30-minute mark. As beans cook, add water as necessary, keeping the liquid about an inch above the beans. Let beans cool in their own liquid. Taste for salt and adjust as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the lamb: Season the shanks quite generously all over with salt and pepper. Let sit for an hour at room temperature or overnight in the fridge. Put the shanks in a large pot. Use a clove to pin a bay leaf to each onion half, and add to the pot. Add carrots and garlic cloves along with the orange peel, and fill the pot with about 8 cups water. Set the pot over high heat and bring to a boil. Turn heat to low and let simmer. Skim off any foam, then partly cover the pot. Cook until lamb is very tender and begins to fall from the bone when probed with a paring knife, about 1 hour 15 minutes to 1 1/2 hours. Leave lamb to cool in the broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Once the lamb is cool enough to handle, strain the broth, taste and adjust seasoning, and reserve. Tear lamb into rough strips, about 1 inch by 2 inch. Chop the cooked carrots and onion, and add to the lamb. (Discard the garlic.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the beans, reserving any liquid for future soups, and add them to a 9-by-13-inch baking dish. Add the reserved lamb and vegetables, minced garlic and half of the rosemary and thyme, and mix with the beans. Taste and season. Push down on the mixture so it lays evenly, and add 2 cups lamb broth. (Beans should be just a little soupy before cooking, but not drowning.) Cover dish tightly with foil, place on a baking sheet and bake for about 1 hour, until most of the liquid has been absorbed and the dish bubbles at the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix together the remaining rosemary and thyme, bread crumbs and 3 tablespoons olive oil. Season lightly with salt and pepper. Sprinkle crumbs evenly over beans and lamb, then pat them down over the surface of the lamb and vegetables so they moisten a bit. Drizzle over about 2 more tablespoons olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 1 hour more, until the top is golden and the dish bubbles at the edges. (You may have to add up to 1 to 2 cups more lamb broth if the beans seem dry.) Sprinkle with parsley and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023725-cassoulet-style-lamb-shanks-and-beans"}