{"@context": "http://schema.org", "@type": "Recipe", "name": "Calabrian Meatballs", "description": "Featured in my cookbook, “Heirloom Kitchen: Heritage Recipes and Family Stories from the Tables of Immigrant Women” (Harper Design, 2019), this polpette recipe comes from my grandmother’s Calabrian kitchen. The sugo di pomodoro, or tomato sauce, delivers complex flavor, serving as the poaching liquid for the delicate meatballs and as an essential ingredient in the meatballs themselves, adding both flavor and juiciness. Lightened further with milk and Italian bread crumbs, the meatballs are incredibly tender, bursting at the touch of your fork. The recipe yields a crowd-serving portion, perfect for Sunday dinner, but also freezes beautifully. Though the sauce may be tossed with your favorite pasta, this dish is the ideal version of a traditional platter of meatballs, covered in sauce and garnished with cheese and basil.", "author": {"@type": "Person", "name": "Anna Francese Gass"}, "image": "https://static01.nyt.com/images/2022/09/16/dining/afg-calabrian-meatballs/merlin_213230247_8a07598f-5397-4d9b-a3d3-ba86f34433e0-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "About 16 meatballs and 7 cups sauce", "recipeCuisine": "italian", "recipeCategory": "dinner, meatballs, main course", "keywords": "basil, crushed canned tomato, freezer friendly, ground beef, ground pork, ground veal, make-ahead, pecorino romano", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 830}, "recipeIngredient": ["10 fresh basil leaves", "½ cup extra-virgin olive oil", "2 garlic cloves, peeled and lightly smashed", "1 teaspoon red-pepper flakes (optional)", "2 (28-ounce) cans crushed tomatoes (8 cups)", "2 tablespoons tomato paste", "1 tablespoon kosher salt (such as Diamond Crystal)", "1 teaspoon freshly ground black pepper", "½ pound ground pork", "½ pound ground veal", "½ pound ground beef (preferably 15-percent fat)", "1 cup finely grated Pecorino Romano cheese, plus more for serving", "1 cup seasoned Italian bread crumbs ", "½ cup whole milk", "½ cup tomato sauce (reserved from recipe above), cooled", "2 large eggs, beaten", "1 tablespoon chopped fresh parsley leaves (optional)", "1 tablespoon kosher salt (such as Diamond Crystal)", "1 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sauce: Tear 5 basil leaves in half; reserve the rest. Combine the torn basil, olive oil, garlic and red-pepper flakes (if using), in a small saucepan over very low heat for 10 minutes, allowing the basil and garlic to steep in the oil. (Do not let the garlic get beyond medium brown in color.) Remove from the heat, strain the oil, discard the solids and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, combine the crushed tomatoes, tomato paste, salt and pepper with 2 cups water and the infused oil. Bring to a boil over medium-high heat, then immediately reduce to a simmer. Remove ½ cup of the sauce for the meatballs, setting aside to cool. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Partially cover the pot and simmer the sauce, undisturbed, while you prepare the meatballs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, hand mix all the meatball ingredients (including the reserved ½ cup sauce) until combined. (The mixture will be quite soft.) Wet your hands and pinch off approximately ¼-cup portions and roll them into balls between your palms. (They should each be about 2 ¼-inches wide.) Place each meatball on a baking sheet and repeat with the remaining mixture, making about 16 meatballs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once all the meatballs have been rolled, carefully drop them into the simmering sauce. If the pot seems too full, shimmy the pot back and forth gently to make more room to simmer the meatballs in an even layer. Do not stir, as the meatballs will break apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the pot partially with a lid and gently simmer the meatballs in the sauce for 1 hour (or up to 2 hours) until they are firm and cooked through. Carefully remove the meatballs to a plate, adding spoonfuls of sauce, or transfer the meatballs and sauce to a shallow serving bowl. Chop the remaining basil and sprinkle on top, and garnish with more grated Pecorino."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023469-calabrian-meatballs"}