{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetarian Tamale Pie", "description": "Not to be confused with a Latin American tamale, tamale pie is a comforting retro casserole made from ground beef chili that is topped with cornbread batter and then baked. This vegetarian version relies on vegetables and beans instead of meat. Fresh green chiles and onions are broiled until charred to deepen their flavor, then puréed with tomatoes to make a complex sauce for the beans. The cornbread topping — crisp at the surface, tender underneath — gets an optional handful of Cheddar folded into the mix for added verve. Serve this one-pot meal on its own or with a creamy dollop of sour cream or yogurt on the side.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2023/02/01/multimedia/27apperex-hmpw/25apperex-hmpw-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, main course", "keywords": "black bean, casseroles, cilantro, jalapeño, poblano, red onion, scallion, sour cream, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 50}, "recipeIngredient": ["1 large red or white onion, halved", "2 jalapeños, halved lengthwise and seeded (if desired)", "1 poblano or green bell pepper, sliced in half lengthwise, seeds removed", "2 tablespoons extra-virgin olive oil, plus more for brushing", "1 3/4 teaspoons kosher salt (such as Diamond Crystal), plus more as needed", "1 (28-ounce) can whole plum or diced tomatoes", "3 fat garlic cloves, finely grated or minced", "2 tablespoons mild or hot chili powder, more as needed", "2 teaspoons dried oregano", "1 3/4 teaspoons ground cumin", "3 (15-ounce) cans black or pinto beans, drained and rinsed", "1 cup chopped fresh cilantro leaves and tender stems (optional)", "3/4 cup/135 grams fine cornmeal", "2 tablespoons all-purpose flour", "1 1/2 teaspoons baking powder", "1/2 teaspoon kosher salt (such as Diamond Crystal)", "1 large egg, at room temperature", "1/3 cup/80 grams sour cream or whole-milk yogurt, plus more for serving", "1/4 cup/57 grams unsalted butter, melted and cooled", "2 teaspoons honey", "2 scallions, whites and greens thinly sliced, plus more for serving", "1 cup grated Cheddar (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chili: Move a rack as close to the heating element as possible and heat the broiler. Cover a baking sheet with foil. Finely dice half of the onion and set aside for later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice remaining onion half into 1/2-inch-thick half-moons and arrange on the prepared baking sheet. Place jalapeños and poblano next to onions, cut sides down. Lightly brush vegetables with oil and sprinkle with a pinch of salt. Broil 2 to 4 minutes, until vegetables are charred on one side. (If the chiles are small, they will be charred after 1 to 2 minutes.) Flip vegetables and broil until the other side is charred, 1 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pan to a rack until cool enough to handle, then stem the peppers. Transfer charred vegetables and any accumulated juices to a blender (or use a bowl and immersion blender). Add canned tomato and 1/4 teaspoon salt, and blend to a coarse purée. You can make this up to 4 days ahead, and store in the refrigerator until needed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. In a large Dutch oven, heat the 2 tablespoons olive oil over medium-high. Add diced onion and sauté until lightly browned, 6 to 9 minutes. Add garlic and cook until fragrant, about 1 minute. Stir in chili powder, oregano, remaining 1 1/2 teaspoons salt and cumin, and cook until spices darken, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add beans and the reserved tomato purée, and let mixture simmer until thick like a chili, 10 to 15 minutes. Stir in cilantro, if using. Taste and add more salt and chili powder, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chili simmers, prepare the cornbread: In a medium bowl, whisk together cornmeal, flour, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together egg, sour cream, butter and honey. Whisk egg mixture into cornmeal mixture until combined. Fold in scallions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread cornbread topping over the chili, then top with grated cheese, if using. Bake, uncovered, until cornbread is golden brown, 20 to 25 minutes. Serve hot or warm, topped with sour cream and more scallions."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023880-vegetarian-tamale-pie"}