{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach-Artichoke Lasagna", "description": "Inspired by the artichoke slice at Artichoke Basille’s Pizza in New York City, this white sauce lasagna is a dreamy multilayered dinner. Frizzling chopped canned artichoke hearts in olive oil reduces their water content, thereby concentrating their earthy, buttery flavor. What binds the dish together is a nutmeg-rich béchamel sauce that makes everything taste comforting and familiar. Cottage cheese in place of the more traditional ricotta nixes any potential for the grainy dryness that plagues so many lasagnas. Layering this creamy, saucy wonder in an 8-inch square pan leaves you with the perfect amount of leftovers for when you want some as a snack — a snacking lasagna, if you will.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/04/26/dining/EK-spinach-artichoke-lasagna1/merlin_205978074_4b8f8b5a-8508-4d55-9e77-1740c9181a59-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, main course", "keywords": "artichoke, lasagna, spinach, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1536}, "recipeIngredient": ["1/4 cup olive oil", "1 (14-ounce) can artichoke hearts, coarsely chopped and well drained", "1 (5-ounce) package baby spinach", "Salt and black pepper", "4 tablespoons unsalted butter", "1/4 cup all-purpose flour", "4 cups half-and-half (or 2 cups each whole milk and heavy cream)", "Freshly grated nutmeg", "12 dry lasagna noodles (10 to 12 ounces)", "8 ounces cottage cheese (heaping 3/4 cup)", "1/2 cup grated Parmesan (2 ounces)", "1 large egg", "1 cup shredded low-moisture mozzarella cheese (4 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Boil a kettle of water (an electric kettle works great here)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat a medium saucepan over medium-high. Add the olive oil and artichoke hearts and cook, stirring occasionally, until the artichoke hearts fall apart, become jammy and start to brown at the edges, 10 to 15 minutes. Add the spinach, season with salt and pepper, and stir until considerably wilted, 2 to 3 minutes. Transfer to a large bowl and return the saucepan to the stove (no need to wash it out)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the béchamel sauce: In the saucepan, melt the butter over medium heat. Whisk in the flour and cook, whisking constantly until smooth, 1 to 2 minutes. Still whisking constantly, slowly add the half-and-half. Raise the heat to high and bring to a simmer, whisking all the while, then immediately reduce the heat to continue simmering, now whisking occasionally, until the sauce thickens to the consistency of gravy, 10 to 20 minutes. Season generously with salt, pepper and nutmeg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half of the béchamel to the bowl with the artichokes. Stir to combine and cool slightly, for about 15 minutes. While the mixture cools, place the lasagna noodles in a large high-sided pan or dish, pour over the recently boiled water from the kettle and let soak until the noodles are softened but not soggy, about 15 minutes. Add the cottage cheese, Parmesan and egg to the artichoke mixture, season with salt and pepper and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the lasagna: In an 8-inch square baking pan or dish, add enough béchamel to thinly coat the bottom. Put down a single layer of lasagna noodles, about 3 noodles, letting the ends rise up the edges of the pan. Spread half of the artichoke mixture evenly over the noodles. Turn the pan 90 degrees and put down another layer of lasagna noodles, again pressing the ends up against the edges of the pan. Spread half of the béchamel evenly over the noodles. Repeat these layers once more with the remaining lasagna noodles, artichoke mixture and béchamel, ending with the béchamel. Evenly sprinkle the mozzarella on top. (At this point, you can cover the lasagna and refrigerate it for up to 24 hours if not baking right away.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the lasagna until the sauce is bubbling at the edges (especially in the corners of the pan), and the mozzarella and the exposed ends of the noodles are golden brown and crispy, 15 to 20 minutes. (Add more time if baking directly from the refrigerator.) Let cool for at least 30 minutes before slicing so that slices won’t collapse when transferred to plates."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023140-spinach-artichoke-lasagna"}