{"@context": "http://schema.org", "@type": "Recipe", "name": "Honey Cake ", "description": "This Hungarian honey cake is deeply flavored with ginger, cardamom, cloves and cinnamon. The dough is more like a gingerbread biscuit than a tender sponge cake; it softens as it sits. It’s best made at least a day in advance, resting until the icebox-like crust absorbs its sweet surrounding layers of filling. The buttery, vanilla-scented filling is so pleasant to the tongue — but so rich you may want to cut small cake slices. Hungarian honey cake was popular before the Holocaust, but sadly this version was largely lost with the cooks in concentration camps. It’s been adapted in the United States by survivors and other family members using Cream of Wheat filling, which resembles the European gruel made with semolina or hard wheat flour, and enriched with lots of butter. This special cake brings back the memory of their former lives.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2022/09/14/dining/14cakerex/merlin_212255847_32432825-d209-4d22-b677-70225761eaaa-articleLarge.jpg", "totalTime": "P1DT5H30M", "recipeYield": "1 (9-inch) cake ", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "cardamom, ground cinnamon, ground coriander, ground ginger, honey, layer cake, plan-ahead, rosh hashana", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 422}, "recipeIngredient": ["4 cups/960 milliliters milk or soy milk ", "1 cup/176 grams Original 2 1/2-Minute Cream of Wheat", "2 teaspoons vanilla extract", "1 1/2 cups/340 grams unsalted butter, cut into chunks  ", "1 1/4 cups/252 grams granulated sugar", "1/4 teaspoon fine salt", "1 1/2 cups/454 grams thick, chunky apricot or sour cherry preserves", "1 cup/201 grams granulated sugar", "1/4 cup/60 milliliters milk or soy milk", "3 tablespoons dark wildflower honey", "2 tablespoons unsalted butter", "3 large eggs ", "4 1/4 cups/544 grams all-purpose flour, plus more as needed", "1 teaspoon baking soda", "1 1/2 teaspoons ground cinnamon", "1 1/2 teaspoons ground ginger ", "3/4 teaspoon ground cloves", "3/4 teaspoon ground cardamom", "3/4 teaspoon ground coriander", "1/4 teaspoon fine salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: In a medium pan over medium heat, bring the milk to a simmer, then whisk in the Cream of Wheat. Cook, stirring constantly, until the mixture thickens, about 2 ½ minutes. Remove from heat and stir in the vanilla extract. Let cool slightly, then stir in the butter, sugar and salt. Let cool, then refrigerate for at least 3 hours and up to overnight. Once you’re ready to assemble the cake, bring the filling back to room temperature, about 20 minutes. Beat in a stand mixer with a paddle attachment or with a spoon until fluffy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While filling chills, make the torte: Warm the sugar, milk, honey and butter in a small saucepan over low heat, stirring well until sugar is dissolved, butter is melted and ingredients are thoroughly combined. Remove from heat and let cool for a few minutes until lukewarm, then pour into a stand mixer. Add the eggs and mix with the paddle attachment on medium just until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together the 4 ¼ cups flour with the baking soda, cinnamon, ginger, cloves, cardamom, coriander and salt, then add to the bowl of the mixer. Mix on medium-low until a smooth, not sticky, dough is formed, adding more flour if needed, a few teaspoons at a time. Using a dough cutter, divide the dough into 4 equal balls. Set on a plate and cover with a towel; let rest at room temperature for 1 hour to allow the gluten to relax."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Lightly dust each ball of dough all over with flour before placing it in the middle of a sheet of parchment paper. Using a lightly floured rolling pin, roll the dough into approximately a 10-inch circle, about ⅛- to ¼-inch thick. Cut out a circle using a sharp knife and a 9-inch-round dinner plate or baking pan. Save the scraps of dough, pushing them to the sides of the parchment paper, away from the circle. Transfer the paper with the circle and the scraps to a baking sheet and repeat with the remaining dough balls. You can use 4 separate baking sheets (or use 2 baking sheets at a time and then repeat)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 2 sheets at a time until the top of each round is slightly puffed and set, about 7 to 10 minutes. (Watch carefully, as they can burn quickly.) Let cool, then pulverize the scraps in a food processor or blender. Reserve the crumbs in an airtight container to decorate the cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the cake: Tear a sheet of parchment into several wide strips and use the strips to line the bottom of a serving plate in a circular pattern. (These will be removed before serving and will help keep the plate clean while you decorate the cake.) Place the first baked cake layer on top of the parchment and spread with 1 ½ cups of filling. Top with a second cake layer and then spread the apricot or sour cherry preserves on top, leaving ½-inch border uncovered along the perimeter. Top with a third cake layer and spread with 1 ½ cups filling. Add the final cake layer, then spread 1 ½ cups filling on top and the remaining 1 ½ cups filling on the sides. Pat the reserved crumbs over the top and sides, just enough to lightly cover, reserving the rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cake stand at room temperature, covered with aluminum foil or plastic wrap, for at least 24 hours — or, ideally, 2 days. (Refrigerating the cake would cause the frosting to firm up, preventing the cake layers from soaking it up and softening as they are intended to do.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To enjoy, sprinkle more of the reserved crumbs all over the cake to add texture. Carefully slide out and discard the parchment paper strips before cutting into slices to serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023448-honey-cake"}