{"@context": "http://schema.org", "@type": "Recipe", "name": "Kung Pao Shrimp", "description": "The name of this dish is now written in English as gong bao shrimp, and this recipe takes inspiration from the American Chinese versions that come from the Sichuan Province of China. Here, flashes of chile heat shine in a glossy swirl of a salty, sour and sweet sauce. With a confetti blend of shrimp, peppers and peanuts, each mouthful is a little spicy and chewy, savory and crisp. The deep malty tang comes from Chinkiang vinegar, a jet-black condiment from China that is traditionally fermented from grains and aged in clay. It’s key to this dish and also delicious for dipping dumplings, saucing noodles and dressing vegetables. (Balsamic vinegar, similarly fermented and aged from grape juice in barrels, is a fun, fruity substitute.) With both vegetables and protein, this one-wok stir-fry is a complete meal with steamed rice.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/07/27/dining/22korex1-shrimp/merlin_210310542_ee8ce89f-bc6f-4038-87ec-0b9951ca4b1b-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "chinese", "recipeCategory": "weeknight, seafood, main course", "keywords": "bell pepper, Chinkiang vinegar, shrimp, soy sauce", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 491}, "recipeIngredient": ["1 pound peeled and deveined medium shrimp, thawed if frozen", "2 tablespoons Shaoxing wine or dry sherry", "2 teaspoons cornstarch", "Salt", "2 tablespoons granulated sugar", "3 tablespoons soy sauce", "2 tablespoons Chinkiang (black) vinegar or balsamic vinegar", "1/2 teaspoon Sichuan peppercorns, coarsely ground, plus more to taste", "1 red or orange bell pepper", "5 garlic cloves", "1/4 cup neutral oil, such as grapeseed", "1/2 cup unsalted roasted peanuts", "3/4 cup small dried red chiles (23 grams; see Tip)", "3 large scallions, cut into 1/2-inch lengths"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the shrimp, Shaoxing wine, 1 teaspoon cornstarch and a pinch of salt in a bowl until the shrimp are evenly coated. Let stand while you prepare the other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the sugar, soy sauce, vinegar, Sichuan pepper and remaining teaspoon cornstarch in a separate bowl. Dice the bell pepper and thinly slice the garlic. Have all your ingredients ready next to the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a wok or large skillet over medium-high heat for 15 seconds. Add the peanuts and stir until browned in spots, 30 to 60 seconds. Add the bell pepper and garlic, and sprinkle with salt. Cook, stirring, until the pepper is bright and the garlic starts to become translucent, about 30 seconds. Add the chiles and stir well, then add the shrimp with its marinade. Cook, stirring occasionally, until the shrimp are curled and just opaque, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the scallions and stir until glossy, about 15 seconds, then add the sauce. Cook, stirring, until the sauce thickens and coats everything evenly, about 1 minute. If any of the starchy sauce has stuck to the bottom of the pan, add a splash of water and scrape up any browned bits. Taste and add more Sichuan pepper if you’d like. Immediately transfer to a dish and serve hot."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023350-kung-pao-shrimp"}