{"@context": "http://schema.org", "@type": "Recipe", "name": "Duchess-Style Twice-Baked Potatoes", "description": "Unlike American-style twice-baked potatoes, which are laden with cheese and sour cream, these potatoes, inspired by the French dish pommes duchesse, get their richness primarily from egg yolks. While you can scoop the filling back into the skins with a spoon, piping it with a star-tipped pastry bag makes the potatoes especially fancy.", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2022/11/16/dining/10potatoesrex1-twice/merlin_214834056_b3dced0c-bba0-4e6d-92bf-8b538cc22e81-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "vegetables, side dish", "keywords": "egg yolks, make-ahead, milk, russet potatoes, thanksgiving, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 161}, "recipeIngredient": ["6 medium russet potatoes (about 3 pounds), scrubbed", "3/4 cup whole milk", "1/2 cup unsalted butter", "1/8 teaspoon ground nutmeg", "Kosher salt and freshly ground black pepper", "4 large egg yolks, at room temperature", "Sweet paprika, for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange an oven rack in the center position and heat the oven to 425 degrees. Bake the potatoes directly on the oven rack until the flesh is soft and tender and the skins are crispy, 1 hour to 1 hour 15 minutes. Remove the potatoes from the oven and let them sit at room temperature just until they’re cool enough to handle (they should still be hot). Leave the oven on."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine the milk and butter in a large saucepan and bring to a simmer over medium-high heat, then reduce the heat to the lowest setting just to keep the mixture warm. (It should not be bubbling.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut 2 of the still-hot potatoes in half lengthwise and carefully scoop the flesh into a food mill, ricer or drum sieve, taking care to keep the skins intact. Set the skins aside, then mill, rice or press the flesh into the saucepan. Repeat with the remaining potatoes in 2 more batches, reserving 8 skins total (you can snack on or discard the 4 other skins)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the nutmeg to the saucepan and generously season the potato mixture with salt and pepper. Remove the saucepan from the heat and gently fold until the mixture is smooth, then taste and adjust the seasoning. Gently stir in the egg yolks until combined. Set the saucepan aside and let the potato mixture cool completely to room temperature, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the 8 potato skins on a rimmed baking sheet, spacing them evenly. For a fancy (but optional) look, scrape the potato mixture into a pastry bag fitted with a large open star tip and pipe the mixture into the skins, dividing evenly and using all of the mixture so that each skin is mounded with filling. Alternatively, spoon the potato mixture into the skins and smooth the tops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly dust the top of each potato with paprika, then transfer to the oven and bake until the surfaces are lightly browned in spots, 15 to 20 minutes. Transfer to a platter and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023634-duchess-style-twice-baked-potatoes"}