{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Tortilla Soup", "description": "Tortilla soup, or sopa Azteca or sopa de tortilla, is a classic central Mexican dish. It’s often characterized by a brothy chicken base flavored with puréed roasted tomatoes, chiles and garlic, and is topped with fried tortillas. In this weeknight-friendly version, tomatoes, onion, garlic and chile are charred under the broiler, on a foil-lined sheet pan for easy cleanup. You can customize the recipe by adding sliced zucchini or epazote leaf with the chopped tomatoes, or stirring in fresh or frozen corn kernels at the end. For a vegetarian version, use cooked black beans instead of chicken. (You can also <a href=\"https://cooking.nytimes.com/recipes/1023406\">click here</a> for the slow-cooker version of this recipe.)", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2022/08/18/dining/sdg-chicken-tortilla-soup/merlin_211327722_5d145eb7-1c54-443f-9738-d6cb06bd1e9e-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, poultry, soups and stews, main course", "keywords": "boneless chicken thighs, jalapeño, onion, plum tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 464}, "recipeIngredient": ["5 large plum tomatoes (about 1 pound), cored and halved", "1 white onion, peeled and quartered", "12 ounces cherry tomatoes (about 2 heaping cups)", "2 jalapeños, stemmed and halved, 1 seeded and de-ribbed", "8 garlic cloves (unpeeled)", "1/4 cup vegetable oil", "1 1/2 teaspoons coarse kosher salt, plus more to taste", "2 tablespoons tomato paste", "2 1/2 teaspoons ground cumin", "2 teaspoons dried oregano", "1 teaspoon onion powder", "1 teaspoon garlic powder", "1½ pounds boneless, skinless chicken thighs", "2 carrots, peeled, halved lengthwise and thinly sliced", "6 cups chicken broth or stock", "1 avocado, peeled, pitted and cubed", "1 lime", "Tortilla chips", "Any combination of hot sauce, cilantro, queso fresco, for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a broiler with a rack 4 to 6 inches from the heat source. Line a sheet pan with foil and arrange the plum tomatoes on it, cut sides up. Add the onion, cherry tomatoes, jalapeños and garlic, distributing them evenly, then broil for 15 minutes, checking and rotating the pan every 5 minutes to ensure the vegetables char evenly. (You want the vegetables to be blackened in many spots, slumped and sizzling. Many of the cherry tomatoes will have burst.) Let the vegetables sit 1 or 2 minutes, until just cool enough to handle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm the vegetable oil in a large pot or Dutch oven over medium-high. Transfer the charred onion to a cutting board, roughly chop it, and add it to the pot, along with the salt. Cook, stirring occasionally, until softened, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, discard the garlic skins then chop the garlic, jalapeños and plum tomatoes. Lift two sides of the foil and tip the cherry tomatoes and any juices into a bowl; set aside for the salsa."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chopped garlic, jalapeño and plum tomatoes to the pot, and cook, stirring often, until slightly reduced and glossy, about 2 minutes. Add the tomato paste, cumin, oregano, onion powder and garlic powder, and cook, stirring constantly, until toasted and fragrant, 1 to 2 minutes. Add the chicken thighs, carrots and broth, and scrape the bottom of the pot to loosen any browned bits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat to high, cover the pot and let the soup come to a boil. Uncover the pot, reduce the heat to medium-high for a medium-brisk simmer, and cook, stirring once or twice, until the chicken and carrots are tender, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, gently fold the avocado into the cherry tomatoes; add the juice of half the lime and season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a slotted spoon or tongs, transfer the chicken to a bowl. Coarsely shred and break up the meat with a fork, then add it back into the pot. Squeeze in the juice of the remaining half lime, and add more salt if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the soup in bowls topped with crushed tortilla chips and spoonfuls of the tomato-avocado salsa. Pass hot sauce, queso fresco and/or cilantro at the table, if desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023405-chicken-tortilla-soup"}