{"@context": "http://schema.org", "@type": "Recipe", "name": "New Mexico Breakfast Burritos", "description": "The breakfast burrito is to New Mexico what the bagel is to New York, or the </span><a href=\"https://cooking.nytimes.com/recipes/1020162-loco-moco\"><span>loco moco</span></a><span> is to Hawaii; they </span><span>are an important part of the state's culture</span><span>. While you can find variations of the burrito in New Mexico and beyond, the non-negotiables are flour tortillas, scrambled eggs and </span><a href=\"https://www.nytimes.com/2014/09/03/dining/a-roasted-green-chile-evokes-santa-fe.html\"><span>New Mexico green chiles</span></a><span>, a red chile sauce or both. (This variation is called “Christmas”). While wrapping eggs and other fillings in a tortilla likely goes back thousands of years, the breakfast burrito earned its place in New Mexican cuisine in the 1970s, when it was served handheld at the Albuquerque International Balloon Fiesta, and smothered with cheese and sauce at Tia Sophia’s, a restaurant in Santa Fe. To fit bacon, sausage, </span><a href=\"https://cooking.nytimes.com/recipes/1016915-slow-cooked-red-chile-turkey?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=1\"><span>carne adovada</span></a><span> or another protein, use less potato.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/09/15/dining/as-New-Mexico-Breakfast-Burritos/as-New-Mexico-Breakfast-Burritos-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 burritos", "recipeCuisine": "southwestern", "recipeCategory": "breakfast, brunch, main course", "keywords": "burrito, chile, egg, flour tortilla, potato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 333}, "recipeIngredient": ["6 large eggs", "Kosher salt (such as Diamond Crystal) and black pepper", "4 large (about 10-inch) flour tortillas", "6 tablespoons neutral oil (such as grapeseed or canola), plus more as needed", "15 to 16 ounces frozen shredded hash browns ", "1 small yellow onion, finely chopped", "4 ounces grated Cheddar or Monterey Jack cheese (about 1 cup)", "2 tablespoons unsalted butter", "1/2 cup roasted, chopped New Mexico green chiles (see Tip)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 300 degrees. In a medium bowl or measuring cup, whisk the eggs with 3/4 teaspoon salt; season lightly with pepper. Arrange the tortillas on a sheet pan; it’s OK if they’re overlapping or hanging off the pan. Set both aside while you cook the potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large (12-inch) nonstick skillet, heat 2 tablespoons oil over medium-high. Add half the hash browns and half the onion. Spread into a thin layer on the bottom and up the sides of the skillet. Use a spatula or fork to create a few holes in the hash browns to help steam escape for more browning. Season with salt and pepper. Cook until browned underneath, 3 to 5 minutes. Flip in large sections, add another tablespoon of oil, spread into a thin layer, and cook until browned on the other side, 3 to 5 minutes. If there are areas of the potatoes that are pale on top, flip them so they brown. (Taking your time here ensures the potatoes stay crisp.) Add more oil if the pan looks dry at any point. Divide the potato mixture between 2 tortillas in a line down the center, leaving a 1-inch border. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat step 2 with the remaining 3 tablespoons oil, plus the potatoes and onions, then divide them between the 2 remaining tortillas. Sprinkle the cheese over the potatoes and tortillas, then transfer to the oven to warm while you cook the eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, melt the butter over medium-low and swirl to coat. Pour in the eggs and cook without touching until the eggs around the edges of the pan are set, 30 seconds to 1 minute. Using a spatula or wooden spoon, fold and scrape across the pan to form big, fluffy curds, 1 to 2 minutes. Remove from heat. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the tortillas to plates or, for portable and/or make-ahead burritos, transfer to individual squares of parchment paper. Spoon the eggs in a line next to the potatoes, then add the chiles (about 2 tablespoons per tortilla). Working with one tortilla at a time, fold the tortilla’s short sides over the filling, then fold the bottom of the tortilla snugly up and over the filling. Tightly roll away from you until the entire burrito is secure. If using parchment, wrap tightly in parchment. Repeat with the remaining burritos and enjoy. The potatoes may start to get soggy, but the burritos will stay warm for about 20 minutes. (Alternatively, you can refrigerate the burritos for up to 24 hours and reheat in the microwave or oven.) "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023463-new-mexico-breakfast-burritos"}