{"@context": "http://schema.org", "@type": "Recipe", "name": "Custard Pie", "description": "Inspired by dan tat, small egg custard tarts popular in Cantonese dim sum, this pie is also reminiscent of American and European baked custards and flan from around the globe. The slick, jiggly vanilla filling is delicious for its comforting eggy flavor. It’s simple to whisk together, but if that whisking results in bubbles that pop and crater on top, simply cover them up with a dusting of confectioners’ sugar or ground dehydrated berries. The berries add a pop of color and a hint of fruitiness.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/11/13/dining/13PIESREX-custard/13PIESREX-custard-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "One 9-inch pie", "recipeCuisine": "", "recipeCategory": "pies and tarts, dessert", "keywords": "heavy cream, make-ahead, milk, pie, pie dough, vanilla extract, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 139}, "recipeIngredient": ["1 disk <a href=\"https://cooking.nytimes.com/recipes/1023573\">All-Butter Pie Crust</a>", "All-purpose flour, for rolling", "5 large eggs, at room temperature", "1 1/2 cups/365 grams whole milk", "1/2 cup/130 grams heavy cream", "2/3 cup/133 grams granulated sugar", "1/4 teaspoon fine sea or table salt", "2 teaspoons pure vanilla extract (see Tip)", "1/2 cup/10 grams freeze-dried strawberries or raspberries (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If the dough has been refrigerated for more than an hour, let sit at room temperature for 10 minutes. On a lightly floured surface, use a lightly floured rolling pin to roll the dough into a 12 1/2-inch round. Roll the dough up onto the pin, then unroll it over a standard (not deep-dish) 9-inch pie plate, centering it. Gently tuck and press it into the bottom and sides of the plate without stretching the dough. Fold the overhang of dough under itself along the rim so that the dough extends a little over the edge of the plate. If you’d like, crimp the edges of the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the dough has softened, refrigerate or freeze the dough until firm, about 30 minutes in the refrigerator or 10 minutes in the freezer. While the dough chills, position a rack in the lowest position in the oven and heat to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a fork to poke holes all over the bottom of the dough without piercing all the way through, if possible. Line the dough with a sheet of crumpled parchment paper. (Crumpling helps it lie flat against the dough.) Fill the lined dough to the top with pie weights, such as dried beans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake on the bottom rack until the edges are light golden brown and the sides look dry, 25 to 30 minutes. Remove the pie weights with the parchment and return the empty shell to the bottom rack. Bake until the bottom is golden, 5 to 10 minutes. Remove from the oven and reduce the oven temperature to 300 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the crust bakes, prepare the filling: Whisk the eggs in a large bowl until the whites and yolks are blended. Heat the milk, cream, sugar and salt in a medium saucepan over medium, stirring to dissolve the sugar and salt. When the liquid steams — don’t let it bubble — turn off the heat. Pour 1/4 cup of the milk mixture into the eggs while whisking them a thin, steady stream. (This tempers the eggs, preventing them from cooking or scrambling with the addition of the hot liquid.) Repeat twice, then pour the rest of the hot milk in, whisking all the while. Whisk in the vanilla. Let sit at room temperature while the crust finishes baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the crust is out of the oven, give the filling another stir in case anything has settled on the bottom. If you want a very smooth custard or see eggy bits floating in your mixture, pour the blend through a fine-mesh sieve into the crust. (Otherwise, skip the strainer.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the edges are set and the center jiggles slightly, 35 to 45 minutes. Cool to room temperature on a rack. You can serve the pie as is or you can grind the dehydrated berries in a spice grinder, then sift them over the surface of the custard. The whole pie also can be refrigerated for up to 2 days before serving. It’s nice cold, but even nicer at room temperature. (Just don’t reheat it.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023582-custard-pie"}