{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Church Cake", "description": "Layer cakes are formative for Southerners: They grace wedding tables, shiva gatherings, quinceañeras, baptisms and funerals. Because of this — and because layer cakes may be as close as some will ever get to a holy experience — they’re often called church cakes. This chocolate one is a perfectly moist and stacked rendition of a pudding cake, with just the right amount of richness from the frosting. This formula needs no alterations, but there’s no sense in breaking the tradition of Southern bakers, who personalize recipes as a point of pride. Add pulverized praline to the center, or cinnamon or instant-coffee granules to the batter. Don’t be afraid to make it your own. To make it a true church cake, serve it to those you hold in the highest regard, for celebrations or to simply indulge in the good glory of company.", "author": {"@type": "Person", "name": "Lisa Donovan"}, "image": "https://static01.nyt.com/images/2022/04/08/dining/ld-church-cake/ld-church-cake-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "One 9-inch layer cake", "recipeCuisine": "southern", "recipeCategory": "dessert", "keywords": "buttermilk, cocoa powder, heavy cream, layer cake, unsweetened chocolate, easter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1300}, "recipeIngredient": ["1 1/2 cups/350 grams granulated sugar", "1 1/2 cups/325 grams heavy cream", "8 ounces/225 grams unsweetened chocolate", "6 ounces/170 grams unsalted butter", "1 teaspoon vanilla paste or extract", "Nonstick cooking spray", "1 cup/120 grams unsweetened cocoa powder, dark (Dutch-processed) if available, plus more for pans", "3 1/2 cups/700 grams granulated sugar", "2 3/4 cups/365 grams all-purpose flour (see Tip)", "2 teaspoons baking powder", "2 teaspoons baking soda", "1 1/2 teaspoons fine salt", "3 large eggs, beaten", "1 1/2 cups/350 grams buttermilk, preferably cultured whole buttermilk", "3/4 cup/145 grams canola or other neutral oil", "2 teaspoons pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the frosting: In a large saucepan, bring sugar and cream to a boil over medium heat, stirring occasionally. Reduce heat to low and simmer for 6 minutes. Meanwhile, chop chocolate and cube butter. After the sugar mixture has simmered for 6 minutes, turn the heat off and add chocolate and butter to the saucepan. Stir until everything is melted. Stir in the vanilla. Remove from heat and let cool to room temperature while you make the cake. Do not stir until it has cooled almost entirely, likely for as long as it will take you to mix and bake the cake. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Heat oven to 325 degrees. Coat three 9-inch round cake pans with nonstick cooking spray. Cut three rounds of parchment paper to fit the bottom of each pan and line each pan with one. Spray the parchment. Sprinkle the pans with cocoa powder to coat, tapping each pan over the sink or trash can to shake loose any excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a very large bowl, whisk the sugar, flour, cocoa powder, baking powder, baking soda and salt. Make a well in the center. Bring 1 1/2 cups water to a boil while you prepare your wet ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the eggs, buttermilk, oil and vanilla in a medium bowl. Pour into the dry mixture and whisk gently until incorporated. It will be a bit clumpy but gently work it in. Pour in the boiling water to loosen the batter and gently whisk to combine, being careful not to splash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the batter evenly among the prepared pans. Each pan should hold about 700 grams of batter. (Weighing your batter ensures even cooking and beautiful cake building.) Bake until a toothpick inserted in the center comes out with a few crumbs, 32 to 35 minutes. Set the pans on a wire rack to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cakes are cooled, revisit your frosting, whisking to thicken and making sure not to overbeat or add any air or fluff to the frosting. Turn the cakes out of their pans and discard the parchment. Trim any rounded top off of each as evenly as possible. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the cake: Scoop about 3/4 cup of frosting on one layer set on a cake plate, then repeat with the second and third layers. You can refrigerate the cake in between frosting each layer to ensure that your frosting is set and firm so that your next layer will be propped up properly. If the frosting is too soft, the next layer will just flatten the filling. Frost the outside of the cake with the remaining frosting, letting it chill as you go if needed. Use an offset spatula or butter knife dipped in hot water and wiped clean to smooth and shine the finished cake. This cake keeps and is best served at room temperature for up to 2 days. It holds remarkably well in the refrigerator for up to one week and can be served cold."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023117-chocolate-church-cake"}