{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Fried Okra", "description": "As one of the most respected cooks in America’s Lowcountry region, <a href=\"https://www.nytimes.com/2022/05/09/dining/gullah-geechee-cookbook-emily-meggett.html\">Emily Meggett</a> knows a thing or two about taking humble ingredients and transforming them into an irresistible plate of food. Such is the case for the matriarch’s pan-fried okra, from her cookbook “Gullah Geechee Home Cooking: Recipes From the Matriarch of Edisto Island” (Abrams, 2022), a book that I co-wrote. Her recipe is constructed around the use of fresh, seasonal okra pods. Mrs. Meggett dismisses what she views as the excessive use of dairy-based cornmeal batters in restaurant versions of fried okra; instead, she lightly coats her okra, allowing the beauty and taste of the vegetable to shine in each mouthful.", "author": {"@type": "Person", "name": "Kayla Stewart"}, "image": "https://static01.nyt.com/images/2022/07/13/dining/13okrarex1-1/merlin_209335167_db1c5e59-740a-4171-a4db-f05e638513cc-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american, southern", "recipeCategory": "dinner, easy, snack, vegetables, appetizer, side dish", "keywords": "cornmeal, okra, yellow cornmeal, summer, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 92}, "recipeIngredient": ["4 cups okra (about 1 1/3 pounds) ", "4 1/2 teaspoons salt (any type), plus more to taste", "1 1/2 cups/340 grams fine or medium yellow cornmeal, plus more if needed", "2 cups vegetable oil, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the okra, and place aside, leaving the okra slightly wet. Cut the okra crosswise into 1/2-inch pieces and place in a large bowl. Season the okra with the salt, adding more to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the cornmeal over the okra. Using both hands, firmly grip the bowl, and shake it until all the okra pieces are coated. If too dry, add a little water, 1 tablespoon at a time, and, if needed, more cornmeal can be added. Lightly press the okra with your hands, making sure that the cornmeal sticks to the okra. Toss the okra again. All the pieces should be coated evenly, with a light layer of cornmeal — but the okra shouldn't be obscured."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large cast-iron skillet, heat the oil over medium-high. You can determine if the oil is ready by dropping a pinch of cornmeal into it; the oil should sizzle, but not smoke. (If it’s not hot enough, the okra will soak up the oil.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the oil is ready, working in two batches to avoid crowding, drop half the okra into the hot oil and cook it, stirring occasionally, for about 5 minutes, until golden and crisp. Using a slotted spoon or spider, remove the okra to a plate covered with a paper towel to drain excess oil. Repeat with remaining okra, and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023293-pan-fried-okra"}