{"@context": "http://schema.org", "@type": "Recipe", "name": "Baek Kimchi (White Kimchi)", "description": "More prominent in the northern parts of the Korean peninsula, baek (meaning “white”) kimchi is considered the predecessor to today’s more commonly known red, spicy napa cabbage <a href=\"https://cooking.nytimes.com/recipes/1023416-kimchi\">kimchi</a>. (Red chile peppers didn’t arrive in Korea until the late 16th century.) Without any chile, this kimchi lets the sweet, natural flavors of the cabbage shine, with a briny pickled taste that is salty, refreshing and full of zingy ginger. If your daikon doesn’t come with any greens on top, then one bunch of Tuscan kale is a good substitute that offers wonderful bitterness and balance; just add chopped large pieces during Step 1.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/08/24/dining/22KIMJANGREX2-baek-kimchi/merlin_211376514_fc31086e-0c50-4fea-ab4c-a2bfd6fa3d62-articleLarge.jpg", "totalTime": "P2DT2H", "recipeYield": "1/2 gallon", "recipeCuisine": "korean", "recipeCategory": "condiments, pickles, side dish", "keywords": "daikon, fish sauce, food processor, napa cabbage, plan-ahead, healthy", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 59}, "recipeIngredient": ["1 medium head napa cabbage (2 to 2 1/2 pounds), any dirty outer leaves removed", "1 medium daikon (6 to 8 ounces), plus green parts if available", "3 tablespoons coarse kosher salt or 5 tablespoons kosher salt (such as Diamond Crystal)", "1 medium Asian pear, peeled, quartered and cored", "1 small yellow onion, peeled and quartered", "10 garlic cloves, peeled", "1 (2-inch) piece fresh ginger, peeled", "1 tablespoon granulated sugar", "1/2 cup fish sauce", "3 scallions, trimmed", "1 small carrot, peeled (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dry-brine the cabbage: Rinse the head of cabbage under cold running water, making sure to get in between the leaves. Trim the root end off the cabbage and cut crosswise into 1-inch-thick slices, carving out the core if it’s especially big and tough. Transfer the cabbage strips to your largest bowl. If your daikon came with green tops, cut them off the daikon and add them to the bowl. Sprinkle over the salt and toss with your hands until evenly distributed. Set aside to brine at room temperature until the hard cabbage leaves shrink and become wet and limp (but are still crunchy), 1 to 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the cabbage: Fill the bowl with cold water and swish the leaves around to rinse off the salt (and to clean off any remaining dirt). Lift the leaves out of the water and transfer to a colander. Repeat once or twice, until the cabbage leaves still taste discernibly salted, but not so salty that you can’t eat them like salad. Rinse out the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: To a food processor, add the pear, onion, garlic, ginger and sugar and process until the mixture is so finely chopped that it is almost puréed. Transfer the sauce to the empty bowl and stir in the fish sauce. Cut the scallions into 1-inch-long pieces and thinly slice the daikon and carrot, if using, into coins. Add the vegetables to the sauce. Stir to combine. Add the drained cabbage and toss with clean hands until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the sauced cabbage to a clean 1/2-gallon jar, using your hands to gently pack it down. (A few air gaps are fine; they’ll fill with liquid over time.) This amount of cabbage should fill the jar, leaving about an inch of room at the top. Top the jar with any sauce left in the bowl. Loosely close with a lid (see Tip). Wash your hands and rinse off the jar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the jar of kimchi begin fermenting on the kitchen counter at room temperature for 2 to 3 days, “burping” it every 12 hours or so, which just means opening the lid to let out any excess build-up of gas. After this, the cabbage should have released even more of its liquid; it’s OK if the liquid doesn’t completely cover the cabbage at this point, though it may. Refrigerate the kimchi to finish fermenting until it’s sour, 2 to 3 weeks and up to 6 months, at which point it will be very, very sour and should be eaten or turned into jjigae. Check (and taste!) the kimchi every 2 to 3 days to familiarize yourself with the fermentation process."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023417-baek-kimchi-white-kimchi"}