{"@context": "http://schema.org", "@type": "Recipe", "name": "Tteok Mandu Guk (Rice Cake Soup With Dumplings)", "description": "You can eat a bowl of tteok guk, rice cake soup, as South Koreans do on New Year’s Day (by the Gregorian or Lunar calendar) and freeze any leftover broth for multiple soul-soothing meals in the new year. The soup sometimes includes mandu, as it does here, and those dumplings also can be frozen. An aromatic gochugaru oil turns this ordinarily snow-white dish crimson, flavoring the bold, spicy-sweet kimchi dumpling filling and tingeing the final broth with its heat. The tteok, rice cakes, here come in the form of thick, cylindrical pieces rather than soggy coins, and are added at the last moment to maintain their pleasurable chewiness.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/12/27/multimedia/01EAT-kimchi-tteok-mandu-guk-1-4cc2/01EAT-kimchi-tteok-mandu-guk-1-4cc2-articleLarge.jpg", "totalTime": "PT2H45M", "recipeYield": "8 servings", "recipeCuisine": "korean", "recipeCategory": "dinner, dumplings, project, main course", "keywords": "brisket, egg yolks, gochugaru, ground beef, kimchi, radish, soup, new year’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "recipeIngredient": ["1 pound brisket", "1 pound Korean radish, peeled and cut crosswise into 2-inch-thick slabs", "1 large yellow onion, peeled with the root end left intact", "1 tablespoon coarse kosher salt", "1/2 cup olive oil", "2 tablespoons coarse gochugaru (see Tip)", "1 small yellow onion, finely grated", "4 ounces drained napa cabbage kimchi, finely chopped (1/2 packed cup)", "1 tablespoon dark brown sugar", "1 tablespoon soy sauce", "1 tablespoon toasted sesame oil", "1 large egg", "Coarse kosher salt and black pepper", "1/2 pound ground beef (preferably 80/20)", "48 (3-inch) store-bought round dumpling wrappers (from one 1-pound package)", "Olive oil", "4 large egg yolks", "8 ounces fresh or thawed frozen tteok (cylindrical Korean rice cakes), chopped into bite-size pieces", "1 (5-gram) packet gim (roasted seaweed), scissored into thin strips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the broth: Soak the brisket in a bowl of cold water for 10 minutes. Drain the brisket then add it to a large stockpot, along with the radish, onion, salt and 6 quarts cold water. Bring to a boil over high, skimming and discarding foam. Reduce the heat to medium-low and simmer until the meat is very tender, 1 1/2 to 2 hours. Turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the mandu: Heat the olive oil and gochugaru in a small pot over medium, stirring occasionally, just until the gochugaru begins to sizzle, 3 to 5 minutes. Transfer to a heatproof bowl to cool completely; it will thicken as it sits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the grated onion in a fine-mesh sieve or kitchen towel and press out as much liquid as you can into a bowl. Reserve the liquid. Add the grated onion to a large bowl, along with the kimchi, brown sugar, soy sauce, sesame oil, egg, 3/4 teaspoon salt, 1/2 teaspoon pepper and 2 tablespoons of the gochugaru mixture; stir to combine. Add the ground beef and gently stir again to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the mandu, set a small dish of cold water next to a sheet pan lined with parchment paper. Place about 1/2 tablespoon of the filling into the center of a mandu wrapper. Dip your fingertips into the cold water then wet the entire outer edge of the wrapper. Fold the wrapper in half over the filling to create a half-moon shape and press the edges to seal, making sure to push out any air bubbles. If you’d like, make at least three pleats along the edge. Place on the sheet pan and repeat with the rest of the filling and wrappers. Freeze the dumplings directly on the sheet pan until ready to cook. (Once the dumplings are frozen solid, you can transfer them to a sealable bag and keep them in the freezer for up to 2 months.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the egg yolk omelet garnish for the soup: Heat a small nonstick skillet over medium and add enough oil to lightly coat the bottom. Whisk the egg yolks and add to the skillet, tilting the pan to spread the yolks into an even layer. Cook until just set on the first side without browning, about 30 seconds, and flip to cook the second side, just a few more seconds. Transfer to a cutting board to cool completely. Roll like a sleeping bag and thinly slice crosswise to create little yellow strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the brisket, radish and onion from the broth. Thinly slice the brisket against the grain and return it to the pot, and eat (or discard) the radish and onion. Add the reserved onion liquid, taste and season with salt and pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, bring the broth to a boil over high. Add the chilled mandu, reduce the heat to a simmer and cook, gently stirring occasionally, just until the mandu float to the top, 2 to 3 minutes. Stir in the tteok and continue cooking until the tteok are tender, 1 to 2 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the broth, beef, mandu and tteok among bowls. Top each with the egg yolk omelet and gim. Drizzle with as much of the remaining gochugaru oil as you like. Serve hot."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023766-tteok-mandu-guk-rice-cake-soup-with-dumplings"}