{"@context": "http://schema.org", "@type": "Recipe", "name": "Beans Marbella", "description": "This recipe started as <a href=\"https://www.nytimes.com/2022/06/02/dining/chicken-marbella-without-the-chicken.html\">a wisp of an idea</a> in <a href=\"https://www.nytimes.com/column/the-veggie\">The Veggie</a>, our weekly newsletter about vegetarian home cooking, inspired by that iconic dish chicken Marbella, made famous in “The Silver Palate Cookbook.” Instead of chicken, a pot of thin-skinned, creamy beans and their rich cooking liquid form the base, which are then added to a pan of fried garlic and reduced red wine with plenty of olive oil, prunes and olives. They’re then topped with a simple roasted potato salad, dressed with vinegar-soaked shallots, capers and parsley. It’s not an exact replica of chicken Marbella, but it’s a beautiful and satisfying way to enjoy its familiar flavors — the tangy, briny sharpness of vinegar, capers and olives, set against the sweetness of prunes. You can serve the dish as is, but it’s even more luxurious with some thickly sliced and toasted bread, brushed with olive oil and garlic.", "author": {"@type": "Person", "name": "Tejal Rao and Alexa Weibel"}, "image": "https://static01.nyt.com/images/2022/06/20/dining/TR-Beans-Marbella/TR-Beans-Marbella-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews, main course", "keywords": "beans, capers, olives, potato, prune, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 775}, "recipeIngredient": ["1 pound dried beans (preferably thin-skinned, creamy beans like cannellini or great Northern beans)", "1/2 cup plus 2 tablespoons extra-virgin olive oil, plus more for finishing", "3 fresh or dried bay leaves", "1 teaspoon dried oregano", "Kosher salt (such as Diamond Crystal) and freshly ground pepper", "4 garlic cloves, chopped", "1 cup dry red wine", "1/2 cup halved Castelvetrano olives", "1/2 cup roughly chopped prunes", "1 pound fingerling potatoes, halved lengthwise", "2 tablespoons extra-virgin olive oil", "Kosher salt (such as Diamond Crystal) and freshly ground pepper", "1 large shallot, minced", "1 teaspoon red wine vinegar", "2 tablespoons chopped capers", "Torn fresh parsley leaves and tender stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start the beans: Rinse the beans then add them to a large, heavy pot and cover with enough cool water to generously immerse (about 12 cups). Add ¼ cup olive oil, the bay leaves, oregano and 1 teaspoon salt, then bring to a boil over high heat. Once the liquid comes to a boil, reduce the heat to medium-low and simmer, stirring occasionally, until the beans are very tender, 1½ to 2 hours. Add extra water by the cupful as needed to keep the beans immersed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the potatoes: Heat the oven to 375 degrees. On a large sheet pan, toss the potatoes with 2 tablespoons olive oil; season generously with salt and pepper, and toss to coat. Roast, stirring once about halfway through, until the potatoes are golden-brown and tender, about 30 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the beans: In a large, deep skillet, heat 2 tablespoons olive oil over medium heat. Add the chopped garlic and sauté until soft and fragrant. As soon as the edges of the garlic start to color, add the red wine and simmer until the wine is reduced by half, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, transfer the cooked beans (you should have about 7 cups) to the reduced wine in the skillet, then add about 2 cups of their cooking liquid — you want just enough to mostly cover the beans. Add the olives, prunes and another ¼ cup olive oil, and simmer over medium, stirring occasionally, until the flavors meld and the liquid thickens slightly to form a sauce, 10 to 15 minutes. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the potatoes: In a medium bowl, combine the minced shallot with the red wine vinegar. Add the potatoes, capers and parsley, and toss to coat. Season to taste with salt and pepper. Tip the potatoes on top of the beans, drizzle with olive oil and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023274-beans-marbella"}