{"@context": "http://schema.org", "@type": "Recipe", "name": "Pistachio Bundt Cake", "description": "If you’ve never been a fan of Bundt cake, this one just might change your mind. The key to this cake’s moist crumb and sweet, nostalgic flavor is instant pistachio pudding mix, a trick that the chef Joshua Pinsky learned from his mother. A simple lime glaze and whipped ricotta for dolloping make this recipe feel more special than your average snacking cake. This also works well as a make-ahead dessert, retaining its moisture and flavor over a few days. Try making the whipped ricotta a day ahead: It’ll thicken and become even creamier overnight.", "author": {"@type": "Person", "name": "Priya Krishna and Jesse Szewczyk"}, "image": "https://static01.nyt.com/images/2023/01/18/multimedia/18PUDDING-REX1-pistachio-bundt-cake-ckmf/18PUDDING-REX1-pistachio-bundt-cake-ckmf-articleLarge.jpg", "totalTime": "PT1H35M", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "snack, dessert", "keywords": "bundt cake, confectioners' sugar, egg white, greek yogurt, heavy cream, lime juice, make-ahead, pistachio, ricotta, vanilla bean paste", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 621}, "recipeIngredient": ["Nonstick cooking spray or neutral oil", "2 3/4 cups/351 grams all-purpose flour", "1 (3.4-ounce) package instant pistachio pudding mix", "1 tablespoon plus 1 teaspoon baking powder", "3/4 cup plus 1 tablespoon/195 milliliters whole milk", "3/4 cup plus 2 tablespoons/205 grams full-fat plain Greek yogurt", "1 tablespoon vanilla bean paste or vanilla extract", "9 large egg whites", "1 teaspoon kosher salt (such as Diamond Crystal)", "2 1/2 cups plus 2 tablespoons/528 grams granulated sugar", "1 1/4 cups/300 milliliters canola oil", "2/3 cup/85 grams shelled pistachios, coarsely chopped", "1 1/3 cup/328 grams whole-milk ricotta", "1/4 cup/60 milliliters heavy whipping cream", "2/3 cup/68 grams sifted confectioners’ sugar", "1 teaspoon vanilla bean paste or vanilla extract", "2 teaspoons olive oil", "Pinch of kosher salt", "2 1/4 cups/230 grams sifted confectioners’ sugar, plus more as needed", "1/4 cup/60 milliliters fresh lime juice (from about 2 medium limes), plus more as needed", "1/2 cup/64 grams unsalted roasted shelled pistachios, sliced or coarsely chopped", "Flaky sea salt, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake: Heat oven to 350 degrees and coat a 12-cup (or larger) Bundt pan with nonstick cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the flour, pistachio pudding mix and baking powder. In a second medium bowl whisk together the milk, yogurt and vanilla bean paste until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the egg whites and salt in the bowl of a stand mixer fitted with a whisk attachment (or in a large mixing bowl if using a hand mixer). Beat on medium speed until frothy, 1 to 2 minutes. Add the sugar, increase the mixer speed to high, and beat until the egg whites are marshmallowy with firm peaks that form when the beater is lifted, 4 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bowl from the stand mixer, add the flour mixture and canola oil, and gently mix them into the egg whites using a rubber spatula until smooth and no pockets of unincorporated flour remain. Gently mix in the milk mixture until completely smooth, and then stir in the pistachios until evenly distributed throughout the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter evenly into the prepared Bundt pan, smooth into an even layer and tap the pan on the counter several times to remove any large air pockets. Bake until the top of the cake is lightly browned and a skewer or cake tester inserted into the center comes out with just a few moist crumbs attached, 60 to 75 minutes. Let cool for 10 minutes, then flip the cake out onto a wire rack and let cool completely before glazing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake is cooling, make the whipped ricotta: Transfer the ricotta to the bowl of a food processor fitted with the blade attachment and add the heavy cream, confectioners’ sugar, vanilla paste, olive oil and salt. Process until the mixture is completely smooth, stopping and scraping down the sides of the food processor as needed, 40 to 60 seconds total. (Alternatively, set a fine mesh strainer over a large mixing bowl and add the ricotta to the strainer. Use a rubber spatula to press the ricotta through the strainer into the bowl. Add the heavy cream, confectioners’ sugar, vanilla paste, olive oil and salt to the bowl of ricotta and vigorously whisk until smooth.) Transfer to a bowl, cover with plastic wrap and refrigerate until ready to serve. Makes about 1 2/3 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the cake is completely cooled, make the glaze: In a large mixing bowl whisk together the confectioners’ sugar and lime juice until the sugar is completely dissolved. The glaze should be very thick yet pourable. If the glaze is too thin, whisk in additional powdered sugar 1 tablespoon at a time. If it’s too thick, whisk in additional lime juice 1 teaspoon at a time. Transfer the glaze into a piping big or large zip-top bag with the corner cut off and drizzle the glaze over the top of the cooled cake, allowing it to drip down the sides. Immediately garnish the top with the sliced pistachios and sprinkle with flaky sea salt. Let stand until the glaze has set, about 20 minutes, and serve with the whipped ricotta."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023783-pistachio-bundt-cake"}