{"@context": "http://schema.org", "@type": "Recipe", "name": "Shish Kebab", "description": "Cooking pieces of skewered meat over fire is a practice almost as old as the discovery of fire itself, and it’s a culinary tradition that has been embraced across the globe. Shish kebab, from the Turkish words şiş (sword or stick) and kebap (roasted meat), is beloved across the Mediterranean and beyond. There are endless regional preparations for shish kebab; in this version inspired by Turkish flavorings, a yogurt and tomato paste-based marinade, punched up with lively spices like Aleppo pepper, paprika and cumin, tenderizes succulent pieces of lamb or beef. If you prefer a milder lamb taste, use boneless leg of lamb; for a more pronounced lamb taste, use boneless shoulder meat. If you’d like to skip the lamb altogether, use beef sirloin or top loin, which each make for tender and juicy kebabs without the expensive price tag. Shish kebab is best grilled, but you can also use a broiler or a stovetop grill pan (see Tip). For a complete meal, skewer peppers and onions (or any other vegetables you like), grill them alongside the kebabs and serve with flatbread.", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2022/12/05/multimedia/nd-shish-kebab-1-2329/nd-shish-kebab-1-2329-articleLarge.jpg", "totalTime": "P1DT30M", "recipeYield": "4 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, skewers and kebabs, main course", "keywords": "beef, lamb, plan-ahead, tomato paste, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 55}, "recipeIngredient": ["1/4 cup plain yogurt", "3 tablespoons extra-virgin olive oil, plus extra for serving", "2 garlic cloves, finely grated", "2 tablespoons tomato paste", "1 tablespoon kosher salt (such as Diamond Crystal)", "1 teaspoon Aleppo pepper, or crushed red pepper of choice, plus extra for serving", "1 teaspoon sweet or smoked paprika", "1/2 teaspoon ground cumin ", "1/2 teaspoon dried oregano, crushed between your fingers", "1/2 teaspoon black pepper", "2 pounds boneless lamb leg or shoulder, beef top loin or sirloin, or a combination, excess fat trimmed and meat cut into 1½- to 2-inch cubes", "Lemon or lime wedges", "Flat bread, such as pita, for serving", "Grilled bell pepper and onion (optional), for serving", "Fresh herbs, such as mint and basil (optional), for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the yogurt, oil, garlic, tomato paste, salt, Aleppo pepper, paprika, cumin, oregano, and black pepper in a medium bowl, and stir to combine well. Add the meat and toss to coat well in the marinade. Cover and marinate in the refrigerator for at least 2 hours and up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the meat out of the fridge 30 minutes prior to grilling. If using wooden skewers, soak them in water for 30 minutes. Heat a gas grill to medium-high (400 degrees), or prepare a hot charcoal grill, and oil the grates. Remove the cubes of meat from the marinade and skewer them. Grill the meat, turning a few times, until cooked to your liking, 12 minutes (for medium-rare) to 15 minutes (for medium) on a gas grill, or 10 minutes (for medium-rare) to 12 minutes (for medium) on a charcoal grill. A little charring is OK, but turn them every couple of minutes so they don’t burn and will stay juicy on the inside. Skewer and grill the veggies alongside, if using. Just before serving, throw the bread on the grill to warm through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the bread on a serving dish, place the kebabs on the bread, squeeze a little lemon or lime juice over the kebabs, drizzle with a little olive oil, and an extra sprinkling of Aleppo pepper (if you like) and serve with fresh herbs."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023724-shish-kebab"}