{"@context": "http://schema.org", "@type": "Recipe", "name": "Reverse-Seared Steak", "description": "Reverse-searing is a grilling technique for steak that ensures a dark, sizzling crust and a rosy center that is perfectly cooked to your desired degree of doneness. This brilliant grilling method combines the low and slow cooking of traditional barbecue with the high heat charring practiced at steakhouses. Though it works well with any thick steak, from picanha to porterhouse, this recipe calls for a cut of steak popularized in Santa Maria, Calif., and is today known and loved across the U.S. as tri-tip. As the name suggests, it’s a triangular or boomerang-shaped steak cut from the tip of the sirloin, blessed with a robust beefy flavor.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2022/05/18/dining/14steakrex/18steakrex-articleLarge.jpg", "totalTime": "PT55M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, meat, main course", "keywords": "father’s day, labor day, memorial day, tailgate, tri-tip steak", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 422}, "recipeIngredient": ["1 large or 2 small wood chunks (such as oak, hickory or mesquite) or 1 1/2 cups wood chips", "Canola oil, for greasing the grill grate", "1 tri-tip steak (about 2 to 2 1/4 pounds; see Tip)", "Coarse kosher or sea salt", "Freshly ground black pepper", "Granulated onion or garlic (or both)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using wood chips, soak in water for 30 minutes. <a href=\"https://www.nytimes.com/2022/05/14/dining/how-to-reverse-sear-steak.html\">Set up your grill for indirect grilling</a> and heat to 250 degrees. Clean and oil the grill grate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the tri-tip from the refrigerator. Generously season it with salt, pepper and granulated onion or garlic (or both) on all sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tri-tip, fat side up, on the grill grate away from the heat. Insert a remote thermometer probe, if using, deep into the center of the meat. If you soaked wood chips, drain them. If using a charcoal grill, add the wood chunk(s) or chips to the coals. If using a gas grill, place the wood chunks under the grate over one of the burners, or place the chips in your grill’s smoker box. Close the lid. Indirect grill the tri-tip to obtain an internal temperature of 110 degrees, which will take 30 minutes or so. Transfer the tri-tip to a platter and let it rest for at least 10 minutes, or as long as 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, heat your grill to high. On a charcoal grill, rake the coals into a mound in the center of the grill, adding fresh coals as needed. Let the new coals burn until glowing red. On a gas grill, simply set the burners on high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the tri-tip to the grate directly over the heat, fat side up, and reinsert the thermometer probe, if using. Direct grill until the top and bottom are sizzling, crusty and dark, and the internal temperature is 125 degrees for rare or 135 degrees for medium-rare, 3 to 6 minutes per side, turning with tongs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the tri-tip to a cutting board and thinly slice across the grain. (You do not need to rest the meat a second time.) Take time to notice the even color and doneness of the meat and to appreciate the intoxicating aroma of the wood smoke. Serve at once, while the steak is still hot."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023176-reverse-seared-steak"}