{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Chickpea Stew With Greens and Lemon", "description": "The hardest part about making this dish is not eating all the garlic-strewn crispy chickpeas right after you’ve made them. But try to resist — they will taste even better as a crunchy topping to this gorgeous, velvety stew laden with tender greens, salty feta and even more chickpeas. All the textures here make this dish, adapted from “Dinner in One: Exceptional & Easy One-Pan Meals” (Clarkson Potter, 2022), highly appealing, and very hard to stop eating. You’ve been warned.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/09/14/dining/09apperex3-chickpeas/merlin_212616126_dc3b219e-4423-40c3-966a-1be4c56b30de-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weeknight, one pot, soups and stews, main course", "keywords": "chickpea, feta, goat cheese, sturdy greens", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 604}, "recipeIngredient": ["3 (15-ounce) cans chickpeas, drained and rinsed", "1 large lemon", "4 tablespoons extra-virgin olive oil, plus more for serving", "1 1/4 teaspoons kosher salt (such as Diamond Crystal), plus more as needed", "Freshly ground black pepper", "6 garlic cloves, 2 thinly sliced, 4 minced", "1 large onion, diced", "1 tablespoon fresh oregano, finely chopped", "Pinch of red-pepper flakes, plus more for serving", "12 ounces hardy winter greens, such as collards, kale or mustard greens, stems removed and roughly chopped", "1 quart vegetable or chicken stock", "1 cup crumbled feta or goat cheese (8 ounces)", "1/4 cup parsley leaves, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 2 cups drained chickpeas on a clean kitchen towel or a double layer of paper towels, and pat them dry. Grate the zest from the lemon into a small bowl and cut the naked lemon in half. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large soup pot, heat 1 tablespoon olive oil over medium-high heat. Add the chickpeas and 1/2 teaspoon salt and some black pepper, and cook, stirring occasionally, until crisped, 8 to 10 minutes. Add another tablespoon oil and the sliced garlic to the pot (save the minced garlic for later). Cook until the garlic is golden brown, 2 to 3 minutes. Use a slotted spoon to transfer the chickpeas and garlic to a paper towel-lined plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the crispy chickpeas are still hot, sprinkle them with half of the lemon zest and with salt and pepper to taste. Wipe out the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining 2 tablespoons oil in the pot over medium-high heat. Add the onions and cook until soft and golden brown, 5 minutes. Stir in the minced garlic, oregano, remaining 3/4 teaspoon salt and the red-pepper flakes and cook until fragrant, 1 minute. Add the remaining drained chickpeas, greens and stock and bring to a simmer. Cook, covered, over medium-low heat until the greens are very tender, 25 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the feta, remaining lemon zest and the juice from half a lemon. Taste and add more salt and lemon juice, if needed. To serve, ladle the stew into individual bowls and top with some of the crispy chickpeas and garlic. Drizzle with oil, sprinkle with parsley and red-pepper flakes if you’d like, and another squeeze of lemon."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023467-crispy-chickpea-stew-with-greens-and-lemon"}