{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Cabbage Ragù", "description": "What ingredient is the base for many hearty meals, turns crusty-browned when seared, tender when slow-cooked and makes for a good ragù? <a href=\"https://cooking.nytimes.com/recipes/1013227-garganelli-with-ragu-antica\">Ground meat</a> and <a href=\"https://cooking.nytimes.com/recipes/1020877-braised-pork-allarrabbiata\">pork shoulder</a>, yes, but also cabbage. Its hidden sweetness shines when seared in plenty of oil and braised until glazed and soft. In this vegan pasta sauce, cabbage slumps as its juices release and mingle with red wine and caramelized tomato paste. To ensure the flavors aren’t too diluted, use just a small amount of water and trust that the cabbage will release moisture as it cooks. Use this warming braise to sauce fat noodles, or eat it with polenta, mashed potatoes, beans, sausage or a fried egg. The cabbage can be cooked up to three days ahead.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/02/23/dining/as-red-cabbage-ragu/merlin_201238704_79135a92-554d-40c1-809a-cdf74f9597c7-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "healthy, vegetarian, pasta, red cabbage, tomato paste", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1237}, "recipeIngredient": ["6 tablespoons extra-virgin olive oil, plus more as needed", "1 medium red cabbage (1 1/2 to 2 pounds), cut through the core into 6 wedges", "Kosher salt and black pepper", "1 red or yellow onion, coarsely chopped", "5 garlic cloves, coarsely chopped", "4 1/2 ounces (1 tube) double concentrate tomato paste, or 6 ounces (1 can) tomato paste", "1/3 cup red wine", "3/4 cup coarsely chopped parsley (from 1 1/2 cups leaves and tender stems)", "1 teaspoon granulated sugar", "1 teaspoon red-pepper flakes (optional)", "1 pound tube pasta, like rigatoni or paccheri"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven, heat 4 tablespoons oil over medium-high. Working in batches if necessary, add the cabbage wedges cut side down in a single layer, season with salt and cook until well browned, 3 to 5 minutes per side. Transfer to a cutting board to cool slightly. Repeat with remaining cabbage, adding more oil as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to medium-low and add the remaining 2 tablespoons oil and the onion to the empty pot. Season with salt and pepper, and cook, stirring occasionally, until softened and starting to turn golden, 5 to 7 minutes. Bring a large pot of salted water to a boil. Coarsely chop the cooked cabbage, including the core."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve 1 teaspoon of the garlic, and add the remaining garlic and the tomato paste to the onions. Cook, stirring constantly, until the tomato paste is a shade darker, 3 to 5 minutes. Add the wine and cook, scraping up browned bits, until nearly evaporated, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chopped cabbage, 1/4 cup parsley and the sugar, and stir to coat in the tomato paste. Season with salt. Add 1/4 cup water, cover and cook, stirring occasionally, until the cabbage is soft and shiny, 15 to 20 minutes. (If the cabbage is sticking to the pot, add 1 tablespoon water and reduce the heat.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir the reserved 1 teaspoon garlic into the remaining 1/2 cup parsley. Add the red-pepper flakes, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cabbage is just about done, add the pasta to the boiling water and cook until al dente. Reserve 2 cups pasta water, then drain the pasta. (If the cabbage is ready before the pasta, keep covered off the heat.) Add the pasta and 1 cup pasta water to the cabbage. Stir over medium-low until the pasta is glossed with sauce. Add more pasta water as needed to thin the sauce. Divide among bowls and top with parsley-garlic mixture."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023000-red-cabbage-ragu"}