{"@context": "http://schema.org", "@type": "Recipe", "name": "Cinnamon Babka", "description": "This dairy-free babka, enriched with olive oil and flavored with a ribbon of almond flour, brown sugar and cinnamon, starts with a <a href=\"https://cooking.nytimes.com/recipes/1023460-challah-bread\">classic challah bread</a> dough. In the oven, the oil and sugar mingle to create a chewy, caramelized coating. You can omit the almond flour to make this nut-free, but the cinnamon ribbon will not be as pronounced. Be sure to let the babkas proof fully before baking, which will ensure a light, supple texture. (<a href=\"https://www.youtube.com/watch?v=1FcR1PDzC94\">Watch Claire make this recipe</a> on YouTube.)", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2022/09/14/dining/12challahrex2-babka/merlin_211918983_23a12abf-746b-445f-aa97-3bb422585c0c-articleLarge.jpg", "totalTime": "PT11H30M", "recipeYield": "2 babkas", "recipeCuisine": "jewish", "recipeCategory": "brunch, snack, breads, project, dessert", "keywords": "active dry yeast, almond flour, bread flour, light brown sugar, olive oil, dairy-free, hanukkah, rosh hashana", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 358}, "recipeIngredient": ["1 recipe <a href=\"https://cooking.nytimes.com/recipes/1023460-challah-bread\">Challah Bread</a> dough, prepared as directed below ", "4 tablespoons/56 grams olive oil, plus more for the pans ", "1 cup/220 grams light brown sugar", "1 cup/96 grams almond flour ", "1 tablespoon ground cinnamon", "1/2 teaspoon finely grated orange zest", "1/2 teaspoon Diamond Crystal kosher salt or 1/4 teaspoon Morton coarse kosher salt", "All-purpose flour, for rolling", "1 large egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: Prepare the <a href=\"https://cooking.nytimes.com/recipes/1023460-challah-bread\">Challah Bread</a> through Step 5. Let it sit in a warm spot until it’s doubled in size, 1 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the pans and make the cinnamon mixture: Brush the bottoms and sides of 2 loaf pans with a thin layer of olive oil, then line the bottom and 2 longer sides with pieces of parchment paper, leaving an overhang on the sides. Brush the parchment with more oil, then set the pans aside. In a medium bowl, toss together the brown sugar, almond flour, cinnamon, orange zest and a generous pinch of salt until evenly combined, breaking up any lumps of brown sugar with your fingertips. Measure out 1/4 cup of the mixture and set aside for sprinkling over the tops of the babkas, then set the remaining mixture aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out and fill the dough: Scrape the dough out of the bowl and onto a lightly floured surface. Flatten it with the heel of your hand to expel the gas, then cut the dough in half (each piece will weigh about 570 grams). Place one half on a small rimmed baking sheet, cover and refrigerate while you roll out the other. Press and tug the piece of dough on the work surface into a flat, narrow rectangular shape. Then, roll the dough into a long, thin rectangle measuring about 24 inches long and 8 inches wide, dusting the top and underneath with just a bit of flour as needed to keep the dough gliding across the surface (don’t use too much flour, as you want some friction between the surface and the dough). Brush off any excess flour, then drizzle the dough with 2 tablespoons of olive oil and brush the oil in an even layer all the way to the edges, leaving a clean 1/2-inch border on one of the longer sides. Sprinkle half of the cinnamon mixture, about 1 cup, (not including the 1/4 cup you set aside for the top) evenly across the surface and pat it gently into the dough. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form and chill the babkas: Starting at the longer side opposite the clean border, roll the dough into a tight, spiraled log. Pinch the dough together at the seam so it closes, then squeeze the log to lengthen and thin it out until it measures about 28 inches long. Use a knife to trim off just the irregular ends, then cut the log in half crosswise. Place one half over the other, crossing them in the middle, then twist the halves together. Transfer the twist to one of the prepared pans and flatten it gently so it fills out the bottom of the pan. Cover the pan with plastic wrap and transfer it to the refrigerator, then remove the second piece of dough from the refrigerator and repeat the rolling and forming process, using the remaining 2 tablespoons of olive oil and the remaining cinnamon mixture. Cover the second pan and refrigerate. Chill the babkas for at least 4 and up to 12 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Proof the babkas: Remove the babkas from the refrigerator and let them sit at room temperature until they’re nearly triple their original size and they come up to about 3/4 of the pan, 3 to 4 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven: Arrange an oven rack in the center position and heat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush with egg and bake: Beat the egg in a small bowl until it’s streak-free. Uncover the pans and brush the egg across the surfaces of the dough. Sprinkle the babkas with the reserved 1/4 cup of cinnamon mixture, dividing evenly. Bake the babkas side by side (but not touching) until they’re deep golden brown, 40 to 45 minutes. Let them cool in the pans for 10 minutes, then run a paring knife down along the shorter sides of the pans to loosen them. Use the parchment paper to lift the babkas out of the pans and place on a wire rack. Let them cool completely. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023464-cinnamon-babka"}