{"@context": "http://schema.org", "@type": "Recipe", "name": "Butternut Squash Pasta With Brown-Butter Bread Crumbs", "description": "A fun tip for easy squash pasta: Boil cubed squash with your pasta. Not only does it save time and effort, but also the salted pasta water helps thoroughly season the squash. The pasta and squash are then drained together and returned to the pot, where some of the tender squash breaks down and helps create a rich, creamy sauce without the addition of heavy cream. A fragrant brown butter that’s been infused with garlic and sage is used two ways in this meal: It serves as the base for the sauce, and it flavors the crispy bread crumb topping.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2022/10/04/dining/kc-creamy-squash-pasta-rex/merlin_213609864_6e160459-4cf4-46bf-aa6d-322dcd13f008-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas, main course", "keywords": "brown butter, butternut squash, panko, parmesan, pasta, sage, shallot, weeknight, fall, winter, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 612}, "recipeIngredient": ["6 tablespoons unsalted butter", "12 fresh sage leaves plus 1 sprig", "1/2 cup panko bread crumbs", "Kosher salt and black pepper", "2 tablespoons extra-virgin olive oil", "1 cup finely chopped shallot (from 2 large shallots)", "3 garlic cloves, minced", "1 1/2 pounds butternut squash, peeled, seeded and cut into ½-inch cubes (about 4 cups)", "1 pound rotini or fusilli pasta", "1 tablespoon lemon juice", "Pinch of red-pepper flakes (optional)", "1/2 cup freshly grated Parmigiano-Reggiano, plus more for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the water comes to a boil, in a large nonstick skillet, melt butter over medium heat. Add sage leaves and sprig, and cook, swirling pan occasionally, until butter browns and sage leaves are lightly golden around the edges, about 3 minutes. Transfer sage leaves to a paper-towel-lined plate and discard the sprig. (The leaves will crisp up as they cool.) Scrape the browned butter into a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return 2 tablespoons of the browned butter to the skillet over medium. Add bread crumbs, season with salt and pepper, and cook, stirring constantly, until golden and crispy, 1 to 2 minutes. Transfer to the paper-towel-lined plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out skillet and add oil and shallot. Cook, stirring occasionally, until lightly golden, about 5 minutes. Stir in garlic and the remaining reserved browned butter until well combined, then transfer to a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the pot of water comes to a boil, season with salt and add squash. Cook for 5 minutes; add pasta and cook until squash is tender and pasta is al dente, 7 to 8 minutes longer. Reserve 1½ cups of the pasta water, then drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return cooked pasta and squash to the pot and add 1 cup of the reserved pasta water and the shallot mixture. Heat over medium, stirring vigorously until well blended and some of the squash mashes into the sauce, 1 to 2 minutes. Add more pasta water to taste, if a glossier consistency is desired. Turn off heat and stir in the lemon juice, red-pepper flakes (if using) and ½ cup cheese; season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide pasta among bowls and top each with some of the brown-butter bread crumbs and crispy sage leaves. Garnish with more cheese."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023528-butternut-squash-pasta-with-brown-butter-bread-crumbs"}