{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggplant Pasta With Anchovy Bread Crumbs and Capers", "description": "In this colorful dish, there’s as much of the eggplant and tomato topping as there is pasta. They’re all tossed together with loads of garlicky, anchovy-imbued breadcrumbs and a hit of fresh basil or parsley. Serve it with a big salad of crisp lettuces for crunch. It’s a dish that’s good hot, warm or at room temperature, so you can make this recipe a little ahead of time if that works best for your kitchen flow.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/09/28/dining/23Apperex/merlin_211047606_d44cbb01-99b3-48de-bd97-8b4138b285ef-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, pastas, main course", "keywords": "anchovy, eggplant, garlic, pasta, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 121}, "recipeIngredient": ["1 1/2 pounds eggplant, cut into 1-inch cubes (about 8 cups)", "Salt and freshly ground black pepper", "1/2 pound short pasta, such as shells or orecchiette", "1/2 cup plus 2 tablespoons extra-virgin olive oil, plus more for drizzling and as needed", "12 anchovies, coarsely chopped", "8 garlic cloves, 3 grated or finely minced, 5 thinly sliced", "1 cup coarse dry bread crumbs, either panko or homemade", "1/4 teaspoon red-pepper flakes, plus more for serving", "1 cup cherry tomatoes, halved or quartered if large", "2 tablespoons capers, drained", "1 cup torn fresh basil or parsley", "1 lemon, zested and halved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place eggplant in a bowl and sprinkle all over with salt; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pot of well-salted water, cook pasta according to the package directions until about 1 minute shy of al dente. Drain well, reserving some of the pasta water (about 2/3 cup is plenty). Lightly drizzle pasta with olive oil to prevent from sticking together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large skillet over medium-high heat, warm 1/4 cup olive oil. Stir in about a quarter of the chopped anchovies and all of the grated garlic. Cook, stirring, until fragrant, about 1 minute. Stir in bread crumbs and sauté until golden, 2 to 3 minutes. Season with a few grinds of black pepper and a pinch of salt. Scrape into a small bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out skillet (no need to wash it). Add 1/4 cup olive oil and put it back over medium-high heat until oil thins out in the pan. Add enough eggplant to fit in one layer without overlapping. Without moving them around too much, cook eggplant until brown on one side, 3 to 5 minutes. Stir and let them cook on the other side until browned and thoroughly soft, 3 to 7 minutes more. Use a slotted spoon to transfer eggplant to a large bowl. Repeat with remaining eggplant, adding more oil to the pan as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 2 tablespoons of oil to the skillet and stir in remaining anchovies, the sliced garlic and red-pepper flakes. Cook over medium heat until garlic is pale gold at the edges (don’t let the garlic turn brown), 1 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in tomatoes and capers. Cook until tomatoes just begin to soften, 3 to 5 minutes. Add eggplant, pasta and 1/4 cup pasta water. Toss well, adding more pasta water if the mixture looks dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in basil and lemon zest. Squeeze half a lemon all over the pasta and toss. Taste and add more red-pepper flakes, salt or lemon juice to taste. Generously sprinkle bread crumbs on top of pasta and serve hot, warm or at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023498-eggplant-pasta-with-anchovy-bread-crumbs-and-capers"}