{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Butternut Squash Salad With Green Goddess Dressing", "description": "This colorful salad of sweet, soft roasted squash and crisp, bitter greens finished with a creamy, tangy green goddess dressing is an elegant mix of contrasting flavors and textures. The squash is good both warm and at room temperature, so feel free to roast it ahead of time. Some bitterness is nice against the sweet winter squash, but if you want to mellow radicchio’s bite a bit, you can soak the pieces in ice water for 10 to 30 minutes, then drain and dry before adding to the salad. Just taste before you soak; you’ll want a little bit of its bitterness. The dressing will keep for at least three days in the fridge. Serve it over other salads, or as a dip for cut-up vegetables and chips.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2023/01/28/multimedia/18apperex3-squash-kjqw/18apperex3-squash-kjqw-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, vegetables, main course, side dish", "keywords": "avocado, basil, butternut squash, jalapeño, leafy greens, lemon juice, parsley, radicchio, salad, yogurt, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 266}, "recipeIngredient": ["2 1/2 pounds butternut squash, peeled, trimmed, seeded and cut into 1-inch cubes (6 cups)", "2 tablespoons extra-virgin olive oil", "1 tablespoon honey, plus more as needed", "Kosher salt (such as Diamond Crystal) and freshly ground black pepper", "3/4 cup whole-milk plain yogurt", "1/4 cup chopped parsley leaves and tender stems", "¼ cup chopped basil leaves and tender stems", "3 tablespoons freshly squeezed lemon juice, plus more as needed", "2 tablespoons extra-virgin olive oil, plus more as needed", "2 scallions, sliced", "1 ripe Hass avocado, pitted and cubed", "1 jalapeño, seeded (if desired) and diced", "1 garlic clove, smashed and peeled", "1 small head radicchio, cored and cut into bite-size pieces (about 4 cups)", "4 cups crisp salad greens (such as Little Gem lettuce, baby romaine, frisée or a combination), torn into bite-size pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Place squash on a rimmed baking sheet, and toss with oil, honey, 3/4 teaspoon salt and a lot of black pepper. Spread squash into an even layer, and roast until tender and caramelized, 30 to 40 minutes, rotating halfway through. Taste a squash cube and add more salt, pepper and honey if it seems flat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the dressing: Place yogurt, herbs, lemon juice, oil, scallions, avocado, jalapeño and garlic in a food processor or blender, and process until smooth and uniformly green, 1 to 2 minutes. Taste and season with salt, pepper and more lemon juice as needed. It should taste bright and tangy. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the salad, in a large bowl, combine radicchio, salad greens and roasted squash. Pour enough dressing over salad to lightly coat it, and toss well. Season with salt and pepper to taste. Lightly drizzle with olive oil and a little more lemon juice, if you’d like, and serve immediately, with more dressing on the side."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023849-roasted-butternut-squash-salad-with-green-goddess-dressing"}