{"@context": "http://schema.org", "@type": "Recipe", "name": "Peach and Molasses Chicken", "description": "The sauce here relies on store-bought jam as a shortcut to intense fruit flavor and it is amazing on chicken. This recipe, adapted from the cookbook “Watermelon and Red Birds” by Nicole Taylor, is special enough for your Juneteenth celebration, but it’s so delicious, it can be cooked on a weekly rotation. Almost any fruit jam works, too, if peach isn’t your thing. As for the chicken itself, so much of the fat and flavor comes from the chicken skin that removing that outer layer is tantamount to robbing the meat of most of its taste, so do what it takes to find skin-on pieces. The crispy, charred chicken edges, drenched with the sauce, only happen with skin attached. ", "author": {"@type": "Person", "name": "Nicole Taylor"}, "image": "https://static01.nyt.com/images/2022/06/08/dining/06JuneteenthREX2-Peach-Molasses-Chicken/merlin_207642084_f8a187df-fd19-4932-b435-b0ff8517faad-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, barbecues, poultry, main course", "keywords": "chicken, coriander seeds, molasses, peach jam, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 861}, "recipeIngredient": ["1/2 cup peach jam ", "1/4 cup unsulfured molasses", "1 tablespoon apple cider vinegar", "2 tablespoons tomato paste", "1 tablespoon soy sauce", "1 tablespoon coriander seeds, crushed ", "1 tablespoon ground mustard", "1/2 teaspoon kosher salt (such as Diamond Crystal)", "3 to 4 pounds bone-in, skin-on chicken thighs", "1½ teaspoons kosher salt (such as Diamond Crystal)", "½ teaspoon freshly ground black pepper", "1½ tablespoons peanut oil", "1 tablespoon coriander seeds, crushed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: In a small saucepan, combine the peach jam, molasses, vinegar and 1/2 cup water and bring to a boil over medium-high heat, stirring occasionally to combine. Once boiling, reduce the heat to maintain a vigorous simmer and whisk in the tomato paste, soy sauce, coriander, ground mustard and salt. Simmer for 6 to 8 minutes, stirring occasionally, until thickened; the sauce should be reduced to about 1 cup. The sauce can be stored in an airtight container in the refrigerator for 3 to 4 days. (Before using, bring to room temperature and thin with a few teaspoons of hot water if the sauce has become too thick to brush.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chicken: Leaving one section free of coals on a charcoal grill or leaving one burner off on a gas grill, heat a grill to medium (350 degrees). Pat the chicken thighs very dry with paper towels. Season both sides with the salt and pepper. Coat with the peanut oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken thighs on the hot grill, skin-side down, close the grill lid and cook, moving the chicken away from any flare-ups, for 5 to 8 minutes, or until the skin lifts easily from the grill grates. Transfer a few tablespoons of the sauce to a small bowl and set aside. Flip the chicken thighs and use a heat-resistant brush to coat with some of the remaining sauce. Cover the grill again and cook for another 5 to 8 minutes, then flip and baste with the sauce again. Grill with the lid open for another 10 minutes, or until the thighs reach an internal temperature of 165 degrees on an instant-read thermometer. (If the skin starts to burn, flip the chicken and move to the cool part of the grill.) Flip the chicken skin-side up one last time and rest on an upper rack or the cool side of the grill for 10 minutes, using a clean brush and the reserved sauce to baste once more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken to a platter and sprinkle the tops with the crushed coriander, then serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023220-peach-and-molasses-chicken"}