{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Pork Chops and Apples With Miso Caramel", "description": "This recipe is like a delicious game of free association: miso caramel, caramel apples, apples and pork chops. You’ll often see miso caramel added to desserts for an umami oomph, but it can also form a glossy and complex sauce suited for proteins, much like <a href=\"https://cooking.nytimes.com/recipes/1021834-suon-kho-pork-ribs-in-savory-caramel-sauce?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=11\">Vietnamese caramel</a>. Start by searing pepper-crusted pork chops, then brown the apples in the rendered fat. (Be sure to choose an apple that’s more tart than sweet to balance the caramel’s sweetness.) Instead of making a finicky caramel, just pour all the elements over the apples and simmer until thickened. This nontraditional caramel uses brown sugar for toastiness, and water instead of heavy cream, so the savoriness of miso and pork and the sweetness of the caramel and apples shine through.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/11/08/dining/as-miso-caramel-pork-chops/merlin_216141114_a19401e7-4d4e-41ba-8f77-7cacbc225967-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 to 3", "recipeCuisine": "", "recipeCategory": "dinner, easy, for two, quick, weeknight, meat, main course", "keywords": "apple, date night, miso, pork chop, skillet, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 392}, "recipeIngredient": ["3 tablespoons light brown sugar", "2 tablespoons apple cider vinegar", "1 1/2 tablespoons white miso", "2 (1- to 1 1/2-inch-thick) bone-in pork chops, patted very dry", "Salt ", "1 teaspoon black pepper", "1 tablespoon neutral oil (such as grapeseed or canola)", "2 small or 1 large Granny Smith or other tart-crisp apples, cored then sliced 1/4 inch thick"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a liquid measuring cup or small bowl, combine 3 tablespoons water with the brown sugar, vinegar and miso; stir with a fork until smooth. Season the pork chops all over with salt, then the pepper. (Don’t skimp on the pepper; it’s an important element to balance the caramel.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large skillet over medium. Add the oil and the pork chops to the skillet. Cook, flipping every 2 minutes, until browned on the outside and the internal temperature in the thickest part is around 135 degrees, 10 to 15 minutes depending on thickness of pork chops. If your chops have a fat cap, using tongs, stack both chops on top of each other, then grab both chops together and hold upright to sear the fat caps until crisp, about 1 minute. Transfer to a plate to rest for 5 minutes. Pour off all but 1 tablespoon of the fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the apples to the skillet in a single layer and heat over medium. (Snack on any that don’t fit.) Cook without touching until browned underneath, 2 to 4 minutes. If the pan is smoking at any point, reduce heat. Pour in the brown sugar mixture and cook, scraping up browned bits and stirring, until thick enough to coat the back of the spoon, 1 to 3 minutes. (Keep your eye on the sauce toward the end so it doesn’t burn.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat, add the pork chops and their juices back to the skillet and turn to coat in the caramel. Serve the pork chops with a spoonful of the apples and caramel."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023628-skillet-pork-chops-and-apples-with-miso-caramel"}