{"@context": "http://schema.org", "@type": "Recipe", "name": "Wontons", "description": "Wontons are dumplings, but not all dumplings are wontons. And not all wontons are Cantonese — there are thicker-skinned versions in northern China and spicy ones from Sichuan in the southwest, among others — but Hong Kong wontons, distinguished by silky wrappers and shrimp in the stuffing, are arguably the most delicious and nuanced. In Cantonese cooking, the inherent flavors of ingredients are meant to shine, so this formula seasons the shrimp and pork lightly with classic sauces, ginger and scallions. The filling can be varied to your tastes: You can add diced water chestnuts for crunch, chopped rehydrated dried shiitake or other Chinese mushrooms for their meatiness, or swap minced fish or scallops for the pork. Once the wontons are wrapped, they can be boiled for <a href=\"https://cooking.nytimes.com/recipes/1023824-wonton-soup\">soup</a>, <a href=\"https://cooking.nytimes.com/recipes/1023823-fried-wontons\">fried</a> or steamed, or frozen to cook in the future.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2023/01/18/multimedia/13korex3-wontons-wjlq/12korex3-wontons-wjlq-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "50 to 60 wontons", "recipeCuisine": "chinese", "recipeCategory": "dumplings, project", "keywords": "freezer friendly, fresh ginger, ground pork, lunar new year, oyster sauce, scallion, sesame oil, shaoxing, shrimp, soy sauce", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 96}, "recipeIngredient": ["12 ounces peeled, deveined shrimp (any size)", "Coarse kosher or sea salt", "1 (1/2-inch) piece fresh ginger", "8 ounces ground pork", "2 scallions, finely chopped", "2 tablespoons cornstarch", "1 tablespoon oyster sauce", "2 teaspoons Shaoxing wine or dry sherry", "2 teaspoons soy sauce, preferably light (see Tip)", "1 teaspoon sesame oil", "1 teaspoon granulated sugar", "1/8 teaspoon ground white or black pepper", "50 to 60 <a href=\"https://cooking.nytimes.com/recipes/1023821-wonton-wrappers\">wonton wrappers</a>, preferably thin egg-based Hong Kong-style wrappers (see Tip)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely chop the shrimp into 1/2-inch pieces, then toss with 1/2 teaspoon salt in a colander until evenly coated. Let stand while preparing the remaining filling ingredients. This will both flavor the shrimp and draw out the excess moisture so that they end up snappy in the cooked wontons."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a ginger grater or Microplane, finely grate 2 teaspoons ginger into a large bowl. Using your fingers, press the grated ginger to squeeze out 1 teaspoon ginger juice; discard the solids. Stir in the pork, scallions, cornstarch, oyster sauce, wine, soy sauce, sesame oil, sugar, pepper and 1 teaspoon salt until evenly mixed. Using a paper towel, pat the shrimp very dry. Add to the pork and stir until evenly distributed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up an assembly line for forming wontons by placing the bowl of filling next to the wrappers and a small dish of water and lining a sheet pan with parchment for the wrapped wontons. If a wrapper tears over the filling during assembly, it can be discarded."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To shape wontons <a href=\"https://cooking.nytimes.com/recipes/1023824-wonton-soup\">for wonton soup</a>: Place a heaping spoonful of filling near one corner of a wrapper. You want to try to get as much filling in there as possible, about a tablespoon, but you can start with a smaller amount for easier folding. Using your fingertip, wet the wrapper corner nearest the filling, then fold that corner over the filling to enclose it, pleating the wrapper around the filling and pressing that corner just past the center of the remaining wrapper. You should end up with a bump of enclosed filling and a pleated tail of wrapper. Place on the prepared pan and repeat with the remaining filling and wrappers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To shape wontons <a href=\"https://cooking.nytimes.com/recipes/1023823-fried-wontons\">for deep-frying</a>, place a heaping teaspoon of filling in the center of the wrapper. Using your fingertip, wet the borders of the wrapper, then fold it in half to form a rectangle or a triangle, encasing the filling and making sure there are no air pockets around it. Take two corners on the long side and bring them together to meet in the center over the filling, using water if needed to make the corners stick and hold. Place on the prepared pan and repeat with the remaining filling and wrappers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once you’ve filled all of the wontons, you can prepare as many as you’d like immediately, boiling them for soup or deep-frying for a snack. The rest can be frozen uncovered on the sheet tray until solid, about 2 hours. Transfer them to an airtight container and freeze for up to 2 months. Cook straight from the freezer, adding a few minutes of cooking time."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023822-wontons"}