{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Cilantro-Chile Shrimp", "description": "These zesty, pan-fried shrimp are inspired by the cuisine of Maharashtra, the state on the west coast of India that includes Mumbai. Maharashtrian cooking often features lots of seafood and bright, fresh flavors, like the wallop of cilantro that flavors this dish. (Puréeing cilantro, as in this recipe, <a href=\"https://www.nytimes.com/2010/04/14/dining/14curious.html\">changes the enzyme</a> that makes it taste soapy to some people, and reveals a deeply savory, almost mellow side to the herb.) A coating of farina, of which Cream of Wheat cereal is made, gives a dramatically craggy, crunchy texture; rava or semolina flour also work well. Be sure to pat the farina onto the shrimp before frying to help the coating adhere. Serve the shrimp with flatbreads, like chapatis.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2022/04/21/dining/sd-green-chile-shrimp/merlin_205522575_03f362de-3f31-4862-981a-09f2dc688757-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, seafood, main course", "keywords": "cilantro, farina, serrano pepper, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 147}, "recipeIngredient": ["6 ounces cilantro leaves and stems (about 2 medium bunches or 1 large bunch), cut to fit into a blender", "5 garlic cloves, peeled", "1 serrano chile, stemmed, halved and seeded", "2 tablespoons vegetable oil, plus up to ¾ cup for frying", "1 heaping tablespoon chopped fresh ginger", "1 tablespoon lime juice (from about 1 lime), plus lime wedges for serving", "3/4 teaspoon ground turmeric", "1/2 teaspoon garam masala", "1/2 teaspoon ground cumin", "1/2 teaspoon ground coriander", "1/2 teaspoon ground cayenne", "Kosher salt (Diamond Crystal)", "1 1/2 pounds large or extra-large shrimp, peeled, deveined and tails removed", "1 1/4 cups farina, rava or semolina flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the cilantro, garlic, chile, 2 tablespoons oil, ginger, lime juice, turmeric, garam masala, cumin, coriander, cayenne and 2 teaspoons salt in a blender. Purée, using a wooden spoon or the blender wand to help combine ingredients if necessary. Scrape the puréed mixture into a bowl. Add the shrimp and use your hands or a spatula to evenly combine. Marinate for up to 1 hour in the refrigerator, if possible, or proceed immediately to Step 2."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dredge the shrimp: Pour the farina onto a lipped plate or into a large shallow bowl and season with two generous pinches of salt; toss to combine. Let the marinade cling to the shrimp, then dredge the shrimp in the farina, patting the farina onto each shrimp to adhere, and carefully shaking off any excess crumbs. Place the dredged shrimp on a parchment- or foil-lined sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat ¼ cup of the oil in a large nonstick skillet over medium-high. Working in 2 or 3 batches, depending on the size of your pan and the size of your shrimp, lay the shrimp in the pan in one layer and fry without disturbing until the shrimp are deeply golden brown on one side, about 3 to 4 minutes. Gently flip with tongs or a spatula and fry until golden brown on the other side, 2 to 3 minutes more. Remove the shrimp to a paper towel-lined plate and sprinkle with salt. (If any large shards of coating come off the shrimp, remove them from the oil, and serve with the shrimp.) Wipe the skillet clean of crumbs with a paper towel and add more oil to the pan as necessary to maintain the amount, and repeat the pan-frying process with the remaining shrimp. Serve with lime wedges on the side."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023133-crispy-cilantro-chile-shrimp"}