{"@context": "http://schema.org", "@type": "Recipe", "name": "Papadzules (Eggs and Asparagus in Tortillas With Pepita Sauce)", "description": "A dish from the Yucatán Peninsula in southeastern Mexico, papadzules are similar to enchiladas in that they feature tortillas that are dipped and coated in a sauce, then filled, rolled and topped with more sauce. Traditionally, papadzules are served with hard-boiled eggs and topped with a toasted pepita sauce and a spicy habanero-tomato salsa. In this late-spring version, jammy eggs and blanched asparagus serve as the filling, and an uncooked sauce of pepitas and jalapeños finishes everything off. Be sure to cook the eggs for the full 6½ minutes or the yolks will be too runny.", "author": {"@type": "Person", "name": "Rick A. Martinez"}, "image": "https://static01.nyt.com/images/2022/05/07/dining/rm-papadzules/merlin_206068020_c3369516-22c1-4299-ae06-45f97409b5d8-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "brunch, dinner, main course", "keywords": "asparagus, corn tortillas, egg, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 169}, "recipeIngredient": ["Ice", "10 large eggs", "1 pound asparagus, woody ends trimmed, cut into 1-inch pieces", "8 corn tortillas, preferably blue corn", "1 3/4 cups pepitas (raw pumpkin seeds)", "3 scallions, root ends trimmed, chopped", "2 garlic cloves, peeled and lightly crushed", "2 jalapeños, stemmed and roughly chopped", "1/3 cup cilantro leaves and tender stems", "1 tablespoon fresh lime juice, plus more to taste", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl with ice and water. Bring a large saucepan of water to a boil over medium-high heat. Using a slotted spoon, carefully lower the eggs into the water. Cook, adjusting the heat to maintain a gentle boil, for 6½ minutes for jammy eggs with a soft and runny yolk (or longer for medium- or hard-boiled eggs). Transfer the eggs to the bowl of ice water and chill until just slightly warm, about 2 minutes. (Keep the water boiling.) Gently crack the eggs all over and peel, starting from the wider end, which contains the air pocket. That gap between egg and shell makes peeling easier. Cut the eggs into quarters. Set 8 quarters aside for serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the asparagus to the same pot of boiling water and cook until bright green and crisp-tender, 2 to 3 minutes. Drain, transfer to a medium bowl and let sit until ready to assemble."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a tortilla in a small skillet over medium heat, turning once, until warm, about 1 minute. Wrap in a clean kitchen towel or foil. Repeat with the remaining tortillas, stacking and wrapping them in the towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve ¼ cup pepitas and ¼ cup scallions for garnish. Combine remaining pepitas, remaining scallions, the garlic, jalapeños, cilantro, lime juice, 3 cups water and salt (1 teaspoon coarse kosher salt or 2 teaspoons Diamond Crystal) in the jar of a blender. Purée until smooth and the consistency of heavy cream. Taste and season with salt and lime juice if necessary. Transfer to a medium bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working one at a time and using tongs, dip a tortilla into the purée, turning to completely coat in sauce. Transfer to a baking sheet as you go."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange 4 egg quarters and a few pieces of asparagus down the center of each tortilla. Fold one side over, then roll up the tortilla. Place seam-side down on a plate. Repeat with the remaining tortillas, dividing among plates and spooning the remaining pepita purée over. Top with the reserved pepitas, scallions, egg quarters and any remaining asparagus."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023146-papadzules-eggs-and-asparagus-in-tortillas-with-pepita-sauce"}