{"@context": "http://schema.org", "@type": "Recipe", "name": "Conchas", "description": "Without a doubt, conchas are the most iconic of Mexican pan dulce, a category that includes sweet rolls, pastries and cookies. They are such an important part of everyday life in Mexico that you're sure to run into one anywhere in the country, as long as there is a panadería or a small grocery nearby. The soft, brioche-style buns are firm enough to hold their shape while carrying a sweet and crumbly topping traditionally engraved with a seashell design. (Special concha molds can be ordered online, but everyday kitchen tools like a wooden popsicle stick or a dinner knife work well, too.) The most popular flavors are vanilla and chocolate. This recipe includes those topping options, as well as a playful café con leche flavor.", "author": {"@type": "Person", "name": "Pati Jinich"}, "image": "https://static01.nyt.com/images/2022/03/23/dining/21conchasrex1/merlin_203820735_814f6458-aa1b-4232-9c23-313907dcd691-articleLarge.jpg", "totalTime": "PT7H30M", "recipeYield": "15 buns", "recipeCuisine": "mexican", "recipeCategory": "breads, pastries, project", "keywords": "butter, egg, flour, vegetable shortening", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 328}, "recipeIngredient": ["4 cups/520 grams all-purpose flour (or bread flour, see Tip), plus more for dusting", "7 tablespoons/87 grams granulated sugar", "2 teaspoons coarse kosher salt (Morton)", "1 tablespoon instant yeast", "3/4 cup/175 grams whole milk, at room temperature", "4 large eggs, at room temperature", "2 teaspoons vanilla extract", "13 tablespoons/185 grams unsalted butter, diced and brought to room temperature, plus more for greasing", "1 1/2 cups/180 grams confectioners’ sugar", "1 1/2 cups/184 grams all-purpose flour, plus more as needed", "1 cup/180 grams vegetable shortening", "1 tablespoon vanilla extract", "1 1/2 cups/180 grams confectioners’ sugar", "1 1/2 cups/184 grams all-purpose flour, plus more as needed", "1 cup/180 grams vegetable shortening", "1 teaspoon vanilla extract", "2 tablespoons instant espresso coffee combined with 2 teaspoons boiling water", "1 1/2 cups/180 grams confectioners’ sugar", "1 1/3 cups/170 grams all-purpose flour, plus more as needed", "1 cup/180 grams vegetable shortening", "1/4 cup/22 grams cocoa powder combined with 3 tablespoons boiling water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Whisk the flour, sugar, salt and yeast in the bowl of a stand mixer fitted with the dough hook. Add the milk, eggs and vanilla. Mix on the lowest speed to combine without the flour splattering out of the bowl, about 20 seconds. (If needed, use a spatula to push the flour mixture toward the hook.) Raise speed to medium-high and mix until the dough slaps and pulls away from the sides of the bowl and starts to form a smooth, elastic ball around the hook, 10 to 15 minutes. Stay close to your mixer because it will start jumping all over your counter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce speed to low and add the butter gradually, in 3 to 4 additions. Once all butter is added, increase speed to medium-high. Continue mixing until the dough is again pulling away from the sides of the bowl, loudly slapping it and gathering into a very soft, elastic, silky and shiny mass that hugs the dough hook, 8 to 12 minutes. Again, stay close to your mixer because it will jump. The moment you stop beating the dough, it will relax into the bowl again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dough to a large buttered bowl. To activate the gluten further, stretch and fold the dough: Using one or both of your hands, reach down between the greased side of the bowl and the dough, and lift the dough up out of the bowl and fold the dough over itself. Rotate the bowl 90 degrees and repeat the process three more times. Cover the bowl with plastic wrap, place it in the refrigerator for the first rise and let it chill anywhere from 4 hours to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover three 13-by-18-inch rimmed baking sheets with parchment paper. Cover a small area of your countertop with a light layer of flour. Bring the dough out of the refrigerator and, using your hands or a bench scraper, cut it into 15 pieces, each about 76 grams, which is about a ⅓-cup scoop. One by one, pat each piece of dough into a flat shape on the floured surface, then draw the edges into the center, working your way around, pinching the dough together into the center of what should now be a ball. Turn the ball over, cup it with your hand and move it in circles, rolling it over the counter for a few seconds to make a neater round. Repeat with the remaining conchas and place 5 equally spaced balls on each of the 3 prepared baking sheets. Make sure there is a bit of flour on the counter before pressing each piece of dough, as the dough is very sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make your preferred topping (see Tip): Combine all the ingredients for the selected topping flavor in the bowl of a stand mixer fitted with the paddle attachment and mix on the lowest speed until the ingredients begin to combine, about 20 to 30 seconds. Raise the speed to medium and mix to form a glossy and smooth mixture, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a small bowl halfway with warm water to wet your hands while you work to divide and shape the topping. Portion the topping with a soup spoon to create 15 portions that are about 30 grams each. Wet your hands thoroughly and roll one portion of the topping into a ball. Set the ball in one palm and, using the other hand, pat it out into a 3½-inch round, as if you were patting a thick tortilla. (The topping is very sticky and soft, like a thick frosting, so you should moisten your hands as needed.) Place the round disk over a concha and slide your fingers around the edges of the topping, pressing it lightly around the rim to gently adhere to the bun. The topping should not go all the way down to the parchment paper, but be at least about ¼ inch from it. Repeat to top the remaining conchas, keeping your hands wet throughout."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make a shell pattern, dip a concha mold into flour to coat and very gently press the mold on the topping from one side to the other in a rolling motion, doing so swiftly and with determination as you move from side to side. (Dipping the mold in flour prevents it from sticking to the topping and prevents the topping from peeling away from the dough.) The mold should make a shell-shaped mark on the concha topping, merely indenting it without breaking through to the dough. If you don’t have a concha mold, you can make the shape with a dinner knife by dipping it in flour and marking each concha with curves, lines or squares, but avoiding piercing through to the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the conchas with clean kitchen towels and set in a warm, draft-free area of your kitchen until they puff considerably, anywhere from 1½ to 2 hours. (They don’t need to double in size.) At this point, the shaped toppings may have spread slightly, opening a bit more into the indented shapes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Bake the conchas until golden brown and even more puffed, about 20 to 22 minutes. (If all three sheet pans don’t fit in the oven at once, you can simply bake the third batch after you’ve baked the first two.) Remove from the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let rest for a few minutes before serving. Conchas are best the day they are baked, but can be stored in an airtight container for up to 4 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023045-conchas"}