{"@context": "http://schema.org", "@type": "Recipe", "name": "Miyeok Guk (Seaweed Soup)", "description": "People eat miyeok guk on birthdays to celebrate not just their own birth, but their mother’s sacrifice as well — which is why it is often known as birthday soup. This miyeok guk (ME-yuhk gewk) forgoes the more common beef broth for mussels and an aromatic base of onion, garlic and anchovies. Though not traditional, the addition of parsnip, for sweetness and umami, yields a broth with body, like the kind you would get with the usual brisket. Scooped out of their shells, mussels become little morsels in the soup, nuggets of briny joy.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/06/15/dining/15ESSENTIALSrex4/15ESSENTIALSrex4-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 to 6 servings", "recipeCuisine": "korean", "recipeCategory": "dinner, lunch, seafood, soups and stews, main course", "keywords": "miyeok, mussels, seaweed", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "recipeIngredient": ["1 pound fresh mussels", "20 grams miyeok, often labeled as dried seaweed, crushed into small pieces (about 3/4 cup)", "4 oil-packed anchovies plus 1 tablespoon anchovy oil", "1 tablespoon toasted sesame oil", "1 small onion, halved and thinly sliced", "1 small parsnip, peeled, halved lengthwise and thinly sliced crosswise into half-moons", "7 garlic cloves, crushed and coarsely chopped", "Salt", "3 tablespoons fish sauce", "2 tablespoons soy sauce", "Steamed white rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the mussels and seaweed: Put on a kettle of water to boil. Place the mussels in a medium bowl, pour over enough hot water to cover by 1 inch and soak them until they open, about 15 minutes. In a large bowl, add the dried seaweed and enough cold water to cover by 3 inches; let soak for about 15 minutes as well. During this time, the seaweed will expand considerably."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dump the mussels into a clean sink and spray with cold running water so they’re easier to handle. Open each mussel and, using your fingers, carefully scoop out the flesh. (The best way to do this is to loosen the edges of the mussel first, then peel the mussel off the shell in one piece.) Place all the scooped mussels into their original medium bowl, rinse with cold water, drain well and refrigerate until ready to use. Drain the soaked seaweed and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the soup: In a large pot or Dutch oven, add the anchovies, anchovy oil, sesame oil, onion, parsnip and garlic, and turn the heat to medium-high. Cook, stirring occasionally, until the anchovies break down and the vegetables become fragrant and lightly browned at the edges, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 6 cups water, plus the fish sauce, soy sauce and the drained seaweed. Bring to a boil over high, stirring occasionally, then reduce the heat and simmer, partly covered, until the seaweed is soft and slippery and the broth is deeply flavored with seaside savoriness, 15 to 20 minutes. Taste and season with salt if needed. Stir in the mussels, bring back to a vigorous boil and serve the soup hot, with bowls of white rice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023239-miyeok-guk-seaweed-soup"}