{"@context": "http://schema.org", "@type": "Recipe", "name": "Sabzi (Spinach and Lamb Stew)", "description": "Sabzi is one of the traditional dishes served during Afghan Nowruz, the celebration of the new year and vernal equinox, and Durkhanai Ayubi included this recipe from her mother, Farida Ayubi, in their cookbook “Parwana: Recipes and Stories From an Afghan Kitchen.” The rich green hue of this dish symbolizes the arrival of spring and new life. In the book, Ms. Ayubi uses a pressure cooker for the lamb — you can as well — but the stovetop version below doesn’t take very long. Either way, the lamb becomes tender in an intensely flavorful broth of onion, garlic and chile. It then simmers in cooked spinach, fragrant with fried cilantro and garlic chives. This soul-affirming sabzi, along with its traditional accompaniment of <a href=\"https://cooking.nytimes.com/recipes/1023021-challaw-cardamom-and-cumin-basmati-rice\">challaw</a>, a spiced Afghan rice dish, is a welcome way to celebrate the reawakening of nature.", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2022/03/16/dining/16nowrozrex1/merlin_203116119_f0a79b8b-96df-49bf-bb91-40aae9f8d5d4-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews, main course", "keywords": "cilantro, lamb, nowruz, spinach, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 558}, "recipeIngredient": ["1 cup sunflower or grapeseed oil", "1 large yellow onion, finely chopped", "2 large garlic cloves, finely chopped", "1 fresh, long red chile (such as Holland), thinly sliced", "2 1/4 pounds boneless lamb stew meat (preferably shoulder or leg), cut into 2-inch chunks", "Salt", "1 large bunch cilantro, leaves and tender stems finely chopped (1 1/2 cups)", "1 bunch garlic chives or scallions, green parts only, finely chopped (1/2 cup)", "2 1/4 pounds spinach (about 4 bunches), stems removed, finely chopped (see Tip)", "<a href=\"https://cooking.nytimes.com/recipes/1023021-challaw-cardamom-and-cumin-basmati-rice\">Challaw</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven or similar pot, heat 1/2 cup oil over medium-high. Add the onion, garlic and chile, and cook, stirring frequently, until golden brown, 8 to 10 minutes. Push the vegetables to one side and add the lamb to the other. Cook until lightly browned on all sides, 3 to 8 minutes total. Add 2 tablespoons kosher salt (or 1 tablespoon coarse kosher salt or fine salt) and 4 cups water, then stir and bring to a gentle boil, skimming any scum that rises to the surface. Cover, reduce heat to low and cook until the lamb is tender, 1 hour and 5 minutes to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a kettle or a small saucepan, bring 1/2 cup water to a boil, and keep at a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a very large skillet with a lid, heat the remaining 1/2 cup oil over medium. Add the cilantro and garlic chives, and fry, stirring occasionally, to bring out all the flavors, about 5 minutes. Transfer the mixture to a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the same skillet over medium-high heat (no need to wash), add the chopped spinach and the just-boiled water, and cover partially. Cook, stirring occasionally, until all the liquid is gone, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the lamb, 1 cup of its cooking liquid (any remaining broth can be refrigerated or frozen for another use) and the cilantro mixture to the spinach. Stir to combine well, then reduce the heat to low and simmer, uncovered, until all the flavors mingle, about 15 minutes. Taste, season with salt if desired and serve with <a href=\"https://cooking.nytimes.com/recipes/1023021-challaw-cardamom-and-cumin-basmati-rice\">challaw</a>."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023020-sabzi-spinach-and-lamb-stew"}