{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Cabbage Caesar Salad With Chickpeas", "description": "This is not your usual Caesar salad. It forgoes the lettuce for wedges of roasted cabbage and replaces the croutons with roasted chickpeas. The Caesar dressing is a cheater’s version, using store-bought mayonnaise instead of fresh egg yolks; roasted garlic adds creamy richness, while briny capers and lemon evoke traditional Caesar flavors. A hot oven and a heated sheet pan are your friends here — start heating as soon as you think about cooking this dish — ensuring that everything cooks quickly and evenly. The cabbage caramelizes on the outside while the interior retains crisp-tenderness, and the chickpeas become warm and creamy with just a bit of crunch. (If you want them crispier, roast for 10 to 15 minutes more.) To make this dish vegan, use plant-based mayonnaise and omit the Parmesan.", "author": {"@type": "Person", "name": "Hetty McKinnon"}, "image": "https://static01.nyt.com/images/2022/03/07/dining/hm-roasted-cabbage-caesar/merlin_201502965_62ffcc50-587f-4d69-b928-ef3e39729b86-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weeknight, salads and dressings, vegetables, appetizer, main course, side dish", "keywords": "cabbage, chickpea, mayonnaise, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 834}, "recipeIngredient": ["2 (15-ounce) cans chickpeas, well drained, or 4 cups cooked chickpeas", "1/2 cup extra-virgin olive oil, plus 2 to 3 tablespoons more", "6 garlic cloves (1 peeled and 5 unpeeled)", "1 lemon", "Kosher salt (Diamond Crystal) and black pepper", "2 1/2 to 3 pounds green cabbage (about 1 medium head), cut into 8 wedges, core intact so that the wedges stay together (see Tip)", "1/2 cup mayonnaise", "2 tablespoon capers, drained and finely chopped", "Parmesan, shaved or grated, for serving", "Handful of soft herbs, such as parsley or basil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees, with one rack in the middle and one at the top. Place a sheet pan on the middle rack to heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a shallow tray that will fit the chickpeas snugly in a single layer, add the chickpeas and ½ cup of extra virgin olive oil. (A 9-by-13-inch pan works well here.) Grate the peeled clove of garlic into the chickpeas. Using a vegetable peeler, peel 2 to 3 thick strips of rind from the lemon into the chickpeas. Season with ¾ teaspoon kosher salt and a good grind of black pepper, and stir. Place the chickpeas on the top rack of the oven and roast for 25 to 30 minutes, stirring once halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cabbage wedges on a plate and drizzle with 2 to 3 tablespoons of olive oil, turning them to coat. Season with salt and black pepper. Take the hot sheet pan out of the oven and add the cabbage wedges, cut side down. Add the 5 unpeeled garlic cloves to the tray. Place on the middle rack and roast for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the mayonnaise and capers into a small bowl. Cut the lemon, and squeeze the juice of one half into the bowl, and add 1 tablespoon of water. Whisk to combine. Taste and season with salt, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 15 minutes, remove the tray of cabbage from the oven, flip the cabbage wedges, then return to the oven. Roast for another 8 to 10 minutes, until the cabbage is golden and tender. The chickpeas should be crispy in parts and ready, too."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the tray of cabbage from the oven. (Remove the chickpeas from the oven or leave them there for a few more minutes to continue crisping while you finish the dressing.) Carefully remove the skin from the garlic, then smash them with the flat side of a knife until you have a paste. Add the garlic paste to the mayonnaise and capers, and stir. Taste and season with salt and black pepper, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place two cabbage wedges on a plate. Top with chickpeas and some of the chickpea roasting oil. Top with Caesar dressing, Parmesan and herbs. Squeeze the other lemon half over the top and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023025-roasted-cabbage-caesar-salad-with-chickpeas"}