{"@context": "http://schema.org", "@type": "Recipe", "name": "Frijoles Borrachos (Drunken Beans)", "description": "The method of cooking beans with beer originated in northern Mexico (Monterrey is the country’s brewery capital), then traveled with the cowboys on cattle drives. It’s easy to imagine a cauldron of beans simmering over a fire, the cook tossing in bits of meat from the grill, then pouring in beer to cover the beans, which might have been more convenient than water. According to</span><a href=\"https://www.nytimes.com/2018/11/29/obituaries/patricia-quintana-dead.html\"><span> </span></a><span>“The Taste of Mexico” (</span><span>Harry N. Abrams, 1986) </span><span>by Patricia Quintana, the food of northern Mexico is often associated with grilled meats, but it is also epitomized by spicy beans like frijoles charros (or </span><a href=\"https://cooking.nytimes.com/recipes/1017495-simple-pinto-beans\"><span>cowboy beans</span></a><span>) and drunken beans. Bacon (or Mexican chorizo or other fatty meats) provide a rich base in which to cook vegetables like onions and peppers, while the beer makes the beans brighter and sharper but not boozy. Eat a bowl with grilled meats, flour tortillas or solo.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2023/01/17/multimedia/as-drunken-beans-jgmc/as-drunken-beans-jgmc-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, beans, main course, side dish", "keywords": "bacon, beer, jalapeño, make-ahead, pinto beans, plan-ahead, poblano, serrano", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 360}, "recipeIngredient": ["1 pound dried pinto beans", "5 slices thick-cut bacon, thinly sliced crosswise", "1 large yellow or white onion, coarsely chopped", "4 garlic cloves, chopped", "2 jalapeño, serrano or poblano peppers, seeded and coarsely chopped ", "Handful of cilantro sprigs, stems finely chopped and leaves left whole", "2 medium to large tomatoes, coarsely chopped", "Salt ", "12 ounces light or dark Mexican beer (1 bottle or can) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, cover the beans with plenty of water and soak for 8 to 12 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, in a large Dutch oven or pot, add the bacon, set over medium heat and cook, stirring occasionally, until golden and crisp, 5 to 8 minutes. Use a slotted spoon to transfer the bacon to a plate or bowl, leaving the fat in the pot. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onions, garlic, peppers and cilantro stems to the bacon fat and cook until softened and browned in spots, 10 to 12 minutes. Stir in the tomatoes and scrape up any browned bits on the bottom of the pot. Use a slotted spoon to transfer the beans to the pot. Pour in enough of the bean’s soaking liquid to cover the beans by 1 inch; if you run out of soaking liquid, use fresh water. Season generously with salt. Bring to a boil over high, then reduce heat to simmer until beans are tender but not yet soft or falling apart, 1 to 1 1/2 hours. Check the beans periodically and if the water level is below the beans, add soaking liquid or, if you’re out, fresh water to cover. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the bean liquid and if it tastes dull or murky, add salt. Pour in the beer and gently simmer until liquid has thickened slightly and the beans are soft and creamy, 30 to 40 minutes. Taste more than one bean to ensure they’re all cooked through; they should flatten without much effort when pressed between your fingers. Stir in the reserved bacon, then season to taste with salt. Eat with the reserved cilantro leaves. Beans will keep for up to 5 days refrigerated."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023834-frijoles-borrachos-drunken-beans"}