{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish With Citrus-Chile Sauce", "description": "This light yet earthy sauce lends a generous, almost floral warmth to any white, sturdy fish. For heat, there are crushed Calabrian chiles, smoky and sunny; for a mellow sourness, Moscatel vinegar — feel free to substitute apple cider vinegar and a little sugar to approximate the same fruitiness; and for funk, fermented white pepper (although regular white pepper will work too). Other notes include delicate marjoram, cousin to oregano but less forward, with its comforting contour of balsam, and Timur pepper from Nepal, fragrant and bright, calling to mind a just-peeled tangerine. (If you use Sichuan pepper instead, give it a citrus boost with extra orange juice and a shower of orange zest.) The sauce comes out denser than a vinaigrette but still loose and the orange-red of a young sunset.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2022/07/31/dining/31EAT-fish-with-chile-citrus-sauce/merlin_210597681_83f81251-75d7-4280-82f9-092aeea025ba-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, seafood, main course", "keywords": "Calabrian chile, marjoram, Moscatel vinegar, timur peppercorn, white peppercorns, healthy", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 143}, "recipeIngredient": ["1/2 teaspoon Timur (Timut) peppercorns (see Tip)", "1/4 teaspoon white peppercorns, preferably fermented (see Tip)", "1 1/2 tablespoons Moscatel vinegar (see Tip)", "2 teaspoons crushed Calabrian chiles (in oil)", "1 1/2 teaspoons fresh marjoram leaves, finely chopped", "1/2 teaspoon orange or tangerine juice", "1 small garlic clove, minced", "3 tablespoons extra-virgin olive oil", "Salt", "4 sturdy white fish fillets or steaks (about 6 ounces each), such as halibut, red snapper, sea bass or swordfish", "Salt and pepper", "Olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Toast the Timur pepper in a dry skillet over medium heat. When the pods are fragrant but not yet darker brown, remove them from the heat and let cool. Using a spice grinder or a mortar and pestle, crush into a fine powder, along with the white peppercorns."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the vinegar, chiles, marjoram, juice, garlic and the freshly ground Timur and white pepper. Let sit for 30 minutes for the flavors to meld, then gradually whisk in the olive oil. Add salt. Taste and add more of whichever seasonings you like, whisking as you go. Use immediately or refrigerate in an airtight container for up to 1 week. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the fish: Pat the fish dry and season on both sides with salt and pepper. If cooking on the stovetop, coat a skillet with oil and heat over medium-high. (The skillet should be large enough to hold all the fillets with space between them. If it isn’t, work in batches.) Carefully add the fish to the hot oil and pan-fry the fish until browned, about 3 minutes on each side. (Gently probe the fish with a fork; if it flakes, it’s done.) Remove from the heat and transfer to plates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If grilling, heat a grill to medium-high. Generously brush or rub the fish with olive oil to coat. Place on the hot grill grates, skin side down if there’s skin and cover if using a gas grill. Cook until the fish releases easily from the grate, about 3 minutes. For thinner fillets, the flesh will be just opaque throughout and starting to gape and the fillets don’t need to be flipped. Simply transfer them to plates. For thick fillets or steaks, carefully flip the fish and cook until just opaque throughout, 2 to 3 minutes more, then transfer to plates. Spoon the sauce over the fish and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023372-fish-with-citrus-chile-sauce"}