{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato Buttermilk Pull-Apart Rolls", "description": "With its luscious mouthfeel and round flavor, the sweet potato is a quintessential soul food ingredient. In this recipe, from “Tanya Holland’s California Soul: Recipes From a Culinary Journey West” (Ten Speed Press, 2022), Ms. Holland uses the vegetable’s texture and flavor as background notes in these buttery pull-apart rolls. While you can make the dough easily using a stand mixer, you can also do it by hand with a whisk, achieving the same finished product. Serve the rolls with room temperature butter for spreading, or alongside a soup, for soaking up broth.", "author": {"@type": "Person", "name": "Korsha Wilson"}, "image": "https://static01.nyt.com/images/2022/11/30/dining/30hollandrex3-sweet-potato-rolls/30hollandrex3-sweet-potato-rolls-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "15 rolls", "recipeCuisine": "", "recipeCategory": "dinner, snack", "keywords": "buttermilk, instant yeast, make-ahead, plan-ahead, roll and bun, soul food, sweet potato, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 144}, "recipeIngredient": ["1 small orange-fleshed sweet potato (6 ounces), peeled and cut into 1-inch chunks", "Salt", "1/2 cup buttermilk", "1/4 cup unsalted butter, at room temperature, plus more for greasing and about 3 tablespoons melted butter for brushing the rolls", "4 cups/512 grams all-purpose flour, plus more as needed", "2 1/4 teaspoons instant yeast (1 envelope)", "2 tablespoons granulated sugar", "2 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine the sweet potato with enough water to cover. Add 1 teaspoon salt. Bring to a boil over high heat, then turn down the heat to medium and gently boil until the sweet potato is very tender when pierced with a knife, 10 to 13 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain and transfer the sweet potato to a large bowl. Mash with a potato masher or fork. Add the buttermilk and 1/4 cup of the butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re using a stand mixer, beat the sweet potato mixture with a paddle attachment at medium-low speed until fairly smooth, about 5 minutes. Add the flour, yeast, sugar, eggs and 1 1/2 teaspoons salt and mix on medium-low speed, scraping the bottom and sides of the bowl as needed with a spatula, until the dough is smooth and sticky and pulls away from the sides of the bowl, about 8 minutes. Add a little more flour if the dough is very sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re using a whisk, beat the sweet potato mixture in the bowl until the mixture is fairly smooth and no lumps remain. Add the flour, yeast, sugar, eggs and 1 1/2 teaspoons salt and stir with a wooden spoon until the ingredients are well combined. Dump the dough onto a lightly floured work surface and knead until it becomes smooth and elastic, about 8 minutes; it will be slightly sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease the inside of a large bowl with butter. Transfer the dough to the bowl. Cover and let the dough rise in a warm, draft-free spot for about 1 1/2 hours, or until it has more than doubled in size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dough on a clean, ungreased surface and divide it into 15 equal pieces, each weighing about 65 grams. Working with one piece of dough at a time, cup each piece beneath your palm and work in quick, circular motions to form a tight ball, with only a tiny seam along the bottom."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a 9-by-13-inch baking pan with more butter and arrange the dough balls in evenly spaced rows. Brush the balls with butter, loosely cover the pan and set aside in a warm place until the balls have turned puffy, doubled in size, and fill the pan, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 15 minutes before the rolls are done rising, heat the oven to 375 degrees. Bake the rolls until golden brown, 15 to 20 minutes. Transfer the pan to a wire rack. Brush the rolls gently with a little more butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool for 10 minutes, and then turn out the rolls onto the rack and invert again so they are bottom-side down. Let cool for about 20 minutes before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023690-sweet-potato-buttermilk-pull-apart-rolls"}