{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Pumpkin Seed Pesto", "description": "Fragrant with basil and rich with pumpkin seeds and cheese, this is the ideal dish to make ahead of time and pack for lunch. Instead of preparing it to eat as a hot meal or a cold salad, it’s designed to be chilled and then enjoyed cold or at room temperature. Cooking the garlic quickly in the water boiled for the pasta softens its sharp edge. A splash of that same boiling water blends with the basil to keep it green. Rinsing the pasta after cooking it helps the pesto stay flavorful for days in the refrigerator. The tomatoes add a tangy freshness, but they can be skipped altogether or swapped for green beans or peas (just drop them with the pasta during the last few minutes or cooking).", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/08/31/dining/31korex-pasta-1/merlin_211927842_67444fec-d194-4bd0-acc7-d6fbebbe0878-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, quick, weeknight, pastas, main course", "keywords": "basil, make-ahead, parmesan, pasta, pumpkin seeds, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 500}, "recipeIngredient": ["Salt and pepper", "2 garlic cloves, peeled", "1 pound fusilli or other short, curly pasta", "1/3 cup pumpkin seeds (pepitas), plus more for sprinkling", "1 large bunch basil (4 ounces), leaves and tender stems picked (3 cups)", "2/3 cup/2½ ounces finely grated Parmesan, plus more for sprinkling", "1/2 cup extra-virgin olive oil", "1 1/2 cups grape or cherry tomatoes, halved (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large saucepan of generously salted water to a boil. Drop the garlic cloves into the boiling water and boil for 30 seconds to temper their sharpness. Use a slotted spoon to transfer the cloves to a food processor or blender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop the pasta into the boiling water and cook until al dente."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta cooks, add the pumpkin seeds and a pinch each of salt and pepper to the garlic, and process until very finely ground. Scrape the sides of the bowl and add the basil. Scoop 1/4 cup water from the saucepan with the boiling pasta and pour over the basil. Process the basil until ground to a paste. Add the Parmesan and oil, and pulse just until incorporated. Taste the pesto and season with enough salt and pepper to make it punchy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the pasta and rinse under cool water until room temperature. Shake dry, then return to the saucepan, and add the pesto and tomatoes, if using. Stir well until everything is evenly coated. Season to taste with salt and pepper. Divide among dishes to serve right away or airtight containers to pack for lunch. Sprinkle with pumpkin seeds and Parmesan, and serve, or cover and refrigerate for up to 5 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023430-pasta-with-pumpkin-seed-pesto"}