{"@context": "http://schema.org", "@type": "Recipe", "name": "Keema Bhare Karelay (Bitter Melon Stuffed With Minced Chicken)", "description": "The intoxicating bitterness of karelay (also known as bitter melon or bitter gourd), is either loved or hated. This divisive vegetable needs a bit of coaxing to truly shine, and, in this recipe, marinating the peeled and cored melon in salt draws out the lion’s share of its bitterness. The result is a delicately pungent flavor perfectly suited to the vegetable’s texture. There are two varieties of bitter melon: This recipe, a common preparation in Pakistan and Northern India, calls for the South Asian type (often labeled “Indian”), which is a darker green and has more pronounced ridges and tapered tips than the Chinese variety. The melons are stuffed with a ground chicken filling that comes together quickly and can be prepared up to two days ahead. Though this dish is rewarding for those who already have a taste for bitter foods, its adaptability makes it the perfect gateway for cultivating one.", "author": {"@type": "Person", "name": "Zainab Shah"}, "image": "https://static01.nyt.com/images/2022/03/15/dining/zs-bitter-melon/zs-bitter-melon-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, meat, vegetables, main course", "keywords": "garlic, ground chicken, thai chili", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "recipeIngredient": ["1 pound bitter melon (about 5 medium), peeled", "3 teaspoons fine sea salt", "1 cup mustard oil, ghee or any neutral oil", "1 medium onion, finely chopped", "1 teaspoon ginger paste or freshly grated ginger", "1 teaspoon garlic paste or freshly grated garlic (about 2 cloves)", "1 pound ground chicken", "1 teaspoon cumin seeds", "1/4 teaspoon ground coriander", "1/2 teaspoon kashmiri red chile powder or other ground red chile", "1/4 teaspoon ground turmeric", "1 medium plum tomato, finely chopped", "3 fresh Thai green chiles, stems removed, chopped", "2 to 3 tablespoon fresh lemon juice, from about 1/2 lemon", "Roti or store-bought pita, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a slit along the length of each melon, leaving about an inch intact on the ends. Remove the seeds and discard (see Tip 1). Rub 2 teaspoons of salt evenly on the surfaces and insides of the melons. Set aside for at least 20 minutes while you prepare the stuffing (see Tip 2)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot heat 1/4 cup mustard oil for 30 seconds. Add onion, ginger and garlic, and cook on medium for 4 to 5 minutes, stirring occasionally, until translucent and fragrant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chicken and remaining 1 teaspoon salt, and cook on high, stirring occasionally, until most of the liquid has evaporated, and some bits of the minced chicken start to crisp, about 7 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower heat to medium and add cumin, coriander, chile powder and turmeric. Stir and continue cooking for 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/4 cup water and chopped tomato. Cook on high, stirring occasionally until the oil starts to separate, about 5 minutes. Stir in green chiles and lemon juice. Turn off the heat. (The stuffing can be made up to 2 days ahead and brought to room temperature before assembly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze and drain the reserved salted melon. Thoroughly rinse the inside and outside with cold water. Pat dry. (The drier the melon, the easier it will be to fry.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a frying pan large enough to comfortably fit the five stuffed melons in a single layer, add the remaining 3/4 cup mustard oil and heat for 30 to 45 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently place the melons into the pan and shallow fry on medium until the bottom and sides are deep golden brown, but mostly brown, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the melons on a plate lined with a paper towel to soak up any excess oil. Remove the paper towel. Using a teaspoon, stuff the melons with the stuffing. Serve with the rest of the prepared stuffing and roti, store-bought pita or by itself."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023038-keema-bhare-karelay-bitter-melon-stuffed-with-minced-chicken"}