{"@context": "http://schema.org", "@type": "Recipe", "name": "Blackberry Apple Pie", "description": "Packed with spiced fruit, this feels like an old-fashioned apple pie, with a coziness beneath the modern lattice. Juicy blackberries highlight the tanginess of sweet-tart apples and tint the filling a mellow shade of pink. Wide dough strips, tightly woven, leave just enough of a gap in the top to allow a little steam to vent. Keeping the abundance of fruit mostly encased helps it bake through to tenderness and allows their juices to thicken to a jammy syrup. If you don’t want to weave a lattice, you can simply cover the filling with a round of rolled dough and cut vent holes in it.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/11/13/dining/13PIESREX-blackberry-apple/merlin_214872687_19d9a5c6-6bfa-43b1-8f61-81919b998e82-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "One 9-inch pie", "recipeCuisine": "", "recipeCategory": "pies and tarts, dessert", "keywords": "apple, apple pie, blackberry, lemon juice, pie, pie dough, fall, winter, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 329}, "recipeIngredient": ["2/3 cup/140 grams granulated sugar", "1/4 cup/34 grams cornstarch", "2 teaspoons apple pie spice or your favorite blend of <a href=\"https://cooking.nytimes.com/recipes/1021926-sweet-baking-spice\">baking spices</a>", "1/4 teaspoon fine sea or table salt", "12 ounces/340 grams blackberries (about 3 scant cups), cut into halves", "3 1/4 pounds/1 1/2 kilograms tart-sweet apples (about 8 medium), such as Ginger Gold and Honeycrisp, peeled, cored and cut into 1/2-inch cubes", "1 1/2 tablespoons fresh lemon juice", "1 full recipe <a href=\"https://cooking.nytimes.com/recipes/1023573\">All-Butter Pie Crust</a>, chilled as 3 disks for a double-crust lattice pie", "All-purpose flour, for rolling ", "2 tablespoons cold unsalted butter, cut into small pieces", "2 tablespoons heavy cream", "Sparkling or other coarse sugar, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a very large bowl, whisk the granulated sugar, cornstarch, spice and salt. Add the blackberries, apples and lemon juice, and stir until the fruit is evenly coated. Let stand for at least 45 minutes and up to 2 hours for the fruit to get juicy, stirring now and then."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the dough has been refrigerated for more than an hour, let sit at room temperature for 10 minutes first. On a lightly floured surface, use a lightly floured rolling pin to roll the dough for the bottom (250 grams) into a 13 1/2-inch round. Roll the dough up onto the pin, then unroll it over a deep-dish 9- or 9 1/2-inch pie plate, centering it. Gently tuck and press it into the bottom and sides of the plate without stretching the dough, trimming the edges 1/4 inch past the rim. Refrigerate until firm and ready to fill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured sheet of parchment paper, roll 1 of the disks for the lattice top into a 12-inch round. Cut a 3-inch-wide strip followed by a 1 1/2-inch-wide strip. Repeat for 5 strips total, 3 thick and 2 thin. Slide the dough on the parchment onto a baking sheet and refrigerate. Repeat with the remaining dough disk, cutting in the same way, then chilling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a rack in the lowest position in the oven and heat the oven to 425 degrees. Line a half-sheet pan with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the pie plate out of the refrigerator. Stir the apple mixture well and scoop half into the raw bottom dough. Spread in an even layer and pack down as firmly as possible to eliminate gaps between the fruit. Scrape in the rest of the filling and all the juices in the bowl, and scatter the cold butter bits evenly over the fruit. Press down on the fruit, tucking in the butter bits so they’re not sitting on top. The fruit will be taller than the pie plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the 2 rounds of dough strips out of the refrigerator. Lay the 5 strips of one round on top of the pie so the strips, alternating thick and thin, are touching but not overlapping and completely cover the filling. Lift and fold back the 3 thick strips at the midsection of the pie, and lay a thick strip from the other round down at an angle. Unfold the thick strips over the angled thick strip, then fold back the alternating 2 thin strips and lay another thin strip down at an angle, as close to the parallel thick strip as possible. Repeat to create a tightly woven lattice that completely covers the pie. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the strips so they evenly extend about an inch past the bottom dough. Tuck the strips under the bottom dough so the folded-over dough extends a touch beyond the rim of the pie plate. Crimp the edges of the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the cream all over the top of the dough and sprinkle with the sparkling sugar. Place the pie plate on the prepared sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake on the lowest oven rack for 20 minutes, then turn the oven temperature down to 350 degrees. Bake until the crust is golden brown and the fruit juices are thick and bubbling out in gaps in the lattice, about 1 hour 15 minutes. If you slide a metal cake tester or toothpick through one of those gaps, you shouldn’t feel much resistance from the fruit. Cool completely and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023581-blackberry-apple-pie"}