{"@context": "http://schema.org", "@type": "Recipe", "name": "Seolleongtang", "description": "Seolleongtang (SULL-lung-tahng), also known as ox bone soup, is a deeply comforting dish seemingly magicked out of just bones, sometimes a small hunk of meat, and scallions, if you have them. This version is especially pared down, relying mostly on the bones, which are boiled over multiple hours to imbue the broth with fatty redolence. The best seolleongtang is made from reused bones kept specifically for this dish, which is why batches made with fresh bones may not have the quintessential milky whiteness characteristic to this dish. The broth is seasoned with a quick, gremolata-like mix of scallion, garlic and sea salt.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/06/15/dining/15ESSENTIALSrex3/merlin_207573363_39b16aeb-a93f-429e-891a-54bcef56b998-articleLarge.jpg", "totalTime": "PT3H15M", "recipeYield": "4 servings", "recipeCuisine": "korean", "recipeCategory": "meat, soups and stews, main course", "keywords": "brisket, kimchi, scallion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 111}, "recipeIngredient": ["3 to 4 pounds beef leg bones (see Tip)", "1 pound brisket or chuck roast", "8 scallions, thinly sliced", "8 garlic cloves, finely grated", "4 teaspoons flaky sea salt, plus more as desired", "Steamed white rice, for serving", "Very ripe radish kimchi, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the beef bones and brisket in a very large stockpot (the biggest you have), and add enough cold tap water to fully cover by 1 inch. Bring to a boil over high heat and cook until the bones and meat are no longer pink and a gray foam collects at the surface, about 10 minutes. Drain in a colander and rinse the bones under cold tap water. Rinse out the pot, as well, if it is especially dirty, and add back the bones and meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 5 quarts cold tap water to the pot and bring to a boil over high heat, then reduce the heat to gently boil. Partly cover and cook until the soup is rich with marrow flavor and milky-white in color, about 3 hours. (For the milkiest soup, you want to maintain this gentle boil, which should be more vigorous than a simmer but less volatile than a hard boil.) During these 3 hours, you don’t need to stir, but you should check the water level once or twice to make sure the bones stay covered with liquid; add more cold tap water to the pot if this level gets too low, which can happen if your stove is especially strong."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully drain the contents of the pot into a colander set in a large bowl. Take out the brisket, slice it thinly against the grain and set aside. Rinse, cool and freeze the bones to use them again another time. At this point, you can refrigerate the soup overnight to remove the fat, which will harden on top once chilled and be easy to remove (don’t forget to refrigerate the brisket, too), or you can pour it back into a clean pot and, just before serving, bring to a simmer over medium heat, skimming the fat off the top with a ladle. Season generously with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the soup is reheating for serving, prepare the scallion garnish: In a small bowl, stir together the scallions, garlic and flaky sea salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the brisket among large bowls and ladle over the hot soup. Sprinkle some of the scallion garnish over each bowl, leaving the rest on the table so everyone can add more as they eat. The soup should be well seasoned with salt and aromatic from the savory scallions and garlic. Serve with white rice and radish kimchi."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023241-seolleongtang"}