{"@context": "http://schema.org", "@type": "Recipe", "name": "Cream Soda and Raspberry Cupcakes", "description": "These happy-looking cupcakes, with swirls of pink in the frosting, are only improved by a generous sprinkling of fun — in the form of popping candy, of course. The cream soda flavoring gives these cupcakes an ice cream shop vibe and can be ordered online, but vanilla will work just as well. Feel free to bake the cupcakes a day ahead and keep them in an airtight container. Top them with the mascarpone cream a couple of hours before you intend to serve them. For maximum effect, be sure to sprinkle on the popping candy only right before serving.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2022/06/19/magazine/19mag-eat-site/19mag-eat-site-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "12 cupcakes", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "birthday, mother’s day, valentine’s day, cream soda extract, cupcake, lemon, raspberries", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 295}, "recipeIngredient": ["1 large lemon", "24 raspberries (160 grams)", "9 tablespoons/125 grams unsalted butter, cut into 1-inch cubes, softened", "1 cup plus 2 tablespoons/225 grams superfine (caster) or granulated sugar", "1/4 teaspoon cream-soda flavor extract (see Tip) or 1/2 teaspoon vanilla bean paste or extract", "2 large eggs", "1/2 cup/120 grams mascarpone", "1 1/4 cups/160 grams all-purpose flour ", "3/4 teaspoon baking powder", "1/4 teaspoon fine sea salt ", "14 raspberries (75 grams)", "1 1/2 cups/340 grams mascarpone", "1 cup/225 milliliters heavy whipping cream", "3 tablespoon plus 1 teaspoon/40 grams superfine (caster) or granulated sugar", "1/2 teaspoon cream-soda flavor extract, or 1 teaspoon vanilla bean paste or extract", "1/2 ounce/15 grams store-bought white or pink meringues, roughly crushed (1/2 cup)", "2 tablespoons/19 grams popping candy (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cupcakes: Heat the oven to 350 degrees Fahrenheit/180 degrees Celsius. Line a standard muffin tin with 12 paper liners."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a small, sharp knife to trim the ends of the lemon and then cut away all the skin and pith. Slide your knife between the membranes to release the segments, then roughly chop each segment into 3 or 4 pieces. You need 24 pieces in total. Stuff each of the raspberries with the lemon pieces and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter, sugar and cream-soda extract to the bowl of a stand mixer with the paddle attachment in place. (Alternatively, do this in a large bowl with a hand-held mixer). Mix on medium-high speed for about 3 minutes, or until pale, fluffy and aerated. Scrape down the sides if needed, then turn the speed to medium and add the eggs, one at a time, making sure each is completely incorporated. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the bowl. Then, with the speed on medium-low, add the mascarpone, flour, baking powder and salt, and mix to combine. Turn the speed to medium and mix for 15 seconds, or until everything is smooth and evenly combined. Use two spoons to evenly divide the batter among the liners, so they are about two-thirds full. Press two raspberries, hole sides up, into the center of a cupcake so they’re submerged halfway in the batter. Repeat with the remaining berries and cupcakes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 30 minutes, or until springy to the touch and a toothpick inserted into the center comes out clean. Leave to cool for 5 minutes, then carefully transfer the cupcakes to a wire rack to cool completely. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the cupcakes are cool, make the toppings: Blitz the raspberries into a smooth purée using a small food processor or blender. (Alternatively, mash them very thoroughly with a fork.) For the frosting, add the mascarpone, cream, sugar and cream-soda extract to the bowl of a stand mixer with the whisk attachment in place. Start the mixer on low, then gradually increase the speed to medium-high and whisk for about 1½ minutes, or until soft to medium peaks form. You don’t want it to be runny at all. (Alternatively, do this in a bowl with a hand-held mixer.) Add the blitzed raspberries, stirring just 3 or 4 times and not more so that the frosting is streaky with red bits throughout."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fit a piping bag with a star-shaped piping tip (about 1 ¼-inches/30-millimeters wide) if you have one. (Alternatively, snip a hole in a piping bag or resealable plastic bag.) Place the bag tip-side down into a cup and fold the top over the rim to help keep it upright. Use a spatula to transfer the mascarpone cream to the bag and then pipe tall swirls of the cream on top of the cupcakes. Just before serving, sprinkle with the meringue and, if using, the popping candy."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023275-cream-soda-and-raspberry-cupcakes"}