{"@context": "http://schema.org", "@type": "Recipe", "name": "Nonalcoholic Smoky Citrus Punch", "description": "Historically, punch is an alcoholic drink, made with a spirit, sugar, citrus and spice, but this variation drops the spirit and doubles down on its other central components. Opting for smoky Lapsang souchong adds distinctive depth and character to the punch, though another black tea, such as Earl Grey or Darjeeling or a more robust green tea, can also be used. Likewise, the oranges in the lemon-orange oleo-saccharum (a muddled sugar and citrus mixture) can be swapped out for seasonal citrus, such as satsuma, mandarin or blood oranges. Bear in mind you need to start this punch the day before serving: While some of the tea is brewed hot before being added to the lemon-orange oleo-saccharum, cold-brewing the remainder of the tea ensures that the final punch is deeply flavored, smooth drinking and more nuanced than astringent. A mix of tonic and soda water to finish imbues the punch with a bubbly, quinine bitterness and helps to balance the tannins of the tea.", "author": {"@type": "Person", "name": "Rebekah Peppler"}, "image": "https://static01.nyt.com/images/2022/12/07/dining/01punchrex3-noabv/merlin_216830940_6545f6a8-187a-41ce-8949-3c4350a6b037-articleLarge.jpg", "totalTime": "PT11H20M", "recipeYield": "18 to 20 (4-ounce) drinks", "recipeCuisine": "", "recipeCategory": "non-alcoholic drinks, punches", "keywords": "black tea, lemon, mocktail, orange, party, plan-ahead, sugar, christmas, hanukkah, new year’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 181}, "recipeIngredient": ["2 lemons, plus more for juicing as needed", "2 oranges", "3/4 cup granulated sugar", "4 bags Lapsang souchong tea (or use 4 teaspoons loose-leaf)", "1 cup/8 ounces soda water", "1 cup/8 ounces tonic water", "Lemon and orange slices, for serving", "Ice ring or block, for serving (see Tip)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before serving, peel the lemons and oranges. Place the peels in a medium bowl or a large jar and reserve the fruit. Add the sugar and use a muddler or the end of a rolling pin to work the sugar into the peels until they start to turn slightly translucent, about 2 minutes. Set aside at room temperature for at least 2 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pitcher or large glass jar, add 3 tea bags or 3 teaspoons loose-leaf tea. Pour in 3 cups water, cover and refrigerate for 8 to 12 hours. Remove and discard the tea bags, if using, or strain out and discard the tea leaves through a fine-mesh sieve lined with cheesecloth. (Cold-brewed tea will keep, covered, in the refrigerator for up to 5 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 1 cup water to a boil. Add the remaining 1 tea bag or 1 teaspoon loose-leaf tea. Steep for 4 to 5 minutes, then remove the tea bag or strain out the loose-leaf tea. Add the brewed tea to the citrus-sugar mixture and stir to dissolve the sugar. Strain through a fine-mesh strainer, pressing on the solids. Cover and chill in the refrigerator for at least 1 hour. (The mixture can also be stored in an airtight container, in the refrigerator for up to 1 month.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to serve, juice the reserved lemons and oranges (you should have about 1 cup juice, if needed, juice another lemon to get you to 1 cup). In a large punch or serving bowl, unmold the prepared ice wheel. Add the lemon and orange juice, reserved citrus-sugar-tea mixture, and the cold-brewed black tea. Pour in the soda water and tonic water, and stir gently to combine. Ladle into individual punch glasses and serve each with a lemon and orange slice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023701-nonalcoholic-smoky-citrus-punch"}