{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Fennel and Grape Salad", "description": "When fennel is kissed by an oven’s fiery heat, its strong anise flavor is toned down and replaced by a mellow char and sweetness. Similarly, roasting grapes intensifies the fruit’s juices, deepens its flavor and takes off the acidic edge, giving way to more of a dark, almost winelike character. Together, the roasted fennel and grapes make a lovely warm winter salad, enhanced by a zingy shallot-citrus vinaigrette. The whole lot gets topped off with crunchy, toasted walnuts and a generous shower of Manchego cheese, which lend texture and heft. (You can sub in any sharp and tangy sheep’s milk cheese.)", "author": {"@type": "Person", "name": "Hana Asbrink"}, "image": "https://static01.nyt.com/images/2022/03/23/dining/ha-roasted-fennel-and-grape-salad/merlin_202696365_603bedfb-0390-444d-a6c4-da5d773fcd5e-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "3 to 4 servings, as a side", "recipeCuisine": "", "recipeCategory": "dinner, lunch, salads and dressings, appetizer, side dish", "keywords": "cheese, fennel, grape, walnut, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 459}, "recipeIngredient": ["1/4 cup walnut halves", "2 medium fennel bulbs, about 1½ to 2 pounds, stalks removed, a few green fronds reserved for garnish", "1 1/2 cups red seedless grapes", "2 tablespoons extra-virgin olive oil", "Kosher salt (Diamond Crystal) and black pepper", "1 wedge of Manchego cheese (about 2 ounces), rind removed", "1/2 small shallot, thinly sliced into rings", "1 1/2 tablespoons sherry vinegar", "1 teaspoon orange zest plus 2 tablespoons juice (from about 1/2 orange)", "1 teaspoon Dijon mustard", "1/4 teaspoon kosher salt (Diamond Crystal)", "1/8 teaspoon black pepper", "1/4 cup extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Once heated, place walnuts on a sheet pan and cook until toasted and fragrant, about 5 to 7 minutes. Transfer nuts to a cutting board to cool. (You’ll use the sheet pan in the next step.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the fennel bulbs in half lengthwise, then cut each half into 1-inch wedges (you’ll have about 6), taking care to include a bit of core in each slice to hold it together while cooking. Arrange the slices on the sheet pan, ensuring they do not overlap. Add the grapes to a corner of the sheet pan. Drizzle 2 tablespoons of the olive oil over the fennel and grapes. Season with ¼ teaspoon kosher salt and ⅛ teaspoon pepper. Roast for 40 minutes, flipping the fennel and shaking the grapes around at the 20-minute mark. When done, the fennel should be tender and browned; the grapes should be a bit withered and caramelized in some spots. Remove from oven and let cool for at least 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, roughly chop the cooled walnuts, and set aside while you prepare the dressing: In a small glass jar, combine the shallot, sherry vinegar, orange zest and juice, mustard, salt, black pepper and olive oil. Cover and shake well to combine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the salad: Transfer the roasted fennel and grapes to a platter. Spoon 4 tablespoons of the dressing over the roasted fennel and grapes, ensuring the shallot rings are evenly distributed. (Extra dressing can be served alongside.) Top with chopped nuts. Just before serving, grate the Manchego cheese on the largest hole of a box grater. Top salad with Manchego, reserved fennel fronds and a few more cracks of black pepper. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023055-roasted-fennel-and-grape-salad"}