{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry Jelly Salad With Lime-Sugared Nuts", "description": "Chopped nuts and fruit bound by a wobbly sweet-tart gelatin, often called Jell-O salad in the Midwest, form a beloved side dish full of potential. Serve this gleaming cranberry variation at Thanksgiving or any holiday meal, and feel free to swap out the apple here for peeled and chopped oranges or canned diced pineapple, or use a mix of your favorite fruits. (Note that certain fruits like fresh pineapple, mango, kiwi and papaya contain enzymes that prevent gelatin from setting.) To make the lime-sugared walnut garnish even more surprising, toss it with a smidge of citric acid to give it an incomparable sourness that citrus juice alone can’t provide.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/10/30/magazine/30mag-Eat-site/30mag-Eat-site-articleLarge.jpg", "totalTime": "PT4H40M", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "side dish", "keywords": "apple, cranberry, gelatin, lime, make-ahead, pecan, plan-ahead, salad, walnut, fall, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 208}, "recipeIngredient": ["3/4 cup coarsely chopped walnuts or pecans", "2 limes", "1/4 cup plus 3 tablespoons granulated sugar", "1/2 teaspoon citric acid (optional)", "Nonstick cooking spray or neutral oil, such as vegetable or canola", "2 cups cranberry juice cocktail or apple juice", "2 (1/4-ounce) packets unflavored powdered gelatin", "3 cups/12 ounces fresh or frozen thawed cranberries", "1 medium green apple, unpeeled, cored and coarsely chopped (2 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a small skillet over medium-high, then add the nuts and toast, shaking the pan occasionally, until fragrant and slightly darker in color, about 30 seconds. Set aside to cool slightly. Zest the limes into a small bowl and, using your fingers, rub 3 tablespoons sugar into the zest until fragrant and well combined. To this lime sugar, add 1/2 cup cooled nuts and, if using, citric acid and toss to combine. Set aside for later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease a 3-cup jelly mold, Bundt pan or wide shallow bowl with nonstick spray or a paper towel dipped in oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 1/2 cup juice into a 4-cup liquid measuring cup or large bowl and stir in the gelatin; set aside to soak (the gelatin will hydrate and thicken the juice)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To a medium pot, add 2 1/2 cups cranberries, 1 1/2 cups chopped apple and the remaining 1 1/2 cups of juice and 1/4 cup sugar and bring to a boil over high heat. Reduce the heat to medium and simmer, swirling the pan occasionally, until the cranberries burst and the apple softens slightly, about 5 minutes. Squeeze 1/4 cup juice from the zested limes and add to the pot. Strain this hot cranberry-apple juice mixture through a fine-mesh sieve into the gelatin without pressing down on the solids. Stir to combine. Set aside to cool to lukewarm, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the remaining 1/4 cup toasted nuts, 1/2 cup cranberries and 1/2 cup chopped apple into the cooled juice mixture and pour into the jelly mold. Transfer to the refrigerator to set until solid but jiggly, at least 4 hours or up to overnight. To unmold the jelly, fill a pan larger than the mold with hot water from the tap. Dip the mold into the hot water (don’t let hot water get inside the mold) until the edges of the gelatin look wet, a few seconds to 3 minutes depending on the thickness of your mold. Cover the mold with a large plate and quickly (and confidently) flip it. You can make this jelly up to 3 days in advance; keep the unmolded gelatin covered and refrigerated until ready to unmold, and be sure to unmold a few minutes before serving for a softer texture. Unmold the jelly and sprinkle with the lime-sugared nuts."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023610-cranberry-jelly-salad-with-lime-sugared-nuts"}