{"@context": "http://schema.org", "@type": "Recipe", "name": "Pad See Ew", "description": "Built around the satisfying umami of soy sauce, this is an easy Thai recipe to shop for and cook at home. The classic version is made with wide, fresh rice noodles, but Pailin Chongchitnant, a popular Canadian YouTube chef, said that restaurants in Bangkok proudly advertise using spaghetti; in southern Thailand, her family used egg noodles. (In other words, there’s flexibility.) The street-kitchen version of this popular dish — a close relative of Cantonese beef chow fun — will always have more of the seared edges that make the dish extra delicious, but cooking it in a wide, heavy pan that holds onto heat gives great results. If gai lan is not available, Ms. Chongchitnant says that broccolini, a hybrid of gai lan and broccoli, or steamed broccoli are good alternatives. (The crunch of the stems is what you’re after here.).", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2022/03/23/dining/17padthairex2/merlin_203116089_36c661da-aef9-4bb3-a693-0701375b2160-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 to 3 servings", "recipeCuisine": "thai", "recipeCategory": "noodles, main course", "keywords": "beef, chinese broccoli, rice noodles", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 904}, "recipeIngredient": ["8 ounces sen yai or other dried wide rice noodles", "8 ounces beef, chicken or pork, thinly sliced", "1 tablespoon soy sauce", "4 garlic cloves, minced", "6 gai lan (Chinese broccoli) or broccolini, thick stems trimmed off, or steamed broccoli, cut into 2-inch-long pieces with stems attached", "2 large eggs, lightly beaten", "1 tablespoon granulated sugar, plus more to taste", "2 tablespoons vegetable oil, plus more for cooking eggs", "Thai black soy sauce or Chinese dark soy sauce, to taste", "2 tablespoons oyster sauce", "2 tablespoons soy sauce", "1 tablespoon fish sauce", "1/2 teaspoon ground white pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the noodles: Place dried noodles in a large bowl and cover with hot tap water. Let soak while you prepare the remaining ingredients, allowing the water to cool, and stirring and separating the noodles occasionally with your hands. (This will take 30 to 40 minutes, depending on the brand.) When ready, noodles will be white, limp and bouncy, almost soft to the bite. (They will cook a little more later.) Pour off and discard all the water, fluff noodles with your hands and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium bowl, mix the meat with the soy sauce and let stand at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sauce: In a bowl, whisk the oyster sauce, soy sauce, fish sauce and white pepper to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the remaining noodle ingredients in bowls and line them up in the order they’ll be added to the pan: garlic, gai lan, eggs, noodles and sugar, then the sauce. When ready to cook, put 1 cup of hot tap water near the stove, and drain and discard any liquid in the bowl with the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons oil in a 14-inch wok or a heavy 12-inch skillet or a large Dutch oven over high heat until just starting to smoke. (If using a smaller pan, cook in 2 batches.) Add the meat to the hot pan in a single layer. Let cook, undisturbed, until well browned, about 1 minute, then stir-fry until just cooked through, about 1 minute more, pressing it against the pan to sear. Remove from the pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the pan and heat remaining 2 tablespoons oil over medium until shimmering. Stir in the garlic, then immediately add the greens and stir-fry just until bright and beginning to wilt, 30 to 45 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Push greens to one side of the pan, add just enough oil to lightly coat the other side and add the eggs. Use the spatula to scramble the eggs, stirring and scraping until cooked through and just dry, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise the heat to high.  Add the noodles, spreading them around the pan, then tossing and separating them with a wok turner, tongs or both. When noodles are sizzling, add the sugar and 3 tablespoons sauce, and toss to coat and cook through. Keep cooking, leaving noodles undisturbed for 20 to 30 seconds at a time, so they sear and caramelize."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the meat back to the pan, along with any liquids in the dish, and toss everything together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a few dashes of black soy sauce, and taste for doneness and seasoning. Keep cooking, adding more sugar, black soy sauce or pad see ew sauce a little at a time, until the dish is very savory and a little sweet. Add hot water, 1 tablespoon at a time, if noodles are not quite soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the noodles have absorbed all the liquid and the flavors are balanced, serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023043-pad-see-ew"}