{"@context": "http://schema.org", "@type": "Recipe", "name": "Three Sisters Bean Patties With Raspberry Aioli", "description": "The Three Sisters — corn, beans and squash — are foundational foods of the Haudenosaunee people. This recipe is an Indigenous-inspired twist on falafel that brings together the sweetness of squash with savory red beans and cornmeal. Combined with an easy raspberry aioli, these nutritious patties can be eaten alone, tossed in salads or tucked into sandwiches.", "author": {"@type": "Person", "name": "Kevin Noble Maillard"}, "image": "https://static01.nyt.com/images/2022/08/31/dining/31GARDENSrex2-1/merlin_211376418_8eaf5162-49a1-4a95-a3f7-46e89a62dadf-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, beans, main course", "keywords": "butternut squash, cornmeal, kidney bean, raspberry, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 303}, "recipeIngredient": ["1 small butternut squash (about 1½ pounds)", "Olive oil, for brushing squash", "Fine sea salt and freshly ground black pepper", "1 1/2 cups/275 grams medium-grind white (or yellow) cornmeal, plus more if needed", "1 teaspoon baking powder", "2 (15-ounce) cans red kidney beans (or other red beans), drained (about 3 cups)", "1/2 sweet onion, minced (about ¾ cup)", "1/4 cup sunflower butter", "2 garlic cloves, minced", "1 teaspoon dried sage", "6 ounces fresh raspberries, finely chopped (scant ⅔ cup)", "1 cup mayonnaise", "1 tablespoon maple syrup", "1 tablespoon finely chopped fresh sage"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start the patties: Heat oven to 350 degrees. Halve the butternut squash lengthwise and scoop out the seeds. Drizzle the cut squash with oil, season generously with salt and pepper, and place flat side down on a parchment-lined baking sheet. Roast until the skin is sunken and a fork passes through easily, 30 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the squash cools, add the cornmeal, baking powder, 1 teaspoon salt and ½ teaspoon pepper to a large bowl; whisk to combine. Scrape and remove ¾ cup squash from its skin with a fork and add to bowl (the remaining squash will keep, refrigerated, for 3 to 4 days). Add the beans, onion, sunflower butter, garlic and dried sage. Stir to combine, then transfer the mixture to a food processor and pulse until uniform. (Though a food processor yields better results, you could also simply mash the ingredients with a masher or your hands until well incorporated.) The mixture should be thick and pliable; if not, add more cornmeal, 1 tablespoon at a time, and mix thoroughly. Cover the mixture and let rest in the fridge for 10 minutes until slightly firmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the mixture chills, make the aioli: In a small bowl, combine the chopped raspberries, mayonnaise, maple syrup and sage until well mixed. (Makes 1⅓ cups.) Cover and refrigerate while you cook the patties."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the patties: Remove the cornmeal mixture from the fridge. Line a large baking sheet with parchment paper. Using 1 heaping tablespoon (with almost 2 tablespoons of the cornmeal mixture) at a time, begin to shape small 1½- to 2-inch balls, adding them to the prepared baking sheet and pushing each to flatten slightly. Continue until all the dough is used; you should have about 24 patties. Bake on the prepared baking sheet for 20 to 30 minutes, until golden brown and crisp. Allow to cool for 10 minutes before serving with aioli."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023389-three-sisters-bean-patties-with-raspberry-aioli"}