{"@context": "http://schema.org", "@type": "Recipe", "name": "Tacos Campechanos ", "description": "One of the best food experiences you can have in Mexico City is walking up to a sidewalk taco stand late at night and smelling the incredible aroma of meats and vegetables simmering in a huge pot over a gas flame. The taqueros start early in the day and add meats like suadero, pork, offal, tripe, chitlins, pig and beef feet, chorizo, onions and chiles into a giant pot, where they cook until the meats fall apart and the flavors fuse together in perfect harmony. On the menu at many of these stands, tacos campechanos include a little bit of everything in those pots.", "author": {"@type": "Person", "name": "Rick A. Martínez"}, "image": "https://static01.nyt.com/images/2022/10/12/dining/06ESSENTIALSREX-tacos/merlin_214158528_14a4dfec-bde9-49bf-a341-fb136c3c3493-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "8 to 10 servings ", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, snack, project, tacos, main course", "keywords": "bacon, brisket, chorizo, chuck roast, pork belly, scallion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 104}, "recipeIngredient": ["1 tablespoon rendered lard, preferably not hydrogenated, or use extra-virgin olive oil", "2 pounds beef brisket, preferably point (fatty) end, or chuck roast, excess fat trimmed", "1/2 pound pork belly or smoked slab bacon, cut into 1-inch pieces", "1 pig’s foot, split lengthwise, or 1 ham hock ", "4 teaspoons kosher salt (such as Diamond Crystal)", "3/4 pound fresh chorizo links or longaniza links", "5 spring onions or scallions, root ends trimmed", "4 garlic cloves, lightly crushed", "24 corn tortillas", "<a href=\"https://cooking.nytimes.com/recipes/1023521-salsa-taquera\">Salsa taquera</a>, chopped white onion, chopped cilantro, sliced radishes and lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat lard in a large heavy pot over medium-high and cook brisket until browned on all sides, 10 to 12 minutes. Transfer brisket to a large bowl. Add pork belly to the pot and cook until browned on at least two sides, 4 to 6 minutes. Transfer to bowl with brisket. Add pig’s foot and cook until browned on all sides, 4 to 6 minutes. Add salt, reserved brisket and pork belly, their accumulated juices and 2 1/2 cups water. Bring to a boil, cover and reduce to a low simmer and cook for 1 1/2 hours. Brisket and pork will be partly cooked and very tough at this point. Add chorizo links, spring onions and garlic, cover and continue to simmer until meats are all very tender and will shred easily with little resistance, another 1 to 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to assemble, remove pig’s foot from pot (be careful not to leave behind any bones) and separate meat and skin from bones. Discard bones, chop the meat and skin, and transfer to a large bowl. Chop the brisket, pork belly, chorizo and spring onion and add them, along with the garlic, to the bowl with the pig’s foot; toss to combine. Pour cooking liquid over meat. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon meat and some juices onto a tortilla and top with salsa taquera, onion, cilantro, radish and a squeeze of lime. Or make taqueria-style tacos (see Tip)."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023504-tacos-campechanos"}