{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheddar Chive Crisps", "description": "Every cookie tin deserves a little savory bite. These delicate crisps are speckled with fresh herbs and have a golden vein of cheese running through the dough. Fresh ground black pepper adds a gentle, lingering heat. You can go with any firm cheese that has strong notes here; sharp Cheddar, Parmesan or pecorino will all work nicely. Both the dough and cheese will benefit from staying cold while you work, so return the dough to the refrigerator as often as necessary to keep it chilled. (This cookie is one of six cookies that you can make with this <a href=\"https://cooking.nytimes.com/recipes/1023720-butter-shortbread-dough\">Butter Shortbread Dough</a> recipe. If you make that dough, you can make a double batch of the Cheddar Chive Crisps or try any of the other <a href=\"https://www.nytimes.com/interactive/2022/12/04/dining/holiday-shortbread-cookie-dough-recipe.html\">five recipes</a>.)", "author": {"@type": "Person", "name": "Yewande Komolafe "}, "image": "https://static01.nyt.com/images/2022/12/07/multimedia/YK-cheddar-chive-crisps-1-d41c/YK-cheddar-chive-crisps-1-d41c-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 60 crisps", "recipeCuisine": "", "recipeCategory": "snack, appetizer, dessert", "keywords": "chive, christmas cookie, egg yolks, make-ahead, party, sharp cheddar cheese, shortbread, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 270}, "recipeIngredient": ["1 cup/230 grams unsalted butter, at room temperature, plus more for pan", "1 cup/205 grams granulated sugar", "1 teaspoon kosher salt (such as Diamond Crystal)", "1 to 2 large egg yolks", "2 1/2 cups/320 grams all-purpose flour (see Tip)", "1/4 heaped cup chopped chives", "1 teaspoon freshly ground black pepper", "4 ounces extra sharp Cheddar, finely grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In the bowl of a stand mixer fitted with the paddle attachment, combine the butter, sugar and salt. Beat on low speed until incorporated and smooth, scraping down the sides of the bowl as needed, about 3 minutes. (Do not beat until fluffy, you don’t need to incorporate air into the dough.) Add the yolk and mix until just combined. Turn the mixer off and scrape down the sides of the bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour to the bowl all at once and scrape the bottom and sides of the bowl. Turn the mixer speed to low and beat until flour is fully incorporated, scraping the bowl again if needed, about 30 seconds. The dough will be in large crumbles. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "(If you’re starting with a half batch of <a href=\"https://cooking.nytimes.com/recipes/1023720-butter-shortbread-dough\">Butter Shortbread Dough</a>, start here.) Add the chopped chives and black pepper to the crumbled dough, and mix in using your fingers to incorporate. (If the dough feels too crumbly to come together, mix in an additional egg yolk before proceeding)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dough onto a sheet of parchment paper and pat into a 5- by 7-inch rectangle. Place another sheet of parchment over the top and roll the dough into an 8- by 11-inch rectangle. Peel off the parchment and scatter the grated Cheddar evenly over the top. Fold the dough in thirds similar to how you might trifold a letter: With the short edge running parallel to you, lift the right long side and fold it over until the right edge of the dough aligns with the center of the dough. Fold the left side over the top like you are closing a book. Press down lightly on the dough to adhere the fold. Slice the dough lengthwise, down the middle. You should have 2 strips at this point. Wrap the strips together in the sheet of parchment and refrigerate for at least 45 minutes and up to 3 days to chill completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Line a sheet pan with parchment paper. Trim the edges of the chilled logs by shaving off any rounded sides. Slice each strip crosswise into ¼-inch slices. Lay the pieces on the prepared baking sheet, spacing at least ½ inch apart. Bake until the cookies are light golden brown at the bottom edges, rotating once halfway through baking, 13 minutes. Transfer the cookies to a wire rack and cool completely. Store in an airtight container for up to 1 week."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023715-cheddar-chive-crisps"}