{"@context": "http://schema.org", "@type": "Recipe", "name": "Chewy Peanut Butter-Marshmallow Bars", "description": "Classic cereal treats for the peanut butter fanatic, these marshmallow bars call for cornflakes instead of Rice Krispies, making for a wonderfully chewy-crunchy contrast. Cornflakes are delicate, so the key here is to avoid crushing the cereal too much when mixing the ingredients. The end result should be airy and chewy, but not dense, with visible chunks of marshmallow throughout. This recipe comes together quickly, so have your ingredients measured and ready to add to the pot when you begin. Once the chocolate topping has set, these bars pack well for picnics or potlucks, but if you’re concerned about the chocolate melting, you can skip it altogether and finish the bars with a sprinkle of sea salt.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2022/05/11/dining/lh-marshmallow-treats/lh-marshmallow-treats-articleLarge.jpg", "totalTime": "PT2H20M", "recipeYield": "16 to 20 bars", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars, dessert", "keywords": "chocolate, cornflakes, marshmallow, memorial day, super bowl, tailgate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 171}, "recipeIngredient": ["6 tablespoons/85 grams unsalted butter, plus more for greasing the pan", "6 cups/200 grams cornflake cereal", "1 (12-ounce/340-gram) bag large marshmallows", "1 teaspoon kosher salt (such as Diamond Crystal)", "1/2 cup/125 grams natural creamy peanut butter", "4 ounces/115 grams semisweet chocolate (preferably bar chocolate), roughly chopped", "Flaky sea salt, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a 9-inch square pan with butter and sprinkle 1/2 cup/17 grams of the cornflakes on the bottom of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, melt the 6 tablespoons/85 grams butter over medium-low heat. Add the marshmallows and kosher salt, and cook, stirring often, until about half of the marshmallows have melted but the mixture is not completely smooth. Add the peanut butter and mix until just combined, keeping some lumps of marshmallow."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the pan off the heat, and working quickly, add about half the remaining 5½ cups cornflakes, folding them into the marshmallow mixture as gently as possible to avoid crushing the cereal. Repeat with the remaining cornflakes. If the mixture becomes too sticky to work with, briefly return the pot to the heat on low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, transfer the mixture to the prepared pan, using a wet spoon or spatula to spread and pat into an even layer, again being careful to avoid crushing or packing the cereal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chocolate in a small heatproof bowl and microwave it in 15-second intervals, stirring between intervals, until melted and smooth. Drizzle the chocolate over the bars in overlapping lines. (If using chocolate chips, scatter the chips onto the surface of the bars while they are still warm and let sit for 5 minutes, allowing the heat of the cornflakes to melt the chocolate before dragging a fork or toothpick through it to create lines.) Sprinkle the bars lightly with flaky sea salt, and set aside at room temperature (in a cool spot, if possible) until completely set, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut into bars and serve. Bars will keep, wrapped well at room temperature, for up to 3 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023184-chewy-peanut-butter-marshmallow-bars"}