{"@context": "http://schema.org", "@type": "Recipe", "name": "Grape Dumplings", "description": "Grape dumplings are a favorite treat among southeastern Indigenous nations. Originally made with strained muscadine or possum grapes, they’ve been adapted by modern cooks using other dark grape varieties and bottled Concord grape juice. In a blend of old and new, this take on the popular indigenous recipe pays homage to the historic use of cornmeal while observing popular contemporary practices of adding flour and sweetener. The dumplings incorporate blue cornmeal and whole-wheat flour to intensify the rich evening shades of the dish, and the sauce substitutes agave for granulated sugar. Pair them with vanilla ice cream and a sprig of fresh tarragon for a delightful explosion of perfectly purple goodness.", "author": {"@type": "Person", "name": "Kevin Noble Maillard"}, "image": "https://static01.nyt.com/images/2022/04/23/dining/18graperex/merlin_205030737_9296bc1b-034e-4517-8d5d-8f48a578236a-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dumplings, dessert", "keywords": "blue cornmeal, cornmeal, grape", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 245}, "recipeIngredient": ["1/2 cup/75 grams blue cornmeal (or medium-grind yellow)", "1/2 cup/70 grams whole-wheat flour, plus more for kneading", "1 1/2 teaspoons baking powder", "1/4 teaspoon fine sea salt", "1/4 cup Concord grape juice (see Tip)", "1 egg", "2 teaspoons melted butter", "2 teaspoons agave (optional)", "4 cups Concord grape juice (see Tip), plus more if needed", "1 1/2 teaspoons cornstarch", "2 cups/10 ounces dark, seedless grapes, plus more for serving", "2 teaspoons agave (optional)", "Vanilla ice cream and fresh tarragon leaves, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare dry dumpling ingredients: Sift all dry ingredients into a medium bowl. Use a fork or whisk to blend thoroughly. Dump the contents of the bowl onto a flat, clean workspace. Using your hands, make a round mound at least 1 ½ inches tall, then use fingers to clear a hole in the middle. It should go all the way down to the surface to accommodate all of the wet ingredients. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine wet dumpling ingredients: In a small bowl, whisk together grape juice, egg, melted butter and agave, if using. Pour the mixture into the well of the dry ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend dough: Using a fork, gradually fold the dry mixture along the perimeter of the well into the wet mixture in the center, stirring to integrate. Do not overmix. When combined, use your hands to form a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out dough: Sprinkle a small amount of flour onto a dry, clean work surface. Use your hand to spread the flour into a 12-by-12-inch square. Roll the ball of dough into the flour, coating all sides. Generously sprinkle additional flour onto the workspace and slowly mash the ball with your hand. Use a floured rolling pin to flatten dough into a large rectangle approximately ¼-inch thick and 8-by-12 inches wide, dusting the pin with flour as needed to prevent sticking. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut dumplings: Using a dry knife or pizza cutter, cut dough into strips to make 1-inch squares. Using a fork, prick each square in three parallel lines, all the way to the work surface. This will help aerate the dough to absorb the grape juice as it simmers. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Pour 4 cups well-shaken grape juice into a wide, high-sided skillet and turn heat to medium. Dissolve cornstarch in 2 tablespoons of cold water before whisking into grape juice. Add grapes and agave, if desired. Bring to a rolling boil over medium heat. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the dumplings: Using a rubber spatula, carefully add dumplings to boiling juice until skillet is full but not crowded. Stir the dumplings to immerse; the dumplings may touch, but not stack. Reduce heat to low, cover, and cook for 10 minutes. Check for overcrowding after 5 minutes, removing extra dumplings if needed. (Discard any remaining uncooked dumplings, or simmer in additional grape juice, if desired.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thicken sauce: Uncover simmering dumplings and keep temperature at medium-low. Cook for 5 minutes until the sauce thickens but does not bubble. It should be the consistency of a thick syrup. Remove from heat and let cool for 5 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon mixture over vanilla ice cream and garnish with fresh grapes and tarragon."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023087-grape-dumplings"}