{"@context": "http://schema.org", "@type": "Recipe", "name": "Mole Negro", "description": "Mole negro is one of the most striking and complex moles from the state of Oaxaca. The color and flavor come from nearly incinerating the chilhuacles negros, the native dried chiles used for the base. They’re then rinsed and soaked to revive their flavor and to remove the bitterness from the charring. What results is a velvety black sauce that’s traditionally served over roasted poultry, but also pairs beautifully with roasted vegetables and fish.", "author": {"@type": "Person", "name": "Rick A. Martínez"}, "image": "https://static01.nyt.com/images/2022/10/12/dining/06ESSENTIALSREX5-mole-negro/merlin_214158477_d5990c0b-a62d-4c5e-a868-0a28a8502574-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "8 servings", "recipeCuisine": "mexican", "recipeCategory": "project, sauces and gravies", "keywords": "almond, ancho chile, chocolate, freezer friendly, guajillo chiles, lard, make-ahead, peanut, plum tomato, pumpkin seed, raisin, sesame seed, star anise, tomatillo", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 102}, "recipeIngredient": ["78 grams chilhuacle negro chiles (about 10) or 78 grams ancho chiles (about 4), stemmed and seeded", "38 grams pasilla chiles (about 3), stemmed and seeded", "27 grams guajillo chiles (about 4), stemmed and seeded", "1/2 large very ripe plantain, unpeeled", "2 large Roma tomatoes (250 grams)", "2 medium tomatillos, husked (62 grams)", "1/4 large white onion", "2 large garlic cloves, unpeeled", "3 tablespoons rendered lard, preferably not hydrogenated", "2 tablespoons roasted whole almonds", "1 tablespoon roasted whole peanuts", "1 (3-inch) piece canela (Ceylon cinnamon) or 1 (1-inch) piece cassia cinnamon", "2 whole cloves", "1 whole star anise", "1/2 teaspoon whole (or ground) allspice berries", "1/2 teaspoon black peppercorns or ground black pepper", "1 tablespoon raw pumpkin seeds", "1 tablespoon raisins", "1 tablespoon raw sesame seeds, plus more for serving", "1/2 teaspoon whole (or ground) cumin", "1/2 teaspoon dried thyme or 1 teaspoon fresh thyme leaves", "1/2 teaspoon dried oregano, preferably Mexican", "1 dried or fresh avocado leaf or 2 bay leaves", "2 corn tostadas, or corn tortillas, toasted", "5 cups homemade chicken stock or low-sodium chicken broth", "4 teaspoons kosher salt (such as Diamond Crystal), plus more to taste", "67 grams/2.3 ounces Mexican chocolate (such as Abuelita), chopped", "Roast chicken or turkey, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a grill for high heat, or place a rack in the center of the oven and heat to 475 degrees. (An outdoor grill is preferable. If you use an indoor oven, your kitchen will get very smoky, so keep the vent on and your windows open — and you might want to disable your smoke alarm.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a sheet pan, grill or roast the chiles until completely black, slightly puffed and resembling charcoal, 10 to 15 minutes. (They will appear inedible, but this is an essential Mexican technique of incinerating an ingredient and then using the rinsing method — outlined in Step 3 — to remove any bitterness.) Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cooled chiles to a large heavy pot, fill the pot with water and stir vigorously. Drain through a colander, discarding the water, and return the chiles to the pot. Repeat 2 more times. Cover the chiles with water and bring to a boil over high heat. Remove from heat and let sit at room temperature for at least 30 minutes and up to 24 hours. This step is critical. Drain through a colander, discard the water and set chiles aside until ready to use. Wipe the pot dry but no need to wash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the plantain half on a small rimmed baking sheet and roast at 475 degrees until the peel is very dark, 20 to 30 minutes. Set aside until cool enough to handle; remove and discard peel. Set aside until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large cast-iron skillet with a sheet of foil and heat the skillet over high. Add the tomatoes, tomatillos, onion and garlic to the hot, foil-lined pan and cook, using tongs to turn occasionally, until everything is charred on all sides, about 3 minutes for the garlic, 6 to 8 minutes for the onion and tomatillos, and 8 to 10 minutes for the tomatoes. Transfer to a plate to cool. Once cool enough to handle, peel the garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon lard in the same large, heavy pot over medium-high and fry almonds, peanuts, canela, cloves, anise, allspice, peppercorns and pumpkin seeds, stirring occasionally, until browned and seeds begin to pop, about 2 minutes. Add raisins, sesame seeds, cumin, thyme, oregano and avocado leaf, and cook, stirring constantly, until raisins are puffed and herbs are beginning to toast and are very fragrant, about 1 minute. Add chiles, plantain, charred vegetables, tostadas, chicken stock and salt to the pot and bring to a boil. Cover, reduce heat to maintain a low simmer and cook until the chiles and nuts smash easily when pressed on the side of the pot, 30 to 45 minutes. Remove from the heat and set the pot aside to cool slightly before blending."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches if necessary, carefully blend the chile mixture and liquid until as smooth as possible. Transfer to a large bowl, stirring to combine each new addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse and dry the pot, set it over medium-high, and heat the remaining 2 tablespoons lard until very hot. Carefully but quickly, pour the blended mole into the hot lard and immediately cover; it will spit and sputter, so an apron and long sleeves are a good idea. After the bubbles have slowed, stir, scraping up any fried bits from the bottom of the pot. Reduce the heat to medium-low and simmer uncovered, stirring frequently, until the mole is glossy and the consistency of gravy, about 10 minutes. Stir in the chocolate and remove from the heat. Continue to stir until the chocolate is completely melted. Taste and season with salt if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve over chicken and sprinkle with the sesame seeds."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023509-mole-negro"}