{"@context": "http://schema.org", "@type": "Recipe", "name": "Tongbaechu Kimchi (Whole Napa Cabbage Kimchi)", "description": "This tongbaechu kimchi, made with whole napa cabbage, is a wonderful way to witness firsthand the magic of preservation by salting. Though the first step — salting quartered cabbages to drain excess liquid — may require an afternoon, that time is entirely inactive. The bundles of sauced cabbage are jarred and left at room temperature for the first couple of days to jump-start the fermentation process, then refrigerated to continue souring slowly for weeks and even months. Fermenting bundled quarters — versus chopped pieces — results in a crisper, more flavorful cabbage kimchi. This recipe is pared down to its essentials, though you could supplement the funky, savory-sweet flavors here with traditional additions like a sprinkle of raw pine nuts, a palmful of Korean radish cut in matchsticks or a spoonful of saeujeot, salted fermented shrimp.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/06/15/dining/15ESSENTIALSrex10/15ESSENTIALSrex10-articleLarge.jpg", "totalTime": "P2DT4H15M", "recipeYield": "1 (2-liter) jar (about 4 pounds kimchi)", "recipeCuisine": "korean", "recipeCategory": "condiments, vegetables, side dish", "keywords": "apple, fish sauce, napa cabbage", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 272}, "recipeIngredient": ["1 large napa cabbage (2 1/2 to 3 pounds), quartered lengthwise", "1/3 cup coarse kosher salt or 2/3 cup kosher salt, such as Diamond Crystal", "2 medium red apples (such as Fuji, Gala or Honeycrisp)", "1 small yellow onion, peeled and chopped", "10 garlic cloves, peeled", "1 (2-inch) piece fresh ginger, peeled", "1/2 cup fish sauce", "1/2 cup gochugaru", "1 tablespoon granulated sugar", "1 bunch scallions, chopped into 1/2-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dry-brine the cabbage: Rinse the cabbage quarters under cold running water and place on a large rimmed sheet pan. Generously salt the cabbage all over, making sure to season between the leaves as well as the outsides. (Don’t worry about being too precise; since the cabbages leak water, the salt will distribute evenly into the brine.) Set aside to brine at room temperature, cut sides up, until the hard leaves become limp and soggy, about 4 hours, flipping once or twice halfway through. During this brining time, the cabbage quarters should release plenty of water into the sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Quarter one of the apples, leaving it unpeeled. Core it, coarsely chop it, then add it to a food processor. Add the onion, garlic and ginger, and process until finely chopped. Add the mixture to a large bowl and stir in the fish sauce, gochugaru and sugar. Peel the remaining apple, quarter it, core it, then thinly slice it crosswise. Fold the chopped scallions and thinly sliced apple into the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the salted cabbage quarters under cold running water, squeezing them of their excess liquid. Place one cabbage quarter into the bowl with the sauce. With clean hands, smear 1/4 of the sauce all over the outsides and between each leaf, tucking in the larger pieces of scallions and apple as well. Fold the cabbage quarter in half crosswise, gathering the leafy tail ends together and bringing them up and over the root end, to create a compact bundle. Place the bundle in the jar and repeat with the remaining three cabbage quarters until you have used up most of the sauce and the jar is filled with sauced cabbage, leaving about an inch of room on top. (A few air gaps are fine; they’ll fill with liquid over time.) Top the jar with any remaining sauce left behind in the bowl. Loosely close with a lid (see Tip). You can wash your hands at this stage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the jar of kimchi begin fermenting on the kitchen counter at room temperature for 2 to 3 days. After this, the cabbage should have released even more of its liquid; it’s OK if the liquid doesn’t completely cover the cabbage at this point, though it may. (This is a very juicy recipe.) Refrigerate the kimchi to finish fermenting until it’s sour, 2 to 3 weeks and up to 6 months, at which point it will be very, very sour and should be eaten or turned into jjigae. Check (and taste!) the kimchi every 2 to 3 days both to familiarize yourself with the fermentation process but also to allow gas to escape, which you can do by opening the lid every so often. As you go through the jar over time, take out one cabbage quarter at a time and chop it into bite-size pieces to serve. You can eat the core or toss it."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023243-tongbaechu-kimchi-whole-napa-cabbage-kimchi"}