{"@context": "http://schema.org", "@type": "Recipe", "name": "Pommes Boulangère", "description": "Like a creamless gratin, this potato casserole gets its flavor and richness from caramelized onions and chicken (or turkey) stock. For a sliceable texture, bake the casserole ahead of time and let it cool completely (during which time the gelatin in the stock and the starch in the potatoes will set), then reheat before serving.", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2022/11/16/dining/10potatoesrex2-boulangere/10potatoesrex2-boulangere-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "dinner, casseroles, vegetables, side dish", "keywords": "fingerling potato, thyme, yellow onion, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 498}, "recipeIngredient": ["6 tablespoons unsalted butter, plus more at room temperature for the baking dish", "2 large yellow onions, halved and very thinly sliced", "Kosher salt and freshly ground black pepper", "1 garlic clove, halved", "3 pounds fingerling potatoes, scrubbed", "3 fresh thyme sprigs", "4 cups chicken or turkey stock, preferably homemade"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons butter in a medium nonstick skillet over medium-high. When the butter is melted and foamy, add the onion and cook, stirring occasionally, until the onions are soft and translucent, 8 to 10 minutes. Reduce the heat to medium and continue to cook, stirring often, until the onions are golden brown, adding a splash of water to the skillet as needed if the bottom is getting brown, 25 to 30 minutes longer. Season the onion with salt and pepper, and scrape into a medium bowl. Set the bowl aside and reserve the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange an oven rack in the center position and heat the oven to 400 degrees. Rub the bottom and sides of a 3-quart baking dish with the cut sides of the garlic clove, then generously coat with room temperature butter. Set the baking dish aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mandoline or a knife and a cutting board, slice about a third of the potatoes into 1/8-inch-thick rounds. Working quickly so the potatoes don’t brown, heat 1 tablespoon butter in the reserved skillet over medium-high, then add the sliced potatoes and 1 thyme sprig; toss until the potato slices are coated in the butter. Season lightly with salt and pepper, then continue to cook, tossing occasionally, until the potatoes are browned in spots and just starting to turn translucent and lose some of their crunchy texture, about 5 minutes. Scrape the potato mixture into a separate large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in two batches, slice the remaining potatoes and cook with the remaining butter and thyme in the skillet just as you did the first batch. Transfer all of the potatoes to the same bowl as the first batch and let cool for a few minutes (reserve the skillet)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter about a third of the potato slices in an even layer on the bottom of the prepared baking dish, then scatter about half of the onions over top. (You can pluck out and discard the thyme sprigs if you like, or, if you don’t mind picking them out later, you can leave them in.) Scatter half of the remaining potatoes in the baking dish, then top with the remaining onions. Layer the remaining potatoes over top in an even layer, shingling them or arranging in a rosette, or you can leave them haphazard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the stock to the reserved skillet and bring to a simmer over medium-high heat. If using homemade stock, give it a taste and add salt as needed to make sure it’s well seasoned (store-bought stock is usually already pretty salty). Remove the skillet from the heat and gently pour the stock into the baking dish just until it barely covers the potato slices. If you have any stock leftover, reserve it for moistening the potatoes as needed while they bake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the baking dish to the oven and bake uncovered until the potatoes are tender and golden across the surface and the stock is bubbling, reduced and has been mostly absorbed by the potatoes, 1 hour 20 minutes to 1 hour 40 minutes. If the surface of the potatoes seems to be drying out or if the potatoes absorb all of the stock during baking, drizzle some of the reserved stock over top to moisten them. (If you don’t have any more stock, you can use water.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the potatoes from the oven and let them cool completely at room temperature (turn off the oven). As it cools, the mixture will set and absorb the stock, but if you are using store-bought stock, it will stay a bit brothy. The potatoes can sit uncovered at room temperature for several hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About an hour before serving, heat the oven to 350 degrees. Transfer the baking dish to the oven and bake uncovered until the potatoes are heated through, 20 to 25 minutes. Serve warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023636-pommes-boulangere"}