{"@context": "http://schema.org", "@type": "Recipe", "name": "Smashed Roasted Carrots", "description": "This wintry salad, inspired by Asian smashed cucumbers, stars sweet roasted carrots. After being roasted until just tender, the carrots are lightly flattened to create texture on their surface, then broiled to char their edges. The gingery, garlicky dressing is a bracing contrast to the sweetness of the carrots. You can use either black vinegar or rice wine vinegar here. Although their flavors are completely different — the black vinegar is caramelized and rich, the rice vinegar lighter and fresher — they each harmonize with the other ingredients in the dressing. Serve this salad warm or at room temperature: It holds up well if you want to make it a few hours in advance. This salad will also work with parsnips.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2023/01/25/multimedia/18apperex1-carrots-ktqg/18apperex1-carrots-ktqg-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, vegetables, main course, side dish", "keywords": "carrot, chile crisp, chile oil, cilantro, peanut, rice vinegar, salad, sesame oil, soy sauce, vegan, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 79}, "recipeIngredient": ["2 pounds carrots, trimmed and scrubbed, large carrots sliced lengthwise into approximately 1-inch-thick pieces", "2 tablespoons neutral oil, such as grapeseed or safflower, or peanut oil", "2 teaspoons fine salt, plus more as needed", "2 tablespoons black vinegar or rice vinegar, plus more to taste", "1 1/2 tablespoons soy sauce, plus more to taste", "1 tablespoon toasted sesame oil", "2 teaspoons dark brown sugar, plus more to taste", "2 teaspoons freshly grated ginger", "2 garlic cloves, finely grated or minced", "3/4 cup coarsely chopped cilantro leaves and tender stems, plus more for garnish if desired", "2/3 cup coarsely chopped roasted peanuts, for garnish", "Chile oil or <a href=\"https://cooking.nytimes.com/recipes/1022366-chile-crisp\">chile crisp</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Place carrots on a rimmed sheet pan, and toss with oil and salt. Roast until tender and caramelized, about 10 to 14 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove carrots from the oven. Using the bottom of a glass measuring cup or a heavy mug, lightly press carrots to flatten slightly and smash. (This will create texture when broiling.) Heat broiler, and broil carrots until charred in spots, 2 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the carrots are roasting, make the dressing: In a small bowl, combine vinegar, soy sauce, sesame oil, brown sugar, ginger and garlic. Whisk until combined, then taste and add more vinegar, soy sauce or brown sugar, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour dressing over charred carrots and toss to combine. Add cilantro and toss. Serve with chopped peanuts and chile oil or crisp, and more cilantro if you’d like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023845-smashed-roasted-carrots"}