{"@context": "http://schema.org", "@type": "Recipe", "name": "Ham and Cheese Quick Bread", "description": "This is the kind of savory cake that you make once and then play around with for years to come. In this version, there are chopped roasted red peppers, small chunks of ham, some herbs and three cheeses (mozzarella, Parmesan and fontina). The cheeses could be Cheddar and Gruyère and a semisoft, easily meltable cheese of your choice. The batter could have chopped Calabrian chiles or pepperoncini (go easy on these hot peppers), a different mix of herbs, scallions or shallots for the chives and pancetta or bacon bits for the meat (or you can skip the meat). Cut the cake into fingers to have with wine or serve it alongside soup or salad. And if it goes a little stale, simply toast it.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2022/12/14/multimedia/09CAKESREX3-ham-and-cheese-1-70f1/12CAKES-REX3-ham-and-cheese-1-70f1-articleLarge.jpg", "totalTime": "PT1H5M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "breakfast, snack", "keywords": "christmas, thanksgiving, ham, loaf cake, make-ahead, mozzarella, parmesan, roasted red pepper", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 263}, "recipeIngredient": ["Butter or nonstick baker’s spray, for the pan", "2 cups/272 grams all-purpose flour ", "1 tablespoon baking powder", "3/4 teaspoon fine sea salt", "1/2 teaspoon red pepper flakes (or to taste)", "2 large eggs, at room temperature", "1 large egg white, at room temperature", "1/2 cup whole milk, at room temperature ", "1/4 cup olive oil", "2 tablespoons honey", "4 ounces/115 grams shredded mozzarella, preferably low-moisture (1/2 cup)", "3 ounces/85 grams fontina, cut into small (1/4- to 1/2-inch) cubes (2/3 cup)", "3 ounces/85 grams ham or pancetta, cut into 1/4-inch cubes (1/2 cup)", "2 whole roasted red peppers (about 2 1/2 ounces/70 grams), halved, patted dry and finely chopped", "2/3 ounce/20 grams shredded Parmesan (3 tablespoons), plus more for sprinkling", "3 tablespoons snipped chives ", "1 teaspoon fresh thyme, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven and heat the oven to 350 degrees. Butter an 8 1/2- by 4 1/2-inch loaf pan (glass or metal) or coat it with bakers’ spray. Line it with parchment paper, running the paper along the bottom and up the long sides of the pan. Leave extra paper on the long sides; they make good handles for removing the loaf from the pan. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together the flour, baking powder, salt and pepper flakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another bowl, whisk together the eggs and egg white, the milk, olive oil and honey until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another bowl, fold together the mozzarella, fontina, ham, peppers, Parmesan, chives and thyme to combine, breaking up any cheese cubes that have stuck together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the liquid ingredients over the flour mixture and, using a flexible spatula, stir a few times, just to get things started. Top with the cheese and ham mixture and, using as few strokes as possible, mix them in. Be gentle and don’t be too diligent — it’s better to have a few dryish spots than to overmix the batter. Scrape the batter into the pan, level the top and sprinkle with a little Parmesan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for about 50 minutes if using a glass dish (you may need to bake it slightly longer if using metal), until the bread is golden brown and a tester inserted into the center comes out clean. Because of all the cheese, you could easily mistake a bit of cheese for a wet spot. If you’ve got an instant-read thermometer, you might want to test with it: the loaf should register 195 degrees. Transfer the pan to a rack and let sit for about 5 minutes before unmolding. Remove the paper and allow the loaf to come to room temperature on the rack. Wrapped well, the cake will keep for about 3 days at room temperature. It can be frozen for up to 1 month."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023731-ham-and-cheese-quick-bread"}