{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom and Eggplant Yassa", "description": "Sauce yassa is a richly flavored Senegalese stew typically cooked with poultry, meat or fish. It’s the result of slowly caramelized onions, chile, garlic and ginger simmered in stock and finished with a splash of lime juice. This vegetable version, a vegan adaptation, uses mushrooms and eggplants, which both add layers of depth to the sauce. A shower of thinly sliced fresh scallions announces itself with its delicate yet crisp bite. Serve a generous helping of the sauce over steamed rice, millet or fonio, along with additional lime wedges for squeezing, if desired.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2022/11/29/dining/yk-mushroom-yassa/yk-mushroom-yassa-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 Servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, main course, side dish", "keywords": "eggplant, mushroom, scotch bonnet, senegalese, yellow onion, healthy, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 181}, "recipeIngredient": ["6 tablespoon neutral oil, such as grapeseed or canola, plus more as needed", "1 pound baby bella or button mushrooms, sliced", "Salt and black pepper", "8 thyme sprigs", "2 large yellow onions (about 1 1/2 pounds total), thinly sliced", "1 Scotch bonnet chile", "4 garlic cloves, thinly sliced", "1 (2-inch) piece fresh ginger, scrubbed and grated", "2 fresh or dried bay leaves", "1 medium eggplant (about 1 1/4 pounds), trimmed and cut into 1-inch cubes", "2 cups vegetable stock", "2 limes", "1 tablespoon Dijon mustard", "2 scallions, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon oil in a large skillet over medium-high. Working in 2 batches, add an even layer of the mushrooms to the hot oil. Season with salt and pepper and add 4 thyme sprigs. Sear, stirring, until lightly browned on both sides, about 4 minutes. Transfer the mushrooms to a plate and repeat with another tablespoon oil and the remaining mushrooms and thyme."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons oil over medium-high. Add the onions and season with salt and pepper. Cook, stirring occasionally, until softened and browned along the edges, about 5 minutes. Reduce the heat to medium and continue to cook, stirring frequently, until caramelized, about 12 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 2 tablespoons oil to the skillet. Poke holes in the Scotch bonnet with the tip of a sharp knife and drop it in. Add the garlic, ginger and bay leaves. Stir and cook until the chile starts to soften, about 1 minute. Add the eggplant and season lightly with salt. Stir to coat with the onion mixture. Return the mushrooms to the pan along with any liquid that's collected on the plate. Add the vegetable stock and simmer over medium-high heat, stirring frequently, until the liquid is saucy, about 8 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Juice 1 lime and cut the other into wedges. Add the lime juice and mustard to the sauce. Stir and cook until the sauce is thickened, about 4 minutes. Stir in the scallions and cook for an additional minute. Taste and adjust with more salt or lime juice if desired. Serve the warm yassa over steamed rice, fonio or millet, along with the lime wedges for squeezing."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023666-mushroom-and-eggplant-yassa"}