{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Bundt Cake", "description": "This is a big, bold lemony cake that uses the zest, juice and flesh of lemons for an extrapuckery bite. A thin layer of crackly lemon glaze coats the whole cake for a beautiful and delicious finish. Serve this cake as is, or add some berries and whipped cream to dress it up. It tastes even better the next day, so feel free to make it ahead. Since it makes use of the lemon skins, use organic or unwaxed lemons if you can.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2022/05/17/dining/ya-lemon-bundt-cake/ya-lemon-bundt-cake-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "bundt cake, lemon, sour cream, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 594}, "recipeIngredient": ["3/4 cup/170 grams unsalted butter, softened, plus more for greasing the pan", "3 cups/384 grams all-purpose flour, plus more for dusting the pan", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "4 lemons (preferably organic or unwaxed), scrubbed and dried", "2 1/4 cups/450 grams granulated sugar", "1/4 cup/60 milliliters neutral oil", "5 large eggs, at room temperature", "1 cup/230 grams sour cream, at room temperature", "1 teaspoon kosher salt (such as Diamond Crystal) or 1/2 teaspoon fine salt, plus more for the glaze", "2 cups/200 grams sifted confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees, and butter and flour a 12- to 15-cup Bundt pan. Make sure to apply a thin layer of butter and flour on every nook and cranny of the pan to ensure that the cake doesn’t stick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the flour, baking powder and baking soda."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Zest the lemons into the bowl of a stand mixer or large mixing bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the remaining peel and pith from 3 of the lemons by cutting off the top and bottom tip of each lemon. Stand each lemon up on one end, and use a sharp paring knife to follow the curve of the fruit and cut the peel and white pith away; discard it. Chop the lemon flesh into small pieces and remove the seeds and any large pieces of membrane. Transfer the chopped lemons to a bowl if the juice is running off of the board. (You should have about ⅓ cup.) Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the granulated sugar to the bowl with the zest and rub the mixture together with your fingers to release the oils in the zest. Add the softened butter and oil to the mixture, and mix on medium speed with the paddle attachment or using an electric hand mixer until light and fluffy, about 4 minutes. Add the eggs one at a time, mixing well after each addition. Scrape down the sides of the bowl occasionally to ensure even mixing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sour cream and salt, and mix on medium speed until homogeneous. Add the lemon flesh and juices, and mix until well combined; the mixture may separate a bit, but don’t worry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour mixture and mix on low speed until just combined. Scrape down the sides and bottom of the bowl with a rubber spatula to make sure everything is well mixed and no pockets of flour remain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the batter into the prepared pan, smooth the top and tap the pan on the counter a few times to release any large air bubbles. Bake the cake for 50 to 60 minutes or until the cake is golden and puffed, and a toothpick inserted comes out with a few moist crumbs. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the cake cool on a rack for 10 minutes. Then carefully turn it out onto a rack or serving plate to glaze and finish cooling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake cools, make the glaze: Juice the remaining lemon. (You should have about 4 tablespoons.) Add the confectioners’ sugar, a pinch of salt and about three-quarters of the lemon juice to a bowl. Whisk until smooth, adding more lemon juice as necessary to make a thin but opaque glaze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately brush a thin layer of glaze over the warm cake, and let the glaze set until the cake has cooled to almost room temperature. When the cake is mostly cool, brush the remaining glaze over the top. Cool, slice and serve. Store any leftovers covered at room temperature for up to 4 days; the glaze may get a bit sticky as it sits."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023201-lemon-bundt-cake"}