{"@context": "http://schema.org", "@type": "Recipe", "name": "Chestnut Risotto", "description": "Chestnuts fried in olive oil taste like soft, meaty nuggets of holiday cheer when stirred into creamy rice. A big pot of risotto is always a good time, especially when it’s the centerpiece of a D.I.Y. toppings bar. Roasted mushrooms and onions, quick-pickled celery, sour cream and dill can be offered as crispy, crunchy, salty and creamy toppings to go with the savory risotto. Risotto tastes best when made fresh, but you can — and should — prepare the toppings ahead of time, storing them in the refrigerator up to a day or two in advance, then cook the risotto just before your guests arrive.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/12/28/multimedia/21RISOTTOREX1-chestnut-risotto-1-f819/22RISOTTOREX1-chestnut-risotto-1-f819-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, main course", "keywords": "arborio rice, chestnut, cremini, miso, risotto, christmas, new year’s day, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 403}, "recipeIngredient": ["2 cups thinly sliced celery plus leaves (from 3 large stalks)", "1/4 cup rice vinegar", "Pinch of granulated sugar", "Coarse kosher salt and freshly ground black pepper", "1 1/2 pounds cremini mushrooms", "Extra-virgin olive oil", "2 large red onions (1 1/2 pounds)", "2 dried or fresh bay leaves", "Extra-virgin olive oil", "4 shallots, finely chopped", "2 celery stalks, finely chopped", "10 ounces roasted and peeled chestnuts, coarsely chopped", "Salt and freshly ground black pepper", "3 cups carnaroli or arborio rice", "1/2 cup shiro (white) miso", "1/4 cup cold unsalted butter, cut into pieces", "1 cup grated Parmigiano-Reggiano (3 ounces)", "1 cup sour cream (8 ounces), for serving", "1 bunch fresh dill, leaves and tender stems coarsely chopped, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the toppings, starting with the pickled celery: Place the celery in a small bowl. Add the rice vinegar and sugar, season with 1/2 teaspoon salt and 1/8 teaspoon pepper, then stir to combine. Cover the mixture and place it in the refrigerator until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the roasted vegetable toppings: Position a rack in the center of the oven and another below it. Heat the oven to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a damp paper towel, wipe the mushrooms clean. Pluck the stems off the caps and transfer the stems to a large pot. Thinly slice the mushroom caps and transfer to a large bowl. Drizzle enough olive oil (5 to 6 tablespoons) to generously coat the sliced mushrooms; season with salt and pepper. Toss to combine and transfer to a large sheet pan in a single layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash, peel, halve and thinly slice the red onions. Transfer the onion peels and any trimmings to the pot. Transfer the sliced onions to the empty bowl, drizzle with enough olive oil (about 3 tablespoons) to generously coat, and season with salt and pepper. Toss to combine and transfer to another large sheet pan in a single layer. (Save the bowl without washing it.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the onions on the center rack of the oven and the mushrooms on the lower rack. Roast the vegetables until deeply golden brown at the edges, stirring them halfway through, 30 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the vegetables roast, make the broth: Fill the pot with 8 cups cold tap water, add the bay leaves and season with 1 tablespoon salt and 1/8 teaspoon pepper. Bring to a boil over high, then reduce the heat to medium-low and simmer for 30 minutes. Strain into the reserved bowl, discard the vegetable scraps and transfer the stock back to the pot. Bring to a simmer and keep at a gentle simmer over low heat. Bring 4 cups water to a boil in a kettle or saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the risotto: In a large Dutch oven, add enough olive oil to generously coat the bottom. Heat the oil over medium. Add the shallots, celery and chestnuts, season with salt and pepper, and cook, stirring occasionally, until the vegetables are soft but not brown, 7 to 9 minutes. Add more olive oil if the pot looks dry. Add the rice and stir continuously until each grain is coated in the fat and looks shiny and translucent at the edges, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in 1 cup of the simmering stock and stir vigorously until the rice has absorbed all the liquid. Add another cup of stock and stir occasionally until the rice has absorbed that stock. Continue like this, adding a cup of stock at a time and stirring just enough to make sure the rice doesn’t stick to the bottom of the pot (every 3 to 5 minutes). When you’re out of the stock, continue with the boiling water, cooking until the rice grains are tender but maintain defined edges. This entire process will take anywhere from 20 to 25 minutes. Remove the pot from the heat and cover."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, stir 1/4 cup of boiling water with the miso until smooth. Add this miso mixture, the butter and cheese to the risotto and stir until incorporated. Serve the risotto immediately, with the roasted mushrooms and onions, quick-pickled celery, sour cream and dill in separate bowls with serving spoons so that guests can top their risotto themselves."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023754-chestnut-risotto"}