{"@context": "http://schema.org", "@type": "Recipe", "name": "Double-Chocolate Thumbprint Cookies", "description": "Deeply chocolaty like devil’s food cake, speckled with sugar on the outsides and filled with soft chocolate or jam in the centers, these cookies are a double pleasure: delightful to eat and fun to make. While “thumbprints” is an adorable name, it’s a misnomer: You use every part of your hands to form these. The cookies need to be pinched, patted, rolled around and poked before they’re sent into the oven. It’s a great project to do with kids — small thumbs are perfect for forming little dimples in the dough. What you fill the centers with is up to you. Chocolate with chocolate is great — naturally pink ruby chocolate is particularly pretty — and jam is delicious, too.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2022/03/06/magazine/06mag-eat-site/06mag-eat-site-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 40 cookies", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "chocolate, cinnamon, cookie, sanding sugar, christmas, mother’s day, valentine’s day", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 514}, "recipeIngredient": ["3/4 cup/102 grams all-purpose flour", "1/2 teaspoon fine sea salt", "1/2 teaspoon ground cinnamon", "5 tablespoons/71 grams unsalted butter, cut into pieces", "8 ounces/226 grams semisweet or bittersweet chocolate, coarsely chopped (about 1⅓ cups)", "2/3 cup/132 grams granulated sugar", "2 cold large eggs", "1 teaspoon pure vanilla extract", "Sanding or granulated sugar, for coating (about ⅓ cup)", "4 ounces/113 grams chocolate (white, milk, dark or ruby), chopped (about ½ cup)", "1/2 teaspoon canola oil (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cookies: Whisk together the flour, salt and cinnamon in a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a heatproof medium bowl over a saucepan of gently simmering water; don’t let the water touch the bottom of the bowl. Drop in the chunks of butter and scatter over the chocolate. Heat, stirring now and then, until the butter and chocolate are melted, but not so hot that they separate, 5 to 7 minutes.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bowl from the saucepan and whisk in the sugar. (Don’t be alarmed when the mixture turns grainy.) One by one, add the cold eggs, whisking vigorously until the mixture is thick and smooth, and the whisk leaves tracks. Beat in the vanilla, then switch to a spatula and add the flour in 3 additions, stirring gently between each addition, until the flour disappears into the dough. Press a piece of plastic wrap against the surface of the dough and refrigerate for at least 2 hours or up to 4 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to bake, center a rack in the oven and heat it to 350 degrees. Line 2 baking sheets with parchment paper or silicone baking mats. Put the sanding or granulated sugar in a small bowl and, if you’ve got one, have a cork from a wine bottle at hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a small cookie scoop or measuring spoon, scoop mounds of dough, each a scant tablespoon. Roll the dough into balls and then roll the balls in the sugar to coat. Place the balls on the baking sheets, giving them 1½ inches or so of space to spread. Press the cork into the center of each cookie or use your thumb to make an indentation."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 1 sheet for 10 to 12 minutes, or until the cookies feel firmish. Transfer the baking sheet to a rack. The indentations will have puffed in the oven, so you’ll want to press them down again. Repeat with the second sheet. Let cookies cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the prints: Melt milk, dark or ruby chocolate in a heatproof bowl set over a saucepan of simmering water. If using white chocolate, add oil before melting and stir until smooth. While the chocolate is still warm and fluid, use a small spoon to fill each indentation to the brim, letting the chocolate fall from the end of the spoon. Slide the cookies into the refrigerator for about 10 minutes to set the chocolate. The cookies will keep for about 5 days in a covered container at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023005-double-chocolate-thumbprint-cookies"}