{"@context": "http://schema.org", "@type": "Recipe", "name": "Dal Adas (Spicy Red Lentil Tamarind Soup)", "description": "As with all culinary traditions, southern Iranian cuisine has been influenced by the cooking of neighboring regions. Spicy and warming, dal adas is a popular southern Iranian red lentil soup or stew reminiscent of Indian masoor dal. It bursts with flavor from plenty of garlic and spices, and tickles with heat from ground cayenne. The dish is brightened with tamarind, an ingredient commonly used in the south of Iran to add the requisite Iranian tang to dishes. For ease, use tamarind concentrate, which can be found at most Middle Eastern, Asian and Latin markets, plus many supermarkets. Dal adas can be served as a soup, as done here, with a side of flatbread. If you prefer to serve it as a stew over rice, reduce the water amount by about one cup.", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2022/09/06/dining/nd-dal-adas/merlin_212088567_c8f02dc8-a19a-492b-b8ae-9f70eb58a58f-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews, main course", "keywords": "cilantro, iranian, red lentils, tamarind, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 318}, "recipeIngredient": ["3 tablespoons ghee or extra-virgin olive oil, plus more as needed", "1 large yellow onion, finely chopped", "6 large garlic cloves, finely chopped", "1 (2-inch) piece of fresh ginger, finely chopped", "12 fresh cilantro sprigs, leaves set aside for garnish and stems finely chopped (about 1 tablespoon)", "Kosher salt (such as Diamond Crystal) and black pepper", "2 teaspoons ground cumin", "1 teaspoon ground turmeric", "1/2 teaspoon ground cayenne, or to taste", "1 tablespoon tomato paste", "2 cups red lentils, rinsed", "1/2 teaspoon ground cinnamon", "1 to 2 tablespoons tamarind paste or lime juice, plus more as needed", "Flatbread or plain white rice (optional), for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, heat the ghee or oil over medium-high. Add the onion, reduce the heat to medium and cook the onion, stirring occasionally, until golden and a little browned around the edges, 10 to 12 minutes. Reduce heat to medium-low, add the garlic, ginger and cilantro stems. Add a little more ghee or oil if your pot seems dry. Season with a pinch of salt and cook, stirring frequently, until fragrant and softened, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the cumin, turmeric and cayenne and cook until fragrant, about 1 minute. Add the tomato paste and cook in the oil to take off its raw edge and deepen its color, stirring frequently and taking care not to burn the paste, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the lentils and stir to combine. Add 8 cups of water and season with salt (about 1½ tablespoons) and black pepper to taste. Partially cover, raise the heat to high and bring to a boil. Cover completely, reduce heat to medium-low and simmer, stirring occasionally to make sure nothing sticks to the bottom of the pot, until the lentils soften, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to low and stir in the cinnamon. Add the tamarind paste or lime juice, 1 tablespoon at a time, tasting as you go to ensure it hits just the right bright and tangy notes to balance the heat. Taste and adjust seasoning as needed, then cover and simmer for 10 minutes more, until all the flavors meld."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish with the reserved cilantro leaves and serve with flatbread or rice, if desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023445-dal-adas-spicy-red-lentil-tamarind-soup"}