{"@context": "http://schema.org", "@type": "Recipe", "name": "Cream Cheese Pound Cake", "description": "Reminiscent of Sara Lee’s loaves in the freezer aisle, this tender, buttery treat is like a pound cake in sheet cake form. For a Barbie-pink dream house finish, prepare this with the optional toppings: raspberry preserves, gently salted whipped cream and a snowy, psychedelic blanket of freeze-dried raspberries. Any toppings should be added right before serving, but if it’s simplicity you’re after, then you can skip them and dust the cake with confectioners’ sugar or nothing at all. The cake, undressed, will keep in an airtight container at room temperature for up to 3 to 4 days or well-wrapped in the freezer for up to a month.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/12/28/multimedia/21RISOTTOREX2-cream-cheese-pound-cake-1-53a0/22RISOTTOREX2-cream-cheese-pound-cake-1-53a0-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "One 9-by-13-inch cake", "recipeCuisine": "", "recipeCategory": "snack, dessert", "keywords": "christmas, new year’s day, cream cheese, freezer friendly, make-ahead, pound cake", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 340}, "recipeIngredient": ["2 1/2 cups/320 grams all-purpose flour", "1 teaspoon baking powder", "1 1/2 cups/345 grams unsalted butter, at room temperature", "8 ounces/226 grams cream cheese, at room temperature", "3 cups/600 grams granulated sugar", "1 tablespoon vanilla extract", "1 1/4 teaspoons fine sea salt", "5 large eggs, at room temperature", "1 cup/305 grams raspberry preserves (see Tip)", "2 cups/473 milliliters cold heavy whipping cream", "2 tablespoons granulated sugar", "1/2 teaspoon fine sea salt", "1 1/2 cups/34 grams freeze-dried raspberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake: Position a rack in the center of the oven and heat the oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, add the flour and baking powder. Whisk to combine and to break up any lumps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter to the bowl of a stand mixer fitted with the paddle attachment. Use the empty butter wrappers to generously grease a 9-by-13-inch baking pan; line the bottom and long sides with parchment. Add the cream cheese, sugar, vanilla and salt to the bowl with the butter and mix on medium-low speed to combine. Increase the speed to medium-high and beat until fluffy, almost white and the sugar is mostly dissolved, 5 to 7 minutes. With the mixer on medium speed, add the eggs one at a time, mixing until smooth after each addition. Use a flexible spatula to scrape the bowl, then beat over medium speed for another minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer on low speed, gradually add the dry ingredients and mix until most of the flour streaks have disappeared. Using the spatula, scrape the bowl and gently stir until you eliminate the flour streaks. Scrape the batter into the prepared pan, then smooth out the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, rotating the pan halfway through, until golden brown and a skewer or cake tester inserted in the center comes out clean, 60 to 65 minutes. When you gently press on the center of the cake with your fingertip, you shouldn’t leave a dent. Let cool completely in the pan. (The cooled cake can be covered and kept at room temperature for up to 3 or 4 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re preparing the optional toppings, assemble the cake: Spread the preserves evenly over the cooled cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer, whisk the heavy whipping cream, sugar and salt over medium-high until billowy soft peaks form. When you lift the whisk out of the bowl and turn it upside-down, a peak of cream should flop over slightly like a Santa hat. Evenly spread the whipped cream over the jam-topped cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the freeze-dried raspberries to a fine-mesh sieve and hold it over the cake. Using your fingers, pass them through until most of the magenta powder rests atop the frosting like fresh snow and most of the seeds are left behind in the sieve. The entire surface of the whipped cream should be covered in pink dust. Discard the raspberry seeds. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023755-cream-cheese-pound-cake"}