{"@context": "http://schema.org", "@type": "Recipe", "name": "Torta Rustica With Ricotta and Spinach", "description": "Torta rustica (also called pizza rustica) is a rich, ricotta-stuffed pie that’s traditionally baked for Easter in Southern Italy. This version includes greens (either spinach or chard) for color and freshness. The ham is optional; feel free to leave it out, or substitute chopped olives or sundried tomatoes if you’re looking for a similar savory bite. The crust, adapted from Nancy Harmon Jenkins’s 2007 cookbook, “Cucina del Sole,” is sturdy and slightly sweet, which makes a nice contrast to the salty filling. (For more on producing a lattice-style crust, see our <a href=\"https://cooking.nytimes.com/guides/3-how-to-make-a-pie-crust\">How to Make Pie Crust</a> guide.)", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/04/13/dining/08apperex/merlin_204759306_97db578b-356b-42e8-9e74-15aeb754aeb0-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "10 to 12 servings", "recipeCuisine": "italian", "recipeCategory": "pies and tarts, main course", "keywords": "easter, mozzarella, ricotta, spinach", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 506}, "recipeIngredient": ["2 1/2 cups/310 grams all-purpose flour, plus more as needed", "2 tablespoons granulated sugar", "1/4 teaspoon fine sea or table salt", "3/4 cup/170 grams cold unsalted butter, cut into pieces", "1 large egg", "1 large egg white (save the yolk for the egg wash)", "Zest from 1 lemon", "3 to 4 tablespoons iced dry white wine or ice water spiked with 1/2 teaspoon cider or white wine vinegar", "3 cups/24 ounces whole-milk ricotta", "1 tablespoon extra-virgin olive oil", "About 5 cups/5 ounces baby spinach or chard, coarsely chopped", "2 garlic cloves, finely grated or minced", "1/2 teaspoon fine sea or table salt, plus more as needed", "2 large eggs", "2 cups/8 ounces shredded fresh mozzarella", "1 cup/4 ounces grated Pecorino Romano or Parmesan (pecorino is stronger, Parmesan is milder, or use a combination)", "1/2 cup/4 ounces ham, diced (optional)", "1/2 cup chopped parsley", "1 1/2 teaspoons freshly ground black pepper", "1/8 teaspoon red-pepper flakes, plus more as needed", "1/8 teaspoon freshly grated nutmeg", "Egg wash (1 egg yolk beaten with 1 teaspoon water)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a food processor, pulse together the flour, sugar and salt. Add butter and pulse until the mixture forms lima bean-size pieces. Alternatively, mix together flour, sugar and salt in a large bowl, then add butter, working the pieces into the flour with your hands, squeezing and pinching them until the mixture looks like oatmeal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add egg, egg white and lemon zest, and pulse after each addition. If working by hand, whisk together egg, egg white and lemon zest in a separate bowl, then mix into the butter mixture. Slowly add iced wine, 1 tablespoon at a time, and pulse or mix by hand until the dough just comes together. You may not need all the liquid. The dough should be moist, but not wet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough out onto a lightly floured surface, and gather and press it into a ball. Divide into 2 portions, one slightly larger than the other, and shape into disks. Wrap the disks tightly with plastic wrap and refrigerate for at least 1 hour and up to 5 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, heat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: If your ricotta seems watery, put it in a sieve and let it drain while you cook the spinach."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat oil over medium-high heat. Add spinach and cook until wilted, about 2 minutes. Stir in garlic and a large pinch of salt, and continue to cook until spinach is very dry, about 2 minutes longer. Transfer to a large bowl to cool. If any liquid accumulates as the spinach sits, pour it out of the bowl (you don’t want it to water down the ricotta)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, purée drained ricotta and eggs until just combined and smooth. Add to the bowl with the spinach and fold in mozzarella, pecorino, ham (if using), parsley, black pepper, 1/2 teaspoon salt, red-pepper flakes and nutmeg. Set aside when rolling out dough (or chill for up to 4 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll out the larger pastry dough disk to a 14-inch circle, about 1/8-inch thick. Fit dough into a 9-inch springform pan, pressing the dough up the sides of the pan. Scrape filling into crust and spread evenly. Roll out second pastry disk to a 12-inch circle, about 1/8-inch thick. Cut 1/2-inch-wide strips and weave into a lattice on top of the filling. Seal, trim and crimp the edges. Brush the top of the torta with the egg wash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place torta on sheet pan and bake until crust is crisp and brown, and filling is firm, 50 to 60 minutes. Cool on a rack for at least 45 minutes before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023112-torta-rustica-with-ricotta-and-spinach"}