{"@context": "http://schema.org", "@type": "Recipe", "name": "Make-Ahead Mashed Potatoes", "description": "It’s not just that mashed potatoes can be made ahead; they actually end up creamier and fluffier when prepared in advance. When mashed potatoes chill, their starches firm up, and when reheated gently, they relax into a mash with an even silkier texture. But you can’t save potatoes that start out gluey. Shearing cooked spuds with any blade — food processor, blender or hand mixer — releases enormous amounts of starch and turns the mash into spackle. Here, you break up the potatoes by hand or with a stand mixer’s paddle attachment for an airy smoothness. If you have a ricer or food mill, you can use that instead.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/11/09/dining/02korex-potatoes/merlin_215517513_bdc3b19b-d142-43b0-a8f4-055b6ebe44d0-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "8 to 12 servings (10 cups)", "recipeCuisine": "", "recipeCategory": "dinner, side dish", "keywords": "butter, make-ahead, mashed potato, milk, russet potatoes, thanksgiving, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 863}, "recipeIngredient": ["Salt and pepper", "5 pounds russet potatoes", "10 tablespoons butter, sliced and at room temperature, plus more for reheating", "1 cup whole milk, warmed, plus more for reheating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot with 8 cups cold water and 1 tablespoon salt. Peel and quarter the potatoes, adding each to the cold water as you cut to prevent them from discoloring. The potatoes should be immersed. If they’re not, add enough water to cover them, along with a pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a boil over high heat and continue boiling until a knife slides through the potatoes very easily, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain well, then return the potatoes to the pot. Some should be falling apart. Heat over low, shaking the pot occasionally, until the potatoes are mottled and very dry, 2 to 3 minutes. Turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mash in the pot, adding the butter a few pieces at a time, until smooth, then stir in the milk and season to taste with salt and pepper. Or transfer to a stand mixer and beat with the paddle on low, adding a few pieces of butter at a time, until smooth, then add the milk with the machine running. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "You can serve the potatoes right away or hold them for up to 3 hours: Transfer the hot potatoes to a large, wide metal bowl and evenly smooth the top. Set the bowl over a large saucepan of steaming water (or in a skillet of steaming water) over low heat. Add just enough milk to barely cover the potatoes and partly cover the bowl. Stir gently but well before serving so they’re evenly hot and creamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "You also can transfer the potatoes to an airtight container and refrigerate for up to 3 days. To reheat, use the setup in Step 5, but add an ⅛-inch layer of milk over the cold, flat top of the potatoes and stir the potatoes every 10 minutes to help them reheat evenly. The whole batch should be steaming hot within 30 minutes. If the mash is still stiff when hot, stir in more milk (or butter, if you’d prefer). Season to taste with salt and pepper again before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023616-make-ahead-mashed-potatoes"}