{"@context": "http://schema.org", "@type": "Recipe", "name": "Air-Fryer Chicken Breast", "description": "By some kind of magic, an air fryer can transform a chicken breast into an easy, flavorful dinner with minimal effort. Part of this sorcery takes a cue from Eric Kim’s dry-brined chicken breast <a href=\"https://cooking.nytimes.com/recipes/1022238-dry-brined-chicken-breasts\">recipe</a>, which calls for cutting the chicken breast in half, allowing you to pluck the smaller piece from the air fryer as soon as it’s done, leaving the thicker part to remain in the air fryer longer and preventing any overcooked bites. Paired with vinegar, soy sauce acts less as a salt and more as a marinating agent in this recipe. The circulating heat and compact space of the air fryer allows the ingredients to reduce into a sweet and slightly sticky sauce as they collect at the bottom, emboldening their flavors.", "author": {"@type": "Person", "name": "Eleanore Park"}, "image": "https://static01.nyt.com/images/2022/12/22/multimedia/ep-air-fryer-chicken-breasts-1-d643/ep-air-fryer-chicken-breasts-1-d643-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "1 to 2 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, for one, for two, lunch, quick, weeknight, poultry, main course", "keywords": "air fryer, chicken breast, rice vinegar, soy sauce", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 356}, "recipeIngredient": ["1 large boneless, skinless chicken breast (about 11 ounces)", "Salt", "Freshly cracked black pepper", "2 teaspoons light brown sugar", "1 tablespoon rice vinegar", "1 tablespoon low-sodium soy sauce", "2 teaspoons olive oil", "Lime wedge (optional), for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat air fryer to 375 degrees, if preheating is recommended for your air fryer. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat chicken breast dry with a paper towel. Cut chicken breast in half crosswise into two pieces of equal weight, creating one shorter, thicker piece and one longer, thinner piece. Season chicken generously on all sides with salt and pepper; rub brown sugar all over. (Chicken breast can be seasoned and left uncovered for up to 12 hours in the refrigerator. Let the chicken come to room temperature before cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine the rice vinegar, soy sauce and olive oil. Toss chicken in soy sauce mixture until well coated and allow chicken to sit in marinade for 5 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer chicken to the air fryer basket, setting leftover marinade aside. Cook for 6 minutes and flip the chicken over. Spoon the remaining marinade over chicken. Cook until chicken is lightly browned, the sauce has turned slightly sticky on the chicken and the internal temperature at the thickest part of the meat reaches 165 degrees, another 6 to 10 minutes. The thicker half of the breast may need a few more minutes to cook through than the smaller piece."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken to a cutting board to rest for at least 5 minutes so the juices can settle and redistribute. Slice the chicken against the grain. Pour any sauce left at the bottom of the air fryer over the chicken and serve. For some extra brightness, squeeze lime wedge all over the chicken, if desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023761-air-fryer-chicken-breast"}