{"@context": "http://schema.org", "@type": "Recipe", "name": "Chiles Anchos Rellenos de Queso", "description": "Well known in Mexico and the United States, chiles rellenos are most often thought of as featuring charred, batter-fried and stuffed fresh poblanos, but dried chiles are also commonly used. Dried poblanos, called anchos, are similar in texture and flavor to dried apricots but with a smoky, slight spicy finish. Soft, pliable and mildly sweet, they can be stuffed without having to be charred and peeled.", "author": {"@type": "Person", "name": "Rick A. Martínez"}, "image": "https://static01.nyt.com/images/2022/10/12/dining/06ESSENTIALSREX3-chiles-rellenos/merlin_214158306_8b4de123-ce56-4edf-aa5a-142f45d9e801-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, vegetables, main course, side dish", "keywords": "ancho chile, cornmeal, egg, jalapeño, orange juice, plum tomato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 66}, "recipeIngredient": ["1 pound Roma tomatoes (6 to 7), cored and left whole", "2 large jalapeños, stemmed", "1/4 large white onion, chopped", "1 garlic clove, peeled", "Kosher salt (such as Diamond Crystal)", "1 tablespoon fresh lime juice", "8 large ancho chiles (152 grams)", "1 cup orange juice", "1 garlic clove, finely grated", "1 teaspoon dried oregano, preferably Mexican ", "1/2 teaspoon ground allspice", "1 pound queso panela, queso ranchero or paneer, cut into 1/4-inch-thick slices", "1/2 cup masa harina, cornmeal or all-purpose flour", "Vegetable oil, for frying", "5 large eggs, separated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the roasted tomato salsa: Arrange a rack in the center of the oven; heat to 475 degrees. Line a sheet pan with parchment paper or foil. Arrange the tomatoes and jalapeños on the prepared pan and roast until the skin of the tomatoes and jalapeños is dark brown in places and starting to peel away from the flesh, 30 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the tomatoes and jalapeños to a blender; add the onion, the garlic and 2 teaspoons of salt; and purée until completely smooth. Transfer the salsa to a medium bowl, stir in the lime juice, and set aside (this can be made up to 8 hours in advance)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chiles rellenos: Using a very sharp paring knife or kitchen shears, make a 2-inch cut down the side of each of the chiles, starting at the widest part near the stem. Leave the stem intact. Carefully remove the pith and seeds from the inside and discard. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk orange juice, garlic, oregano, allspice and 1/2 teaspoon salt in a medium bowl until the salt has dissolved. Dip each of the anchos in the mixture, flipping and gently moving it around to coat the inside and out. Let sit in the marinade until softened, about 30 minutes (they will absorb the flavor of the marinade). Remove, shake off excess marinade and arrange chiles on a sheet tray. Carefully stuff each with a slice of panela. If you have large chiles, you may need more than 1 slice. Close the chiles and bring together their edges. Using a toothpick or small skewer, secure the edges so that the cheese doesn’t fall out. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place masa harina in a pie plate or on a plate with a high rim. Working with 1 chile at a time, dredge in masa harina, turning to coat and packing it into crevices. Shake to remove excess; return chiles to the sheet tray. Repeat with remaining chiles. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour enough oil into a heavy medium-size pot with high sides, preferably cast-iron, so that it comes 3/4 inch up the sides. Heat oil over high until it reaches 400 degrees (you will need to adjust the heat level to maintain this temperature while frying). Place yolks in a small bowl and use a fork to beat. Using a stand mixer or hand mixer, beat the egg whites and 1/4 teaspoon salt on high speed until you get stiff peaks, 3 to 4 minutes. Reduce speed to low, drizzle in yolks, and beat until no streaks of white remain. The mixture will deflate slightly and should be pale yellow and creamy. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with 1 chile at a time, grab the chile by the stem and slide it into the batter, making sure that it is completely coated on all sides and up to the stem. Carefully lay the chile in the oil, point side first and away from you. (This way, if you drop the chile, the oil will splash away from you.) Use a heatproof metal spoon to baste the top of the chile with hot oil for about 20 seconds. This will seal the surface, and the batter will start to puff and turn very light golden. Fry until chiles are golden brown on both sides, 1 to 2 minutes per side. Transfer to a wire rack set over paper towels to drain. Repeat with remaining chiles and batter. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the toothpicks. Serve the warm chiles rellenos topped with the roasted tomato salsa (warm or room temperature)."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023506-chiles-anchos-rellenos-de-queso"}