{"@context": "http://schema.org", "@type": "Recipe", "name": "Capirotada (Mexican Bread Pudding)", "description": "Capirotada is a seasonal dish eaten for Lent or Cuaresma, a time of the year when many Mexican households whip up meatless meals on Fridays. This cinnamon-scented bread pudding is a balance of textures, and sweet and slightly savory flavors. Its array of garnishes vary, and families debate which ingredients should make the cut and which should be forgotten. In Zacatecas, Mexico, onion is an unexpected ingredient that ties together the piloncillo and cheese. This dish can be made traditional or plant-based by selecting dairy-based or vegan butter and cheese. The key ingredient is a stale or lightly toasted baguette, birote or bolillo, which absorbs sweet piloncillo syrup melded with melted cheese, and holds up your chosen ingredients.", "author": {"@type": "Person", "name": "Jocelyn Ramirez"}, "image": "https://static01.nyt.com/images/2022/04/11/dining/jr-capirotada/merlin_204367458_2cf9bca3-0389-46a7-b846-52f05f2750ef-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 12 servings", "recipeCuisine": "mexican", "recipeCategory": "casseroles", "keywords": "apple, banana, bread pudding, stale bread, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 271}, "recipeIngredient": ["1 large Gala apple, quartered", "1 medium yellow onion, quartered and peeled", "1 (8-ounce/226-gram) piloncillo cone", "3 cinnamon sticks, preferably Ceylon", "4 whole cloves", "Pinch of salt", "3 medium bananas", "1 tablespoon vegan butter", "1 large baguette or 3 to 4 large bolillos or birotes (about 14 ounces total), cut into 1-inch cubes and dried until stale or lightly toasted (see Tip)", "1/2 cup/3 ounces raisins", "1/2 cup/2 ounces almond slices or peanuts, plus more for serving", "1 packed cup/4 ounces shredded Monterey Jack-style vegan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the apple, onion, piloncillo, cinnamon, cloves, salt and 1 whole peeled banana to a medium pot. Depending on what type of bread you are using, add 6 cups water (if using bolillos or birotes) or 7 cups (if using a dense baguette) to the pot. Cover and bring to a boil, then turn to medium-low to simmer for 15 minutes, until the piloncillo has dissolved and the liquid becomes fragrant. Turn off the heat and let steep for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the liquid through a strainer or colander, reserving the liquid and discarding the solids. Thinly slice the remaining 2 bananas and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a 9-by-13-inch baking dish with the butter, and line the bottom of the dish with a half of the bread cubes. (You’ll need enough to cover the bottom of the dish in one layer.) Layer on half the sliced bananas, raisins, almonds and cheese. Ladle half of the liquid over the first layer until completely coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another layer with the remaining bread, banana, raisins, almonds and cheese, then use the remaining liquid to coat the top layer. Gently press down on the bread to make sure it fully absorbs the liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the baking dish with aluminum foil and allow the capirotada to sit in the refrigerator for at least 1 hour so the bread fully absorbs most of the liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Add the capirotada, still covered with foil, and bake for 30 minutes. Remove the foil and bake for another 15 to 20 minutes, until the top layer lightly browns."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and let the capirotada rest for 20 minutes before serving so it fully sets. Serve with more almond slices."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023124-capirotada-mexican-bread-pudding"}