{"@context": "http://schema.org", "@type": "Recipe", "name": "Mole Verde", "description": "Among the seven most well-known mole varieties, tomatillo-based mole verde is one of the easiest to prepare because of its use of fresh chiles and herbs rather than dried chiles and spices. Romaine, cilantro and epazote get blended into the mole of seared chiles, garlic, onion and toasted nuts and seeds to make an earthy sauce. Fresh epazote and hoja santa add depth of flavor, with unique notes of pungency and anise, but they can be tough to find, so dried options can be used. This mole can be stored in the freezer for up to 3 months, ready for weeknights when all you want to do is warm up some tortillas and mushrooms for a perfect taco, or you could serve it over <a href=\"https://cooking.nytimes.com/recipes/1016674-mexican-rice\">Mexican rice</a> with roasted cauliflower.  ", "author": {"@type": "Person", "name": "Jocelyn Ramirez"}, "image": "https://static01.nyt.com/images/2022/06/09/dining/jr-mole-verde/merlin_207624078_28913220-b43f-41b5-9478-01ca0bfe0cc9-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 cups (8 to 10 servings)", "recipeCuisine": "mexican", "recipeCategory": "sauces and gravies", "keywords": "cilantro, epazote, healthy, hoja santa, pepitas, poblano pepper, tomatillo, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 376}, "recipeIngredient": ["8 medium tomatillos (about 1 pound), peeled and washed ", "1 large poblano ", "½ medium yellow onion, quartered", "2 to 3 serrano chiles ", "2 garlic cloves, peeled", "1 cup brown (unhulled) sesame seeds", "½ cup raw pepitas", "½ cup raw almonds", "2 dried bay leaves", "2 to 3 cloves", "6 large romaine lettuce leaves", "1 medium bunch cilantro, torn in half", "8 large fresh epazote leaves", "1 medium fresh or dried hoja santa leaf (optional)", "2 ½ cups vegetable stock, plus more if needed", "¼ cup neutral cooking oil (such as grapeseed)", "1 tablespoon kosher salt (such as Diamond Crystal)", "Seared mushrooms, tofu steaks, roasted cauliflower and/or <a href=\"https://cooking.nytimes.com/recipes/1016674-mexican-rice\"><span>Mexican rice</span></a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatillos, poblano, onion, serrano chiles and garlic to a large preheated comal or cast-iron skillet set over medium heat. Cook everything until lightly charred and soft on all sides, about 20 minutes. The poblano should take the longest to cook, while the garlic cloves will be done in about 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat a dry small to medium skillet over medium. Once warmed, toast the sesame seeds, stirring constantly, until golden and fragrant, 4 to 5 minutes. Add the toasted seeds to a large bowl and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the pepitas in the same skillet, stirring constantly, until golden, popped and fragrant, 4 to 5 minutes. Add them to the bowl with sesame seeds. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the almonds in the same skillet, stirring constantly, until lightly seared and fragrant, 4 to 5 minutes. Add them to the bowl with the seeds. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the bay leaves and cloves until the leaves lightly brown and the cloves become fragrant, 1 to 2 minutes. Add to the same bowl with the seeds. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stem and seed the charred chiles, and add them along with the remaining charred ingredients and the toasted ingredients to a blender. Add the romaine, cilantro, epazote, hoja santa (if using) and 2 ½ cups vegetable stock. Blend until almost smooth yet slightly lumpy and textured. Use more of the vegetable stock as needed to smooth out the mixture. If you don’t have a high-powered blender, you may need to blend in two batches, adding equal amounts of the wet and dry ingredients to each batch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, deep pot over medium-low. Once warmed, add the oil. Once the oil is hot and shimmering, carefully add the mole from the blender. There will be some splatter. Stir in the salt and simmer the mole for 15 to 20 minutes, until the flavors meld together, stirring occasionally to make sure the mole doesn't burn at the bottom of the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with seared mushrooms, tofu steaks or roasted cauliflower, paired with Mexican rice. Extra mole can be kept in the refrigerator for up to a week or frozen for up to 3 months in an airtight container."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023263-mole-verde"}