{"@context": "http://schema.org", "@type": "Recipe", "name": "Rqaq w Adas (Lentils With Pasta)", "description": "In Arabic, adas are lentils, and rqaq is a flatbread as thin and nearly as sheer as paper. The two come together in this stew, which was traditionally a way to use dough left over from baking bread, as the Palestinian artist and chef Mirna Bamieh explains. The lentils are simmered with cumin, bringing its stealthy warmth, along with bronzed onions, tamarind and sweet-sour pomegranate molasses. Meanwhile, scraps of dough are rolled out, then up into cylinders and slashed into long, skinny strands that look like tagliatelle. But you don’t have to wait for baking day: Instead, just knead together the quick dough below or swap in dried pasta. The noodles are dropped right in the pot, to cook among the lentils, leaching starch and making the stew even richer.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2022/03/27/dining/27EAT-rqaq-q-adas-lentils-with-pasta1/27EAT-rqaq-q-adas-lentils-with-pasta1-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, beans, soups and stews, main course", "keywords": "cilantro, flatbread, lentils, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 459}, "recipeIngredient": ["1 cup all-purpose flour, plus more for rolling  ", "1/3 cup warm water", "2 tablespoons olive oil, plus more for brushing", "Canola or other neutral oil, for frying (optional)", "3 to 4 flatbreads, such as pitas, cut into 3/4-inch squares (optional)", "1 medium onion, halved and thinly sliced (optional)", "1/2 to 1 cup pomegranate seeds", "1/2 cup fresh flat-leaf parsley leaves", "Olive oil, for drizzling", "2 cups brown lentils", "Warm water, as needed", "1/2 teaspoon ground cumin ", "1/2 cup olive oil", "2 medium onions, chopped", "2 tablespoons tamarind concentrate ", "1 1/2 tablespoons pomegranate molasses ", "1 tablespoon salt, plus more to taste ", "6 garlic cloves, minced", "2 cups fresh cilantro, chopped ", "3 tablespoons lemon juice, plus more to taste (from 2 to 3 lemons)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put lentils in a medium bowl and add warm water to cover by 2 inches. Set aside to soak for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re making the dough, prepare it while the lentils soak: Combine the flour, warm water, and the olive oil in a medium bowl. Mix the ingredients to combine, then knead in the bowl until smooth, about 3 minutes. Brush with olive oil, then let rest in the bowl, covered with a clean towel, for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re making the optional fried flatbread or onion garnishes, prepare them while the dough rests: Fill a large saucepan with canola oil to a depth of 1 to 2 inches. Bring to 350 degrees over high heat. (A piece of flatbread should sizzle vigorously.) Line 2 plates with paper towels. Working in 2 batches, fry the flatbread until golden brown, 1 to 2 minutes per batch. Transfer to one of the prepared plates to drain. Allow the oil to come back to 350 degrees. Working in 2 batches, fry the onion, separating the slices as you add them and stirring occasionally, until crisp, 3 to 4 minutes per batch. Transfer to the other plate to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the lentils: Fill a large pot with 9 cups of water. Drain and rinse the lentils, then add them to the water, along with the cumin. Bring to a boil over high heat, then drop the heat to medium-low and let simmer until the lentils are slightly softened but still firm, about 10 minutes. You can scoop one out to test the texture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put a large frying pan over medium heat. Add 1/4 cup olive oil, and when the oil is hot, add the onions. Cook, stirring occasionally, until the onions turn pliant and golden brown, 8 to 10 minutes. When the lentils are softened yet firm, add the onions and their oil, along with the tamarind concentrate, pomegranate molasses  and 1 tablespoon salt. (If you’re using dried store-bought tagliatelle — see Tip — add it now as well.) Stir and let simmer until the lentils are completely softened but not mushy, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the lentils cook, continue preparing the dough: Dust a clean surface with flour. Pat and stretch the dough into a thin sheet (1/16-inch thick, about 12 inches in diameter) and dust it with flour on both sides. Roll up the dough into a cylinder and cut crosswise into strands about ¼-inch thick. Unroll each piece, carefully separating the dough with your fingers as you go. You will end up with long strands like tagliatelle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the lentils are softened, add the strands of dough and cook until al dente, about 3 minutes. (If you used dried pasta, it should be done about this time.) While the dough cooks, take the pan used to fry the onions and heat the remaining 1/4 cup olive oil over medium. Add the garlic and cilantro, and fry just until fragrant, 30 to 60 seconds. The garlic shouldn’t change color, and the cilantro should stay green. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the dough is al dente, add the garlic mixture to the lentils, along with the lemon juice. Let simmer for another 2 to 3 minutes, then switch off the heat. Season to taste with more salt and lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the lentils and dough in a shallow dish. Top with the pomegranate seeds, parsley and fried bread and/or onions, if using, in separate rows. Drizzle with olive oil."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023049-rqaq-w-adas-lentils-with-pasta"}