{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti all'Assassina (Spicy Singed Tomato Pasta)", "description": "This spicy one-pot pasta dish is common on menus in Bari, Italy, but can easily be prepared at home. Like many classic dishes, there are a couple versions of its origin story. According to one, a distracted chef accidentally left his pasta cooking until the sauce burned, while another attributes the recipe title to the dish’s killer spiciness. The method involves treating spaghetti as you would risotto: Heat some garlic, red-pepper flakes and tomato paste in oil, then add the pasta and cook it gently, slowly adding tomato broth little by little. Once the pasta soaks up the flavorful liquid, it starts to char. Bari is famous for serving this dish extra “piccante,” but at home, you can make it as mild or spicy as you wish.", "author": {"@type": "Person", "name": "Anna Francese Gass"}, "image": "https://static01.nyt.com/images/2022/12/23/multimedia/afg-spaghetti-alla-assassina-1-19ef/afg-spaghetti-alla-assassina-1-19ef-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, lunch, quick, one pot, pastas, main course", "keywords": "red pepper flake, spaghetti, tomato sauce, weeknight, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 265}, "recipeIngredient": ["2 1/2 cups jarred or <a href=\"https://cooking.nytimes.com/recipes/1015178-marcella-hazans-tomato-sauce\">homemade tomato sauce</a>", "1/4 cup extra-virgin olive oil", "2 teaspoons red-pepper flakes, or more to taste", "1 garlic clove, thinly sliced", "2 teaspoons tomato paste", "1 pound (uncooked) spaghetti"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, heat the tomato sauce with 3 1/2 cups water over medium heat. Stir to combine and bring the tomato broth to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the olive oil in a 12- to 14-inch nonstick or cast-iron skillet over medium. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add red-pepper flakes and garlic to the skillet and cook, stirring, until garlic is just beginning to brown, about 2 minutes. Add the tomato paste, press it into the pan to spread it out, and cook until it begins to melt and toast.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a ladle or big spoon, add about 1/2 cup of the warm tomato broth to the pan and swirl to combine with the other ingredients.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully place the spaghetti into the pan on top of the sauce. (The spaghetti should fit lengthwise, but you can break the strands to fit in your pan, if need be.) Ladle 1 cup of the tomato broth on top of the pasta. Using a fork, move the spaghetti strands until evenly coated, pressing the spaghetti to distribute the broth until it evenly coats the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the pasta to cook for 3 minutes. Once the broth is absorbed, add 1 1/2 cups tomato broth and repeat the process. As the pasta softens, move the strands out so they begin to create an even layer in the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another 1 1/2 cups broth. Rearrange the pasta again so it’s in an even layer and covered in liquid, and cook another 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At the 9-minute mark, the pasta should begin to crackle and sizzle. Gently lift the pasta and peek underneath it.  There should be crispy, almost burnt pieces. If so, flip the pasta. If not, increase heat a bit until it crisps, then flip and continue."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the pasta is flipped, add the remaining broth. At this point, the pasta should be soft enough to easily move in the pan. Continue cooking until broth is absorbed and pasta is cooked through but still al dente. (If your pasta is still on the firmer side, you can add a splash of water, if needed, and cook until al dente.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide among bowls. Serve immediately. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023753-spaghetti-allassassina-spicy-singed-tomato-pasta"}