{"@context": "http://schema.org", "@type": "Recipe", "name": "Giant Almond Croissant", "description": "Crisp and buttery puff pastry is filled and smothered with fragrant frangipane, just like an <a href=\"https://cooking.nytimes.com/recipes/1022062-almond-croissants\">almond croissant</a>, but in an extra-crunchy, sharable format. This fun treat is easy to pull off for a festive breakfast or brunch. Bake the puff pastry and make the almond filling in advance, then assemble and bake once more just before serving. All-butter frozen puff pastry will have the best texture and flavor, but takes longer to crisp through, so be sure to bake it until deeply browned. ", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "image": "https://static01.nyt.com/images/2022/12/12/multimedia/SE-slab-almond-croissant-1-3f7c/SE-slab-almond-croissant-1-3f7c-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, easy, snack, pastries, dessert", "keywords": "almond, almond extract, almond flour, plan-ahead, puff pastry, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1629}, "recipeIngredient": ["1 sheet store-bought puff pastry (any size), thawed (see Tip)", "1/2 cup/100 grams granulated sugar", "4 tablespoons/56 grams unsalted butter, melted", "1 teaspoon kosher salt (such as Diamond Crystal) or 1/2 teaspoon coarse kosher salt (such as Morton’s)", "3/4 cup/108 grams blanched almond flour (see Tip)", "1 large egg", "1 tablespoon dark rum or 1 teaspoon pure vanilla extract", "1 1/2 teaspoons almond extract", "1/2 cup/45 grams sliced almonds", "Flaky salt, for topping ", "Confectioners’ sugar, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the puff pastry: Set a rack in the center of the oven and heat to 425 degrees. Unfold the sheet of puff pastry on a piece of parchment paper set in a rimmed baking sheet. Bake until puffed and brown, about 10 minutes. Reduce the heat to 350 degrees and continue baking until dry, crisp and deeply browned, rotating the baking sheet once during baking, 20 to 30 minutes. (Once cooled, pastry can be covered and stored at room temperature for up to 3 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a medium bowl, combine the granulated sugar, butter and kosher salt. Stir together with a wooden spoon or stiff silicone spatula until evenly combined and creamy. Add the almond flour, egg, rum and almond extract; whisk until evenly combined. (Filling can be stored in an airtight container and refrigerated for up to 3 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to assemble, heat the oven to 350 degrees. Using a long, sharp serrated knife, carefully slice the puff pastry horizontally, splitting it as you would a bagel. Flip the top of the pastry over, then spread about two-thirds of the almond filling evenly across the bottom of it, taking care to spread it all the way to the edges. Flip the top piece of pastry back onto the bottom piece, then evenly spread the remaining almond filling on top. Evenly distribute the sliced almonds on top, then lightly sprinkle with flaky salt. Bake until the nuts are toasted and the topping is brown, rotating the baking sheet once during baking, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool slightly, then use the parchment to slide the pastry onto a cutting board. Dust generously with confectioners’ sugar, then slice into portions with a sharp knife. Serve warm or at room temperature. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023722-giant-almond-croissant"}