{"@context": "http://schema.org", "@type": "Recipe", "name": "Spring Soba With Tinned Fish", "description": "While tinned mackerel and sardines may look like they’re hibernating, they’re actually hard at work, their confident flavors intensifying in that salt and olive oil. In this recipe, that seasoned oil is used to fry capers, char scallions and sauce whole-grain noodles. It’s balanced with spring’s sweetest vegetables: thinly sliced asparagus, crunchy snap peas or snow peas, slackened only slightly by salt and residual heat from the pan. Feel free to trade the scallions for garlic scapes or leeks, add fava beans or peas to the noodles in their final minutes of boiling or top the finished dish with pea greens or soft herbs.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/04/23/dining/18PASTAREX1-soba/merlin_205476504_a6e12a98-d855-4072-90b0-7559345cbd63-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weekday, noodles, pastas, main course", "keywords": "asparagus, mackerel, soba noodles, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 114}, "recipeIngredient": ["Kosher salt", "2 (3- to 5-ounce) cans mackerel or sardines packed in olive oil", "2 bunches scallions (about 12), ends trimmed, white and green parts thinly sliced", "1/4 cup drained capers, patted dry", "2 cups trimmed and thinly sliced asparagus, snap peas, snow peas or a mix (1 bunch asparagus or 6 ounces peas)", "8.8 to 12 ounces soba noodles or whole wheat pasta (depending on package size)", "1 lemon, zested and juiced, plus more juice as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Hold the mackerel with your fingers and pour the oil from both cans into a large skillet or Dutch oven. (Some bits of fish are OK. If you’re using fish packed in water, add 1/4 cup oil to the skillet.) Set over medium-high heat. When sizzling, add the scallions and capers, and cook, stirring once or twice, until charred in spots, 3 to 5 minutes. Remove from heat, add the sliced vegetables and 1/2 teaspoon salt, and stir to combine. Set aside until the noodles are ready."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water’s boiling, add the noodles and cook according to package directions. Drain, and if using soba, rinse under cold water until no longer sticky and shake the colander to remove as much water as possible. Add the noodles to the skillet along with the lemon zest and juice, and toss until combined. Add the mackerel and toss just until combined and broken into bite-size pieces. Season to taste with salt and lemon juice until flavors are bright. Eat warm or at room temperature. (Leftovers will keep for up to 2 days; bring to room temperature before eating and add salt, lemon juice and olive oil to taste.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023103-spring-soba-with-tinned-fish"}