{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Trail Mix", "description": "Anyone who has experienced the accidental melting of chocolate trail mix during hot weather has also likely enjoyed the blissful moment when it solidifies again, leaving it in a different form: one composed of sweet, salty and crunchy clusters, with an eggshell-thin chocolate coating. This simple and adaptable recipe — which includes a tip for achieving the melted version — is one that you can enjoy during long hikes, after hard workouts or simply to snack on with beer or cocktails. While trail mix is often raw, this version lightly toasts the nuts and seeds, which imparts extra flavor. Finishing with flaky sea salt is a nice touch, too.", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "image": "https://static01.nyt.com/images/2022/09/22/dining/yf-trail-mix/merlin_213556047_bbe430e9-d84d-4a51-a01e-0c6c3dad9ce9-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "About 4 cups", "recipeCuisine": "", "recipeCategory": "easy, snack", "keywords": "almond, cashew, dark chocolate, dried cherry, dried fruit, make-ahead, pecan, pistachio, pumpkin seed, semisweet chocolate chip, sunflower seeds, halloween, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 18}, "recipeIngredient": ["1 cup raw, unsalted almonds or pistachios", "1 cup raw, unsalted cashews or pecans", "1/2 cup raw, unsalted pumpkin seeds or sunflower seeds", "1/2 cup dried cherries, raisins, blueberries, goldenberries or chopped dried apricots, mango, pineapple or prunes", "Salt", "1/2 cup dark or semisweet chocolate pieces or chips, peanut butter cups or chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 275 degrees. Scatter the nuts and seeds on a large sheet pan in an even layer. Bake until they are lightly toasted and maybe browned in spots, about 12 minutes, turning the nuts and seeds over as best you can and rotating the sheet pan halfway through cooking. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven, add the cherries and 1/4 teaspoon salt and stir with a wooden spoon. Spread the mixture out again to let cool until you can easily handle the sheet pan with bare hands, 15 to 20 minutes. (If you add the chocolate to the sheet pan directly at this stage, it might melt a little. But if you prefer the chocolate to melt into your clusters, add half the chocolate directly to the sheet pan along with the dried fruit. After cooling, add remaining chocolate then transfer to a bowl, using a flat spatula to scrape any chocolate from the pan, and let cool until solid again, 30 to 90 minutes.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a bowl, then stir in the chocolate (if you haven’t already added it). Enjoy immediately, or store for up to one month in an airtight container at a cool temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023490-chocolate-trail-mix"}