{"@context": "http://schema.org", "@type": "Recipe", "name": "Salisbury Steak", "description": "In the United States today, most people might know Salisbury steak as a TV dinner. When made from scratch with just the right mix of Worcestershire sauce, ketchup and brown sugar, the tender beef patties smothered in gravy are a hearty, soul-warming staple. The original dish was named after Dr. James Henry Salisbury, who famously recommended eating it for health reasons. This version is all about how delicious the meal is and leans into its savory flavors, especially the umami-rich onion and mushrooms in the sauce. Serve these mini Salisbury steaks with green vegetables and steamed white rice, <a href=\"https://cooking.nytimes.com/recipes/1022733-creamy-baked-macaroni-and-cheese\">mac and cheese</a>, <a href=\"https://cooking.nytimes.com/recipes/1021439-gamja-salad-with-cucumber-carrot-and-red-onion\">gamja salad</a> or <a href=\"https://cooking.nytimes.com/recipes/1022712-fluffy-mashed-potatoes\">mashed potatoes</a>.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/10/23/magazine/23mag-eat-site/23mag-eat-site-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, weeknight, meat, main course", "keywords": "cremini, ground beef, ketchup, skillet, worcestershire sauce", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 844}, "recipeIngredient": ["1 medium yellow onion", "3 tablespoons Worcestershire sauce", "3 tablespoons ketchup", "1 teaspoon packed dark brown sugar", "1 large egg", "Salt and black pepper", "1 pound ground beef", "1/2 cup panko bread crumbs", "Olive oil, for searing", "8 ounces cremini mushrooms", "Salt and black pepper", "1 tablespoon all-purpose flour", "1 cup beef stock", "1/2 cup whole milk", "Worcestershire sauce, ketchup and brown sugar, for seasoning (optional)", "Finely chopped fresh chives, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the steaks: Grate about a quarter of the onion into a medium bowl (you should have about 1/4 cup of pulp). Set aside the remaining onion for the gravy. Add the Worcestershire sauce, ketchup, brown sugar and egg; season generously with salt and pepper and whisk to combine. Add the ground beef and panko, and with a spoon or fork, gently stir the mixture to combine without overmixing. Form into 8 small, oval-shaped patties about 1 inch thick, place on a plate and into the freezer for 5 to 10 minutes to firm up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, finely dice the remaining onion. Using a wet towel, wipe the mushrooms clean and thinly slice them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the steaks: Heat a large skillet over medium and add enough olive oil to lightly coat the bottom. Remove the patties from the freezer, add them to the hot oil and cook until browned, 2 to 3 minutes per side. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the gravy: To the same skillet, add the onion and mushrooms, season with salt and raise the heat to medium-high. Cook, stirring occasionally until deeply browned but not burned, 8 to 10 minutes. The vegetables will release their water before starting to brown, so be patient. Add more oil if the pan looks dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle over the flour and cook, stirring, until you can no longer see streaks of white and the raw flour taste cooks out, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the beef stock and milk. Season generously with salt and pepper and bring to a simmer over medium-high. Taste the sauce and season to taste with 1/2 to 1 teaspoon Worcestershire if you’d like more savoriness, 1 tablespoon ketchup for tanginess and a pinch of brown sugar for a little sweetness. Add the seared steaks to the gravy and reduce the heat to continue simmering, basting the steaks once or twice, until the gravy is thicker and reduced to your liking, 4 to 5 minutes. Serve immediately and sprinkle with chives, if you’d like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023572-salisbury-steak"}