{"@context": "http://schema.org", "@type": "Recipe", "name": "Bánh Cuốn", "description": "Bánh cuốn, or Vietnamese steamed rice rolls, pack platefuls of flavor into every bite. The dish originated in northern Vietnam, utilizing a batter that forms a delicate rice sheet, which gets rolled around a mixture of pork and wood ear mushrooms. Bánh cuốn’s accompaniments generally include bean sprouts, fried shallots, herbs and chả lụa (Vietnamese pork sausage), along with a dipping sauce of <a href=\"https://cooking.nytimes.com/recipes/1022368-nuoc-cham\">nước chấm</a>. Though the dish has a number of ingredients, its preparation consists of simple steps; give yourself ample time to prepare and the cooking process will be seamless. This meal is best eaten immediately, but it can hold in the refrigerator for a day or two.", "author": {"@type": "Person", "name": "Bryan Washington"}, "image": "https://static01.nyt.com/images/2022/08/30/dining/28EAT-bahn-cuon/merlin_212146863_008bc59f-9a99-454c-b1e0-6aa2b12973d4-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "vietnamese", "recipeCategory": "breakfast, dinner, lunch, snack, meat, appetizer, main course", "keywords": "dried mushrooms, fish sauce, ground pork, potato starch, rice flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 179}, "recipeIngredient": ["2 cups white rice flour", "1 cup potato starch", "1 cup tapioca starch", "1 teaspoon kosher salt (such as Diamond Crystal)", "3 tablespoons vegetable oil", "1 tablespoon fish sauce", "1 tablespoon oyster sauce", "1 teaspoon chicken bouillon powder", "1 teaspoon granulated sugar", "1 teaspoon ground black pepper", "1/2 teaspoon kosher salt (such as Diamond Crystal)", "1/2 pound ground or minced pork", "2 tablespoons vegetable oil", "1 onion, diced", "3 garlic cloves, minced", "3/4 ounce dried wood ear mushrooms (about 22), rehydrated and minced (see Tip)", "1/4 medium jicama (about 1 pound), peeled with a knife then chopped", "Bean sprouts, fried shallots and fresh herbs (such as cilantro), for serving", "Vietnamese pork sausage (chả lụa), sliced (optional)", "<a href=\"https://cooking.nytimes.com/recipes/1022368-nuoc-cham\">Nước chấm</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the batter: In a large bowl, stir together the rice flour, potato starch, tapioca starch, salt, oil and 4 cups water until there are very few lumps. Allow mixture to set at room temperature for at least 1 hour and up to 8 hours (or overnight, covered)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the batter is setting, make the filling: Mix the fish sauce, oyster sauce, bouillon powder, sugar, black pepper and salt into the pork. Cover and refrigerate mixture for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Over medium heat, add the vegetable oil to a medium pan. Add the onion and cook, stirring occasionally, until softened, about 3 minutes, then add the garlic and cook until fragrant, about 1 minute more. Add the minced wood ear mushrooms and cook until softened, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the jicama to the mixture and cook for 5 minutes, stirring occasionally. Then add the marinated pork and cook, stirring and breaking it up into smaller pieces, until it’s cooked through and beginning to brown, 12 to 15 minutes. Remove the pan from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a medium (10-inch) nonstick pan with a lid over medium. Stir the batter to blend it evenly (the flours will have sunk to the bottom), then add a thin layer to the pan, about a scant ¼ cup batter, depending on the size of your pan. Allow the batter to spread across the pan and form a round, tilting the pan as necessary, then cover to steam for 30 to 45 seconds until the batter is cooked through and the edges begin to separate from the surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully flip the pan over to release the cooked batter onto a cutting board. Add 2 tablespoons of filling to the middle in a horizontal line and using a spatula or your hands, roll the cooked batter to encase the filling. Transfer to a platter or to serving plates. Repeat with the remaining batter and filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately with bean sprouts, fried shallots, herbs and sausage, if you’d like. Eat with nước chấm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023435-banh-cu-n"}