{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom-Beef Burgers", "description": "These burgers use half the meat of all-beef burgers but have double the juiciness, thanks to finely chopped cremini mushrooms. The raw mushrooms lend earthy, meaty flavor and texture, both of which become more accentuated as they cook, caramelize and crisp along the edges while charring on the grill. Form the patties when ready to cook, since the mushrooms start to release water once mixed with the beef, and don't be afraid to mix the chopped mushrooms with the beef until well incorporated. (Thanks to the moisture the mushrooms provide, it is impossible to overwork the patties.) Their flavors shine on the grill, but the burgers can also be cooked in a lightly greased nonstick skillet over medium-high heat until golden brown, 3 to 4 minutes per side.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2022/06/27/dining/kc-mushroom-beef-burgers/merlin_209008674_b3fa58fa-9bb1-4cfe-a08a-40b4dda0de78-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, burgers, meat, sandwiches, main course", "keywords": "ground beef, mushroom", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 222}, "recipeIngredient": ["Neutral oil, for greasing the grates", "1 pound cremini or white button mushrooms, quartered", "1 pound ground beef (preferably 80/20)", "Kosher salt (such as Diamond Crystal) and pepper", "8 slices Cheddar or American cheese", "8 hamburger buns", "Toppings (such as butter lettuce, sliced onion, tomato and dill pickles) and condiments (mayonnaise, ketchup or mustard), for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a grill to medium-high and oil the grates. (The burgers can also be cooked in a lightly greased nonstick skillet over medium-high heat until golden brown, 3 to 4 minutes per side.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, working in 2 batches, pulse the mushrooms, scraping down the sides and bottom, until finely chopped but not puréed. (The mushrooms should be chopped so finely they almost resemble ground meat. If cut into larger pieces, they may cause the patties to fall apart on the grill.) Transfer to a large bowl and add the beef. Mix until well blended, then form into 8 equal patties, each about 4 inches wide. Pack the patties tightly and pinch any split edges together to seal. (Since the meat mixture is half mushroom, it cannot be overworked, so you don't need to worry about density.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the patties with salt and pepper, and grill, undisturbed, until lightly charred underneath, 3 to 5 minutes. (Resist the urge to prod or move the burgers during these first few minutes, as they need to cook, undisturbed, to form a crust underneath. Once they have caramelized, they'll be easy to flip, but if you attempt to do so before the patties release easily, they can fall apart.) Gently flip burgers and grill until golden and cooked to medium, 3 to 4 minutes longer, topping each with a slice of cheese during the last minute of cooking. Transfer burgers to a large platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Build burgers with buns, preferred toppings and condiments."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023280-mushroom-beef-burgers"}