{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Rice Salad With Halloumi and Ginger-Lime Vinaigrette", "description": "If you delight in leftover rice — and the <a href=\"https://www.nytimes.com/2020/03/27/dining/rice-recipes.html\">infinite ways to put it to good use</a> — here’s another technique to add to your repertoire: Crisp cooked rice in just a couple tablespoons of hot oil until it’s scorched in spots, and simultaneously crunchy and chewy. The turmeric-stained rice clusters are used as salty croutons in this salad of ginger-lime marinated onions, seared halloumi and a pile of baby greens, a delicate backdrop that highlights the rice’s crunch and the halloumi’s squeak. A riot of texture, this salad crackles and pops.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2022/08/22/dining/aw-Crispy-Rice-1/merlin_210764676_14288e81-5345-4432-b9e7-29c7b3bcf277-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, for two, weeknight, main course", "keywords": "ground turmeric, halloumi, mixed greens, rice, salad, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 351}, "recipeIngredient": ["1/2 medium red onion (about 2 1/2 ounces), very thinly sliced from tip to tip", "1/4 packed teaspoon finely grated lime zest", "3 tablespoons lime juice (from 2 limes)", "1 teaspoon finely grated fresh ginger", "1/4 teaspoon finely grated fresh garlic (one small clove)", "1/2 cup extra-virgin olive oil", "Salt and black pepper", "1/2 teaspoon ground turmeric", "2 1/2 packed cups (about 10 ounces) day-old cooked rice, preferably sushi rice", "8 ounces halloumi, chilled (Vegan? See Tip)", "1 (5-ounce) package mixed baby greens"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the ginger-lime vinaigrette: In a large bowl, stir together the sliced red onion, lime zest, lime juice, ginger, garlic and 1/4 cup olive oil. Season to taste with salt and pepper and set aside, letting the red onion marinate and tenderize."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the rice: Heat 2 tablespoons olive oil over medium-high in a large nonstick skillet. Stir in the turmeric. Add the rice and cook, stirring quickly to coat the rice evenly, about 1 minute. (No need to break it up entirely; clumps are encouraged for texture.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season generously with salt and pepper, and let rice sit, undisturbed, until crispy underneath and toasted in spots, 2 to 3 minutes. Gently turn the rice with a spatula, trying to preserve any clumps, and cook another 3 minutes, until crispy on the second side. (The rice should be almost equal parts crispy and chewy, and evenly stained by the turmeric.) Transfer to a large, paper towel-lined rimmed baking sheet, set in an even layer and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the halloumi: Chop the halloumi into 3/4-inch cubes, then pat them dry using a kitchen towel or paper towels. Wipe out the skillet, then heat the remaining 2 tablespoons oil over medium-high. Add the cubed halloumi in an even layer and cook, stirring frequently, until golden at the edges, 2 to 3 minutes. (Sturdy but delicate, halloumi needs to cook quickly at a high temperature so it sears without fully melting down and losing its shape. Stir attentively!) Transfer to a paper towel-lined plate and season with pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to eat, add the greens to the vinaigrette, toss to coat and season with salt and pepper. Transfer to a wide, shallow bowl or dish. (You want a big surface area to accommodate the toppings.) Scatter with the crispy rice clusters and hot halloumi. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023415-crispy-rice-salad-with-halloumi-and-ginger-lime-vinaigrette"}