{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramel Apple Pie", "description": "Here, a carnival caramel apple is stacked onto a buttery crust: The snap of fresh apple slices gives way to soft salted caramel and a melt-in-your-mouth cookie base. It’s put together as a pie with layers like a bar cookie for a look that’s impressive but simple to pull off. The dough doesn’t require rolling. Instead, you press crumbs into a pie plate and end up with a cross between sturdy shortbread and sandy French sablés. A candy thermometer takes the guesswork out of caramel, but you don’t need one to make the stretchy filling. For a tangy contrast to the filling’s sweetness, use tart green apples, but feel free to swap them for other varieties you like.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/11/13/dining/13PIESREX-caramel-apple/merlin_215056365_e6a05d9d-1de1-4968-9d35-318cd8f465f7-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "One 9-inch pie", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "apple, corn syrup, food processor, heavy cream, make-ahead, pie, fall, winter, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 285}, "recipeIngredient": ["1/3 cup/73 grams granulated sugar", "1 teaspoon fine sea or table salt", "1 teaspoon pure vanilla extract", "1 1/3 cups/193 grams all-purpose flour", "11 tablespoons/154 grams cold unsalted butter, cut into small cubes", "1 1/2 cups/324 grams granulated sugar", "2 tablespoons light corn syrup", "5 tablespoons/70 grams unsalted butter", "1 cup/230 grams heavy cream", "1/2 teaspoon fine sea or table salt", "1 to 2 Granny Smith or other tart green apples", "1/4 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Pulse the sugar, salt and vanilla in a food processor until the sugar is evenly moistened. Add the flour and pulse until well blended. Add the butter and pulse until the mixture resembles coarse crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour all the crumbs into a standard 9-inch pie dish. Gently sweep them into an even layer, then press the crumbs against the bottom and sides of the pan, forming a 1/4-inch-thick edge. Refrigerate for 30 minutes. (The dough can be covered and refrigerated for up to 3 days before baking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange a rack in the center of the oven and heat oven to 350 degrees. Use a fork to poke holes in the bottom of the chilled crust, patting back any crumbs that come loose. Bake until the center is pale golden brown and the edges are golden brown, 20 to 23 minutes. The center should feel set but a bit soft. Don’t overbake or the crust will be tough after it cools. Cool completely on a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the caramel: Pour 1/4 cup cold water into a large saucepan. Pour the sugar in the center of the pan (you don’t want any to touch the sides), then pour the corn syrup on top. Bring to a boil over medium heat without touching the mixture. Let it bubble until it turns golden. Swirl the pan so the color evens out and continue cooking until it’s dark amber. Turn off the heat. Immediately and carefully add the butter. The mixture will bubble up. Start whisking and carefully add the cream in a steady stream while whisking, then whisk in the salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clip a candy thermometer to the side of the pan. Turn the heat to medium and cook, stirring occasionally with a heatproof spatula, until the mixture is at the soft ball stage (240 degrees), about 8 minutes. If you don’t have a candy thermometer, fill a mug with ice water. After the mixture has boiled for 7 minutes, scoop a small spoonful and immerse it in the ice water. Let it sit for a few seconds to cool, fish it out and pop it in your mouth. It should form a ball and be soft and chewy. If it isn’t, repeat the test in a minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat and stir just until the bubbles subside. In that minute or two, the caramel will continue to cook; you want it at 245 degrees. At that point, pour it into the cooled pie shell. Tilt the pan if needed to spread it evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let stand at room temperature until firm and cool, or refrigerate to chill and set more quickly. The set caramel tart can be covered and refrigerated for up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Up to a few hours before serving, cut an apple into quarters or sixths, then slice out the stem and core. Cut the pieces crosswise into 1/8-inch-thick slices, using a mandoline if you have one, a sharp knife if you don’t. Squeeze a little lemon juice over all the slices, tossing to evenly and barely coat. Shingle the slices in rows on top of the chilled caramel. Slice the other apple if needed to cover the top."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023578-caramel-apple-pie"}