{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetable Maafé", "description": "A great maafé effortlessly balances sweet, savory, earthy and spicy. Maafé is often called West African peanut stew, but that’s an oversimplification. Across the region, there are many versions that feature peanuts as a base, and all are greatly nuanced: For example, there’s akitiwa in Togo, nkatenkwan in Ghana and miyan taushe across northern Nigeria. This highly adaptable stew can be made with any assortment of meat, poultry, seafood and seasonal vegetables you have on hand (see Tip), but this one goes all in on produce. Keeping the Scotch bonnet whole in the sauce controls the heat: cook to soften, then break it open to dissolve seeds in the sauce for more heat, or cook and remove the softened whole chile from the sauce for less heat. Serve it all over steamed rice, millet or fonio, with some lime slices for squeezing. Maafé can be made ahead, refrigerated and reheated for a warm, comforting meal whenever you need — its rich flavor only improves with time.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2022/11/02/dining/26komolaferex-maafe/merlin_215042799_bc2aa535-f2b8-4897-aa66-e8e48813a953-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "main course", "keywords": "butternut squash, carrot, make-ahead, peanut butter, sturdy greens, west african, fall, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 803}, "recipeIngredient": ["1 tablespoon vegetable oil", "1 small red onion, chopped", "4 garlic cloves, chopped", "1 (1-inch) piece ginger, scrubbed and grated", "1 tablespoon tomato paste", "1 (14 1/2-ounce) can whole peeled tomatoes", "1 red Scotch bonnet", "Salt", "2 medium green plantains, peeled and cut into 1-inch pieces (see Tip)", "4 cups vegetable stock or water", "2 medium carrots, scrubbed and cut into 1-inch pieces (see Tip)", "1/2 medium butternut squash (about 1 pound), peeled and cut into 1-inch pieces (see Tip)", "1/2 cup creamy, unsalted peanut butter", "2 tablespoon tamarind purée (optional)", "2 teaspoons ground dawadawa (see Tip) or 1 tablespoon fish sauce (optional)", "4 cups hearty greens, such as mature spinach, turnip greens, collards or kale, chopped with stems", "Steamed rice, fonio or millet, for serving", "1 lime, sliced, for squeezing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan, heat the oil over medium, and add the onion and garlic. Sauté until soft and just beginning to brown at the edges, about 6 minutes. Add in the grated ginger and sauté until fragrant, 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomato paste, stirring to evenly coat the vegetables. Cook until the paste turns brick red, 1 minute. Add the whole tomatoes and their liquid, breaking up the tomatoes in the pot. Stir and scrape the bottom of the pan to loosen any bits that have stuck to the surface. Using a sharp knife, poke slits in the Scotch bonnet and drop it into the pot. Season the sauce with salt, and bring the sauce to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the plantains and cook until they just begin to soften, 10 minutes. Add the butternut squash, carrots and vegetable stock. Increase the heat to high and bring the stew up to a boil. Once the liquid is bubbling, reduce heat to medium. Cook until the vegetables are just fork tender, about 15 minutes. In a small bowl, combine the peanut butter with 1/4 cup hot liquid from the pot. Stir into a loose sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the peanut butter mixture into the pot. Add the tamarind purée, ground dawadawa or fish sauce, if using. Stir in the greens. Drop the heat to low and let the sauce simmer, stirring frequently, for another 10 minutes or until the sauce is thickened to a creamy but loose consistency. Remove from heat, taste and season with more salt if necessary. Remove the Scotch bonnet chile and discard. Serve maafé over steamed rice, fonio or millet, with a couple of lime slices for squeezing."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023570-vegetable-maafe"}