{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Thighs With Sour Cherries and Cucumber Yogurt", "description": "If you’re lucky enough to have more sour cherries than you need to make a pie, save them for this sweet and tangy chicken dish. The cherries are briefly simmered with sugar, vinegar and a bay leaf, then added to a sheet pan to roast alongside boneless, skinless chicken thighs and wedges of red onion. As they cook, the cherries absorb the chicken juices, becoming very savory and concentrated. Then, the whole thing is topped with dollops of cooling cucumber yogurt. Serve it with bread or rice to catch the juices at the bottom of the pan. If you can’t get sour cherries, you can substitute seedless red or green grapes.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/07/08/dining/08apperex-chicken/merlin_209335341_90e39ff5-c889-4f67-b328-677fa649f197-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "poultry, main course", "keywords": "chicken thigh, cucumber, sour cherry, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 571}, "recipeIngredient": ["2 to 2 1/4 pounds boneless, skinless chicken thighs", "1 large red onion, peeled and cut into 1/2-inch wedges", "2 1/2 teaspoons kosher salt (such as Diamond Crystal), plus more as needed", "1 teaspoon freshly cracked black pepper, plus more as needed", "2 tablespoons minced tarragon, plus more for serving", "2 1/2 tablespoons extra-virgin olive oil, plus more for serving", "1/3 cup unseasoned rice vinegar", "3 to 4 tablespoons granulated sugar", "1 bay leaf", "2 cups thinly sliced cucumbers, preferably Persian cucumbers", "2 cups sour cherries, stemmed and pitted", "1 cup plain whole-milk yogurt", "Flaky sea salt, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Combine chicken and onion on a rimmed sheet pan. Toss with 1 1/2 teaspoons salt and 1 teaspoon black pepper. Add tarragon and 1 1/2 tablespoons oil, and toss to combine. Let stand at room temperature while preparing other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine vinegar, 2 tablespoons sugar, bay leaf and remaining 1 teaspoon salt over medium-high heat. Bring to a simmer, stirring frequently to dissolve sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place sliced cucumbers in medium bowl. Add 2 tablespoons of the vinegar solution to cucumbers and toss. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to medium-low heat and add another tablespoon sugar. Once sugar dissolves, stir in cherries. Cook until cherries are slightly broken down, 3 to 4 minutes. Taste and add more sugar if the cherries still seem very tart. (You’re not looking for them to be sweet, just balanced.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon cherries and their juices around chicken and onions. (It’s OK if some cherries are on top of chicken and onions.) Roast until chicken is cooked through and cherries and onions are lightly browned in spots, 30 to 35 minutes. Give the dish a big stir and spoon the savory pan juices all over the top of the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chicken is roasting, stir yogurt and remaining 1 tablespoon oil into the bowl with the pickled cucumbers. Season with a large pinch of salt and black pepper. Refrigerate until ready to serve. Just before serving, stir well, taste and add more salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top chicken and cherries with a large dollop of cucumber yogurt, more tarragon and a drizzle of olive oil, then sprinkle with flaky sea salt or more kosher salt, if you like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023314-chicken-thighs-with-sour-cherries-and-cucumber-yogurt"}