{"@context": "http://schema.org", "@type": "Recipe", "name": "Guacamole", "description": "Providing a framework to build on as you wish, this pared-down guacamole lets the avocado shine. If you want more lime, add more lime. Seed the jalapeño, if you prefer its fruity heat without the spice, or leave the seeds in, if you enjoy living life on the edge. Letting the diced onion sit in lime juice for a couple of minutes will help temper its pungent bite before imbuing the dish with its oniony savoriness. Chopped cilantro and diced tomatoes are welcome additions to this Mexican staple, if you’d like. It’s your guacamole. Serve with tortilla chips, or as a condiment alongside your meal, and double or triple this recipe for a party.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/06/22/dining/21beginner-rex1/merlin_208160622_52e89e7b-f828-452a-8da3-8edf706952ed-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "2 cups (4 appetizer servings)", "recipeCuisine": "mexican", "recipeCategory": "easy, quick, snack, condiments, dips and spreads, appetizer", "keywords": "avocado, lime, onion, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 150}, "recipeIngredient": ["1/2 cup finely chopped white onion (from 1 small onion)", "2 tablespoons fresh lime juice (from about 1 lime)", "Salt and black pepper", "1 jalapeño", "2 ripe avocados"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine the onion and lime juice, and season with salt and pepper. Let that sit as you chop the jalapeño."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the hard stem end off of the jalapeño and discard, then slice the chile in half lengthwise. If you don’t want the spice, use your knife or a spoon to remove the inner seeds and white membrane (this is where most of the chile’s heat resides). If you enjoy the heat, then leave all of that in. Chop the jalapeño as finely as you can and add to the bowl with the onion and lime juice. Be sure to wash your hands very well with soap after handling spicy chiles like jalapeños, and whatever you do, do not touch your eyes after handling them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the avocados in half lengthwise and pull the halves apart. You can use your knife to pit the avocados, but a safer way is to hold the avocado half in one hand so that your thumb is touching the skin side where the pit is and your index and middle fingers are touching the flesh side around the pit. Gently press your fingers into each other to pop the pit out; with a ripe avocado, it should come out very easily. Use your hands to squeeze the avocado flesh out into the bowl with the other ingredients, or scoop it out with a spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a fork, gently mash the avocados against the side of the bowl until they are mashed to your desired consistency, then stir them into the other ingredients until well combined. Taste and add more salt if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Contrary to popular belief, adding avocado pits to guacamole does nothing to prevent oxidation, but if you press a good layer of plastic wrap or parchment paper directly over the guacamole and store it in the refrigerator, it will keep well for up to 2 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023223-guacamole"}