{"@context": "http://schema.org", "@type": "Recipe", "name": "Za’atar Parmesan Pinwheels", "description": "These crunchy, savory snacks have the irresistible can’t-stop-eating nature of cheese straws, but with the added allure of a sprinkle of herby, sesame-flecked za’atar, a Middle Eastern seasoning mix available in large supermarkets and spice shops. Rolled into logs and sliced into pinwheels before baking, they puff into domes in the oven’s heat, turning golden, crisp and wonderfully flaky. If you can find all-butter puff pastry, it really makes a difference here, adding a rich, deep flavor and an especially bronzed color.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/12/21/multimedia/14apperex3-pinwheels-1-e81b/14apperex3-pinwheels-1-e81b-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "About 3 1/2 dozen", "recipeCuisine": "", "recipeCategory": "finger foods, appetizer", "keywords": "christmas, new year’s day, parmesan, party, puff pastry, za'atar, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 171}, "recipeIngredient": ["2/3 cup grated Parmesan", "1 1/2 tablespoons za’atar, plus more for garnish", "1/8 teaspoon fine salt", "Pinch of ground cayenne", "1 (14- to 16-ounce) package puff pastry, thawed if frozen but still cold", "All-purpose flour, for rolling (optional)", "1 large egg, lightly beaten", "Flaky sea salt, for finishing", "Sesame seeds, for finishing (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine Parmesan, za’atar, salt and cayenne."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a piece of parchment paper, roll out the cold puff pastry into a 12-by-16-inch rectangle, about 1/8 inch thick. (If the rolling pin sticks, you can flour it very lightly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position puff pastry so the longer side is facing you. Lightly brush the egg wash across the pastry and sprinkle the za’atar-Parmesan mixture all over the egg-washed surface in an even layer, leaving a 1/4-inch border on the longer side farthest from you. Using a rolling pin, gently roll over the top of the za’atar-Parmesan mixture. Save the remaining egg wash to use on the puff pastry before baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife or bench scraper, cut the puff pastry in half crosswise. Starting with the half closest to you, roll the dough into a tight log; finish with the 1/4-inch border seam underneath, pinching it to seal. Repeat with remaining dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with parchment paper (you can reuse the one you rolled the dough on)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer logs onto the prepared baking sheet. Cover with another piece of parchment and refrigerate for 30 minutes or up to 6 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Uncover dough logs, and line another baking sheet with parchment. (You can use the one covering the logs.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the logs to a cutting board. Using a sharp knife, slice each log into 1/4-inch-thick rounds. Using an offset spatula or metal spatula, place the pinwheels on parchment-lined baking sheets, spacing them about 1 inch apart. (You might need a third baking sheet; if they don’t all fit in your oven at the same time, refrigerate one baking sheet until ready to bake.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using reserved egg wash, lightly brush egg onto pinwheels and sprinkle with more za’atar, and flaky salt and sesame seeds, if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake pinwheels until golden brown and puffed (some will puff into domes), 20 to 30 minutes, rotating sheet pans halfway through. Cool on baking sheets for 5 minutes, then transfer to a wire rack to cool completely. These are best served warm, but will keep in an airtight container for up to 3 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023748-zaatar-parmesan-pinwheels"}