{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Crème Caramel", "description": "This silky, gently set custard with the right amount of warmth from toasted spices and sharpness from caramelized sugar is a perfect way to welcome the cooling weather of fall. In this recipe, a fragrant combination of cinnamon, cloves, cardamom, ginger and nutmeg known as sweet hawaij adds an autumnal aroma. Sweet hawaij, which is found in cooking across North Africa and the Middle East, is commonly added to hot coffee, and is also used in desserts and sweets. Trusting your senses will give you the best results here: Notice the aroma of the spices as they gently toast; watch the sugar deepen to a golden amber as it caramelizes; and see how the custard slowly jiggles in its water bath once it is set. Pay attention! The reward is a treat to end a meal or a perfect bite to enjoy with a cup of black coffee.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2022/09/28/dining/22komolaferex-creme/merlin_212662662_12893fee-d24c-4a34-b742-fefad556a1bc-articleLarge.jpg", "totalTime": "PT10H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "custards and puddings, dessert", "keywords": "cardamom, egg yolks, ground cinnamon, ground ginger, heavy cream, milk, plan-ahead, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 95}, "recipeIngredient": ["2 teaspoons ground sweet hawaij (see Tip)", "1 1/2 cups/350 milliliters heavy cream", "1 1/2 cups/300 grams granulated sugar", "10 egg yolks, room temperature", "1/2 teaspoon kosher salt (such as Diamond Crystal)", "2 1/2 cups/625 milliliters whole milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a small saucepan over medium heat. Add the sweet hawaij and toast, stirring often, until the spices become fragrant and darken slightly in color, about 30 seconds. Keep the heat on medium and pour in the heavy cream. Heat the cream, stirring occasionally, until steam begins to rise from the surface, 4 to 6 minutes. Remove from heat and allow the spices to steep, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set out a 9-inch round cake pan. Heat a separate small saucepan over medium until a drop of water sizzles on the surface. Reduce heat to medium-low. Make a dry caramel by adding 3/4 cup/150 grams sugar to the pan in an even layer. The sugar will gradually begin melting into a syrup. If it browns immediately, your pan is too hot and the heat should be turned down to low. Allow the sugar to melt, stirring in any dry spots with a heat-safe spatula, about 2 minutes. As the crystals melt, the syrup will change color from light to golden brown, about another 4 minutes. Once the sugar has melted, continue to stir and cook the syrup until it’s a light amber color and smoke begins to rise from the surface of the caramel, 2 minutes more. Immediately pour the caramel into the bottom of the cake pan and swirl the pan to evenly coat it with caramel. Allow the caramel to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Prepare a water bath in a large roasting pan by filling it a third of the way up with room-temperature water. Place the roasting pan in the middle rack of the oven as it heats."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, use a whisk to gently combine the egg yolks and remaining 3/4 cup/150 grams granulated sugar. Add the salt and pour in the steeped heavy cream while gently stirring. (You want to incorporate as little air as possible, so be careful not to whisk too hard.) Add the milk, then pass the mixture through a fine-mesh sieve. You can do this directly into the pan with the caramel, keeping the sieve just above the pan to minimize bubbles on the surface of the custard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pan to the water bath and cover the entire pan and water bath with aluminum foil. Bake for 50 minutes. The edges of the custard will just be starting to set and the center will still jiggle loosely at this point when the pan is moved back and forth. Remove the foil and bake until the custard is set and the center jiggles only slightly when the pan is moved back and forth, 20 to 25 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the water bath and let cool to room temperature. Move to the refrigerator and cool completely until the custard is set and firm, 8 to 12 hours. To serve, run a knife along the edges of the custard to loosen. To loosen the bottom, place the pan on a warm kitchen towel for about 30 seconds. Put a serving platter (large enough to hold the custard and caramel sauce) on top of the pan and invert: Be confident and do this action in one fluid motion without hesitating. The custard should slip easily onto the serving platter with the caramel sauce pooling nicely around it."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023481-spiced-creme-caramel"}