{"@context": "http://schema.org", "@type": "Recipe", "name": "Peppermint Saltine Toffee Bark", "description": "A cross between a cookie and candy, classic saltine toffee is made by pouring a quickly made  brown sugar caramel over a layer of salty crackers, baking it, then coating the whole thing with chocolate. This version uses a copious amount of bittersweet chocolate for the topping, which helps offset the sweetness of the toffee mixture. (Note that the higher the cacao percentage, the less sweet this treat will be.) The crushed candy cane topping makes this perfect for tucking into a holiday cookie box, but you can make it anytime of year. Toasted nuts, shredded coconut, dried fruit, colorful dragees and chopped candied ginger would all make excellent alternatives.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/12/07/multimedia/30Appe3-bark-1-4166/30Appe3-bark-1-4166-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "About 2 dozen pieces", "recipeCuisine": "", "recipeCategory": "candies, dessert", "keywords": "bittersweet chocolate, dark brown sugar, make-ahead, peppermint candy, saltine cracker, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 392}, "recipeIngredient": ["6 ounces/about 6 cups saltine crackers", "1 cup/225 grams unsalted butter", "1 1/2 packed cups/315 grams dark brown sugar", "2 teaspoons vanilla extract", "Large pinch of fine sea salt", "1 1/2 pounds chopped bittersweet chocolate (preferably around 70 percent cacao)", "2 teaspoons neutral oil, such as grapeseed or sunflower", "3/4 cup crushed candy canes (about 12 whole candy canes, see Tip)", "Flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line a 13-by-18-inch rimmed baking sheet with aluminum foil, allowing it to go up and over the edges of the pan. Line the bottom of the pan with a piece of parchment. Arrange crackers over parchment in an even layer, breaking pieces to fit as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot over medium-high heat, bring butter and sugar to a boil, whisking, until thickened and smooth, about 3 minutes. The mixture may separate, and that is OK. Stir in vanilla and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, pour mixture over crackers. Using an offset spatula, rubber spatula or even the back of a spoon, carefully spread caramel all over the crackers. (Try to keep the saltines all in one even layer.) Transfer baking sheet to oven and bake until bubbly, about 10 to 15 minutes. Transfer pan to a wire rack to cool completely before topping, at least 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour about 1 inch of water in a medium saucepan and bring to a boil. In a medium metal mixing bowl that fits on top of the saucepan, combine chocolate and oil. Place the bowl on top of the pan. (Be sure the water is not touching the bottom of the mixing bowl; if so, pour out some water.) Reduce heat to medium-low and allow the chocolate mixture to melt, stirring frequently with a rubber spatula. (Alternatively, combine chocolate and oil in a bowl and microwave in 30-second blasts, stirring in between, until melted and smooth, about 2 minutes total.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour melted chocolate on top of cooled crackers. Use an offset spatula to spread chocolate smoothly over the surface of the toffee. Immediately sprinkle the crushed candy canes on top and sprinkle with a little sea salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer baking sheet to refrigerator and chill for about an hour to set chocolate. Break saltine toffee into large pieces for storing and serving. Toffee will keep at room temperature in an airtight container for up to a week, after which it may get a little soft but still taste pretty good."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023698-peppermint-saltine-toffee-bark"}