{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Sumac Cake", "description": "In the introduction to this recipe from her cookbook, “Watermelon and Red Birds,” Nicole Taylor notes that cooks in the Mediterranean and the Middle East know the acidic tang of crimson dried powdered sumac as a kitchen staple. Sumac doesn’t get a lot of love in American kitchens, even though edible sumac species grow wild throughout America and are essential in the Indigenous American kitchen. Dr. Cynthia Greenlee wrote about how <a href=\"https://www.nytimes.com/2021/07/30/dining/black-foragers-nature-alexis-nelson.html\"> foraging is back in style</a> for a new generation of Black Americans. If you want to forage for the wild variety of sumac and dry and prepare the spice at home, the fall season is the time to do it. Look for sumac with red berry clusters, such as staghorn sumac. Be sure to avoid berries of any other color, which may be poison sumac.", "author": {"@type": "Person", "name": "Nicole Taylor"}, "image": "https://static01.nyt.com/images/2022/06/08/dining/06JuneteenthREX4-Strawberry-Sumac-Cake/merlin_207642174_32f709d5-7eff-4f62-9d4d-4ed2bc95e7d2-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "cakes, dessert", "keywords": "strawberries, sumac, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 304}, "recipeIngredient": ["1 cup chopped hulled strawberries (1-inch pieces), plus 1 cup strawberries, halved ", "1 teaspoon ground sumac", "1 teaspoon granulated sugar", "½ teaspoon almond extract", "1 cup/240 milliliters plus 1 tablespoon olive oil ", "2 cups/256 grams all-purpose flour", "1 cup/152 grams stone-ground yellow cornmeal", "½ teaspoon kosher salt (such as Diamond Crystal)", "½ teaspoon baking soda", "½ teaspoon baking powder ", "3 large eggs", "1 cup/200 grams plus 2 tablespoons/25 grams granulated sugar", "½ cup/120 milliliters half-and-half", "¼ teaspoon ground sumac"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the strawberries: Combine the chopped strawberries, sumac, sugar and almond extract in a small bowl and set aside to macerate, a process of letting the berries soften and release their juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the cake: Heat the oven to 350 degrees. Grease a 9-inch round cake pan or springform pan with 1 tablespoon olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together the flour, cornmeal, salt, baking soda and baking powder to combine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the whisk attachment or in a medium bowl using a handheld mixer, beat the eggs and 1 cup/200 grams sugar on medium-high speed until very pale and light yellow in color, about 3 minutes. The mixture should thicken and make ribbons that slowly lose their shape when they fall off the whisk attachment. With the mixer on high speed, slowly add the remaining 1 cup/240 milliliters olive oil and beat until everything is combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the speed to medium-low and slowly begin adding the dry ingredients in 3 additions, adding the half-and-half in between additions. Mix until just combined. Remove the bowl from the stand mixer and fold in the diced strawberries and their liquid. Pour the batter into the prepared pan, smoothing the top with a spatula. Arrange the halved strawberries on the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 50 to 65 minutes, until the cake is golden brown and a toothpick inserted into the center comes out clean. If the cake is becoming too brown before the center has set, cover loosely with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix the remaining 2 tablespoons/25 grams sugar with the sumac. Sprinkle the cake with the sumac sugar while still slightly warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the cake to cool in the pan on a wire rack for 20 minutes. Turn the cake out of the pan onto the rack or release the springform ring and remove it. (If using a standard cake pan, some sugar may fall off of the cake. Use parchment or wax paper to catch any stray sugar and sprinkle back over the cake.) Let cool completely before serving. Store leftover cake in an airtight container or wrapped in plastic wrap at room temperature for up to 1 day (or refrigerate up to 4 days)."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023222-strawberry-sumac-cake"}