{"@context": "http://schema.org", "@type": "Recipe", "name": "Charred Eggplant With Burrata and Fried Capers", "description": "When summer cooking feels like too much, the simple formula of grilled vegetables served with an herby dressing and a ball of burrata will get you through the season. Here, grilled or seared eggplant is bathed in an herbaceous, lemony caper-infused olive oil for a light dinner or side dish. Salt-packed capers work best, as they are generally larger and have a petal-like shape that opens up when fried, resulting in a crisp shell that is crunchy and salty (but, brined capers work, too). Make sure to dry the capers well before frying to prevent aggressive spitting when they hit hot oil. Fried capers are highly snackable, so consider making a double batch. Serve with bread, flatbread or, for something heartier, pasta.", "author": {"@type": "Person", "name": "Hetty McKinnon"}, "image": "https://static01.nyt.com/images/2022/07/14/dining/hm-grilled-eggplant/hm-grilled-eggplant-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weeknight, vegetables, appetizer, main course, side dish", "keywords": "burrata, capers, eggplant, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 517}, "recipeIngredient": ["Extra-virgin olive oil", "1/4 cup salt-packed or brined capers, rinsed", "1 1/2 to 2 pounds eggplant (about 2 medium or large), trimmed and sliced into ½-inch disks", "1 large handful of parsley, basil or a combination, finely chopped, plus more to serve", "2 garlic cloves, grated", "1 teaspoon red-pepper flakes", "Zest and juice of 1 lemon", "Kosher salt (such as Diamond Crystal) and black pepper", "2 balls burrata (about 1 pound), at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan or skillet, heat ¼ cup olive oil over medium-high until it shimmers, about 1 minute. Meanwhile, dry the capers very well by wrapping them in paper towels or a clean dish towel and wringing out the moisture. (If there is too much moisture, the oil will sputter aggressively.) Line a plate or tray with paper towels or a clean dish towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oil is ready, carefully drop the capers in and fry for 2 to 3 minutes, until golden. (Watch closely, as smaller capers will cook more quickly.) Remove the capers from the oil with a slotted spoon and drain on the lined plate. They will crisp up further as they cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the caper-infused oil to a large heatproof bowl and set aside to cool for a few minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the disks of eggplant on a large cutting board or sheet pan and drizzle with olive oil, flip over and drizzle the other side. Heat a large (12-inch) grill pan or cast-iron skillet on medium-high. (See Tip for grilling instructions.) When hot, working in batches, add the eggplant disks in a single layer and cook for 2 minutes, pressing the eggplant into the pan to encourage browning. Flip, reduce heat to medium and cook on the other side for another 2 to 3 minutes, until completely tender. (The eggplant continues to soften as it soaks up the marinade in the next step, so don’t be tempted to overcook.) Remove the eggplant from the pan and place them back on the cutting board or plate. Continue cooking the remaining eggplant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to the bowl with the cooled caper-infused oil, add the herbs, garlic, red-pepper flakes, lemon zest and juice, ½ teaspoon of kosher salt and a few pinches of black pepper. Toss to combine and taste, making sure it has enough salt. Add the warm eggplant slices to the oil and gently toss to coat. Allow to marinate for at least 5 minutes (see Tip)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve this on one large platter or as four separate servings. Place the burrata (for single servings, halve each ball of burrata) on the plate along with the eggplant and top with any remaining marinade and the fried capers, and scatter with fresh herbs."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023322-charred-eggplant-with-burrata-and-fried-capers"}