{"@context": "http://schema.org", "@type": "Recipe", "name": "Peppermint Patty Shortbreads", "description": "With chocolate ganache, peppermint-flavored marshmallow and a shortbread base, these cookies may seem like a daunting task, but each step of this recipe is simple and will result in a show stopping treat. Reminiscent of a warm cup of peppermint hot chocolate, each cookie is topped with crushed candy canes, but peppermint extract is the key to getting that minty flavor to pop. You can make the shortbread base ahead to save some time; it will stay fresh in an airtight container for up to 3 days. And to get nice peaks on the marshmallow tops, make sure it is significantly cooled before you pipe.  (This cookie is one of six cookies that you can make with this <a href=\"https://cooking.nytimes.com/recipes/1023720-butter-shortbread-dough\">Butter Shortbread Dough</a> recipe. If you make that dough, you can make a double batch of the Peppermint Patty Shortbreads or try any of the other <a href=\"https://www.nytimes.com/interactive/2022/12/04/dining/holiday-shortbread-cookie-dough-recipe.html\">five recipes</a>.)", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2022/12/07/multimedia/YK-peppermint-patty-shortbread-1-6550/YK-peppermint-patty-shortbread-1-6550-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "30 cookies", "recipeCuisine": "", "recipeCategory": "snack, project, dessert", "keywords": "christmas, christmas cookie, egg yolks, gelatin, make-ahead, peppermint candy, peppermint extract, semisweet chocolate, shortbread", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 328}, "recipeIngredient": ["1 cup/230 grams unsalted butter, at room temperature, plus more for pan", "1 cup/205 grams granulated sugar", "1 teaspoon kosher salt (such as Diamond Crystal)", "1 to 2 large egg yolks", "2 1/2 cups/320 grams all-purpose flour (see Tip)", "2 drops peppermint extract", "1 cup/200 grams granulated sugar", "1/2 cup honey", "1/2 teaspoon kosher salt (such as Diamond Crystal)", "4 teaspoons powdered gelatin", "4 ounces semisweet chocolate, chopped", "1/2 cup heavy cream", "Crushed candy canes or starlight mints, for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Line a sheet pan with parchment paper. Make the dough: In the bowl of a stand mixer fitted with the paddle attachment, combine the butter, sugar and salt. Beat on low speed until incorporated and smooth, scraping down the sides of the bowl as needed, about 3 minutes. (Do not beat until fluffy, you don’t need to incorporate air into the dough.) Add the yolk and mix until just combined. Turn the mixer off and scrape down the sides of the bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour to the bowl all at once and scrape the bottom and sides of the bowl. Turn the mixer speed to low and beat until flour is fully incorporated, scraping the bowl again if needed, about 30 seconds. The dough will be in large crumbles. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "(If you’re starting with a half batch of <a href=\"https://cooking.nytimes.com/recipes/1023720-butter-shortbread-dough\">Butter Shortbread Dough</a>, start here.) Add a drop of the peppermint extract to the dough and mix in using your hands. (If the dough feels too crumbly to come together, mix in an additional egg yolk before proceeding). Turn the dough out onto a sheet of parchment paper and pat into a 5- by 7-inch rectangle. Place another sheet of parchment over the top and roll the dough into a 1/4-inch-thick piece. Use a floured cookie cutter to stamp out the cookies, and transfer them to the prepared baking sheet, spacing at least 1/2 inch apart. You can push the dough scraps back together and reroll as many times as necessary. Bake until the cookies are light golden brown at the bottom edges, rotating the pan once halfway through baking, about 13 minutes. Transfer the cookies to a wire rack to cool completely. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the marshmallow filling: In a small saucepan, combine the sugar, honey, salt and 1/4 cup water. Stir just to incorporate. Cook without stirring over medium-high until the sugar dissolves and the temperature of the syrup reaches 240 degrees, about 5 minutes. (Use an instant read thermometer or clip a candy thermometer to the pan to get an accurate reading.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add 1/4 cup water to the bowl of a stand mixer fitted with the whisk attachment. Sprinkle in the gelatin and gently stir with a spatula to moisten the grains. Allow the gelatin to hydrate, or bloom, about 3 minutes, while the sugar mixture cooks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the sugar syrup reaches 240 degrees, and the gelatin in the bowl has bloomed, turn the mixer on low, and slowly add the sugar syrup in an even stream. Increase the speed to high and whip the mixture until the meringue is thick, holds its peaks, has doubled in volume and cooled to room temperature, 7 to 10 minutes. In the last minute of mixing, add the remaining drop of peppermint extract. Scoop the mixture into a piping bag, seal the top by twisting and set aside while you make the ganache."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the ganache: Transfer the chocolate pieces to a small heatproof bowl. In a small saucepan, heat the cream gently over low heat until it just begins to steam, 4 to 5 minutes. Pour the hot cream mixture over the chocolate pieces. Allow the chocolate and cream mixture to sit for 5 minutes. Stir until the chocolate is completely melted and the ganache is smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble: Snip the end of the piping bag to create a small opening. Pipe peaked mounds of the peppermint marshmallow mixture on the top of each cookie. If the marshmallow is running off, allow it to cool another minute or two in the bag at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip each cookie, marshmallow top down into the chocolate until the marshmallow is completely coated. Once all the cookies have been dipped, decorate with the crushed candy canes. Allow the chocolate to cool completely and set. Keep the cooled cookies at room temperature in an airtight container for up to 3 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023716-peppermint-patty-shortbreads"}